 /* RCB002M - DETERMINE MES NAME CODE                                */ 00019111
 /********************************************************************/ 00020000
 /* PROGRAM          : RCB002M                                       */ 00030000
 /*                                                                  */ 00040000
 /* LANGUAGE         : PLI                                           */ 00050000
 /*                                                                  */ 00060000
 /* TYPE             : LINKABLE MODULE                               */ 00070000
 /*                                                                  */ 00080000
 /* DESCRIPTION      : THIS PROGRAM DETERMINES WHETHER A MES ORDER   */ 00090000
 /*                    IS FOR AN INSTALLATION OR REMOVAL             */ 00100000
 /*                                                                  */ 00110000
 /* INPUT            : STATUS                                        */ 00120000
 /*                                                                  */ 00130000
 /* OUTPUT           : NAME_CODE                                     */ 00140000
 /*                                                                  */ 00150000
 /* EXTERNAL MODULES : NONE                                          */ 00160000
 /*                                                                  */ 00170000
 /* MESSAGES         : NONE                                          */ 00180000
 /*                                                                  */ 00190000
 /* DEPENDENCIES     : NONE                                          */ 00200000
 /*                                                                  */ 00210000
 /* FREQUENCY        : -                                             */ 00220000
 /*                                                                  */ 00230000
 /* MAINTENANCE LOG    :                                             */ 00240000
 /* ---------------                                                  */ 00250000
 /*                                                                  */ 00260000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00270000
 /*           |              |                                       */ 00280000
 /*  27081991 | ----         | CEDS INITIAL DEVELOPMENT              */ 00290000
 /* --------------------------------------------------------------   */ 00300000
 /*           |              |                                       */ 00310000
 /********************************************************************/ 00320000
1RCB002M: PROC (PARM_STATUS,                      /* INPUT           */ 00330000
                PTR_INT_AREA)                     /* INPUT           */ 00340000
                RETURNS (CHAR(01))                /* OUTPUT          */ 00350000
          REORDER;                                                      00360000
0DEFAULT RANGE (*)        STATIC;                                       00370000
0/********************************************************************/ 00380000
 /*  PARAMETERS                                                      */ 00390000
 /********************************************************************/ 00400000
0DCL PARM_STATUS            CHAR (01);                                  00410000
 DCL PARM_NAME_CODE         CHAR (01);                                  00420000
0DCL PTR_INT_AREA           POINTER;                                    00430000
0DCL 1 PARM_INT_AREA        BASED (PTR_INT_AREA),                       00440000
       %INCLUDE (RCBZ01S);;                                             00450000
0/********************************************************************/ 00460000
 /* EXTERNAL ENTRIES                                                 */ 00470000
 /********************************************************************/ 00480000
0DCL RCB0E1M   ENTRY  EXTERNAL;                                         00490000
0/********************************************************************/ 00500000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 00510000
 /********************************************************************/ 00520000
0DCL WRK_LEVEL                  FIXED BIN (15);                         00530000
0DCL WRK_MOD_NAME               CHAR (08)           INIT ('RCB002M');   00540000
1/********************************************************************/ 00550000
 /*  BUILTIN FUNCTIONS                                               */ 00560000
 /********************************************************************/ 00570000
0DCL NULL       BUILTIN;                                                00580000
 DCL ADDR       BUILTIN;                                                00590000
1/********************************************************************/ 00600000
 /*  ON ERROR CONDITIONS                                             */ 00610000
 /********************************************************************/ 00620000
0%INCLUDE (RCB0E0M);                                                    00630000
  END;                                                                  00640000
1/********************************************************************/ 00650000
 /*                 S T A R T   P R O C E S S I N G                  */ 00660000
 /********************************************************************/ 00670000
0                                        /* SET LEVEL AND MOD NAME   */ 00680000
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            00690000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     00700000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = WRK_MOD_NAME;                  00710000
0SELECT (PARM_STATUS);                                                  00720000
0WHEN ('0')                       /* INSTALLATION                   */  00730000
   DO;                                                                  00740000
     PARM_NAME_CODE = 'I';                                              00750000
   END;                                                                 00760000
0WHEN ('1')                       /* REMOVAL                        */  00770000
   DO;                                                                  00780000
     PARM_NAME_CODE = 'R';                                              00790000
   END;                                                                 00800000
0OTHERWISE                        /* UNDEFINED                      */  00810000
   DO;                                                                  00820000
     PARM_NAME_CODE = PARM_STATUS;                                      00830000
   END;                                                                 00840000
 END;                                                                   00850000
0                                        /* RESET LEVEL              */ 00860000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            00870000
0RETURN (PARM_NAME_CODE);                                               00880000
1/*******************************************************************/  00890000
 /* DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                    */  00900000
 /*******************************************************************/  00910000
0%INCLUDE DAIFPLH ;                   /* COMPILE DATE/TIME STAMP    */  00920000
 $DAIMOD (RCB002M);                   /* MODULE TO BE COMPILED      */  00930000
0/*******************************************************************/  00940000
 /* END OF ABR BLOCK                                                */  00950000
 /*******************************************************************/  00960000
0END RCB002M;                                                           00970000