 /* RCB0M5M - PART COMMON MSG ROUTINE                                */ 00019617
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* MODULE NAME      : RCB0M5M                                       */ 00040000
 /*                                                                  */ 00050000
 /* LANGUAGE         : PLI                                           */ 00060000
 /*                                                                  */ 00070000
 /* TYPE             : LINKABLE MODULE                               */ 00080000
 /*                                                                  */ 00090000
 /* DESCRIPTION      : THIS MODULE IS CALLED BY THE COMMON           */ 00100000
 /*                    MESSAGE ROUTINE TO CONSTRUCT AND INSERT A     */ 00110000
 /*                    MESSAGE TO: - ALTERNATE PSB                   */ 00120000
 /*                                                                  */ 00130000
 /* INPUT            : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00140000
 /*                                                                  */ 00150000
 /* OUTPUT           : - IMS  : ALTERNATE PCB                        */ 00160000
 /*                             THIS PCB IS NOT MODIFIED             */ 00170000
 /*                             DEFAULT DESTINATION IN PCB: SECNDARY */ 00180000
 /*                                                                  */ 00190000
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00200000
 /*                                                                  */ 00210000
 /* MESSAGES         : M001,M002                                     */ 00220000
 /*                                                                  */ 00230000
 /* NOTE: TARGET IS   'A'  - ALTERNATE PCB                           */ 00240000
 /*                                                                  */ 00250000
 /*  MAINTENANCE LOG :                                               */ 00260000
 /*  ---------------                                                 */ 00270000
 /*                                                                  */ 00280000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00290000
 /*  --------------------------------------------------------------  */ 00300000
 /*  02021992   | ----         | CEDS INITIAL DEVELOPMENT            */ 00310000
 /*  14-05-1993 | CEDS 2.0     | NAME CHANGE PLINCL, POINTERS ETC.   */ 00320000
 /*                                                                  */ 00330000
 /********************************************************************/ 00340000
1RCB0M5M: PROC    (PTR_TB_RCBV510,                                      00350000
                   PTR_INT_AREA)                                        00360000
          REORDER;                                                      00370000
1/********************************************************************/ 00380000
 /*  PARAMETERS                                                      */ 00390000
 /********************************************************************/ 00400000
0DCL PTR_TB_RCBV510          PTR;                                       00410000
0DCL PTR_INT_AREA            PTR;                                       00420000
1/********************************************************************/ 00430000
 /* EXTERNAL ENTRIES                                                 */ 00440000
 /********************************************************************/ 00450000
0DCL PLITDLI   ENTRY  EXTERNAL;                                         00460000
0/* DCL RCB0E1M   ENTRY  EXTERNAL; */                                   00470000
0/********************************************************************/ 00480000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 00490000
 /********************************************************************/ 00500000
0DCL 1 PARM_TB_RCBV510    BASED(PTR_TB_RCBV510),                        00510000
       %INCLUDE (RCB510S);;                                             00520000
0DCL 1 PARM_INT_AREA      BASED(PTR_INT_AREA),                          00530000
       %INCLUDE (RCBZ01S);;                                             00540000
1/********************************************************************/ 00550000
 /* IMS CONSTANTS                                                    */ 00560000
 /********************************************************************/ 00570000
0DCL 1 IMS_CONSTANTS,                                                   00580000
       %INCLUDE (RCBZ04S);;                                             00590000
1/********************************************************************/ 00600000
 /* IMS PCB STRUCTURES                                               */ 00610000
 /********************************************************************/ 00620000
0DCL 1 PCB_ALT            BASED (PARM_INT_AREA.PTR_PCB_ALT),            00630000
       %INCLUDE (RCBZ15S);;                                             00640000
0/********************************************************************/ 00650000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 00660000
 /********************************************************************/ 00670000
0DCL WRK_LEVEL              FIXED BIN (15);                             00680000
0DCL 1 WRK_MSG,                                                         00690000
       3 LL                 FIXED BIN (31),                             00700000
       3 ZZ                 CHAR (2) INIT (LOW(2)),                     00710000
       3 NEWLINE            CHAR (1) INIT ('*'),                        00720000
       3 TEXT               CHAR (650);                                 00730000
0DCL 1 MSG_SYSTEM,                                                      00740000
       %INCLUDE (RCB0M0S);,                                             00750000
       3 MSG_DESCR_SHORT     CHAR(60);                                  00760000
1/********************************************************************/ 00770000
 /*  BUILTIN FUNCTIONS                                               */ 00780000
 /********************************************************************/ 00790000
0DCL (ADDR,                                                             00800000
      LOW,                                                              00810000
      NULL,                                                             00820000
      STORAGE,                                                          00830000
      STRING)    BUILTIN;                                               00840000
1/********************************************************************/ 00850000
 /*                 S T A R T   P R O C E S S I N G                  */ 00860000
 /********************************************************************/ 00870000
0CALL RCB0M5M_INIT_COMMON;                                              00880000
0SELECT (PARM_INT_AREA.MSG_REQUEST);                                    00890000
 WHEN ('P')                                                             00900000
   DO;                                                                  00910000
     SELECT (PARM_INT_AREA.MSG_TARGET);                                 00920000
     WHEN ('A')                                                         00930000
       DO;                                                              00940000
         CALL RCB0M5M_MSG_ALT;                                          00950000
       END;                                                             00960000
     OTHERWISE                                                          00970000
       DO;                                                              00980000
0        MSG_SYSTEM.MESSAGE_NUMBER  = 'M001';                           00990000
         MSG_SYSTEM.MSG_PRIORITY    = '1';                              01000000
         MSG_SYSTEM.MSG_DESCR_SHORT = 'INVALID MSG DESTINATION '||      01010000
                                      PARM_INT_AREA.MSG_TARGET;         01020000
         WRK_MSG.TEXT = ' ';                                            01030000
         WRK_MSG.TEXT = STRING(MSG_SYSTEM);                             01040000
         WRK_MSG.LL   = STORAGE(MSG_SYSTEM) + 5;                        01050000
0        CALL PLITDLI (THREE,                                           01060000
                       ISRT,                                            01070000
                       PARM_INT_AREA.PTR_PCB_ALT,                       01080000
                       WRK_MSG);                                        01090000
         IF PCB_ALT.ST_CODE ¬= '  '                                     01100000
         THEN                                                           01110000
           CALL RCB0M5M_ERROR (ADDR(WRK_MSG),                           01120000
                               'IMS_ALT',                               01130000
                               '#001');                                 01140000
0        CALL RCB0M5M_ERROR (NULL,                                      01150000
                             'OTHER',                                   01160000
                             '#002');                                   01170000
       END;                                                             01180000
     END;                                                               01190000
   END;                                                                 01200000
 OTHERWISE                                                              01210000
   DO;                                                                  01220000
     MSG_SYSTEM.MESSAGE_NUMBER  = 'M002';                               01230000
     MSG_SYSTEM.MSG_PRIORITY    = '1';                                  01240000
     MSG_SYSTEM.MSG_DESCR_SHORT = 'INVALID OPERATION CODE '||           01250000
                                  PARM_INT_AREA.MSG_REQUEST;            01260000
     WRK_MSG.TEXT = ' ';                                                01270000
     WRK_MSG.TEXT = STRING(MSG_SYSTEM);                                 01280000
     WRK_MSG.LL   = STORAGE(MSG_SYSTEM) + 5;                            01290000
0    CALL PLITDLI (THREE,                                               01300000
                   ISRT,                                                01310000
                   PARM_INT_AREA.PTR_PCB_ALT,                           01320000
                   WRK_MSG);                                            01330000
     IF PCB_ALT.ST_CODE ¬= '  '                                         01340000
     THEN                                                               01350000
       CALL RCB0M5M_ERROR (ADDR(WRK_MSG),                               01360000
                           'IMS_ALT',                                   01370000
                           '#003');                                     01380000
0    CALL RCB0M5M_ERROR (NULL,                                          01390000
                         'OTHER',                                       01400000
                         '#004');                                       01410000
   END;                                                                 01420000
 END;                                                                   01430000
0CALL RCB0M5M_END;                                                      01440000
1/********************************************************************/ 01450000
 /*                                                                  */ 01460000
 /* MODULE NAME      : RCB0M5M_INIT_COMMON                           */ 01470000
 /*                                                                  */ 01480000
 /* DESCRIPTION      : INITIALIZE VARIABLES                          */ 01490000
 /*                                                                  */ 01500000
 /********************************************************************/ 01510000
0RCB0M5M_INIT_COMMON: PROC;                                             01520000
0                                        /* SET LEVEL AND MOD NAME   */ 01530000
 WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            01540000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     01550000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCB0M5M';                     01560000
 MSG_SYSTEM = '';                                                       01570000
0MSG_SYSTEM.MESSAGE_TYPE   = 'IS';                                      01580000
 MSG_SYSTEM.MSG_MOD_NAME   = 'RCB0M5M';                                 01590000
 MSG_SYSTEM.TEXT_G3        = ' : ';                                     01600000
0END RCB0M5M_INIT_COMMON;                                               01610000
1/********************************************************************/ 01620000
 /*                                                                  */ 01630000
 /* MODULE NAME      : RCB0M5M_MSG_ALT                               */ 01640000
 /*                                                                  */ 01650000
 /* DESCRIPTION      : CONSTRUCT AND INSERT A MESSAGE TO AN          */ 01660000
 /*                    ALTERNATE PCB                                 */ 01670000
 /*                                                                  */ 01680000
 /********************************************************************/ 01690000
0RCB0M5M_MSG_ALT: PROC;                                                 01700000
0WRK_MSG.TEXT = '';                                                     01710000
 WRK_MSG.TEXT = PARM_TB_RCBV510.DESCRIPTION_SHORT;                      01720000
 WRK_MSG.LL   = STORAGE(PARM_TB_RCBV510.DESCRIPTION_SHORT) + 5;         01730000
0CALL PLITDLI (THREE,                                                   01740000
               ISRT,                                                    01750000
               PARM_INT_AREA.PTR_PCB_ALT,                               01760000
               WRK_MSG);                                                01770000
 IF PCB_ALT.ST_CODE ¬= '  '                                             01780000
 THEN                                                                   01790000
   DO;                                                                  01800000
0    CALL RCB0M5M_ERROR (ADDR(WRK_MSG),                                 01810000
                         'IMS_ALT',                                     01820000
                         '#005');                                       01830000
   END;                                                                 01840000
0CALL PLITDLI (TWO,                                                     01850000
               PURG,                                                    01860000
               PARM_INT_AREA.PTR_PCB_ALT);                              01870000
 IF PCB_ALT.ST_CODE ¬= '  '                                             01880000
 THEN                                                                   01890000
   DO;                                                                  01900000
0    CALL RCB0M5M_ERROR (ADDR(WRK_MSG),                                 01910000
                         'IMS_ALT',                                     01920000
                         '#006');                                       01930000
   END;                                                                 01940000
0END RCB0M5M_MSG_ALT;                                                   01950000
1/********************************************************************/ 01960000
 /*                                                                  */ 01970000
 /* MODULE NAME      : RCB0M5M_END                                   */ 01980000
 /*                                                                  */ 01990000
 /* DESCRIPTION      : FINAL PROCESSING                              */ 02000000
 /*                                                                  */ 02010000
 /********************************************************************/ 02020000
0RCB0M5M_END: PROC;                                                     02030000
0                                        /* RESET LEVEL              */ 02040000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            02050000
0END RCB0M5M_END;                                                       02060000
1/********************************************************************/ 02070000
 /*                                                                  */ 02080000
 /* MODULE NAME      : RCB0M5M_ERROR                                 */ 02090000
 /*                                                                  */ 02100000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 02110000
 /*                    THE INPUT VARIABLES                           */ 02120000
 /*                                                                  */ 02130000
 /********************************************************************/ 02140000
0RCB0M5M_ERROR: PROC     (PTR_ERROR,                                    02150000
                          ERR_TYPE,                                     02160000
                          CALL_ID);                                     02170000
0DCL PTR_ERROR    PTR;                                                  02180000
 DCL ERR_TYPE     CHAR(8);                                              02190000
 DCL CALL_ID      CHAR(4);                                              02200000
0PARM_INT_AREA.PTR_ERROR      = PTR_ERROR;                              02210000
 PARM_INT_AREA.ERR_TYPE       = ERR_TYPE;                               02220000
 PARM_INT_AREA.CALL_ID        = CALL_ID;                                02230000
0/*******************************************************************/  02240000
0/* DO NOT ABEND ONLINE BECAUSE A BUILDING BLOCK MESSAGE CAN NOT    */  02250000
0/*  BE DELIVERED, SO DO NOT CALL RCB0E1M                           */  02260000
0/* CALL RCB0E1M (PTR_INT_AREA);                                    */  02270000
 /*******************************************************************/  02280000
0END RCB0M5M_ERROR;                                                     02290000
1/*******************************************************************/  02300000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  02310000
 /*******************************************************************/  02320000
0%INCLUDE DAIFPLH ;                      /* COMPILE DATE/TIME STAMP */  02330000
 $DAIMOD (RCB0M5M);                      /* MODULE TO BE COMPILED   */  02340000
0/*******************************************************************/  02350000
 /* END OF ABR BLOCK                                                */  02360000
 /*******************************************************************/  02370000
0END RCB0M5M;                                                           02380000