 /* RCB018M - CALCULATE HASH TOTAL                                   */ 00019213
 /********************************************************************/ 00020000
 /* PROGRAM          : RCB018M                                       */ 00030000
 /*                                                                  */ 00040000
 /* LANGUAGE         : PLI                                           */ 00050000
 /*                                                                  */ 00060000
 /* TYPE             : LINKABLE MODULE                               */ 00070000
 /*                                                                  */ 00080000
 /* DESCRIPTION      : THIS PROGRAM CALCULATES A HASH TOTAL          */ 00090000
 /*                                                                  */ 00100000
 /* INPUT            : FIELD TO BE ADDED TO HASH TOTAL               */ 00110000
 /*                    TYPE :CHAR, LENGTH :4                         */ 00120000
 /*                                                                  */ 00130000
 /* OUTPUT           : HASH TOTAL                                    */ 00140000
 /*                    TYPE :FD,   LENGTH :15,0                      */ 00150000
 /*                                                                  */ 00160000
 /* EXTERNAL MODULES : RCB0E1M  -  COMMON ERROR ROUTINE              */ 00170000
 /*                                                                  */ 00180000
 /* MESSAGES         : NONE                                          */ 00190000
 /*                                                                  */ 00200000
 /* DEPENDENCIES     : NONE                                          */ 00210000
 /*                                                                  */ 00220000
 /* FREQUENCY        : -                                             */ 00230000
 /*                                                                  */ 00240000
 /* MAINTENANCE LOG    :                                             */ 00250000
 /* ---------------                                                  */ 00260000
 /*                                                                  */ 00270000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00280000
 /*           |              |                                       */ 00290000
 /*  07071992 | ----         | CEDS INITIAL DEVELOPMENT              */ 00300000
 /* --------------------------------------------------------------   */ 00310000
 /*           |              |                                       */ 00320000
 /********************************************************************/ 00330000
1RCB018M: PROC (PARM_HASH_FIELD,             /* INPUT                */ 00340000
                PARM_HASH_TOTAL,             /* UPDATE               */ 00350000
                PTR_INT_AREA)                /* INPUT                */ 00360000
          REORDER;                                                      00370000
0DEFAULT RANGE (*)        STATIC;                                       00380000
0/********************************************************************/ 00390000
 /*  PARAMETERS                                                      */ 00400000
 /********************************************************************/ 00410000
0DCL PARM_HASH_FIELD              CHAR(04);                             00420000
 DCL PARM_HASH_TOTAL              FIXED DEC (15,0);                     00430000
 DCL PTR_INT_AREA                 POINTER;                              00440000
0DCL 1 PARM_INT_AREA              BASED (PTR_INT_AREA),                 00450000
       %INCLUDE (RCBZ01S);;                                             00460000
0/********************************************************************/ 00470000
 /* EXTERNAL ENTRIES                                                 */ 00480000
 /********************************************************************/ 00490000
 DCL RCB0E1M   ENTRY  EXTERNAL;                                         00500000
1/********************************************************************/ 00510000
 /*  BUILTIN FUNCTIONS                                               */ 00520000
 /********************************************************************/ 00530000
0DCL ADDR       BUILTIN;                                                00540000
 DCL NULL       BUILTIN;                                                00550000
 DCL SUBSTR     BUILTIN;                                                00560000
 DCL UNSPEC     BUILTIN;                                                00570000
1/********************************************************************/ 00580000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 00590000
 /********************************************************************/ 00600000
0DCL WRK_MOD_NAME      CHAR(08)                  INIT ('RCB018M');      00610000
0DCL WRK_LEVEL         FIXED BIN(15,0);                                 00620000
0DCL WRK_HASH_DEC      FIXED DEC(15,0);                                 00630000
1/********************************************************************/ 00640000
 /*  ON ERROR CONDITIONS                                             */ 00650000
 /********************************************************************/ 00660000
0%INCLUDE (RCB0E0M);                                                    00670000
  END;                                                                  00680000
1/********************************************************************/ 00690000
 /*                 S T A R T   P R O C E S S I N G                  */ 00700000
 /********************************************************************/ 00710000
0CALL RCB018M_INIT;                                                     00720000
0CALL RCB018M_CALCULATE_HASH;                                           00730000
0CALL RCB018M_END;                                                      00740000
1/********************************************************************/ 00750000
 /*      INITIALIZE  ALL VARIABLES                                   */ 00760000
 /********************************************************************/ 00770000
0RCB018M_INIT : PROC;                                                   00780000
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            00790000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     00800000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = WRK_MOD_NAME;                  00810000
0END RCB018M_INIT;                                                      00820000
1/********************************************************************/ 00830000
 /*      CALCULATE HASH TOTAL                                        */ 00840000
 /********************************************************************/ 00850000
0RCB018M_CALCULATE_HASH : PROC;                                         00860000
0WRK_HASH_DEC =    (5 * UNSPEC (SUBSTR (PARM_HASH_FIELD,1,1 ))) +       00870000
                   (3 * UNSPEC (SUBSTR (PARM_HASH_FIELD,2,1 ))) +       00880000
                   (2 * UNSPEC (SUBSTR (PARM_HASH_FIELD,3,1 ))) +       00890000
                        UNSPEC (SUBSTR (PARM_HASH_FIELD,4,1 ))  ;       00900000
0PARM_HASH_TOTAL = PARM_HASH_TOTAL + WRK_HASH_DEC;                      00910000
0END RCB018M_CALCULATE_HASH;                                            00920000
1/********************************************************************/ 00930000
 /*      END PROGRAM                                                 */ 00940000
 /********************************************************************/ 00950000
0RCB018M_END: PROC;                                                     00960000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            00970000
0END RCB018M_END;                                                       00980000
1/********************************************************************/ 00990000
 /*      CALL COMMON ERROR ROUTINE AFTER FILLING VARIABLES           */ 01000000
 /********************************************************************/ 01010000
0RCB018M_ERROR : PROC     (PTR_ERROR,                                   01020000
                           ERR_TYPE,                                    01030000
                           CALL_ID);                                    01040000
0DCL PTR_ERROR    POINTER;                                              01050000
 DCL ERR_TYPE     CHAR(8);                                              01060000
 DCL CALL_ID      CHAR(4);                                              01070000
0PARM_INT_AREA.PTR_ERROR      =  PTR_ERROR;                             01080000
 PARM_INT_AREA.ERR_TYPE       =  ERR_TYPE;                              01090000
 PARM_INT_AREA.CALL_ID        =  CALL_ID;                               01100000
0CALL RCB0E1M (PTR_INT_AREA);                                           01110000
0END RCB018M_ERROR;                                                     01120000
1/*******************************************************************/  01130000
 /* DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                    */  01140000
 /*******************************************************************/  01150000
0%INCLUDE DAIFPLH ;                   /* COMPILE DATE/TIME STAMP    */  01160000
 $DAIMOD (RCB018M);                   /* MODULE TO BE COMPILED      */  01170000
0/*******************************************************************/  01180000
 /* END OF ABR BLOCK                                                */  01190000
 /*******************************************************************/  01200000
0END RCB018M;                                                           01210000