 /* RCBAMIM - CHGS TO INSTALLED PRODUCTS (5) - EXTRACT (APG ONLY)    */ 00015012
 /*                                                                  */ 00020005
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030005
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040005
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050005
 /*                                                                  */ 00060005
 /********************************************************************/ 00070005
 /* PROGRAM          : RCBAMIM                                       */ 00080005
 /*                                                                  */ 00090005
 /* LANGUAGE         : PLI                                           */ 00100005
 /*                                                                  */ 00110005
 /* TYPE             : LINKABLE MODULE                               */ 00120005
 /*                                                                  */ 00130005
 /* DESCRIPTION      : THIS PROGRAM CHECKS THE INCOMING INFO         */ 00140005
 /*                    FROM AN APG  'CHGS TO INSTALLED PRODUCTS'     */ 00150005
 /*                    TRANSACTION.                                  */ 00160005
 /*                    THE TRANSACTION IS TRANSLATED INTO INTERNAL   */ 00170005
 /*                    CEDS TRANSACTIONS, WHICH ARE ADDED            */ 00180005
 /*                    TO THE CEDS ACTION FILE.                      */ 00190005
 /*                                                                  */ 00200005
 /*                    IF CSTAC ¬= '3' OR '4' AND RPGAD = 124 THEN   */ 00210005
 /*                    ONLY A REF_RCBT0110 AND A CRT_RCBT0170 RECORD */ 00220005
 /*                    WILL BE WRITTEN. (WHICH WILL DO AN O.U.       */ 00230005
 /*                    REALLOCATION)                                 */ 00240005
 /*                                                                  */ 00250005
 /*                    THE TRANSACTION WILL ONLY BE PROCESSED IF     */ 00260005
 /*                    THE PRODUCT IS REQUESTED BY CEDS.             */ 00270005
 /*                                                                  */ 00280005
 /* NOTE (1)         : IF CSTAC ¬= CSTXA THEN                        */ 00290005
 /*                       DVIAA WILL BE USED AS EFF. DATE            */ 00300005
 /*                    ELSE                                          */ 00310005
 /*                       IF RCUAF ¬= RCUAG AND RPGAD = 124 / 125    */ 00320005
 /*                          DVKXJ WILL BE USED AS EFF. DATE         */ 00330005
 /*                       ELSE                                       */ 00340005
 /*                          DVXAH WILL BE USED AS EFF. DATE         */ 00350005
 /*                                                                  */ 00360005
 /*                                                                  */ 00370005
 /* INPUT            : - APG   : TRANSACTION : 121,124,125           */ 00380005
 /*                                                                  */ 00390005
 /* OUTPUT           : 'REF_RCBT0110' RECORD                         */ 00400005
 /*                    'CRT_RCBT0110' RECORD                         */ 00410005
 /*                    'CRT_RCBT0170' RECORD                         */ 00420005
 /*                    'CRT_RCBT0190' RECORD                         */ 00430005
 /*                    'CRT_RCBT0220' RECORD                         */ 00440005
 /*                    'CRT_RCBT0300' RECORD                         */ 00450005
 /*                    'CRT_RCBT0380' RECORD                         */ 00460005
 /*                                                                  */ 00470005
 /*                  : RCBAAC0  -  CEDS ACTION FILE                  */ 00480005
 /*                                                                  */ 00490005
 /* EXTERNAL MODULES : RCB004M  -  CONVERT DATE                      */ 00500005
 /*                    RCB011M  -  DETERMINE TPWAR OR TPMNT          */ 00510005
 /*                    RCB017M  -  CHECK PRODUCT TYPE REQUESTED      */ 00520005
 /*                    RCB0E1M  -  COMMON ERROR ROUTINE              */ 00530005
 /*                    RCB0M1M  -  COMMON MESSAGE ROUTINE            */ 00540005
 /*                                                      SOC PTM1038 */ 00550005
 /*                    RCB022M  -  CHECK HOUSE KEEP DATE             */ 00560005
 /*                                                      EOC PTM1038 */ 00570005
 /*                    RCB023M  -  RETRIEVE APPLICABLE SLC   PTM1072 */ 00580005
 /*                                                                  */ 00590005
 /* MESSAGES         : 0010                                          */ 00600005
 /*                  : 0012                                          */ 00610005
 /*                  : 0170                                          */ 00620005
 /*                                                                  */ 00630005
 /* DEPENDENCIES     : -                                             */ 00640005
 /*                                                                  */ 00650005
 /* FREQUENCY        : -                                             */ 00660005
 /*                                                                  */ 00670005
 /* MAINTENANCE LOG    :                                             */ 00680005
 /* ---------------                                                  */ 00690005
 /*                                                                  */ 00700005
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00710005
 /* --------------------------------------------------------------   */ 00720005
 /*  1991-10-09 | ----         | CEDS INITIAL DEVELOPMENT            */ 00730005
 /*  1993-04-29 | RC1032       | MCO AND TABLE CHANGES               */ 00740005
 /*  1993-07-11 | PTM 341      | SEE PTM DESCRIPTION                 */ 00750005
 /*  1994-06-14 | RA01077      | REMOVED MEASUREMENT_VALUE           */ 00760005
 /*  1994-07-25 | PTM 529      | SEE PTM DESCRIPTION                 */ 00770005
 /*  1994-11-15 | RC01116      | STORE TYPE OF WARRANTY              */ 00780005
 /*  1995-09-07 | RB01140      | IMPROVE PERFORMANCE :               */ 00790005
 /*             |              | REMOVE EFFECTIVE_DATE_OU FROM T0170,*/ 00800005
 /*             |              | MOVE HW_REQUEST_CEDS TO RCBT0070    */ 00810005
 /*  1997-05-05 | PTM1038      | CORRECT NAMES                       */ 00820005
 /*  1997-10-13 | PTM1072      | RETRIEVE SLC'S FOR RENTAL AND WAR-  */ 00830005
 /*             |              |   RANTY, OTHER WED SETUP            */ 00840005
 /*  1997-10-24 | PTM1097      | YEAR 2000                           */ 00850005
 /*  2004-06-29 | RB01242      | INCREASE LENGTH OF SERIAL NUMBER    */ 00860005
 /*  2007-04-19 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY       */ 00870005
 /*             |              | MACHINES                            */ 00880005
 /*  2007-08-20 | CEDS00000336 | CHANGES TO HANDLE FLEXIBLE WARRANTY */ 00890005
 /*             |              | MACHINES WHEN THERE IS NO VALID     */ 00900005
 /*             |              | INSTALL DATE FROM WTAAS.            */ 00910005
 /*  2007-10-19 | CEDS00000352 | PERFORMANCE ISSUE OVER CEDS 3.3 QF  */ 00920005
 /*             |              | FLEXIBLE WARRANTY                   */ 00930005
 /*  2008-05-15 | CEDS00000377 | NULL VALUES FOR SLC FROM RCBT0690   */ 00940005
 /*             |              | HANDLED                             */ 00950005
 /*  2008-05-15 | CEDS00000345 | F_SPLT_DATE IS NOT ALLOWED TO       */ 00960005
 /*             |              | EXCEED WARRANTY_EXP_DATE            */ 00970005
 /*  2008-05-26 | CEDS00000399 | PERFORMANCE FIX OVER CEDS 3.3 QF    */ 00980005
 /*             |              | FLEXIBLE WARRANTY RECTIFIED         */ 00990005
 /********************************************************************/ 01000005
1RCBAMIM: PROC (PTR_RCBABNS,                                            01010005
                PTR_CTRY_CNT,                                           01020005
                PTR_INT_AREA)                                           01030005
          REORDER;                                                      01040005
0DEFAULT RANGE (*)        STATIC;                                       01050005
1/********************************************************************/ 01060005
 /*  PARAMETERS                                                      */ 01070005
 /********************************************************************/ 01080005
0DCL PTR_RCBABNS          POINTER;                                      01090005
 DCL PTR_CTRY_CNT         POINTER;                                      01100005
 DCL PTR_INT_AREA         POINTER;                                      01110005
 DCL PTR_RETURN_AREA      POINTER;                    /* SOC RB01281 */ 01120005
 DCL PTR_DATE_AREA        POINTER;             /* RCB004M DATE CHECK */ 01130005
 DCL RETCODE              FIXED BIN(31);                                01140005
 DCL 1 DATE_AREA,                                       /* DATE AREA */ 01150005
       %INCLUDE (RCBZ03S);;                           /* EOC RB01281 */ 01160005
 DCL 1 PARM_RCBABN0    BASED (PTR_RCBABNS), /* APG TRANSACTION RCRD  */ 01170005
       %INCLUDE (RRDDBNA);;                                             01180005
 DCL 1 PARM_INT_AREA   BASED (PTR_INT_AREA),                            01190005
       %INCLUDE (RCBZ01S);;                                             01200005
 DCL 1 PARM_CNT        BASED (PTR_CTRY_CNT),                            01210005
       %INCLUDE (RCBA00S1);,                                            01220005
       3 TXN_NBR,                                                       01230005
       %INCLUDE (RCBA00S2);;                                            01240005
 DCL 1 RETURN_AREA,                    /* RETURN AREA */  /* RB01281 */ 01250005
       %INCLUDE (RCBZ02S);;                               /* RB01281 */ 01260005
1/********************************************************************/ 01270005
 /* FILE DECLARATIONS (NON GSAM)                                     */ 01280005
 /********************************************************************/ 01290005
 DCL RCBAMB0  FILE RECORD INPUT;  /* TABLE 690 RECORDS- CEDS00000352 */ 01300005
0DCL RCBAAC0  FILE RECORD OUTPUT;            /* CEDS ACTION FILE     */ 01310005
0/********************************************************************/ 01320005
 /* EXTERNAL ENTRIES                                                 */ 01330005
 /********************************************************************/ 01340005
0DCL RCB004M   ENTRY  EXTERNAL;                                         01350005
 DCL RCB011M   ENTRY  EXTERNAL;                                         01360005
 DCL RCB0E1M   ENTRY  EXTERNAL;                                         01370005
 DCL RCB0M1M   ENTRY  EXTERNAL;                                         01380005
 DCL RCB017M   ENTRY  EXTERNAL;                                         01390005
 DCL RCB022M   ENTRY  EXTERNAL;                                         01400005
 DCL RCB023M   ENTRY  EXTERNAL;                           /* PTM1072 */ 01410005
 DCL RCBI50M   ENTRY  EXTERNAL;                           /* RB01281 */ 01420005
1/********************************************************************/ 01430005
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01440005
 /********************************************************************/ 01450005
0DCL 1 PARM_RCBZ02S,                        /* RETURN AREA BB        */ 01460005
     %INCLUDE (RCBZ02S);;                                               01470005
 DCL 1 PARM_RCBZ03S,                        /* RETURN AREA DATE CONV */ 01480005
     %INCLUDE (RCBZ03S);;                                               01490005
 DCL 1 PARM_RCBZ23S,                        /* RETURN AREA RCB011M   */ 01500005
     %INCLUDE (RCBZ23S);;                                               01510005
 DCL 1 PARM_RCBZ32S,                        /* RETURN AREA RCB023M   */ 01520005
     %INCLUDE (RCBZ32S);;                                 /* PTM1072 */ 01530005
                                                      /* SOC RB01281 */ 01540005
 /********************************************************************/ 01550005
 /* DB2 TABLE STRUCTURES                                             */ 01560005
 /********************************************************************/ 01570005
 DCL PTR_RCBV500    POINTER;           /* PTR PARAMETER ROW          */ 01580005
 DCL PTR_RCBV500I   POINTER;           /* PTR NULL-IND. PARAMETER    */ 01590005
 DCL 1 TB_RCBV500,                     /* PARAMETER ROW              */ 01600005
         %INCLUDE (RCB500S);;                                           01610005
 DCL 1 TB_RCBV500_I,                   /* NULL-IND. PARAMETER        */ 01620005
         %INCLUDE (RCB500SI);;                                          01630005
 DCL 1 FILE_RCBAMB0,        /* SORTED UNLOAD FILE */ /* CEDS00000352 */ 01640005
      %INCLUDE (RCBBCAS);;                           /* CEDS00000352 */ 01650005
                                                      /* EOC RB01281 */ 01660005
1/********************************************************************/ 01670005
 /*  RECORD STRUCTURES FOR OUTPUT FILES                              */ 01680005
 /********************************************************************/ 01690005
0DCL 1 REC_HEADER,                                                      01700005
       %INCLUDE (RCBAACS);,                                             01710005
       3 TXN_NBR,                                                       01720005
       %INCLUDE (RCBA00S2);,                                            01730005
       3 UPSTR_INFO,                                                    01740005
       %INCLUDE (RCBA00S3);;                           /* PTM 529 */    01750005
 DCL 1 REC_TRAILER,                                                     01760005
       %INCLUDE (RCBAACS);,                                             01770005
       3 TXN_NBR,                                                       01780005
       %INCLUDE (RCBA00S2);;                                            01790005
 DCL 1 REC_REF0110,                                                     01800005
       %INCLUDE (RCBAACS);,                                             01810005
       %INCLUDE (RCB110S);,                                             01820005
       %INCLUDE (RCB110SI);;                                            01830005
 DCL 1 REC_CRT0110,                                                     01840005
       %INCLUDE (RCBAACS);,                                             01850005
       %INCLUDE (RCB110S);,                                             01860005
       %INCLUDE (RCB110SI);;                                            01870005
 DCL 1 REC_CRT0170,                                                     01880005
       %INCLUDE (RCBAACS);,                                             01890005
       %INCLUDE (RCB170S);,                                             01900005
       %INCLUDE (RCB170SI);;                                            01910005
 DCL 1 REC_CRT0190,                                                     01920005
       %INCLUDE (RCBAACS);,                                             01930005
       %INCLUDE (RCB190S);,                                             01940005
       %INCLUDE (RCB190SI);;                                            01950005
 DCL 1 REC_UPD0190,                                                     01960005
       %INCLUDE (RCBAACS);,                                             01970005
       %INCLUDE (RCB190S);,                                             01980005
       %INCLUDE (RCB190SI);;                                            01990005
 DCL 1 REC_CRT0220,                                                     02000005
       %INCLUDE (RCBAACS);,                                             02010005
       %INCLUDE (RCB220S);,                                             02020005
       %INCLUDE (RCB220SI);;                                            02030005
 DCL 1 REC_CRT0300,                                                     02040005
       %INCLUDE (RCBAACS);,                                             02050005
       %INCLUDE (RCB300S);,                                             02060005
       %INCLUDE (RCB300SI);;                                            02070005
 DCL 1 REC_CRT0380,                                                     02080005
       %INCLUDE (RCBAACS);,                                             02090005
       %INCLUDE (RCB380S);,                                             02100005
       %INCLUDE (RCB380SI);;                                            02110005
1/********************************************************************/ 02120005
 /*  POINTERS                                                        */ 02130005
 /********************************************************************/ 02140005
0DCL PTR_RCBZ02S                POINTER;                                02150005
 DCL PTR_RCBZ03S                POINTER;                                02160005
 DCL PTR_RCBZ23S                POINTER;                                02170005
 DCL PTR_RCBZ24S                POINTER;                                02180005
                                                      /* SOC RB01281 */ 02190005
 /********************************************************************/ 02200005
 /*  PROGRAM CONTROL PARAMETERS                                      */ 02210005
 /********************************************************************/ 02220005
 DCL 1 TB_RCB063        BASED(PTR_RCBV500),     /* FLEXIBLE WARRANTY */ 02230005
       %INCLUDE (RCBP63S);;                           /* EOC RB01281 */ 02240005
1/********************************************************************/ 02250005
 /*  BIT SWITCHES                                                    */ 02260005
 /********************************************************************/ 02270005
0DCL SWITCH_0380_CHANGED BIT (1);                                       02280005
 DCL SWITCH_EMPTY_T690   BIT (1)   INIT ('0'B); /* SOC CEDS00000352 */  02290005
 DCL EOF_RCBAMB0         BIT (1)   INIT ('0'B);                         02300005
0DCL TRUE                BIT (1)   INIT ('1'B);                         02310005
 DCL FALSE               BIT (1)   INIT ('0'B); /* EOC CEDS00000352 */  02320005
1/********************************************************************/ 02330005
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 02340005
 /********************************************************************/ 02350005
0DCL WRK_LEVEL                  FIXED BIN (15);                         02360005
 DCL WRK_MOD_NAME               CHAR (08)        INIT ('RCBAMIM');      02370005
 DCL WRK_ORIGIN                 CHAR (02);                              02380005
 DCL WRK_SEQUENCE_NUMBER        CHAR (28);                              02390005
 DCL WRK_HW_REQUEST_CEDS        CHAR (01);                              02400005
 DCL WRK_RCBT0070_EFF_DATE      CHAR (10);             /* RB01140    */ 02410005
 DCL WRK_TXN_DATE               CHAR (10);                              02420005
 DCL WRK_EFFECTIVE_DATE         CHAR (10);                              02430005
 DCL WRK_HKP_DATE               CHAR (10);                              02440005
 DCL WRK_DATE_PIC_YYDDD         PIC '99999';                            02450005
 DCL WRK_WARRANTY_EXP_DATE      CHAR (10);                              02460005
 DCL 1 WRK_TPMNT,                                     /* SOC PTM1072 */ 02470005
     %INCLUDE(RCBZ99S);;                                                02480005
 DCL WRK_HI3                    CHAR(3);              /* EOC PTM1072 */ 02490005
 DCL WRK_LOW3                   CHAR(3);              /* SOC RB01281 */ 02500005
 DCL WRK_F_TOW                  CHAR(01) INIT('');                      02510005
 DCL WRK_F_SPLT_DATE            CHAR (10);                              02520005
 DCL SWITCH_F_SLC               BIT (01)  INIT ('0'B);                  02530005
 DCL WRK_F_TYPE_OF_WARRANTY     BIT (01) INIT('0'B);  /* EOC RB01281 */ 02540005
 DCL WRK_VALID_INST_DATE     BIT (1)    INIT ('1'B); /* CEDS00000336 */ 02550005
 DCL I,J,K               FIXED BIN(31)   INIT(0);/* SOC CEDS00000352 */ 02560005
 DCL 1 T690_ARRAY(REC_COUNT) CTL,                                       02570005
        2 A_COUNTRY    CHAR(3),                                         02580005
        2 A_TYPE       CHAR(4),                                         02590005
        2 A_MODEL      CHAR(3),                                         02600005
        2 A_B_W_MNTHS  DEC FIXED(3,0),                                  02610005
        2 A_SLC_NULLIND CHAR(1),                     /* CEDS00000377 */ 02620005
        2 A_SLC        CHAR(3),                                         02630005
        2 A_EFF_DATE   CHAR(10),                                        02640005
        2 A_END_DATE   CHAR(10);                                        02650005
 /********************************************************************/ 02660005
 /* ON ENDFILE                                                       */ 02670005
 /********************************************************************/ 02680005
 ON ENDFILE (RCBAMB0)                                                   02690005
   BEGIN;                                                               02700005
     EOF_RCBAMB0 = TRUE;                                                02710005
   END;                                                                 02720005
0/********************************************************************/ 02730005
 /*  COUNTS                                                          */ 02740005
 /********************************************************************/ 02750005
 DCL REC_COUNT           FIXED BIN(31)   INIT(0);/* EOC CEDS00000352 */ 02760005
1/********************************************************************/ 02770005
 /*  BUILTIN FUNCTIONS                                               */ 02780005
 /********************************************************************/ 02790005
0DCL ADDR       BUILTIN;                                                02800005
 DCL NULL       BUILTIN;                                                02810005
 DCL SUBSTR     BUILTIN;                                                02820005
 DCL HIGH       BUILTIN;                                                02830005
 DCL VERIFY     BUILTIN;                                                02840005
1/********************************************************************/ 02850005
 /*  ON ERROR CONDITIONS                                             */ 02860005
 /********************************************************************/ 02870005
0%INCLUDE (RCB0E0M);                                                    02880005
  END;                                                                  02890005
1/********************************************************************/ 02900005
 /*                 S T A R T   P R O C E S S I N G                  */ 02910005
 /*                                                                  */ 02920005
 /*                 PROCESSING WILL ONLY TAKE PLACE                  */ 02930005
 /*                 IF CSTAC = '3' OR '4' OR RPGAD = 124 AND         */ 02940005
 /*                 THE PRODUCT IS REQUESTED BY CEDS.                */ 02950005
 /*                                                                  */ 02960005
 /********************************************************************/ 02970005
0CALL RCBAMIM_INIT_COMMON;                                              02980005
 IF (PARM_RCBABN0.CSTAC = '3' | PARM_RCBABN0.CSTAC = '4' |              02990005
     PARM_RCBABN0.RPGAD = 124)                                          03000005
 THEN                                                                   03010005
   DO;                                                                  03020005
     CALL RCBAMIM_INIT_PROCESS;                                         03030005
     CALL RCBAMIM_CHECK_REQUESTED;                                      03040005
     IF WRK_HW_REQUEST_CEDS = '1'                                       03050005
     THEN                                                               03060005
       DO;                                                              03070005
         IF PARM_RCBABN0.CSTAC = '3' | PARM_RCBABN0.CSTAC = '4'         03080005
         THEN                                                           03090005
           DO;                                                          03100005
             CALL RCBAMIM_WRITE_HEADER;                                 03110005
             CALL RCBAMIM_CREATE_REF0110;                               03120005
             CALL RCBAMIM_WRITE_REF0110;                                03130005
             IF PARM_RCBABN0.CSTAC ¬= PARM_RCBABN0.CSTXA                03140005
             THEN                                                       03150005
               DO;                              /* CHANGE STATUS     */ 03160005
                 CALL RCBAMIM_CREATE_CRT0110;                           03170005
                 CALL RCBAMIM_WRITE_CRT0110;                            03180005
               END;                                                     03190005
             IF PARM_RCBABN0.RBOXD || PARM_RCBABN0.RLCAD ¬=             03200005
                PARM_RCBABN0.RBOXC || PARM_RCBABN0.RLCAC                03210005
             THEN                                                       03220005
               DO;                              /* CHANGE O.U.       */ 03230005
                 CALL RCBAMIM_CREATE_CRT0170;                           03240005
                 CALL RCBAMIM_WRITE_CRT0170;                            03250005
               END;                                                     03260005
             IF PARM_RCBABN0.RCUAF ¬= PARM_RCBABN0.RCUAC |              03270005
                PARM_RCBABN0.RCUAG ¬= PARM_RCBABN0.RCUXA                03280005
             THEN                                                       03290005
               DO;                                                      03300005
                 CALL RCBAMIM_CREATE_UPD0190;      /* CLOSE THE OWNER */03310005
                 CALL RCBAMIM_WRITE_UPD0190;                            03320005
                 IF PARM_RCBABN0.RCUAF ¬= PARM_RCBABN0.RCUAC            03330005
                 THEN                                                   03340005
                   DO;                           /* CHANGE CUST. USER */03350005
                     CALL RCBAMIM_CREATE_CRT0190 ('U');                 03360005
                     CALL RCBAMIM_WRITE_CRT0190;                        03370005
                   END;                                                 03380005
                 IF PARM_RCBABN0.RCUAG ¬= PARM_RCBABN0.RCUAF &          03390005
                    PARM_RCBABN0.RCUAG ¬= ' '                           03400005
                 THEN                                                   03410005
                   DO;                                                  03420005
                     CALL RCBAMIM_CREATE_CRT0190 ('O');                 03430005
                     CALL RCBAMIM_WRITE_CRT0190;                        03440005
                   END;                                                 03450005
               END;                                                     03460005
                                               /* RECORD WC / TPMNT  */ 03470005
             CALL RCBAMIM_CREATE_CRT0220;                               03480005
             IF REC_CRT0220.TYPE_OF_WARRANTY = '' /* CREATED 220     */ 03490005
             THEN                                /* INDICATES NO WAR */ 03500005
               DO;                                    /* SOC PTM1072 */ 03510005
                 IF VERIFY(REC_CRT0220.TYPE_OF_MAINT,TPMNT_ST1)=0       03520005
                 THEN DO;                                               03530005
                   PARM_RCBZ32S.INAREA = REC_CRT0220, BY NAME;          03540005
                   PARM_RCBZ32S.MODEL = PARM_RCBABN0.CMMAB;             03550005
                   PARM_RCBZ32S.END_DATE = REC_CRT0220.END_DATE;        03560005
                   CALL RCB023M(ADDR(PARM_RCBZ32S),                     03570005
                                PTR_INT_AREA);                          03580005
                   IF PARM_RCBZ32S.SERVICE_LVL_CODE_1 ¬= WRK_HI3        03590005
                   THEN DO;                                             03600005
                     REC_CRT0220.SERVICE_LVL_CODE =                     03610005
                                       PARM_RCBZ32S.SERVICE_LVL_CODE_1; 03620005
                     REC_CRT0220.INDNULL(7) = 0;                        03630005
                   END;                                                 03640005
                 END;                                 /* EOC PTM1072 */ 03650005
                 CALL RCBAMIM_WRITE_CRT0220;                            03660005
               END;                                                     03670005
             ELSE                          /* IT INDICATES WARRANTY  */ 03680005
               DO;                         /* CALCULATE WED AND SLC'S*/ 03690005
                                                      /* SOC PTM1072 */ 03700005
                 PARM_RCBZ32S.INAREA = REC_CRT0220, BY NAME;            03710005
                 PARM_RCBZ32S.MODEL = PARM_RCBABN0.CMMAB;               03720005
                 PARM_RCBZ32S.END_DATE = REC_CRT0220.END_DATE;          03730005
                 PARM_RCBZ32S.TYPE_OF_WARRANTY =                        03740005
                                        REC_CRT0220.TYPE_OF_WARRANTY;   03750005
                 CALL RCB023M(ADDR(PARM_RCBZ32S),                       03760005
                              PTR_INT_AREA);                            03770005
                 IF REC_CRT0220.END_DATE = '' /* NO WED FROM SOF */     03780005
                 THEN DO;                                               03790005
                   IF PARM_RCBZ32S.END_DATE = ''                        03800005
                   THEN                                                 03810005
                     PARM_RCBZ32S.END_DATE =                            03820005
                                PARM_RCBZ32S.EFFECTIVE_DATE;            03830005
                   REC_CRT0220.END_DATE = PARM_RCBZ32S.END_DATE;        03840005
                   REC_CRT0220.WARRANTY_EXP_DATE =                      03850005
                                             PARM_RCBZ32S.END_DATE;     03860005
                   WRK_WARRANTY_EXP_DATE = PARM_RCBZ32S.END_DATE;       03870005
                 END;                                  /* EOC PTM1072 */03880005
                                             /* CHECK WED >= HK. DATE */03890005
                 CALL RCB022M (ADDR (PARM_RCBABN0.RCYAA), /* CTRYNO  */ 03900005
                               ADDR (REC_CRT0220.END_DATE), /* WED   */ 03910005
                               ADDR (WRK_HKP_DATE),                     03920005
                               PTR_INT_AREA);                           03930005
                 IF WRK_HKP_DATE = ''        /* I.E. WED >= HK. DATE */ 03940005
                 THEN                                                   03950005
                   DO;                                /* SOC PTM1072 */ 03960005
                     CALL RCBAMIM_DET_WAR_SLC; /* SET UP THE SLC(S)  */ 03970005
                   END;                               /* EOC PTM1072 */ 03980005
               END;                                                     03990005
             IF PARM_RCBABN0.CMMAB ¬= PARM_RCBABN0.CMMXA                04000005
             THEN                                                       04010005
               DO; /* CHANGE MODEL       */                             04020005
                 CALL RCBAMIM_CREATE_CRT0300;                           04030005
                 CALL RCBAMIM_WRITE_CRT0300;                            04040005
               END;                                                     04050005
             CALL RCBAMIM_CREATE_CRT0380;                               04060005
             IF SWITCH_0380_CHANGED                                     04070005
             THEN                                                       04080005
               DO; /* CHANGE MOD. INFO   */                             04090005
                 CALL RCBAMIM_WRITE_CRT0380;                            04100005
               END;                                                     04110005
             CALL RCBAMIM_WRITE_TRAILER;                                04120005
           END;                                                         04130005
         ELSE                                 /* CSTAC ¬= '3' OR '4' */ 04140005
           DO;                                /* TXN = 124           */ 04150005
             IF PARM_RCBABN0.RBOXD || PARM_RCBABN0.RLCAD ¬=             04160005
                PARM_RCBABN0.RBOXC || PARM_RCBABN0.RLCAC                04170005
             THEN                                                       04180005
               DO;                                                      04190005
                 CALL RCBAMIM_WRITE_HEADER;                             04200005
                 CALL RCBAMIM_CREATE_REF0110;                           04210005
                 CALL RCBAMIM_WRITE_REF0110;                            04220005
                 CALL RCBAMIM_CREATE_CRT0170;   /* CHANGE O.U.       */ 04230005
                 CALL RCBAMIM_WRITE_CRT0170;                            04240005
                 CALL RCBAMIM_WRITE_TRAILER;                            04250005
               END;                                                     04260005
           END;                                                         04270005
       END;                                                             04280005
   END;                                                                 04290005
 CALL RCBAMIM_END_PGM;                                                  04300005
1/********************************************************************/ 04310005
 /*      CREATE A REF_RCBT0110 RECORD                                */ 04320005
 /********************************************************************/ 04330005
0RCBAMIM_CREATE_REF0110 : PROC;                                         04340005
                                                                        04350005
 REC_REF0110.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              04360005
 REC_REF0110.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              04370005
 REC_REF0110.REC_ID.TABLE_NUMBER    = '0110';                           04380005
 REC_REF0110.REC_ID.ACTION          = 'R';                              04390005
 REC_REF0110.REC_ID.SOURCE_SYSTEM   = 'S';                              04400005
 REC_REF0110.REC_ID.PROCESS_TYPE    = 'M';                              04410005
 REC_REF0110.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               04420005
                                                                        04430005
 REC_REF0110.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               04440005
 REC_REF0110.ORIGIN                 = WRK_ORIGIN;                       04450005
 REC_REF0110.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              04460005
 REC_REF0110.COUNTRY_NUMBER         =  PARM_RCBABN0.RCYAA;              04470005
 REC_REF0110.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               04480005
                                                                        04490005
 END RCBAMIM_CREATE_REF0110;                                            04500005
1/********************************************************************/ 04510005
 /*      CREATE A CRT_RCBT0110 RECORD                                */ 04520005
 /********************************************************************/ 04530005
0RCBAMIM_CREATE_CRT0110 : PROC;                                         04540005
                                                                        04550005
 REC_CRT0110.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              04560005
 REC_CRT0110.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              04570005
 REC_CRT0110.REC_ID.TABLE_NUMBER    = '0110';                           04580005
 REC_CRT0110.REC_ID.ACTION          = 'I';                              04590005
 REC_CRT0110.REC_ID.SOURCE_SYSTEM   = 'S';                              04600005
 REC_CRT0110.REC_ID.PROCESS_TYPE    = 'M';                              04610005
 REC_CRT0110.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               04620005
                                                                        04630005
 REC_CRT0110.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               04640005
 REC_CRT0110.ORIGIN                 = WRK_ORIGIN;                       04650005
 REC_CRT0110.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              04660005
 REC_CRT0110.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               04670005
 REC_CRT0110.INDNULL (04)           = 0;                                04680005
 REC_CRT0110.STATUS                 = PARM_RCBABN0.CSTAC;               04690005
 REC_CRT0110.INDNULL (05)           = 0;                                04700005
 REC_CRT0110.SOURCE_INDICATOR       = 'S';                              04710005
 REC_CRT0110.INDNULL (06)           = 0;                                04720005
 REC_CRT0110.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               04730005
 REC_CRT0110.END_DATE               = '9999-12-31';                     04740005
                                                                        04750005
 END RCBAMIM_CREATE_CRT0110;                                            04760005
1/********************************************************************/ 04770005
 /*      CREATE A CRT_RCBT0170 RECORD                                */ 04780005
 /********************************************************************/ 04790005
0RCBAMIM_CREATE_CRT0170 : PROC;                                         04800005
                                                                        04810005
 REC_CRT0170.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              04820005
 REC_CRT0170.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              04830005
 REC_CRT0170.REC_ID.TABLE_NUMBER    = '0170';                           04840005
 REC_CRT0170.REC_ID.ACTION          = 'I';                              04850005
 REC_CRT0170.REC_ID.SOURCE_SYSTEM   = 'S';                              04860005
 REC_CRT0170.REC_ID.PROCESS_TYPE    = 'M';                              04870005
 REC_CRT0170.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               04880005
                                                                        04890005
 REC_CRT0170.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               04900005
 REC_CRT0170.OU_CODE                = PARM_RCBABN0.RBOXD ||             04910005
                                      PARM_RCBABN0.RLCAD;               04920005
 REC_CRT0170.INDNULL (02)           = 0;                                04930005
 REC_CRT0170.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               04940005
 REC_CRT0170.ORIGIN                 = WRK_ORIGIN;                       04950005
 REC_CRT0170.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              04960005
 REC_CRT0170.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               04970005
 REC_CRT0170.END_DATE               = '9999-12-31';                     04980005
                                                                        04990005
 END RCBAMIM_CREATE_CRT0170;                                            05000005
1/********************************************************************/ 05010005
 /*      CREATE A DEL_RCBT0190 RECORD                                */ 05020005
 /********************************************************************/ 05030005
0RCBAMIM_CREATE_UPD0190 : PROC;                                         05040005
                                                                        05050005
 DCL TYPE_OF_RELATION   CHAR (01);                                      05060005
                                                                        05070005
 REC_UPD0190.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              05080005
 REC_UPD0190.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              05090005
 REC_UPD0190.REC_ID.TABLE_NUMBER    = '0190';                           05100005
 REC_UPD0190.REC_ID.ACTION          = 'U';                              05110005
 REC_UPD0190.REC_ID.SOURCE_SYSTEM   = 'S';                              05120005
 REC_UPD0190.REC_ID.PROCESS_TYPE    = 'M';                              05130005
 REC_UPD0190.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               05140005
                                                                        05150005
 REC_UPD0190.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               05160005
 REC_UPD0190.ORIGIN                 = WRK_ORIGIN;                       05170005
 REC_UPD0190.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              05180005
 REC_UPD0190.COUNTRY_NUMBER         =  PARM_RCBABN0.RCYAA;              05190005
 REC_UPD0190.TYPE_OF_RELATION       = 'O';                              05200005
 REC_UPD0190.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               05210005
 REC_UPD0190.END_DATE               = WRK_EFFECTIVE_DATE;               05220005
 REC_UPD0190.INDNULL (11)           = 0;                                05230005
                                                                        05240005
 END RCBAMIM_CREATE_UPD0190;                                            05250005
1/********************************************************************/ 05260005
 /*      CREATE A CRT_RCBT0190 RECORD                                */ 05270005
 /********************************************************************/ 05280005
0RCBAMIM_CREATE_CRT0190 : PROC (TYPE_OF_RELATION);                      05290005
                                                                        05300005
 DCL TYPE_OF_RELATION   CHAR (01);                                      05310005
                                                                        05320005
 REC_CRT0190.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              05330005
 REC_CRT0190.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              05340005
 REC_CRT0190.REC_ID.TABLE_NUMBER    = '0190';                           05350005
 REC_CRT0190.REC_ID.ACTION          = 'I';                              05360005
 REC_CRT0190.REC_ID.SOURCE_SYSTEM   = 'S';                              05370005
 REC_CRT0190.REC_ID.PROCESS_TYPE    = 'M';                              05380005
 REC_CRT0190.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               05390005
                                                                        05400005
 REC_CRT0190.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               05410005
 REC_CRT0190.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               05420005
 REC_CRT0190.ORIGIN                 = WRK_ORIGIN;                       05430005
 REC_CRT0190.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              05440005
 REC_CRT0190.TYPE_OF_RELATION       = TYPE_OF_RELATION;                 05450005
 REC_CRT0190.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               05460005
 REC_CRT0190.END_DATE               = '9999-12-31';                     05470005
 REC_CRT0190.INDNULL (05)           = 0;             /* CUNO CHANGED */ 05480005
 IF TYPE_OF_RELATION = 'U'                                              05490005
 THEN                                                                   05500005
   REC_CRT0190.CUSTOMER_NUMBER = '00' || PARM_RCBABN0.RCUAF;            05510005
 ELSE                                                                   05520005
   REC_CRT0190.CUSTOMER_NUMBER = '00' || PARM_RCBABN0.RCUAG;            05530005
                                                                        05540005
 END RCBAMIM_CREATE_CRT0190;                                            05550005
1/********************************************************************/ 05560005
 /*      CREATE A CRT_RCBT0220 RECORD                                */ 05570005
 /*      IF CMCAB(SEE NOTE) INDICATES A TYPE OF WARRANTY (DETERMINED */ 05580005
 /*      BY RCB011M).                                                */ 05590005
 /*      IF THE WED (DVWAB) IS NOT GIVEN THEN IT WILL BE             */ 05600005
 /*      CALCULATED BY RCB012M.                                      */ 05610005
 /*                                                                  */ 05620005
 /*      IF TYPE OF MAINTENANCE IS FILLED THEN TYPE OF WARRANTY WILL */ 05630005
 /*      NOT BE FILLED, SO ITS INDNULL (06) MUST BE SET TO -1.       */ 05640005
 /*                                                                  */ 05650005
 /*      IF TYPE OF WARRANTY IS FILLED THEN TYPE OF MAINTENANCE WILL */ 05660005
 /*      NOT BE FILLED, SO ITS INDNULL (05) MUST BE SET TO -1.       */ 05670005
 /*                                                                  */ 05680005
 /* NOTE:                                                            */ 05690005
 /*      IF CMCXD NOT BLANK THEN THE VALUE OF CMCXD WILL BE TAKEN    */ 05700005
 /*      INSTEAD OF CMCAB.                                           */ 05710005
 /*                                                                  */ 05720005
 /********************************************************************/ 05730005
0RCBAMIM_CREATE_CRT0220 : PROC;                                         05740005
                                                                        05750005
 WRK_F_TYPE_OF_WARRANTY             = FALSE;         /* CEDS00000336 */ 05760005
                                                                        05770005
 REC_CRT0220.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              05780005
 REC_CRT0220.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              05790005
 REC_CRT0220.REC_ID.TABLE_NUMBER    = '0220';                           05800005
 REC_CRT0220.REC_ID.ACTION          = 'I';                              05810005
 REC_CRT0220.REC_ID.SOURCE_SYSTEM   = 'S';                              05820005
 REC_CRT0220.REC_ID.PROCESS_TYPE    = 'M';                              05830005
 REC_CRT0220.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               05840005
                                                                        05850005
 REC_CRT0220.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               05860005
 REC_CRT0220.ORIGIN                 = WRK_ORIGIN;                       05870005
 REC_CRT0220.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              05880005
 REC_CRT0220.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               05890005
 REC_CRT0220.SERVICE_LVL_CODE       = '';             /* SOC PTM1072 */ 05900005
 REC_CRT0220.INDNULL(7)             = -1;             /* EOC PTM1072 */ 05910005
 PARM_RCBZ23S.CUSTOMER_NUMBER       = PARM_RCBABN0.RCUAF;               05920005
0IF PARM_RCBABN0.CMCXD ¬= ' '                                           05930005
 THEN                                                                   05940005
   PARM_RCBZ23S.VALUE               = PARM_RCBABN0.CMCXD;               05950005
 ELSE                                                                   05960005
   PARM_RCBZ23S.VALUE               = PARM_RCBABN0.CMCAB;               05970005
 CALL RCB011M (PTR_RCBZ23S,                                             05980005
               PTR_INT_AREA);                                           05990005
 IF PARM_RCBZ23S.TPMNT_DEFAULTED     /* ISSUE DEFAULTED MESSAGE      */ 06000005
 THEN                                                                   06010005
   DO;                                                                  06020005
     CALL RCBAMIM_ISSUE_MSG_0010;                                       06030005
   END;                                                                 06040005
 IF PARM_RCBZ23S.TPMNT_IND           /* IT WAS A TYPE OF MAINTENANCE */ 06050005
 THEN                                                                   06060005
   DO;                                                                  06070005
     REC_CRT0220.TYPE_OF_MAINT = PARM_RCBZ23S.TPMNT_WAR_VALUE;          06080005
     REC_CRT0220.END_DATE      = '9999-12-31';                          06090005
     REC_CRT0220.INDNULL (06)  = -1;            /* TYPE OF WARRANTY  */ 06100005
     REC_CRT0220.INDNULL (08)  = -1;            /* WARRANTY EXP DATE */ 06110005
     REC_CRT0220.F_TYPE_OF_WARRANTY     = '';         /* SOC RB01281 */ 06120005
     REC_CRT0220.INDNULL(13)            = -1;                           06130005
     REC_CRT0220.F_SPLT_DATE            = '';                           06140005
     REC_CRT0220.INDNULL(14)            = -1;         /* EOC RB01281 */ 06150005
   END;                                                                 06160005
 ELSE                                /* IT WAS A TYPE OF WARRANTY    */ 06170005
   DO;                                                     /* RC01116 */06180005
     REC_CRT0220.TYPE_OF_WARRANTY = PARM_RCBZ23S.TPMNT_WAR_VALUE;       06190005
     REC_CRT0220.INDNULL (05)     = -1;                                 06200005
     IF PARM_RCBABN0.DVWAB ¬= 0      /* WED WAS GIVEN                */ 06210005
     THEN                                                               06220005
       DO;                                            /* SOC PTM1097 */ 06230005
         PARM_RCBZ03S.WD_IN_FORMAT  = 'YYDDD';        /* CONVERT WED */ 06240005
         PARM_RCBZ03S.WD_OUT_FORMAT = 'ISO';                            06250005
         PARM_RCBZ03S.WD_FUNCTION   = 'C';                              06260005
         WRK_DATE_PIC_YYDDD         =  PARM_RCBABN0.DVWAB;              06270005
         PARM_RCBZ03S.WD_IN_DATE    =  WRK_DATE_PIC_YYDDD;              06280005
         CALL RCB004M (PTR_RCBZ03S);                                    06290005
         IF PARM_RCBZ03S.WD_STATUS = ' '                                06300005
         THEN                                                           06310005
           DO;                                                          06320005
             WRK_WARRANTY_EXP_DATE =                                    06330005
                         SUBSTR (PARM_RCBZ03S.WD_OUT_DATE,1,10);        06340005
           END;                                                         06350005
         ELSE                                                           06360005
           DO;                                                          06370005
             CALL RCBAMIM_INVALID_DATE_MSG (PARM_RCBZ03S.WD_STATUS,     06380005
                                            WRK_DATE_PIC_YYDDD);        06390005
             CALL RCBAMIM_ERROR (NULL,                                  06400005
                                'OTHER',                                06410005
                                '#001');                                06420005
           END;                                                         06430005
                                                                        06440005
         IF WRK_WARRANTY_EXP_DATE < WRK_EFFECTIVE_DATE /* = DVIAA OR  */06450005
                                                       /*   DVKXJ OR  */06460005
                                                       /*   DVXAH     */06470005
         THEN                                                           06480005
           DO;                                                          06490005
             WRK_WARRANTY_EXP_DATE = WRK_EFFECTIVE_DATE;                06500005
           END;                                                         06510005
                                                                        06520005
         REC_CRT0220.WARRANTY_EXP_DATE = WRK_WARRANTY_EXP_DATE;         06530005
         REC_CRT0220.END_DATE = WRK_WARRANTY_EXP_DATE; /* EOC PTM1097 */06540005
       END;                           /* WED WAS GIVEN                */06550005
     ELSE                             /* CALCULATE WED                */06560005
       DO;                                                 /* RC01116 */06570005
         /* BLANK ENDDATE SO RCB023M WILL CALCULATE WED       PTM1072 */06580005
         REC_CRT0220.END_DATE = '';                                     06590005
       END;                                                             06600005
     IF SWITCH_EMPTY_T690 = FALSE                     /* CEDS00000352 */06610005
     THEN                                             /* CEDS00000352 */06620005
       CALL RCBAMIM_RETRIEVE_FLEX_WARR;                /* SOC RB01281 */06630005
     IF WRK_F_TYPE_OF_WARRANTY = TRUE                                   06640005
     THEN                                                               06650005
       DO;                                                              06660005
         REC_CRT0220.F_TYPE_OF_WARRANTY = WRK_F_TOW;                    06670005
         REC_CRT0220.INDNULL(13) = 99;               /* CEDS00000345 */ 06680005
          WRK_F_SPLT_DATE = RCBAMIM_CALC_DATE(                          06690005
                 WRK_EFFECTIVE_DATE,'M',T690_ARRAY.A_B_W_MNTHS(I));     06700005
                                                     /* CEDS00000352 */ 06710005
          REC_CRT0220.F_SPLT_DATE = RCBAMIM_CALC_DATE(                  06720005
                                               WRK_F_SPLT_DATE,'D',-1); 06730005
         REC_CRT0220.INDNULL(14) =  99;              /* CEDS00000345 */ 06740005
         IF (REC_CRT0220.F_SPLT_DATE <=         /* SOC CEDS00000345 */  06750005
                                REC_CRT0220.WARRANTY_EXP_DATE)          06760005
         THEN                                                           06770005
           DO;                                                          06780005
            REC_CRT0220.INDNULL(13) = 0;                                06790005
            REC_CRT0220.INDNULL(14) = 0;                                06800005
           END;                                  /* EOC CEDS00000345 */ 06810005
         IF T690_ARRAY.A_SLC(I)  ¬= WRK_LOW3         /* CEDS00000352 */ 06820005
             & T690_ARRAY.A_SLC_NULLIND(I) ¬= 'FF'X  /* CEDS00000377 */ 06830005
             & REC_CRT0220.F_SPLT_DATE <=            /* CEDS00000345 */ 06840005
                 REC_CRT0220.WARRANTY_EXP_DATE       /* CEDS00000345 */ 06850005
         THEN                                                           06860005
          DO;                                                           06870005
                 REC_CRT0220.SERVICE_LVL_CODE =                         06880005
                             T690_ARRAY.A_SLC(I);    /* CEDS00000352 */ 06890005
                 REC_CRT0220.INDNULL(7) = 0;                            06900005
                 SWITCH_F_SLC = TRUE;                                   06910005
          END;                                                          06920005
       END;                                                             06930005
     ELSE                          /* NOT A FLEXIBLE WARRANTY MACHINE */06940005
       DO;                                                              06950005
          REC_CRT0220.INDNULL(13) = -1;               /* FLEXIBLE TOW */06960005
          REC_CRT0220.INDNULL(14) = -1;        /* FLEXIBLE SPILT DATE */06970005
       END;                                            /* EOC RB01281*/ 06980005
   END;                                                                 06990005
 REC_CRT0220.EFFECTIVE_DATE = WRK_EFFECTIVE_DATE;                       07000005
                                                                        07010005
 END RCBAMIM_CREATE_CRT0220;                                            07020005
1/********************************************************************/ 07030005
 /*      DETERMINE WARRANTY SLC VALUES                     PTM1072   */ 07040005
 /*                                                                  */ 07050005
 /*                                                                  */ 07060005
 /*                                                                  */ 07070005
 /*      IN THE CREATE RCT0220 ROUTINE TEH EFFECTIVE DATE HAS BEEN   */ 07080005
 /*      CHANGED FROM WRK_EFFECTIVE DATE TO DVIAA (INSTALLATION?)    */ 07090005
 /*      IN CASE THE BOX IS UNDER WARRANTY                           */ 07100005
 /*      THEREFOR USING SLC FROM THAT DATE IS ALLOWED                */ 07110005
 /*                                                                  */ 07120005
 /********************************************************************/ 07130005
 RCBAMIM_DET_WAR_SLC: PROC;                                             07140005
                                                                        07150005
 IF PARM_RCBZ32S.SERVICE_LVL_CODE_1 ¬= WRK_HI3                          07160005
 THEN DO;                                                               07170005
   IF SWITCH_F_SLC = FALSE                                 /* RB01281 */07180005
   THEN DO;                                                /* RB01281 */07190005
       REC_CRT0220.SERVICE_LVL_CODE =                                   07200005
                   PARM_RCBZ32S.SERVICE_LVL_CODE_1;                     07210005
       REC_CRT0220.INDNULL(7) = 0;                         /* RB01281 */07220005
   END;                                                    /* RB01281 */07230005
   REC_CRT0220.WARRANTY_EXP_DATE =                                      07240005
                     PARM_RCBZ32S.END_DATE;                             07250005
   IF PARM_RCBZ32S.SERVICE_LVL_CODE_2 ¬= WRK_HI3                        07260005
     THEN DO;                                                           07270005
       REC_CRT0220.END_DATE = PARM_RCBZ32S.END_DATE_1;                  07280005
       CALL RCBAMIM_WRITE_CRT0220;                                      07290005
       REC_CRT0220.EFFECTIVE_DATE =                                     07300005
                   PARM_RCBZ32S.START_DATE_2;                           07310005
       REC_CRT0220.END_DATE = PARM_RCBZ32S.END_DATE;                    07320005
       REC_CRT0220.SERVICE_LVL_CODE =                                   07330005
                         PARM_RCBZ32S.SERVICE_LVL_CODE_2;               07340005
     END;                                                               07350005
 END;                                                                   07360005
 ELSE                                                                   07370005
   DO;                                                                  07380005
     IF SWITCH_F_SLC = TRUE                          /* SOC RB01281 */  07390005
     THEN                                                               07400005
         REC_CRT0220.INDNULL(7)          = 0;                           07410005
     ELSE                                                               07420005
         REC_CRT0220.INDNULL(7)          = -1;       /* EOC RB01281 */  07430005
   END;                                                                 07440005
 CALL RCBAMIM_WRITE_CRT0220;                                            07450005
 END RCBAMIM_DET_WAR_SLC;                                 /* PTM1072 */ 07460005
1/********************************************************************/ 07470005
 /*      CREATE A CRT_RCBT0300 RECORD                                */ 07480005
 /********************************************************************/ 07490005
0RCBAMIM_CREATE_CRT0300 : PROC;                                         07500005
                                                                        07510005
 REC_CRT0300.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              07520005
 REC_CRT0300.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              07530005
 REC_CRT0300.REC_ID.TABLE_NUMBER    = '0300';                           07540005
 REC_CRT0300.REC_ID.ACTION          = 'I';                              07550005
 REC_CRT0300.REC_ID.SOURCE_SYSTEM   = 'S';                              07560005
 REC_CRT0300.REC_ID.PROCESS_TYPE    = 'M';                              07570005
 REC_CRT0300.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               07580005
                                                                        07590005
 REC_CRT0300.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               07600005
 REC_CRT0300.ORIGIN                 = WRK_ORIGIN;                       07610005
 REC_CRT0300.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              07620005
 REC_CRT0300.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               07630005
 REC_CRT0300.INDNULL (05)           = 0;                                07640005
 REC_CRT0300.MODEL_NUMBER           = PARM_RCBABN0.CMMAB;               07650005
 REC_CRT0300.INDNULL (06)           = 0;                                07660005
 REC_CRT0300.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               07670005
 REC_CRT0300.END_DATE               = '9999-12-31';                     07680005
                                                                        07690005
 END RCBAMIM_CREATE_CRT0300;                                            07700005
1/********************************************************************/ 07710005
 /*      CREATE A CRT_RCBT0380 RECORD                                */ 07720005
 /*                                                                  */ 07730005
 /*      THE FIELDS THAT CAN BE UPDATED WILL BE FILLED               */ 07740005
 /*      WITH THE C/F VALUE FROM APG.                                */ 07750005
 /*      WHETHER THE FIELD WILL BE UPDATED WILL BE DECIDED BY THE    */ 07760005
 /*      BUILDING BLOCK WHICH CHECKS THE CORRESPONDING INDNULL FIELD */ 07770005
 /*      WHICH CAN HAVE THE FOLLOWING VALUES:                        */ 07780005
 /*                                                                  */ 07790005
 /*      -1 : UPDATE FIELD, SET TO NULL                              */ 07800005
 /*       0 : UPDATE FIELD, WITH SUPPLIED VALUE                      */ 07810005
 /*      99 : DO NOT UPDATE FIELD                                    */ 07820005
 /********************************************************************/ 07830005
0RCBAMIM_CREATE_CRT0380 : PROC;                                         07840005
                                                                        07850005
 REC_CRT0380.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              07860005
 REC_CRT0380.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              07870005
 REC_CRT0380.REC_ID.TABLE_NUMBER    = '0380';                           07880005
 REC_CRT0380.REC_ID.ACTION          = 'I';                              07890005
 REC_CRT0380.REC_ID.SOURCE_SYSTEM   = 'S';                              07900005
 REC_CRT0380.REC_ID.PROCESS_TYPE    = 'M';                              07910005
 REC_CRT0380.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               07920005
                                                                        07930005
 REC_CRT0380.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               07940005
 REC_CRT0380.ORIGIN                 = WRK_ORIGIN;                       07950005
 REC_CRT0380.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              07960005
 REC_CRT0380.COUNTRY_NUMBER         =  PARM_RCBABN0.RCYAA;              07970005
 IF PARM_RCBABN0.CAGAA ¬= PARM_RCBABN0.CAGXA                            07980005
 THEN                                                                   07990005
   DO;                                                                  08000005
     SWITCH_0380_CHANGED = '1'B;                                        08010005
     IF PARM_RCBABN0.CAGAA ¬= ' '                                       08020005
     THEN                                                               08030005
       DO;                                                              08040005
         REC_CRT0380.TYPE_OF_AGREEMENT      = PARM_RCBABN0.CAGAA;       08050005
         REC_CRT0380.INDNULL (05)           = 0;                        08060005
       END;                                                             08070005
     ELSE                                                               08080005
       DO;                                                              08090005
         REC_CRT0380.INDNULL (05) = -1;                                 08100005
       END;                                                             08110005
   END;                                                                 08120005
 ELSE                                                                   08130005
   DO;                                                                  08140005
     REC_CRT0380.INDNULL (05) = 99;                                     08150005
   END;                                                                 08160005
 IF PARM_RCBABN0.CMKAA ¬= PARM_RCBABN0.CMKDA                            08170005
 THEN                                                                   08180005
   DO;                                                                  08190005
     SWITCH_0380_CHANGED = '1'B;                                        08200005
     IF PARM_RCBABN0.CMKAA ¬= ' '                                       08210005
     THEN                                                               08220005
       DO;                                                              08230005
         REC_CRT0380.MARKET_RESP_CODE = PARM_RCBABN0.CMKAA;             08240005
         REC_CRT0380.INDNULL (06)     = 0;                              08250005
       END;                                                             08260005
     ELSE                                                               08270005
       DO;                                                              08280005
         REC_CRT0380.INDNULL (06) = -1;                                 08290005
       END;                                                             08300005
   END;                                                                 08310005
 ELSE                                                                   08320005
   DO;                                                                  08330005
     REC_CRT0380.INDNULL (06) = 99;                                     08340005
   END;                                                                 08350005
 IF PARM_RCBABN0.RSYAC ¬= PARM_RCBABN0.RSYXA                            08360005
 THEN                                                                   08370005
   DO;                                                                  08380005
     SWITCH_0380_CHANGED = '1'B;                                        08390005
     IF PARM_RCBABN0.RSYAC ¬= ' '                                       08400005
     THEN                                                               08410005
       DO;                                                              08420005
         REC_CRT0380.DP_SYSTEM_NUMBER = PARM_RCBABN0.RSYAC;             08430005
         REC_CRT0380.INDNULL (07)     = 0;                              08440005
       END;                                                             08450005
     ELSE                                                               08460005
       DO;                                                              08470005
         REC_CRT0380.INDNULL (07) = -1;                                 08480005
       END;                                                             08490005
   END;                                                                 08500005
 ELSE                                                                   08510005
   DO;                                                                  08520005
     REC_CRT0380.INDNULL (07) = 99;                                     08530005
   END;                                                                 08540005
                                                          /* RA01077 */ 08550005
 IF PARM_RCBABN0.RBOAC || PARM_RCBABN0.RLCAJ ¬=                         08560005
    PARM_RCBABN0.RBOXI || PARM_RCBABN0.RLCAI                            08570005
 THEN                                                                   08580005
   DO;                                                                  08590005
     SWITCH_0380_CHANGED = '1'B;                                        08600005
     IF PARM_RCBABN0.RBOAC || PARM_RCBABN0.RLCAJ ¬= ' '                 08610005
     THEN                                                               08620005
       DO;                                                              08630005
         REC_CRT0380.INSTALLING_OU = PARM_RCBABN0.RBOAC ||              08640005
                                     PARM_RCBABN0.RLCAJ;                08650005
         REC_CRT0380.INDNULL (08)  = 0;                   /* RA01077 */ 08660005
       END;                                                             08670005
     ELSE                                                               08680005
       DO;                                                              08690005
         REC_CRT0380.INDNULL (08) = -1;                   /* RA01077 */ 08700005
       END;                                                             08710005
   END;                                                                 08720005
 ELSE                                                                   08730005
   DO;                                                                  08740005
     REC_CRT0380.INDNULL (08) = 99;                       /* RA01077 */ 08750005
   END;                                                                 08760005
 IF PARM_RCBABN0.RBOAE || PARM_RCBABN0.RLCAY ¬=                         08770005
    PARM_RCBABN0.RBOXS || PARM_RCBABN0.RLCAS                            08780005
 THEN                                                                   08790005
   DO;                                                                  08800005
     SWITCH_0380_CHANGED = '1'B;                                        08810005
     IF PARM_RCBABN0.RBOAE || PARM_RCBABN0.RLCAY ¬= ' '                 08820005
     THEN                                                               08830005
       DO;                                                              08840005
         REC_CRT0380.SELLING_OU   = PARM_RCBABN0.RBOAE ||               08850005
                                    PARM_RCBABN0.RLCAY;                 08860005
         REC_CRT0380.INDNULL (09) = 0;                                  08870005
       END;                                                             08880005
     ELSE                                                               08890005
       DO;                                                              08900005
         REC_CRT0380.INDNULL (09) = -1;                                 08910005
       END;                                                             08920005
   END;                                                                 08930005
 ELSE                                                                   08940005
   DO;                                                                  08950005
     REC_CRT0380.INDNULL (09) = 99;                                     08960005
   END;                                                                 08970005
 REC_CRT0380.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               08980005
 REC_CRT0380.END_DATE               = '9999-12-31';                     08990005
                                                                        09000005
 END RCBAMIM_CREATE_CRT0380;                                            09010005
1/********************************************************************/ 09020005
 /*      WRITE HEADER RECORD TO CEDS ACTION FILE                     */ 09030005
 /********************************************************************/ 09040005
0RCBAMIM_WRITE_HEADER : PROC;                                           09050005
 REC_HEADER.TXN_NBR = PARM_CNT.TXN_NBR;                                 09060005
 REC_HEADER.UPSTR_INFO.UPSTR_RUN_DATE = PARM_INT_AREA.RUN_DATE;         09070005
                                                       /* PTM 529 */    09080005
0WRITE FILE (RCBAAC0) FROM (REC_HEADER);                                09090005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09100005
0PARM_CNT.CNT_BLKS_W    = PARM_CNT.CNT_BLKS_W + 1;                      09110005
0END RCBAMIM_WRITE_HEADER;                                              09120005
1/********************************************************************/ 09130005
 /*      WRITE REF_RCBT0110 RECORD TO CEDS ACTION FILE               */ 09140005
 /********************************************************************/ 09150005
0RCBAMIM_WRITE_REF0110 : PROC;                                          09160005
0WRITE FILE (RCBAAC0) FROM (REC_REF0110);                               09170005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09180005
0END RCBAMIM_WRITE_REF0110;                                             09190005
1/********************************************************************/ 09200005
 /*      WRITE CRT_RCBT0110 RECORD TO CEDS ACTION FILE               */ 09210005
 /********************************************************************/ 09220005
0RCBAMIM_WRITE_CRT0110 : PROC;                                          09230005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0110);                               09240005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09250005
0END RCBAMIM_WRITE_CRT0110;                                             09260005
1/********************************************************************/ 09270005
 /*      WRITE CRT_RCBT0170 RECORD TO CEDS ACTION FILE               */ 09280005
 /********************************************************************/ 09290005
0RCBAMIM_WRITE_CRT0170 : PROC;                                          09300005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0170);                               09310005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09320005
0END RCBAMIM_WRITE_CRT0170;                                             09330005
1/********************************************************************/ 09340005
 /*      WRITE CRT_RCBT0190 RECORD TO CEDS ACTION FILE               */ 09350005
 /********************************************************************/ 09360005
0RCBAMIM_WRITE_UPD0190 : PROC;                                          09370005
0WRITE FILE (RCBAAC0) FROM (REC_UPD0190);                               09380005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09390005
0END RCBAMIM_WRITE_UPD0190;                                             09400005
1/********************************************************************/ 09410005
 /*      WRITE CRT_RCBT0190 RECORD TO CEDS ACTION FILE               */ 09420005
 /********************************************************************/ 09430005
0RCBAMIM_WRITE_CRT0190 : PROC;                                          09440005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0190);                               09450005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09460005
0END RCBAMIM_WRITE_CRT0190;                                             09470005
1/********************************************************************/ 09480005
 /*      WRITE CRT_RCBT0220 RECORD TO CEDS ACTION FILE               */ 09490005
 /********************************************************************/ 09500005
0RCBAMIM_WRITE_CRT0220 : PROC;                                          09510005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0220);                               09520005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09530005
0END RCBAMIM_WRITE_CRT0220;                                             09540005
1/********************************************************************/ 09550005
 /*      WRITE CRT_RCBT0300 RECORD TO CEDS ACTION FILE               */ 09560005
 /********************************************************************/ 09570005
0RCBAMIM_WRITE_CRT0300 : PROC;                                          09580005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0300);                               09590005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09600005
0END RCBAMIM_WRITE_CRT0300;                                             09610005
1/********************************************************************/ 09620005
 /*      WRITE CRT_RCBT0380 RECORD TO CEDS ACTION FILE               */ 09630005
 /********************************************************************/ 09640005
0RCBAMIM_WRITE_CRT0380 : PROC;                                          09650005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0380);                               09660005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09670005
0END RCBAMIM_WRITE_CRT0380;                                             09680005
1/********************************************************************/ 09690005
 /*      WRITE TRAILER RECORD TO CEDS ACTION FILE                    */ 09700005
 /********************************************************************/ 09710005
0RCBAMIM_WRITE_TRAILER : PROC;                                          09720005
 REC_TRAILER.TXN_NBR = PARM_CNT.TXN_NBR;                                09730005
0WRITE FILE (RCBAAC0) FROM (REC_TRAILER);                               09740005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   09750005
0END RCBAMIM_WRITE_TRAILER;                                             09760005
1/********************************************************************/ 09770005
 /*      INIT COMMON                                                 */ 09780005
 /********************************************************************/ 09790005
0RCBAMIM_INIT_COMMON : PROC;                                            09800005
0                                        /* SET LEVEL AND MOD NAME   */ 09810005
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            09820005
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     09830005
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = WRK_MOD_NAME;                  09840005
 PARM_INT_AREA.COUNTRY_NUMBER          = PARM_RCBABN0.RCYAA;            09850005
                                                                        09860005
 PTR_RCBZ02S                           =  ADDR (PARM_RCBZ02S);          09870005
 PTR_RCBZ03S                           =  ADDR (PARM_RCBZ03S);          09880005
 PTR_RCBV500        = ADDR(TB_RCBV500);                /* SOC RB01281 */09890005
 PTR_RCBV500I       = ADDR(TB_RCBV500_I);                               09900005
 PTR_RETURN_AREA    = ADDR(RETURN_AREA);               /* EOC RB01281 */09910005
                                                                        09920005
0PARM_RCBZ03S               =  '';                                      09930005
 PARM_RCBZ03S.WD_IN_FORMAT  = 'YYDDD';           /* CONVERT TXN.DATE  */09940005
 PARM_RCBZ03S.WD_OUT_FORMAT = 'ISO';             /* FROM YYDDD TO ISO */09950005
 PARM_RCBZ03S.WD_FUNCTION   = 'C';               /* (YYYY-MM-DD)      */09960005
 WRK_DATE_PIC_YYDDD         =  PARM_RCBABN0.DVXAH;                      09970005
 PARM_RCBZ03S.WD_IN_DATE    =  WRK_DATE_PIC_YYDDD;                      09980005
0CALL RCB004M (PTR_RCBZ03S);                                            09990005
0IF PARM_RCBZ03S.WD_STATUS = ' '                                        10000005
 THEN                                                                   10010005
   DO;                                                                  10020005
     WRK_TXN_DATE = SUBSTR (PARM_RCBZ03S.WD_OUT_DATE,1,10);             10030005
   END;                                                                 10040005
 ELSE                                                                   10050005
   DO;                                                                  10060005
     CALL RCBAMIM_INVALID_DATE_MSG (PARM_RCBZ03S.WD_STATUS,             10070005
                                    WRK_DATE_PIC_YYDDD);                10080005
     CALL RCBAMIM_ERROR (NULL,                                          10090005
                        'OTHER',                                        10100005
                        '#002');                                        10110005
   END;                                                                 10120005
                                                                        10130005
 PARM_INT_AREA.RUN_DATE                = WRK_TXN_DATE;                  10140005
                                                                        10150005
 END RCBAMIM_INIT_COMMON;                                               10160005
1/********************************************************************/ 10170005
 /*                                                                  */ 10180005
 /* MODULE NAME     : RCBAMIM_CHECK_REQUESTED                        */ 10190005
 /*                                                                  */ 10200005
 /* DESCRIPTION     : CHECK WHETHER A PRODUCT IS CURRENTLY           */ 10210005
 /*                   REQUESTED BY CEDS (THAT MEANS THAT HW_REQUEST_ */ 10220005
 /*                   CEDS EQ. '1' AND THE COMPLETION DATE ¬= BLANK) */ 10230005
 /*                                                                  */ 10240005
 /*                   IF THE PRODUCT IS CURRENTLY REQUESTED THE TXN  */ 10250005
 /*                   EFFECTIVE DATE MUST BE >= EFFECTIVE DATE OF    */ 10260005
 /*                   THE RCBT0070 RECORD. IF NOT IT WILL BE SET TO  */ 10270005
 /*                   THIS DATE AND MESSAGE 0170 WILL BE ISSUED.     */ 10280005
 /*                                                                  */ 10290005
 /*               '0'  A  '1' (HW_REQUEST_CEDS)                      */ 10300005
 /*   T0070 :  |------||------------------------>                    */ 10310005
 /*               B                                                  */ 10320005
 /*   TXN   :     |----------------------------->                    */ 10330005
 /*                                                                  */ 10340005
 /*   TXN EFFECTIVE DATE WILL BE SET FROM B TO A                     */ 10350005
 /*                                                                  */ 10360005
 /********************************************************************/ 10370005
0RCBAMIM_CHECK_REQUESTED : PROC;                                        10380005
0CALL RCB017M (PARM_RCBABN0.RCYAA,           /* COUNTRY NUMBER */       10390005
               PARM_RCBABN0.CMAAB,           /* PRODUCT_TYPE   */       10400005
               WRK_TXN_DATE,                                            10410005
               WRK_HW_REQUEST_CEDS,                                     10420005
               WRK_RCBT0070_EFF_DATE,                  /* RB01140    */ 10430005
               PTR_INT_AREA);                                           10440005
0IF (WRK_RCBT0070_EFF_DATE ¬= '' &                     /* RB01140    */ 10450005
     WRK_EFFECTIVE_DATE < WRK_RCBT0070_EFF_DATE)       /* RB01140    */ 10460005
 THEN                                                                   10470005
   DO;                                                                  10480005
     CALL RCBAMIM_ISSUE_MSG_0170;                                       10490005
     WRK_EFFECTIVE_DATE = WRK_RCBT0070_EFF_DATE;       /* RB01140    */ 10500005
   END;                                                                 10510005
0END RCBAMIM_CHECK_REQUESTED;                                           10520005
1/********************************************************************/ 10530005
 /*      INITIALISE                                                  */ 10540005
 /*      DETERMINE EFFECTIVE DATE                                    */ 10550005
 /********************************************************************/ 10560005
0RCBAMIM_INIT_PROCESS : PROC;                                           10570005
0REC_HEADER                       =  '';                                10580005
 REC_TRAILER                      =  '';                                10590005
0REC_HEADER.REC_ID.TABLE_NUMBER   =  '0000';                            10600005
 REC_TRAILER.REC_ID.TABLE_NUMBER  =  '9999';                            10610005
 REC_HEADER.COUNTRY_ID            =  PARM_RCBABN0.RCYAA;                10620005
 REC_TRAILER.COUNTRY_ID           =  PARM_RCBABN0.RCYAA;                10630005
                                                                        10640005
 REC_REF0110             =  '';                                         10650005
 REC_CRT0110             =  '';                                         10660005
 REC_CRT0110.INDNULL (*) =  99;                                         10670005
 REC_CRT0170             =  '';                                         10680005
 REC_CRT0170.INDNULL (*) =  99;                                         10690005
 REC_CRT0190             =  '';                                         10700005
 REC_CRT0190.INDNULL (*) =  99;                                         10710005
 REC_UPD0190             =  '';                         /* PTM 341 */   10720005
 REC_UPD0190.INDNULL (*) =  99;                         /* PTM 341 */   10730005
 REC_CRT0220             =  '';                                         10740005
 REC_CRT0300             =  '';                                         10750005
 REC_CRT0300.INDNULL (*) =  99;                                         10760005
 REC_CRT0380             =  '';                                         10770005
 REC_CRT0380.INDNULL (*) =  99;                                         10780005
                                                                        10790005
0SWITCH_0380_CHANGED     =  '0'B;                                       10800005
 PTR_RCBZ23S             =  ADDR (PARM_RCBZ23S);                        10810005
 PARM_RCBZ32S            = '';                            /* PTM1072 */ 10820005
                                                                        10830005
0IF PARM_RCBABN0.CSTAC ¬= PARM_RCBABN0.CSTXA     /* CHECK WHICH DATE  */10840005
 THEN                                            /* MUST BE USED AS   */10850005
   DO;                                           /* EFFECTIVE DATE    */10860005
     WRK_DATE_PIC_YYDDD = PARM_RCBABN0.DVIAA;                           10870005
   END;                                                                 10880005
 ELSE                                                                   10890005
   DO;                                                                  10900005
     IF (PARM_RCBABN0.RCUAF ¬= PARM_RCBABN0.RCUAC) &                    10910005
        (PARM_RCBABN0.RPGAD  = 124 | PARM_RCBABN0.RPGAD = 125) &        10920005
        (PARM_RCBABN0.DVKXJ ¬= 0)                                       10930005
     THEN                                                               10940005
       DO;                                                              10950005
         WRK_DATE_PIC_YYDDD = PARM_RCBABN0.DVKXJ;                       10960005
       END;                                                             10970005
     ELSE                                                               10980005
       DO;                                                              10990005
         WRK_DATE_PIC_YYDDD = PARM_RCBABN0.DVXAH;                       11000005
       END;                                                             11010005
   END;                                                                 11020005
                                                                        11030005
0PARM_RCBZ03S               =  '';                                      11040005
 PARM_RCBZ03S.WD_IN_FORMAT  = 'YYDDD';           /* CONVERT EFF.DATE  */11050005
 PARM_RCBZ03S.WD_OUT_FORMAT = 'ISO';             /* FROM YYDDD TO ISO */11060005
 PARM_RCBZ03S.WD_FUNCTION   = 'C';               /* (YYYY-MM-DD)      */11070005
 IF PARM_RCBABN0.DVIAA = 0                        /* SOC CEDS00000336 */11080005
 THEN                                                                   11090005
   WRK_VALID_INST_DATE = FALSE;                   /* EOC CEDS00000336 */11100005
 PARM_RCBZ03S.WD_IN_DATE    =  WRK_DATE_PIC_YYDDD;                      11110005
0CALL RCB004M (PTR_RCBZ03S);                                            11120005
0IF PARM_RCBZ03S.WD_STATUS = ' '                                        11130005
 THEN                                                                   11140005
   DO;                                                                  11150005
     WRK_EFFECTIVE_DATE = SUBSTR (PARM_RCBZ03S.WD_OUT_DATE,1,10);       11160005
   END;                                                                 11170005
0ELSE                                                                   11180005
   DO;                                                                  11190005
     CALL RCBAMIM_INVALID_DATE_MSG (PARM_RCBZ03S.WD_STATUS,             11200005
                                    WRK_DATE_PIC_YYDDD);                11210005
     CALL RCBAMIM_ERROR (NULL,                                          11220005
                        'OTHER',                                        11230005
                        '#003');                                        11240005
   END;                                                                 11250005
                                                                        11260005
0WRK_ORIGIN              =  SUBSTR (PARM_RCBABN0.RMAAB,1,2);            11270005
 WRK_SEQUENCE_NUMBER     =  '00' || SUBSTR (PARM_RCBABN0.RMAAB,3,5);    11280005
 WRK_HI3                 = HIGH(3);                                     11290005
 WRK_LOW3                = LOW(3);                        /* RB01281 */ 11300005
 SWITCH_F_SLC            = FALSE;                         /* RB01281 */ 11310005
0END RCBAMIM_INIT_PROCESS;                                              11320005
                                                      /* SOC RB01281 */ 11330005
 /********************************************************************/ 11340005
 /*                                                                  */ 11350005
 /* MODULE NAME      : RETRIEVE_FLEX_WARR                            */ 11360005
 /*                                                                  */ 11370005
 /* DESCRIPTION      : CHECK WHETHER THE MACHINE IS A FLEXIBLE       */ 11380005
 /*                    WARRANTY MACHINE.                             */ 11390005
 /*                                                                  */ 11400005
 /********************************************************************/ 11410005
 RCBAMIM_RETRIEVE_FLEX_WARR: PROC;                                      11420005
                                                                        11430005
 DCL WRK_FW_TYPE            CHAR(04);                                   11440005
 DCL WRK_FW_MODEL           CHAR(03);                                   11450005
 DCL WRK_FW_COUNTRY_NUMBER  CHAR(03);                                   11460005
                                                                        11470005
 WRK_FW_TYPE           = PARM_RCBABN0.CMAAB;                            11480005
 WRK_FW_MODEL          = PARM_RCBABN0.CMMAB;                            11490005
 WRK_FW_COUNTRY_NUMBER =  PARM_RCBABN0.RCYAA;                           11500005
                                                                        11510005
                                                  /* SOC CEDS00000352 */11520005
  DO J = 1 TO REC_COUNT BY 1;                                           11530005
                                                 /* SOC CEDS00000399 */ 11540005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &       */ 11550005
      IF  T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &          11560005
                                                 /* EOC CEDS00000399 */ 11570005
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          11580005
          T690_ARRAY.A_MODEL(J)     =  WRK_FW_MODEL          &          11590005
                                                 /* SOC CEDS00000399 */ 11600005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          11610005
          T690_ARRAY.A_END_DATE(J)))                                 */ 11620005
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &          11630005
          WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)         11640005
                                                 /* EOC CEDS00000399 */ 11650005
      THEN DO;                                                          11660005
            WRK_F_TYPE_OF_WARRANTY = TRUE;                              11670005
            I = J;                                                      11680005
            J = REC_COUNT;                                              11690005
          END;                                                          11700005
      ELSE                                                              11710005
         WRK_F_TYPE_OF_WARRANTY = FALSE;                                11720005
  END;                                                                  11730005
                                                                        11740005
  IF WRK_F_TYPE_OF_WARRANTY = FALSE THEN                                11750005
  DO J = 1 TO REC_COUNT BY 1;                                           11760005
                                                 /* SOC CEDS00000399 */ 11770005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &       */ 11780005
      IF  T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &          11790005
                                                 /* EOC CEDS00000399 */ 11800005
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          11810005
          T690_ARRAY.A_MODEL(J)     =  '***'                 &          11820005
                                                 /* SOC CEDS00000399 */ 11830005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          11840005
          T690_ARRAY.A_END_DATE(J)))                                 */ 11850005
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &          11860005
          WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)         11870005
                                                 /* EOC CEDS00000399 */ 11880005
      THEN DO;                                                          11890005
            WRK_F_TYPE_OF_WARRANTY = TRUE;                              11900005
            I = J;                                                      11910005
            J = REC_COUNT;                                              11920005
          END;                                                          11930005
      ELSE                                                              11940005
         WRK_F_TYPE_OF_WARRANTY = FALSE;                                11950005
  END;                                                                  11960005
                                                                        11970005
  IF WRK_F_TYPE_OF_WARRANTY = FALSE THEN                                11980005
  DO J = 1 TO REC_COUNT BY 1;                                           11990005
                                                 /* SOC CEDS00000399 */ 12000005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  '***'                 &       */ 12010005
      IF  T690_ARRAY.A_COUNTRY(J)   =  '***'                 &          12020005
                                                 /* EOC CEDS00000399 */ 12030005
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          12040005
          T690_ARRAY.A_MODEL(J)     =  WRK_FW_MODEL          &          12050005
                                                 /* SOC CEDS00000399 */ 12060005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          12070005
          T690_ARRAY.A_END_DATE(J)))                                 */ 12080005
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &          12090005
          WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)         12100005
                                                 /* EOC CEDS00000399 */ 12110005
      THEN DO;                                                          12120005
            WRK_F_TYPE_OF_WARRANTY = TRUE;                              12130005
            I = J;                                                      12140005
            J = REC_COUNT;                                              12150005
          END;                                                          12160005
      ELSE                                                              12170005
         WRK_F_TYPE_OF_WARRANTY = FALSE;                                12180005
  END;                                                                  12190005
                                                                        12200005
  IF WRK_F_TYPE_OF_WARRANTY = FALSE THEN                                12210005
  DO J = 1 TO REC_COUNT BY 1;                                           12220005
                                                 /* SOC CEDS00000399 */ 12230005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  '***'                 &       */ 12240005
      IF  T690_ARRAY.A_COUNTRY(J)   =  '***'                 &          12250005
                                                 /* EOC CEDS00000399 */ 12260005
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          12270005
          T690_ARRAY.A_MODEL(J)     =  '***'                 &          12280005
                                                 /* SOC CEDS00000399 */ 12290005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          12300005
          T690_ARRAY.A_END_DATE(J)))                                 */ 12310005
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &          12320005
          WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)         12330005
                                                 /* EOC CEDS00000399 */ 12340005
      THEN DO;                                                          12350005
            WRK_F_TYPE_OF_WARRANTY = TRUE;                              12360005
            I = J;                                                      12370005
            J = REC_COUNT;                                              12380005
          END;                                                          12390005
      ELSE                                                              12400005
         WRK_F_TYPE_OF_WARRANTY = FALSE;                                12410005
  END;                                           /* EOC CEDS00000352 */ 12420005
 END RCBAMIM_RETRIEVE_FLEX_WARR;                                        12430005
                                                                        12440005
 /********************************************************************/ 12450005
 /*                                                                  */ 12460005
 /* MODULE NAME      : GET_F_TOW_RCB063                              */ 12470005
 /*                                                                  */ 12480005
 /* DESCRIPTION      : GET THE FLEXIBLE TYPE OF WARRANTY FROM RCB063 */ 12490005
 /*                    PARAMETER.                                    */ 12500005
 /*                                                                  */ 12510005
 /********************************************************************/ 12520005
                                                                        12530005
 RCBAMIM_GET_F_TOW_RCB063: PROC;                                        12540005
                                                                        12550005
 TB_RCBV500         = '';                                               12560005
 TB_RCBV500_I       = '';                                               12570005
 TB_RCB063.NUMBER   = 'RCB063';                                         12580005
 /* TB_RCB063.FILLER   = 'APN'; */                                      12590005
                                                                        12600005
 CALL RCBI50M ('R',                                 /* PASS PARAMETER*/ 12610005
                PTR_RCBV500,                                            12620005
                PTR_RCBV500I,                                           12630005
                PTR_RETURN_AREA,                                        12640005
                PTR_INT_AREA);                                          12650005
 SELECT(RETURN_AREA.RETURN_CODE);                                       12660005
  WHEN(0)                                                               12670005
    WRK_F_TOW = SUBSTR(TB_RCB063.F_WARRANTY_MACHINE,1,1);               12680005
  WHEN(4)                                                               12690005
    DO;                                                                 12700005
      PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                    12710005
      PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = 'I050';                  12720005
      PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                     12730005
      PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                    12740005
      PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                          12750005
                                       TB_RCBV500.PARAMETER_NUMBER;     12760005
      CALL RCB0M1M (PTR_INT_AREA);                                      12770005
      CALL RCBAMIM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),                12780005
                            'DB2','#004');                              12790005
    END;                                                                12800005
  OTHERWISE                                                             12810005
    CALL RCBAMIM_ERROR(ADDR(SQLCA),'DB2','#005');                       12820005
 END;                                                                   12830005
                                                                        12840005
 END RCBAMIM_GET_F_TOW_RCB063;                                          12850005
1/********************************************************************/ 12860005
 /*                                                                  */ 12870005
 /* MODULE NAME      : GET_F_REC_RCBT690     CEDS00000352            */ 12880005
 /*                                                                  */ 12890005
 /* DESCRIPTION      : GET THE FLEXIBLE WARRANTY RECORDS FROM T690   */ 12900005
 /*                    INTO T690 ARRAY                               */ 12910005
 /********************************************************************/ 12920005
0RCBAMIM_GET_F_REC_RCBT690: PROC;                                       12930005
 /*   READ FILE TO GET RECORD COUNT FOR ARRAY SIZE */                   12940005
  OPEN   FILE (RCBAMB0);                                                12950005
  DO  WHILE (¬EOF_RCBAMB0);                                             12960005
      READ FILE (RCBAMB0) INTO (FILE_RCBAMB0);                          12970005
      REC_COUNT = REC_COUNT + 1;                                        12980005
  END;                                                                  12990005
                                                                        13000005
  CLOSE   FILE (RCBAMB0);                                               13010005
  EOF_RCBAMB0   = FALSE;                                                13020005
                                                                        13030005
  IF REC_COUNT > 0 THEN                                                 13040005
   DO;                                                                  13050005
     ALLOCATE T690_ARRAY;                                               13060005
     /* READ THE FILE TO LOAD THE DATA INTO ARRAY */                    13070005
     OPEN FILE (RCBAMB0);                   /* IN  - TABLE 690 TABLE */ 13080005
     DO K = 1 TO REC_COUNT BY 1;                                        13090005
       READ FILE (RCBAMB0) INTO (FILE_RCBAMB0);                         13100005
                                                                        13110005
       T690_ARRAY.A_COUNTRY(K)   = FILE_RCBAMB0.COUNTRY_NUMBER;         13120005
       T690_ARRAY.A_TYPE(K)      = FILE_RCBAMB0.PRODUCT_TYPE;           13130005
       T690_ARRAY.A_MODEL(K)     = FILE_RCBAMB0.MODEL_NUMBER;           13140005
       T690_ARRAY.A_B_W_MNTHS(K) = FILE_RCBAMB0.BRAND_WARRANTY_MNT;     13150005
       T690_ARRAY.A_SLC_NULLIND(K)                   /* CEDS00000377 */ 13160005
             =  FILE_RCBAMB0.NULL_SERVICE_LVL_CODE;  /* CEDS00000377 */ 13170005
       T690_ARRAY.A_SLC(K)       = FILE_RCBAMB0.SERVICE_LVL_CODE;       13180005
       T690_ARRAY.A_EFF_DATE(K)  = FILE_RCBAMB0.EFFECTIVE_DATE;         13190005
       T690_ARRAY.A_END_DATE(K)  = FILE_RCBAMB0.END_DATE;               13200005
     END;                                                               13210005
   END;                                                                 13220005
  ELSE                                                                  13230005
    SWITCH_EMPTY_T690 = TRUE;                                           13240005
                                                                        13250005
 CLOSE FILE (RCBAMB0);                                                  13260005
                                                                        13270005
0END RCBAMIM_GET_F_REC_RCBT690;                                         13280005
 /********************************************************************/ 13290005
 /*                                                                  */ 13300005
 /* MODULE NAME      : CALC_DATE                                     */ 13310005
 /*                                                                  */ 13320005
 /* DESCRIPTION      : PROCESS DATE USING RCB004M                    */ 13330005
 /*                                                                  */ 13340005
 /********************************************************************/ 13350005
                                                                        13360005
 RCBAMIM_CALC_DATE: PROC   (EFF_DATE,                                   13370005
                            CALC_TYPE,                                  13380005
                            CALC_VALUE) RETURNS(CHAR(10));              13390005
                                                                        13400005
 DCL EFF_DATE     CHAR(10);                                             13410005
 DCL CALC_TYPE    CHAR(1);                                              13420005
 DCL CALC_VALUE   FIXED DEC(3,0);                                       13430005
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      13440005
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      13450005
 DATE_AREA.WD_FUNCTION    = 'C';                                        13460005
 DATE_AREA.WD_PERIOD_TYPE = CALC_TYPE;                                  13470005
 DATE_AREA.WD_PERIOD      = CALC_VALUE;                                 13480005
 DATE_AREA.WD_IN_DATE     = EFF_DATE;                                   13490005
 CALL RCB004M (ADDR (DATE_AREA));;                                      13500005
 IF DATE_AREA.WD_STATUS ¬= ' '                                          13510005
 THEN                                                                   13520005
   DO;                                                                  13530005
     CALL RCBAMIM_ERROR (NULL,                                          13540005
                         'OTHER',                                       13550005
                         '#006');                                       13560005
   END;                                                                 13570005
                                                                        13580005
 RETURN(DATE_AREA.WD_OUT_DATE);                                         13590005
                                                                        13600005
 END RCBAMIM_CALC_DATE;                               /* EOC RB01281 */ 13610005
1/********************************************************************/ 13620005
 /*      END PROGRAM                                                 */ 13630005
 /********************************************************************/ 13640005
0RCBAMIM_END_PGM : PROC;                                                13650005
0                                        /* RESET LEVEL              */ 13660005
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            13670005
0END RCBAMIM_END_PGM;                                                   13680005
1/********************************************************************/ 13690005
 /*      ISSUE MSG 0010                                              */ 13700005
 /********************************************************************/ 13710005
0RCBAMIM_ISSUE_MSG_0010 : PROC;                                         13720005
0PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         13730005
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'BU';                        13740005
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '0010';                      13750005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_1   = 'HW';                        13760005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_1  = PARM_RCBABN0.CMAAB  ||       13770005
                                           WRK_ORIGIN          ||       13780005
                                           WRK_SEQUENCE_NUMBER;         13790005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6   = 'FN';                        13800005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6  = 'TYPE OF MAINT.';            13810005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7   = 'NV';                        13820005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7  = PARM_RCBZ23S.TPMNT_WAR_VALUE;13830005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8   = 'OV';                        13840005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8  =  PARM_RCBZ23S.VALUE;         13850005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9   = 'TS';                        13860005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9  =  PARM_RCBABN0.QUBCJ;         13870005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_10  = 'TX';                        13880005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_10 = PARM_RCBABN0.RPGAD;          13890005
0CALL RCB0M1M (PTR_INT_AREA);                                           13900005
0END RCBAMIM_ISSUE_MSG_0010;                                            13910005
1/********************************************************************/ 13920005
 /*      ISSUE INVALID DATE MESSAGE 0012                             */ 13930005
 /********************************************************************/ 13940005
0RCBAMIM_INVALID_DATE_MSG : PROC (STATUS,                               13950005
                                  VALUE);                               13960005
0DCL STATUS        CHAR (01);                                           13970005
0DCL VALUE         PIC '99999';                                         13980005
0PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         13990005
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'IS';                        14000005
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '0012';                      14010005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6   = 'DT';                        14020005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6  =  VALUE;                      14030005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7   = 'RC';                        14040005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7  =  STATUS;                     14050005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8   = 'TS';                        14060005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8  =  PARM_RCBABN0.QUBCJ;         14070005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9   = 'TX';                        14080005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9  =  PARM_RCBABN0.RPGAD;         14090005
0CALL RCB0M1M (PTR_INT_AREA);                                           14100005
0END RCBAMIM_INVALID_DATE_MSG;                                          14110005
1/********************************************************************/ 14120005
 /*      ISSUE MSG 0170                                              */ 14130005
 /********************************************************************/ 14140005
0RCBAMIM_ISSUE_MSG_0170 : PROC;                                         14150005
0PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         14160005
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'BU';                        14170005
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '0170';                      14180005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_1   = 'HW';                        14190005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_1  =  PARM_RCBABN0.CMAAB  ||      14200005
                                            WRK_ORIGIN          ||      14210005
                                            WRK_SEQUENCE_NUMBER;        14220005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6   = 'DN';                        14230005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6  = 'EFFECTIVE_DATE';            14240005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7   = 'D1';                        14250005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7  =  WRK_EFFECTIVE_DATE;         14260005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8   = 'D2';                        14270005
                                                       /* RB01140    */ 14280005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8  =  WRK_RCBT0070_EFF_DATE;      14290005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9   = 'TS';                        14300005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9  =  PARM_RCBABN0.QUBCJ;         14310005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_10  = 'TX';                        14320005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_10 =  PARM_RCBABN0.RPGAD;         14330005
0CALL RCB0M1M (PTR_INT_AREA);                                           14340005
0END RCBAMIM_ISSUE_MSG_0170;                                            14350005
1/********************************************************************/ 14360005
 /*      CALL COMMON ERROR ROUTINE AFTER FILLING VARIABLES           */ 14370005
 /********************************************************************/ 14380005
0RCBAMIM_ERROR : PROC     (PTR_ERROR,                                   14390005
                           ERR_TYPE,                                    14400005
                           CALL_ID);                                    14410005
0DCL PTR_ERROR    POINTER;                                              14420005
 DCL ERR_TYPE     CHAR(8);                                              14430005
 DCL CALL_ID      CHAR(4);                                              14440005
0PARM_INT_AREA.PTR_ERROR      =  PTR_ERROR;                             14450005
 PARM_INT_AREA.ERR_TYPE       =  ERR_TYPE;                              14460005
 PARM_INT_AREA.CALL_ID        =  CALL_ID;                               14470005
0CALL RCB0E1M (PTR_INT_AREA);                                           14480005
0END RCBAMIM_ERROR;                                                     14490005
1/*******************************************************************/  14500005
 /* DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                    */  14510005
 /*******************************************************************/  14520005
0%INCLUDE DAIFPLH ;                   /* COMPILE DATE/TIME STAMP    */  14530005
 $DAIMOD (RCBAMIM);                   /* MODULE TO BE COMPILED      */  14540005
0/*******************************************************************/  14550005
 /* END OF ABR BLOCK                                                */  14560005
 /*******************************************************************/  14570005
0END RCBAMIM;                                                           14580005