 /* RCBAMHM - CHGS TO INSTALLED PRODUCTS (4) - EXTRACT (APG ONLY)    */ 00015012
 /*                                                                  */ 00020005
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030005
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040005
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050005
 /*                                                                  */ 00060005
 /********************************************************************/ 00070005
 /* PROGRAM          : RCBAMHM                                       */ 00080005
 /*                                                                  */ 00090005
 /* LANGUAGE         : PLI                                           */ 00100005
 /*                                                                  */ 00110005
 /* TYPE             : LINKABLE MODULE                               */ 00120005
 /*                                                                  */ 00130005
 /* DESCRIPTION      : THIS PROGRAM CHECKS THE INCOMING INFO         */ 00140005
 /*                    FROM AN APG  'CHGS TO INSTALLED PRODUCTS'     */ 00150005
 /*                    TRANSACTION.                                  */ 00160005
 /*                    THE TRANSACTION IS TRANSLATED INTO INTERNAL   */ 00170005
 /*                    CEDS TRANSACTIONS, WHICH ARE ADDED            */ 00180005
 /*                    TO THE CEDS ACTION FILE.                      */ 00190005
 /*                                                                  */ 00200005
 /*                    PROCESSING WILL ONLY TAKE PLACE IF CSTAC IS   */ 00210005
 /*                    '3' OR '4' AND THE PRODUCT IS REQUESTED BY    */ 00220005
 /*                    CEDS.                                         */ 00230005
 /*                                                                  */ 00240005
 /* NOTE (1)         : IF CSTAC ¬= CSTXA THEN                        */ 00250005
 /*                       DVIAA WILL BE USED AS EFF. DATE            */ 00260005
 /*                    ELSE                                          */ 00270005
 /*                       DVXAH WILL BE USED AS EFF. DATE            */ 00280005
 /*                                                                  */ 00290005
 /*                                                                  */ 00300005
 /* INPUT            : - APG   : TRANSACTION : 104                   */ 00310005
 /*                                                                  */ 00320005
 /* OUTPUT           : 'REF_RCBT0110' RECORD                         */ 00330005
 /*                    'CRT_RCBT0110' RECORD                         */ 00340005
 /*                    'CRT_RCBT0220' RECORD                         */ 00350005
 /*                    'CRT_RCBT0380' RECORD                         */ 00360005
 /*                                                                  */ 00370005
 /*                  : RCBAAC0  -  CEDS ACTION FILE                  */ 00380005
 /*                                                                  */ 00390005
 /* EXTERNAL MODULES : RCB004M  -  CONVERT DATE                      */ 00400005
 /*                    RCB011M  -  DETERMINE TPWAR OR TPMNT          */ 00410005
 /*                    RCB017M  -  CHECK PRODUCT TYPE REQUESTED      */ 00420005
 /*                    RCB0E1M  -  COMMON ERROR ROUTINE              */ 00430005
 /*                    RCB0M1M  -  COMMON MESSAGE ROUTINE            */ 00440005
 /*                                                      SOC PTM1038 */ 00450005
 /*                    RCB022M  -  CHECK HOUSE KEEP DATE             */ 00460005
 /*                                                      EOC PTM1038 */ 00470005
 /*                    RCB023M  -  RETRIEVE APPLICABLE SLC   PTM1072 */ 00480005
 /*                                                                  */ 00490005
 /* MESSAGES         : 0010                                          */ 00500005
 /*                  : 0012                                          */ 00510005
 /*                  : 0170                                          */ 00520005
 /*                                                                  */ 00530005
 /* DEPENDENCIES     : -                                             */ 00540005
 /*                                                                  */ 00550005
 /* FREQUENCY        : -                                             */ 00560005
 /*                                                                  */ 00570005
 /* MAINTENANCE LOG    :                                             */ 00580005
 /* ---------------                                                  */ 00590005
 /*                                                                  */ 00600005
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00610005
 /* --------------------------------------------------------------   */ 00620005
 /*  1991-10-08 | ----         | CEDS INITIAL DEVELOPMENT            */ 00630005
 /*  1993-04-29 | RC1032       | MCO AND TABLE CHANGES               */ 00640005
 /*  1994-07-25 | PTM 529      | SEE PTM DESCRIPTION                 */ 00650005
 /*  1994-11-15 | RC01116      | STORE TYPE OF WARRANTY              */ 00660005
 /*  1995-09-07 | RB01140      | IMPROVE PERFORMANCE :               */ 00670005
 /*             |              | MOVE HW_REQUEST_CEDS TO RCBT0070    */ 00680005
 /*  1997-05-05 | PTM1038      | CORRECT NAMES                       */ 00690005
 /*  1997-10-13 | PTM1072      | RETRIEVE SLC'S FOR RENTAL AND WAR-  */ 00700005
 /*             |              |   RANTY, OTHER WED SETUP            */ 00710005
 /*  1997-10-24 | PTM1097      | YEAR 2000                           */ 00720005
 /*  2004-06-29 | RB01242      | INCREASE LENGTH OF SERIAL NUMBER    */ 00730005
 /*  2007-04-19 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY       */ 00740005
 /*             |              | MACHINES                            */ 00750005
 /*  2007-08-20 | CEDS00000336 | CHANGES TO HANDLE FLEXIBLE WARRANTY */ 00760005
 /*             |              | MACHINES WHEN THERE IS NO VALID     */ 00770005
 /*             |              | INSTALL DATE FROM WTAAS.            */ 00780005
 /*  2007-10-19 | CEDS00000352 | PERFORMANCE ISSUE OVER CEDS 3.3 QF  */ 00790005
 /*             |              | FLEXIBLE WARRANTY                   */ 00800005
 /*  2008-05-15 | CEDS00000377 | NULL VALUES FOR SLC FROM RCBT0690   */ 00810005
 /*             |              | HANDLED                             */ 00820005
 /*  2008-05-15 | CEDS00000345 | F_SPLT_DATE IS NOT ALLOWED TO       */ 00830005
 /*             |              | EXCEED WARRANTY_EXP_DATE            */ 00840005
 /*  2008-05-26 | CEDS00000399 | PERFORMANCE FIX OVER CEDS 3.3 QF    */ 00850005
 /*             |              | FLEXIBLE WARRANTY RECTIFIED         */ 00860005
 /********************************************************************/ 00870005
1RCBAMHM: PROC (PTR_RCBABNS,                                            00880005
                PTR_CTRY_CNT,                                           00890005
                PTR_INT_AREA)                                           00900005
          REORDER;                                                      00910005
0DEFAULT RANGE (*)        STATIC;                                       00920005
1/********************************************************************/ 00930005
 /*  PARAMETERS                                                      */ 00940005
 /********************************************************************/ 00950005
0DCL PTR_RCBABNS          POINTER;                                      00960005
 DCL PTR_CTRY_CNT         POINTER;                                      00970005
 DCL PTR_INT_AREA         POINTER;                                      00980005
 DCL PTR_RETURN_AREA      POINTER;                    /* SOC RB01281 */ 00990005
 DCL PTR_DATE_AREA        POINTER;             /* RCB004M DATE CHECK */ 01000005
 DCL RETCODE              FIXED BIN(31);                                01010005
                                                                        01020005
 DCL 1 DATE_AREA,                                       /* DATE AREA */ 01030005
       %INCLUDE (RCBZ03S);;                                             01040005
 DCL 1 RETURN_AREA,                                   /* RETURN AREA */ 01050005
       %INCLUDE (RCBZ02S);;                           /* EOC RB01281 */ 01060005
 DCL 1 PARM_RCBABN0    BASED (PTR_RCBABNS), /* APG TRANSACTION RCRD  */ 01070005
       %INCLUDE (RRDDBNA);;                                             01080005
 DCL 1 PARM_INT_AREA   BASED (PTR_INT_AREA),                            01090005
       %INCLUDE (RCBZ01S);;                                             01100005
 DCL 1 PARM_CNT        BASED (PTR_CTRY_CNT),                            01110005
       %INCLUDE (RCBA00S1);,                                            01120005
       3 TXN_NBR,                                                       01130005
       %INCLUDE (RCBA00S2);;                                            01140005
1/********************************************************************/ 01150005
 /* FILE DECLARATIONS (NON GSAM)                                     */ 01160005
 /********************************************************************/ 01170005
 DCL RCBAMB0  FILE RECORD INPUT;  /* TABLE 690 RECORDS- CEDS00000352 */ 01180005
0DCL RCBAAC0  FILE RECORD OUTPUT;            /* CEDS ACTION FILE     */ 01190005
1/********************************************************************/ 01200005
 /* EXTERNAL ENTRIES                                                 */ 01210005
 /********************************************************************/ 01220005
0DCL RCB004M   ENTRY  EXTERNAL;                                         01230005
 DCL RCB011M   ENTRY  EXTERNAL;                                         01240005
 DCL RCB0E1M   ENTRY  EXTERNAL;                                         01250005
 DCL RCB0M1M   ENTRY  EXTERNAL;                                         01260005
 DCL RCB017M   ENTRY  EXTERNAL;                                         01270005
                                                      /* SOC PTM1038 */ 01280005
 DCL RCB022M   ENTRY  EXTERNAL;                                         01290005
                                                      /* EOC PTM1038 */ 01300005
 DCL RCB023M   ENTRY  EXTERNAL;                           /* PTM1072 */ 01310005
 DCL RCBI50M   ENTRY  EXTERNAL;                           /* RB01281 */ 01320005
1/********************************************************************/ 01330005
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01340005
 /********************************************************************/ 01350005
0DCL 1 PARM_RCBZ02S,                        /* RETURN AREA BB        */ 01360005
     %INCLUDE (RCBZ02S);;                                               01370005
 DCL 1 PARM_RCBZ03S,                        /* RETURN AREA DATE CONV */ 01380005
     %INCLUDE (RCBZ03S);;                                               01390005
 DCL 1 PARM_RCBZ23S,                        /* RETURN AREA RCB011M   */ 01400005
     %INCLUDE (RCBZ23S);;                                               01410005
 DCL 1 PARM_RCBZ32S,                        /* RETURN AREA RCB023M   */ 01420005
     %INCLUDE (RCBZ32S);;                                 /* PTM1072 */ 01430005
 /********************************************************************/ 01440005
 /* DB2 TABLE STRUCTURES                              /* SOC RB01281 */ 01450005
 /********************************************************************/ 01460005
 DCL PTR_RCBV500    PTR;                        /* PTR PARAMETER ROW */ 01470005
 DCL PTR_RCBV500I   PTR;                  /* PTR NULL-IND. PARAMETER */ 01480005
 DCL 1 TB_RCBV500,                                  /* PARAMETER ROW */ 01490005
       %INCLUDE (RCB500S);;                                             01500005
 DCL 1 TB_RCBV500_I,                          /* NULL-IND. PARAMETER */ 01510005
       %INCLUDE (RCB500SI);;                                            01520005
 DCL 1 FILE_RCBAMB0,    /* SORTED UNLOAD FILE */     /* CEDS00000352 */ 01530005
      %INCLUDE (RCBBCAS);;                           /* CEDS00000352 */ 01540005
                                                      /* EOC RB01281 */ 01550005
1/********************************************************************/ 01560005
 /*  RECORD STRUCTURES FOR OUTPUT FILES                              */ 01570005
 /********************************************************************/ 01580005
0DCL 1 REC_HEADER,                                                      01590005
       %INCLUDE (RCBAACS);,                                             01600005
       3 TXN_NBR,                                                       01610005
       %INCLUDE (RCBA00S2);,                                            01620005
       3 UPSTR_INFO,                                                    01630005
       %INCLUDE (RCBA00S3);;                          /* PTM 529 */     01640005
 DCL 1 REC_TRAILER,                                                     01650005
       %INCLUDE (RCBAACS);,                                             01660005
       3 TXN_NBR,                                                       01670005
       %INCLUDE (RCBA00S2);;                                            01680005
 DCL 1 REC_REF0110,                                                     01690005
       %INCLUDE (RCBAACS);,                                             01700005
       %INCLUDE (RCB110S);,                                             01710005
       %INCLUDE (RCB110SI);;                                            01720005
 DCL 1 REC_CRT0110,                                                     01730005
       %INCLUDE (RCBAACS);,                                             01740005
       %INCLUDE (RCB110S);,                                             01750005
       %INCLUDE (RCB110SI);;                                            01760005
 DCL 1 REC_CRT0220,                                                     01770005
       %INCLUDE (RCBAACS);,                                             01780005
       %INCLUDE (RCB220S);,                                             01790005
       %INCLUDE (RCB220SI);;                                            01800005
 DCL 1 REC_CRT0380,                                                     01810005
       %INCLUDE (RCBAACS);,                                             01820005
       %INCLUDE (RCB380S);,                                             01830005
       %INCLUDE (RCB380SI);;                                            01840005
1/********************************************************************/ 01850005
 /*  POINTERS                                                        */ 01860005
 /********************************************************************/ 01870005
0DCL PTR_RCBZ02S                POINTER;                                01880005
 DCL PTR_RCBZ03S                POINTER;                                01890005
 DCL PTR_RCBZ23S                POINTER;                                01900005
 /********************************************************************/ 01910005
 /*  PROGRAM CONTROL PARAMETERS                       /* SOC RB01281 */ 01920005
 /********************************************************************/ 01930005
 DCL 1 TB_RCB063        BASED(PTR_RCBV500),     /* FLEXIBLE WARRANTY */ 01940005
       %INCLUDE (RCBP63S);;                           /* EOC RB01281 */ 01950005
1/********************************************************************/ 01960005
 /*  BIT SWITCHES                                /* SOC CEDS00000352 */ 01970005
 /********************************************************************/ 01980005
 DCL SWITCH_EMPTY_T690   BIT (1)   INIT ('0'B);                         01990005
 DCL EOF_RCBAMB0         BIT (1)   INIT ('0'B);                         02000005
0DCL TRUE                BIT (1)   INIT ('1'B);                         02010005
 DCL FALSE               BIT (1)   INIT ('0'B);  /* EOC CEDS00000352 */ 02020005
1/********************************************************************/ 02030005
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 02040005
 /********************************************************************/ 02050005
0DCL WRK_LEVEL                  FIXED BIN (15);                         02060005
 DCL WRK_MOD_NAME               CHAR (08)        INIT ('RCBAMHM');      02070005
 DCL WRK_ORIGIN                 CHAR (02);                              02080005
 DCL WRK_SEQUENCE_NUMBER        CHAR (28);                              02090005
 DCL WRK_HW_REQUEST_CEDS        CHAR (01);                              02100005
 DCL WRK_RCBT0070_EFF_DATE      CHAR (10);              /* RB01140   */ 02110005
 DCL WRK_TXN_DATE               CHAR (10);                              02120005
 DCL WRK_EFFECTIVE_DATE         CHAR (10);                              02130005
 DCL WRK_HKP_DATE               CHAR (10);                              02140005
 DCL WRK_DATE_PIC_YYDDD         PIC '99999';                            02150005
 DCL WRK_WARRANTY_EXP_DATE      CHAR (10);                              02160005
 DCL 1 WRK_TPMNT,                                     /* SOC PTM1072 */ 02170005
     %INCLUDE (RCBZ99S);;                                               02180005
 DCL WRK_HI3                    CHAR(3);              /* EOC PTM1072 */ 02190005
 DCL WRK_LOW3                   CHAR(3);              /* SOC RB01281 */ 02200005
 DCL WRK_F_TOW                  CHAR(01) INIT('');                      02210005
 DCL WRK_F_SPLT_DATE            CHAR (10);                              02220005
 DCL SWITCH_F_SLC               BIT (01)  INIT ('0'B);                  02230005
 DCL WRK_F_TYPE_OF_WARRANTY     BIT  (01) INIT('0'B); /* EOC RB01281 */ 02240005
 DCL WRK_VALID_INST_DATE     BIT (1)    INIT ('1'B); /* CEDS00000336 */ 02250005
 DCL I,J,K               FIXED BIN(31)   INIT(0);/* SOC CEDS00000352 */ 02260005
 DCL 1 T690_ARRAY(REC_COUNT) CTL,                                       02270005
        2 A_COUNTRY    CHAR(3),                                         02280005
        2 A_TYPE       CHAR(4),                                         02290005
        2 A_MODEL      CHAR(3),                                         02300005
        2 A_B_W_MNTHS  DEC FIXED(3,0),                                  02310005
        2 A_SLC_NULLIND CHAR(1),                     /* CEDS00000377 */ 02320005
        2 A_SLC        CHAR(3),                                         02330005
        2 A_EFF_DATE   CHAR(10),                                        02340005
        2 A_END_DATE   CHAR(10);                                        02350005
 /********************************************************************/ 02360005
 /* ON ENDFILE                                                       */ 02370005
 /********************************************************************/ 02380005
 ON ENDFILE (RCBAMB0)                                                   02390005
   BEGIN;                                                               02400005
     EOF_RCBAMB0 = TRUE;                                                02410005
   END;                                                                 02420005
0/********************************************************************/ 02430005
 /*  COUNTS                                                          */ 02440005
 /********************************************************************/ 02450005
 DCL REC_COUNT      FIXED BIN(31)   INIT(0);     /* EOC CEDS00000352 */ 02460005
1/********************************************************************/ 02470005
 /*  BUILTIN FUNCTIONS                                               */ 02480005
 /********************************************************************/ 02490005
0DCL ADDR       BUILTIN;                                                02500005
 DCL NULL       BUILTIN;                                                02510005
 DCL SUBSTR     BUILTIN;                                                02520005
 DCL HIGH       BUILTIN;                                                02530005
 DCL VERIFY     BUILTIN;                                                02540005
1/********************************************************************/ 02550005
 /*  ON ERROR CONDITIONS                                             */ 02560005
 /********************************************************************/ 02570005
0%INCLUDE (RCB0E0M);                                                    02580005
  END;                                                                  02590005
1/********************************************************************/ 02600005
 /*                 S T A R T   P R O C E S S I N G                  */ 02610005
 /********************************************************************/ 02620005
0CALL RCBAMHM_INIT_COMMON;                                              02630005
 IF (PARM_RCBABN0.CSTAC = '3' | PARM_RCBABN0.CSTAC = '4')               02640005
 THEN                                                                   02650005
   DO;                                                                  02660005
     CALL RCBAMHM_INIT_PROCESS;                                         02670005
     CALL RCBAMHM_CHECK_REQUESTED;                                      02680005
     IF WRK_HW_REQUEST_CEDS = '1'                                       02690005
     THEN                                                               02700005
       DO;                                                              02710005
         CALL RCBAMHM_WRITE_HEADER;                                     02720005
         CALL RCBAMHM_CREATE_REF0110;                                   02730005
         CALL RCBAMHM_WRITE_REF0110;                                    02740005
         IF PARM_RCBABN0.CSTAC ¬= PARM_RCBABN0.CSTXA                    02750005
         THEN                                                           02760005
           DO;                                                          02770005
             CALL RCBAMHM_CREATE_CRT0110;                               02780005
             CALL RCBAMHM_WRITE_CRT0110;                                02790005
           END;                                                         02800005
         CALL RCBAMHM_CREATE_CRT0220;                                   02810005
         IF REC_CRT0220.TYPE_OF_WARRANTY = '' /* JUST CREATED 220    */ 02820005
         THEN                                 /* INDICATES NO WAR    */ 02830005
           DO;                                        /* SOC PTM1072 */ 02840005
             IF VERIFY(REC_CRT0220.TYPE_OF_MAINT,TPMNT_ST1)=0           02850005
             THEN DO;                                                   02860005
               PARM_RCBZ32S.INAREA = REC_CRT0220, BY NAME;              02870005
               PARM_RCBZ32S.MODEL = PARM_RCBABN0.CMMAB;                 02880005
               PARM_RCBZ32S.END_DATE = REC_CRT0220.END_DATE;            02890005
               CALL RCB023M(ADDR(PARM_RCBZ32S),                         02900005
                            PTR_INT_AREA);                              02910005
               IF PARM_RCBZ32S.SERVICE_LVL_CODE_1 ¬= WRK_HI3            02920005
               THEN DO;                                                 02930005
                 REC_CRT0220.SERVICE_LVL_CODE =                         02940005
                                   PARM_RCBZ32S.SERVICE_LVL_CODE_1;     02950005
                 REC_CRT0220.INDNULL(7) = 0;                            02960005
               END;                                                     02970005
             END;                                     /* EOC PTM1072 */ 02980005
             CALL RCBAMHM_WRITE_CRT0220;                                02990005
           END;                                                         03000005
         ELSE                              /* IT INDICATES WARRANTY  */ 03010005
           DO;                             /* CALCULATE WED AND SLC'S*/ 03020005
                                                      /* SOC PTM1072 */ 03030005
             PARM_RCBZ32S.INAREA = REC_CRT0220, BY NAME;                03040005
             PARM_RCBZ32S.MODEL = PARM_RCBABN0.CMMAB;                   03050005
             PARM_RCBZ32S.END_DATE = REC_CRT0220.END_DATE;              03060005
             PARM_RCBZ32S.TYPE_OF_WARRANTY =                            03070005
                                       REC_CRT0220.TYPE_OF_WARRANTY;    03080005
             CALL RCB023M(ADDR(PARM_RCBZ32S),                           03090005
                          PTR_INT_AREA);                                03100005
             IF REC_CRT0220.END_DATE = ''  /* NO WED FROM SOF */        03110005
             THEN DO;                                                   03120005
               IF PARM_RCBZ32S.END_DATE = ''                            03130005
               THEN                                                     03140005
                  PARM_RCBZ32S.END_DATE = PARM_RCBZ32S.EFFECTIVE_DATE;  03150005
               REC_CRT0220.END_DATE = PARM_RCBZ32S.END_DATE;            03160005
               REC_CRT0220.WARRANTY_EXP_DATE = PARM_RCBZ32S.END_DATE;   03170005
               WRK_WARRANTY_EXP_DATE = PARM_RCBZ32S.END_DATE;           03180005
             END;                                     /* EOC PTM1072 */ 03190005
                                             /* CHECK WED >= HK. DATE */03200005
             CALL RCB022M (ADDR (PARM_RCBABN0.RCYAA),   /* CTRYNO    */ 03210005
                           ADDR (REC_CRT0220.END_DATE), /* WED       */ 03220005
                           ADDR (WRK_HKP_DATE),                         03230005
                           PTR_INT_AREA);                               03240005
             IF WRK_HKP_DATE = ''            /* I.E. WED >= HK. DATE */ 03250005
             THEN                                                       03260005
               DO;                                    /* SOC PTM1072 */ 03270005
                 CALL RCBAMHM_DET_WAR_SLC; /* SET UP THE SLC(S)      */ 03280005
               END;                                   /* EOC PTM1072 */ 03290005
           END;                                                         03300005
         IF PARM_RCBABN0.CAGAA ¬= PARM_RCBABN0.CAGXA                    03310005
         THEN                                                           03320005
           DO;                                                          03330005
             CALL RCBAMHM_CREATE_CRT0380;                               03340005
             CALL RCBAMHM_WRITE_CRT0380;                                03350005
           END;                                                         03360005
         CALL RCBAMHM_WRITE_TRAILER;                                    03370005
       END;                                                             03380005
   END;                                                                 03390005
 CALL RCBAMHM_END_PGM;                                                  03400005
1/********************************************************************/ 03410005
 /*      CREATE A REF_RCBT0110 RECORD                                */ 03420005
 /********************************************************************/ 03430005
0RCBAMHM_CREATE_REF0110 : PROC;                                         03440005
                                                                        03450005
 REC_REF0110.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              03460005
 REC_REF0110.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              03470005
 REC_REF0110.REC_ID.TABLE_NUMBER    = '0110';                           03480005
 REC_REF0110.REC_ID.ACTION          = 'R';                              03490005
 REC_REF0110.REC_ID.SOURCE_SYSTEM   = 'S';                              03500005
 REC_REF0110.REC_ID.PROCESS_TYPE    = 'M';                              03510005
 REC_REF0110.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               03520005
                                                                        03530005
 REC_REF0110.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               03540005
 REC_REF0110.ORIGIN                 = WRK_ORIGIN;                       03550005
 REC_REF0110.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              03560005
 REC_REF0110.COUNTRY_NUMBER         =  PARM_RCBABN0.RCYAA;              03570005
 REC_REF0110.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               03580005
                                                                        03590005
 END RCBAMHM_CREATE_REF0110;                                            03600005
1/********************************************************************/ 03610005
 /*      CREATE A CRT_RCBT0110 RECORD                                */ 03620005
 /********************************************************************/ 03630005
0RCBAMHM_CREATE_CRT0110 : PROC;                                         03640005
                                                                        03650005
 REC_CRT0110.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              03660005
 REC_CRT0110.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              03670005
 REC_CRT0110.REC_ID.TABLE_NUMBER    = '0110';                           03680005
 REC_CRT0110.REC_ID.ACTION          = 'I';                              03690005
 REC_CRT0110.REC_ID.SOURCE_SYSTEM   = 'S';                              03700005
 REC_CRT0110.REC_ID.PROCESS_TYPE    = 'M';                              03710005
 REC_CRT0110.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               03720005
                                                                        03730005
 REC_CRT0110.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               03740005
 REC_CRT0110.ORIGIN                 = WRK_ORIGIN;                       03750005
 REC_CRT0110.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              03760005
 REC_CRT0110.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               03770005
 REC_CRT0110.INDNULL (04)           = 0;                                03780005
 REC_CRT0110.STATUS                 = PARM_RCBABN0.CSTAC;               03790005
 REC_CRT0110.INDNULL (05)           = 0;                                03800005
 REC_CRT0110.SOURCE_INDICATOR       = 'S';                              03810005
 REC_CRT0110.INDNULL (06)           = 0;                                03820005
 REC_CRT0110.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               03830005
 REC_CRT0110.END_DATE               = '9999-12-31';                     03840005
                                                                        03850005
 END RCBAMHM_CREATE_CRT0110;                                            03860005
1/********************************************************************/ 03870005
 /*      CREATE A CRT_RCBT0220 RECORD                                */ 03880005
 /*      IF CMCAB(SEE NOTE) INDICATES A TYPE OF WARRANTY (DETERMINED */ 03890005
 /*      BY RCB011M)                                                 */ 03900005
 /*      IF THE WED (DVWAB) IS NOT GIVEN THEN IT WILL BE             */ 03910005
 /*      CALCULATED BY RCB012M.                                      */ 03920005
 /*                                                                  */ 03930005
 /*      IF TYPE OF MAINTENANCE IS FILLED THEN TYPE OF WARRANTY WILL */ 03940005
 /*      NOT BE FILLED, SO ITS INDNULL (05) MUST BE SET TO -1.       */ 03950005
 /*                                                                  */ 03960005
 /*      IF TYPE OF WARRANTY IS FILLED THEN TYPE OF MAINTENANCE WILL */ 03970005
 /*      NOT BE FILLED, SO ITS INDNULL (04) MUST BE SET TO -1.       */ 03980005
 /*                                                                  */ 03990005
 /* NOTE:                                                            */ 04000005
 /*      IF CMCXD NOT BLANK THEN THE VALUE OF CMCXD WILL BE TAKEN    */ 04010005
 /*      INSTEAD OF CMCAB.                                           */ 04020005
 /*                                                                  */ 04030005
 /********************************************************************/ 04040005
0RCBAMHM_CREATE_CRT0220 : PROC;                                         04050005
                                                                        04060005
 WRK_F_TYPE_OF_WARRANTY         = FALSE;             /* CEDS00000336 */ 04070005
                                                                        04080005
 REC_CRT0220.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              04090005
 REC_CRT0220.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              04100005
 REC_CRT0220.REC_ID.TABLE_NUMBER    = '0220';                           04110005
 REC_CRT0220.REC_ID.ACTION          = 'I';                              04120005
 REC_CRT0220.REC_ID.SOURCE_SYSTEM   = 'S';                              04130005
 REC_CRT0220.REC_ID.PROCESS_TYPE    = 'M';                              04140005
 REC_CRT0220.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               04150005
                                                                        04160005
 REC_CRT0220.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               04170005
 REC_CRT0220.ORIGIN                 = WRK_ORIGIN;                       04180005
 REC_CRT0220.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              04190005
 REC_CRT0220.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               04200005
 REC_CRT0220.SERVICE_LVL_CODE       = '';             /* SOC PTM1072 */ 04210005
 REC_CRT0220.INDNULL(7)             = -1;             /* EOC PTM1072 */ 04220005
 PARM_RCBZ23S.CUSTOMER_NUMBER       = PARM_RCBABN0.RCUAF;               04230005
0IF PARM_RCBABN0.CMCXD ¬= ' '                                           04240005
 THEN                                                                   04250005
   PARM_RCBZ23S.VALUE               = PARM_RCBABN0.CMCXD;               04260005
 ELSE                                                                   04270005
   PARM_RCBZ23S.VALUE               = PARM_RCBABN0.CMCAB;               04280005
 CALL RCB011M (PTR_RCBZ23S,                                             04290005
               PTR_INT_AREA);                                           04300005
 IF PARM_RCBZ23S.TPMNT_DEFAULTED     /* ISSUE DEFAULTED MESSAGE      */ 04310005
 THEN                                                                   04320005
   DO;                                                                  04330005
     CALL RCBAMHM_ISSUE_MSG_0010;                                       04340005
   END;                                                                 04350005
 IF PARM_RCBZ23S.TPMNT_IND           /* IT WAS A TYPE OF MAINTENANCE */ 04360005
 THEN                                                                   04370005
   DO;                                                                  04380005
     REC_CRT0220.TYPE_OF_MAINT        = PARM_RCBZ23S.TPMNT_WAR_VALUE;   04390005
     REC_CRT0220.END_DATE             = '9999-12-31';                   04400005
     REC_CRT0220.INDNULL (06)         = -1;     /* TYPE OF WARRANTY  */ 04410005
     REC_CRT0220.INDNULL (08)         = -1;     /* WARRANTY EXP DATE */ 04420005
     REC_CRT0220.F_TYPE_OF_WARRANTY   = '';           /* SOC RB01281 */ 04430005
     REC_CRT0220.INDNULL(13)          = -1;                             04440005
     REC_CRT0220.F_SPLT_DATE          = '';                             04450005
     REC_CRT0220.INDNULL(14)          = -1;           /* EOC RB01281 */ 04460005
   END;                                                                 04470005
 ELSE                                /* IT WAS A TYPE OF WARRANTY    */ 04480005
   DO;                                                     /* RC01116 */04490005
     REC_CRT0220.TYPE_OF_WARRANTY = PARM_RCBZ23S.TPMNT_WAR_VALUE;       04500005
     REC_CRT0220.INDNULL (05)     = -1;                                 04510005
     IF PARM_RCBABN0.DVWAB ¬= 0      /* WED WAS GIVEN                */ 04520005
     THEN                                                               04530005
       DO;                                            /* SOC PTM1097 */ 04540005
         PARM_RCBZ03S.WD_IN_FORMAT  = 'YYDDD';        /* CONVERT WED */ 04550005
         PARM_RCBZ03S.WD_OUT_FORMAT = 'ISO';                            04560005
         PARM_RCBZ03S.WD_FUNCTION   = 'C';                              04570005
         WRK_DATE_PIC_YYDDD         =  PARM_RCBABN0.DVWAB;              04580005
         PARM_RCBZ03S.WD_IN_DATE    =  WRK_DATE_PIC_YYDDD;              04590005
         CALL RCB004M (PTR_RCBZ03S);                                    04600005
         IF PARM_RCBZ03S.WD_STATUS = ' '                                04610005
         THEN                                                           04620005
           DO;                                                          04630005
             WRK_WARRANTY_EXP_DATE =                                    04640005
                         SUBSTR (PARM_RCBZ03S.WD_OUT_DATE,1,10);        04650005
           END;                                                         04660005
         ELSE                                                           04670005
           DO;                                                          04680005
             CALL RCBAMHM_INVALID_DATE_MSG (PARM_RCBZ03S.WD_STATUS,     04690005
                                            WRK_DATE_PIC_YYDDD);        04700005
             CALL RCBAMHM_ERROR (NULL,                                  04710005
                                'OTHER',                                04720005
                                '#001');                                04730005
           END;                                                         04740005
                                                                        04750005
         IF WRK_WARRANTY_EXP_DATE < WRK_EFFECTIVE_DATE   /* = DVIAA  */ 04760005
                                                         /* OR DVXAH */ 04770005
         THEN                                                           04780005
           DO;                                           /* = DVIAA  */ 04790005
             WRK_WARRANTY_EXP_DATE = WRK_EFFECTIVE_DATE; /* OR DVXAH */ 04800005
           END;                                                         04810005
                                                                        04820005
         REC_CRT0220.WARRANTY_EXP_DATE = WRK_WARRANTY_EXP_DATE;         04830005
         REC_CRT0220.END_DATE = WRK_WARRANTY_EXP_DATE; /* EOC PTM1097 */04840005
       END;                           /* WED WAS GIVEN                */04850005
     ELSE                             /* CALCULATE WED                */04860005
       DO;                                                 /* RC01116 */04870005
         /* BLANK ENDDATE SO RCB023M WILL CALCULATE WED */              04880005
         REC_CRT0220.END_DATE = '';                                     04890005
       END;                                                             04900005
     IF WRK_VALID_INST_DATE = TRUE                    /* CEDS00000336 */04910005
             & SWITCH_EMPTY_T690 = FALSE              /* CEDS00000352 */04920005
     THEN                                             /* CEDS00000336 */04930005
     CALL RCBAMHM_RETRIEVE_FLEX_WARR;                  /* SOC RB01281 */04940005
     IF WRK_F_TYPE_OF_WARRANTY = TRUE                                   04950005
     THEN                                                               04960005
       DO;                                                              04970005
         REC_CRT0220.F_TYPE_OF_WARRANTY = WRK_F_TOW;                    04980005
         REC_CRT0220.INDNULL(13) = 99;               /* CEDS00000345 */ 04990005
         WRK_F_SPLT_DATE = RCBAMHM_CALC_DATE(                           05000005
                 WRK_EFFECTIVE_DATE,'M',T690_ARRAY.A_B_W_MNTHS(I));     05010005
                                                      /* CEDS00000352 */05020005
         REC_CRT0220.F_SPLT_DATE = RCBAMHM_CALC_DATE(                   05030005
                                               WRK_F_SPLT_DATE,'D',-1); 05040005
         REC_CRT0220.INDNULL(14) =  99;              /* CEDS00000345 */ 05050005
         IF (REC_CRT0220.F_SPLT_DATE <=         /* SOC CEDS00000345 */  05060005
                                REC_CRT0220.WARRANTY_EXP_DATE)          05070005
         THEN                                                           05080005
           DO;                                                          05090005
            REC_CRT0220.INDNULL(13) = 0;                                05100005
            REC_CRT0220.INDNULL(14) = 0;                                05110005
           END;                                  /* EOC CEDS00000345 */ 05120005
             IF T690_ARRAY.A_SLC(I)  ¬= WRK_LOW3     /* CEDS00000352 */ 05130005
             & T690_ARRAY.A_SLC_NULLIND(I) ¬= 'FF'X  /* CEDS00000377 */ 05140005
             & REC_CRT0220.F_SPLT_DATE <=            /* CEDS00000345 */ 05150005
                 REC_CRT0220.WARRANTY_EXP_DATE       /* CEDS00000345 */ 05160005
             THEN                                                       05170005
               DO;                                                      05180005
                 REC_CRT0220.SERVICE_LVL_CODE =                         05190005
                             T690_ARRAY.A_SLC(I);    /* CEDS00000352 */ 05200005
                 REC_CRT0220.INDNULL(7) = 0;                            05210005
                 SWITCH_F_SLC = TRUE;                                   05220005
               END;                                                     05230005
       END;                                                             05240005
     ELSE                          /* NOT A FLEXIBLE WARRANTY MACHINE */05250005
       DO;                                                              05260005
          REC_CRT0220.INDNULL(13) = -1;               /* FLEXIBLE TOW */05270005
          REC_CRT0220.INDNULL(14) = -1;        /* FLEXIBLE SPILT DATE */05280005
       END;                                             /* EOC RB01281*/05290005
   END;                                                                 05300005
 REC_CRT0220.EFFECTIVE_DATE = WRK_EFFECTIVE_DATE;                       05310005
                                                                        05320005
 END RCBAMHM_CREATE_CRT0220;                                            05330005
1/********************************************************************/ 05340005
 /*      DETERMINE WARRANTY SLC VALUES                 SOC PTM1072   */ 05350005
 /*                                                                  */ 05360005
 /*                                                                  */ 05370005
 /*                                                                  */ 05380005
 /*      IN THE CREATE RCT0220 ROUTINE TEH EFFECTIVE DATE HAS BEEN   */ 05390005
 /*      CHANGED FROM WRK_EFFECTIVE DATE TO DVIAA (INSTALLATION?)    */ 05400005
 /*      IN CASE THE BOX IS UNDER WARRANTY                           */ 05410005
 /*      THEREFOR USING SLC FROM THAT DATE IS ALLOWED                */ 05420005
 /*                                                                  */ 05430005
 /********************************************************************/ 05440005
 RCBAMHM_DET_WAR_SLC: PROC;                                             05450005
                                                                        05460005
 IF PARM_RCBZ32S.SERVICE_LVL_CODE_1 ¬= WRK_HI3                          05470005
 THEN DO;                                                               05480005
   IF SWITCH_F_SLC = FALSE                                 /* RB01281 */05490005
   THEN DO;                                                /* RB01281 */05500005
      REC_CRT0220.SERVICE_LVL_CODE =                                    05510005
                       PARM_RCBZ32S.SERVICE_LVL_CODE_1;                 05520005
      REC_CRT0220.INDNULL(7) = 0;                                       05530005
   END;                                                    /* RB01281 */05540005
   REC_CRT0220.WARRANTY_EXP_DATE =                                      05550005
                     PARM_RCBZ32S.END_DATE;                             05560005
   IF PARM_RCBZ32S.SERVICE_LVL_CODE_2 ¬= WRK_HI3                        05570005
     THEN DO;                                                           05580005
       REC_CRT0220.END_DATE = PARM_RCBZ32S.END_DATE_1;                  05590005
       CALL RCBAMHM_WRITE_CRT0220;                                      05600005
       REC_CRT0220.EFFECTIVE_DATE =                                     05610005
                   PARM_RCBZ32S.START_DATE_2;                           05620005
       REC_CRT0220.END_DATE = PARM_RCBZ32S.END_DATE;                    05630005
       REC_CRT0220.SERVICE_LVL_CODE =                                   05640005
                         PARM_RCBZ32S.SERVICE_LVL_CODE_2;               05650005
     END;                                                               05660005
 END;                                                                   05670005
 ELSE                                                                   05680005
   DO;                                                                  05690005
     IF SWITCH_F_SLC = TRUE                          /* SOC RB01281 */  05700005
     THEN                                                               05710005
         REC_CRT0220.INDNULL(7)          = 0;                           05720005
     ELSE                                            /* EOC RB01281 */  05730005
         REC_CRT0220.INDNULL(7)           = -1;                         05740005
   END;                                                                 05750005
 CALL RCBAMHM_WRITE_CRT0220;                                            05760005
 END RCBAMHM_DET_WAR_SLC;                             /* EOC PTM1072 */ 05770005
1/********************************************************************/ 05780005
 /*      CREATE A CRT_RCBT0380 RECORD                                */ 05790005
 /********************************************************************/ 05800005
0RCBAMHM_CREATE_CRT0380 : PROC;                                         05810005
                                                                        05820005
 REC_CRT0380.COUNTRY_ID             =  PARM_RCBABN0.RCYAA;              05830005
 REC_CRT0380.EFFECTIVE_DATE_TXN     =  WRK_EFFECTIVE_DATE;              05840005
 REC_CRT0380.REC_ID.TABLE_NUMBER    = '0380';                           05850005
 REC_CRT0380.REC_ID.ACTION          = 'I';                              05860005
 REC_CRT0380.REC_ID.SOURCE_SYSTEM   = 'S';                              05870005
 REC_CRT0380.REC_ID.PROCESS_TYPE    = 'M';                              05880005
 REC_CRT0380.REC_ID.SOURCE_TXN_ID   = PARM_RCBABN0.RPGAD;               05890005
                                                                        05900005
 REC_CRT0380.PRODUCT_TYPE           = PARM_RCBABN0.CMAAB;               05910005
 REC_CRT0380.ORIGIN                 = WRK_ORIGIN;                       05920005
 REC_CRT0380.SEQUENCE_NUMBER        = WRK_SEQUENCE_NUMBER;              05930005
 REC_CRT0380.COUNTRY_NUMBER         = PARM_RCBABN0.RCYAA;               05940005
 IF PARM_RCBABN0.CAGAA ¬= ' '                                           05950005
 THEN                                                                   05960005
   DO;                                                                  05970005
     REC_CRT0380.TYPE_OF_AGREEMENT      = PARM_RCBABN0.CAGAA;           05980005
     REC_CRT0380.INDNULL (05)           = 0;                            05990005
   END;                                                                 06000005
 ELSE                                                                   06010005
   DO;                                                                  06020005
     REC_CRT0380.INDNULL (05) = -1;                                     06030005
   END;                                                                 06040005
 REC_CRT0380.EFFECTIVE_DATE         = WRK_EFFECTIVE_DATE;               06050005
 REC_CRT0380.END_DATE               = '9999-12-31';                     06060005
                                                                        06070005
 END RCBAMHM_CREATE_CRT0380;                                            06080005
1/********************************************************************/ 06090005
 /*      WRITE HEADER RECORD TO CEDS ACTION FILE                     */ 06100005
 /********************************************************************/ 06110005
0RCBAMHM_WRITE_HEADER : PROC;                                           06120005
 REC_HEADER.TXN_NBR = PARM_CNT.TXN_NBR;                                 06130005
 REC_HEADER.UPSTR_INFO.UPSTR_RUN_DATE = PARM_INT_AREA.RUN_DATE;         06140005
                                                       /* PTM 529 */    06150005
0WRITE FILE (RCBAAC0) FROM (REC_HEADER);                                06160005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   06170005
0PARM_CNT.CNT_BLKS_W    = PARM_CNT.CNT_BLKS_W + 1;                      06180005
0END RCBAMHM_WRITE_HEADER;                                              06190005
1/********************************************************************/ 06200005
 /*      WRITE REF_RCBT0110 RECORD TO CEDS ACTION FILE               */ 06210005
 /********************************************************************/ 06220005
0RCBAMHM_WRITE_REF0110 : PROC;                                          06230005
0WRITE FILE (RCBAAC0) FROM (REC_REF0110);                               06240005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   06250005
0END RCBAMHM_WRITE_REF0110;                                             06260005
1/********************************************************************/ 06270005
 /*      WRITE CRT_RCBT0110 RECORD TO CEDS ACTION FILE               */ 06280005
 /********************************************************************/ 06290005
0RCBAMHM_WRITE_CRT0110 : PROC;                                          06300005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0110);                               06310005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   06320005
0END RCBAMHM_WRITE_CRT0110;                                             06330005
1/********************************************************************/ 06340005
 /*      WRITE CRT_RCBT0220 RECORD TO CEDS ACTION FILE               */ 06350005
 /********************************************************************/ 06360005
0RCBAMHM_WRITE_CRT0220 : PROC;                                          06370005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0220);                               06380005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   06390005
0END RCBAMHM_WRITE_CRT0220;                                             06400005
1/********************************************************************/ 06410005
 /*      WRITE CRT_RCBT0380 RECORD TO CEDS ACTION FILE               */ 06420005
 /********************************************************************/ 06430005
0RCBAMHM_WRITE_CRT0380 : PROC;                                          06440005
0WRITE FILE (RCBAAC0) FROM (REC_CRT0380);                               06450005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   06460005
0END RCBAMHM_WRITE_CRT0380;                                             06470005
1/********************************************************************/ 06480005
 /*      WRITE TRAILER RECORD TO CEDS ACTION FILE                    */ 06490005
 /********************************************************************/ 06500005
0RCBAMHM_WRITE_TRAILER : PROC;                                          06510005
 REC_TRAILER.TXN_NBR = PARM_CNT.TXN_NBR;                                06520005
0WRITE FILE (RCBAAC0) FROM (REC_TRAILER);                               06530005
0PARM_CNT.CNT_RCBAAC0_W = PARM_CNT.CNT_RCBAAC0_W + 1;                   06540005
0END RCBAMHM_WRITE_TRAILER;                                             06550005
1/********************************************************************/ 06560005
 /*      INIT COMMON                                                 */ 06570005
 /********************************************************************/ 06580005
0RCBAMHM_INIT_COMMON : PROC;                                            06590005
0                                        /* SET LEVEL AND MOD NAME   */ 06600005
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            06610005
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     06620005
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = WRK_MOD_NAME;                  06630005
 PARM_INT_AREA.COUNTRY_NUMBER          = PARM_RCBABN0.RCYAA;            06640005
                                                                        06650005
 END RCBAMHM_INIT_COMMON;                                               06660005
1/********************************************************************/ 06670005
 /*                                                                  */ 06680005
 /* MODULE NAME     : RCBAMHM_CHECK_REQUESTED                        */ 06690005
 /*                                                                  */ 06700005
 /* DESCRIPTION     : CHECK WHETHER A PRODUCT IS CURRENTLY           */ 06710005
 /*                   REQUESTED BY CEDS (THAT MEANS THAT HW_REQUEST_ */ 06720005
 /*                   CEDS EQ. '1' AND THE COMPLETION DATE ¬= BLANK) */ 06730005
 /*                                                                  */ 06740005
 /*                   IF THE PRODUCT IS CURRENTLY REQUESTED THE TXN  */ 06750005
 /*                   EFFECTIVE DATE MUST BE >= EFFECTIVE DATE OF    */ 06760005
 /*                   THE RCBT0070 RECORD. IF NOT IT WILL BE SET TO  */ 06770005
 /*                   THIS DATE AND MESSAGE 0170 WILL BE ISSUED.     */ 06780005
 /*                                                                  */ 06790005
 /*               '0'  A  '1' (HW_REQUEST_CEDS)                      */ 06800005
 /*   T0070 :  |------||------------------------>                    */ 06810005
 /*               B                                                  */ 06820005
 /*   TXN   :     |----------------------------->                    */ 06830005
 /*                                                                  */ 06840005
 /*   TXN EFFECTIVE DATE WILL BE SET FROM B TO A                     */ 06850005
 /*                                                                  */ 06860005
 /********************************************************************/ 06870005
0RCBAMHM_CHECK_REQUESTED : PROC;                                        06880005
0CALL RCB017M (PARM_RCBABN0.RCYAA,           /* COUNTRY NUMBER */       06890005
               PARM_RCBABN0.CMAAB,           /* PRODUCT_TYPE   */       06900005
               WRK_TXN_DATE,                                            06910005
               WRK_HW_REQUEST_CEDS,                                     06920005
               WRK_RCBT0070_EFF_DATE,                   /* RB01140   */ 06930005
               PTR_INT_AREA);                                           06940005
0IF (WRK_RCBT0070_EFF_DATE ¬= '' &                      /* RB01140   */ 06950005
     WRK_EFFECTIVE_DATE < WRK_RCBT0070_EFF_DATE)        /* RB01140   */ 06960005
 THEN                                                                   06970005
   DO;                                                                  06980005
     CALL RCBAMHM_ISSUE_MSG_0170;                                       06990005
     WRK_EFFECTIVE_DATE = WRK_RCBT0070_EFF_DATE;        /* RB01140   */ 07000005
   END;                                                                 07010005
0END RCBAMHM_CHECK_REQUESTED;                                           07020005
1/********************************************************************/ 07030005
 /*      INITIALISE                                                  */ 07040005
 /*      CONVERT ALL DATES                                           */ 07050005
 /********************************************************************/ 07060005
0RCBAMHM_INIT_PROCESS : PROC;                                           07070005
0REC_HEADER                       =  '';                                07080005
 REC_TRAILER                      =  '';                                07090005
 REC_HEADER.REC_ID.TABLE_NUMBER   =  '0000';                            07100005
 REC_TRAILER.REC_ID.TABLE_NUMBER  =  '9999';                            07110005
 REC_HEADER.COUNTRY_ID            =  PARM_RCBABN0.RCYAA;                07120005
 REC_TRAILER.COUNTRY_ID           =  PARM_RCBABN0.RCYAA;                07130005
 REC_REF0110             =  '';                                         07140005
 REC_CRT0110             =  '';                                         07150005
 REC_CRT0110.INDNULL (*) =  99;                                         07160005
 REC_CRT0220             =  '';                                         07170005
 REC_CRT0380             =  '';                                         07180005
 REC_CRT0380.INDNULL (*) =  99;                                         07190005
                                                                        07200005
0PARM_RCBZ32S            =  '';                           /* PTM1072 */ 07210005
0PTR_RCBZ02S             =  ADDR (PARM_RCBZ02S);                        07220005
 PTR_RCBZ03S             =  ADDR (PARM_RCBZ03S);                        07230005
 PTR_RCBZ23S             =  ADDR (PARM_RCBZ23S);                        07240005
 PTR_RCBV500             =  ADDR (TB_RCBV500);         /* SOC RB01281 */07250005
 PTR_RCBV500I            =  ADDR (TB_RCBV500_I);                        07260005
 PTR_RETURN_AREA         =  ADDR (RETURN_AREA);        /* EOC RB01281 */07270005
                                                                        07280005
0PARM_RCBZ03S               =  '';                                      07290005
 PARM_RCBZ03S.WD_IN_FORMAT  = 'YYDDD';           /* CONVERT TXN.DATE  */07300005
 PARM_RCBZ03S.WD_OUT_FORMAT = 'ISO';             /* FROM YYDDD TO ISO */07310005
 PARM_RCBZ03S.WD_FUNCTION   = 'C';               /* (YYYY-MM-DD)      */07320005
 IF PARM_RCBABN0.DVIAA = 0                        /* SOC CEDS00000336 */07330005
 THEN                                                                   07340005
   WRK_VALID_INST_DATE = FALSE;                   /* EOC CEDS00000336 */07350005
 WRK_DATE_PIC_YYDDD         =  PARM_RCBABN0.DVXAH;                      07360005
 PARM_RCBZ03S.WD_IN_DATE    =  WRK_DATE_PIC_YYDDD;                      07370005
 CALL RCB004M (PTR_RCBZ03S);                                            07380005
0IF PARM_RCBZ03S.WD_STATUS = ' '                                        07390005
 THEN                                                                   07400005
   DO;                                                                  07410005
     WRK_TXN_DATE = SUBSTR (PARM_RCBZ03S.WD_OUT_DATE,1,10);             07420005
   END;                                                                 07430005
0ELSE                                                                   07440005
   DO;                                                                  07450005
     CALL RCBAMHM_INVALID_DATE_MSG (PARM_RCBZ03S.WD_STATUS,             07460005
                                    WRK_DATE_PIC_YYDDD);                07470005
     CALL RCBAMHM_ERROR (NULL,                                          07480005
                        'OTHER',                                        07490005
                        '#002');                                        07500005
   END;                                                                 07510005
                                                                        07520005
 PARM_INT_AREA.RUN_DATE                = WRK_TXN_DATE;                  07530005
                                                                        07540005
0IF PARM_RCBABN0.CSTAC ¬= PARM_RCBABN0.CSTXA     /* CHECK WHICH DATE  */07550005
 THEN                                            /* MUST BE USED AS   */07560005
   DO;                                           /* EFFECTIVE DATE    */07570005
     WRK_DATE_PIC_YYDDD       =  PARM_RCBABN0.DVIAA;                    07580005
     PARM_RCBZ03S.WD_IN_DATE  =  WRK_DATE_PIC_YYDDD;                    07590005
     CALL RCB004M (PTR_RCBZ03S);                                        07600005
     IF PARM_RCBZ03S.WD_STATUS = ' '                                    07610005
     THEN                                                               07620005
       DO;                                                              07630005
         WRK_EFFECTIVE_DATE = SUBSTR (PARM_RCBZ03S.WD_OUT_DATE,1,10);   07640005
       END;                                                             07650005
     ELSE                                                               07660005
       DO;                                                              07670005
         CALL RCBAMHM_INVALID_DATE_MSG (PARM_RCBZ03S.WD_STATUS,         07680005
                                        WRK_DATE_PIC_YYDDD);            07690005
         CALL RCBAMHM_ERROR (NULL,                                      07700005
                            'OTHER',                                    07710005
                            '#003');                                    07720005
       END;                                                             07730005
   END;                                                                 07740005
 ELSE                                                                   07750005
   DO;                                                                  07760005
     WRK_EFFECTIVE_DATE = WRK_TXN_DATE;                                 07770005
   END;                                                                 07780005
                                                                        07790005
 CALL RCBAMHM_GET_F_TOW_RCB063;                          /* RB01281 */  07800005
 CALL RCBAMHM_GET_F_REC_RCBT690;                    /* CEDS00000352 */  07810005
                                                                        07820005
0WRK_ORIGIN              =  SUBSTR (PARM_RCBABN0.RMAAB,1,2);            07830005
 WRK_SEQUENCE_NUMBER     =  '00' || SUBSTR (PARM_RCBABN0.RMAAB,3,5);    07840005
 WRK_HI3                 = HIGH(3);                       /* PTM1072 */ 07850005
 WRK_LOW3                = LOW(3);                        /* RB01281 */ 07860005
 SWITCH_F_SLC            = FALSE;                         /* RB01281 */ 07870005
0END RCBAMHM_INIT_PROCESS;                                              07880005
                                                                        07890005
 /********************************************************************/ 07900005
 /*                                                                  */ 07910005
 /* MODULE NAME      : RETRIEVE_FLEX_WARR             /* SOC RB01281 */ 07920005
 /*                                                                  */ 07930005
 /* DESCRIPTION      : CHECK WHETHER THE MACHINE IS A FLEXIBLE       */ 07940005
 /*                    WARRANTY MACHINE.                             */ 07950005
 /*                                                                  */ 07960005
 /********************************************************************/ 07970005
 RCBAMHM_RETRIEVE_FLEX_WARR: PROC;                                      07980005
                                                                        07990005
 DCL WRK_FW_COUNTRY_NUMBER CHAR(03);                                    08000005
 DCL WRK_FW_TYPE        CHAR(04);                                       08010005
 DCL WRK_FW_MODEL       CHAR(03);                                       08020005
 WRK_FW_COUNTRY_NUMBER =  PARM_RCBABN0.RCYAA;                           08030005
 WRK_FW_TYPE   = PARM_RCBABN0.CMAAB;                                    08040005
 WRK_FW_MODEL  = PARM_RCBABN0.CMMAB;                                    08050005
                                                                        08060005
 DO J = 1 TO REC_COUNT BY 1;                     /* SOC CEDS00000352 */ 08070005
                                                 /* SOC CEDS00000399 */ 08080005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &       */ 08090005
     IF  T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &           08100005
                                                 /* EOC CEDS00000399 */ 08110005
         T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &           08120005
         T690_ARRAY.A_MODEL(J)     =  WRK_FW_MODEL          &           08130005
                                                 /* SOC CEDS00000399 */ 08140005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          08150005
          T690_ARRAY.A_END_DATE(J)))                                 */ 08160005
         T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &           08170005
         WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)          08180005
                                                 /* EOC CEDS00000399 */ 08190005
     THEN DO;                                                           08200005
           WRK_F_TYPE_OF_WARRANTY = TRUE;                               08210005
           I = J;                                                       08220005
           J = REC_COUNT;                                               08230005
         END;                                                           08240005
     ELSE                                                               08250005
        WRK_F_TYPE_OF_WARRANTY = FALSE;                                 08260005
 END;                                                                   08270005
                                                                        08280005
 IF WRK_F_TYPE_OF_WARRANTY = FALSE THEN                                 08290005
 DO J = 1 TO REC_COUNT BY 1;                                            08300005
                                                 /* SOC CEDS00000399 */ 08310005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &       */ 08320005
     IF  T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &           08330005
                                                 /* EOC CEDS00000399 */ 08340005
         T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &           08350005
         T690_ARRAY.A_MODEL(J)     =  '***'                 &           08360005
                                                 /* SOC CEDS00000399 */ 08370005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          08380005
          T690_ARRAY.A_END_DATE(J)))                                 */ 08390005
         T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &           08400005
         WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)          08410005
                                                 /* EOC CEDS00000399 */ 08420005
     THEN DO;                                                           08430005
           WRK_F_TYPE_OF_WARRANTY = TRUE;                               08440005
           I = J;                                                       08450005
           J = REC_COUNT;                                               08460005
         END;                                                           08470005
     ELSE                                                               08480005
        WRK_F_TYPE_OF_WARRANTY = FALSE;                                 08490005
 END;                                                                   08500005
                                                                        08510005
 IF WRK_F_TYPE_OF_WARRANTY = FALSE THEN                                 08520005
 DO J = 1 TO REC_COUNT BY 1;                                            08530005
                                                 /* SOC CEDS00000399 */ 08540005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  '***'                 &       */ 08550005
     IF  T690_ARRAY.A_COUNTRY(J)   =  '***'                 &           08560005
                                                 /* EOC CEDS00000399 */ 08570005
         T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &           08580005
         T690_ARRAY.A_MODEL(J)     =  WRK_FW_MODEL          &           08590005
                                                 /* SOC CEDS00000399 */ 08600005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          08610005
          T690_ARRAY.A_END_DATE(J)))                                 */ 08620005
         T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &           08630005
         WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)          08640005
                                                 /* EOC CEDS00000399 */ 08650005
     THEN DO;                                                           08660005
           WRK_F_TYPE_OF_WARRANTY = TRUE;                               08670005
           I = J;                                                       08680005
           J = REC_COUNT;                                               08690005
         END;                                                           08700005
     ELSE                                                               08710005
        WRK_F_TYPE_OF_WARRANTY = FALSE;                                 08720005
 END;                                                                   08730005
                                                                        08740005
 IF WRK_F_TYPE_OF_WARRANTY = FALSE THEN                                 08750005
 DO J = 1 TO REC_COUNT BY 1;                                            08760005
                                                 /* SOC CEDS00000399 */ 08770005
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  '***'                 &       */ 08780005
     IF  T690_ARRAY.A_COUNTRY(J)   =  '***'                 &           08790005
                                                 /* EOC CEDS00000399 */ 08800005
         T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &           08810005
         T690_ARRAY.A_MODEL(J)     =  '***'                 &           08820005
                                                 /* SOC CEDS00000399 */ 08830005
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE   <=          08840005
          T690_ARRAY.A_END_DATE(J)))                                 */ 08850005
         T690_ARRAY.A_EFF_DATE(J) <=  WRK_EFFECTIVE_DATE    &           08860005
         WRK_EFFECTIVE_DATE       <=  T690_ARRAY.A_END_DATE(J)          08870005
                                                 /* EOC CEDS00000399 */ 08880005
     THEN DO;                                                           08890005
           WRK_F_TYPE_OF_WARRANTY = TRUE;                               08900005
           I = J;                                                       08910005
           J = REC_COUNT;                                               08920005
         END;                                                           08930005
     ELSE                                                               08940005
        WRK_F_TYPE_OF_WARRANTY = FALSE;                                 08950005
 END;                                            /* EOC CEDS00000352 */ 08960005
 END RCBAMHM_RETRIEVE_FLEX_WARR;                                        08970005
                                                                        08980005
 /********************************************************************/ 08990005
 /*                                                                  */ 09000005
 /* MODULE NAME      : GET_F_TOW_RCB063                              */ 09010005
 /*                                                                  */ 09020005
 /* DESCRIPTION      : GET THE FLEXIBLE TYPE OF WARRANTY FROM RCB063 */ 09030005
 /*                    PARAMETER.                                    */ 09040005
 /*                                                                  */ 09050005
 /********************************************************************/ 09060005
                                                                        09070005
 RCBAMHM_GET_F_TOW_RCB063: PROC;                                        09080005
                                                                        09090005
 TB_RCBV500         = '';                                               09100005
 TB_RCBV500_I       = '';                                               09110005
 TB_RCB063.NUMBER   = 'RCB063';                                         09120005
 /* TB_RCB063.FILLER   = 'APN'; */                                      09130005
                                                                        09140005
 CALL RCBI50M ('R',                                /* PASS PARAMETER */ 09150005
                PTR_RCBV500,                                            09160005
                PTR_RCBV500I,                                           09170005
                PTR_RETURN_AREA,                                        09180005
                PTR_INT_AREA);                                          09190005
 SELECT(RETURN_AREA.RETURN_CODE);                                       09200005
  WHEN(0)                                                               09210005
    WRK_F_TOW = SUBSTR(TB_RCB063.F_WARRANTY_MACHINE,1,1);               09220005
  WHEN(4)                                                               09230005
    DO;                                                                 09240005
      PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                    09250005
      PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = 'I050';                  09260005
      PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                     09270005
      PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                    09280005
      PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                          09290005
                                       TB_RCBV500.PARAMETER_NUMBER;     09300005
      CALL RCB0M1M (PTR_INT_AREA);                                      09310005
      CALL RCBAMHM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),                09320005
                            'DB2','#004');                              09330005
    END;                                                                09340005
  OTHERWISE                                                             09350005
    CALL RCBAMHM_ERROR(ADDR(SQLCA),'DB2','#005');                       09360005
 END;                                                                   09370005
                                                                        09380005
 END RCBAMHM_GET_F_TOW_RCB063;                                          09390005
1/********************************************************************/ 09400005
 /*                                                                  */ 09410005
 /* MODULE NAME      : GET_F_REC_RCBT690     CEDS00000352            */ 09420005
 /*                                                                  */ 09430005
 /* DESCRIPTION      : GET THE FLEXIBLE WARRANTY RECORDS FROM T690   */ 09440005
 /*                    INTO T690 ARRAY                               */ 09450005
 /********************************************************************/ 09460005
0RCBAMHM_GET_F_REC_RCBT690: PROC;                                       09470005
 /*   READ FILE TO GET RECORD COUNT FOR ARRAY SIZE */                   09480005
  OPEN   FILE (RCBAMB0);                                                09490005
  DO  WHILE (¬EOF_RCBAMB0);                                             09500005
      READ FILE (RCBAMB0) INTO (FILE_RCBAMB0);                          09510005
      REC_COUNT = REC_COUNT + 1;                                        09520005
  END;                                                                  09530005
                                                                        09540005
  CLOSE   FILE (RCBAMB0);                                               09550005
  EOF_RCBAMB0   = FALSE;                                                09560005
                                                                        09570005
  IF REC_COUNT > 0 THEN                                                 09580005
   DO;                                                                  09590005
     ALLOCATE T690_ARRAY;                                               09600005
     /* READ THE FILE TO LOAD THE DATA INTO ARRAY */                    09610005
     OPEN FILE (RCBAMB0);                   /* IN  - TABLE 690 TABLE */ 09620005
     DO K = 1 TO REC_COUNT BY 1;                                        09630005
       READ FILE (RCBAMB0) INTO (FILE_RCBAMB0);                         09640005
                                                                        09650005
       T690_ARRAY.A_COUNTRY(K)   = FILE_RCBAMB0.COUNTRY_NUMBER;         09660005
       T690_ARRAY.A_TYPE(K)      = FILE_RCBAMB0.PRODUCT_TYPE;           09670005
       T690_ARRAY.A_MODEL(K)     = FILE_RCBAMB0.MODEL_NUMBER;           09680005
       T690_ARRAY.A_B_W_MNTHS(K) = FILE_RCBAMB0.BRAND_WARRANTY_MNT;     09690005
       T690_ARRAY.A_SLC_NULLIND(K)                   /* CEDS00000377 */ 09700005
             =  FILE_RCBAMB0.NULL_SERVICE_LVL_CODE;  /* CEDS00000377 */ 09710005
       T690_ARRAY.A_SLC(K)       = FILE_RCBAMB0.SERVICE_LVL_CODE;       09720005
       T690_ARRAY.A_EFF_DATE(K)  = FILE_RCBAMB0.EFFECTIVE_DATE;         09730005
       T690_ARRAY.A_END_DATE(K)  = FILE_RCBAMB0.END_DATE;               09740005
     END;                                                               09750005
   END;                                                                 09760005
  ELSE                                                                  09770005
    SWITCH_EMPTY_T690 = TRUE;                                           09780005
                                                                        09790005
 CLOSE FILE (RCBAMB0);                                                  09800005
                                                                        09810005
0END RCBAMHM_GET_F_REC_RCBT690;                                         09820005
 /********************************************************************/ 09830005
 /*                                                                  */ 09840005
 /* MODULE NAME      : CALC_DATE                                     */ 09850005
 /*                                                                  */ 09860005
 /* DESCRIPTION      : PROCESS DATE USING RCB004M                    */ 09870005
 /*                                                                  */ 09880005
 /********************************************************************/ 09890005
                                                                        09900005
 RCBAMHM_CALC_DATE: PROC   (EFF_DATE,                                   09910005
                            CALC_TYPE,                                  09920005
                            CALC_VALUE) RETURNS(CHAR(10));              09930005
                                                                        09940005
 DCL EFF_DATE     CHAR(10);                                             09950005
 DCL CALC_TYPE    CHAR(1);                                              09960005
 DCL CALC_VALUE   FIXED DEC(3,0);                                       09970005
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      09980005
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      09990005
 DATE_AREA.WD_FUNCTION    = 'C';                                        10000005
 DATE_AREA.WD_PERIOD_TYPE = CALC_TYPE;                                  10010005
 DATE_AREA.WD_PERIOD      = CALC_VALUE;                                 10020005
 DATE_AREA.WD_IN_DATE     = EFF_DATE;                                   10030005
 CALL RCB004M (ADDR (DATE_AREA));;                                      10040005
 IF DATE_AREA.WD_STATUS ¬= ' '                                          10050005
 THEN                                                                   10060005
   DO;                                                                  10070005
     CALL RCBAMHM_ERROR (NULL,                                          10080005
                         'OTHER',                                       10090005
                         '#006');                                       10100005
   END;                                                                 10110005
                                                                        10120005
 RETURN(DATE_AREA.WD_OUT_DATE);                                         10130005
                                                                        10140005
 END RCBAMHM_CALC_DATE;                               /* EOC RB01281 */ 10150005
1/********************************************************************/ 10160005
 /*      END PROGRAM                                                 */ 10170005
 /********************************************************************/ 10180005
0RCBAMHM_END_PGM : PROC;                                                10190005
0                                        /* RESET LEVEL              */ 10200005
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            10210005
0END RCBAMHM_END_PGM;                                                   10220005
1/********************************************************************/ 10230005
 /*      ISSUE MSG 0010                                              */ 10240005
 /********************************************************************/ 10250005
0RCBAMHM_ISSUE_MSG_0010 : PROC;                                         10260005
0PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         10270005
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'BU';                        10280005
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '0010';                      10290005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_1   = 'HW';                        10300005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_1  = PARM_RCBABN0.CMAAB  ||       10310005
                                           WRK_ORIGIN          ||       10320005
                                           WRK_SEQUENCE_NUMBER;         10330005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6   = 'FN';                        10340005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6  = 'TYPE OF MAINT.';            10350005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7   = 'NV';                        10360005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7  = PARM_RCBZ23S.TPMNT_WAR_VALUE;10370005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8   = 'OV';                        10380005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8  =  PARM_RCBZ23S.VALUE;         10390005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9   = 'TS';                        10400005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9  =  PARM_RCBABN0.QUBCJ;         10410005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_10  = 'TX';                        10420005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_10 = PARM_RCBABN0.RPGAD;          10430005
0CALL RCB0M1M (PTR_INT_AREA);                                           10440005
0END RCBAMHM_ISSUE_MSG_0010;                                            10450005
1/********************************************************************/ 10460005
 /*      ISSUE INVALID DATE MESSAGE 0012                             */ 10470005
 /********************************************************************/ 10480005
0RCBAMHM_INVALID_DATE_MSG : PROC (STATUS,                               10490005
                                  VALUE);                               10500005
0DCL STATUS        CHAR (01);                                           10510005
0DCL VALUE         PIC '99999';                                         10520005
0PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         10530005
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'IS';                        10540005
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '0012';                      10550005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6   = 'DT';                        10560005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6  =  VALUE;                      10570005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7   = 'RC';                        10580005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7  =  STATUS;                     10590005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8   = 'TS';                        10600005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8  =  PARM_RCBABN0.QUBCJ;         10610005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9   = 'TX';                        10620005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9  =  PARM_RCBABN0.RPGAD;         10630005
0CALL RCB0M1M (PTR_INT_AREA);                                           10640005
0END RCBAMHM_INVALID_DATE_MSG;                                          10650005
1/********************************************************************/ 10660005
 /*      ISSUE MSG 0170                                              */ 10670005
 /********************************************************************/ 10680005
0RCBAMHM_ISSUE_MSG_0170 : PROC;                                         10690005
0PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         10700005
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'BU';                        10710005
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '0170';                      10720005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_1   = 'HW';                        10730005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_1  =  PARM_RCBABN0.CMAAB  ||      10740005
                                            WRK_ORIGIN          ||      10750005
                                            WRK_SEQUENCE_NUMBER;        10760005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6   = 'DN';                        10770005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6  = 'EFFECTIVE_DATE';            10780005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7   = 'D1';                        10790005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7  =  WRK_EFFECTIVE_DATE;         10800005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8   = 'D2';                        10810005
                                                        /* RB01140   */ 10820005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8  =  WRK_RCBT0070_EFF_DATE;      10830005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9   = 'TS';                        10840005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9  =  PARM_RCBABN0.QUBCJ;         10850005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_10  = 'TX';                        10860005
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_10 =  PARM_RCBABN0.RPGAD;         10870005
0CALL RCB0M1M (PTR_INT_AREA);                                           10880005
0END RCBAMHM_ISSUE_MSG_0170;                                            10890005
1/********************************************************************/ 10900005
 /*      CALL COMMON ERROR ROUTINE AFTER FILLING VARIABLES           */ 10910005
 /********************************************************************/ 10920005
0RCBAMHM_ERROR : PROC     (PTR_ERROR,                                   10930005
                           ERR_TYPE,                                    10940005
                           CALL_ID);                                    10950005
0DCL PTR_ERROR    POINTER;                                              10960005
 DCL ERR_TYPE     CHAR(8);                                              10970005
 DCL CALL_ID      CHAR(4);                                              10980005
0PARM_INT_AREA.PTR_ERROR      =  PTR_ERROR;                             10990005
 PARM_INT_AREA.ERR_TYPE       =  ERR_TYPE;                              11000005
 PARM_INT_AREA.CALL_ID        =  CALL_ID;                               11010005
0CALL RCB0E1M (PTR_INT_AREA);                                           11020005
0END RCBAMHM_ERROR;                                                     11030005
1/*******************************************************************/  11040005
 /* DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                    */  11050005
 /*******************************************************************/  11060005
0%INCLUDE DAIFPLH ;                   /* COMPILE DATE/TIME STAMP    */  11070005
 $DAIMOD (RCBAMHM);                   /* MODULE TO BE COMPILED      */  11080005
0/*******************************************************************/  11090005
 /* END OF ABR BLOCK                                                */  11100005
 /*******************************************************************/  11110005
0END RCBAMHM;                                                           11120005