 /* RCBBKAM - CHIS CONTRACT: RECEIVE                                 */ 00010000
 /*                                                                  */ 00020000
 /********************************************************************/ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /********************************************************************/ 00070000
 /*                                                                  */ 00080000
 /* MODULE NAME      : RCBBKAM                                       */ 00090000
 /*                                                                  */ 00100000
 /* PROGRAM NAME     : RCBBKAP                                       */ 00110000
 /*                                                                  */ 00120000
 /* LANGUAGE         : PLI                                           */ 00130000
 /*                                                                  */ 00140000
 /* TYPE             : BATCH                                         */ 00150000
 /*                                                                  */ 00160000
 /* DESCRIPTION      : RETRIEVE SERVICE CONTRACT INFORMATION FROM    */ 00170000
 /*                    THE CHIS INTERFACE FILE AND CREATE TABLE      */ 00180000
 /*                    LIKE FILES.                                   */ 00190000
 /*                                                                  */ 00200000
 /* INPUT            : RCBT0070_HW_PO                      (RB01140) */ 00210000
 /*                    RCBT0500_PARM                                 */ 00220000
 /*                                                                  */ 00230000
 /*                    RCBBKZ0 (CHIS INTERFACE FILE WITH ADDED SLC)  */ 00240000
 /*                                                                  */ 00250000
 /* OUTPUT           : RCBBKA1 CONTRACTS                             */ 00260000
 /*                    RCBBKA2 HARDWARE PRODUCT                      */ 00270000
 /*                    RCBBXB2 EXCLUDE FOR WTAAS OWNED MACHINES      */ 00280000
 /*                    RCBBKA3 HARDWARE STATUS                       */ 00290000
 /*                    RCBBKA4 OU / HARDWARE PRODUCT                 */ 00300000
 /*                    RCBBKA5 CUSTOMER / HARDWARE PRODUCT           */ 00310000
 /*                    RCBBKA6 SUPPLY CONTRACTS (SEE NOTE)           */ 00320000
 /*                    RCBBKA7 SERVICE CONTRACTS                     */ 00330000
 /*                    RCBBKA8 HARDWARE PO REALIZATION (MODEL)       */ 00340000
 /*                    RCBBKA9 FEATURES ON HARDWARE PRODUCT          */ 00350000
 /*                    RCBBKAD REAL SERIAL NUMBER          (RB01320) */ 00351000
 /*                    RCBBKAA CUSTOMER / CONTRACTS        (RA01120) */ 00360000
 /*                    RCB0M10 MESSAGES ISSUED                       */ 00370000
 /*                                                                  */ 00380000
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00390000
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00400000
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00410000
 /*                    RCB004M   CHECK/CONVERT DATE                  */ 00420000
 /*                    RCB018M   COMPUTE HASH TOTAL                  */ 00430000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00440000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00450000
 /*                    RCBIAGM   REFERENCE HW_PO        (RB01140)    */ 00460000
 /*                    RCBI50M   REFERENCE PARAMETER                 */ 00470000
 /*                    RCBF50M   INSERT PARAMETER                    */ 00480000
 /*                    RCBG50M   UPDATE PARAMETER                    */ 00490000
 /*                    RCBH50M   DELETE PARAMETER                    */ 00500000
 /*                                                                  */ 00510000
 /*                                                                  */ 00520000
 /*                    RCBBK1U   USER EXIT TO FILL USER FIELDS       */ 00530000
 /*                    RCBBK2U   USER EXIT TO FILL OU CODE           */ 00540000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 00550000
 /*                    RCBBK3U   USER EXIT TO FILL SA_CONTRACT_IND   */ 00560000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 00570000
 /*                                                     SOC RC01302  */ 00571000
 /* RCBBK5U USER EXIT WILL NOT BE USED AS ITS EXISTING FUNCTIONALITY */ 00580000
 /* IS HANDLED SEPARATELY(MESE EXTRACTION MODULE AND MERGE 2 MODULE) */ 00580100
 /* IN CORE CODE - PCR PCEDSP-0025                                   */ 00580200
 /*                                                     EOC RC01302  */ 00580300
 /*                    RCBBK5U   USER EXIT FOR ETS CONTRACTS         */ 00581000
 /*                                                                  */ 00590000
 /* MESSAGES         : 0001 / 0002 / 0003 / 0004 / 0005 / 0007       */ 00600000
 /*                    0013 / 0018 / 0022 / 0173 / 0175 / 0180       */ 00610000
 /*                    0181 / 0196 / 9999                            */ 00620000
 /*                                                                  */ 00630000
 /* NOTE             : FOR EVERY CREATED SERV_CTR (240) A SUPPLY CTR */ 00640000
 /*                    (220) WITH TPMNT = '2' WILL BE WRITTEN.       */ 00650000
 /*                                                                  */ 00660000
 /* DEPENDENCIES     : HAS TO BE NORMAL COMPLETED BEFORE             */ 00670000
 /*                    RUNNING RCBBK../.../RCBBK..                   */ 00680000
 /*                                                                  */ 00690000
 /* FREQUENCY        : USER DEPENDENT (ON REQUEST)                   */ 00700000
 /*                                                                  */ 00710000
 /*  MAINTENANCE LOG :                                               */ 00720000
 /*  ---------------                                                 */ 00730000
 /*                                                                  */ 00740000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00750000
 /*  --------------------------------------------------------------  */ 00760000
 /*  1993-01-19 | RA1033/1034  | CEDS FIRST IMPLEMENTATION           */ 00770000
 /*  1993-08-05 | PTM 0377     | SEE PTM DESCRIPTION                 */ 00780000
 /*  1993-08-05 | PTM 0387     | SEE PTM DESCRIPTION                 */ 00790000
 /*  1993-11-30 | CED0014      | CHANGE FETCH INTO CALL SEE PTM 374  */ 00800000
 /*  1994-01-20 | CED0014      | EXCLUDE WTAAS TRANSACTIONS          */ 00810000
 /*  1994-05-20 | RA01100      | NO TOS TRXNS IF DATE PAST, HVP      */ 00820000
 /*  1994-06-14 | RA01077      | REMOVED MEASUREMENT_VALUE           */ 00830000
 /*  1994-06-29 | PTM 0496     | SEE PTM DESCRIPTION                 */ 00840000
 /*  1994-08-31 | PTM 0536     | RENUMBER INDICATORS                 */ 00850000
 /*  1994-11-23 | RA01120      | CUSTOMER ADDITIONAL SERVICE         */ 00860000
 /*             |              | INDICATOR TO RCMS                   */ 00870000
 /*  1995-06-23 | PTM 712      | CHECK RECORD TYPE FOR NEW TOS       */ 00880000
 /*  1995-08-23 | RB01140      | IMPROVE PERFORMANCE REDUCE NUMBER   */ 00890000
 /*             |              | OF TABLES & HISTORY                 */ 00900000
 /*             |              | TABLE CHANGES                       */ 00910000
 /*  1995-08-23 | RC01141      | IMPROVE MESSAGES                    */ 00920000
 /*             |              | DISPLAY OFFENDING KEYS              */ 00930000
 /*  1997-06-11 | PTM1053      | MERGE SYSTEM-PARAMETERS             */ 00940000
 /*  1997-08-28 | PTM1058      | CONTRACT NUMBER 15 -> 6        (BP) */ 00950000
 /*  1997-09-05 | RC01191      | CEDS ENHANCEMENTS FOR HVP DATA      */ 00960000
 /*  1998-04-20 | PTM1175      | DO NOT CONVERT CONTRACT NUMBERS FOR */ 00970000
 /*             |              |   ITALY.                            */ 00980000
 /*  1998-04-28 | RA01207      | LOCAL MACHINE CONTRACT INTERFACE(KK)*/ 00990000
 /*  1998-08-24 | PTM1175      | DO NOT CONVERT CONTRACT NUMBERS FOR */ 01000000
 /*             |              |   SPAIN (838) AND PORTUGAL (822)    */ 01010000
 /*  1998-11-24 | PTM1175      | DO NOT CONVERT CONTRACT NUMBERS FOR */ 01020000
 /*             |              |   ISRAEL(755,756) GREECE(726)       */ 01030000
 /*             |              |   CYPRUS(666) TURKEY(862)           */ 01040000
 /*  1999-04-26 | PTM1264      | MULTI COUNTRY FILE SEQUENCE NUMBER  */ 01050000
 /*  1999-07-28 | RC01219      | DORO                                */ 01060000
 /*  2001-11-12 | PTM1362      | ERROR FOR NON-CONTIGUOUS CONTRACTS  */ 01070000
 /*  2001-11-21 | RA01229      | SERVICE REFERENCE INTERIM SOLUTION  */ 01080000
 /*  2004-06-30 | RB01242      | INCREASE LENGTH OF SERIAL NUMBER    */ 01090000
 /*  2006-11-06 | -------      | CEDS00000313                        */ 01100000
 /*  2007-08-08 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY       */ 01110000
 /*             |              | MACHINES                            */ 01120000
 /*  2008-04-02 | CEDS00000381 | HANDLING ETS PROCESS                */ 01130000
 /*  2008-12-22 | RB01298      | ALIGNMENT/CHANGES DUE TO HARDBUNDLE */ 01140000
 /*             |              | IMPACT                              */ 01150000
 /*  2009-02-24 | RB01299      | CEDS ALIGNMENT TO CHIS 810          */ 01160000
 /*  2009-03-30 | CEDS00000466 | HANDLING FTOW AND F_SPLT_DATE       */ 01170000
 /*             |              | NULL INDICATORS PROPERLY            */ 01180000
 /*  2009-07-08 | RB01301      | CEDS ALIGNMENT TO CHIS 810 - BAU    */ 01190000
 /*             |              | SERVICE EXTENSIONS                  */ 01200000
 /*  2009-07-08 | RC01302      | PCEDSP-0025: REMOVAL OF USER EXIT   */ 01203000
 /*             |              | RCBBK5U                             */ 01204000
 /*  2010-02-04 | CEDS00000488 | MODIFIED TO OVERWRITE ACTUAL DATA   */ 01205000
 /*             |              | RECORD WITH USER EXIT DATA RECORD.  */ 01206000
 /*  2010-04-07 | CEDS00000517 | COMMENTED THE REFERENCES MADE TO    */ 01207000
 /*             |              | RCBBKAX                             */ 01208000
 /*  2011-01-13 | RB01312      | PCEDSP-0059:DISABLE THE HASH-TOTAL  */ 01209000
 /*             |              | ON LOCAL SERVICE CONTRACT INTERFACE */ 01209100
 /*  2012-02-01 | RB01320      | CEDS 3.3 A17 RELEASE                */ 01209200
 /*  2013-05-29 | CEDS00000635 | UPDATE THE ENTRY RCB024 OF T500     */ 01209370
 /*             |              | WHEN RCBBKZ0 HAS NO DATA RECORDS    */ 01209470
 /*  2013-06-17 | CEDS00000638 | LONG SERIAL IS ASSIGNED TO ORIGIN & */ 01209577
 /*             |              | SEQ_NO ONLY IF SOURCE IS CHIS(UC01) */ 01209676
 /*  2014-03-07 | CEDS00000672 | MODIFIED TO UPDATE CORRECT COVERAGE */ 01209782
 /*             |              | TIME SET FOR ALL RECORDS OF SAME TOS*/ 01209880
 /*  2014-06-13 | CEDS00000687 | MODIFIED TO COPY ALL THE 28 CHARS   */ 01209987
 /*             |              | OF THE LONG SERIAL NUMBER TO OUTPUT */ 01210084
 /*             |              | FILES.                              */ 01210184
 /********************************************************************/ 01211084
1RCBBKAM: PROC                                                          01220000
          OPTIONS (MAIN)                                                01230000
          REORDER;                                                      01240000
-DEFAULT RANGE (*) STATIC;                                              01250000
1/********************************************************************/ 01260000
 /* FILE DECLARATIONS (NON GSAM)                                     */ 01270000
 /********************************************************************/ 01280000
0DCL RCBBKZ0  FILE RECORD INPUT;                                        01290000
0/*DCL RCBBKAX  FILE RECORD INPUT;*/                /* CEDS00000517  */ 01300000
0DCL RCBBXB2  FILE RECORD INPUT;                                        01310000
 /* ----------- RA01120 CHANGE ------------------------------------- */ 01320000
0DCL RCBBKAB  FILE RECORD OUTPUT; /* TEMPORARY SORT FILE FOR RCBBKA1 */ 01330000
 /* ----------- END RA01120 CHANGE --------------------------------- */ 01340000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 01350000
0DCL RCBBKAC  FILE RECORD OUTPUT; /* TEMPORARY SORT FILE FOR RCBBKAA */ 01360000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 01370000
0DCL RCBBKA1  FILE RECORD OUTPUT;                                       01380000
0DCL RCBBKA2  FILE RECORD OUTPUT;                                       01390000
0DCL RCBBKA3  FILE RECORD OUTPUT;                                       01400000
0DCL RCBBKA4  FILE RECORD OUTPUT;                                       01410000
0DCL RCBBKA5  FILE RECORD OUTPUT;                                       01420000
0DCL RCBBKA6  FILE RECORD OUTPUT;                                       01430000
0DCL RCBBKA7  FILE RECORD OUTPUT;                                       01440000
0DCL RCBBKA8  FILE RECORD OUTPUT;                                       01450000
0DCL RCBBKA9  FILE RECORD OUTPUT;                                       01460000
0DCL RCBBKAD  FILE RECORD OUTPUT;                    /* RB01320      */ 01461000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 01470000
0DCL RCBBKAA  FILE RECORD OUTPUT;                                       01480000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 01490000
0DCL RCB0M10  FILE RECORD OUTPUT;                                       01500000
1/********************************************************************/ 01510000
 /* EXTERNAL ENTRIES                                                 */ 01520000
 /********************************************************************/ 01530000
0DCL PLIXOPT   EXTERNAL                                                 01540000
               CHAR (30) VARYING INIT ('ISA(20K),NOSTAE');              01550000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01560000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGE ROUTINE   */ 01570000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* SYSTEM DATE              */ 01580000
 DCL RCB004M   ENTRY  EXTERNAL;          /* CHECK/CONVERT DATE       */ 01590000
 DCL RCB018M   ENTRY  EXTERNAL;          /* COMPUTE HASH TOTAL       */ 01600000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01610000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01620000
 DCL RCBIAGM   ENTRY  EXTERNAL;          /* REFERENCE HW PO (RB01140)*/ 01630000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* REFERENCE PARAMETER      */ 01640000
 DCL RCBF50M   ENTRY  EXTERNAL;          /* INSERT PARAMETER         */ 01650000
 DCL RCBG50M   ENTRY  EXTERNAL;          /* UPDATE PARAMETER         */ 01660000
 DCL RCBH50M   ENTRY  EXTERNAL;          /* DELETE PARAMETER         */ 01670000
 DCL RCBBK1U   ENTRY  EXTERNAL;          /* USER EXIT 1              */ 01680000
 DCL RCBBK2U   ENTRY  EXTERNAL;          /* USER EXIT 2              */ 01690000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 01700000
 DCL RCBBK3U   ENTRY  EXTERNAL;          /* USER EXIT 3              */ 01710000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 01720000
 /*DCL RCBBK5U   ENTRY  EXTERNAL;        /* USER EXIT 5    RC01302   */ 01730000
0/********************************************************************/ 01740000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01750000
 /********************************************************************/ 01760000
0DCL PTR_INT_AREA        PTR;                                           01770000
 DCL PTR_RETURN_AREA     PTR;                                           01780000
 DCL PTR_COUNTRY_AREA    PTR;                                           01790000
 DCL PTR_RUN_DATE_AREA   PTR;                                           01800000
0DCL 1 PARM_INT_AREA,                          /* INTERFACE AREA     */ 01810000
       %INCLUDE (RCBZ01S);;                                             01820000
0DCL 1 RETURN_AREA,                            /* RETURN AREA        */ 01830000
       %INCLUDE (RCBZ02S);;                                             01840000
0DCL 1 DATE_AREA,                              /* DATE AREA          */ 01850000
       %INCLUDE (RCBZ03S);;                                             01860000
0DCL 1 COUNTRY_AREA,                           /* COUNTRY AREA       */ 01870000
       %INCLUDE (RCBZ26S);;                                             01880000
0DCL 1 RUN_DATE_AREA,                          /* RUN DATE AREA      */ 01890000
       %INCLUDE (RCBZ28S);;                                             01900000
0/********************************************************************/ 01910000
 /* POINTERS                                                         */ 01920000
 /********************************************************************/ 01930000
0DCL PTR_RCBBKA0      PTR;                                              01940000
1/********************************************************************/ 01950000
 /* DB2 TABLE STRUCTURES                                             */ 01960000
 /********************************************************************/ 01970000
                                       /* RB01140 START              */ 01980000
 DCL PTR_RCBV070    PTR;               /* PTR TYPE HW_PO             */ 01990000
 DCL PTR_RCBV070I   PTR;               /* PTR NULL-IND. TYPE HW_PO   */ 02000000
 DCL 1 TB_RCBV070,                     /* TYPE HW_PO ROW             */ 02010000
       %INCLUDE (RCB070S);;                                             02020000
 DCL 1 TB_RCBV070_I,                   /* NULL-IND. TYPE HW_PO       */ 02030000
       %INCLUDE (RCB070SI);;                                            02040000
                                       /* RB01140 END                */ 02050000
                                                                        02060000
 DCL PTR_RCBV500    PTR;               /* PTR PARAMETER ROW          */ 02070000
 DCL PTR_RCBV500I   PTR;               /* PTR NULL-IND. PARAMETER    */ 02080000
 DCL 1 TB_RCBV500,                     /* PARAMETER ROW              */ 02090000
       %INCLUDE (RCB500S);;                                             02100000
 DCL 1 TB_RCBV500_I,                   /* NULL-IND. PARAMETER        */ 02110000
       %INCLUDE (RCB500SI);;                                            02120000
0/********************************************************************/ 02130000
 /*  RECORD STRUCTURES FOR INPUT FILES                               */ 02140000
 /********************************************************************/ 02150000
0/* DCL 1 RCBBKA0_REC             CHAR (243);            /* RB01299 */  02160068
                                                     /* SOC RB01320 */  02161068
0/*DCL 1 RCBBKA0_REC           CHAR (240);               /* RB01299 */  02170068
0DCL 1 RCBBKA0_REC             CHAR (270);           /* EOC RB01320 */  02171068
0DCL 1 RCBBKA0_C000            BASED (PTR_RCBBKA0),                     02180000
       %INCLUDE (RCBBKAS1);;                                            02190000
 DCL 1 RCBBKA0_C001            BASED (PTR_RCBBKA0),                     02200000
       %INCLUDE (RCBBKAS2);;                                            02210000
 DCL 1 RCBBKA0_C002            BASED (PTR_RCBBKA0),                     02220000
 /*    %INCLUDE (RCBBKZS3);;  */                          /* RB01299 */ 02230000
       %INCLUDE (RCBBKAS3);;                              /* RB01299 */ 02240000
 DCL 1 RCBBKA0_C003            BASED (PTR_RCBBKA0),                     02250000
       %INCLUDE (RCBBKAS4);;                                            02260000
 DCL 1 RCBBKA0_C998            BASED (PTR_RCBBKA0),                     02270000
       %INCLUDE (RCBBKAS5);;                                            02280000
 DCL 1 RCBBKA0_C999            BASED (PTR_RCBBKA0),                     02290000
       %INCLUDE (RCBBKAS6);;                                            02300000
0/* DCL 1 RCBBKA0_REC_OLD         CHAR (243);   /* HZ SR *//* RB01299 */02310000
0DCL 1 RCBBKA0_REC_OLD         CHAR (240);     /* HZ SR */ /* RB01299 */02320000
                                                                        02330000
0/*DCL 1 RCBBKAX_REC             CHAR (269) INIT ('');     /* RB01299 */02340000
                                                  /* SOC CEDS00000517 */02341000
0/*DCL 1 RCBBKAX_REC             CHAR (270) INIT ('');   *//* RB01299 */02350000
 /*DCL 1 RCBBKAX_C002            BASED (ADDR(RCBBKAX_REC)), */          02360000
 /*    %INCLUDE (RCBBKZS3);,   */                          /* RB01299 */02370000
 /*    %INCLUDE (RCBBKAS3);,                               /* RB01299 */02380000
 /*  3 WRK_IND   CHAR(02),                                              02390000
     3 IOBJNIK2  CHAR(15),                                              02400000
     3 IUSCNIK   CHAR(15);     */                 /* EOC CEDS00000517 */02410000
 /********************************************************************/ 02420000
0DCL 1 RCBBXB2_REC                  CHAR (32);                          02430000
 DCL 1 RCBBXB2_HEADER               BASED (ADDR (RCBBXB2_REC)),         02440000
            %INCLUDE (RCBBAASH);;                                       02450000
0DCL 1 RCBBXB2_DATA                 BASED (ADDR (RCBBXB2_REC)),         02460000
            3 REC_TYPE    CHAR(2),                                      02470000
            3 RCBBXB2_KEY CHAR(16), /* COUNTRY_NUMBER-TYPE-OGSER*/      02480000
            3 FILLER      CHAR(14);                                     02490000
 DCL 1 RCBBXB2_TRAILER              BASED (ADDR (RCBBXB2_REC)),         02500000
            %INCLUDE (RCBBAAST);;                                       02510000
                                                                        02520000
0/********************************************************************/ 02530000
 /*  RECORD STRUCTURES FOR OUTPUT FILES                              */ 02540000
 /********************************************************************/ 02550000
0DCL 1 RCBBKA1_REC             CHAR (67);                               02560000
 DCL 1 RCBBKA1_HEADER          BASED (ADDR (RCBBKA1_REC)),              02570000
       %INCLUDE (RCBBAASH);;                                            02580000
0DCL 1 RCBBKA1_CONTRACT        BASED (ADDR (RCBBKA1_REC)),              02590000
       %INCLUDE (RCBBAAS1);,                                            02600000
       3 TB_RCBV030,                                                    02610000
         %INCLUDE (RCB030S);,                                           02620000
       3 TB_RCBV030_I,                                                  02630000
         %INCLUDE (RCB030SI);;                                          02640000
 DCL 1 RCBBKA1_TRAILER         BASED (ADDR (RCBBKA1_REC)),              02650000
       %INCLUDE (RCBBAAST);;                                            02660000
                                                                        02670000
 DCL 1 RCBBKA2_REC             CHAR (75);                  /* RB01242 */02680000
 DCL 1 RCBBKA2_HEADER          BASED (ADDR (RCBBKA2_REC)),              02690000
       %INCLUDE (RCBBAASH);;                                            02700000
0DCL 1 RCBBKA2_HW_PRODUCT      BASED (ADDR (RCBBKA2_REC)),              02710000
       %INCLUDE (RCBBAAS1);,                                            02720000
       3 TB_RCBV050,                                                    02730000
         %INCLUDE (RCB050S);,                                           02740000
       3 TB_RCBV050_I,                                                  02750000
         %INCLUDE (RCB050SI);;                                          02760000
 DCL 1 RCBBKA2_TRAILER         BASED (ADDR (RCBBKA2_REC)),              02770000
       %INCLUDE (RCBBAAST);;                                            02780000
                                                                        02790000
 DCL 1 RCBBKA3_REC             CHAR (105);                 /* RB01242 */02800000
 DCL 1 RCBBKA3_HEADER          BASED (ADDR (RCBBKA3_REC)),              02810000
       %INCLUDE (RCBBAASH);;                                            02820000
0DCL 1 RCBBKA3_HW_STATUS       BASED (ADDR (RCBBKA3_REC)),              02830000
       %INCLUDE (RCBBAAS1);,                                            02840000
       3 TB_RCBV110,                                                    02850000
         %INCLUDE (RCB110S);,                                           02860000
       3 TB_RCBV110_I,                                                  02870000
         %INCLUDE (RCB110SI);;                                          02880000
 DCL 1 RCBBKA3_TRAILER         BASED (ADDR (RCBBKA3_REC)),              02890000
       %INCLUDE (RCBBAAST);;                                            02900000
                                                                        02910000
 DCL 1 RCBBKA4_REC             CHAR (108);                 /* RB01242 */02920000
 DCL 1 RCBBKA4_HEADER          BASED (ADDR (RCBBKA4_REC)),              02930000
       %INCLUDE (RCBBAASH);;                                            02940000
0DCL 1 RCBBKA4_OU_HW           BASED (ADDR (RCBBKA4_REC)),              02950000
       %INCLUDE (RCBBAAS1);,                                            02960000
       3 TB_RCBV170,                                                    02970000
         %INCLUDE (RCB170S);,                                           02980000
       3 TB_RCBV170_I,                                                  02990000
         %INCLUDE (RCB170SI);;                                          03000000
 DCL 1 RCBBKA4_TRAILER         BASED (ADDR (RCBBKA4_REC)),              03010000
       %INCLUDE (RCBBAAST);;                                            03020000
                                                                        03030000
 DCL 1 RCBBKA5_REC             CHAR (136);                 /* RB01242 */03040000
 DCL 1 RCBBKA5_HEADER          BASED (ADDR (RCBBKA5_REC)),              03050000
       %INCLUDE (RCBBAASH);;                                            03060000
0DCL 1 RCBBKA5_HW_CUST         BASED (ADDR (RCBBKA5_REC)),              03070000
       %INCLUDE (RCBBAAS1);,                                            03080000
       3 TB_RCBV190,                                                    03090000
         %INCLUDE (RCB190S);,                                           03100000
       3 TB_RCBV190_I,                                                  03110000
         %INCLUDE (RCB190SI);;                                          03120000
 DCL 1 RCBBKA5_TRAILER         BASED (ADDR (RCBBKA5_REC)),              03130000
       %INCLUDE (RCBBAAST);;                                            03140000
                                                                        03150000
                                                       /* SOC RB01298 */03160000
 /*DCL 1 RCBBKA6_REC             CHAR (140);  /* RB01281 *//* RB01242 */03170000
 DCL 1 RCBBKA6_REC             CHAR (145);                              03180000
                                                       /* EOC RB01298 */03190000
 DCL 1 RCBBKA6_HEADER          BASED (ADDR (RCBBKA6_REC)),              03200000
       %INCLUDE (RCBBAASH);;                                            03210000
0DCL 1 RCBBKA6_SUPPL_CTR       BASED (ADDR (RCBBKA6_REC)),              03220000
       %INCLUDE (RCBBAAS1);,                                            03230000
       3 TB_RCBV220,                                                    03240000
         %INCLUDE (RCB220S);,                                           03250000
       3 TB_RCBV220_I,                                                  03260000
         %INCLUDE (RCB220SI);;                                          03270000
 DCL 1 RCBBKA6_TRAILER         BASED (ADDR (RCBBKA6_REC)),              03280000
       %INCLUDE (RCBBAAST);;                                            03290000
                                                                        03300000
 DCL 1 RCBBKA7_REC             CHAR (347);                 /* RB01242 */03310000
 DCL 1 RCBBKA7_HEADER          BASED (ADDR (RCBBKA7_REC)),              03320000
       %INCLUDE (RCBBAASH);;                                            03330000
0DCL 1 RCBBKA7_SERV_CTR        BASED (ADDR (RCBBKA7_REC)),              03340000
       %INCLUDE (RCBBAAS1);,                                            03350000
       3 TB_RCBV240,                                                    03360000
         %INCLUDE (RCB240S);,                                           03370000
       3 TB_RCBV240_I,                                                  03380000
         %INCLUDE (RCB240SI);;                                          03390000
 DCL 1 RCBBKA7_TRAILER         BASED (ADDR (RCBBKA7_REC)),              03400000
       %INCLUDE (RCBBAAST);;                                            03410000
                                                                        03420000
 DCL 1 RCBBKA8_REC             CHAR (104);                 /* RB01242 */03430000
 DCL 1 RCBBKA8_HEADER          BASED (ADDR (RCBBKA8_REC)),              03440000
       %INCLUDE (RCBBAASH);;                                            03450000
0DCL 1 RCBBKA8_HW_REAL         BASED (ADDR (RCBBKA8_REC)),              03460000
       %INCLUDE (RCBBAAS1);,                                            03470000
       3 TB_RCBV300,                                                    03480000
         %INCLUDE (RCB300S);,                                           03490000
       3 TB_RCBV300_I,                                                  03500000
         %INCLUDE (RCB300SI);;                                          03510000
 DCL 1 RCBBKA8_TRAILER         BASED (ADDR (RCBBKA8_REC)),              03520000
       %INCLUDE (RCBBAAST);;                                            03530000
                                                                        03540000
 DCL 1 RCBBKA9_REC             CHAR (111);                 /* RB01242 */03550000
 DCL 1 RCBBKA9_HEADER          BASED (ADDR (RCBBKA9_REC)),              03560000
       %INCLUDE (RCBBAASH);;                                            03570000
0DCL 1 RCBBKA9_FEATURE         BASED (ADDR (RCBBKA9_REC)),              03580000
       %INCLUDE (RCBBAAS1);,                                            03590000
       3 TB_RCBV310,                                                    03600000
         %INCLUDE (RCB310S);,                                           03610000
       3 TB_RCBV310_I,                                                  03620000
         %INCLUDE (RCB310SI);;                                          03630000
 DCL 1 RCBBKA9_TRAILER         BASED (ADDR (RCBBKA9_REC)),              03640000
       %INCLUDE (RCBBAAST);;                                            03650000
                                                                        03650100
 DCL 1 RCBBKAD_REC             CHAR (86);           /* SOC RB01320    */03651000
 DCL 1 RCBBKAD_HEADER          BASED (ADDR (RCBBKAD_REC)),              03652000
       %INCLUDE (RCBBAASH);;                                            03653000
0DCL 1 RCBBKAD_DUMMY_REAL_SERIAL  BASED (ADDR (RCBBKAD_REC)),           03654000
       %INCLUDE (RCBBAAS1);,                                            03655000
       3 TB_RCBV125,                                                    03656000
         %INCLUDE (RCB125S);,                                           03657000
       3 TB_RCBV125I,                                                   03658000
         %INCLUDE (RCB125SI);;                                          03659000
 DCL 1 RCBBKAD_TRAILER         BASED (ADDR (RCBBKAD_REC)),              03659100
       %INCLUDE (RCBBAAST);;                        /* EOC RB01320    */03659200
                                                                        03660000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 03670000
                                                                        03680000
 DCL 1 RCBBKAA_REC             CHAR (68);                               03690000
 DCL 1 RCBBKAA_HEADER          BASED (ADDR (RCBBKAA_REC)),              03700000
       %INCLUDE (RCBBAASH);;                                            03710000
0DCL 1 RCBBKAA_CUST_CTR        BASED (ADDR (RCBBKAA_REC)),              03720000
       %INCLUDE (RCBBAAS1);,                                            03730000
       3 TB_RCBV035,                                                    03740000
         %INCLUDE (RCB035S);,                                           03750000
       3 TB_RCBV035_I,                                                  03760000
         %INCLUDE (RCB035SI);;                                          03770000
 DCL 1 RCBBKAA_TRAILER         BASED (ADDR (RCBBKAA_REC)),              03780000
       %INCLUDE (RCBBAAST);;                                            03790000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 03800000
1/********************************************************************/ 03810000
 /*  PROGRAM CONTROL PARAMETERS                                      */ 03820000
 /********************************************************************/ 03830000
0DCL 1 TB_RCB008        BASED(PTR_RCBV500),        /* STORE FEATURES */ 03840000
       %INCLUDE (RCBP08S);;                                             03850000
0DCL 1 RCB008,                                                          03860000
       %INCLUDE (RCBP08S);;                                             03870000
0DCL 1 TB_RCB009        BASED(PTR_RCBV500),      /* INVALID FEATURES */ 03880000
       %INCLUDE (RCBP09S);;                                             03890000
0DCL 1 RCB009,                                                          03900000
       %INCLUDE (RCBP09S);;                                             03910000
0DCL 1 TB_RCB024        BASED(PTR_RCBV500),        /* HASH TOTALS    */ 03920000
       %INCLUDE (RCBP24S);;                                             03930000
0DCL 1 RCB024,                                                          03940000
       %INCLUDE (RCBP24S);;                                             03950000
0DCL 1 TB_RCB035        BASED(PTR_RCBV500),        /* FILE SEQUENCE  */ 03960000
       %INCLUDE (RCBP35S);;                                             03970000
0DCL 1 RCB035,                                                          03980000
       %INCLUDE (RCBP35S);;                                             03990000
                                                                        04000000
 /*COMMENT OUT THE BELOW CODE AS PART OF A12 */  /* SOC RB01301      */ 04010000
                                                 /* SOC CEDS00000381 */ 04020000
0/*DCL 1 TB_RCB140        BASED(PTR_RCBV500),                           04030000
      %INCLUDE (RCBP140S);;                                             04040000
0DCL 1 RCB140,                                                          04050000
      %INCLUDE (RCBP140S);;                                             04060000
                                                 /* EOC CEDS00000381 */ 04070000
                                                 /* EOC RB01301      */ 04080000
0/********************************************************************/ 04090000
 /*  SORT FIELDS                                                     */ 04100000
 /********************************************************************/ 04110000
 DCL RETURN_CODE             FIXED BIN (31);                            04120000
 DCL MAX_STORAGE             FIXED BIN (31);                            04130000
0/********************************************************************/ 04140000
 /*  COUNTS                                                          */ 04150000
 /********************************************************************/ 04160000
0DCL 1 COUNT,                                                           04170000
       3 CNT_CTRY,                                                      04180000
         5 RCBBKA0_HASH      FIXED DEC (15,0),                          04190000
         5 RCBBKA1_HASH      FIXED DEC (15,0),                          04200000
         5 RCBBKA2_HASH      FIXED DEC (15,0),                          04210000
         5 RCBBKA3_HASH      FIXED DEC (15,0),                          04220000
         5 RCBBKA4_HASH      FIXED DEC (15,0),                          04230000
         5 RCBBKA5_HASH      FIXED DEC (15,0),                          04240000
         5 RCBBKA6_HASH      FIXED DEC (15,0),                          04250000
         5 RCBBKA7_HASH      FIXED DEC (15,0),                          04260000
         5 RCBBKA8_HASH      FIXED DEC (15,0),                          04270000
         5 RCBBKA9_HASH      FIXED DEC (15,0),                          04280000
         5 RCBBKAD_HASH      FIXED DEC (15,0),           /* RB01320 */  04281000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 04290000
         5 RCBBKAA_HASH      FIXED DEC (15,0),                          04300000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 04310000
         5 RCBBKA0           FIXED BIN (31),                            04320000
         5 RCBBKA1           FIXED BIN (31),                            04330000
         5 RCBBKA2           FIXED BIN (31),                            04340000
         5 RCBBKA3           FIXED BIN (31),                            04350000
         5 RCBBKA4           FIXED BIN (31),                            04360000
         5 RCBBKA5           FIXED BIN (31),                            04370000
         5 RCBBKA6           FIXED BIN (31),                            04380000
         5 RCBBKA7           FIXED BIN (31),                            04390000
         5 RCBBKA8           FIXED BIN (31),                            04400000
         5 RCBBKA9           FIXED BIN (31),                            04410000
         5 RCBBKAD           FIXED BIN (31),             /* RB01320 */  04411000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 04420000
         5 RCBBKAA           FIXED BIN (31),                            04430000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 04440000
       3 CNT_TOT,                                                       04450000
         5 RCBBKA0_HASH      FIXED DEC (15,0),                          04460000
         5 RCBBKA0           FIXED BIN (31),                            04470000
         5 RCBBKA1           FIXED BIN (31),                            04480000
         5 RCBBKA2           FIXED BIN (31),                            04490000
         5 RCBBKA3           FIXED BIN (31),                            04500000
         5 RCBBKA4           FIXED BIN (31),                            04510000
         5 RCBBKA5           FIXED BIN (31),                            04520000
         5 RCBBKA6           FIXED BIN (31),                            04530000
         5 RCBBKA7           FIXED BIN (31),                            04540000
         5 RCBBKA8           FIXED BIN (31),                            04550000
         5 RCBBKA9           FIXED BIN (31),                            04560000
         5 RCBBKAD           FIXED BIN (31),             /* RB01320 */  04561000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 04570000
         5 RCBBKAA           FIXED BIN (31);                            04580000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 04590000
 DCL CNT_PIC9              PIC '(9)9';                                  04600000
 DCL CNT_PIC15             PIC '(15)9';                                 04610000
0/********************************************************************/ 04620000
 /*  BIT SWITCHES                                                    */ 04630000
 /********************************************************************/ 04640000
0DCL TRUE                    BIT (1)         INIT ('1'B);               04650000
 DCL FALSE                   BIT (1)         INIT ('0'B);               04660000
 /*DCL SWITCH_RCBV390_FOUND    BIT (1)         INIT ('0'B) (RB01140) */ 04670000
 DCL SWITCH_USER_EXIT_1      BIT (1)         INIT ('1'B);               04680000
 DCL SWITCH_USER_EXIT_2      BIT (1)         INIT ('1'B);               04690000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 04700000
 DCL SWITCH_USER_EXIT_3      BIT (1)         INIT ('1'B);               04710000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 04720000
 DCL SWITCH_USER_EXIT_5      BIT (1)         INIT ('1'B);               04730000
 DCL LAST                    BIT (1)         INIT ('0'B); /* HZ  SR */  04740000
 DCL NUMBER                  CHAR(01)        INIT ('0');  /* HZ  SR */  04750000
 DCL SWITCH_TYPE_REQUESTED   BIT (1)         INIT ('1'B);               04760000
 DCL SWITCH_FIRST_C002       BIT (1)         INIT ('1'B);               04770000
 DCL SWITCH_RCB009_EXISTS    BIT (1)         INIT ('0'B);               04780000
 DCL SWITCH_VALID_FEAT       BIT (1)         INIT ('1'B);               04790000
 DCL SWITCH_CTRY_PROCESSED   BIT (1)         INIT ('0'B);               04800000
 DCL SWITCH_HW_IGNORE        BIT (1)         INIT ('0'B);               04810000
                                               /* SOC : CEDS00000313 */ 04820000
 DCL SWITCH_HW_IGNORE_OLD    BIT (1)         INIT ('0'B);               04830000
                                               /* EOC : CEDS00000313 */ 04840000
 DCL SWITCH_HASH_TOTAL       BIT (1)         INIT ('0'B);/* RB01312  */ 04841000
 DCL SWITCH_REAL_SERIAL      BIT (1)         INIT ('0'B);/* RB01320 */  04842000
                                                                        04850000
 /*COMMENT OUT THE BELOW CODE AS PART OF A12*/ /* SOC : RB01301      */ 04860000
                                               /* SOC : CEDS00000381 */ 04870000
 /*DCL SWITCH_NO_ETS_PROCESS   BIT (1)         INIT ('0'B);          */ 04880000
                                               /* EOC : CEDS00000381 */ 04890000
                                               /* EOC : RB01301      */ 04900000
 DCL EOF_RCBBXB2             BIT (1)         INIT ('0'B);               04910000
0/********************************************************************/ 04920000
 /*  PROGRAM LOOP CONTROLLERS                                        */ 04930000
 /********************************************************************/ 04940000
0DCL 1 SK_NEW,                                                          04950000
       3 EOF               CHAR (01),                                   04960000
       3 CTRYNO            CHAR (03),                                   04970000
       3 TYPE              CHAR (04),                                   04980000
       3 SERIAL            CHAR (09);                                   04990000
0DCL SK_NEW1               CHAR (04)  DEFINED (SK_NEW);                 05000000
0DCL SK_NEW2               CHAR (08)  DEFINED (SK_NEW);                 05010000
0DCL SK_NEW3               CHAR (17)  DEFINED (SK_NEW);                 05020000
                                     /* SOC : CEDS00000313 */           05030000
0DCL SK_TEMP1              CHAR (16)  DEFINED (SK_NEW) POS(2);          05040000
                                     /* EOC : CEDS00000313 */           05050000
0DCL 1 SK_OLD,                                                          05060000
       3 EOF               CHAR (01),                                   05070000
       3 CTRYNO            CHAR (03),                                   05080000
       3 TYPE              CHAR (04),                                   05090000
       3 SERIAL            CHAR (09);                                   05100000
0DCL SK_OLD1               CHAR (04)  DEFINED (SK_OLD);                 05110000
0DCL SK_OLD2               CHAR (08)  DEFINED (SK_OLD);                 05120000
0DCL SK_OLD3               CHAR (17)  DEFINED (SK_OLD);                 05130000
0DCL 1 SK_ARRAY,                                                        05140000
       3 EOF               CHAR (01),                                   05150000
       3 CTRYNO            CHAR (03);                                   05160000
0DCL SK_ARRAY1             CHAR (04)  DEFINED (SK_ARRAY);               05170000
0DCL OLD_KEY               CHAR (16);                                   05180000
                                               /* SOC : CEDS00000313 */ 05190000
0DCL 1 SK_TEMP2,                                                        05200000
       3 CTRYNO            CHAR (03),                                   05210000
       3 TYPE              CHAR (04),                                   05220000
       3 SERIAL            CHAR (09);                                   05230000
0DCL 1 SK_TEMPX CHAR(16) DEFINED(SK_TEMP2);                             05240000
                                               /* EOC : CEDS00000313 */ 05250000
0/********************************************************************/ 05260000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 05270000
 /********************************************************************/ 05280000
0DCL WRK_MOD_NAME         CHAR (08)   INIT ('RCBBKAM ');                05290000
 DCL WRK_LEVEL            FIXED BIN (15);                               05300000
 DCL WRK_PGM_NAME         CHAR (08)   INIT ('RCBBKAP ');                05310000
 DCL WRK_SYSTEM_TYPE      CHAR (01)   INIT ('B');                       05320000
 DCL WRK_DATETIME         CHAR (20);                                    05330000
 DCL WRK_PGR_TYPE         CHAR (03);                                    05340000
 DCL WRK_CTRYNO           CHAR (03)   INIT ('');                        05350000
 DCL WRK_RUN_DATE         CHAR (10);                                    05360000
 DCL WRK_STRT_DATE        CHAR (10);                                    05370000
 DCL WRK_HASH_FIELD       CHAR (04);                                    05380000
 DCL WRK_RCBBKA0          CHAR (07)   INIT ('RCBBKZ0');                 05390000
 DCL WRK_RCBBKA1          CHAR (07)   INIT ('RCBBKA1');                 05400000
 DCL WRK_RCBBKA2          CHAR (07)   INIT ('RCBBKA2');                 05410000
 DCL WRK_RCBBKA3          CHAR (07)   INIT ('RCBBKA3');                 05420000
 DCL WRK_RCBBKA4          CHAR (07)   INIT ('RCBBKA4');                 05430000
 DCL WRK_RCBBKA5          CHAR (07)   INIT ('RCBBKA5');                 05440000
 DCL WRK_RCBBKA6          CHAR (07)   INIT ('RCBBKA6');                 05450000
 DCL WRK_RCBBKA7          CHAR (07)   INIT ('RCBBKA7');                 05460000
 DCL WRK_RCBBKA8          CHAR (07)   INIT ('RCBBKA8');                 05470000
 DCL WRK_RCBBKA9          CHAR (07)   INIT ('RCBBKA9');                 05480000
 DCL WRK_RCBBKAD          CHAR (07)   INIT ('RCBBKAD');  /* RB01320 */  05481000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 05490000
 DCL WRK_RCBBKAA          CHAR (07)   INIT ('RCBBKAA');                 05500000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 05510000
 DCL WRK_CTRY_IDX         FIXED BIN (31);         /* INDEX COUNTRIES */ 05520000
 DCL WRK_FEAT_DIM         FIXED BIN (31);         /* DIM FEAT. ARRAY */ 05530000
 DCL WRK_FEAT_IDX         FIXED BIN (31);         /* INDEX FEATURES  */ 05540000
 DCL WRK_LENGTH_RCB024    FIXED BIN (15);                               05550000
 DCL WRK_FILE_SEQ         PIC '99999';                                  05560000
 DCL WRK_QCINRBA_C        CHAR (10);                                    05570000
 DCL WRK_QCINRBA_P        PIC '(10)9'   DEFINED (WRK_QCINRBA_C);        05580000
 DCL WRK_QDBSCDR_C        CHAR (15);                                    05590000
 DCL WRK_QDBSCDR_P        PIC '(15)9'   DEFINED (WRK_QDBSCDR_C);        05600000
 DCL PREV_CONTRACT_NUMBER CHAR (15);              /* PTM 387         */ 05610000
 DCL WRK_IAGRNBR          CHAR (15);                      /* PTM1058 */ 05620000
 DCL WRK_DDBSIAC          CHAR (10);                                    05630000
 DCL PREV_DDBSIAC         CHAR (10);                                    05640000
 DCL WRK_CHIS_LOCAL       CHAR (01);                                    05650000
 DCL TEMP_C002_C003       CHAR (30);                /*SOC RB01320    */ 05653000
 DCL TEMP_VAR_LONG        CHAR (30) VAR;                                05654000
 DCL TEMP_VAR_SHORT       CHAR (09) VAR;            /*EOC RB01320    */ 05655000
                                                                        05660000
 /* COMMENT OUT THE BELOW CODE AS PART OF A12 */ /* SOC RB01301      */ 05670000
                                                 /* SOC CEDS00000381 */ 05680000
 /*DCL WRK_COUNT      PIC '99';                                      */ 05690000
 /*DCL K              PIC '99';                                      */ 05700000
                                                 /* EOC CEDS00000381 */ 05710000
                                                 /* EOC RB01301      */ 05720000
 DCL 1 WRK_SOURCE_IND,                                                  05730000
       %INCLUDE (RCBZ29S);;                                             05740000
0DCL 1 WRK_TPMNT_VALUE,                                                 05750000
       %INCLUDE (RCBZ99S);;                                             05760000
1/********************************************************************/ 05770000
 /*  BUILTIN FUNCTIONS                                               */ 05780000
 /********************************************************************/ 05790000
0DCL (ADDR,                                                             05800000
      CSTG,                                                             05810000
      DATE,                                                             05820000
      DIM,                                                              05830000
      HIGH,                                                             05840000
      LENGTH,                                                           05850000
      LOW,                                                              05860000
      NULL,                                                             05870000
      PLIRETC,                                                          05880000
      PLISRTC,                                                          05890000
      STG,                                                              05900000
      STRING,                                                           05910000
      SUBSTR,                                                           05920000
      TIME,                                                             05930000
      UNSPEC,                                                           05940000
      TRIM,                                               /* RB01320 */ 05941069
      VERIFY)     BUILTIN;                                              05950000
1/********************************************************************/ 05960000
 /* ON ENDFILE                                                       */ 05970000
 /********************************************************************/ 05980000
0ON ENDFILE (RCBBKZ0)                                                   05990000
   BEGIN;                                                               06000000
     SK_NEW.EOF = '1';                                                  06010000
   END;                                                                 06020000
0ON ENDFILE (RCBBXB2)                                                   06030000
        BEGIN;                                                          06040000
          EOF_RCBBXB2 = '1'B;                                           06050000
          RCBBXB2_DATA.RCBBXB2_KEY = (16)'9';                           06060000
        END;                                                            06070000
                                                 /* SOC CEDS00000517 */ 06071000
0/*ON ENDFILE (RCBBKAX)                                                 06080000
   BEGIN;                                                               06090000
     RCBBKAX_C002.IOPUCTY = '999';                                      06100000
     RCBBKAX_C002.CSLMTYP = '9999';                                     06110000
     RCBBKAX_C002.IHSIMID = '9999999';                                  06120000
   END; */                                       /* EOC CEDS00000517 */ 06130000
1/********************************************************************/ 06140000
 /* ON ERROR CONDITIONS                                              */ 06150000
 /********************************************************************/ 06160000
0%INCLUDE (RCB0E0M);                                                    06170000
   END;                                                                 06180000
1/********************************************************************/ 06190000
 /*                 S T A R T   P R O C E S S I N G                  */ 06200000
 /********************************************************************/ 06210000
                                                                        06220000
 CALL R090_INIT_PROG;                                                   06230000
                                                                        06240000
 DO WHILE (SK_NEW.EOF   ¬= '1'   |     /* WHILE NOT EOF OR NOT END OF */06250000
           SK_ARRAY.EOF ¬= '1');       /* COUNTRY ARRAY               */06260000
    CALL R080_INIT_COUNTRY;                                             06270000
                                                                        06280067
                                                                        06290000
      SELECT;                                                           06300000
                                                                        06310000
      WHEN (SK_ARRAY1 < SK_NEW1)              /* CTRY NOT IN FILE    */ 06320000
        DO;                                   /* ONLY IN RCB000      */ 06330000
          CALL RX04_ISSUE_MSG_M0184;                                    06340000
          CALL R071_SAVE_HASH;                                          06350000
          CALL R072_READ_NEXT_RCB000;                                   06360000
        END;                                                            06370000
                                                                        06380000
      WHEN (SK_ARRAY1 = SK_NEW1)               /* CTRY IN FILE        */06390000
        DO;                                    /* AND IN RCB000       */06400000
          CALL R070_INIT_PROCESS_CTRY;                                  06410000
                                                                        06420000
          DO WHILE (SK_NEW1 = SK_OLD1);  /* WHILE SAME COUNTRY */       06430000
            CALL R060_INIT_TYPE;                                        06440000
                                                                        06450000
            DO WHILE (SK_NEW2 = SK_OLD2);  /* WHILE SAME TYPE */        06460000
              IF SWITCH_TYPE_REQUESTED                                  06470000
              THEN                                                      06480000
                DO;                                                     06490000
                  CALL R050_INIT_TOS;                                   06500000
                  PREV_CONTRACT_NUMBER = '';                            06510000
                  CALL R033B_CHECK_HW_IGNORE;                           06520000
                                                                        06530000
                                                                        06540000
                  DO WHILE (SK_NEW3 = SK_OLD3);   /* WHILE SAME TOS   */06550000
                                                                        06560000
  /* COMMENT OUT THE BELOW CODE AS PART OF A12 */ /* SOC RB01301      */06570000
                                                  /* SOC CEDS00000381 */06580000
  /*                  IF SWITCH_NO_ETS_PROCESS = FALSE THEN           */06590000
  /*                       DO;                                        */06600000
                                                                        06601000
  /*                           CALL R034_ETS_SPECIFIC;                  06610000
  /*                       END;                                       */06620000
  /*                  ELSE        /* SWITCH_NO_ETS_PROCESS = TRUE     */06630000
  /*                       DO;                       EOC RB01301      */06640000
                                                                        06641000
                               CALL R035_ETS_NOETS_SHARED;              06650000
                               CALL R030_READ_CHIS_REC;                 06660000
  /*                       END;                          RB01301      */06670000
                                                  /* EOC CEDS00000381 */06680000
                  END;  /* END WHILE SAME TOS */                        06700000
                                    /* TOS CHANGED                */    06710000
                                    /* WRITE HW RECORDS IF NEEDED */    06720000
                  IF SWITCH_HW_IGNORE = '0'B &                          06730000
                     PREV_DDBSIAC >= WRK_RUN_DATE                       06740000
                  THEN DO;                                              06750000
                     CALL R043B_WRITE_T0110;                            06760000
                     CALL R044B_WRITE_T0170;                            06770000
                     CALL R045B_WRITE_T0190;                            06780000
                     CALL R046B_WRITE_T0300;                            06790000
                  END;                                                  06800000
                                                                        06810000
                                                                        06820000
                  CALL R059_END_TOS;                                    06830000
                                                                        06840000
                END;  /* END TYPE REQUESTED */                          06850000
              ELSE                                                      06860000
                DO;                                                     06870000
                  CALL R030_READ_CHIS_REC;                              06880000
                END;                                                    06890000
            END;  /* END WHILE SAME TYPE */                             06900000
          END;   /* WHILE SAME COUNTRY */                               06910000
                                                                        06920000
          CALL R071_SAVE_HASH;                                          06930000
          CALL R079_END_PROCESS_CTRY;                                   06940000
          CALL R072_READ_NEXT_RCB000;                                   06950000
        END;                                                            06960000
                                                                        06970000
      WHEN (SK_ARRAY1 > SK_NEW1)                /* CTRY IN FILE BUT   */06980000
        DO;                                     /* NOT IN RCB001      */06990000
          CALL RX02_ISSUE_MSG_M0181;                                    07000000
          CALL R030_READ_CHIS_REC;              /* READ C002 RECORD   */07010000
                                                                        07020000
          SK_OLD1 = SK_NEW1;                                            07030000
          DO WHILE (SK_NEW1 = SK_OLD1);  /* WHILE SAME COUNTRY */       07040000
            CALL R030_READ_CHIS_REC;     /* SKIP RECORDS       */       07050000
          END;                                                          07060000
                                                                        07070000
          CALL R079_END_PROCESS_CTRY;                                   07080000
        END;                                                            07090000
                                                                        07100000
      OTHERWISE;                                                        07110000
                                                                        07120000
      END; /* SELECT */                                                 07130000
                                                                        07140000
 END; /* WHILE NOT EOF */                                               07150000
                                                                        07160000
 CALL R091_END_FILES;                                                   07170000
                                                                        07180000
 CALL R092_SORT_RCBBKA1;                                                07190000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 07200000
 CALL R093_SORT_RCBBKAA;                                                07210000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 07220000
                                                                        07230000
 CALL R099_END_PROG;                                                    07240000
                                                                        07250000
1/********************************************************************/ 07260000
 /* COMMENT OUT THE BELOW CODE AS PART OF A12       SOC RB01301      */ 07280000
 /*                                                 SOC CEDS00000381 */ 07281000
 /* MODULE NAME      : R034_ETS_SPECIFIC                             */ 07290000
 /*                                                                  */ 07300000
 /* DESCRIPTION      : EXECUTE THE CODE-1 SPECIFIC TO ETS PROCESSING */ 07310000
 /*                                                                  */ 07320000
 /********************************************************************/ 07330000
 /*R034_ETS_SPECIFIC : PROC;                                            07340000
 /*                                                     /* HZ SR  */    07350000
 /*                   RCBBKA0_REC_OLD = RCBBKA0_REC;                    07360000
 /*                                              /* SOC: CEDS00000313 */07370000
 /*                  SWITCH_HW_IGNORE_OLD = SWITCH_HW_IGNORE;           07380000
 /*                                              /* EOC: CEDS00000313 */07390000
 /*                  LAST = '0';                                        07400000
 /*                  NUMBER = '0';                                      07410000
 /*                  DO WHILE ((SWITCH_USER_EXIT_5 = '1')&(LAST = '0'));07420000
                                                                        07430000
 /*                  CALL RCBBK1U (ADDR (SWITCH_USER_EXIT_5),/*DELETED*/07440000
                                                        /*FOR CEDS3.3*/ 07450000
                                                      /* SOC RC01302 */ 07451000
 /*                  CALL RCBBK5U (ADDR (SWITCH_USER_EXIT_5),           07460000
 /*                                ADDR (RCBBKA0_REC),                  07470000
 /*                                ADDR (RCBBKAX_REC),                  07480000
 /*                                ADDR (RCBBKA0_REC_OLD),              07490000
 /*                                NUMBER,                              07500000
 /*                                SWITCH_FIRST_C002, /*CEDS00000313*/  07510000
 /*                                SWITCH_HW_IGNORE,  /*CEDS00000313*/  07520000
 /*                                PTR_INT_AREA);                       07530000
                                                      /* EOC RC01302 */ 07531000
                                                      /* HZ SR  */      07540000
 /*                                              /* SOC: CEDS00000313 */07550000
 /*    SK_TEMP2.CTRYNO = RCBBKA0_C002.IOPUCTY;                          07560000
 /*    SK_TEMP2.TYPE   = RCBBKA0_C002.CSLMTYP;                          07570000
 /*    SK_TEMP2.SERIAL = RCBBKA0_C002.IHSIMID;                          07580000
                                            /* EOC: CEDS00000313 */     07590000
                                                                        07600000
 /*                  IF NUMBER = '8'                                    07610000
 /*                  |  NUMBER = '9' THEN LAST = '1';                   07620000
 /*                                                                     07630000
 /*                  CALL R035_ETS_NOETS_SHARED;                        07640000
 /*                                                                     07650000
 /*                   IF SK_TEMP1 > SK_TEMPX THEN                       07660000
 /*                     DO;                                             07670000
 /*                       IF SWITCH_HW_IGNORE = '0'B &                  07680000
 /*                          PREV_DDBSIAC >= WRK_RUN_DATE THEN          07690000
 /*                         DO;                                         07700000
 /*                           CALL R043B_WRITE_T0110;                   07710000
 /*                           CALL R044B_WRITE_T0170;                   07720000
 /*                           CALL R045B_WRITE_T0190;                   07730000
 /*                           CALL R046B_WRITE_T0300;                   07740000
 /*                         END;                                        07750000
 /*                       SWITCH_FIRST_C002 = TRUE;                     07760000
 /*                                                                     07770000
 /*                       CALL R059_END_TOS;                            07780000
 /*                     END;                                            07790000
 /*                   SWITCH_HW_IGNORE = SWITCH_HW_IGNORE_OLD;          07800000
 /*                                              /* EOC: CEDS00000313 */07810000
 /*                   RCBBKA0_REC  = RCBBKA0_REC_OLD;                   07820000
 /*                  END;                /* DO WHILE SR |   HZ SR */    07830000
 /*                 CALL R030_READ_CHIS_REC;                            07840000
 /*                 IF NUMBER = '8' THEN                                07850000
 /*                   DO;                                               07860000
 /*                     IF SK_NEW3 = SK_OLD3 THEN                       07870000
 /*                       DO;                                           07880000
 /*                         IF RCBBKAX_C002.DDBSIAC >=                  07890000
 /*                            RCBBKA0_C002.DDBSEFF THEN                07900000
 /*                          DO;                                        07910000
 /*                            IF RCBBKAX_C002.DDBSEFF <                07920000
 /*                               RCBBKA0_C002.DDBSEFF THEN             07930000
 /*                              DO;                                    07940000
 /*                                RCBBKAX_C002.DDBSEFF =               07950000
 /*                                RCBBKA0_C002.DDBSEFF;                07960000
 /*                              END;                                   07970000
 /*                          END;                                       07980000
 /*                         ELSE                                        07990000
 /*                           DO;                                       08000000
 /*                            IF RCBBKAX_C002.IOPUCTY ¬= '999'         08010000
 /*                            &  RCBBKAX_C002.CSLMTYP ¬= '9999'        08020000
 /*                            &  RCBBKAX_C002.IHSIMID ¬= '9999999' THEN08030000
 /*                            READ FILE (RCBBKAX) INTO (RCBBKAX_C002); 08040000
 /*                           END;                                      08050000
 /*                       END;                                          08060000
 /*                     ELSE                                            08070000
 /*                      DO;                                            08080000
 /*                       IF RCBBKAX_C002.IOPUCTY ¬= '999'              08090000
 /*                       &  RCBBKAX_C002.CSLMTYP ¬= '9999'             08100000
 /*                       &  RCBBKAX_C002.IHSIMID ¬= '9999999' THEN     08110000
 /*                       READ FILE (RCBBKAX) INTO (RCBBKAX_C002);      08120000
 /*                      END;                                           08130000
 /*                     NUMBER = '9';                                   08140000
 /*                   END;                                              08150000
 /*END R034_ETS_SPECIFIC;                         /* EOC CEDS00000381 */08160000
                                                  /* EOC RB01301      */08170000
1/********************************************************************/ 08180000
 /*                                                 SOC CEDS00000381 */ 08190000
 /* MODULE NAME      : R035_ETS_NOETS_SHARED                         */ 08200000
 /*                                                                  */ 08210000
 /* DESCRIPTION      : EXECUTE THE CODE COMMON FOR BOTH ETS AND      */ 08220000
 /*                    NON ETS PROCESSING                            */ 08230000
 /*                                                                  */ 08240000
 /********************************************************************/ 08250000
  R035_ETS_NOETS_SHARED  : PROC;                                        08260000
                                                                        08270000
                     IF SWITCH_FIRST_C002                               08280000
                     THEN                                               08290000
                       DO;                                              08300000
                         SWITCH_FIRST_C002 = FALSE;                     08310000
                         CALL R040_BUILD_WRITE_T0030;                   08320000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 08330000
                         CALL R041_BUILD_WRITE_T0035;                   08340000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 08350000
                         IF SWITCH_HW_IGNORE = '0'B                     08360000
                         THEN DO;                                       08370000
                           CALL R042_BUILD_WRITE_T0050;                 08380000
                           CALL R043_BUILD_T0110;                       08390000
                           CALL R044_BUILD_T0170;                       08400000
                           CALL R045_BUILD_T0190;                       08410000
                           CALL R046_BUILD_T0300;                       08420000
                           IF (SWITCH_REAL_SERIAL)   /* SOC RB01320 */  08421000
                           THEN DO;                                     08422000
                           CALL R051_BUILD_WRITE_T0125;                 08423000
                           END;                      /* EOC RB01320 */  08424000
                         END;                                           08430000
                                                                        08440000
                         IF WRK_RUN_DATE < RCBBKA0_C002.DDBSEFF         08450000
                         THEN                                           08460000
                           DO;                                          08470000
                             WRK_STRT_DATE = WRK_RUN_DATE; /* PTM1362*/ 08480000
                             CALL R048_BUILD_WRITE_T0220;               08490000
                           END;                                         08500000
                                                                        08510000
                      /* IF SWITCH_USER_EXIT_1   *//*SOC CEDS00000672*/ 08520081
                      /* THEN                    */                     08530081
                      /*   DO;                   */                     08540081
                      /*     CALL R047_USER_EXIT;*/                     08550081
                      /*   END;                  *//*EOC CEDS00000672*/ 08560081
                       END;                                             08570000
                             /* PTM 0387 START                      */  08580000
                     ELSE                                               08590000
                       DO;                                              08600000
                         IF (RCBBKA0_C002.IAGRNBR ¬=                    08610000
                             PREV_CONTRACT_NUMBER) &                    08620000
                            (RCBBKA0_C000.CDBSFRT = 'C002' )            08630000
                           THEN                                         08640000
                             DO;                                        08650000
                               CALL R040_BUILD_WRITE_T0030;             08660000
                             END;                                       08670000
 /* ----------- RA01120 AMENDMENT ---------------------------------- */ 08680000
                         IF (RCBBKA0_C000.CDBSFRT = 'C002' )            08690000
                           THEN                                         08700000
                             DO;                                        08710000
                               CALL R041_BUILD_WRITE_T0035;             08720000
                             END;                                       08730000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 08740000
                         IF (RCBBKA0_C000.CDBSFRT = 'C002' ) &          08750000
                            (PREV_DDBSIAC < RCBBKA0_C002.DDBSEFF)       08760000
                           THEN                                         08770000
                             DO;                                        08780000
                               CALL R049_CHECK_GAP;                     08790000
                               /* PTM 1362 GENERATE A T0220 ROW FOR  */ 08800000
                               /*          A GAP BETWEEN CONTRACTS   */ 08810000
                             END;                                       08820000
                       END;                                             08830000
                              /* PTM 0387 END                        */ 08840000
                     IF RCBBKA0_C000.CDBSFRT = 'C002'                   08850000
                     THEN                                               08860000
                       DO;                                              08870000
                         IF SWITCH_USER_EXIT_1      /*SOC CEDS00000672*/08871081
                         THEN                                           08872079
                           DO;                                          08873079
                             CALL R047_USER_EXIT;                       08874079
                           END;                     /*EOC CEDS00000672*/08875081
                         CALL R020_BUILD_WRITE_T0240;                   08880000
                       END;                                             08890000
                                                                        08900000
                     IF RCBBKA0_C000.CDBSFRT = 'C003' &                 08910000
                        RCB008.FEATURE_STORE_IND = '1' &                08920000
                        SWITCH_HW_IGNORE = '0'B &                       08930000
                        PREV_DDBSIAC >= WRK_RUN_DATE                    08940000
                     THEN                                               08950000
                       DO;                                              08960000
                         CALL R021_BUILD_WRITE_T0310;                   08970000
                       END;                                             08980000
                                                                        08990000
                                 /* PTM 381                          */ 09000000
                    IF  RCBBKA0_C000.CDBSFRT = 'C002'                   09010000
                    THEN                                                09020000
                      PREV_CONTRACT_NUMBER = RCBBKA0_C002.IAGRNBR;      09030000
                                                                        09040000
                    PREV_DDBSIAC = WRK_DDBSIAC;                         09050000
                                                                        09060000
 END R035_ETS_NOETS_SHARED;                    /* EOC CEDS00000381 */   09070000
1/********************************************************************/ 09080000
 /*                                                                  */ 09090000
 /* MODULE NAME      : R020_BUILD_WRITE_T0240                        */ 09100000
 /*                                                                  */ 09110000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0240 RECORD  */ 09120000
 /*                                                                  */ 09130000
 /*                    FOR EVERY WRITTEN SERVICE CONTRACT, ALSO A    */ 09140000
 /*                    SUPPLY CONTRACT (T0220) WITH TPMNT = '2' WILL */ 09150000
 /*                    BE WRITTEN.                                   */ 09160000
 /*                                                                  */ 09170000
 /********************************************************************/ 09180000
 R020_BUILD_WRITE_T0240 : PROC;                                         09190000
                                                                        09200000
 RCBBKA7_SERV_CTR                    = '';                              09210000
 RCBBKA7_SERV_CTR.REC_TYPE           = '02';                            09220000
 RCBBKA7_SERV_CTR.CTRYNO             = RCBBKA0_C002.IOPUCTY;            09230000
 RCBBKA7_SERV_CTR.PGR_TYPE           = WRK_PGR_TYPE;                    09240000
 RCBBKA7_SERV_CTR.RUN_DATE           = WRK_RUN_DATE;                    09250000
                                                                        09260000
 RCBBKA7_SERV_CTR.COUNTRY_NUMBER     = RCBBKA0_C002.IOPUCTY;            09270000
 RCBBKA7_SERV_CTR.PRODUCT_TYPE       = RCBBKA0_C002.CSLMTYP;            09280000
 RCBBKA7_SERV_CTR.ORIGIN             = SUBSTR(RCBBKA0_C002.IHSIMID,1,2);09290000
 RCBBKA7_SERV_CTR.SEQUENCE_NUMBER    = SUBSTR(RCBBKA0_C002.IHSIMID,3,7);09300000
 RCBBKA7_SERV_CTR.HVP_QUANTITY       = RCBBKA0_C002.QCUOHVP;            09310000
 RCBBKA7_SERV_CTR.CONTRACT_NUMBER    = RCBBKA0_C002.IAGRNBR;            09320000
             /* PTM 536 FROM HERE ALL INDICATORS */                     09330000
 IF RCBBKA0_C002.DAGRASS ¬= ' '                                         09340000
 THEN                                                                   09350000
   DO;                                                                  09360000
     RCBBKA7_SERV_CTR.SERVICE_START_DATE = RCBBKA0_C002.DAGRASS;        09370000
   END;                                                                 09380000
 ELSE                                                                   09390000
   DO;                                                                  09400000
     RCBBKA7_SERV_CTR.INDNULL (07) = -1;                                09410000
   END;                                                                 09420000
                                                                        09430000
 IF RCBBKA0_C002.DAGREXP ¬= ' '                                         09440000
 THEN                                                                   09450000
   DO;                                                                  09460000
     RCBBKA7_SERV_CTR.SERVICE_STOP_DATE  = RCBBKA0_C002.DAGREXP;        09470000
   END;                                                                 09480000
 ELSE                                                                   09490000
   DO;                                                                  09500000
     RCBBKA7_SERV_CTR.INDNULL (08) = -1;                                09510000
   END;                                                                 09520000
                                                                        09530000
 RCBBKA7_SERV_CTR.SUPPL_CTR_NUMBER   = ' ';                             09540000
 RCBBKA7_SERV_CTR.INDNULL (09)       = -1;                              09550000
                                                                        09560000
 IF RCBBKA0_C002.GCUSCSI (1) ¬= ' '                                     09570000
 THEN                                                                   09580000
   DO;                                                                  09590000
     RCBBKA7_SERV_CTR.SERVICE_MODULE_1 = RCBBKA0_C002.GCUSCSI (1);      09600000
   END;                                                                 09610000
 ELSE                                                                   09620000
   DO;                                                                  09630000
     RCBBKA7_SERV_CTR.INDNULL (10) = -1;                                09640000
   END;                                                                 09650000
                                                                        09660000
 IF RCBBKA0_C002.GCUSCSI (2) ¬= ' '                                     09670000
 THEN                                                                   09680000
   DO;                                                                  09690000
     RCBBKA7_SERV_CTR.SERVICE_MODULE_2 = RCBBKA0_C002.GCUSCSI (2);      09700000
   END;                                                                 09710000
 ELSE                                                                   09720000
   DO;                                                                  09730000
     RCBBKA7_SERV_CTR.INDNULL (11) = -1;                                09740000
   END;                                                                 09750000
                                                                        09760000
 IF RCBBKA0_C002.GCUSCSI (3) ¬= ' '                                     09770000
 THEN                                                                   09780000
   DO;                                                                  09790000
     RCBBKA7_SERV_CTR.SERVICE_MODULE_3 = RCBBKA0_C002.GCUSCSI (3);      09800000
   END;                                                                 09810000
 ELSE                                                                   09820000
   DO;                                                                  09830000
     RCBBKA7_SERV_CTR.INDNULL (12) = -1;                                09840000
   END;                                                                 09850000
                                                                        09860000
 IF RCBBKA0_C002.GCUSCSI (4) ¬= ' '                                     09870000
 THEN                                                                   09880000
   DO;                                                                  09890000
     RCBBKA7_SERV_CTR.SERVICE_MODULE_4 = RCBBKA0_C002.GCUSCSI (4);      09900000
   END;                                                                 09910000
 ELSE                                                                   09920000
   DO;                                                                  09930000
     RCBBKA7_SERV_CTR.INDNULL (13) = -1;                                09940000
   END;                                                                 09950000
                                                                        09960000
 IF RCBBKA0_C002.GCUSCSI (5) ¬= ' '                                     09970000
 THEN                                                                   09980000
   DO;                                                                  09990000
     RCBBKA7_SERV_CTR.SERVICE_MODULE_5 = RCBBKA0_C002.GCUSCSI (5);      10000000
   END;                                                                 10010000
 ELSE                                                                   10020000
   DO;                                                                  10030000
     RCBBKA7_SERV_CTR.INDNULL (14) = -1;                                10040000
   END;                                                                 10050000
                                                                        10060000
 RCBBKA7_SERV_CTR.AGREEMENT_TYPE     = ' ';                             10070000
 RCBBKA7_SERV_CTR.INDNULL (15)       = -1;                              10080000
 RCBBKA7_SERV_CTR.AGREEMENT_OPTION   = ' ';                             10090000
 RCBBKA7_SERV_CTR.INDNULL (16)       = -1;                              10100000
 RCBBKA7_SERV_CTR.SPECIAL_OPTION     = ' ';                             10110000
 RCBBKA7_SERV_CTR.INDNULL (17)       = -1;                              10120000
 RCBBKA7_SERV_CTR.AMENDM_COMB_CODE   = ' ';                             10130000
 RCBBKA7_SERV_CTR.INDNULL (18)       = -1;                              10140000
                                                                        10150000
 IF RCBBKA0_C002.DAGRMFR (1) ¬= ' '                                     10160000
 THEN                                                                   10170000
   DO;                                                                  10180000
     RCBBKA7_SERV_CTR.COVERAGE_START_1 = RCBBKA0_C002.DAGRMFR (1);      10190000
   END;                                                                 10200000
 ELSE                                                                   10210000
   DO;                                                                  10220000
     RCBBKA7_SERV_CTR.INDNULL (19) = -1;                                10230000
   END;                                                                 10240000
                                                                        10250000
 IF RCBBKA0_C002.DAGRMTO (1) ¬= ' '                                     10260000
 THEN                                                                   10270000
   DO;                                                                  10280000
     RCBBKA7_SERV_CTR.COVERAGE_END_1 = RCBBKA0_C002.DAGRMTO (1);        10290000
   END;                                                                 10300000
 ELSE                                                                   10310000
   DO;                                                                  10320000
     RCBBKA7_SERV_CTR.INDNULL (20) = -1;                                10330000
   END;                                                                 10340000
                                                                        10350000
 IF RCBBKA0_C002.DAGRMFR (2) ¬= ' '                                     10360000
 THEN                                                                   10370000
   DO;                                                                  10380000
     RCBBKA7_SERV_CTR.COVERAGE_START_2 = RCBBKA0_C002.DAGRMFR (2);      10390000
   END;                                                                 10400000
 ELSE                                                                   10410000
   DO;                                                                  10420000
     RCBBKA7_SERV_CTR.INDNULL (21) = -1;                                10430000
   END;                                                                 10440000
                                                                        10450000
 IF RCBBKA0_C002.DAGRMTO (2) ¬= ' '                                     10460000
 THEN                                                                   10470000
   DO;                                                                  10480000
     RCBBKA7_SERV_CTR.COVERAGE_END_2 = RCBBKA0_C002.DAGRMTO (2);        10490000
   END;                                                                 10500000
 ELSE                                                                   10510000
   DO;                                                                  10520000
     RCBBKA7_SERV_CTR.INDNULL (22) = -1;                                10530000
   END;                                                                 10540000
                                                                        10550000
 IF RCBBKA0_C002.DAGRMFR (3) ¬= ' '                                     10560000
 THEN                                                                   10570000
   DO;                                                                  10580000
     RCBBKA7_SERV_CTR.COVERAGE_START_3 = RCBBKA0_C002.DAGRMFR (3);      10590000
   END;                                                                 10600000
 ELSE                                                                   10610000
   DO;                                                                  10620000
     RCBBKA7_SERV_CTR.INDNULL (23) = -1;                                10630000
   END;                                                                 10640000
                                                                        10650000
 IF RCBBKA0_C002.DAGRMTO (3) ¬= ' '                                     10660000
 THEN                                                                   10670000
   DO;                                                                  10680000
     RCBBKA7_SERV_CTR.COVERAGE_END_3 = RCBBKA0_C002.DAGRMTO (3);        10690000
   END;                                                                 10700000
 ELSE                                                                   10710000
   DO;                                                                  10720000
     RCBBKA7_SERV_CTR.INDNULL (24) = -1;                                10730000
   END;                                                                 10740000
                                                                        10750000
 IF RCBBKA0_C002.DAGRMFR (4) ¬= ' '                                     10760000
 THEN                                                                   10770000
   DO;                                                                  10780000
     RCBBKA7_SERV_CTR.COVERAGE_START_4 = RCBBKA0_C002.DAGRMFR (4);      10790000
   END;                                                                 10800000
 ELSE                                                                   10810000
   DO;                                                                  10820000
     RCBBKA7_SERV_CTR.INDNULL (25) = -1;                                10830000
   END;                                                                 10840000
                                                                        10850000
 IF RCBBKA0_C002.DAGRMTO (4) ¬= ' '                                     10860000
 THEN                                                                   10870000
   DO;                                                                  10880000
     RCBBKA7_SERV_CTR.COVERAGE_END_4 = RCBBKA0_C002.DAGRMTO (4);        10890000
   END;                                                                 10900000
 ELSE                                                                   10910000
   DO;                                                                  10920000
     RCBBKA7_SERV_CTR.INDNULL (26) = -1;                                10930000
   END;                                                                 10940000
                                                                        10950000
 IF RCBBKA0_C002.DAGRMFR (5) ¬= ' '                                     10960000
 THEN                                                                   10970000
   DO;                                                                  10980000
     RCBBKA7_SERV_CTR.COVERAGE_START_5 = RCBBKA0_C002.DAGRMFR (5);      10990000
   END;                                                                 11000000
 ELSE                                                                   11010000
   DO;                                                                  11020000
     RCBBKA7_SERV_CTR.INDNULL (27) = -1;                                11030000
   END;                                                                 11040000
                                                                        11050000
 IF RCBBKA0_C002.DAGRMTO (5) ¬= ' '                                     11060000
 THEN                                                                   11070000
   DO;                                                                  11080000
     RCBBKA7_SERV_CTR.COVERAGE_END_5 = RCBBKA0_C002.DAGRMTO (5);        11090000
   END;                                                                 11100000
 ELSE                                                                   11110000
   DO;                                                                  11120000
     RCBBKA7_SERV_CTR.INDNULL (28) = -1;                                11130000
   END;                                                                 11140000
                                                                        11150000
 IF RCBBKA0_C002.DAGRMFR (6) ¬= ' '                                     11160000
 THEN                                                                   11170000
   DO;                                                                  11180000
     RCBBKA7_SERV_CTR.COVERAGE_START_6 = RCBBKA0_C002.DAGRMFR (6);      11190000
   END;                                                                 11200000
 ELSE                                                                   11210000
   DO;                                                                  11220000
     RCBBKA7_SERV_CTR.INDNULL (29) = -1;                                11230000
   END;                                                                 11240000
                                                                        11250000
 IF RCBBKA0_C002.DAGRMTO (6) ¬= ' '                                     11260000
 THEN                                                                   11270000
   DO;                                                                  11280000
     RCBBKA7_SERV_CTR.COVERAGE_END_6 = RCBBKA0_C002.DAGRMTO (6);        11290000
   END;                                                                 11300000
 ELSE                                                                   11310000
   DO;                                                                  11320000
     RCBBKA7_SERV_CTR.INDNULL (30) = -1;                                11330000
   END;                                                                 11340000
                                                                        11350000
 IF RCBBKA0_C002.DAGRMFR (7) ¬= ' '                                     11360000
 THEN                                                                   11370000
   DO;                                                                  11380000
     RCBBKA7_SERV_CTR.COVERAGE_START_7 = RCBBKA0_C002.DAGRMFR (7);      11390000
   END;                                                                 11400000
 ELSE                                                                   11410000
   DO;                                                                  11420000
     RCBBKA7_SERV_CTR.INDNULL (31) = -1;                                11430000
   END;                                                                 11440000
                                                                        11450000
 IF RCBBKA0_C002.DAGRMTO (7) ¬= ' '                                     11460000
 THEN                                                                   11470000
   DO;                                                                  11480000
     RCBBKA7_SERV_CTR.COVERAGE_END_7 = RCBBKA0_C002.DAGRMTO (7);        11490000
   END;                                                                 11500000
 ELSE                                                                   11510000
   DO;                                                                  11520000
     RCBBKA7_SERV_CTR.INDNULL (32) = -1;                                11530000
   END;                                                                 11540000
                                                                        11550000
 IF RCBBKA0_C002.CCESTSV ¬= ' '                                         11560000
 THEN                                                                   11570000
   DO;                                                                  11580000
     RCBBKA7_SERV_CTR.SERVICE_TYPE = RCBBKA0_C002.CCESTSV;              11590000
   END;                                                                 11600000
 ELSE                                                                   11610000
   DO;                                                                  11620000
     RCBBKA7_SERV_CTR.INDNULL (33) = -1;                                11630000
   END;                                                                 11640000
                                                      /* SOC RC01191 */ 11650000
 RCBBKA7_SERV_CTR.SERVICE_LVL_CODE = RCBBKA0_C002.SERVICE_LVL_CODE ;    11660000
 IF RCBBKA7_SERV_CTR.SERVICE_LVL_CODE = ' '                             11670000
 THEN                                                                   11680000
   RCBBKA7_SERV_CTR.INDNULL (34)     = -1;                              11690000
 ELSE                                                                   11700000
   RCBBKA7_SERV_CTR.INDNULL (34)     = 0;                               11710000
                                                      /* EOC RC01191 */ 11720000
                                                                        11730000
 RCBBKA7_SERV_CTR.SOURCE_INDICATOR   = WRK_CHIS_LOCAL;    /* RA01207 */ 11740000
 RCBBKA7_SERV_CTR.EFFECTIVE_DATE     = RCBBKA0_C002.DDBSEFF;            11750000
 RCBBKA7_SERV_CTR.END_DATE           = RCBBKA0_C002.DDBSIAC;            11760000
                                                      /* SOC RB01320 */ 11770000
 IF (SWITCH_REAL_SERIAL) THEN DO;                                       11771000
 RCBBKA7_SERV_CTR.ORIGIN           = '';                                11772000
 RCBBKA7_SERV_CTR.SEQUENCE_NUMBER  = '';                                11773000
 RCBBKA7_SERV_CTR.ORIGIN           = SUBSTR(RCBBKA0_C002.               11774000
                                                   SERIAL_LNG,1,2);     11775000
                                                 /* SOC CEDS00000687 */ 11775187
 /* RCBBKA7_SERV_CTR.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.            11776083
                                                   SERIAL_LNG,3,27); */ 11777083
   RCBBKA7_SERV_CTR.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.             11777186
                                                   SERIAL_LNG,3,28);    11777283
                                                 /* EOC CEDS00000687 */ 11777387
 END;                                                 /* EOC RB01320 */ 11778000
                                                                        11779000
 WRITE FILE (RCBBKA7) FROM (RCBBKA7_REC);                               11780000
                                                                        11790000
 COUNT.CNT_CTRY.RCBBKA7 = COUNT.CNT_CTRY.RCBBKA7 + 1;                   11800000
                                                                        11810000
 WRK_HASH_FIELD = SUBSTR (RCBBKA7_SERV_CTR.SEQUENCE_NUMBER, 3, 4);      11820000
 CALL RCB018M (WRK_HASH_FIELD,                                          11830000
               COUNT.CNT_CTRY.RCBBKA7_HASH,                             11840000
               PTR_INT_AREA);                                           11850000
                                                                        11860000
                          /* WRITE ALSO A 220 RECORD WITH TPMNT = '2' */11870000
                          /* REST OF THE VALUES IS TAKEN FROM THE 240 */11880000
                          /* RECORD                                   */11890000
                                                                        11900000
 RCBBKA6_SUPPL_CTR                   = '';                              11910000
 RCBBKA6_SUPPL_CTR.REC_TYPE          = '02';                            11920000
 RCBBKA6_SUPPL_CTR.CTRYNO            = RCBBKA7_SERV_CTR.CTRYNO;         11930000
 RCBBKA6_SUPPL_CTR.PGR_TYPE          = WRK_PGR_TYPE;                    11940000
 RCBBKA6_SUPPL_CTR.RUN_DATE          = WRK_RUN_DATE;                    11950000
                                                                        11960000
 RCBBKA6_SUPPL_CTR.PRODUCT_TYPE      = RCBBKA7_SERV_CTR.PRODUCT_TYPE;   11970000
 RCBBKA6_SUPPL_CTR.ORIGIN            = RCBBKA7_SERV_CTR.ORIGIN;         11980000
 RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER   = RCBBKA7_SERV_CTR.SEQUENCE_NUMBER;11990000
 RCBBKA6_SUPPL_CTR.COUNTRY_NUMBER    = RCBBKA7_SERV_CTR.COUNTRY_NUMBER; 12000000
 RCBBKA6_SUPPL_CTR.TYPE_OF_MAINT     = WRK_TPMNT_VALUE.TPMNT_ST2_DEF;   12010000
 RCBBKA6_SUPPL_CTR.SOURCE_INDICATOR  = WRK_CHIS_LOCAL;    /* RA01207 */ 12020000
                                                          /* PTM 496 */ 12030000
 RCBBKA6_SUPPL_CTR.TYPE_OF_WARRANTY  = '';                              12040000
 RCBBKA6_SUPPL_CTR.INDNULL (06)      = -1;                              12050000
                                                      /* SOC RC01191 */ 12060000
 RCBBKA6_SUPPL_CTR.SERVICE_LVL_CODE = ' ';                              12070000
 RCBBKA6_SUPPL_CTR.INDNULL (07)     = 99;                               12080000
                                                      /* EOC RC01191 */ 12090000
 RCBBKA6_SUPPL_CTR.WARRANTY_EXP_DATE = '';                              12100000
 RCBBKA6_SUPPL_CTR.INDNULL (08)      = 99;                              12110000
                                                                        12120000
 RCBBKA6_SUPPL_CTR.EFFECTIVE_DATE    = RCBBKA7_SERV_CTR.EFFECTIVE_DATE; 12130000
 RCBBKA6_SUPPL_CTR.END_DATE          = RCBBKA7_SERV_CTR.END_DATE;       12140000
                                                      /* SOC RB01281 */ 12150000
 RCBBKA6_SUPPL_CTR.F_TYPE_OF_WARRANTY  = '';                            12160000
 /* RCBBKA6_SUPPL_CTR.INDNULL (13)      = 99;        /* CEDS00000466 */ 12170000
 RCBBKA6_SUPPL_CTR.INDNULL (13)      = -1;           /* CEDS00000466 */ 12180000
 RCBBKA6_SUPPL_CTR.F_SPLT_DATE  = '';                                   12190000
 /* RCBBKA6_SUPPL_CTR.INDNULL (14)      = 99;        /* CEDS00000466 */ 12200000
 RCBBKA6_SUPPL_CTR.INDNULL (14)      = -1;           /* CEDS00000466 */ 12210000
                                                      /* EOC RB01281 */ 12220000
                                                      /* SOC RB01298 */ 12230000
 RCBBKA6_SUPPL_CTR.SERVICE_LVL_CODE_2  = '';                            12240000
 RCBBKA6_SUPPL_CTR.INDNULL (15)        = -1;                            12250000
                                                      /* EOC RB01298 */ 12260000
                                                                        12270000
 WRITE FILE (RCBBKA6) FROM (RCBBKA6_REC);                               12280000
                                                                        12290000
 COUNT.CNT_CTRY.RCBBKA6 = COUNT.CNT_CTRY.RCBBKA6 + 1;                   12300000
                                                                        12310000
 WRK_HASH_FIELD = SUBSTR (RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER, 3, 4);     12320000
 CALL RCB018M (WRK_HASH_FIELD,                                          12330000
               COUNT.CNT_CTRY.RCBBKA6_HASH,                             12340000
               PTR_INT_AREA);                                           12350000
                                                                        12360000
 END R020_BUILD_WRITE_T0240;                                            12370000
                                                                        12380000
1/********************************************************************/ 12390000
 /*                                                                  */ 12400000
 /* MODULE NAME      : R021_BUILD_WRITE_T0310                        */ 12410000
 /*                                                                  */ 12420000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0310 RECORD  */ 12430000
 /*                                                                  */ 12440000
 /*                    IF PARAMETER RCB009 EXISTS THE FEATURE WILL   */ 12450000
 /*                    BE VALIDATED AGAINST THIS PARAMETER. IF IT    */ 12460000
 /*                    IS NOT VALID NO FEATURE RECORD WILL BE        */ 12470000
 /*                    WRITTEN. IF PARAMETER RCB009 DOES NOT EXIST   */ 12480000
 /*                    IT IS ASSUMED THAT ALL FEATURES ARE VALID.    */ 12490000
 /*                                                                  */ 12500000
 /********************************************************************/ 12510000
 R021_BUILD_WRITE_T0310 : PROC;                                         12520000
                                                                        12530000
 SWITCH_VALID_FEAT = TRUE;                                              12540000
                                                                        12550000
 IF SWITCH_RCB009_EXISTS                                                12560000
 THEN                                                                   12570000
   DO;                                                                  12580000
     DO WRK_FEAT_IDX = 1 TO WRK_FEAT_DIM WHILE (SWITCH_VALID_FEAT);     12590000
       IF RCBBKA0_C003.CSLMFRN =                                        12600000
          RCB009.FEATURE_TABLE.FEATURE_RPQ_CODE (WRK_FEAT_IDX)          12610000
       THEN                                                             12620000
         DO;                                                            12630000
           SWITCH_VALID_FEAT = FALSE;                                   12640000
         END;                                                           12650000
     END;                                                               12660000
   END;                                                                 12670000
                                                                        12680000
 IF SWITCH_VALID_FEAT                                                   12690000
 THEN                                                                   12700000
   DO;                                                                  12710000
     RCBBKA9_FEATURE                   = '';                            12720000
     RCBBKA9_FEATURE.REC_TYPE          = '02';                          12730000
     RCBBKA9_FEATURE.CTRYNO            = RCBBKA0_C003.IOPUCTY;          12740000
     RCBBKA9_FEATURE.PGR_TYPE          = WRK_PGR_TYPE;                  12750000
     RCBBKA9_FEATURE.RUN_DATE          = WRK_RUN_DATE;                  12760000
     RCBBKA9_FEATURE.PRODUCT_TYPE      = RCBBKA0_C003.CSLMTYP;          12770000
     RCBBKA9_FEATURE.ORIGIN            =                                12780000
                                   SUBSTR (RCBBKA0_C003.IHSIMID,1,2);   12790000
     RCBBKA9_FEATURE.SEQUENCE_NUMBER   =                                12800000
                                   SUBSTR (RCBBKA0_C003.IHSIMID,3,7);   12810000
     RCBBKA9_FEATURE.FEATURE_RPQ_CODE  = RCBBKA0_C003.CSLMFRN;          12820000
     RCBBKA9_FEATURE.COUNTRY_NUMBER    = RCBBKA0_C003.IOPUCTY;          12830000
                                                          /* RA01077 */ 12840000
     RCBBKA9_FEATURE.QUANTITY_FEATURE  = RCBBKA0_C003.QCUOFRQ;          12850000
     RCBBKA9_FEATURE.EFFECTIVE_DATE    = WRK_RUN_DATE;                  12860000
                                 /* PTM377                           */ 12870000
     RCBBKA9_FEATURE.END_DATE          = RCBBKA0_C003.DDBSIAC;          12880000
                                                                        12890000
     IF (SWITCH_REAL_SERIAL) THEN DO;                  /* SOC RB01320 */12891000
     RCBBKA9_FEATURE.ORIGIN           = '';                             12892000
     RCBBKA9_FEATURE.SEQUENCE_NUMBER  = '';                             12893000
     RCBBKA9_FEATURE.ORIGIN           = SUBSTR(TEMP_C002_C003,1,2);     12894000
                                                  /* SOC CEDS00000687 */12895087
 /*  RCBBKA9_FEATURE.SEQUENCE_NUMBER  = SUBSTR(TEMP_C002_C003,3,27); */ 12896083
     RCBBKA9_FEATURE.SEQUENCE_NUMBER  = SUBSTR(TEMP_C002_C003,3,28);    12897083
                                                  /* EOC CEDS00000687 */12897187
     END;                                              /* EOC RB01320 */12898000
     WRITE FILE (RCBBKA9) FROM (RCBBKA9_REC);                           12900000
                                                                        12910000
     COUNT.CNT_CTRY.RCBBKA9 = COUNT.CNT_CTRY.RCBBKA9 + 1;               12920000
                                                                        12930000
     WRK_HASH_FIELD = SUBSTR (RCBBKA9_FEATURE.SEQUENCE_NUMBER, 3, 4);   12940000
     CALL RCB018M (WRK_HASH_FIELD,                                      12950000
                   COUNT.CNT_CTRY.RCBBKA9_HASH,                         12960000
                   PTR_INT_AREA);                                       12970000
   END;                                                                 12980000
                                                                        12990000
 END R021_BUILD_WRITE_T0310;                                            13000000
                                                                        13010000
1/********************************************************************/ 13020000
 /*                                                                  */ 13030000
 /* MODULE NAME      : R030_READ_CHIS_REC                            */ 13040000
 /*                                                                  */ 13050000
 /* DESCRIPTION      : READ A RECORD FROM THE CHIS OR LOCAL          */ 13060000
 /*                  : INTERFACE FILE                                */ 13070000
 /*                                                                  */ 13080000
 /********************************************************************/ 13090000
 R030_READ_CHIS_REC : PROC;                                             13100000
                                                                        13110000
   READ FILE (RCBBKZ0) INTO (RCBBKA0_REC);                              13120000
                                                                        13130000
   IF SK_NEW.EOF = '0'  /* NOT YET EOF */                               13140000
   THEN                                                                 13150000
     DO;                                                                13160000
       SELECT (RCBBKA0_C000.CDBSFRT);  /* CHECK RECORD TYPE */          13170000
         WHEN ('C000')                                                  13180000
           DO;                                                          13190000
             COUNT.CNT_TOT.RCBBKA0 = COUNT.CNT_TOT.RCBBKA0 + 1;         13200000
           END;                                                         13210000
         WHEN ('C001')                                                  13220000
           DO;                                                          13230000
             SK_NEW.CTRYNO          = RCBBKA0_C001.IOPUCTY;             13240000
             COUNT.CNT_CTRY.RCBBKA0 = COUNT.CNT_CTRY.RCBBKA0 + 1;       13250000
           END;                                                         13260000
         WHEN ('C002')                                                  13270000
           DO;                                                          13280000
                                                      /* SOC PTM1175 */ 13290000
             /* CONVERT CHIS CONTRACT NUMBERS FROM 15 TO 6 CHARS.    */ 13300000
             /* DON'T CONVERT FOR ITALY, BECAUSE:                    */ 13310000
             /*   - THEIR CHIS CONTRACTNUMBERS ARE ALREADY 6 CHARS   */ 13320000
             /*   - FILE RCBBKAF0 ALSO CONTAINS EMACS CONTRACTS      */ 13330000
             /*                                              RA01207 */ 13340000
             /* DON'T CONVERT WHEN RUNNING LOCAL; PROC_ID = UL01     */ 13350000
                                                                        13360000
             IF RCBBKA0_C002.IOPUCTY = '758' |            /*   ITALY */ 13370000
                RCBBKA0_C002.IOPUCTY = '838' |            /*   SPAIN */ 13380000
                RCBBKA0_C002.IOPUCTY = '822' |            /*PORTUGAL */ 13390000
                RCBBKA0_C002.IOPUCTY = '755' |            /*  ISRAEL */ 13400000
                RCBBKA0_C002.IOPUCTY = '756' |            /*  ISRAEL */ 13410000
                RCBBKA0_C002.IOPUCTY = '726' |            /*  GREECE */ 13420000
                RCBBKA0_C002.IOPUCTY = '666' |            /*  CYPRUS */ 13430000
                RCBBKA0_C002.IOPUCTY = '862' |            /*  TURKEY */ 13440000
                COUNTRY_AREA.PROC_ID = 'UL01'             /* RA01207 */ 13450000
             THEN                                                       13460000
               DO;                                                      13470000
               END;                                                     13480000
             ELSE                                                       13490000
               DO;                                                      13500000
                                                      /* SOC PTM1058 */ 13510000
                 IF (SUBSTR(RCBBKA0_C002.IAGRNBR,10,6) ¬= '      ')     13520000
                 THEN                                                   13530000
                   DO;                                                  13540000
                     WRK_IAGRNBR = SUBSTR(RCBBKA0_C002.IAGRNBR,10,6);   13550000
                     RCBBKA0_C002.IAGRNBR = WRK_IAGRNBR;                13560000
                                                      /* EOC PTM1058 */ 13570000
                   END;                                                 13580000
               END;                                   /* EOC PTM1175 */ 13590000
                                                                        13600000
             SK_NEW.CTRYNO  = RCBBKA0_C002.IOPUCTY;                     13610000
             SK_NEW.TYPE    = RCBBKA0_C002.CSLMTYP;                     13620000
             SK_NEW.SERIAL  = RCBBKA0_C002.IHSIMID;                     13630000
             WRK_DDBSIAC    = RCBBKA0_C002.DDBSIAC;                     13640000
                                                                        13640100
                                                       /* SOC RB01320 */13641000
             SWITCH_REAL_SERIAL    = FALSE;                             13644000
                                                                        13645000
             TEMP_VAR_LONG =                                            13645300
                   TRIM(SUBSTR(RCBBKA0_C002.SERIAL_LNG,3,28),'0');      13645400
                                                                        13645500
             TEMP_VAR_SHORT=                                            13645600
                   TRIM(SUBSTR(RCBBKA0_C002.IHSIMID,3,7),'0');          13645700
                                                                        13646400
             IF ((SUBSTR(RCBBKA0_C002.IHSIMID,1,2)                      13647000
                 ¬= SUBSTR(RCBBKA0_C002.SERIAL_LNG,1,2))                13648000
               | (SUBSTR(TEMP_VAR_LONG,1,LENGTH(TEMP_VAR_LONG))         13649000
                                                 /* SOC CEDS00000638 */ 13649177
                 ¬= SUBSTR(TEMP_VAR_SHORT,1,LENGTH(TEMP_VAR_SHORT))))   13649275
               & (WRK_CHIS_LOCAL = 'C')                                 13649375
 /*              ¬= SUBSTR(TEMP_VAR_SHORT,1,LENGTH(TEMP_VAR_SHORT))) */ 13649475
 /*            & (WRK_CHIS_LOCAL = 'C'))                             */ 13649575
                                                 /* EOC CEDS00000638 */ 13649677
             THEN DO;                                                   13649700
                SWITCH_REAL_SERIAL = TRUE;                              13649800
                TEMP_C002_C003 = RCBBKA0_C002.SERIAL_LNG;               13649900
             END;                                                       13650000
                                                       /* EOC RB01320 */13650300
                                                                        13650400
             IF SWITCH_HASH_TOTAL ¬= '1' THEN DO;          /* RB01312 */13651000
             WRK_HASH_FIELD = SUBSTR (RCBBKA0_C002.IHSIMID,5,4);        13660000
             CALL RCB018M (WRK_HASH_FIELD,                              13670000
                           COUNT.CNT_CTRY.RCBBKA0_HASH,                 13680000
                           PTR_INT_AREA);                               13690000
             END;                                          /* RB01312 */13691000
                                                                        13700000
             COUNT.CNT_CTRY.RCBBKA0 = COUNT.CNT_CTRY.RCBBKA0 + 1;       13710000
           END;                                                         13720000
         WHEN ('C003')                                                  13730000
           DO;                                                          13740000
             SK_NEW.CTRYNO  = RCBBKA0_C003.IOPUCTY;                     13750000
             SK_NEW.TYPE    = RCBBKA0_C003.CSLMTYP;                     13760000
             SK_NEW.SERIAL  = RCBBKA0_C003.IHSIMID;                     13770000
                                                                        13780000
             WRK_HASH_FIELD = SUBSTR (RCBBKA0_C003.IHSIMID,5,4);        13790000
             IF SWITCH_HASH_TOTAL ¬= '1' THEN DO;          /* RB01312 */13791000
             CALL RCB018M (WRK_HASH_FIELD,                              13800000
                           COUNT.CNT_CTRY.RCBBKA0_HASH,                 13810000
                           PTR_INT_AREA);                               13820000
             END;                                          /* RB01312 */13821000
                                                                        13830000
             COUNT.CNT_CTRY.RCBBKA0 = COUNT.CNT_CTRY.RCBBKA0 + 1;       13840000
           END;                                                         13850000
         WHEN ('C998')                                                  13860000
           DO;                                                          13870000
             SK_NEW.CTRYNO          = HIGH (3);  /* FORCE CTRY END */   13880000
             COUNT.CNT_CTRY.RCBBKA0 = COUNT.CNT_CTRY.RCBBKA0 + 1;       13890000
           END;                                                         13900000
         WHEN ('C999')                                                  13910000
           DO;                                                          13920000
             SK_NEW.EOF             = '1';  /* FORCE EOF */             13930000
             COUNT.CNT_TOT.RCBBKA0 = COUNT.CNT_TOT.RCBBKA0 + 1;         13940000
           END;                                                         13950000
         OTHERWISE                                                      13960000
           DO;                                                          13970000
             PARM_INT_AREA.MSG_VAR_CODES    = '';                       13980000
             PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                     13990000
             PARM_INT_AREA.MESSAGE_NUMBER   = '0018';                   14000000
             PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                     14010000
             PARM_INT_AREA.MSG_VAR_VALUE_6  =  WRK_RCBBKA0;             14020000
             PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';                     14030000
             PARM_INT_AREA.MSG_VAR_VALUE_7  =  RCBBKA0_C000.CDBSFRT;    14040000
             CALL RCB0M1M (PTR_INT_AREA);                               14050000
             CALL RCBBKAM_ERROR (NULL, 'OTHER', '#001');                14060000
           END;                                                         14070000
       END;  /* SELECT */                                               14080000
                                                          /* RC01141 */ 14090000
       PARM_INT_AREA.ERR_AREA.SEQUENCE_KEY = STRING(SK_NEW);            14100000
     END;                                                               14110000
                                                                        14120000
 END R030_READ_CHIS_REC;                                                14130000
                                                                        14140000
1/********************************************************************/ 14150000
 /*                                                                  */ 14160000
 /* MODULE NAME      : R033B_CHECK_HW_IGNORE                         */ 14170000
 /*                                                                  */ 14180000
 /* DESCRIPTION      : VERIFY IF HW IS WTAAS OWNED, IF SO SET SWITCH */ 14190000
 /*                                                                  */ 14200000
 /********************************************************************/ 14210000
 R033B_CHECK_HW_IGNORE : PROC;                                          14220000
                                                                        14230000
 OLD_KEY = SK_OLD.CTRYNO || SK_OLD.TYPE || SK_OLD.SERIAL;               14240000
                                                                        14250000
 DO WHILE (RCBBXB2_DATA.RCBBXB2_KEY < OLD_KEY);                         14260000
         IF ¬EOF_RCBBXB2                                                14270000
         THEN DO;                                                       14280000
            READ FILE(RCBBXB2) INTO(RCBBXB2_REC);                       14290000
            IF  RCBBXB2_DATA.REC_TYPE = '99'                            14300000
            THEN                                                        14310000
              RCBBXB2_DATA.RCBBXB2_KEY = (16)'9';                       14320000
         END;                                                           14330000
 END;                                                                   14340000
                                                                        14350000
 IF RCBBXB2_DATA.RCBBXB2_KEY = OLD_KEY                                  14360000
 THEN                                                                   14370000
                                                                        14380000
        SWITCH_HW_IGNORE = '1'B;                                        14390000
 ELSE                                                                   14400000
        SWITCH_HW_IGNORE = '0'B;                                        14410000
                                                                        14420000
 END R033B_CHECK_HW_IGNORE;                                             14430000
1/********************************************************************/ 14440000
 /*                                                                  */ 14450000
 /* MODULE NAME      : R040_BUILD_WRITE_T0030                        */ 14460000
 /*                                                                  */ 14470000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0030 RECORD  */ 14480000
 /*                                                                  */ 14490000
 /*                    HASH TOTALS WILL BE CALCULATED DURING R092    */ 14500000
 /*                    IN WHICH DUPLICATES ARE SORTED OUT.           */ 14510000
 /*                                                                  */ 14520000
 /********************************************************************/ 14530000
 R040_BUILD_WRITE_T0030 : PROC;                                         14540000
                                                                        14550000
 RCBBKA1_CONTRACT           = '';                                       14560000
 RCBBKA1_CONTRACT.REC_TYPE  = '02';                                     14570000
 RCBBKA1_CONTRACT.CTRYNO    = RCBBKA0_C002.IOPUCTY;                     14580000
 RCBBKA1_CONTRACT.PGR_TYPE  = WRK_PGR_TYPE;                             14590000
 RCBBKA1_CONTRACT.RUN_DATE  = WRK_RUN_DATE;                             14600000
                                                                        14610000
 RCBBKA1_CONTRACT.COUNTRY_NUMBER    =  RCBBKA0_C002.IOPUCTY;            14620000
 RCBBKA1_CONTRACT.CONTRACT_NUMBER   =  RCBBKA0_C002.IAGRNBR;            14630000
                                                                        14640000
 IF RCBBKA0_C002.IAGRTCN ¬= ' '                                         14650000
 THEN                                                                   14660000
   DO;                                                                  14670000
     RCBBKA1_CONTRACT.TYPE_OF_CONTRACT = RCBBKA0_C002.IAGRTCN;          14680000
   END;                                                                 14690000
 ELSE                                                                   14700000
   DO;                                                                  14710000
     RCBBKA1_CONTRACT.INDNULL (03) = -1;                                14720000
   END;                                                                 14730000
                                                                        14740000
 IF RCBBKA0_C002.FAGRINT ¬= ' '                                         14750000
 THEN                                                                   14760000
   DO;                                                                  14770000
     RCBBKA1_CONTRACT.INT_CONTRACT_IND = RCBBKA0_C002.FAGRINT;          14780000
   END;                                                                 14790000
 ELSE                                                                   14800000
   DO;                                                                  14810000
     RCBBKA1_CONTRACT.INDNULL (04) = -1;                                14820000
   END;                                                                 14830000
                                                                        14840000
 WRITE FILE (RCBBKAB) FROM (RCBBKA1_REC);       /* RA01120 DDNAME    */ 14850000
                                                                        14860000
 COUNT.CNT_CTRY.RCBBKA1 = COUNT.CNT_CTRY.RCBBKA1 + 1;                   14870000
                                                                        14880000
 END R040_BUILD_WRITE_T0030;                                            14890000
                                                                        14900000
1/* ----------- RA01120 AMENDMENT ---------------------------------- */ 14910000
 /********************************************************************/ 14920000
 /*                                                                  */ 14930000
 /* MODULE NAME      : R041_BUILD_WRITE_T0035                        */ 14940000
 /*                                                                  */ 14950000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0035 RECORD  */ 14960000
 /*                    IF THE USER EXIT RCBBK3U IS ACTIVATED, THE    */ 14970000
 /*                    SA_CONTRACT_IND WILL BE FILLED VIA THIS EXIT, */ 14980000
 /*                    ELSE SA_CONTRACT_IND WILL BE BLANK.           */ 14990000
 /*                    ONLY TWO VALUES ARE ALLOWED : ' ' OR 'Y'      */ 15000000
 /*                                                                  */ 15010000
 /*                    HASH TOTALS WILL BE CALCULATED DURING R093    */ 15020000
 /*                    IN WHICH DUPLICATES ARE SORTED OUT.           */ 15030000
 /*                                                                  */ 15040000
 /********************************************************************/ 15050000
 R041_BUILD_WRITE_T0035 : PROC;                                         15060000
                                                                        15070000
 DCL 1 SA_CONTR_IND_EXIT   CHAR (01);                                   15080000
 DCL 1 RCBBKA0_C002_COPY,                                               15090000
       %INCLUDE (RCBBKAS3);;                                            15100000
                                                                        15110000
 RCBBKAA_CUST_CTR           = '';                                       15120000
 RCBBKAA_CUST_CTR.REC_TYPE  = '02';                                     15130000
 RCBBKAA_CUST_CTR.CTRYNO    = RCBBKA0_C002.IOPUCTY;                     15140000
 RCBBKAA_CUST_CTR.PGR_TYPE  = WRK_PGR_TYPE;                             15150000
 RCBBKAA_CUST_CTR.RUN_DATE  = WRK_RUN_DATE;                             15160000
                                                                        15170000
 RCBBKAA_CUST_CTR.COUNTRY_NUMBER    =  RCBBKA0_C002.IOPUCTY;            15180000
 RCBBKAA_CUST_CTR.CONTRACT_NUMBER   =  RCBBKA0_C002.IAGRNBR;            15190000
 RCBBKAA_CUST_CTR.CUSTOMER_NUMBER   =  RCBBKA0_C002.ICUSHWU;            15200000
 RCBBKAA_CUST_CTR.AS_CONTRACT_IND   =  ' ';                             15210000
                                                                        15220000
 IF SWITCH_USER_EXIT_3                                                  15230000
 THEN                                                                   15240000
   DO;                                                                  15250000
     SA_CONTR_IND_EXIT = ' ';                                           15260000
     RCBBKA0_C002_COPY = RCBBKA0_C002 , BY NAME;                        15270000
                                                                        15280000
     CALL RCBBK3U (ADDR (SWITCH_USER_EXIT_3),                           15290000
                   ADDR (RCBBKA0_C002_COPY),                            15300000
                   ADDR (SA_CONTR_IND_EXIT),                            15310000
                   PTR_INT_AREA);                                       15320000
                                                                        15330000
   END;                                                                 15340000
                                                                        15350000
 IF SWITCH_USER_EXIT_3                                                  15360000
 THEN                                                                   15370000
   DO;                                                                  15380000
     IF SA_CONTR_IND_EXIT = ' ' | SA_CONTR_IND_EXIT = 'Y'               15390000
     THEN                                                               15400000
       DO;                                                              15410000
         RCBBKAA_CUST_CTR.SA_CONTRACT_IND = SA_CONTR_IND_EXIT;          15420000
       END;                                                             15430000
     ELSE                                /* CAUSE AN ABEND          */  15440000
       DO;                                                              15450000
         PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                        15460000
         PARM_INT_AREA.MESSAGE_NUMBER    = '0196';                      15470000
         PARM_INT_AREA.MSG_VAR_CODES     = ' ';                         15480000
         PARM_INT_AREA.MSG_VAR_CODE_6    = 'FN';                        15490000
         PARM_INT_AREA.MSG_VAR_VALUE_6   = 'SA_CONTRACT_IND';           15500000
         PARM_INT_AREA.MSG_VAR_CODE_7    = 'NV';                        15510000
         PARM_INT_AREA.MSG_VAR_VALUE_7   = SA_CONTR_IND_EXIT;           15520000
         CALL RCB0M1M (PTR_INT_AREA);                                   15530000
         CALL RCBBKAM_ERROR (NULL,'OTHER','#002');                      15540000
       END;                                                             15550000
   END;                                                                 15560000
 ELSE                                                                   15570000
   DO;                                                                  15580000
     RCBBKAA_CUST_CTR.SA_CONTRACT_IND = ' ';                            15590000
   END;                                                                 15600000
                                                                        15610000
 WRITE FILE (RCBBKAC) FROM (RCBBKAA_REC);                               15620000
                                                                        15630000
 COUNT.CNT_CTRY.RCBBKAA = COUNT.CNT_CTRY.RCBBKAA + 1;                   15640000
                                                                        15650000
 END R041_BUILD_WRITE_T0035;                                            15660000
                                                                        15670000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 15680000
1/********************************************************************/ 15690000
 /*                                                                  */ 15700000
 /* MODULE NAME      : R042_BUILD_WRITE_T0050                        */ 15710000
 /*                                                                  */ 15720000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0050 RECORD  */ 15730000
 /*                                                                  */ 15740000
 /********************************************************************/ 15750000
 R042_BUILD_WRITE_T0050 : PROC;                                         15760000
                                                                        15770000
 RCBBKA2_HW_PRODUCT                  = '';                              15780000
 RCBBKA2_HW_PRODUCT.REC_TYPE         = '02';                            15790000
 RCBBKA2_HW_PRODUCT.CTRYNO           = RCBBKA0_C002.IOPUCTY;            15800000
 RCBBKA2_HW_PRODUCT.PGR_TYPE         = WRK_PGR_TYPE;                    15810000
 RCBBKA2_HW_PRODUCT.RUN_DATE         = WRK_RUN_DATE;                    15820000
                                                                        15830000
 RCBBKA2_HW_PRODUCT.PRODUCT_TYPE     = RCBBKA0_C002.CSLMTYP;            15840000
 RCBBKA2_HW_PRODUCT.ORIGIN           = SUBSTR(RCBBKA0_C002.IHSIMID,1,2);15850000
 RCBBKA2_HW_PRODUCT.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.IHSIMID,3,7);15860000
 RCBBKA2_HW_PRODUCT.COUNTRY_NUMBER   = RCBBKA0_C002.IOPUCTY;            15870000
                                                                        15870100
 IF (SWITCH_REAL_SERIAL) THEN DO;                      /* SOC RB01320 */15871000
 RCBBKA2_HW_PRODUCT.ORIGIN           = '';                              15872000
 RCBBKA2_HW_PRODUCT.SEQUENCE_NUMBER  = '';                              15873000
 RCBBKA2_HW_PRODUCT.ORIGIN           = SUBSTR(RCBBKA0_C002.             15874000
                                                   SERIAL_LNG,1,2);     15876000
                                                  /* SOC CEDS00000687 */15876187
 /* RCBBKA2_HW_PRODUCT.SEQUENCE_NUMBER = SUBSTR(RCBBKA0_C002.           15877083
                                                   SERIAL_LNG,3,27);  */15878083
  RCBBKA2_HW_PRODUCT.SEQUENCE_NUMBER = SUBSTR(RCBBKA0_C002.             15879085
                                                   SERIAL_LNG,3,28);    15879183
                                                  /* EOC CEDS00000687 */15879287
 END;                                                  /* EOC RB01320 */15879383
                                                                        15880000
 WRITE FILE (RCBBKA2) FROM (RCBBKA2_REC);                               15890000
                                                                        15900000
 COUNT.CNT_CTRY.RCBBKA2 = COUNT.CNT_CTRY.RCBBKA2 + 1;                   15910000
                                                                        15920000
 WRK_HASH_FIELD = SUBSTR (RCBBKA2_HW_PRODUCT.SEQUENCE_NUMBER, 3, 4);    15930000
 CALL RCB018M (WRK_HASH_FIELD,                                          15940000
               COUNT.CNT_CTRY.RCBBKA2_HASH,                             15950000
               PTR_INT_AREA);                                           15960000
                                                                        15970000
 END R042_BUILD_WRITE_T0050;                                            15980000
                                                                        15990000
1/********************************************************************/ 16000000
 /*                                                                  */ 16010000
 /* MODULE NAME      : R043_BUILD_T0110                              */ 16020000
 /*                    R043B_WRITE_T0110                             */ 16030000
 /*                                                                  */ 16040000
 /* DESCRIPTION      : BUILD A TABLE LIKE RCBT0110 RECORD            */ 16050000
 /*                    WRITE CALLED LATER IF NEEDED                  */ 16060000
 /*                                                                  */ 16070000
 /********************************************************************/ 16080000
 R043_BUILD_T0110 : PROC;                                               16090000
                                                                        16100000
 RCBBKA3_HW_STATUS                  = '';                               16110000
 RCBBKA3_HW_STATUS.REC_TYPE         = '02';                             16120000
 RCBBKA3_HW_STATUS.CTRYNO           = RCBBKA0_C002.IOPUCTY;             16130000
 RCBBKA3_HW_STATUS.PGR_TYPE         = WRK_PGR_TYPE;                     16140000
 RCBBKA3_HW_STATUS.RUN_DATE         = WRK_RUN_DATE;                     16150000
                                                                        16160000
 RCBBKA3_HW_STATUS.PRODUCT_TYPE     = RCBBKA0_C002.CSLMTYP;             16170000
 RCBBKA3_HW_STATUS.ORIGIN           = SUBSTR (RCBBKA0_C002.IHSIMID,1,2);16180000
 RCBBKA3_HW_STATUS.SEQUENCE_NUMBER  = SUBSTR (RCBBKA0_C002.IHSIMID,3,7);16190000
 RCBBKA3_HW_STATUS.COUNTRY_NUMBER   = RCBBKA0_C002.IOPUCTY;             16200000
 RCBBKA3_HW_STATUS.STATUS           = '3';                              16210000
 RCBBKA3_HW_STATUS.SOURCE_INDICATOR = WRK_CHIS_LOCAL;     /* RA01207 */ 16220000
 RCBBKA3_HW_STATUS.EFFECTIVE_DATE   = WRK_RUN_DATE;                     16230000
 RCBBKA3_HW_STATUS.END_DATE         = ' ';                              16240000
                                                                        16250000
 IF (SWITCH_REAL_SERIAL) THEN DO;                      /* SOC RB01320 */16251000
 RCBBKA3_HW_STATUS.ORIGIN           = '';                               16252000
 RCBBKA3_HW_STATUS.SEQUENCE_NUMBER  = '';                               16253000
 RCBBKA3_HW_STATUS.ORIGIN           = SUBSTR(RCBBKA0_C002.              16254000
                                                     SERIAL_LNG,1,2);   16256000
                                                  /* SOC CEDS00000687 */16256187
 /* RCBBKA3_HW_STATUS.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.           16257083
                                                     SERIAL_LNG,3,27);*/16259083
  RCBBKA3_HW_STATUS.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.             16259186
                                                     SERIAL_LNG,3,28);  16259283
                                                  /* EOC CEDS00000687 */16259387
 END;                                                  /* EOC RB01320 */16259483
                                                                        16259583
 END R043_BUILD_T0110;                                                  16260000
 /********************************************************************/ 16270000
 R043B_WRITE_T0110 : PROC;                                              16280000
                                                                        16290000
 WRITE FILE (RCBBKA3) FROM (RCBBKA3_REC);                               16300000
                                                                        16310000
 COUNT.CNT_CTRY.RCBBKA3 = COUNT.CNT_CTRY.RCBBKA3 + 1;                   16320000
                                                                        16330000
 WRK_HASH_FIELD = SUBSTR (RCBBKA3_HW_STATUS.SEQUENCE_NUMBER, 3, 4);     16340000
 CALL RCB018M (WRK_HASH_FIELD,                                          16350000
               COUNT.CNT_CTRY.RCBBKA3_HASH,                             16360000
               PTR_INT_AREA);                                           16370000
                                                                        16380000
 END R043B_WRITE_T0110;                                                 16390000
                                                                        16400000
1/********************************************************************/ 16410000
 /*                                                                  */ 16420000
 /* MODULE NAME      : R044_BUILD_T0170                              */ 16430000
 /*                    R044B_WRITE_T0170                             */ 16440000
 /*                                                                  */ 16450000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0170 RECORD  */ 16460000
 /*                    IF THE USER EXIT RCBBK2U IS ACTIVATED, THE    */ 16470000
 /*                    OU_CODE WILL BE FILLED VIA THIS EXIT. OTHER-  */ 16480000
 /*                    WISE CODPBUC IS USED.                         */ 16490000
 /*                                                                  */ 16500000
 /********************************************************************/ 16510000
 R044_BUILD_T0170 : PROC;                                               16520000
                                                                        16530000
 DCL 1 OU_CODE_EXIT         CHAR (07);                                  16540000
 DCL 1 SWITCH_LOADED        BIT  (01)   INIT ('0'B);                    16550000
 DCL 1 RCBBKA0_C002_COPY,                                               16560000
       %INCLUDE (RCBBKAS3);;                                            16570000
                                                                        16580000
 RCBBKA4_OU_HW                      = '';                               16590000
 RCBBKA4_OU_HW.REC_TYPE             = '02';                             16600000
 RCBBKA4_OU_HW.CTRYNO               = RCBBKA0_C002.IOPUCTY;             16610000
 RCBBKA4_OU_HW.PGR_TYPE             = WRK_PGR_TYPE;                     16620000
 RCBBKA4_OU_HW.RUN_DATE             = WRK_RUN_DATE;                     16630000
                                                                        16640000
 RCBBKA4_OU_HW.COUNTRY_NUMBER       = RCBBKA0_C002.IOPUCTY;             16650000
                                                                        16660000
 IF SWITCH_USER_EXIT_2                                                  16670000
 THEN                                                                   16680000
   DO;                                                                  16690000
     OU_CODE_EXIT      = ' ';                                           16700000
     RCBBKA0_C002_COPY = RCBBKA0_C002 , BY NAME;                        16710000
                                                                        16720000
     CALL RCBBK2U (ADDR (SWITCH_USER_EXIT_2),                           16730000
                   ADDR (RCBBKA0_C002_COPY),                            16740000
                   ADDR (OU_CODE_EXIT),                                 16750000
                   PTR_INT_AREA);                                       16760000
                                                                        16770000
   END;                                                                 16780000
                                                                        16790000
 IF SWITCH_USER_EXIT_2                                                  16800000
 THEN                                                                   16810000
   DO;                                                                  16820000
     RCBBKA4_OU_HW.OU_CODE = OU_CODE_EXIT;                              16830000
   END;                                                                 16840000
 ELSE                                                                   16850000
   DO;                                                                  16860000
     RCBBKA4_OU_HW.OU_CODE = RCBBKA0_C002.CODPBUC;                      16870000
   END;                                                                 16880000
                                                                        16890000
 /* RCBBKA4_OU_HW.EFFECTIVE_DATE_OU    = ' '               (RB01140) */ 16900000
 RCBBKA4_OU_HW.PRODUCT_TYPE         = RCBBKA0_C002.CSLMTYP;             16910000
 RCBBKA4_OU_HW.ORIGIN               = SUBSTR (RCBBKA0_C002.IHSIMID,1,2);16920000
 RCBBKA4_OU_HW.SEQUENCE_NUMBER      = SUBSTR (RCBBKA0_C002.IHSIMID,3,7);16930000
 RCBBKA4_OU_HW.EFFECTIVE_DATE       = WRK_RUN_DATE;                     16940000
 RCBBKA4_OU_HW.END_DATE             = ' ';                              16950000
                                                                        16950100
 IF (SWITCH_REAL_SERIAL) THEN DO;                      /* SOC RB01320 */16951000
 RCBBKA4_OU_HW.ORIGIN           = '';                                   16952000
 RCBBKA4_OU_HW.SEQUENCE_NUMBER  = '';                                   16953000
 RCBBKA4_OU_HW.ORIGIN           = SUBSTR(RCBBKA0_C002.                  16954000
                                                 SERIAL_LNG,1,2);       16955000
                                                  /* SOC CEDS00000687 */16956087
 /* RCBBKA4_OU_HW.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.               16957083
                                                 SERIAL_LNG,3,27);    */16958083
  RCBBKA4_OU_HW.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.                 16958186
                                                 SERIAL_LNG,3,28);      16958283
                                                  /* EOC CEDS00000687 */16959087
 END;                                                  /* EOC RB01320 */16959100
                                                                        16960000
 END R044_BUILD_T0170;                                                  16970000
 /********************************************************************/ 16980000
 R044B_WRITE_T0170 : PROC;                                              16990000
                                                                        17000000
 WRITE FILE (RCBBKA4) FROM (RCBBKA4_REC);                               17010000
                                                                        17020000
 COUNT.CNT_CTRY.RCBBKA4 = COUNT.CNT_CTRY.RCBBKA4 + 1;                   17030000
                                                                        17040000
 WRK_HASH_FIELD = SUBSTR (RCBBKA4_OU_HW.SEQUENCE_NUMBER, 3, 4);         17050000
 CALL RCB018M (WRK_HASH_FIELD,                                          17060000
               COUNT.CNT_CTRY.RCBBKA4_HASH,                             17070000
               PTR_INT_AREA);                                           17080000
                                                                        17090000
 END R044B_WRITE_T0170;                                                 17100000
                                                                        17110000
1/********************************************************************/ 17120000
 /*                                                                  */ 17130000
 /* MODULE NAME      : R045_WRITE_T0190                              */ 17140000
 /*                    R045B_WRITE_T0190                             */ 17150000
 /*                                                                  */ 17160000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0190 RECORD  */ 17170000
 /*                                                                  */ 17180000
 /********************************************************************/ 17190000
 R045_BUILD_T0190 : PROC;                                               17200000
                                                                        17210000
 RCBBKA5_HW_CUST                    = '';                               17220000
 RCBBKA5_HW_CUST.REC_TYPE           = '02';                             17230000
 RCBBKA5_HW_CUST.CTRYNO             = RCBBKA0_C002.IOPUCTY;             17240000
 RCBBKA5_HW_CUST.PGR_TYPE           = WRK_PGR_TYPE;                     17250000
 RCBBKA5_HW_CUST.RUN_DATE           = WRK_RUN_DATE;                     17260000
                                                                        17270000
 RCBBKA5_HW_CUST.COUNTRY_NUMBER     = RCBBKA0_C002.IOPUCTY;             17280000
 RCBBKA5_HW_CUST.PRODUCT_TYPE       = RCBBKA0_C002.CSLMTYP;             17290000
 RCBBKA5_HW_CUST.ORIGIN             = SUBSTR (RCBBKA0_C002.IHSIMID,1,2);17300000
 RCBBKA5_HW_CUST.SEQUENCE_NUMBER    = SUBSTR (RCBBKA0_C002.IHSIMID,3,7);17310000
 RCBBKA5_HW_CUST.CUSTOMER_NUMBER    = RCBBKA0_C002.ICUSHWU;             17320000
 RCBBKA5_HW_CUST.TYPE_OF_RELATION   = 'U';                              17330000
 RCBBKA5_HW_CUST.MARKETING_INSTDAT  = ' ';                              17340000
 RCBBKA5_HW_CUST.INDNULL (07)       = -1;                               17350000
 RCBBKA5_HW_CUST.SCHED_REMOVAL_DATE = ' ';                              17360000
 RCBBKA5_HW_CUST.INDNULL (08)       = -1;                               17370000
 RCBBKA5_HW_CUST.EFFECTIVE_DATE     = WRK_RUN_DATE;                     17380000
 RCBBKA5_HW_CUST.END_DATE           = ' ';                              17390000
                                                                        17391000
 IF (SWITCH_REAL_SERIAL) THEN DO;                      /* SOC RB01320 */17392000
 RCBBKA5_HW_CUST.ORIGIN           = '';                                 17393000
 RCBBKA5_HW_CUST.SEQUENCE_NUMBER  = '';                                 17394000
 RCBBKA5_HW_CUST.ORIGIN           = SUBSTR(RCBBKA0_C002.                17395000
                                                   SERIAL_LNG,1,2);     17397000
                                                 /* SOC CEDS00000687 */ 17397187
 /* RCBBKA5_HW_CUST.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.             17398083
                                                   SERIAL_LNG,3,27); */ 17399183
  RCBBKA5_HW_CUST.SEQUENCE_NUMBER  = SUBSTR(RCBBKA0_C002.               17399286
                                                   SERIAL_LNG,3,28);    17399383
                                                 /* EOC CEDS00000687 */ 17399487
 END;                                                  /* EOC RB01320 */17399583
                                                                        17399683
                                                                        17400000
 END R045_BUILD_T0190;                                                  17410000
 /********************************************************************/ 17420000
 R045B_WRITE_T0190 : PROC;                                              17430000
 WRITE FILE (RCBBKA5) FROM (RCBBKA5_REC);                               17440000
                                                                        17450000
 COUNT.CNT_CTRY.RCBBKA5 = COUNT.CNT_CTRY.RCBBKA5 + 1;                   17460000
                                                                        17470000
 WRK_HASH_FIELD = SUBSTR (RCBBKA5_HW_CUST.SEQUENCE_NUMBER, 3, 4);       17480000
 CALL RCB018M (WRK_HASH_FIELD,                                          17490000
               COUNT.CNT_CTRY.RCBBKA5_HASH,                             17500000
               PTR_INT_AREA);                                           17510000
                                                                        17520000
 END R045B_WRITE_T0190;                                                 17530000
                                                                        17540000
1/********************************************************************/ 17550000
 /*                                                                  */ 17560000
 /* MODULE NAME      : R046_BUILD_T0300                              */ 17570000
 /*                    R046B_WRITE_T0300                             */ 17580000
 /*                                                                  */ 17590000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0300 RECORD  */ 17600000
 /*                                                                  */ 17610000
 /********************************************************************/ 17620000
 R046_BUILD_T0300 : PROC;                                               17630000
                                                                        17640000
 RCBBKA8_HW_REAL                    = '';                               17650000
 RCBBKA8_HW_REAL.REC_TYPE           = '02';                             17660000
 RCBBKA8_HW_REAL.CTRYNO             = RCBBKA0_C002.IOPUCTY;             17670000
 RCBBKA8_HW_REAL.PGR_TYPE           = WRK_PGR_TYPE;                     17680000
 RCBBKA8_HW_REAL.RUN_DATE           = WRK_RUN_DATE;                     17690000
                                                                        17700000
 RCBBKA8_HW_REAL.PRODUCT_TYPE       = RCBBKA0_C002.CSLMTYP;             17710000
 RCBBKA8_HW_REAL.ORIGIN             = SUBSTR (RCBBKA0_C002.IHSIMID,1,2);17720000
 RCBBKA8_HW_REAL.SEQUENCE_NUMBER    = SUBSTR (RCBBKA0_C002.IHSIMID,3,7);17730000
 RCBBKA8_HW_REAL.COUNTRY_NUMBER     = RCBBKA0_C002.IOPUCTY;             17740000
 RCBBKA8_HW_REAL.MODEL_NUMBER       = RCBBKA0_C002.CSLMMOD;             17750000
 RCBBKA8_HW_REAL.EFFECTIVE_DATE     = WRK_RUN_DATE;                     17760000
 RCBBKA8_HW_REAL.END_DATE           = ' ';                              17770000
                                                                        17771000
 IF (SWITCH_REAL_SERIAL) THEN DO;                     /* SOC RB01320 */ 17772000
 RCBBKA8_HW_REAL.ORIGIN             = '';                               17773000
 RCBBKA8_HW_REAL.SEQUENCE_NUMBER    = '';                               17774000
 RCBBKA8_HW_REAL.ORIGIN             = SUBSTR(RCBBKA0_C002.              17775000
                                                     SERIAL_LNG,1,2);   17776000
                                                 /* SOC CEDS00000687 */ 17777087
 /* RCBBKA8_HW_REAL.SEQUENCE_NUMBER    = SUBSTR(RCBBKA0_C002.           17778083
                                                     SERIAL_LNG,3,27);*/17779183
  RCBBKA8_HW_REAL.SEQUENCE_NUMBER    = SUBSTR(RCBBKA0_C002.             17779286
                                                     SERIAL_LNG,3,28);  17779383
                                                 /* EOC CEDS00000687 */ 17779487
 END;                                                 /* EOC RB01320 */ 17779583
                                                                        17780000
 END R046_BUILD_T0300;                                                  17790000
 /********************************************************************/ 17800000
 R046B_WRITE_T0300 : PROC;                                              17810000
 WRITE FILE (RCBBKA8) FROM (RCBBKA8_REC);                               17820000
                                                                        17830000
 COUNT.CNT_CTRY.RCBBKA8 = COUNT.CNT_CTRY.RCBBKA8 + 1;                   17840000
                                                                        17850000
 WRK_HASH_FIELD = SUBSTR (RCBBKA8_HW_REAL.SEQUENCE_NUMBER, 3, 4);       17860000
 CALL RCB018M (WRK_HASH_FIELD,                                          17870000
               COUNT.CNT_CTRY.RCBBKA8_HASH,                             17880000
               PTR_INT_AREA);                                           17890000
                                                                        17900000
 END R046B_WRITE_T0300;                                                 17910000
                                                     /* SOC RB01320 */  17910100
1/********************************************************************/ 17911000
 /*                                                                  */ 17912000
 /* MODULE NAME      : R051_BUILD_WRITE_T0125                        */ 17913000
 /*                                                                  */ 17915000
 /* DESCRIPTION      : BUILD AND WRITE A TABLE LIKE RCBT0125 RECORD  */ 17916000
 /*                                                                  */ 17917000
 /********************************************************************/ 17918000
 R051_BUILD_WRITE_T0125 : PROC;                                         17918100
                                                                        17918200
 RCBBKAD_DUMMY_REAL_SERIAL                  = '';                       17919000
 RCBBKAD_DUMMY_REAL_SERIAL.REC_TYPE         = '02';                     17919100
 RCBBKAD_DUMMY_REAL_SERIAL.CTRYNO           = RCBBKA0_C002.IOPUCTY;     17919200
 RCBBKAD_DUMMY_REAL_SERIAL.PGR_TYPE         = WRK_PGR_TYPE;             17919300
 RCBBKAD_DUMMY_REAL_SERIAL.RUN_DATE         = WRK_RUN_DATE;             17919400
                                                                        17919500
 RCBBKAD_DUMMY_REAL_SERIAL.COUNTRY_NUMBER   = RCBBKA0_C002.IOPUCTY;     17919600
 RCBBKAD_DUMMY_REAL_SERIAL.PRODUCT_TYPE     = RCBBKA0_C002.CSLMTYP;     17919700
 RCBBKAD_DUMMY_REAL_SERIAL.REAL_SERIAL_NUMBER                           17919800
                               = RCBBKA0_C002.SERIAL_LNG;               17919900
 RCBBKAD_DUMMY_REAL_SERIAL.DUMMY_ORIGIN                                 17920000
                               = SUBSTR (RCBBKA0_C002.IHSIMID,1,2);     17920100
 RCBBKAD_DUMMY_REAL_SERIAL.DUMMY_SEQUENCE_NUM                           17920200
                               = SUBSTR (RCBBKA0_C002.IHSIMID,3,7);     17920300
 RCBBKAD_DUMMY_REAL_SERIAL.LAST_CHANGE_DATE = WRK_RUN_DATE;             17920400
                                                                        17920500
 WRITE FILE (RCBBKAD) FROM (RCBBKAD_REC);                               17920600
                                                                        17920700
 COUNT.CNT_CTRY.RCBBKAD = COUNT.CNT_CTRY.RCBBKAD + 1;                   17920800
                                                                        17920900
 WRK_HASH_FIELD =                                                       17921000
            SUBSTR(RCBBKAD_DUMMY_REAL_SERIAL.DUMMY_SEQUENCE_NUM,3,4);   17921100
 CALL RCB018M (WRK_HASH_FIELD,                                          17921200
               COUNT.CNT_CTRY.RCBBKAD_HASH,                             17921300
               PTR_INT_AREA);                                           17921400
                                                                        17921500
 END R051_BUILD_WRITE_T0125;                                            17921600
                                                     /* EOC RB01320 */  17921700
1/********************************************************************/ 17930000
 /*                                                                  */ 17940000
 /* MODULE NAME      : R047_USER_EXIT                                */ 17950000
 /*                                                                  */ 17960000
 /* DESCRIPTION      : CALL A USER DEFINED EXIT WITH 'C002' RECORD   */ 17970000
 /*                    INFORMATION                                   */ 17980000
 /*                                                                  */ 17990000
 /********************************************************************/ 18000000
 R047_USER_EXIT : PROC;                                                 18010000
                                                                        18020000
 DCL 1 RCBBKA0_C002_COPY,                                               18030000
       %INCLUDE (RCBBKAS3);;                                            18040000
                                                                        18050000
 RCBBKA0_C002_COPY = RCBBKA0_C002 , BY NAME;                            18060000
                                                                        18070000
 CALL RCBBK1U (ADDR (SWITCH_USER_EXIT_1),                               18080000
               ADDR (RCBBKA0_C002_COPY),                                18090000
               PTR_INT_AREA);                                           18100000
                                                                        18100100
 IF SWITCH_USER_EXIT_1 THEN                      /* SOC CEDS00000488 */ 18101000
    DO;                                                                 18102000
      RCBBKA0_C002 =  RCBBKA0_C002_COPY, BY NAME;                       18103000
    END;                                         /* EOC CEDS00000488 */ 18104000
                                                                        18110000
 END R047_USER_EXIT;                                                    18120000
                                                                        18130000
1/********************************************************************/ 18140000
 /*                                                                  */ 18150000
 /* MODULE NAME      : R048_BUILD_WRITE_T0220                        */ 18160000
 /*                                                                  */ 18170000
 /* DESCRIPTION      :                                               */ 18180000
 /*                                                                  */ 18190000
 /*       IF THE FIRST CONTRACT FOR A MACHINE STARTS IN THE FUTURE   */ 18200000
 /*       AND THE MACHINE IS CURRENTLY INSTALLED THEN A DUMMY 220    */ 18210000
 /*       MUST BE ADDED FROM THE INSTALLATION TIME TILL THE SERVICE  */ 18220000
 /*       CONTRACT BECOMES EFFECTIVE.                                */ 18230000
 /*                                                                  */ 18240000
 /*     |------------------------------>   INSTALLATION              */ 18250000
 /*                  |----------------->   SERVICE CONTRACT (T0240)  */ 18260000
 /*                                                                  */ 18270000
 /*       DUMMY                                                      */ 18280000
 /*     |-----------|                      T0220 WITH TPMNT = '3'    */ 18290000
 /*                                        WILL BE ADDED.            */ 18300000
 /*                                                                  */ 18310000
 /********************************************************************/ 18320000
 R048_BUILD_WRITE_T0220: PROC;                                          18330000
                                                                        18340000
                                                                        18350000
 RCBBKA6_SUPPL_CTR                   = '';                              18360000
 RCBBKA6_SUPPL_CTR.REC_TYPE          = '02';                            18370000
 RCBBKA6_SUPPL_CTR.CTRYNO            = RCBBKA0_C002.IOPUCTY;            18380000
 RCBBKA6_SUPPL_CTR.PGR_TYPE          = WRK_PGR_TYPE;                    18390000
 RCBBKA6_SUPPL_CTR.RUN_DATE          = WRK_RUN_DATE;                    18400000
                                                                        18410000
 RCBBKA6_SUPPL_CTR.PRODUCT_TYPE      = RCBBKA0_C002.CSLMTYP;            18420000
 RCBBKA6_SUPPL_CTR.ORIGIN            = SUBSTR(RCBBKA0_C002.IHSIMID,1,2);18430000
 RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER   = SUBSTR(RCBBKA0_C002.IHSIMID,3,7);18440000
 RCBBKA6_SUPPL_CTR.COUNTRY_NUMBER    = RCBBKA0_C002.IOPUCTY;            18450000
 RCBBKA6_SUPPL_CTR.TYPE_OF_MAINT     = LOW(1);                          18460000
 RCBBKA6_SUPPL_CTR.SOURCE_INDICATOR  = ' ';               /* PTM 496 */ 18470000
 RCBBKA6_SUPPL_CTR.TYPE_OF_WARRANTY  = '';                              18480000
 RCBBKA6_SUPPL_CTR.INDNULL (06)      = -1;                              18490000
                                                      /* SOC RC01191 */ 18500000
 RCBBKA6_SUPPL_CTR.SERVICE_LVL_CODE = ' ';                              18510000
 RCBBKA6_SUPPL_CTR.INDNULL (07)     = 99;                               18520000
                                                      /* EOC RC01191 */ 18530000
 RCBBKA6_SUPPL_CTR.WARRANTY_EXP_DATE = '';                              18540000
 RCBBKA6_SUPPL_CTR.INDNULL (08)      = 99;                              18550000
 RCBBKA6_SUPPL_CTR.EFFECTIVE_DATE    = WRK_STRT_DATE;  /* PTM1362    */ 18560000
                                                                        18570000
 DATE_AREA                = '';                                         18580000
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      18590000
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      18600000
 DATE_AREA.WD_FUNCTION    = 'C';                                        18610000
 DATE_AREA.WD_PERIOD_TYPE = 'D';                                        18620000
 DATE_AREA.WD_PERIOD      = -1;                                         18630000
 DATE_AREA.WD_IN_DATE     = RCBBKA0_C002.DDBSEFF;                       18640000
                                                                        18650000
 CALL RCB004M (ADDR (DATE_AREA));                                       18660000
 IF DATE_AREA.WD_STATUS ¬= ' '                                          18670000
 THEN                                                                   18680000
   DO;                                                                  18690000
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            18700000
     PARM_INT_AREA.MESSAGE_NUMBER    = '0012';                          18710000
     PARM_INT_AREA.MSG_VAR_CODES     = ' ';                             18720000
     PARM_INT_AREA.MSG_VAR_CODE_6    = 'DT';                            18730000
     PARM_INT_AREA.MSG_VAR_VALUE_6   = RCBBKA0_C002.DDBSEFF;            18740000
     PARM_INT_AREA.MSG_VAR_CODE_7    = 'RC';                            18750000
     PARM_INT_AREA.MSG_VAR_VALUE_7   = DATE_AREA.WD_STATUS;             18760000
     CALL RCB0M1M (PTR_INT_AREA);                                       18770000
     CALL RCBBKAM_ERROR (NULL,'OTHER','#003');                          18780000
   END;                                                                 18790000
                                                                        18800000
 RCBBKA6_SUPPL_CTR.END_DATE =                                           18810000
                       SUBSTR (DATE_AREA.WD_OUT_DATE,1,10);             18820000
                                                                        18830000
                                                      /* SOC RB01281 */ 18840000
 RCBBKA6_SUPPL_CTR.F_TYPE_OF_WARRANTY  = '';                            18850000
 /* RCBBKA6_SUPPL_CTR.INDNULL (13)      = 99;        /* CEDS00000466 */ 18860000
 RCBBKA6_SUPPL_CTR.INDNULL (13)      = -1;           /* CEDS00000466 */ 18870000
 RCBBKA6_SUPPL_CTR.F_SPLT_DATE  = '';                                   18880000
 /* RCBBKA6_SUPPL_CTR.INDNULL (14)      = 99;        /* CEDS00000466 */ 18890000
 RCBBKA6_SUPPL_CTR.INDNULL (14)      = -1;           /* CEDS00000466 */ 18900000
                                                      /* EOC RB01281 */ 18910000
                                                      /* SOC RB01298 */ 18920000
 RCBBKA6_SUPPL_CTR.SERVICE_LVL_CODE_2  = '';                            18930000
 RCBBKA6_SUPPL_CTR.INDNULL (15)        = -1;                            18940000
                                                      /* SOC RB01320 */ 18940100
 IF (SWITCH_REAL_SERIAL) THEN DO;                                       18941000
 RCBBKA6_SUPPL_CTR.ORIGIN            = '';                              18942000
 RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER   = '';                              18943000
 RCBBKA6_SUPPL_CTR.ORIGIN            = SUBSTR(RCBBKA0_C002.             18944000
                                                      SERIAL_LNG,1,2);  18945000
                                                 /* SOC CEDS00000687 */ 18945187
 /* RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER   = SUBSTR(RCBBKA0_C002.          18946083
                                                    SERIAL_LNG,3,27);*/ 18947083
  RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER   = SUBSTR(RCBBKA0_C002.            18947186
                                                      SERIAL_LNG,3,28); 18947283
                                                 /* EOC CEDS00000687 */ 18948087
 END;                                                 /* EOC RB01320 */ 18949000
                                                                        18950069
 WRITE FILE (RCBBKA6) FROM (RCBBKA6_REC);                               18960000
 COUNT.CNT_CTRY.RCBBKA6 = COUNT.CNT_CTRY.RCBBKA6 + 1;                   18970000
                                                                        18980000
 WRK_HASH_FIELD =                                                       18990000
                SUBSTR (RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER,3,4);         19000000
 CALL RCB018M (WRK_HASH_FIELD,                                          19010000
               COUNT.CNT_CTRY.RCBBKA6_HASH,                             19020000
               PTR_INT_AREA);                                           19030000
                                                                        19040000
 END R048_BUILD_WRITE_T0220;                                            19050000
1/********************************************************************/ 19060000
 /*                                                                  */ 19070000
 /* MODULE NAME      : R049_CHECK_GAP                                */ 19080000
 /*                                                                  */ 19090000
 /* DESCRIPTION      : GENRATE A T220 FOR A GAP BETWEEN CONTRACTS    */ 19100000
 /*                    ADDED FOR PTM 1362                            */ 19110000
 /********************************************************************/ 19120000
 R049_CHECK_GAP : PROC;                                                 19130000
                                                                        19140000
 DATE_AREA                = '';                                         19150000
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      19160000
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      19170000
 DATE_AREA.WD_FUNCTION    = 'C';                                        19180000
 DATE_AREA.WD_PERIOD_TYPE = 'D';                                        19190000
 DATE_AREA.WD_PERIOD      = +1;                                         19200000
 DATE_AREA.WD_IN_DATE     = PREV_DDBSIAC;                               19210000
                                                                        19220000
 CALL RCB004M (ADDR (DATE_AREA));                                       19230000
 IF DATE_AREA.WD_STATUS ¬= ' '                                          19240000
 THEN                                                                   19250000
   DO;                                                                  19260000
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            19270000
     PARM_INT_AREA.MESSAGE_NUMBER    = '0012';                          19280000
     PARM_INT_AREA.MSG_VAR_CODES     = ' ';                             19290000
     PARM_INT_AREA.MSG_VAR_CODE_6    = 'DT';                            19300000
     PARM_INT_AREA.MSG_VAR_VALUE_6   = PREV_DDBSIAC;                    19310000
     PARM_INT_AREA.MSG_VAR_CODE_7    = 'RC';                            19320000
     PARM_INT_AREA.MSG_VAR_VALUE_7   = DATE_AREA.WD_STATUS;             19330000
     CALL RCB0M1M (PTR_INT_AREA);                                       19340000
     CALL RCBBKAM_ERROR (NULL,'OTHER','#003');                          19350000
   END;                                                                 19360000
                                                                        19370000
 WRK_STRT_DATE =       SUBSTR (DATE_AREA.WD_OUT_DATE,1,10);             19380000
                                                                        19390000
 IF WRK_STRT_DATE < RCBBKA0_C002.DDBSEFF                                19400000
 THEN DO;                                                               19410000
   CALL R048_BUILD_WRITE_T0220;                                         19420000
 END;                                                                   19430000
 END R049_CHECK_GAP;                                                    19440000
1/********************************************************************/ 19450000
 /*                                                                  */ 19460000
 /* MODULE NAME      : R050_INIT_TOS                                 */ 19470000
 /*                                                                  */ 19480000
 /* DESCRIPTION      : INITIAL ACTIONS FOR A TOS                     */ 19490000
 /*                                                                  */ 19500000
 /*      PTM 712     : TEST IF THE FIRST RECORD FOR THE TOS IS       */ 19510000
 /*                    OF TYPE C002.                                 */ 19520000
 /*                    IF NOT, ISSUE MESSAGE AND READ CHIS UNTIL     */ 19530000
 /*                    TYPE C002 IS REACHED.                         */ 19540000
 /*                                                                  */ 19550000
 /*                                                                  */ 19560000
 /********************************************************************/ 19570000
 R050_INIT_TOS : PROC;                                                  19580000
                                                                        19590000
            /* PTM 0712 START                                        */ 19600000
 IF RCBBKA0_C000.CDBSFRT ¬= 'C002'                                      19610000
 THEN                                                                   19620000
   DO;                                                                  19630000
                                              /* ISSUE ERROR MESSAGE */ 19640000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               19650000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             19660000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0022';                           19670000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             19680000
     PARM_INT_AREA.MSG_VAR_VALUE_6  =  WRK_RCBBKA0;                     19690000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';                             19700000
     PARM_INT_AREA.MSG_VAR_VALUE_7  =  RCBBKA0_C000.CDBSFRT;            19710000
     PARM_INT_AREA.MSG_VAR_CODE_8   = 'SK';                             19720000
     PARM_INT_AREA.MSG_VAR_VALUE_8  =  STRING(SK_NEW);                  19730000
     PARM_INT_AREA.SEQUENCE_KEY     =  STRING(SK_NEW);                  19740000
     CALL RCB0M1M (PTR_INT_AREA);                                       19750000
     PARM_INT_AREA.SEQUENCE_KEY     =  '';                              19760000
                                              /* READ NEXT RECORD    */ 19770000
     DO WHILE (RCBBKA0_C000.CDBSFRT ¬= 'C002');                         19780000
        CALL R030_READ_CHIS_REC;                                        19790000
     END;                                                               19800000
   END;                                                                 19810000
            /* PTM 0712 END                                          */ 19820000
 SWITCH_FIRST_C002 = TRUE;                                              19830000
 SK_OLD3           = SK_NEW3;                                           19840000
                                                                        19850000
 END R050_INIT_TOS;                                                     19860000
1/********************************************************************/ 19870000
 /*                                                                  */ 19880000
 /* MODULE NAME      : R059_END_TOS                                  */ 19890000
 /*                                                                  */ 19900000
 /* DESCRIPTION      : ENDING ACTIONS FOR A TOS                      */ 19910000
 /*                                                                  */ 19920000
 /* NOTE             : A DUMMY SUPPLY CTR (TABLE 0220) WILL BE       */ 19930000
 /*                    WRITTEN IF THE LAST WRITTEN SERV_CTR (TABLE   */ 19940000
 /*                    0240) HAS A NON BLANK (I.E. NOT OPEN ENDED)   */ 19950000
 /*                    ENDDATE. THE EFFECTIVE DATE OF THE DUMMY 220  */ 19960000
 /*                    IS THE ENDDATE OF THE LAST 240 PLUS 1 DAY.    */ 19970000
 /*                                                                  */ 19980000
 /*                        240                                       */ 19990000
 /*                    |----------|   DUMMY 220                      */ 20000000
 /*                                |----------------->               */ 20010000
 /*                                                                  */ 20020000
 /*                    A DUMMY 220 MEANS THAT IT'S TPMNT IS SET TO:  */ 20030000
 /*                    -  LOW  VALUE                                 */ 20040000
 /********************************************************************/ 20050000
 R059_END_TOS : PROC;                                                   20060000
                                                                        20070000
                                                                        20080000
 IF RCBBKA7_SERV_CTR.END_DATE ¬= '9999-12-31'      /* NOT OPEN ENDED */ 20090000
 THEN                                                                   20100000
  DO;                                                                   20110000
   RCBBKA6_SUPPL_CTR                   = '';                            20120000
   RCBBKA6_SUPPL_CTR.REC_TYPE          = '02';                          20130000
   RCBBKA6_SUPPL_CTR.CTRYNO            = RCBBKA7_SERV_CTR.CTRYNO;       20140000
   RCBBKA6_SUPPL_CTR.PGR_TYPE          = WRK_PGR_TYPE;                  20150000
   RCBBKA6_SUPPL_CTR.RUN_DATE          = WRK_RUN_DATE;                  20160000
                                                                        20170000
   RCBBKA6_SUPPL_CTR.PRODUCT_TYPE    = RCBBKA7_SERV_CTR.PRODUCT_TYPE;   20180000
   RCBBKA6_SUPPL_CTR.ORIGIN          = RCBBKA7_SERV_CTR.ORIGIN;         20190000
   RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER = RCBBKA7_SERV_CTR.SEQUENCE_NUMBER;20200000
   RCBBKA6_SUPPL_CTR.COUNTRY_NUMBER  = RCBBKA7_SERV_CTR.COUNTRY_NUMBER; 20210000
                                                                        20220000
   RCBBKA6_SUPPL_CTR.TYPE_OF_MAINT      = LOW (1);                      20230000
   RCBBKA6_SUPPL_CTR.SOURCE_INDICATOR  = ' ';             /* PTM 496 */ 20240000
   RCBBKA6_SUPPL_CTR.TYPE_OF_WARRANTY  = '';                            20250000
   RCBBKA6_SUPPL_CTR.INDNULL (06)      = -1;                            20260000
                                                      /* SOC RC01191 */ 20270000
   RCBBKA6_SUPPL_CTR.SERVICE_LVL_CODE = ' ';                            20280000
   RCBBKA6_SUPPL_CTR.INDNULL (07)     = 99;                             20290000
                                                      /* EOC RC01191 */ 20300000
   RCBBKA6_SUPPL_CTR.WARRANTY_EXP_DATE = '';                            20310000
   RCBBKA6_SUPPL_CTR.INDNULL (08)      = 99;                            20320000
                                                                        20330000
   DATE_AREA                = '';      /* ADD ONE DAY */                20340000
   DATE_AREA.WD_IN_FORMAT   = 'ISO';                                    20350000
   DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                    20360000
   DATE_AREA.WD_FUNCTION    = 'C';                                      20370000
   DATE_AREA.WD_PERIOD_TYPE = 'D';                                      20380000
   DATE_AREA.WD_PERIOD      = +1;                                       20390000
   DATE_AREA.WD_IN_DATE     = RCBBKA7_SERV_CTR.END_DATE;                20400000
                                                                        20410000
   CALL RCB004M (ADDR (DATE_AREA));                                     20420000
   IF DATE_AREA.WD_STATUS ¬= ' '                                        20430000
   THEN                                                                 20440000
     DO;                                                                20450000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          20460000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0012';                        20470000
       PARM_INT_AREA.MSG_VAR_CODES     = ' ';                           20480000
       PARM_INT_AREA.MSG_VAR_CODE_6    = 'DT';                          20490000
       PARM_INT_AREA.MSG_VAR_VALUE_6   = RCBBKA7_SERV_CTR.END_DATE;     20500000
       PARM_INT_AREA.MSG_VAR_CODE_7    = 'RC';                          20510000
       PARM_INT_AREA.MSG_VAR_VALUE_7   = DATE_AREA.WD_STATUS;           20520000
       PARM_INT_AREA.SEQUENCE_KEY      = STRING(SK_NEW);                20530000
       CALL RCB0M1M (PTR_INT_AREA);                                     20540000
       CALL RCBBKAM_ERROR(NULL,'OTHER','#004');                         20550000
     END;                                                               20560000
                                                                        20570000
   RCBBKA6_SUPPL_CTR.EFFECTIVE_DATE =                                   20580000
                               SUBSTR (DATE_AREA.WD_OUT_DATE, 1, 10);   20590000
   RCBBKA6_SUPPL_CTR.END_DATE       = '9999-12-31';                     20600000
                                                      /* SOC RB01281 */ 20610000
   RCBBKA6_SUPPL_CTR.F_TYPE_OF_WARRANTY  = '';                          20620000
   /* RCBBKA6_SUPPL_CTR.INDNULL (13)      = 99;      /* CEDS00000466 */ 20630000
   RCBBKA6_SUPPL_CTR.INDNULL (13)      = -1;         /* CEDS00000466 */ 20640000
   RCBBKA6_SUPPL_CTR.F_SPLT_DATE  = '';                                 20650000
   /* RCBBKA6_SUPPL_CTR.INDNULL (14)      = 99;      /* CEDS00000466 */ 20660000
   RCBBKA6_SUPPL_CTR.INDNULL (14)      = -1;         /* CEDS00000466 */ 20670000
                                                      /* EOC RB01281 */ 20680000
                                                      /* SOC RB01298 */ 20690000
   RCBBKA6_SUPPL_CTR.SERVICE_LVL_CODE_2  = '';                          20700000
   RCBBKA6_SUPPL_CTR.INDNULL (15)        = -1;                          20710000
                                                      /* EOC RB01298 */ 20720000
                                                                        20730000
   WRITE FILE (RCBBKA6) FROM (RCBBKA6_REC);                             20740000
                                                                        20750000
   COUNT.CNT_CTRY.RCBBKA6 = COUNT.CNT_CTRY.RCBBKA6 + 1;                 20760000
                                                                        20770000
   WRK_HASH_FIELD = SUBSTR (RCBBKA6_SUPPL_CTR.SEQUENCE_NUMBER, 3, 4);   20780000
   CALL RCB018M (WRK_HASH_FIELD,                                        20790000
                 COUNT.CNT_CTRY.RCBBKA6_HASH,                           20800000
                 PTR_INT_AREA);                                         20810000
 END;                                                                   20820000
                                                                        20830000
 END R059_END_TOS;                                                      20840000
1/********************************************************************/ 20850000
 /*                                                                  */ 20860000
 /* MODULE NAME      : R060_INIT_TYPE                                */ 20870000
 /*                                                                  */ 20880000
 /* DESCRIPTION      : INITIAL ACTIONS FOR A TYPE                    */ 20890000
 /*                                                                  */ 20900000
 /********************************************************************/ 20910000
 R060_INIT_TYPE : PROC;                                                 20920000
                                                                        20930000
 SK_OLD3                    = SK_NEW3;                                  20940000
                                                                        20950000
                                                     /* RB01140 START */20960000
 TB_RCBV070                 = '';  /* CHECK MACHINE TYPE IS REQUESTED */20970000
 TB_RCBV070_I               = '';                                       20980000
 TB_RCBV070.COUNTRY_NUMBER  = RCBBKA0_C002.IOPUCTY;                     20990000
 TB_RCBV070.PRODUCT_TYPE    = RCBBKA0_C002.CSLMTYP;                     21000000
 TB_RCBV070.MODEL_NUMBER    = '';                                       21010000
 TB_RCBV070.EFFECTIVE_DATE  = WRK_RUN_DATE;                             21020000
                                                                        21030000
 SWITCH_TYPE_REQUESTED = TRUE;                                          21040000
                                                                        21050000
 CALL RCBIAGM (PTR_RCBV070,                                             21060000
               PTR_RCBV070I,                                            21070000
               PTR_RETURN_AREA,                                         21080000
               PTR_INT_AREA);                                           21090000
                                                                        21100000
 SELECT (RETURN_AREA.RETURN_CODE);                                      21110000
 WHEN (0)                                                               21120000
   DO;                                                                  21130000
     IF TB_RCBV070.HW_REQUEST_CEDS = '0'                                21140000
     THEN                                                               21150000
       DO;                                                              21160000
                                                     /* RB01140 END   */21170000
         SWITCH_TYPE_REQUESTED = FALSE;                                 21180000
       END;                                                             21190000
   END;                                                                 21200000
 WHEN (4);                                                              21210000
 OTHERWISE                                                              21220000
   CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),                   21230000
                       'DB2','#005');                                   21240000
 END;                                                                   21250000
 END R060_INIT_TYPE;                                                    21260000
                                                                        21270000
1/********************************************************************/ 21280000
 /*                                                                  */ 21290000
 /* MODULE NAME      : R070_INIT_PROCESS_CTRY                        */ 21300000
 /*                                                                  */ 21310000
 /* DESCRIPTION      : INITIAL ACTION FOR A COUNTRY IF TO BE         */ 21320000
 /*                    PROCESSED.                                    */ 21330000
 /*                                                                  */ 21340000
 /********************************************************************/ 21350000
 R070_INIT_PROCESS_CTRY: PROC;                                          21360000
                                                                        21370000
 SWITCH_CTRY_PROCESSED   = TRUE;                                        21380000
 SK_OLD3                 = SK_NEW3;                                     21390000
                                                                        21400000
 IF RCBBKA0_C001.CDBSFRT ¬= 'C001'  /* WRONG RECORD TYPE */             21410000
 THEN                                                                   21420000
   DO;                                                                  21430000
     PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKA0_C001.IOPUCTY;             21440000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               21450000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             21460000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';                           21470000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             21480000
     PARM_INT_AREA.MSG_VAR_VALUE_6  =  WRK_RCBBKA0;                     21490000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';                             21500000
     PARM_INT_AREA.MSG_VAR_VALUE_7  =  RCBBKA0_C001.CDBSFRT;            21510000
     CALL RCB0M1M (PTR_INT_AREA);                                       21520000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#006');                        21530000
   END;                                                                 21540000
                                                /* RETRIEVE RUN DATE */ 21550000
 RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                       21560000
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 21570000
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               21580000
                                                                        21590000
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       21600000
               PTR_INT_AREA);                                           21610000
                                                                        21620000
 IF RUN_DATE_AREA.RUN_DATE = ''   /* NO RUN DATE RCB001 FOUND */        21630000
 THEN                                                                   21640000
   DO;                                                                  21650000
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          21660000
   END;                                                                 21670000
 ELSE                                                                   21680000
   DO;                                                                  21690000
     WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                             21700000
   END;                                                                 21710000
                                                                        21720000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           21730000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 21740000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               21750000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   21760000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 21770000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         21780000
 CALL RCB0M1M (PTR_INT_AREA);                                           21790000
                                                                        21800000
 TB_RCBV500                  = '';    /* RETRIEVE FEATURE STORE IND */  21810000
 TB_RCBV500_I                = '';                                      21820000
 TB_RCB008.NUMBER            = 'RCB008';                                21830000
 TB_RCB008.CTRYNO            =  WRK_CTRYNO;                             21840000
0CALL RCBI50M ('U',                                       /* RC01219 */ 21850000
               PTR_RCBV500,                                             21860000
               PTR_RCBV500I,                                            21870000
               PTR_RETURN_AREA,                                         21880000
               PTR_INT_AREA);                                           21890000
                                                                        21900000
 SELECT (RETURN_AREA.RETURN_CODE);                                      21910000
 WHEN (0)                                                               21920000
   RCB008 = TB_RCB008 , BY NAME;                                        21930000
 WHEN (4)                                                               21940000
   DO;                                                                  21950000
     RCB008.FEATURE_STORE_IND       = '1';                              21960000
     PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                       21970000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             21980000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0001';                           21990000
     PARM_INT_AREA.MSG_VAR_CODES    = ' ';                              22000000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'PN';                             22010000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCB008';                         22020000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'PK';                             22030000
     PARM_INT_AREA.MSG_VAR_VALUE_7  = TB_RCBV500.PARAMETER_KEY;         22040000
     CALL RCB0M1M (PTR_INT_AREA);                                       22050000
   END;                                                                 22060000
 OTHERWISE                                                              22070000
   CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),                   22080000
                       'DB2','#007');                                   22090000
 END;                                                                   22100000
 TB_RCBV500                  = '';    /* RETRIEVE INVALID FEATURES  */  22110000
 TB_RCBV500_I                = '';                                      22120000
 TB_RCB009.NUMBER            = 'RCB009';                                22130000
 TB_RCB009.CTRYNO            =  WRK_CTRYNO;                             22140000
0CALL RCBI50M ('U',                                       /* RC01219 */ 22150000
               PTR_RCBV500,                                             22160000
               PTR_RCBV500I,                                            22170000
               PTR_RETURN_AREA,                                         22180000
               PTR_INT_AREA);                                           22190000
                                                                        22200000
 SELECT (RETURN_AREA.RETURN_CODE);                                      22210000
 WHEN (0)                                                               22220000
   DO;                                                                  22230000
     SWITCH_RCB009_EXISTS = TRUE;                                       22240000
     RCB009               = TB_RCB009 , BY NAME;                        22250000
   END;                                                                 22260000
 WHEN (4)                                                               22270000
   DO;                                                                  22280000
     SWITCH_RCB009_EXISTS           = FALSE;                            22290000
     PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                       22300000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             22310000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0001';                           22320000
     PARM_INT_AREA.MSG_VAR_CODES    = ' ';                              22330000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'PN';                             22340000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCB009';                         22350000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'PK';                             22360000
     PARM_INT_AREA.MSG_VAR_VALUE_7  = TB_RCBV500.PARAMETER_KEY;         22370000
     CALL RCB0M1M (PTR_INT_AREA);                                       22380000
   END;                                                                 22390000
 OTHERWISE                                                              22400000
   CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),                   22410000
                       'DB2','#008');                                   22420000
 END;                                                                   22430000
                                                                        22440000
 CALL R030_READ_CHIS_REC;       /* READ C002 RECORD   */                22450000
                                                                        22450173
                                                 /* SOC CEDS00000635 */ 22451070
 IF RCBBKA0_C000.CDBSFRT ='C998' THEN           /* CHECK RECORD TYPE */ 22452072
       SWITCH_CTRY_PROCESSED   = FALSE;                                 22453072
                                                 /* EOC CEDS00000635 */ 22457070
 END R070_INIT_PROCESS_CTRY;                                            22470000
                                                                        22480000
1/********************************************************************/ 22490000
 /*                                                                  */ 22500000
 /* MODULE NAME      : R071_SAVE_HASH                                */ 22510000
 /*                                                                  */ 22520000
 /* DESCRIPTION      : SAVE HASH TOTALS IN PARAMETER RCB024          */ 22530000
 /*                                                                  */ 22540000
 /*                    IF A COUNTRY WAS IN THE RCB000 PARAMETER BUT  */ 22550000
 /*                    NOT IN THE CHIS FILE, IT WAS NOT PROCESSED.   */ 22560000
 /*                    ONLY IN THAT CASE HASH TOTALS MAY BE WRITTEN  */ 22570000
 /*                    FOR FILE RCBBKA1 (CONTRACTS) AND RCBBKAA      */ 22580000
 /*                    (CUSTOMER-CONTRACTS). (IN FACT THEY WILL BE   */ 22590000
 /*                    ZERO)                                         */ 22600000
 /*                                                                  */ 22610000
 /*                    IF A COUNTRY HAS BEEN PROCESSED, THE HASH     */ 22620000
 /*                    TOTAL WILL BE WRITTEN FOR RCBBKA1 DURING THE  */ 22630000
 /*                    SORT (R092) IN WHICH DUPLICATES WILL BE       */ 22640000
 /*                    SORTED OUT.                                   */ 22650000
 /*                    IF A COUNTRY HAS BEEN PROCESSED, THE HASH     */ 22660000
 /*                    TOTAL WILL BE WRITTEN FOR RCBBKAA DURING THE  */ 22670000
 /*                    SORT (R093) IN WHICH DUPLICATES WILL BE       */ 22680000
 /*                    SORTED OUT.                                   */ 22690000
 /*                                                                  */ 22700000
 /********************************************************************/ 22710000
 R071_SAVE_HASH: PROC;                                                  22720000
                                                                        22730000
 IF ¬SWITCH_CTRY_PROCESSED                                              22740000
 THEN                                                                   22750000
   DO;                                                                  22760000
     CALL RX01_SAVE_HASH (WRK_CTRYNO,                                   22770000
                          COUNT.CNT_CTRY.RCBBKA1_HASH,                  22780000
                          WRK_RCBBKA1,                                  22790000
                          'RCBBGB1');                                   22800000
 /* --------------- RA01120 AMENDMENT ------------------------------ */ 22810000
     CALL RX01_SAVE_HASH (WRK_CTRYNO,                                   22820000
                          COUNT.CNT_CTRY.RCBBKAA_HASH,                  22830000
                          WRK_RCBBKAA,                                  22840000
                          'RCBBGBA');                                   22850000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 22860000
   END;                                                                 22870000
                                                                        22880000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       22890000
                      COUNT.CNT_CTRY.RCBBKA2_HASH,                      22900000
                      WRK_RCBBKA2,                                      22910000
                      'RCBBCA0');                                       22920000
                                                                        22930000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       22940000
                      COUNT.CNT_CTRY.RCBBKA3_HASH,                      22950000
                      WRK_RCBBKA3,                                      22960000
                      'RCBBCA2');                                       22970000
                                                                        22980000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       22990000
                      COUNT.CNT_CTRY.RCBBKA4_HASH,                      23000000
                      WRK_RCBBKA4,                                      23010000
                      'RCBBCA3');                                       23020000
                                                                        23030000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       23040000
                      COUNT.CNT_CTRY.RCBBKA5_HASH,                      23050000
                      WRK_RCBBKA5,                                      23060000
                      'RCBBCA4');                                       23070000
                                                                        23080000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       23090000
                      COUNT.CNT_CTRY.RCBBKA6_HASH,                      23100000
                      WRK_RCBBKA6,                                      23110000
                      'RCBBCA5');                                       23120000
                                                                        23130000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       23140000
                      COUNT.CNT_CTRY.RCBBKA7_HASH,                      23150000
                      WRK_RCBBKA7,                                      23160000
                      'RCBBGB7');                                       23170000
                                                                        23180000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       23190000
                      COUNT.CNT_CTRY.RCBBKA8_HASH,                      23200000
                      WRK_RCBBKA8,                                      23210000
                      'RCBBCA8');                                       23220000
                                                                        23230000
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                                       23240000
                      COUNT.CNT_CTRY.RCBBKA9_HASH,                      23250000
                      WRK_RCBBKA9,                                      23260000
                      'RCBBCA9');                                       23270000
                                                                        23270100
 CALL RX01_SAVE_HASH (WRK_CTRYNO,                     /* SOC RB01320*/  23271000
                      COUNT.CNT_CTRY.RCBBKAD_HASH,                      23272000
                      WRK_RCBBKAD,                                      23273000
                      'RCBBCAD');                     /* EOC RB01320*/  23274000
                                                                        23280000
 END R071_SAVE_HASH;                                                    23290000
1/********************************************************************/ 23300000
 /*                                                                  */ 23310000
 /* MODULE NAME      : R072_READ_NEXT_RCB000                         */ 23320000
 /*                                                                  */ 23330000
 /* DESCRIPTION      : READ (NEXT) ENTRY FROM THE COUNTRY ARRAY      */ 23340000
 /*                                                                  */ 23350000
 /********************************************************************/ 23360000
 R072_READ_NEXT_RCB000: PROC;                                           23370000
                                                                        23380000
 WRK_CTRY_IDX = WRK_CTRY_IDX + 1;                                       23390000
                                                                        23400000
 IF WRK_CTRY_IDX <= COUNTRY_AREA.COUNT_CTRY                             23410000
 THEN                                                                   23420000
   DO;                                                                  23430000
     WRK_PGR_TYPE    = CTRY_ARRAY.PGR_TYPE (WRK_CTRY_IDX);              23440000
     SK_ARRAY.CTRYNO = CTRY_ARRAY.CTRYNO (WRK_CTRY_IDX);                23450000
   END;                                                                 23460000
 ELSE                                                                   23470000
   DO;                                                                  23480000
     WRK_PGR_TYPE  = '';                                                23490000
     SK_ARRAY.EOF  = '1';                                               23500000
   END;                                                                 23510000
                                                                        23520000
 END R072_READ_NEXT_RCB000;                                             23530000
1/********************************************************************/ 23540000
 /*                                                                  */ 23550000
 /* MODULE NAME      : R079_END_PROCESS_CTRY                         */ 23560000
 /*                                                                  */ 23570000
 /* DESCRIPTION      : DO ENDING ACTIONS FOR A COUNTRY ON FILE LEVEL */ 23580000
 /*                    IE. RECORD AND HASH TOTALS MUST BE CHECKED    */ 23590000
 /*                                                                  */ 23600000
 /********************************************************************/ 23610000
 R079_END_PROCESS_CTRY: PROC;                                           23620000
                                                                        23630000
 IF RCBBKA0_C998.CDBSFRT ¬= 'C998'  /* WRONG RECORD TYPE */             23640000
 THEN                                                                   23650000
   DO;                                                                  23660000
     PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKA0_C998.IOPUCTY;             23670000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               23680000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             23690000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';                           23700000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             23710000
     PARM_INT_AREA.MSG_VAR_VALUE_6  =  WRK_RCBBKA0;                     23720000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';                             23730000
     PARM_INT_AREA.MSG_VAR_VALUE_7  =  RCBBKA0_C998.CDBSFRT;            23740000
     CALL RCB0M1M (PTR_INT_AREA);                                       23750000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#009');                        23760000
   END;                                                                 23770000
                                                                        23780000
 COUNT.CNT_TOT.RCBBKA0_HASH = COUNT.CNT_TOT.RCBBKA0_HASH +              23790000
                              COUNT.CNT_CTRY.RCBBKA0_HASH;              23800000
 COUNT.CNT_TOT.RCBBKA0 = COUNT.CNT_TOT.RCBBKA0 + COUNT.CNT_CTRY.RCBBKA0;23810000
 COUNT.CNT_TOT.RCBBKA1 = COUNT.CNT_TOT.RCBBKA1 + COUNT.CNT_CTRY.RCBBKA1;23820000
 COUNT.CNT_TOT.RCBBKA2 = COUNT.CNT_TOT.RCBBKA2 + COUNT.CNT_CTRY.RCBBKA2;23830000
 COUNT.CNT_TOT.RCBBKA3 = COUNT.CNT_TOT.RCBBKA3 + COUNT.CNT_CTRY.RCBBKA3;23840000
 COUNT.CNT_TOT.RCBBKA4 = COUNT.CNT_TOT.RCBBKA4 + COUNT.CNT_CTRY.RCBBKA4;23850000
 COUNT.CNT_TOT.RCBBKA5 = COUNT.CNT_TOT.RCBBKA5 + COUNT.CNT_CTRY.RCBBKA5;23860000
 COUNT.CNT_TOT.RCBBKA6 = COUNT.CNT_TOT.RCBBKA6 + COUNT.CNT_CTRY.RCBBKA6;23870000
 COUNT.CNT_TOT.RCBBKA7 = COUNT.CNT_TOT.RCBBKA7 + COUNT.CNT_CTRY.RCBBKA7;23880000
 COUNT.CNT_TOT.RCBBKA8 = COUNT.CNT_TOT.RCBBKA8 + COUNT.CNT_CTRY.RCBBKA8;23890000
 COUNT.CNT_TOT.RCBBKA9 = COUNT.CNT_TOT.RCBBKA9 + COUNT.CNT_CTRY.RCBBKA9;23900000
                                                    /* SOC RB01320   */ 23900100
 COUNT.CNT_TOT.RCBBKAD = COUNT.CNT_TOT.RCBBKAD + COUNT.CNT_CTRY.RCBBKAD;23901000
                                                    /* EOC RB01320   */ 23902000
 /*---------------- RA01120 AMENDMENT ------------------------------ */ 23910000
 COUNT.CNT_TOT.RCBBKAA = COUNT.CNT_TOT.RCBBKAA + COUNT.CNT_CTRY.RCBBKAA;23920000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 23930000
                                                                        23940000
 WRK_QCINRBA_C = RCBBKA0_C998.QCINRBA;                                  23950000
                                                                        23960000
 IF WRK_QCINRBA_P ¬= COUNT.CNT_CTRY.RCBBKA0                             23970000
 THEN                                                                   23980000
   DO;                                                                  23990000
     PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKA0_C998.IOPUCTY;             24000000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             24010000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0007';                           24020000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               24030000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             24040000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA0;                      24050000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';                             24060000
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBKA0_C998.QCINRBA;             24070000
     PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';                             24080000
     CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA0;           24090000
     PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC9;                         24100000
     CALL RCB0M1M (PTR_INT_AREA);                                       24110000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#010');                        24120000
   END;                                                                 24130000
                                                                        24140000
 IF (SWITCH_HASH_TOTAL ¬= '1') THEN DO;                    /* RB01312 */24141000
 IF RCBBKA0_C998.QDBSHST ¬= COUNT.CNT_CTRY.RCBBKA0_HASH                 24150000
 THEN                                                                   24160000
   DO;                                                                  24170000
     PARM_INT_AREA.COUNTRY_NUMBER  = RCBBKA0_C998.IOPUCTY;              24180000
     PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                              24190000
     PARM_INT_AREA.MESSAGE_NUMBER  = '0175';                            24200000
     PARM_INT_AREA.MSG_VAR_CODES   = '';                                24210000
     PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                              24220000
     PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_RCBBKA0;                       24230000
     PARM_INT_AREA.MSG_VAR_CODE_7  = 'HT';                              24240000
     CNT_PIC15                     = COUNT.CNT_CTRY.RCBBKA0_HASH;       24250000
     PARM_INT_AREA.MSG_VAR_VALUE_7 = CNT_PIC15;                         24260000
     PARM_INT_AREA.MSG_VAR_CODE_8  = 'HT';                              24270000
     CNT_PIC15                     = RCBBKA0_C998.QDBSHST;              24280000
     PARM_INT_AREA.MSG_VAR_VALUE_8 = CNT_PIC15;                         24290000
     CALL RCB0M1M (PTR_INT_AREA);                                       24300000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#011');                        24310000
   END;                                                                 24320000
 END;                                                      /* RB01312 */24321000
                                                                        24330000
 CALL RX03_ISSUE_CTRY_CNT;                                              24340000
                                                                        24350000
 COUNT.CNT_CTRY = 0;            /* RESET COUNTRY COUNT */               24360000
                                                                        24370000
 CALL R030_READ_CHIS_REC;       /* READ NEXT RECORD   */                24380000
                                                                        24390000
 END R079_END_PROCESS_CTRY;                                             24400000
1/********************************************************************/ 24410000
 /*                                                                  */ 24420000
 /* MODULE NAME      : R080_INIT_COUNTRY                             */ 24430000
 /*                                                                  */ 24440000
 /* DESCRIPTION      : INITIAL ACTIONS FOR A COUNTRY                 */ 24450000
 /*                                                                  */ 24460000
 /********************************************************************/ 24470000
 R080_INIT_COUNTRY : PROC;                                              24480000
                                                                        24490000
 SWITCH_CTRY_PROCESSED = FALSE;                                         24500000
                                                                        24510000
 IF SK_ARRAY1 < SK_NEW1                                                 24520000
 THEN                                                                   24530000
   DO;                                                                  24540000
     WRK_CTRYNO = SK_ARRAY.CTRYNO;                                      24550000
   END;                                                                 24560000
 ELSE                                                                   24570000
   DO;                                                                  24580000
     WRK_CTRYNO = SK_NEW.CTRYNO;                                        24590000
   END;                                                                 24600000
                                                                        24610000
 /* COMMENT OUT THE BELOW CODE AS PART OF A12 */ /* SOC RB01301      */ 24620000
                                                 /* SOC CEDS00000381 */ 24630000
 /* RETRIEVE COUNTRY NUMBERS FROM RCB140 */                             24640000
 /*SWITCH_NO_ETS_PROCESS = FALSE;                                       24650000
 /*WRK_COUNT              = 1;                                          24660000
 /*TB_RCBV500             = '';                                         24670000
 /*TB_RCBV500_I           = '';                                         24680000
 /*TB_RCB140.NUMBER       = 'RCB140';                                   24690000
 /*CALL RCBI50M ('R',                                /* PASS PARAMETER*/24700000
 /*              PTR_RCBV500,                                           24710000
 /*              PTR_RCBV500I,                                          24720000
 /*              PTR_RETURN_AREA,                                       24730000
 /*              PTR_INT_AREA);                                         24740000
 /*SELECT(RETURN_AREA.RETURN_CODE);                                     24750000
 /*  WHEN(0)                                                            24760000
 /*    DO;                                                              24770000
 /*      RCB140  =  TB_RCB140;                                          24780000
 /*      IF RCB140.NO_ETS_PROCESS_CTRY ¬= '' THEN                       24790000
 /*        DO;                                                          24800000
 /*          K = 1;                                                     24810000
 /*          DO WRK_COUNT = 1 TO 30 BY 1;                               24820000
                                                                        24830000
 /*           IF SUBSTR(RCB140.NO_ETS_PROCESS_CTRY,K,3) = WRK_CTRYNO    24840000
 /*           THEN DO;                                                  24850000
 /*                  SWITCH_NO_ETS_PROCESS = TRUE;                      24860000
 /*                  WRK_COUNT = 30;                                    24870000
 /*                END;                                                 24880000
 /*           K= K + 3;                                                 24890000
 /*          END;                                                       24900000
 /*        END;                                                         24910000
 /*      ELSE                                                           24920000
 /*       SWITCH_NO_ETS_PROCESS = FALSE;                                24930000
 /*    END;                                                             24940000
 /*  WHEN(4)                                                            24950000
 /*    DO;                                                              24960000
 /*       SWITCH_NO_ETS_PROCESS = FALSE;                                24970000
 /*    END;                                                             24980000
 /*  OTHERWISE                                                          24990000
 /*    DO;                                                              25000000
 /*      CALL RCBBKAM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),'DB2','#032'); 25010000
 /*    END;                                                             25020000
 /*END;                                                                 25030000
                                                  /* EOC CEDS00000381 */25040000
                                                  /* EOC RB01301      */25050000
 END R080_INIT_COUNTRY;                                                 25060000
                                                                        25070000
1/********************************************************************/ 25080000
 /*                                                                  */ 25090000
 /* MODULE NAME      : R090_INIT_PROG                                */ 25100000
 /*                                                                  */ 25110000
 /* DESCRIPTION      : INITIAL ACTIONS FOR THE PROGRAM               */ 25120000
 /*                                                                  */ 25130000
 /********************************************************************/ 25140000
 R090_INIT_PROG : PROC;                                                 25150000
                                                                        25160000
 PTR_RCBBKA0        =  ADDR (RCBBKA0_REC);                              25170000
 PTR_INT_AREA       =  ADDR (PARM_INT_AREA);                            25180000
 PTR_RETURN_AREA    =  ADDR (RETURN_AREA);                              25190000
 PTR_COUNTRY_AREA   =  ADDR (COUNTRY_AREA);                             25200000
 PTR_RUN_DATE_AREA  =  ADDR (RUN_DATE_AREA);                            25210000
                                                   /* RCB01140 START */ 25220000
 PTR_RCBV070        =  ADDR (TB_RCBV070);                               25230000
 PTR_RCBV070I       =  ADDR (TB_RCBV070_I);                             25240000
                                                   /* RCB01140 END   */ 25250000
 PTR_RCBV500        =  ADDR (TB_RCBV500);                               25260000
 PTR_RCBV500I       =  ADDR (TB_RCBV500_I);                             25270000
                                                                        25280000
 PARM_INT_AREA.ID_MOD_LEVEL    = 1;                                     25290000
 PARM_INT_AREA.ID_MOD_PATH (1) = WRK_MOD_NAME;                          25300000
 PARM_INT_AREA.MSG_AREA        = '';                                    25310000
 PARM_INT_AREA.ERR_AREA        = '';                                    25320000
 PARM_INT_AREA.MSG_REQUEST     = 'O';                                   25330000
 PARM_INT_AREA.MSG_TARGET      = 'F';                                   25340000
 PARM_INT_AREA.ID_SOURCE_APPL  = 'RCB';                                 25350000
 PARM_INT_AREA.ID_SOURCE_PROG  = WRK_PGM_NAME;                          25360000
 PARM_INT_AREA.SYSTEM_TYPE     = WRK_SYSTEM_TYPE;                       25370000
 PARM_INT_AREA.PTR_PCB_IO      = NULL;                                  25380000
 PARM_INT_AREA.PTR_PCB_ALT     = NULL;                                  25390000
 CALL RCB0M1M (PTR_INT_AREA);                                           25400000
                                                                        25410000
 CALL RCB0T1M (PTR_INT_AREA);            /* RETRIEVE SYSTEM DATE   */   25420000
                                                                        25430000
 CALL RCB019M (PTR_COUNTRY_AREA,         /* RETRIEVE ALL COUNTRIES */   25440000
               PTR_INT_AREA);                                           25450000
                                                                        25460000
 IF COUNTRY_AREA.COUNT_CTRY = 0                                         25470000
 THEN                                                                   25480000
   DO;                                                                  25490000
     PARM_INT_AREA.COUNTRY_NUMBER    = '';                              25500000
     PARM_INT_AREA.MSG_VAR_CODES     = '';                              25510000
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            25520000
     PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                          25530000
     CALL RCB0M1M (PTR_INT_AREA);                                       25540000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#012');                        25550000
   END;                                                                 25560000
                                                                        25570000
                                    /* SOC RA01207                   */ 25580000
 IF COUNTRY_AREA.PROC_ID = 'UC01'                                       25590000
 THEN                                                                   25600000
   WRK_CHIS_LOCAL = 'C';                                                25610000
 ELSE                                                                   25620000
   WRK_CHIS_LOCAL = 'L';                                                25630000
                                    /* EOC RA01207                   */ 25640000
 SK_NEW             = '';                                               25650000
 SK_NEW.EOF         = '0';                                              25660000
 SK_OLD             = '';                                               25670000
 SK_ARRAY.EOF       = '0';                                              25680000
 COUNT              = 0;                                                25690000
 WRK_CTRY_IDX       = 0;                                                25700000
 WRK_FEAT_DIM       = DIM (RCB009.FEATURE_TABLE.FEATURE_RPQ_CODE,1);    25710000
 WRK_DATETIME       = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();       25720000
 WRK_LENGTH_RCB024  = CSTG (RCB024.TIME_STAMP) +                        25730000
                      CSTG (RCB024.HASH_TOTAL);                         25740000
 TEMP_C002_C003     = '';                                /* RB01320 */  25741000
                                                                        25750000
 OPEN FILE (RCBBKZ0);                                                   25760000
 OPEN FILE (RCBBXB2);                                                   25770000
 /* --------------- RA01120 CHANGE --------------------------------- */ 25780000
 OPEN FILE (RCBBKAB);                                                   25790000
 /* ----------- END RA01120 CHANGE --------------------------------- */ 25800000
 OPEN FILE (RCBBKA2);                                                   25810000
 OPEN FILE (RCBBKA3);                                                   25820000
 OPEN FILE (RCBBKA4);                                                   25830000
 OPEN FILE (RCBBKA5);                                                   25840000
 OPEN FILE (RCBBKA6);                                                   25850000
 OPEN FILE (RCBBKA7);                                                   25860000
 OPEN FILE (RCBBKA8);                                                   25870000
 OPEN FILE (RCBBKA9);                                                   25880000
 /* --------------- RA01120 AMENDMENT ------------------------------ */ 25890000
 OPEN FILE (RCBBKAA);                                                   25900000
 OPEN FILE (RCBBKAC);                                                   25910000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 25920000
                                                                        25930000
 CALL R030_READ_CHIS_REC;  /* READ FIRST RECORD */                      25940000
                                                                        25950000
 IF SK_NEW.EOF = '1'       /* EMPTY FILE */                             25960000
 THEN                                                                   25970000
   DO;                                                                  25980000
     PARM_INT_AREA.COUNTRY_NUMBER   = '';                               25990000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               26000000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             26010000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';                           26020000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             26030000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBKA0';                        26040000
     CALL RCB0M1M (PTR_INT_AREA);                                       26050000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#013');                        26060000
   END;                                                                 26070000
                                                                        26080000
 IF RCBBKA0_C000.CDBSFRT ¬= 'C000'  /* WRONG RECORD TYPE */             26090000
 THEN                                                                   26100000
   DO;                                                                  26110000
     PARM_INT_AREA.COUNTRY_NUMBER   = '';                               26120000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               26130000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             26140000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';                           26150000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             26160000
     PARM_INT_AREA.MSG_VAR_VALUE_6  =  WRK_RCBBKA0;                     26170000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';                             26180000
     PARM_INT_AREA.MSG_VAR_VALUE_7  =  RCBBKA0_C000.CDBSFRT;            26190000
     CALL RCB0M1M (PTR_INT_AREA);                                       26200000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#014');                        26210000
   END;                                                                 26220000
                                    /* SOC RA01207                   */ 26230000
 IF (COUNTRY_AREA.PROC_ID = 'UC01' &                                    26240000
     RCBBKA0_C000.TDBSFIL = 'CHIS CONTRACT DATA') |                     26250000
    (COUNTRY_AREA.PROC_ID = 'UL01' &                                    26260000
 /*  RCBBKA0_C000.TDBSFIL = 'LOCAL CONTRACT DATA')        SOC RB01312 */26270000
    ((RCBBKA0_C000.TDBSFIL = 'LOCAL CONTRACT DATA') |                   26271000
       (RCBBKA0_C000.TDBSFIL = 'CM-803 CONTRACT') |                     26272000
       (RCBBKA0_C000.TDBSFIL = 'CM-803 contract')))    /* EOC RB01312 */26273000
 THEN                                                                   26280000
   DO;                                                                  26290000
     IF((RCBBKA0_C000.TDBSFIL = 'CM-803 CONTRACT') |   /* SOC RB01312 */26291000
        (RCBBKA0_C000.TDBSFIL = 'CM-803 contract')) THEN                26292000
         SWITCH_HASH_TOTAL = '1';                      /* EOC RB01312 */26293000
   END;                                                                 26300000
 ELSE                                                                   26310000
   DO;                                                                  26320000
     PARM_INT_AREA.COUNTRY_NUMBER   = '';                               26330000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               26340000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             26350000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';                           26360000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             26370000
     PARM_INT_AREA.MSG_VAR_VALUE_6  =  WRK_RCBBKA0;                     26380000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';                             26390000
     PARM_INT_AREA.MSG_VAR_VALUE_7  =  RCBBKA0_C000.TDBSFIL;            26400000
     CALL RCB0M1M (PTR_INT_AREA);                                       26410000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#015');                        26420000
   END;                                                                 26430000
                                    /* EOC RA01207                   */ 26440000
                                                                        26450000
 /* RETRIEVE PREVIOUS FILE SEQUENCE NUMBER FROM RCB035 */               26460000
                                                                        26470000
 TB_RCBV500                  = '';                                      26480000
 TB_RCBV500_I                = '';                                      26490000
 TB_RCB035.NUMBER            = 'RCB035';                                26500000
                                                       /* SOC PTM1053 */26510000
 TB_RCB035.PROC_ID           = COUNTRY_AREA.PROC_ID;                    26520000
 TB_RCB035.SEQ_NR            = '01';                                    26530000
 TB_RCB035.FILLER_G1         = COUNTRY_AREA.CTRYNO(1); /*     PTM1264 */26540000
                                                       /* EOC PTM1053 */26550000
                                                                        26560000
0CALL RCBI50M ('R',                                       /* RC01219 */ 26570000
               PTR_RCBV500,                                             26580000
               PTR_RCBV500I,                                            26590000
               PTR_RETURN_AREA,                                         26600000
               PTR_INT_AREA);                                           26610000
                                                                        26620000
                                                       /* SOC PTM1264 */26630000
 IF RETURN_AREA.RETURN_CODE = 4                                         26640000
 THEN                                   /* RETRIEVE THE OLD SEQUENCE  */26650000
   DO;                                  /* NUMBER FOR COUNTRY = BLANK */26660000
     TB_RCB035.FILLER_G1 = '';          /* IF NOT FOUND ERROR IS      */26670000
0CALL RCBI50M ('R',                                       /* RC01219 */ 26680000
                   PTR_RCBV500,         /* HANDLED IN NEXT STATEMENT  */26690000
                   PTR_RCBV500I,                                        26700000
                   PTR_RETURN_AREA,                                     26710000
                   PTR_INT_AREA);                                       26720000
     IF RETURN_AREA.RETURN_CODE = 0     /* INSERT THE SEQUENCE NUMBER */26730000
     THEN                               /* FOR FIRST RUN COUNTRY      */26740000
       DO;                                                              26750000
         TB_RCB035.FILLER_G1 = COUNTRY_AREA.CTRYNO(1);                  26760000
         CALL RCBF50M (PTR_RCBV500,                                     26770000
                       PTR_RCBV500I,                                    26780000
                       PTR_RETURN_AREA,                                 26790000
                       PTR_INT_AREA);                                   26800000
       END;                                                             26810000
   END;                                                                 26820000
                                                       /* EOC PTM1264 */26830000
 SELECT (RETURN_AREA.RETURN_CODE);                                      26840000
   WHEN (0)                                                             26850000
     DO;                                                                26860000
       RCB035 = TB_RCB035 , BY NAME;                                    26870000
       IF RCB035.FILE_SEQ_NUM_SC + 1 > RCBBKA0_C000.IDBSSN0             26880000
       THEN                                                             26890000
         DO;                                                            26900000
           PARM_INT_AREA.COUNTRY_NUMBER   = '';                         26910000
           PARM_INT_AREA.MSG_VAR_CODES    = '';                         26920000
           PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                       26930000
           PARM_INT_AREA.MESSAGE_NUMBER   = '0180';                     26940000
           PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                       26950000
           PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA0;                26960000
           PARM_INT_AREA.MSG_VAR_CODE_7   = 'SQ';                       26970000
           WRK_FILE_SEQ                   = RCBBKA0_C000.IDBSSN0;       26980000
           PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_FILE_SEQ;               26990000
           PARM_INT_AREA.MSG_VAR_CODE_8   = 'SQ';                       27000000
           WRK_FILE_SEQ                   = RCB035.FILE_SEQ_NUM_SC + 1; 27010000
           PARM_INT_AREA.MSG_VAR_VALUE_8  = WRK_FILE_SEQ;               27020000
           CALL RCB0M1M (PTR_INT_AREA);                                 27030000
                                                                        27040000
           CALL RCBBKAM_ERROR (NULL, 'OTHER', '#016');                  27050000
         END;                                                           27060000
       ELSE WRK_FILE_SEQ = RCBBKA0_C000.IDBSSN0;                        27070000
     END;                                                               27080000
   WHEN (4)                                                             27090000
     DO;                                                                27100000
       PARM_INT_AREA.COUNTRY_NUMBER   = '';                             27110000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           27120000
       PARM_INT_AREA.MESSAGE_NUMBER   = 'I050';                         27130000
       PARM_INT_AREA.MSG_VAR_CODES    = ' ';                            27140000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'PN';                           27150000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCB035';                       27160000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'PK';                           27170000
       PARM_INT_AREA.MSG_VAR_VALUE_7  =                                 27180000
                                   TB_RCBV500.PARAMETER_KEY;            27190000
       CALL RCB0M1M (PTR_INT_AREA);                                     27200000
       CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),               27210000
                           'DB2','#017');                               27220000
     END;                                                               27230000
   OTHERWISE                                                            27240000
     DO;                                                                27250000
       CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),               27260000
                           'DB2','#018');                               27270000
     END;                                                               27280000
 END;  /* SELECT */                                                     27290000
                                                                        27300000
                                                                        27310000
                                    /* READ HEADER FROM THE WORKFILE */ 27320000
 READ FILE (RCBBXB2) INTO (RCBBXB2_REC);                                27330000
 IF EOF_RCBBXB2                                                         27340000
 THEN DO;                                                               27350000
        PARM_INT_AREA.MSG_VAR_CODES      = '';                          27360000
        PARM_INT_AREA.MESSAGE_TYPE       = 'IS';                        27370000
        PARM_INT_AREA.MESSAGE_NUMBER     = '0013';                      27380000
        PARM_INT_AREA.MSG_VAR_CODE_6     = 'FL';                        27390000
        PARM_INT_AREA.MSG_VAR_VALUE_6    = 'RCBBXB2';                   27400000
        CALL RCB0M1M (PTR_INT_AREA);                                    27410000
                                        /* ABEND  */                    27420000
        CALL RCBBKAM_ERROR (NULL(),                                     27430000
                            'OTHER',                                    27440000
                            '#019');                                    27450000
 END;                                                                   27460000
 IF RCBBXB2_HEADER.FILE_ID ¬= 'RCBBXB2' |                               27470000
                                        /* SOC RA01207               */ 27480000
        (RCBBXB2_HEADER.SOURCE_INDICATOR ¬= 'C' &                       27490000
         COUNTRY_AREA.PROC_ID = 'UC01') |                               27500000
        (RCBBXB2_HEADER.SOURCE_INDICATOR ¬= 'L' &                       27510000
         COUNTRY_AREA.PROC_ID = 'UL01')                                 27520000
                                        /* EOC RA01207               */ 27530000
 THEN DO;                                                               27540000
        PARM_INT_AREA.MSG_VAR_CODES      = '';                          27550000
        PARM_INT_AREA.MESSAGE_TYPE       = 'IS';                        27560000
        PARM_INT_AREA.MESSAGE_NUMBER     = '0014';                      27570000
        PARM_INT_AREA.MSG_VAR_CODE_6     = 'FL';                        27580000
        PARM_INT_AREA.MSG_VAR_VALUE_6    = 'RCBBXB2';                   27590000
        CALL RCB0M1M (PTR_INT_AREA);                                    27600000
                                        /* ABEND */                     27610000
        CALL RCBBKAM_ERROR (NULL(),                                     27620000
                            'OTHER',                                    27630000
                            '#020');                                    27640000
 END;                                                                   27650000
                                                                        27660000
 /* READ FIRST DATA RECORD                 */                           27670000
 IF ¬EOF_RCBBXB2                                                        27680000
 THEN DO;                                                               27690000
        READ FILE(RCBBXB2) INTO(RCBBXB2_REC);                           27700000
        IF  RCBBXB2_DATA.REC_TYPE = '99'                                27710000
        THEN                                                            27720000
          RCBBXB2_DATA.RCBBXB2_KEY = (16)'9';                           27730000
 END;                                                                   27740000
                                                                        27750000
 /* WRITE A HEADER TO THE FILES. NOTE THAT FOR HW RELATED FILES       */27760000
 /* AN 'SOF' FILE_ID WILL BE WRITTEN BECAUSE THE COMPARE PROGRAMS     */27770000
 /* WILL DO A CHECK ON THIS ID. FOR CONTRACT RELATED FILES AN 'EMACS' */27780000
 /* FILE_ID WILL BE WRITTEN.                                          */27790000
                                                                        27800000
 RCBBKA1_REC                     = '';                                  27810000
 RCBBKA1_HEADER.REC_TYPE         = '01';                                27820000
 RCBBKA1_HEADER.FILE_ID          = 'RCBBGB1';                           27830000
 RCBBKA1_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 27840000
 RCBBKA1_HEADER.TIMESTAMP        = WRK_DATETIME;                        27850000
                                                                        27860000
 WRITE FILE (RCBBKAB) FROM (RCBBKA1_REC);       /* RA01120 DDNAME   */  27870000
                                                                        27880000
 RCBBKA2_REC                     = '';                                  27890000
 RCBBKA2_HEADER.REC_TYPE         = '01';                                27900000
 RCBBKA2_HEADER.FILE_ID          = 'RCBBCA0';                           27910000
 RCBBKA2_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 27920000
 RCBBKA2_HEADER.TIMESTAMP        = WRK_DATETIME;                        27930000
                                                                        27940000
 WRITE FILE (RCBBKA2) FROM (RCBBKA2_REC);                               27950000
                                                                        27960000
 RCBBKA3_REC                     = '';                                  27970000
 RCBBKA3_HEADER.REC_TYPE         = '01';                                27980000
 RCBBKA3_HEADER.FILE_ID          = 'RCBBCA2';                           27990000
 RCBBKA3_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28000000
 RCBBKA3_HEADER.TIMESTAMP        = WRK_DATETIME;                        28010000
                                                                        28020000
 WRITE FILE (RCBBKA3) FROM (RCBBKA3_REC);                               28030000
                                                                        28040000
 RCBBKA4_REC                     = '';                                  28050000
 RCBBKA4_HEADER.REC_TYPE         = '01';                                28060000
 RCBBKA4_HEADER.FILE_ID          = 'RCBBCA3';                           28070000
 RCBBKA4_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28080000
 RCBBKA4_HEADER.TIMESTAMP        = WRK_DATETIME;                        28090000
                                                                        28100000
 WRITE FILE (RCBBKA4) FROM (RCBBKA4_REC);                               28110000
                                                                        28120000
 RCBBKA5_REC                     = '';                                  28130000
 RCBBKA5_HEADER.REC_TYPE         = '01';                                28140000
 RCBBKA5_HEADER.FILE_ID          = 'RCBBCA4';                           28150000
 RCBBKA5_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28160000
 RCBBKA5_HEADER.TIMESTAMP        = WRK_DATETIME;                        28170000
                                                                        28180000
 WRITE FILE (RCBBKA5) FROM (RCBBKA5_REC);                               28190000
                                                                        28200000
 RCBBKA6_REC                     = '';                                  28210000
 RCBBKA6_HEADER.REC_TYPE         = '01';                                28220000
 RCBBKA6_HEADER.FILE_ID          = 'RCBBCA5';                           28230000
 RCBBKA6_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28240000
 RCBBKA6_HEADER.TIMESTAMP        = WRK_DATETIME;                        28250000
                                                                        28260000
 WRITE FILE (RCBBKA6) FROM (RCBBKA6_REC);                               28270000
                                                                        28280000
 RCBBKA7_REC                     = '';                                  28290000
 RCBBKA7_HEADER.REC_TYPE         = '01';                                28300000
 RCBBKA7_HEADER.FILE_ID          = 'RCBBGB7';                           28310000
 RCBBKA7_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28320000
 RCBBKA7_HEADER.TIMESTAMP        = WRK_DATETIME;                        28330000
                                                                        28340000
 WRITE FILE (RCBBKA7) FROM (RCBBKA7_REC);                               28350000
                                                                        28360000
 RCBBKA8_REC                     = '';                                  28370000
 RCBBKA8_HEADER.REC_TYPE         = '01';                                28380000
 RCBBKA8_HEADER.FILE_ID          = 'RCBBCA8';                           28390000
 RCBBKA8_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28400000
 RCBBKA8_HEADER.TIMESTAMP        = WRK_DATETIME;                        28410000
                                                                        28420000
 WRITE FILE (RCBBKA8) FROM (RCBBKA8_REC);                               28430000
                                                                        28440000
 RCBBKA9_REC                     = '';                                  28450000
 RCBBKA9_HEADER.REC_TYPE         = '01';                                28460000
 RCBBKA9_HEADER.FILE_ID          = 'RCBBCA9';                           28470000
 RCBBKA9_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28480000
 RCBBKA9_HEADER.TIMESTAMP        = WRK_DATETIME;                        28490000
                                                                        28500000
 WRITE FILE (RCBBKA9) FROM (RCBBKA9_REC);                               28510000
                                                      /* SOC RB01320  */28510100
 RCBBKAD_REC                     = '';                                  28511000
 RCBBKAD_HEADER.REC_TYPE         = '01';                                28512000
 RCBBKAD_HEADER.FILE_ID          = 'RCBBCAD';                           28513000
 RCBBKAD_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;                      28514000
 RCBBKAD_HEADER.TIMESTAMP        = WRK_DATETIME;                        28515000
                                                                        28516000
 WRITE FILE (RCBBKAD) FROM (RCBBKAD_REC);             /* EOC RB01320  */28517000
                                                                        28520000
 /* --------------- RA01120 AMENDMENT ------------------------------ */ 28530000
 RCBBKAA_REC                     = '';                                  28540000
 RCBBKAA_HEADER.REC_TYPE         = '01';                                28550000
 RCBBKAA_HEADER.FILE_ID          = 'RCBBGBA';                           28560000
 RCBBKAA_HEADER.SOURCE_INDICATOR = WRK_CHIS_LOCAL;        /* RA01207 */ 28570000
 RCBBKAA_HEADER.TIMESTAMP        = WRK_DATETIME;                        28580000
                                                                        28590000
 WRITE FILE (RCBBKAC) FROM (RCBBKAA_REC);                               28600000
                                                                        28610000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 28620000
 CALL R030_READ_CHIS_REC;     /* READ NEXT CHIS RECORD   */             28630000
                                                                        28640000
 CALL R072_READ_NEXT_RCB000;  /* READ NEXT RCB000 CTRYNO */             28650000
                                                                        28660000
 END R090_INIT_PROG;                                                    28670000
                                                                        28680000
1/*********************************************************************/28690000
 /*                                                                   */28700000
 /* MODULE NAME      :  R091_END_FILES                                */28710000
 /*                                                                   */28720000
 /* DESCRIPTION      :  WRITE A TRAILER RECORD TO ALL OUTPUT FILES    */28730000
 /*                     AND CLOSE THEM.                               */28740000
 /*                                                                   */28750000
 /*********************************************************************/28760000
 R091_END_FILES: PROC;                                                  28770000
                                     /* WRITE A TRAILER TO ALL FILES */ 28780000
 RCBBKA1_REC              = '';                                         28790000
 RCBBKA1_TRAILER.REC_TYPE = '99';                                       28800000
 RCBBKA1_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA1;                      28810000
                                                                        28820000
 WRITE FILE (RCBBKAB) FROM (RCBBKA1_REC);        /* RA01120 DDNAME  */  28830000
                                                                        28840000
 RCBBKA2_REC              = '';                                         28850000
 RCBBKA2_TRAILER.REC_TYPE = '99';                                       28860000
 RCBBKA2_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA2;                      28870000
                                                                        28880000
 WRITE FILE (RCBBKA2) FROM (RCBBKA2_REC);                               28890000
                                                                        28900000
 RCBBKA3_REC              = '';                                         28910000
 RCBBKA3_TRAILER.REC_TYPE = '99';                                       28920000
 RCBBKA3_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA3;                      28930000
                                                                        28940000
 WRITE FILE (RCBBKA3) FROM (RCBBKA3_REC);                               28950000
                                                                        28960000
 RCBBKA4_REC              = '';                                         28970000
 RCBBKA4_TRAILER.REC_TYPE = '99';                                       28980000
 RCBBKA4_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA4;                      28990000
                                                                        29000000
 WRITE FILE (RCBBKA4) FROM (RCBBKA4_REC);                               29010000
                                                                        29020000
 RCBBKA5_REC              = '';                                         29030000
 RCBBKA5_TRAILER.REC_TYPE = '99';                                       29040000
 RCBBKA5_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA5;                      29050000
                                                                        29060000
 WRITE FILE (RCBBKA5) FROM (RCBBKA5_REC);                               29070000
                                                                        29080000
 RCBBKA6_REC              = '';                                         29090000
 RCBBKA6_TRAILER.REC_TYPE = '99';                                       29100000
 RCBBKA6_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA6;                      29110000
                                                                        29120000
 WRITE FILE (RCBBKA6) FROM (RCBBKA6_REC);                               29130000
                                                                        29140000
 RCBBKA7_REC              = '';                                         29150000
 RCBBKA7_TRAILER.REC_TYPE = '99';                                       29160000
 RCBBKA7_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA7;                      29170000
                                                                        29180000
 WRITE FILE (RCBBKA7) FROM (RCBBKA7_REC);                               29190000
                                                                        29200000
 RCBBKA8_REC              = '';                                         29210000
 RCBBKA8_TRAILER.REC_TYPE = '99';                                       29220000
 RCBBKA8_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA8;                      29230000
                                                                        29240000
 WRITE FILE (RCBBKA8) FROM (RCBBKA8_REC);                               29250000
                                                                        29260000
 RCBBKA9_REC              = '';                                         29270000
 RCBBKA9_TRAILER.REC_TYPE = '99';                                       29280000
 RCBBKA9_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA9;                      29290000
                                                                        29300000
 WRITE FILE (RCBBKA9) FROM (RCBBKA9_REC);                               29310000
                                                     /* SOC RB01320 */  29310100
 RCBBKAD_REC              = '';                                         29311000
 RCBBKAD_TRAILER.REC_TYPE = '99';                                       29312000
 RCBBKAD_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKAD;                      29313000
                                                                        29314000
 WRITE FILE (RCBBKAD) FROM (RCBBKAD_REC);            /* EOC RB01320 */  29315000
                                                                        29320000
 /* --------------- RA01120 AMENDMENT ------------------------------ */ 29330000
 RCBBKAA_REC              = '';                                         29340000
 RCBBKAA_TRAILER.REC_TYPE = '99';                                       29350000
 RCBBKAA_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKAA;                      29360000
                                                                        29370000
 WRITE FILE (RCBBKAC) FROM (RCBBKAA_REC);                               29380000
                                                                        29390000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 29400000
 WRK_QDBSCDR_C = RCBBKA0_C999.QDBSCDR;                                  29410000
                                                                        29420000
 IF WRK_QDBSCDR_P ¬= COUNT.CNT_TOT.RCBBKA0  /* CHECK RECORD COUNTS */   29430000
 THEN                                                                   29440000
   DO;                                                                  29450000
     PARM_INT_AREA.COUNTRY_NUMBER   = ' ';                              29460000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             29470000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0007';                           29480000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               29490000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             29500000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA0;                      29510000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';                             29520000
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBKA0_C999.QDBSCDR;             29530000
     PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';                             29540000
     CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA0;            29550000
     PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC9;                         29560000
     CALL RCB0M1M (PTR_INT_AREA);                                       29570000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#021');                        29580000
   END;                                                                 29590000
                                                                        29600000
 IF (SWITCH_HASH_TOTAL ¬= '1') THEN DO;                    /* RB01312 */29601000
 IF RCBBKA0_C999.QDBSHST ¬= COUNT.CNT_TOT.RCBBKA0_HASH  /* CHECK HASH */29610000
 THEN                                                                   29620000
   DO;                                                                  29630000
     PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                              29640000
     PARM_INT_AREA.MESSAGE_NUMBER  = '0175';                            29650000
     PARM_INT_AREA.MSG_VAR_CODES   = '';                                29660000
     PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                              29670000
     PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_RCBBKA0;                       29680000
     PARM_INT_AREA.MSG_VAR_CODE_7  = 'HT';                              29690000
     CNT_PIC15                     = COUNT.CNT_TOT.RCBBKA0_HASH;        29700000
     PARM_INT_AREA.MSG_VAR_VALUE_7 = CNT_PIC15;                         29710000
     PARM_INT_AREA.MSG_VAR_CODE_8  = 'HT';                              29720000
     CNT_PIC15                     = RCBBKA0_C999.QDBSHST;              29730000
     PARM_INT_AREA.MSG_VAR_VALUE_8 = CNT_PIC15;                         29740000
     CALL RCB0M1M (PTR_INT_AREA);                                       29750000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#022');                        29760000
   END;                                                                 29770000
 END;                                                      /* RB01312 */29771000
                                                                        29780000
 CLOSE FILE (RCBBKZ0);                                                  29790000
 CLOSE FILE (RCBBXB2);                                                  29800000
 /* --------------- RA01120 CHANGE --------------------------------- */ 29810000
 CLOSE FILE (RCBBKAB);                                                  29820000
 /* ----------- END RA01120 CHANGE --------------------------------- */ 29830000
 CLOSE FILE (RCBBKA2);                                                  29840000
 CLOSE FILE (RCBBKA3);                                                  29850000
 CLOSE FILE (RCBBKA4);                                                  29860000
 CLOSE FILE (RCBBKA5);                                                  29870000
 CLOSE FILE (RCBBKA6);                                                  29880000
 CLOSE FILE (RCBBKA7);                                                  29890000
 CLOSE FILE (RCBBKA8);                                                  29900000
 CLOSE FILE (RCBBKA9);                                                  29910000
 /* --------------- RA01120 AMENDMENT ------------------------------ */ 29920000
 CLOSE FILE (RCBBKAA);                                                  29930000
 CLOSE FILE (RCBBKAC);                                                  29940000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 29950000
                                                                        29960000
 END R091_END_FILES;                                                    29970000
                                                                        29980000
1/*********************************************************************/29990000
 /*                                                                   */30000000
 /* MODULE NAME      :  R092_SORT_RCBBKA1                             */30010000
 /*                                                                   */30020000
 /* DESCRIPTION      :  DISCARD DUPLICATES FROM RCBBKAB, SORT IT AND  */30030000
 /*                     RECALCULATE HASHTOTALS AND RECORD COUNTS.     */30040000
 /*                     SORT OUT FILE WILL BE RCBBKA1.                */30050000
 /*                                                                   */30060000
 /*********************************************************************/30070000
 R092_SORT_RCBBKA1: PROC;                                               30080000
                                                                        30090000
 COUNT.CNT_TOT.RCBBKA1       = 0;                                       30100000
 COUNT.CNT_CTRY.RCBBKA1      = 0;                                       30110000
 COUNT.CNT_CTRY.RCBBKA1_HASH = 0;                                       30120000
                                                                        30130000
 UNSPEC (MAX_STORAGE) = '00000000'B || UNSPEC('MAX');                   30140000
                                                                        30150000
 OPEN FILE (RCBBKA1);                                                   30160000
                                                                        30170000
                                            /* SORT TO ROUTINE       */ 30180000
                                            /*  2 - RECORD TYPE      */ 30190000
                                            /*  3 - COUNTRY NUMBER   */ 30200000
                                            /*  3 - PROGRAM RUN TYPE */ 30210000
                                            /* 10 - RUN DATE         */ 30220000
                                            /*  3 - COUNTRY NUMBER   */ 30230000
                                            /* 15 - CONTRACT NUMBER  */ 30240000
 CALL PLISRTC                                                           30250000
            (' SORT FIELDS=(1,36,CH,A),DYNALLOC ',                      30260000
               ' RECORD TYPE=F,LENGTH=(67) ',                           30270000
               MAX_STORAGE,                                             30280000
               RETURN_CODE,                                             30290000
               R092_SORT_EXIT,                                          30300000
               'CTRS');                                                 30310000
                                                                        30320000
                                         /* EVALUATE SORT            */ 30330000
 CALL PLIRETC (RETURN_CODE);                                            30340000
                                                                        30350000
 SELECT (RETURN_CODE);                                                  30360000
 WHEN ('');                                                             30370000
 OTHERWISE                                                              30380000
   DO;                                                                  30390000
     PARM_INT_AREA.COUNTRY_NUMBER             = '';                     30400000
     PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                   30410000
     PARM_INT_AREA.MESSAGE_NUMBER             = '0011';                 30420000
     PARM_INT_AREA.MSG_VAR_CODES              = ' ';                    30430000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'RC';                   30440000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =  RETURN_CODE;           30450000
     CALL RCB0M1M (PTR_INT_AREA);                                       30460000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#023');                        30470000
   END;                                                                 30480000
 END;                                                                   30490000
                                                                        30500000
 CLOSE FILE (RCBBKA1);                                                  30510000
                                                                        30520000
 END R092_SORT_RCBBKA1;                                                 30530000
1/*********************************************************************/30540000
 /*                                                                   */30550000
 /* MODULE NAME      :  R092_SORT_EXIT                                */30560000
 /*                                                                   */30570000
 /* DESCRIPTION      :  HASH TOTALLING OF SORTED RECORDS RCBBKA1      */30580000
 /*                     INCLUDING DELETING DUPLICATES                 */30590000
 /*                                                                   */30600000
 /*********************************************************************/30610000
 R092_SORT_EXIT: PROC (IN_FILE);                                        30620000
                                                                        30630000
 DCL 1 IN_FILE           CHAR (67);                                     30640000
 DCL 1 OLD_FILE          CHAR (67);                                     30650000
                                                                        30660000
 DCL 1 RCBBKA1_IN        BASED (ADDR (IN_FILE)),                        30670000
       %INCLUDE (RCBBAAS1);,                                            30680000
       3 TB_RCBV030,                                                    30690000
         %INCLUDE (RCB030S);,                                           30700000
       3 TB_RCBV030_I,                                                  30710000
         %INCLUDE (RCB030SI);;                                          30720000
                                                                        30730000
 DCL 1 RCBBKA1_TRAILER   BASED (ADDR (IN_FILE)),                        30740000
       %INCLUDE (RCBBAAST);;                                            30750000
                                                                        30760000
 DCL 1 RCBBKA1_OLD       BASED (ADDR (OLD_FILE)),                       30770000
       %INCLUDE (RCBBAAS1);,                                            30780000
       3 TB_RCBV030,                                                    30790000
         %INCLUDE (RCB030S);,                                           30800000
       3 TB_RCBV030_I,                                                  30810000
         %INCLUDE (RCB030SI);;                                          30820000
                                                                        30830000
 SELECT (RCBBKA1_IN.REC_TYPE);                                          30840000
                                                                        30850000
   WHEN ('01')                                                          30860000
     DO;                                                                30870000
       WRITE FILE (RCBBKA1) FROM (IN_FILE);                             30880000
       OLD_FILE = IN_FILE;                                              30890000
     END;                                                               30900000
                                                                        30910000
   WHEN ('02')                                                          30920000
     DO;                                                                30930000
       IF RCBBKA1_IN.CTRYNO ¬= RCBBKA1_OLD.CTRYNO &                     30940000
          RCBBKA1_OLD.REC_TYPE = '02'          /* NEW COUNTRY ? */      30950000
       THEN                                                             30960000
         DO;                                                            30970000
           PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKA1_OLD.CTRYNO;         30980000
           CALL RX01_SAVE_HASH (RCBBKA1_OLD.CTRYNO,                     30990000
                                COUNT.CNT_CTRY.RCBBKA1_HASH,            31000000
                                WRK_RCBBKA1,                            31010000
                               'RCBBGB1');                              31020000
           PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                       31030000
           PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                     31040000
           PARM_INT_AREA.MSG_VAR_CODES    = '';                         31050000
           PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                       31060000
           PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                       31070000
           CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA1;     31080000
           PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA1;                31090000
           PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                   31100000
           CALL RCB0M1M (PTR_INT_AREA);                                 31110000
           COUNT.CNT_TOT.RCBBKA1       = COUNT.CNT_TOT.RCBBKA1 +        31120000
                                         COUNT.CNT_CTRY.RCBBKA1;        31130000
           COUNT.CNT_CTRY.RCBBKA1      = 0;                             31140000
           COUNT.CNT_CTRY.RCBBKA1_HASH = 0;                             31150000
         END;                                                           31160000
       IF SUBSTR (IN_FILE,1,36) ¬= SUBSTR (OLD_FILE,1,36)               31170000
       THEN                                                             31180000
         DO;                                                            31190000
           OLD_FILE               = IN_FILE;                            31200000
           COUNT.CNT_CTRY.RCBBKA1 = COUNT.CNT_CTRY.RCBBKA1 + 1;         31210000
                                                          /* PTM1058 */ 31220000
           CALL RCB018M (SUBSTR (RCBBKA1_IN.CONTRACT_NUMBER, 1, 4),     31230000
                         COUNT.CNT_CTRY.RCBBKA1_HASH,                   31240000
                         PTR_INT_AREA);                                 31250000
           WRITE FILE (RCBBKA1) FROM (IN_FILE);                         31260000
         END;                                                           31270000
     END;                                                               31280000
                                                                        31290000
   WHEN ('99')                                                          31300000
     DO;           /* SAVE HASH AND ISSUE MESSAGES FOR THE LAST CTRY */ 31310000
                                                                        31320000
       PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKA1_OLD.CTRYNO;             31330000
       CALL RX01_SAVE_HASH (RCBBKA1_OLD.CTRYNO,                         31340000
                            COUNT.CNT_CTRY.RCBBKA1_HASH,                31350000
                            WRK_RCBBKA1,                                31360000
                            'RCBBGB1');                                 31370000
                                                                        31380000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           31390000
       PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                         31400000
       PARM_INT_AREA.MSG_VAR_CODES    = '';                             31410000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                           31420000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                           31430000
       CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA1;         31440000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA1;                    31450000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                       31460000
       CALL RCB0M1M (PTR_INT_AREA);                                     31470000
       COUNT.CNT_TOT.RCBBKA1          = COUNT.CNT_TOT.RCBBKA1 +         31480000
                                        COUNT.CNT_CTRY.RCBBKA1;         31490000
                                                                        31500000
       RCBBKA1_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKA1;                31510000
       WRITE FILE (RCBBKA1) FROM (IN_FILE);                             31520000
     END;                                                               31530000
                                                                        31540000
   OTHERWISE;                                                           31550000
                                                                        31560000
 END;  /* SELECT */                                                     31570000
                                                                        31580000
 CALL PLIRETC(4);                                                       31590000
                                                                        31600000
 END R092_SORT_EXIT;                                                    31610000
                                                                        31620000
1/* --------------- RA01120 AMENDMENT ------------------------------ */ 31630000
 /*********************************************************************/31640000
 /*                                                                   */31650000
 /* MODULE NAME      :  R093_SORT_RCBBKAA                             */31660000
 /*                                                                   */31670000
 /* DESCRIPTION      :  DISCARD DUPLICATES FROM RCBBKAC, SORT IT AND  */31680000
 /*                     RECALCULATE HASHTOTALS AND RECORD COUNTS.     */31690000
 /*                     SORT OUT FILE WILL BE RCBBKAA.                */31700000
 /*                                                                   */31710000
 /*********************************************************************/31720000
 R093_SORT_RCBBKAA: PROC;                                               31730000
                                                                        31740000
 COUNT.CNT_TOT.RCBBKAA       = 0;                                       31750000
 COUNT.CNT_CTRY.RCBBKAA      = 0;                                       31760000
 COUNT.CNT_CTRY.RCBBKAA_HASH = 0;                                       31770000
                                                                        31780000
 UNSPEC (MAX_STORAGE) = '00000000'B || UNSPEC('MAX');                   31790000
                                                                        31800000
 OPEN FILE (RCBBKAA);                                                   31810000
                                                                        31820000
                                            /* SORT TO ROUTINE       */ 31830000
                                            /*  2 - RECORD TYPE      */ 31840000
                                            /*  3 - COUNTRY NUMBER   */ 31850000
                                            /*  3 - PROGRAM RUN TYPE */ 31860000
                                            /* 10 - RUN DATE         */ 31870000
                                            /*  3 - COUNTRY NUMBER   */ 31880000
                                            /* 15 - CONTRACT NUMBER  */ 31890000
                                            /*  8 - CUSTOMER USER NO.*/ 31900000
 CALL PLISRTC                                                           31910000
            (' SORT FIELDS=(1,44,CH,A),DYNALLOC ',                      31920000
               ' RECORD TYPE=F,LENGTH=(68) ',                           31930000
               MAX_STORAGE,                                             31940000
               RETURN_CODE,                                             31950000
               R093_SORT_EXIT,                                          31960000
               'CUCO');                                                 31970000
                                                                        31980000
                                         /* EVALUATE SORT            */ 31990000
 CALL PLIRETC (RETURN_CODE);                                            32000000
                                                                        32010000
 SELECT (RETURN_CODE);                                                  32020000
 WHEN ('');                                                             32030000
 OTHERWISE                                                              32040000
   DO;                                                                  32050000
     PARM_INT_AREA.COUNTRY_NUMBER             = '';                     32060000
     PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                   32070000
     PARM_INT_AREA.MESSAGE_NUMBER             = '0011';                 32080000
     PARM_INT_AREA.MSG_VAR_CODES              = ' ';                    32090000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'RC';                   32100000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =  RETURN_CODE;           32110000
     CALL RCB0M1M (PTR_INT_AREA);                                       32120000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#024');                        32130000
   END;                                                                 32140000
 END;                                                                   32150000
                                                                        32160000
 CLOSE FILE (RCBBKAA);                                                  32170000
                                                                        32180000
 END R093_SORT_RCBBKAA;                                                 32190000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 32200000
1/* --------------- RA01120 AMENDMENT ------------------------------ */ 32210000
 /*********************************************************************/32220000
 /*                                                                   */32230000
 /* MODULE NAME      :  R093_SORT_EXIT                                */32240000
 /*                                                                   */32250000
 /* DESCRIPTION      :  HASH TOTALLING OF SORTED RECORDS RCBBKAA      */32260000
 /*                     INCLUDING DELETING DUPLICATES                 */32270000
 /*                                                                   */32280000
 /*********************************************************************/32290000
 R093_SORT_EXIT: PROC (IN_FILE);                                        32300000
                                                                        32310000
 DCL 1 IN_FILE           CHAR (68);                                     32320000
 DCL 1 OLD_FILE          CHAR (68);                                     32330000
                                                                        32340000
 DCL 1 RCBBKAA_IN        BASED (ADDR (IN_FILE)),                        32350000
       %INCLUDE (RCBBAAS1);,                                            32360000
       3 TB_RCBV035,                                                    32370000
         %INCLUDE (RCB035S);,                                           32380000
       3 TB_RCBV035_I,                                                  32390000
         %INCLUDE (RCB035SI);;                                          32400000
                                                                        32410000
 DCL 1 RCBBKAA_TRAILER   BASED (ADDR (IN_FILE)),                        32420000
       %INCLUDE (RCBBAAST);;                                            32430000
                                                                        32440000
 DCL 1 RCBBKAA_OLD       BASED (ADDR (OLD_FILE)),                       32450000
       %INCLUDE (RCBBAAS1);,                                            32460000
       3 TB_RCBV035,                                                    32470000
         %INCLUDE (RCB035S);,                                           32480000
       3 TB_RCBV035_I,                                                  32490000
         %INCLUDE (RCB035SI);;                                          32500000
                                                                        32510000
 SELECT (RCBBKAA_IN.REC_TYPE);                                          32520000
                                                                        32530000
   WHEN ('01')                                                          32540000
     DO;                                                                32550000
       OLD_FILE = IN_FILE;                                              32560000
     END;                                                               32570000
                                                                        32580000
   WHEN ('02')                                                          32590000
     DO;                                                                32600000
       IF RCBBKAA_IN.CTRYNO ¬= RCBBKAA_OLD.CTRYNO &                     32610000
          RCBBKAA_OLD.REC_TYPE = '02'          /* NEW COUNTRY ? */      32620000
       THEN                                                             32630000
         DO;                                                            32640000
           PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKAA_OLD.CTRYNO;         32650000
           CALL RX01_SAVE_HASH (RCBBKAA_OLD.CTRYNO,                     32660000
                                COUNT.CNT_CTRY.RCBBKAA_HASH,            32670000
                                WRK_RCBBKAA,                            32680000
                               'RCBBGBA');                              32690000
           PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                       32700000
           PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                     32710000
           PARM_INT_AREA.MSG_VAR_CODES    = '';                         32720000
           PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                       32730000
           PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                       32740000
           CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKAA;     32750000
           PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKAA;                32760000
           PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                   32770000
           CALL RCB0M1M (PTR_INT_AREA);                                 32780000
           COUNT.CNT_TOT.RCBBKAA       = COUNT.CNT_TOT.RCBBKAA +        32790000
                                         COUNT.CNT_CTRY.RCBBKAA;        32800000
           COUNT.CNT_CTRY.RCBBKAA      = 0;                             32810000
           COUNT.CNT_CTRY.RCBBKAA_HASH = 0;                             32820000
         END;                                                           32830000
       IF SUBSTR (IN_FILE,1,44) ¬= SUBSTR (OLD_FILE,1,44)               32840000
       THEN                                                             32850000
         DO;                                                            32860000
           WRITE FILE (RCBBKAA) FROM (OLD_FILE);                        32870000
           OLD_FILE               = IN_FILE;                            32880000
           COUNT.CNT_CTRY.RCBBKAA = COUNT.CNT_CTRY.RCBBKAA + 1;         32890000
                                                          /* PTM1058 */ 32900000
           CALL RCB018M (SUBSTR (RCBBKAA_IN.CONTRACT_NUMBER, 1, 4),     32910000
                         COUNT.CNT_CTRY.RCBBKAA_HASH,                   32920000
                         PTR_INT_AREA);                                 32930000
         END;                                                           32940000
       IF RCBBKAA_IN.SA_CONTRACT_IND    = 'Y'                           32950000
       THEN                                                             32960000
         DO;                                                            32970000
           RCBBKAA_OLD.SA_CONTRACT_IND  = 'Y';                          32980000
           RCBBKAA_OLD.INDNULL(04)      = 0;                            32990000
         END;                                                           33000000
       IF RCBBKAA_IN.AS_CONTRACT_IND    = 'Y'                           33010000
       THEN                                                             33020000
         DO;                                                            33030000
           RCBBKAA_OLD.AS_CONTRACT_IND  = 'Y';                          33040000
           RCBBKAA_OLD.INDNULL(05)      = 0;                            33050000
         END;                                                           33060000
     END;                                                               33070000
                                                                        33080000
   WHEN ('99')                                                          33090000
     DO;           /* SAVE HASH AND ISSUE MESSAGES FOR THE LAST CTRY */ 33100000
                                                                        33110000
       WRITE FILE (RCBBKAA) FROM (OLD_FILE);                            33120000
       PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKAA_OLD.CTRYNO;             33130000
       CALL RX01_SAVE_HASH (RCBBKAA_OLD.CTRYNO,                         33140000
                            COUNT.CNT_CTRY.RCBBKAA_HASH,                33150000
                            WRK_RCBBKAA,                                33160000
                            'RCBBGBA');                                 33170000
                                                                        33180000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           33190000
       PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                         33200000
       PARM_INT_AREA.MSG_VAR_CODES    = '';                             33210000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                           33220000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                           33230000
       CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKAA;         33240000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKAA;                    33250000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                       33260000
       CALL RCB0M1M (PTR_INT_AREA);                                     33270000
       COUNT.CNT_TOT.RCBBKAA          = COUNT.CNT_TOT.RCBBKAA +         33280000
                                        COUNT.CNT_CTRY.RCBBKAA;         33290000
                                                                        33300000
       RCBBKAA_TRAILER.CNT_RECS = COUNT.CNT_TOT.RCBBKAA;                33310000
       WRITE FILE (RCBBKAA) FROM (IN_FILE);                             33320000
     END;                                                               33330000
                                                                        33340000
   OTHERWISE;                                                           33350000
                                                                        33360000
 END;  /* SELECT */                                                     33370000
                                                                        33380000
 CALL PLIRETC(4);                                                       33390000
                                                                        33400000
 END R093_SORT_EXIT;                                                    33410000
                                                                        33420000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 33430000
1/********************************************************************/ 33440000
 /*                                                                  */ 33450000
 /* MODULE NAME      : R099_END_PROG                                 */ 33460000
 /*                                                                  */ 33470000
 /* DESCRIPTION      : ENDING ACTIONS FOR THE PROGRAM                */ 33480000
 /*                                                                  */ 33490000
 /********************************************************************/ 33500000
 R099_END_PROG : PROC;                                                  33510000
                                                                        33520000
 IF RCBBKA0_C999.CDBSFRT ¬= 'C999'  /* WRONG RECORD TYPE */             33530000
 THEN                                                                   33540000
   DO;                                                                  33550000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               33560000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             33570000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';                           33580000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                             33590000
     PARM_INT_AREA.MSG_VAR_VALUE_6  =  WRK_RCBBKA0;                     33600000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';                             33610000
     PARM_INT_AREA.MSG_VAR_VALUE_7  =  RCBBKA0_C999.CDBSFRT;            33620000
     CALL RCB0M1M (PTR_INT_AREA);                                       33630000
     CALL RCBBKAM_ERROR (NULL, 'OTHER', '#025');                        33640000
   END;                                                                 33650000
                                                                        33660000
                                          /* ISSUE COUNT MESSAGES */    33670000
 PARM_INT_AREA.COUNTRY_NUMBER   = '';                                   33680000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   33690000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 33700000
                                                                        33710000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';                               33720000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                 33730000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA0;                          33740000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C3';                                 33750000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA0;                33760000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             33770000
 CALL RCB0M1M (PTR_INT_AREA);                                           33780000
                                                                        33790000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                               33800000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                 33810000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                                 33820000
                                                                        33830000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA1;                33840000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA1;                          33850000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             33860000
 CALL RCB0M1M (PTR_INT_AREA);                                           33870000
                                                                        33880000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA2;                33890000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA2;                          33900000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             33910000
 CALL RCB0M1M (PTR_INT_AREA);                                           33920000
                                                                        33930000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA3;                33940000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA3;                          33950000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             33960000
 CALL RCB0M1M (PTR_INT_AREA);                                           33970000
                                                                        33980000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA4;                33990000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA4;                          34000000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34010000
 CALL RCB0M1M (PTR_INT_AREA);                                           34020000
                                                                        34030000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA5;                34040000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA5;                          34050000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34060000
 CALL RCB0M1M (PTR_INT_AREA);                                           34070000
                                                                        34080000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA6;                34090000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA6;                          34100000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34110000
 CALL RCB0M1M (PTR_INT_AREA);                                           34120000
                                                                        34130000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA7;                34140000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA7;                          34150000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34160000
 CALL RCB0M1M (PTR_INT_AREA);                                           34170000
                                                                        34180000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA8;                34190000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA8;                          34200000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34210000
 CALL RCB0M1M (PTR_INT_AREA);                                           34220000
                                                                        34230000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKA9;                34240000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA9;                          34250000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34260000
 CALL RCB0M1M (PTR_INT_AREA);                                           34270000
                                                      /* SOC RB01320  */34280000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKAD;                34281000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKAD;                          34282000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34283000
 CALL RCB0M1M (PTR_INT_AREA);                                           34284000
                                                      /* EOC RB01320  */34285000
 /* --------------- RA01120 AMENDMENT ------------------------------ */ 34290000
                                                                        34300000
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBKAA;                34310000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKAA;                          34320000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             34330000
 CALL RCB0M1M (PTR_INT_AREA);                                           34340000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 34350000
 TB_RCBV500                  = '';                                      34360000
 TB_RCBV500_I                = '';                                      34370000
                                    /* ADD 1 TO FILE SEQ. NUMBER */     34380000
                                                                        34390000
 RCB035.FILE_SEQ_NUM_SC      = WRK_FILE_SEQ;                            34400000
 TB_RCB035                   = RCB035 , BY NAME;                        34410000
                                                                        34420000
 CALL RCBG50M (PTR_RCBV500,       /*   UPDATE RCB035  */                34430000
               PTR_RCBV500I,                                            34440000
               PTR_RETURN_AREA,                                         34450000
               PTR_INT_AREA);                                           34460000
                                                                        34470000
 SELECT (RETURN_AREA.RETURN_CODE);                                      34480000
   WHEN (0);                                                            34490000
   OTHERWISE                                                            34500000
     DO;                                                                34510000
       CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),               34520000
                          'DB2','#026');                                34530000
     END;                                                               34540000
 END;                                                                   34550000
                                                                        34560000
 PARM_INT_AREA.MSG_VAR_CODES    = ' ';                                  34570000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 34580000
 PARM_INT_AREA.MESSAGE_NUMBER   = '9999';                               34590000
 CALL RCB0M1M (PTR_INT_AREA);                                           34600000
                                                                        34610000
 END R099_END_PROG;                                                     34620000
                                                                        34630000
1/********************************************************************/ 34640000
 /*                                                                  */ 34650000
 /* MODULE NAME      : RX01_SAVE_HASH                                */ 34660000
 /*                                                                  */ 34670000
 /* DESCRIPTION      : SAVE HASH TOTAL IN PARAMETER RCB024 AND       */ 34680000
 /*                    ISSUE MESSAGE 0173                            */ 34690000
 /*                                                                  */ 34700000
 /*                    BECAUSE THIS PROGRAM IS ALSO USED FOR A DELTA */ 34710000
 /*                    UPDATE PROCESS, THE RCB024 PARAMETER WITH     */ 34720000
 /*                    SEQUENCE NUMBER = '02' MUST BE DELETED, '01'  */ 34730000
 /*                    MUST BE SHIFTED TO '02' AND A NEW '01' MUST   */ 34740000
 /*                    BE INSERTED.                                  */ 34750000
 /*                                                                  */ 34760000
 /********************************************************************/ 34770000
 RX01_SAVE_HASH : PROC (WRK_CTRYNO,                                     34780000
                        WRK_HASH_TOTAL,                                 34790000
                        WRK_HASH_FILE,                                  34800000
                        WRK_FILE_NAME);                                 34810000
                                                                        34820000
 DCL WRK_CTRYNO      CHAR (03);                                         34830000
 DCL WRK_HASH_TOTAL  FIXED DEC (15,0);                                  34840000
 DCL WRK_HASH_FILE   CHAR (07);                                         34850000
 DCL WRK_FILE_NAME   CHAR (07);                                         34860000
                                                                        34870000
 TB_RCBV500            = '';                                            34880000
 TB_RCBV500_I          = '';                                            34890000
 TB_RCB024.NUMBER      = 'RCB024';                                      34900000
 TB_RCB024.PROC_ID     =  COUNTRY_AREA.PROC_ID;                         34910000
 TB_RCB024.CTRYNO      =  WRK_CTRYNO;                                   34920000
 TB_RCB024.FILE_NAME   =  WRK_FILE_NAME;                                34930000
 TB_RCB024.SEQ_NUMBER  = '02';                                          34940000
                                                                        34950000
 CALL RCBH50M (PTR_RCBV500,                 /* DELETE THE OLD '02' */   34960000
               PTR_RCBV500I,                                            34970000
               PTR_RETURN_AREA,                                         34980000
               PTR_INT_AREA);                                           34990000
                                                                        35000000
 SELECT (RETURN_AREA.RETURN_CODE);                                      35010000
   WHEN (0, 4);                                                         35020000
   OTHERWISE                                                            35030000
     DO;                                                                35040000
       CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),               35050000
                           'DB2','#027');                               35060000
     END;                                                               35070000
 END;                                                                   35080000
                                                                        35090000
 TB_RCBV500            = '';                                            35100000
 TB_RCBV500_I          = '';                                            35110000
 TB_RCB024.NUMBER      = 'RCB024';                                      35120000
 TB_RCB024.PROC_ID     =  COUNTRY_AREA.PROC_ID;                         35130000
 TB_RCB024.CTRYNO      =  WRK_CTRYNO;                                   35140000
 TB_RCB024.FILE_NAME   =  WRK_FILE_NAME;                                35150000
 TB_RCB024.SEQ_NUMBER  = '01';                                          35160000
                                              /* SHIFT '01' TO '02' */  35170000
0CALL RCBI50M ('R',                                       /* RC01219 */ 35180000
               PTR_RCBV500,                   /* GET '01'           */  35190000
               PTR_RCBV500I,                                            35200000
               PTR_RETURN_AREA,                                         35210000
               PTR_INT_AREA);                                           35220000
                                                                        35230000
 SELECT (RETURN_AREA.RETURN_CODE);                                      35240000
   WHEN (0)                                                             35250000
     DO;                                                                35260000
       CALL RCBH50M (PTR_RCBV500,             /* DELETE IT          */  35270000
                     PTR_RCBV500I,                                      35280000
                     PTR_RETURN_AREA,                                   35290000
                     PTR_INT_AREA);                                     35300000
       SELECT (RETURN_AREA.RETURN_CODE);                                35310000
         WHEN (0);                                                      35320000
         OTHERWISE                                                      35330000
           DO;                                                          35340000
             CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),         35350000
                                 'DB2','#028');                         35360000
           END;                                                         35370000
       END;                                                             35380000
                                                                        35390000
       TB_RCB024.SEQ_NUMBER  = '02';                                    35400000
       CALL RCBF50M (PTR_RCBV500,        /* AND RE-INSERT WITH '02' */  35410000
                     PTR_RCBV500I,                                      35420000
                     PTR_RETURN_AREA,                                   35430000
                     PTR_INT_AREA);                                     35440000
       SELECT (RETURN_AREA.RETURN_CODE);                                35450000
         WHEN (0);                                                      35460000
         OTHERWISE                                                      35470000
           DO;                                                          35480000
             CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),         35490000
                                 'DB2','#029');                         35500000
           END;                                                         35510000
       END;                                                             35520000
     END;                                                               35530000
   WHEN (4);                                                            35540000
   OTHERWISE                                                            35550000
     DO;                                                                35560000
       CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),               35570000
                           'DB2','#030');                               35580000
     END;                                                               35590000
 END;                                                                   35600000
                                                                        35610000
 TB_RCBV500              = '';                                          35620000
 TB_RCBV500_I            = '';                                          35630000
 TB_RCB024.NUMBER        = 'RCB024';                                    35640000
 TB_RCB024.PROC_ID       =  COUNTRY_AREA.PROC_ID;                       35650000
 TB_RCB024.CTRYNO        =  WRK_CTRYNO;                                 35660000
 TB_RCB024.FILE_NAME     =  WRK_FILE_NAME;                              35670000
 TB_RCB024.SEQ_NUMBER    = '01';                                        35680000
 TB_RCB024.LENGTH_PARM   =  WRK_LENGTH_RCB024;                          35690000
 TB_RCB024.TIME_STAMP    =  WRK_DATETIME;                               35700000
 TB_RCB024.HASH_TOTAL    =  WRK_HASH_TOTAL;                             35710000
                                                                        35720000
 CALL RCBF50M (PTR_RCBV500,       /* NOW INSERT THE NEW '01' */         35730000
               PTR_RCBV500I,                                            35740000
               PTR_RETURN_AREA,                                         35750000
               PTR_INT_AREA);                                           35760000
                                                                        35770000
 SELECT (RETURN_AREA.RETURN_CODE);                                      35780000
   WHEN (0);                                                            35790000
   OTHERWISE                                                            35800000
     DO;                                                                35810000
       CALL RCBBKAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),               35820000
                           'DB2','#031');                               35830000
     END;                                                               35840000
 END;                                                                   35850000
                                               /* ISSUE MESSAGE */      35860000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           35870000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 35880000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0173';                               35890000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   35900000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                 35910000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_HASH_FILE;                        35920000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'TP';                                 35930000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_DATETIME;                         35940000
 PARM_INT_AREA.MSG_VAR_CODE_8   = 'HT';                                 35950000
 CNT_PIC15                      = WRK_HASH_TOTAL;                       35960000
 PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                            35970000
 CALL RCB0M1M (PTR_INT_AREA);                                           35980000
                                                                        35990000
 END RX01_SAVE_HASH;                                                    36000000
                                                                        36010000
1/********************************************************************/ 36020000
 /*                                                                  */ 36030000
 /* MODULE NAME      : RX02_ISSUE_MSG_M0181                          */ 36040000
 /*                                                                  */ 36050000
 /* DESCRIPTION      : ISSSUE MESSAGE M0181                          */ 36060000
 /*                                                                  */ 36070000
 /********************************************************************/ 36080000
0RX02_ISSUE_MSG_M0181: PROC;                                            36090000
 PARM_INT_AREA.COUNTRY_NUMBER   = RCBBKA0_C001.IOPUCTY;                 36100000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   36110000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 36120000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0181';                               36130000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'CY';                                 36140000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = RCBBKA0_C001.IOPUCTY;                 36150000
 CALL RCB0M1M (PTR_INT_AREA);                                           36160000
 END RX02_ISSUE_MSG_M0181;                                              36170000
1/********************************************************************/ 36180000
 /*                                                                  */ 36190000
 /* MODULE NAME      : RX03_ISSUE_CTRY_CNT                           */ 36200000
 /*                                                                  */ 36210000
 /* DESCRIPTION      : ISSUE COUNT MESSAGES FOR A COUNTRY            */ 36220000
 /*                                                                  */ 36230000
 /********************************************************************/ 36240000
 RX03_ISSUE_CTRY_CNT: PROC;                                             36250000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           36260000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   36270000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 36280000
                                                                        36290000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';                               36300000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                 36310000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA0;                          36320000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C3';                                 36330000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA0;               36340000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36350000
 CALL RCB0M1M (PTR_INT_AREA);                                           36360000
                                                                        36370000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                               36380000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                 36390000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                                 36400000
                                                                        36410000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA1;               36420000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA1;                          36430000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36440000
 CALL RCB0M1M (PTR_INT_AREA);                                           36450000
                                                                        36460000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA2;               36470000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA2;                          36480000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36490000
 CALL RCB0M1M (PTR_INT_AREA);                                           36500000
                                                                        36510000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA3;               36520000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA3;                          36530000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36540000
 CALL RCB0M1M (PTR_INT_AREA);                                           36550000
                                                                        36560000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA4;               36570000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA4;                          36580000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36590000
 CALL RCB0M1M (PTR_INT_AREA);                                           36600000
                                                                        36610000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA5;               36620000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA5;                          36630000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36640000
 CALL RCB0M1M (PTR_INT_AREA);                                           36650000
                                                                        36660000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA6;               36670000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA6;                          36680000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36690000
 CALL RCB0M1M (PTR_INT_AREA);                                           36700000
                                                                        36710000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA7;               36720000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA7;                          36730000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36740000
 CALL RCB0M1M (PTR_INT_AREA);                                           36750000
                                                                        36760000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA8;               36770000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA8;                          36780000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36790000
 CALL RCB0M1M (PTR_INT_AREA);                                           36800000
                                                                        36810000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKA9;               36820000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKA9;                          36830000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36840000
 CALL RCB0M1M (PTR_INT_AREA);                                           36850000
                                                    /* SOC RB01320   */ 36860000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKAD;               36861000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKAD;                          36862000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36863000
 CALL RCB0M1M (PTR_INT_AREA);                       /* EOC RB01320   */ 36864000
                                                                        36865000
 /* --------------- RA01120 AMENDMENT ------------------------------ */ 36870000
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBKAA;               36880000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBKAA;                          36890000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             36900000
 CALL RCB0M1M (PTR_INT_AREA);                                           36910000
                                                                        36920000
 /* ----------- END RA01120 AMENDMENT ------------------------------ */ 36930000
 END RX03_ISSUE_CTRY_CNT;                                               36940000
                                                                        36950000
1/********************************************************************/ 36960000
 /*                                                                  */ 36970000
 /* MODULE NAME      : RX04_ISSUE_MSG_M0184                          */ 36980000
 /*                                                                  */ 36990000
 /* DESCRIPTION      : ISSSUE MESSAGE M0184                          */ 37000000
 /*                                                                  */ 37010000
 /********************************************************************/ 37020000
0RX04_ISSUE_MSG_M0184: PROC;                                            37030000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           37040000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   37050000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 37060000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0184';                               37070000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'CY';                                 37080000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_CTRYNO;                           37090000
 CALL RCB0M1M (PTR_INT_AREA);                                           37100000
 END RX04_ISSUE_MSG_M0184;                                              37110000
1/********************************************************************/ 37120000
 /*                                                                  */ 37130000
 /* MODULE NAME      : RCBBKAM_ERROR                                 */ 37140000
 /*                                                                  */ 37150000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 37160000
 /*                    THE INPUT VARIABLES                           */ 37170000
 /*                                                                  */ 37180000
 /********************************************************************/ 37190000
0RCBBKAM_ERROR: PROC     (PTR_ERROR,                                    37200000
                          ERR_TYPE,                                     37210000
                          CALL_ID);                                     37220000
 DCL PTR_ERROR    PTR;                                                  37230000
 DCL ERR_TYPE     CHAR(8);                                              37240000
 DCL CALL_ID      CHAR(4);                                              37250000
                                                                        37260000
 PARM_INT_AREA.PTR_ERROR      = PTR_ERROR;                              37270000
 PARM_INT_AREA.ERR_TYPE       = ERR_TYPE;                               37280000
 PARM_INT_AREA.CALL_ID        = CALL_ID;                                37290000
                                                                        37300000
 CALL RCB0E1M (PTR_INT_AREA);                                           37310000
                                                                        37320000
0END RCBBKAM_ERROR;                                                     37330000
                                                                        37340000
1/*******************************************************************/  37350000
 /*  DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                   */  37360000
 /*******************************************************************/  37370000
0%INCLUDE DAIFPLH ;                      /* COMPILE DATE/TIME STAMP */  37380000
 $DAIMOD (RCBBKAM);                      /* MODULE TO BE COMPILED   */  37390000
0/*******************************************************************/  37400000
 /* END OF ABR BLOCK                                                */  37410000
 /*******************************************************************/  37420000
 END RCBBKAM;                                                           37430000