1/* RCBBIFU - USER EXIT FOR SHRINK WRAP                              */ 00012000
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* MODULE NAME      : RCBBIFU...                                    */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME     : RCBBIFP                                       */ 00060000
 /*                                                                  */ 00070000
 /* LANGUAGE         : PLISQL                                        */ 00080000
 /*                                                                  */ 00090000
 /* TYPE             : LINKABLE MODULE                               */ 00100000
 /*                                                                  */ 00110000
 /* DESCRIPTION      : USER EXIT FOR INVENTORY INFORMATION           */ 00120000
 /*                    TO BE USED IN THE CONVERSION OF SHRINK WRAP   */ 00130000
 /*                                                                  */ 00140000
 /* INPUT            : - RCB WORKAREA, CONSISTING ALL NECESSARY      */ 00150000
 /*                      DATA FOR THE RCB CUSTOMER, INVENTORY AND    */ 00160000
 /*                      CONTRACT FILE       (FROM CALLING MODULE)   */ 00170000
 /*                    - DB2 :                                       */ 00180000
 /*                                                                  */ 00190000
 /* OUTPUT           : - RCB WORKAREA, CONSISTING ALL NECESSARY      */ 00200000
 /*                      DATA FOR THE RCB CUSTOMER, INVENTORY AND    */ 00210000
 /*                      CONTRACT FILE       ( TO  CALLING MODULE)   */ 00220000
 /*                                                                  */ 00230000
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00240000
 /*                                                                  */ 00250000
 /* NOTE             : IF YOU WANT TO USE THIS EXIT BE SURE TO SET   */ 00260000
 /*                    SWITCH_USER_EXIT TO TRUE                      */ 00270000
 /*                                                                  */ 00280000
 /* MESSAGES         : ----                                          */ 00290000
 /*                                                                  */ 00300000
 /* DEPENDENCIES     : NONE                                          */ 00310000
 /*                                                                  */ 00320000
 /* FREQUENCY        : ----                                          */ 00330000
 /*                                                                  */ 00340000
 /*  MAINTENANCE LOG :                                               */ 00350000
 /*  ---------------                                                 */ 00360000
 /*                                                                  */ 00370000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00380000
 /*  --------------------------------------------------------------  */ 00390000
 /*  1996-11-06 | RA01170      | ALIGN CEDS TO HVP                   */ 00400000
 /*  1997-04-11 | PTM1036      | CORRECTED PROLOG                    */ 00410000
 /*  1997-04-29 | PTM0892      | REMOVE DECLARES UNUSED EXT.ENTRIES  */ 00420000
 /*                                                                  */ 00430000
 /*  1999-10-27 | RUN ONCE NORD| ADD NORDIC  SPECIFIC CODE - BG      */ 00440000
 /*  1999-11-02 | ROSOUTH      | ADD SOUTH   SPECIFIC CODE - RG      */ 00450000
 /*  1999-11-05 | RUN ONCE CNTL| ADD CENTRAL SPECIFIC CODE - SG      */ 00460000
 /*  2000-12-14 | NB0928       | REMOVE ALL UPDATE ON TYPE MACHINE   */ 00470000
 /*             |              | KEEP ONLY TOM = '2' AND ADDR LINES  */ 00480000
 /*             |              | AND OU_CODE UPDATES - BE (WEST)     */ 00490000
 /*  2001-06-12 | C0026-0501   | ADD THE LOGIC FOR TYPE OF WARRANTY  */ 00500000
 /*             |              | TO 706                        - SR  */ 00510000
 /*  2001-06-12 | C0028-0501   | ADD THE LOGIC FOR TYPE OF WARRANTY  */ 00520000
 /*             |              | AND SERVICE PACS FOR 644,668,693,704*/ 00530000
 /*             |              | 708,740,820,821,826           - SR  */ 00540000
 /*             |              |                                     */ 00550000
 /*  2001-07-04 | C0028-0501   | TYPE OF MAINTENANCE IS SET TO '2'   */ 00560000
 /*             | (CHG0060F)   | FOR CENTRAL COUNTRIES(ALL 27) - SR  */ 00570000
 /*             |              |                                     */ 00580000
 /*  2001-12-07 | C0047-1201   | OU_CODE FROM '7076000' TO '7076'    */ 00590000
 /*  2003-02-28 | CEDS RUN ONCE| CHANGE NUMBER C0079-0203 CHG0248A AD*/ 00600000
 /*  2005-09-06 | CEDS RUN ONCE| CHANGS CEDS OU CODES FOR PEW DATA   */ 00610000
 /*             | (CHG0384A)   |                                     */ 00620000
 /*  2005-10-20 | CEDS RUN ONCE| CHANGS FOR QF 3.1 AC                */ 00630000
 /*             | (CHG0388G)   |                                     */ 00640000
 /*  2006-12-07 | CEDS RUN ONCE| CHANGS FOR QF 3.1 AH                */ 00650000
 /*             | (CHG0422B)   |                                     */ 00660000
 /*  2007-06-26 | CEDS RUN ONCE| CHANGS FOR QF 3.1 AH                */ 00670000
 /*             |  (CHG0447A)  |                                     */ 00680000
 /*  2008-08-21 | CEDS RUN ONCE| CHANGE FOR TYPE_OF_MAINT FOR        */ 00690000
 /*             |              | SOUTH REGION                        */ 00700000
 /*  2009-07-09 |   CHG0027C   | CEEMEA COUNTRY HANDLING CHANGES     */ 00710000
 /*  2011-05-16 |   R09-0221   | CEEMEA COUNTRY HANDLING CHANGES     */ 00711000
 /*  2012-06-19 | TREC 80749   | OU CODE SET IN INVENTORY OF GBM/SBM */ 00720000
 /*             |              | COUNTRIES(XCLS REGION)              */ 00721000
 /*  2015-05-18 | PCEDSP-0544  | LA PROJECT : PEW INTERFACE          */ 00722000
 /*  2016-02-25 | PCEDSP-0609  | CND : PEW/DSW FEED                  */ 00723000
 /*  2016-05-18 | PCEDSP-0594  | REPLACE SPECIAL CHARACTERS FOR 724  */ 00724066
 /*  2016-11-30 | PCEDSP-0454  | REPLACE NON-ENGLISH TEXT IN CEDS    */ 00725066
 /*             |              | CODE                                */ 00726066
 /*  2017-06-19 | PCEDSP-0721  | (L) LA SSA 8+ PROJECT: PI ( PEW/DSW)*/ 00727071
 /*             |              |                                     */ 00728071
 /********************************************************************/ 00730000
1RCBBIFU: PROC    (PTR_SWITCH_USER_EXIT,                                00740000
                   PTR_USER_FILE,                                       00750000
                   PTR_INT_AREA)                                        00760000
          REORDER;                                                      00770000
0              @NGR0BV: ENTRY;     DCL @SCHFIRST BIT(1)                 00780000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00790000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00800000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00810000
               EDIT    ('RCBBIFU  VERSION 2011.05.16' ,                 00820000
               ' 15H35.35      WITH VERSION ENTRY    ',                 00830065
               ' @NGR0BV',' ')     (SKIP,A,A,A,SKIP,A);                 00840000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00850000
               END;     /* END OF VERSION GROUP      */                 00860065
 DEFAULT RANGE (*)        STATIC;                                       00870000
1/********************************************************************/ 00880000
 /*  PARAMETERS                                                      */ 00890000
 /********************************************************************/ 00900000
 DCL PTR_USER_FILE           PTR;                                       00910000
 DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 00920000
 DCL PTR_SWITCH_USER_EXIT    PTR;                                       00930000
 DCL 1 RETURN_AREA,                                        /*26-01-01*/ 00940000
       %INCLUDE (RCBZ02S);;                                             00950000
 DCL PTR_DATE_AREA        PTR;                                          00960000
                                                                        00970000
 DCL RETCODE              FIXED BIN(31) INIT(0)  ;         /*26-01-01*/ 00980000
1/********************************************************************/ 00990000
 /*  EXTERNAL ENTRIES                                                */ 01000000
 /********************************************************************/ 01010000
 DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 01020000
 DCL RCB004M    ENTRY EXTERNAL;            /* DATE CALC ROUTINE      */ 01030000
 DCL RCBI82M    ENTRY EXTERNAL;            /* DATE CALC ROUTINE      */ 01040000
1/********************************************************************/ 01050000
 /*  ROWEST EXTERNAL ENTRIES ADDITIONAL                              */ 01060000
 /********************************************************************/ 01070000
 DCL RCBZ00M   ENTRY  EXTERNAL;            /* SEARCH ROUTINE*04/08/97*/ 01080000
 /********************************************************************/ 01090000
 /* ON ERROR CONDITIONS                                              */ 01100000
 /********************************************************************/ 01110000
 %INCLUDE (RCB0E0M);                                                    01120000
 /**/CLOSE FILE(SYSPRINT);                                              01130000
  END;                                                                  01140000
 /********************************************************************/ 01150000
 /*                                                                  */ 01160000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 01170000
 /* AND CALL THE ERROR ROUTINE:                                      */ 01180000
 /*                                                                  */ 01190000
 /*                                                                  */ 01200000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 01210000
 /*                                                                  */ 01220000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 01230000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 01240000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 01250000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 01260000
 /*                                                                  */ 01270000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 01280000
 /*                                                                  */ 01290000
 /********************************************************************/ 01300000
 /********************************************************************/ 01310000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01320000
 /********************************************************************/ 01330000
 DCL SWITCH_USER_EXIT        BIT (1) BASED(PTR_SWITCH_USER_EXIT);       01340000
 DCL 1 USER_FILE           BASED(PTR_USER_FILE),                        01350000
       2 DATA,                                                          01360000
      %INCLUDE RCBBIFSU;;                                               01370000
 DCL 1 PARM_INT_AREA       BASED(PTR_INT_AREA),                         01380000
      %INCLUDE (RCBZ01S);;                                              01390000
 DCL 1 PARM           STATIC INTERNAL, /*PARAMETER STRUCTURE */         01400000
       %INCLUDE (RCBZ13S);;                               /* 26-01-01*/ 01410000
1/********************************************************************/ 01420000
 /*  ROWEST EXTERNAL PARAMETER INTERFACES                            */ 01430000
 /********************************************************************/ 01440000
 DCL 1 DATE_AREA,                      /* DATE AREA          NBA0623*/  01450000
     %INCLUDE (RCBZ03S);;                                               01460000
1/********************************************************************/ 01470000
 /*  DB2 TABLE STRUCTURES                                            */ 01480000
 /********************************************************************/ 01490000
 DCL 1 TB_RCBV051,                                        /* 26-01-01*/ 01500000
      %INCLUDE RCB051S;;                                  /* 26-01-01*/ 01510000
                                                          /* 26-01-01*/ 01520000
 DCL 1 TB_RCBV051_I,                                      /* 26-01-01*/ 01530000
      %INCLUDE RCB051SI;;                                 /* 26-01-01*/ 01540000
1/********************************************************************/ 01550000
 /*  BIT SWITCHES                                                    */ 01560000
 /********************************************************************/ 01570000
 DCL TRUE     BIT (1) INIT ('1'B);                                      01580000
 DCL FALSE    BIT (1) INIT ('0'B);                                      01590000
 /********************************************************************/ 01600000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01610000
 /********************************************************************/ 01620000
 DCL 1 WORK_FIELDS,                                                     01630000
       3 WRK_LEVEL      FIXED BIN (15),                                 01640000
       3 WRK_INDNULL    FIXED BIN (15);                                 01650000
 /********************************************************************/ 01660000
 /*  ROWEST - ALL OTHER ROWEST USED TEMP FIELDS                      */ 01670000
 /********************************************************************/ 01680000
                                   /* DECLARE FOR RCBZ00M WORK FIELDS*/ 01690000
 DCL EDQ_ZIP_CODE       CHAR(09) INIT('  ');               /*04/08/97*/ 01700000
 DCL EDQ_OU_CODE        CHAR(07) INIT('  ');               /*04/08/97*/ 01710000
 DCL EDQ_FLAG_EDQ       BIT(1)   INIT('0'B);               /*04/08/97*/ 01720000
                                  /* DECLARE FOR ADDRESS LINES *NB1009*/01730000
 DCL ZONE_ADDI            CHAR(30) ;         /* ADDRESS_LINE_3        */01740000
 DCL ZONE_ADDO            CHAR(30) ;         /* ADDRESS_LINE_3 NEW    */01750000
 DCL (INDI,INDO)          BIN FIXED(15) ;    /* ARRAY COUNT           */01760000
 DCL TABI(30) CHAR(1) BASED(ADDR(ZONE_ADDI));/* ARRAY */                01770000
 DCL TABO(30) CHAR(1) BASED(ADDR(ZONE_ADDO));/* ARRAY */                01780000
 DCL WD_PIC               PIC '(08)9';       /*            C0026-0501*/ 01790000
 DCL PIC7_1               PIC '(08)9';       /*            C0026-0501*/ 01800000
 DCL PIC7_2               PIC '(08)9';       /*            C0026-0501*/ 01810000
 DCL PICN_1               PIC '(08)9';       /*            C0026-0501*/ 01820000
 DCL PICN_2               PIC '(08)9';       /*            C0026-0501*/ 01830000
 DCL WRK_INSTALL_DATE     CHAR(10);          /*            C0026-0501*/ 01840000
 DCL WRK_EXP_DATE         CHAR(10);          /*            C0026-0501*/ 01850000
 DCL Y CHAR(30);                             /*           PCEDSP-0594*/ 01851052
 DCL R FIXED BIN(31)   INIT(0);              /*           PCEDSP-0594*/ 01852052
 DCL C FIXED BIN(31)   INIT(0);              /*           PCEDSP-0594*/ 01853058
 DCL T FIXED BIN(31)   INIT(0);              /*           PCEDSP-0594*/ 01854058
1/********************************************************************/ 01860000
 /*  BUILTIN FUNCTIONS                                               */ 01870000
 /********************************************************************/ 01880000
 DCL (ADDR,                                                             01890000
      SUBSTR,                                                           01900000
      INDEX,                                                            01901052
      TALLY,                                                            01902057
      NULL)   BUILTIN;                                                  01910000
1/********************************************************************/ 01920000
 /* DB2/SQL SQLCA                                                    */ 01930000
 /********************************************************************/ 01940000
  EXEC SQL                                                              01950000
    INCLUDE SQLCA                                                       01960000
    ;                                                                   01970000
1/********************************************************************/ 01980000
 /*                 S T A R T   P R O C E S S I N G                  */ 01990000
 /********************************************************************/ 02000000
                                         /* SET LEVEL AND MOD NAME   */ 02010000
 WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            02020000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     02030000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBBIFU';                     02040000
                                         /* USER DEFINED PROCESS     */ 02050000
 SWITCH_USER_EXIT = TRUE;                                               02060000
                                                                        02070000
1/*******************************************************************/  02080000
 /* BEGIN COUNTRY SPECIFIC CODE                                     */  02090000
 /*******************************************************************/  02100000
                                                                        02110000
                             /**** SELECT THE COUNTRY TO BE PROCESSED */02120000
 /* REGION NORDIC START */                                              02130000
                                                                        02140000
 SELECT (PARM_INT_AREA.COUNTRY_NUMBER) ;                                02150000
    WHEN ('846')      /*   SWEDEN   */                                  02160000
       DO ;                                                             02170000
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */02180000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        02190000
          CALL RCBBIFU_GET_TOW;        /*TYPE OF WARRANTY-C0079-0203  */02200000
       END ;                                                            02210000
    WHEN ('702')      /*   FINLAND  */                                  02220000
       DO ;                                                             02230000
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */02240000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        02250000
          CALL RCBBIFU_GET_TOW;        /*TYPE OF WARRANTY-C0079-0203  */02260000
       END ;                                                            02270000
    WHEN ('678')      /*   DENMARK  */                                  02280000
       DO ;                                                             02290000
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */02300000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        02310000
          CALL RCBBIFU_GET_TOW;        /*TYPE OF WARRANTY-C0079-0203  */02320000
       END ;                                                            02330000
    WHEN ('806')      /*   NORWAY   */                                  02340000
       DO ;                                                             02350000
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */02360000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        02370000
          CALL RCBBIFU_GET_TOW;        /*TYPE OF WARRANTY-C0079-0203  */02380000
       END ;                                                            02390000
                                                                        02400000
 /* REGION NORDIC END */                                                02410000
                                                                        02420000
 /* REGION WEST START */                                                02430000
                                                                        02440000
    WHEN ('706')      /*   FRANCE   */                                  02450000
       DO ;                                                             02460000
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */02470000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';             /*NB0928*/ 02480000
          CALL C706_OUCODES ;                                           02490000
          CALL SOUT_OUCODES ;                                           02500000
          CALL RCBBIFU_GET_TOW;                                         02510000
       END ;                                                            02520000
    WHEN ('624')  /* INCLUDE REST OF WEST REGION HERE? */               02530000
       DO ;                                                             02540000
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */02550000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';              /*NB0928*/02560000
          CALL SOUT_OUCODES ;                                           02570000
          CALL RCBBIFU_GET_TOW;        /*TYPE OF WARRANTY-C0079-0203  */02580000
       END ;                                                            02590000
                                                                        02600000
                                              /* R09-0221 START *       02601000
   WHEN ('620','677','767','805','823','832', /* CHG0027C START *       02610000
         '680','048','047') DO; /*REMOVED 642,729,808,865 FROM WHEN ST* 02620000
      CALL RCBBIFU_GET_TOW; /*TYPE OF WARRANTY-C0079-0203  *            02630000
   END;  */                                                             02640000
                                /* TEMEA-T080749 START   */             02640100
   /*WHEN ('047','048','620','680','805')                               02641000
     DO;                   /*REMOVED 642,729,808,865,677,767,823,832 */ 02642000
   /*   CALL RCBBIFU_GET_TOW; */                                        02643000
   /*END;                                        /* R09-0221 END */     02644000
   /*                                                                   02650000
   WHEN ('642','729','808','865') DO;                                   02660000
      USER_FILE.DATA.OU_CODE = '9001';                                  02670000
      IF USER_FILE.DATA.TYPE_OF_MAINT = ' ' THEN                        02680000
            USER_FILE.DATA.TYPE_OF_MAINT = '2';                         02690000
                                                                        02700000
      CALL RCBBIFU_GET_TOW;                                             02710000
   END;                                       /* CHG0027C END   */      02720000
                                    /* TEMEA-T080749 END   */           02730000
 /* REGION WEST END   */                                                02740000
                                                                        02740100
 /* REGION GMEA START */                          /*R09-0221 START ****/02740200
                                       /* TEMEA-T080749 START    */     02740300
 /* WHEN('610','635','677','725','764','767','782'                      02741000
        ,'804','823','832','851','857','883') */                        02741100
    WHEN('610','620','677','725','764','767'                            02741200
        ,'804','805','823','832','851','857','883')                     02741300
                                       /* TEMEA-T080749 END      */     02741400
    DO;                                                                 02742000
      USER_FILE.DATA.OU_CODE = '0100   ';                               02744000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN                       02745000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            02746000
      CALL RCBBIFU_GET_TOW;                                             02747000
    END;                                                                02748000
                                                                        02748100
    WHEN('642','729','808','865')                                       02749000
    DO;                                                                 02749100
      USER_FILE.DATA.OU_CODE = '9001   ';                               02749200
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN                       02749300
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            02749400
      CALL RCBBIFU_GET_TOW;                                             02749500
    END;                                                                02749600
 /* REGION GMEA END   */                          /*R09-0221 END   ****/02749700
                                                                        02750000
 /* REGION CENTRAL   */                                                 02760000
                                                                        02770000
   WHEN ('618',              /****       COUNTRY 618 = AUSTRIA     ****/02790000
         '848') DO;          /****       COUNTRY 848 = SWITZERLAND ****/02800000
                                            /*************************/ 02810000
                                            /* LOCAL CHANGES         */ 02820065
                                            /* FOR REL. 3.0          */ 02830065
                                            /* ALLOCATION IN OU_CODE */ 02840065
      IF PARM_INT_AREA.COUNTRY_NUMBER = '618' THEN                      02880000
          USER_FILE.DATA.OU_CODE = '7102CMC';                           02890000
                                                                        02900000
      IF PARM_INT_AREA.COUNTRY_NUMBER = '848' THEN                      02910000
          USER_FILE.DATA.OU_CODE = '2210HVP';                           02920000
                                                                        02930000
      CALL RCBBIFU_GET_TOW;                                             02940000
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */02950000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        02960000
                    /*CHG0060F   */         /*************************/ 02961053
  /** SELECT;   LOCAL CHANGES FOR REL. 3.0 - SELECT INSTALLED           02962065
                                                                        02963053
         WHEN (PARM_INT_AREA.RUN_DATE >= USER_FILE.DATA.INSTALL_DATE &  02964053
             PARM_INT_AREA.RUN_DATE <= USER_FILE.DATA.WARRANTY_EXP_DATE)02965053
              USER_FILE.DATA.TYPE_OF_MAINT = ' ';                       02966053
                                                                        02967053
         WHEN (PARM_INT_AREA.RUN_DATE >= USER_FILE.DATA.EFFECTIVE_DATE  02968053
             & PARM_INT_AREA.RUN_DATE <= USER_FILE.DATA.END_DATE)       02969053
              USER_FILE.DATA.TYPE_OF_MAINT = '2';                       02969153
                                                                        02969253
         OTHERWISE;                                    /*CHG0060F       02969353
      END;             **/                    /* END OF SELECT       */ 02969465
                                                                        02969553
                             /****       COUNTRY 618 = AUSTRIA     ****/02969653
                             /****       COUNTRY 848 = SWITZERLAND ****/02969753
         END;                               /*                       */ 02970051
                                                                        02971000
                                                                        02971500
   WHEN ('724') DO;          /**** START COUNTRY 724  = GERMANY    ****/02972065
                                            /*************************/ 02975000
                                            /* LOCAL CHANGES         */ 02976065
                                            /* FOR REL. 3.0          */ 02977065
                                            /* ALLOCATION IN OU_CODE */ 02978065
      IF PARM_INT_AREA.COUNTRY_NUMBER = '724' THEN                      02979000
          USER_FILE.DATA.OU_CODE = '7076';            /*C0047-1201*/    02979100
                                                                        02979352
      CALL RCBBIFU_HANDLE_SPECIAL_CHAR;     /*******PCEDSP-0594*******/ 02979459
                                                                        03023152
      CALL RCBBIFU_GET_TOW;                                             03023249
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */03023349
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        03023449
                    /*CHG0060F   */         /*************************/ 03023649
  /** SELECT;   LOCAL CHANGES FOR REL. 3.0 - SELECT INSTALLED           03023765
                                                                        03023800
         WHEN (PARM_INT_AREA.RUN_DATE >= USER_FILE.DATA.INSTALL_DATE &  03023900
             PARM_INT_AREA.RUN_DATE <= USER_FILE.DATA.WARRANTY_EXP_DATE)03024000
              USER_FILE.DATA.TYPE_OF_MAINT = ' ';                       03030000
                                                                        03040000
         WHEN (PARM_INT_AREA.RUN_DATE >= USER_FILE.DATA.EFFECTIVE_DATE  03050000
             & PARM_INT_AREA.RUN_DATE <= USER_FILE.DATA.END_DATE)       03060000
              USER_FILE.DATA.TYPE_OF_MAINT = '2';                       03070000
                                                                        03080000
         OTHERWISE;                                    /*CHG0060F       03090000
      END;             **/                    /* ENDE DER SELECT     */ 03100000
                                                                        03110000
   END;                      /**** END   COUNTRY 724 = GERMANY     ****/03120065
 /* REGION LATN      */                                                 03140100
                                                                        03140200
                             /**** SOC PCR544                      ****/03140372
                             /**** SOC PCR721                      ****/03140472
   WHEN ('613','655','661','683','813','815','869','871') DO;           03140870
                                            /* LOCAL CHANGES         */ 03140970
                                            /* ALLOCATION IN OU_CODE */ 03141170
          USER_FILE.DATA.OU_CODE = '1';                                 03141370
                                                                        03141770
      CALL RCBBIFU_GET_TOW;                                             03141870
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */03141970
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        03142070
   END;                                                                 03142170
                             /**** EOC PCR721                      ****/03142270
                                                                        03142370
   WHEN ('631',              /**** START COUNTRY 631 = BRAZIL      ****/03142400
         '781') DO;          /****       COUNTRY 781 = MEXICO      ****/03142500
                                            /*************************/ 03142600
                                            /* LOCAL CHANGES         */ 03142765
                                            /* FOR REL. 3.0          */ 03142865
                                            /* ALLOCATION IN OU_CODE */ 03142965
      IF PARM_INT_AREA.COUNTRY_NUMBER = '781' THEN                      03143000
          USER_FILE.DATA.OU_CODE = '1';               /*C0047-1201*/    03143100
                                                                        03143200
      IF PARM_INT_AREA.COUNTRY_NUMBER = '631' THEN                      03143300
          USER_FILE.DATA.OU_CODE = '2';                                 03143400
                                                                        03143500
      CALL RCBBIFU_GET_TOW;                                             03143600
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */03143700
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        03143800
   END;                      /**** END   COUNTRY 631 = BRAZIL      ****/03143900
                             /****       COUNTRY 781 = MEXICO      ****/03144000
                             /**** EOC PCR544                      ****/03144100
                                                                        03144270
 /* REGION CRBN  START            --- PCEDSP-0609  */                   03144300
   WHEN ('619','621','627','640','647','759','791','839','843','859')   03144400
        DO;                                                             03144500
        USER_FILE.DATA.OU_CODE              /* ALLOCATION IN          */03144665
         = PARM_INT_AREA.COUNTRY_NUMBER||'000'||' ';                    03144700
                                            /* OU_CODE                */03144800
      CALL RCBBIFU_GET_TOW;                                             03144900
          IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN   /*  CHG0422B  */03145000
             USER_FILE.DATA.TYPE_OF_MAINT = '2';                        03145100
        END;                                                            03145200
 /* REGION CRBN  END              --- PCEDSP-0609  */                   03145300
                                                /* R09-0221 START  **** 03146000
    WHEN('644')                        *** FOR COUNTRY 644   *********/ 03150000
    WHEN('644','707','889')           /*FOR COUNTRIES LIKE BULGARIA **/ 03151000
                                                /* R09-0221 END   ****/ 03152000
    DO;                                                                 03160000
 /*   USER_FILE.DATA.OU_CODE = '0100000';                   CHG0384A */ 03170000
      USER_FILE.DATA.OU_CODE = '0100   '; /*TREC-T080749            */  03180000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03190000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03200000
      CALL RCBBIFU_GET_TOW;                                             03210000
    END;                                                                03220000
                                                                        03230000
    WHEN('668')                       /*** FOR COUNTRY 668   *********/ 03240000
    DO;                                                                 03250000
 /*   USER_FILE.DATA.OU_CODE = '0710000';             CHG0384A */       03260000
      USER_FILE.DATA.OU_CODE = '0710';                                  03270000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03280000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03290000
      CALL RCBBIFU_GET_TOW;                                             03300000
    END;                                                                03310000
                                                                        03320000
    WHEN('693')                       /*** FOR COUNTRY 693   *********/ 03330000
    DO;                                                                 03340000
 /*   USER_FILE.DATA.OU_CODE = '0400000';              CHG0384A */      03350000
      USER_FILE.DATA.OU_CODE = '0400';                                  03360000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03370000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03380000
      CALL RCBBIFU_GET_TOW;                                             03390000
    END;                                                                03400000
                                                                        03410000
    WHEN('704')                       /*** FOR COUNTRY 704   *********/ 03420000
    DO;                                                                 03430000
 /*   USER_FILE.DATA.OU_CODE = '0300000';              CHG0384A */      03440000
      USER_FILE.DATA.OU_CODE = '0300';                                  03450000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03460000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03470000
      CALL RCBBIFU_GET_TOW;                                             03480000
    END;                                                                03490000
                                                                        03500000
    WHEN('708')                       /*** FOR COUNTRY 708   *********/ 03510000
    DO;                                                                 03520000
 /*   USER_FILE.DATA.OU_CODE = '0100000';              CHG0384A */      03530000
      USER_FILE.DATA.OU_CODE = '0100';                                  03540000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03550000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03560000
      CALL RCBBIFU_GET_TOW;                                             03570000
    END;                                                                03580000
                                                                        03590000
    WHEN('740')                       /*** FOR COUNTRY 740   *********/ 03600000
    DO;                                                                 03610000
 /*   USER_FILE.DATA.OU_CODE = '0100000';              CHG0384A */      03620000
      USER_FILE.DATA.OU_CODE = '0100';                                  03630000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03640000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03650000
      CALL RCBBIFU_GET_TOW;                                             03660000
    END;                                                                03670000
                                                                        03680000
    WHEN('820')                       /*** FOR COUNTRY 820   *********/ 03690000
    DO;                                                                 03700000
 /*   USER_FILE.DATA.OU_CODE = '0100000';               CHG0384A */     03710000
      USER_FILE.DATA.OU_CODE = '1100';                                  03720000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03730000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03740000
      CALL RCBBIFU_GET_TOW;                                             03750000
    END;                                                                03760000
                                                                        03770000
    WHEN('821')                       /*** FOR COUNTRY 821   *********/ 03780000
    DO;                                                                 03790000
 /*   USER_FILE.DATA.OU_CODE = '1000000';              CHG0384A */      03800000
      USER_FILE.DATA.OU_CODE = '1000';                                  03810000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03820000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03830000
      CALL RCBBIFU_GET_TOW;                                             03840000
    END;                                                                03850000
                                                                        03860000
                                              /* R09-0221 START ****    03861000
    WHEN('358','359','363','651','603','607','626','694','695','699',   03870000
         '705','707','741','787','826','889') */                        03880000
    WHEN('358','359','363','603','607','626','651','694','695','699',   03881000
         '705','741','787','826')             /* REMOVED 707,889 ***/   03882000
                                              /* R09-0221 END   ****/   03883000
    DO;                                                                 03890000
      USER_FILE.DATA.OU_CODE = '       ';                               03900000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */03910000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            03920000
      CALL RCBBIFU_GET_TOW;                                             03930000
    END;                                                                03940000
                                                                        03950000
 /* REGION SOUTH START */                                               03960000
 /*  WHEN ('666','726','755','758','822','838','862') DO;         */    03970000
 /*     USER_FILE.DATA.TYPE_OF_MAINT = '2';                       */    03980000
 /*     CALL RCBBIFU_GET_TOW;   TYPE OF WARRANTY-C0079-0203       */    03990000
 /*IF PARM_INT_AREA.PROC_ID = 'UI13'    IMPOSTAZIONE OU_CODE PER  */    04000000
 /* | PARM_INT_AREA.PROC_ID = 'UI23'    MULTI COUNTRIES  10-03-03 */    04010000
 /*THEN DO */                                                           04020000
    WHEN ('758') DO;                                                    04030000
     PARM.OU_CODE = '6001'  ;                                           04040000
     CALL SELECT_FROM_T051 ;                                            04050000
    END;                                                                04060000
    WHEN ('838') DO;                                                    04070000
     PARM.OU_CODE = '8100'                        ;                     04080000
     CALL SELECT_FROM_T051 ;                                            04090000
     END;                                                               04100000
    WHEN ('822') DO;                                                    04110000
     PARM.OU_CODE = '0112'                        ;                     04120000
     CALL SELECT_FROM_T051 ;                                            04130000
    END;                                                                04140000
    WHEN ('755') DO;                                                    04150000
     PARM.OU_CODE = '8880'                        ;                     04160000
     CALL SELECT_FROM_T051 ;                                            04170000
    END;                                                                04180000
    WHEN ('726') DO;                                                    04190000
     PARM.OU_CODE = '1011'                        ;                     04200000
     CALL SELECT_FROM_T051 ;                                            04210000
    END;                                                                04220000
    WHEN ('666') DO;                                                    04230000
     PARM.OU_CODE = '9001'                        ;                     04240000
     CALL SELECT_FROM_T051 ;                                            04250000
    END;                                                                04260000
    WHEN ('862') DO;                                                    04270000
     PARM.OU_CODE = '9001'                        ;                     04280000
     CALL SELECT_FROM_T051 ;                                            04290000
    END;                                                                04300000
                                                                        04310000
 /* REGION SOUTH END   */                                               04320000
                                                                        04330000
 /* REGION NORTH START */                                               04340000
   WHEN ('754','864','788','866') DO;                                   04350000
      IF USER_FILE.DATA.TYPE_OF_MAINT ¬= 'G' THEN       /*  CHG0422B  */04360000
         USER_FILE.DATA.TYPE_OF_MAINT = '2';                            04370000
      CALL RCBBIFU_GET_TOW; /*TYPE OF WARRANTY-C0079-0203  */           04380000
   END;                                                                 04390000
                                                                        04400000
 /* REGION NORTH END   */                                               04410000
   OTHERWISE;                /**** FOR OTHER COUNTRIES             ****/04420000
                                                                        04430000
 END;              /**** SELECT (PARM_INT_AREA.COUNTRY_NUMBER);    ****/04440000
                                                                        04450000
                                                                        04460000
0/*******************************************************************/  04470000
 /* END COUNTRY SPECIFIC CODE                                       */  04480000
 /*******************************************************************/  04490000
                                                                        04500000
                                                                        04510000
                                         /* END USER DEFINED PROCESS */ 04520000
                                         /* RESET LEVEL              */ 04530000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            04540000
1/*******************************************************************/  04550000
 /*   ROWEST REGION INTERNAL PROCESSES                              */  04560000
 /*******************************************************************/  04570000
 SELECT_FROM_T051: PROC;                                                04580000
   USER_FILE.DEALER_NUMBER    = ' '                                ;    04590000
   TB_RCBV051                 = ''                                 ;    04600000
   TB_RCBV051_I               = ''                                 ;    04610000
   TB_RCBV051.COUNTRY_NUMBER  = USER_FILE.COUNTRY_NUMBER           ;    04620000
   TB_RCBV051.PRODUCT_TYPE    = USER_FILE.PRODUCT_TYPE             ;    04630000
   TB_RCBV051.SEQUENCE_NUMBER = USER_FILE.SEQUENCE_NUMBER          ;    04640000
   TB_RCBV051.ORIGIN          = USER_FILE.ORIGIN                   ;    04650000
   RETURN_AREA                = ''                                 ;    04660000
                                             /* RETRIEVE CURRENT ROW */ 04670000
   CALL RCBI82M (ADDR(TB_RCBV051)                         ,             04680000
                 ADDR(TB_RCBV051_I)                       ,             04690000
                 ADDR(RETURN_AREA)                        ,             04700000
                 PTR_INT_AREA)                            ;             04710000
                                                                        04720000
   SELECT (RETURN_AREA.RETURN_CODE)                       ;             04730000
     WHEN (0)                                                           04740000
     DO                                                   ;             04750000
        SELECT                                            ;             04760000
           WHEN(TB_RCBV051_I.INDNULL(17) < 0)       /*OU_CODE IS NULL*/ 04770000
           DO                                             ;             04780000
              USER_FILE.OU_CODE = PARM.OU_CODE            ;             04790000
           END                                            ;             04800000
           WHEN(TB_RCBV051.OU_CODE = ' '    )      /*OU_CODE IS BLANK*/ 04810000
           DO                                             ;             04820000
              USER_FILE.OU_CODE = PARM.OU_CODE            ;             04830000
           END                                            ;             04840000
           OTHERWISE                              /*OU_CODE IS VALID */ 04850000
           DO                                             ;             04860000
              USER_FILE.OU_CODE = TB_RCBV051.OU_CODE      ;             04870000
           END                                            ;             04880000
        END                                               ;             04890000
     END                                                  ;             04900000
     WHEN (4)                                  /*OU_CODE IS NOT FOUND*/ 04910000
     DO                                                   ;             04920000
        USER_FILE.OU_CODE = PARM.OU_CODE                  ;             04930000
     END                                                  ;             04940000
     OTHERWISE                                                          04950000
     DO                                                   ;             04960000
        PARM_INT_AREA.PTR_ERROR =  ADDR(RETURN_AREA.RETURN_SQL) ;       04970000
        PARM_INT_AREA.ERR_TYPE  = 'DB2'                   ;             04980000
        PARM_INT_AREA.CALL_ID   = '#999'                  ;             04990000
        CALL RCB0E1M (PTR_INT_AREA)                       ;             05000000
     END                                                  ;             05010000
   END                                                    ;             05020000
   USER_FILE.SERVICE_MODULE_4 = '1S' ;                   /* 28-05-02 */ 05030000
                                                                        05040000
   IF  USER_FILE.DATA.TYPE_OF_MAINT = ' '                /*2008-08-21*/ 05050000
          THEN  USER_FILE.DATA.TYPE_OF_MAINT = '2';                     05060000
                                                         /*2008-08-21*/ 05070000
 END SELECT_FROM_T051;                                                  05080000
 C706_OUCODES: PROCEDURE ;                                              05090000
 /*------------------------------------------------------------------*/ 05100000
 /*   SEARCH FOR OU_CODE                                     08/04/97*/ 05110000
 /*------------------------------------------------------------------*/ 05120000
      EDQ_ZIP_CODE     = USER_FILE.DATA.ZIP_CODE ;                      05130000
      EDQ_OU_CODE      = ' ' ;                                          05140000
                                                                        05150000
      CALL RCBZ00M (EDQ_ZIP_CODE,EDQ_OU_CODE,EDQ_FLAG_EDQ) ;            05160000
                                                                        05170000
      IF EDQ_OU_CODE ¬= ' ' THEN                                        05180000
         DO ;                     /* ZIP_CODE FOUND IN ZONE FILE */     05190000
            USER_FILE.DATA.OU_CODE = EDQ_OU_CODE ;                      05200000
         END;                                                           05210000
      ELSE                                                              05220000
         DO ;                     /* ZIP_CODE NOT FOUND IN ZONE  */     05230000
                                  /* FILE, SUBSTR ON SWP OU_CODE */     05240000
            USER_FILE.DATA.OU_CODE =                                    05250000
                                    SUBSTR(USER_FILE.DATA.OU_CODE,2,6); 05260000
         END;                                                           05270000
 END C706_OUCODES ;                  /* TRAITEMENT CTRY 706 (FRANCE) */ 05280000
                                                                        05290000
 /*------------------------------------------------------------------*/ 05300000
 /*   CALCULATE WARRANTY DATES ( GREENOCK USER EXIT )        NBA0804 */ 05310000
 /*------------------------------------------------------------------*/ 05320000
 SOUT_OUCODES: PROCEDURE ;                                              05330000
 /********************************************************************/ 05340000
                                                                        05350000
 /*------------------------------------------------------------------*/ 05360000
 /*   MODIFY ADDRESS LINES AND ZIP CODE                      NB1009  */ 05370000
 /*------------------------------------------------------------------*/ 05380000
    USER_FILE.DATA.ADDRESS_LINE_2 =                                     05390000
    SUBSTR(USER_FILE.DATA.ZIP_CODE,1,6) || ADDRESS_LINE_2 ;             05400000
    USER_FILE.DATA.ZIP_CODE       = ' ' ;                               05410000
    ZONE_ADDI = USER_FILE.DATA.ADDRESS_LINE_3 ;                         05420000
    ZONE_ADDO = ' ' ;                                                   05430000
    INDO = 1 ;                                                          05440000
    DO INDI = 1 TO 30 ;                                                 05450000
       IF TABI (INDI) ¬= ' ' THEN                                       05460000
          DO ;                                                          05470000
             TABO (INDO) = TABI(INDI) ;                                 05480000
             INDO = INDO + 1 ;                                          05490000
          END;                                                          05500000
    END;                                                                05510000
    USER_FILE.DATA.ADDRESS_LINE_3 = ZONE_ADDO ;                         05520000
 END SOUT_OUCODES ;                                                     05530000
                                                                        05540000
 RCBBIFU_GET_TOW: PROC;                                                 05550000
   /*  CHG0388G  CHNGES FOR QF 3.1AC  */                                05560000
   IF (USER_FILE.DATA.INSTALL_DATE = '' |                               05570000
       USER_FILE.DATA.WARRANTY_EXP_DATE = '')                           05580000
   THEN                                                                 05590000
     DO;                                                                05600000
       USER_FILE.DATA.TYPE_OF_WARRANTY = '';                            05610000
     END;                                                               05620000
   ELSE                                                                 05630000
  DO;                                                                   05640000
   /*  CHG0388G  CHNGES FOR QF 3.1AC  */                                05650000
    PIC7_1 = '00000900' ;                  /* BEGINNING C0026-0501 */   05660000
    PIC7_2 = '00010330' ;                                               05670000
    PICN_1 = '00020900' ;                                               05680000
    PICN_2 = '00030330' ;                                               05690000
    WRK_INSTALL_DATE = USER_FILE.DATA.INSTALL_DATE;                     05700000
    WRK_EXP_DATE     = USER_FILE.DATA.WARRANTY_EXP_DATE ;               05710000
                                /* CALCULATE WARR_EXP_DATE  */          05720000
    PTR_DATE_AREA      = ADDR(DATE_AREA);   /* DEBUT MODIF.NB0010*/     05730000
    DATE_AREA                   = '';                                   05740000
    DATE_AREA.WD_IN_FORMAT      = 'ISO';                                05750000
    DATE_AREA.WD_OUT_FORMAT     = 'ISO';                                05760000
    DATE_AREA.WD_FUNCTION       = 'D';                                  05770000
    /* 'M' <=> WD_PERIOD WILL BE GIVEN IN MONTH */                      05780000
    DATE_AREA.WD_PERIOD_TYPE    = 'M';                                  05790000
    DATE_AREA.WD_IN_DATE        = WRK_EXP_DATE ;                        05800000
    DATE_AREA.WD_IN_DATE_2      = WRK_INSTALL_DATE ;                    05810000
                                                                        05820000
    /*DATE_AREA.WD_IN_DATE_2      = WRK_EXP_DATE */                     05830000
    /*DATE_AREA.WD_IN_DATE        = WRK_INSTALL_DATE */                 05840000
                                                                        05850000
    CALL RCB004M (PTR_DATE_AREA);                                       05860000
                                                                        05870000
    WD_PIC = SUBSTR(DATE_AREA.WD_OUT_DATE,1,4) ||                       05880000
             SUBSTR(DATE_AREA.WD_OUT_DATE,6,2) ||                       05890000
             SUBSTR(DATE_AREA.WD_OUT_DATE,9,2) ;                        05900000
                                                                        05910000
    IF DATE_AREA.WD_STATUS ¬= ' '                                       05920000
    THEN                                                                05930000
        CALL RCBBIFU_ERROR (NULL, 'OTHER', '#002');                     05940000
    ELSE                                                                05950000
      DO ;                                                              05960000
       IF USER_FILE.DATA.TYPE_OF_WARRANTY ¬= 'C'         /* CHG0447A  */05970000
       THEN                                              /* CHG0447A  */05980000
        DO;                                              /* CHG0447A  */05990000
          IF WD_PIC >= PIC7_1 &                                         06000000
             WD_PIC <= PIC7_2                                           06010000
          THEN                                                          06020000
             USER_FILE.DATA.TYPE_OF_WARRANTY = '7' ;                    06030000
                                                                        06040000
          IF WD_PIC >= PICN_1 &                                         06050000
             WD_PIC <= PICN_2                                           06060000
          THEN                                                          06070000
             USER_FILE.DATA.TYPE_OF_WARRANTY = 'N' ;                    06080000
        END ;                                            /* CHG0447A  */06090000
      END ;                                  /* END  OF    C0026-0501 */06100000
   /*  CHG0388G  CHNGES FOR QF 3.1AC  */                                06110000
  END;                                                                  06120000
   /*  CHG0388G  CHNGES FOR QF 3.1AC  */                                06130000
 END RCBBIFU_GET_TOW;                                                   06140000
                                                                        06150000
 /********************************************************************/ 06160000
 /*                                                                  */ 06170000
 /* MODULE NAME      : RCBBIFU_ERROR                                 */ 06180000
 /*                                                                  */ 06190000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE                */ 06200000
 /*                                                                  */ 06210000
 /********************************************************************/ 06220000
 RCBBIFU_ERROR: PROC (PTR_ERROR,                                        06230000
                      ERR_TYPE,                                         06240000
                      CALL_ID);                                         06250000
                                                                        06260000
 DCL PTR_ERROR             PTR;                                         06270000
 DCL ERR_TYPE              CHAR (8);                                    06280000
 DCL CALL_ID               CHAR (4);                                    06290000
                                                                        06300000
 PARM_INT_AREA.PTR_ERROR = PTR_ERROR;                                   06310000
 PARM_INT_AREA.ERR_TYPE  = ERR_TYPE;                                    06320000
 PARM_INT_AREA.CALL_ID   = CALL_ID;                                     06330000
                                                                        06340000
 /**/PUT SKIP LIST(PARM_INT_AREA);                                      06350000
 CALL RCB0E1M (PTR_INT_AREA);                                           06360000
                                                                        06370000
 END RCBBIFU_ERROR;                                                     06380000
                                                                        06390000
 RCBBIFU_HANDLE_SPECIAL_CHAR: PROC;                  /***SOC P594 ***/  06391061
                                                     /*CUSTOMER_NAME*/  06391161
      R = ''; X = '';C = '0';T = '0';                                   06391256
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'&AMP;');                  06391356
      DO WHILE(T > C);                                                  06391456
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'&AMP;');                06391556
        IF R ¬= 0 THEN DO;                                              06391756
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06391856
                 '&'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+5);         06391955
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06392056
        C=C+1;                                                          06392156
        END;                                                            06392256
      END;                                                              06392356
                                                                        06392455
      R = ''; X = '';C = '0';T = '0';                                   06392556
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'&#40;');                  06392656
      DO WHILE(T > C);                                                  06392756
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'&#40;');                06392856
        IF R ¬= 0 THEN DO;                                              06392956
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06393056
                 '('||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+5);         06393156
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06393256
        C=C+1;                                                          06393356
        END;                                                            06393456
      END;                                                              06393556
                                                                        06393656
      R = ''; X = '';C = '0';T = '0';                                   06393756
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'&#41;');                  06393856
      DO WHILE(T > C);                                                  06393956
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'&#41;');                06394056
        IF R ¬= 0 THEN DO;                                              06394156
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06394256
                 ')'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+5);         06394356
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06394456
        C=C+1;                                                          06394556
        END;                                                            06394656
      END;                                                              06394756
                                                                        06394856
      R = ''; X = '';C = '0';T = '0';                                   06394956
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'&#43;');                  06395056
      DO WHILE(T > C);                                                  06395156
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'&#43;');                06395256
        IF R ¬= 0 THEN DO;                                              06395356
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06395456
                 '+'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+5);         06395556
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06395656
        C=C+1;                                                          06395756
        END;                                                            06395856
      END;                                                              06395956
                                                                        06398856
      R = ''; X = '';C = '0';T = '0';                                   06398956
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'ä');                      06399056
      DO WHILE(T > C);                                                  06399156
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'ä');                    06399256
        IF R ¬= 0 THEN DO;                                              06399356
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06399456
                 'AE'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+1);        06399556
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06399656
        C=C+1;                                                          06399756
        END;                                                            06399856
      END;                                                              06399956
                                                                        06400056
      R = ''; X = '';C = '0';T = '0';                                   06400156
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'Ü');                      06400256
      DO WHILE(T > C);                                                  06400356
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'Ü');                    06400456
        IF R ¬= 0 THEN DO;                                              06400556
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06400656
                 'UE'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+1);        06400756
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06400856
        C=C+1;                                                          06400956
        END;                                                            06401056
      END;                                                              06401156
                                                                        06401256
      R = ''; X = '';C = '0';T = '0';                                   06401356
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'ö');                      06401456
      DO WHILE(T > C);                                                  06401556
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'ö');                    06401656
        IF R ¬= 0 THEN DO;                                              06401756
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06401856
                 'OE'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+1);        06401956
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06402056
        C=C+1;                                                          06402156
        END;                                                            06402256
      END;                                                              06402356
                                                                        06402456
      R = ''; X = '';C = '0';T = '0';                                   06402556
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'ü');                      06402656
      DO WHILE(T > C);                                                  06402756
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'ü');                    06402856
        IF R ¬= 0 THEN DO;                                              06402956
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06403056
                 'UE'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+1);        06403156
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06403256
        C=C+1;                                                          06403356
        END;                                                            06403456
      END;                                                              06403556
                                                                        06403656
      R = ''; X = '';C = '0';T = '0';                                   06403756
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'ß');                      06403856
      DO WHILE(T > C);                                                  06403956
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'ß');                    06404056
        IF R ¬= 0 THEN DO;                                              06404156
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06404256
                 'SS'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+1);        06404356
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06404456
        C=C+1;                                                          06404556
        END;                                                            06404656
      END;                                                              06404756
                                                                        06404856
      R = ''; X = '';C = '0';T = '0';                                   06408456
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'Ã');                     06408562
      DO WHILE(T > C);                                                  06408656
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'Ã');                   06408762
        IF R ¬= 0 THEN DO;                                              06408856
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06408956
                 'UE'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+2);        06409056
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06409156
        C=C+1;                                                          06409256
        END;                                                            06409356
      END;                                                              06409456
                                                                        06409556
      R = ''; X = '';C = '0';T = '0';                                   06409656
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,']Å');                     06409756
      DO WHILE(T > C);                                                  06409856
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,']Å');                   06409956
        IF R ¬= 0 THEN DO;                                              06410056
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06410156
                 'UE'||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+2);        06410256
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06410356
        C=C+1;                                                          06410456
        END;                                                            06410556
      END;                                                              06410656
                                                                        06410761
      R = ''; X = '';C = '0';T = '0';                                   06410861
      T = TALLY(USER_FILE.DATA.CUSTOMER_NAME,'&#59;');                  06410961
      DO WHILE(T > C);                                                  06411061
        R = INDEX(USER_FILE.DATA.CUSTOMER_NAME,'&#59;');                06411161
        IF R ¬= 0 THEN DO;                                              06411261
        Y = SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,1,R-1)||                06411361
                  ' '||SUBSTR(USER_FILE.DATA.CUSTOMER_NAME,R+5);        06411463
        USER_FILE.DATA.CUSTOMER_NAME = Y;                               06411561
        C=C+1;                                                          06411661
        END;                                                            06411761
      END;                                                              06411861
                                                                        06411961
                                                    /*ADDRESS_LINE_1*/  06412061
      R = ''; X = '';C = '0';T = '0';                                   06412161
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'&AMP;');                 06412261
      DO WHILE(T > C);                                                  06412361
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'&AMP;');               06412461
        IF R ¬= 0 THEN DO;                                              06412561
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06412661
                 '&'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+5);        06412761
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06412861
        C=C+1;                                                          06412961
        END;                                                            06413061
      END;                                                              06413161
                                                                        06413261
      R = ''; X = '';C = '0';T = '0';                                   06413361
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'&#40;');                 06413461
      DO WHILE(T > C);                                                  06413561
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'&#40;');               06413661
        IF R ¬= 0 THEN DO;                                              06413761
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06413861
                 '('||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+5);        06413961
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06414061
        C=C+1;                                                          06414161
        END;                                                            06414261
      END;                                                              06414361
                                                                        06414461
      R = ''; X = '';C = '0';T = '0';                                   06414561
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'&#41;');                 06414661
      DO WHILE(T > C);                                                  06414761
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'&#41;');               06414861
        IF R ¬= 0 THEN DO;                                              06414961
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06415061
                 ')'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+5);        06415161
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06415261
        C=C+1;                                                          06415361
        END;                                                            06415461
      END;                                                              06415561
                                                                        06415661
      R = ''; X = '';C = '0';T = '0';                                   06415761
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'&#43;');                 06415861
      DO WHILE(T > C);                                                  06415961
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'&#43;');               06416061
        IF R ¬= 0 THEN DO;                                              06416161
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06416261
                 '+'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+5);        06416361
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06416461
        C=C+1;                                                          06416561
        END;                                                            06416661
      END;                                                              06416761
                                                                        06416861
      R = ''; X = '';C = '0';T = '0';                                   06416961
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'ä');                     06417061
      DO WHILE(T > C);                                                  06417161
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'ä');                   06417261
        IF R ¬= 0 THEN DO;                                              06417361
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06417461
                 'AE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+1);       06417561
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06417661
        C=C+1;                                                          06417761
        END;                                                            06417861
      END;                                                              06417961
                                                                        06418061
      R = ''; X = '';C = '0';T = '0';                                   06418161
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'Ü');                     06418261
      DO WHILE(T > C);                                                  06418361
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'Ü');                   06418461
        IF R ¬= 0 THEN DO;                                              06418561
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06418661
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+1);       06418761
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06418861
        C=C+1;                                                          06418961
        END;                                                            06419061
      END;                                                              06419161
                                                                        06419261
      R = ''; X = '';C = '0';T = '0';                                   06419361
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'ö');                     06419461
      DO WHILE(T > C);                                                  06419561
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'ö');                   06419661
        IF R ¬= 0 THEN DO;                                              06419761
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06419861
                 'OE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+1);       06419961
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06420061
        C=C+1;                                                          06420161
        END;                                                            06420261
      END;                                                              06420361
                                                                        06420461
      R = ''; X = '';C = '0';T = '0';                                   06420561
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'ü');                     06420661
      DO WHILE(T > C);                                                  06420761
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'ü');                   06420861
        IF R ¬= 0 THEN DO;                                              06420961
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06421061
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+1);       06421161
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06421261
        C=C+1;                                                          06421361
        END;                                                            06421461
      END;                                                              06421561
                                                                        06421661
      R = ''; X = '';C = '0';T = '0';                                   06421761
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'ß');                     06421861
      DO WHILE(T > C);                                                  06421961
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'ß');                   06422061
        IF R ¬= 0 THEN DO;                                              06422161
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06422261
                 'SS'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+1);       06422361
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06422461
        C=C+1;                                                          06422561
        END;                                                            06422661
      END;                                                              06422761
                                                                        06422861
      R = ''; X = '';C = '0';T = '0';                                   06422961
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'Ã');                    06423062
      DO WHILE(T > C);                                                  06423161
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'Ã');                  06423262
        IF R ¬= 0 THEN DO;                                              06423361
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06423461
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+2);       06423561
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06423661
        C=C+1;                                                          06423761
        END;                                                            06423861
      END;                                                              06423961
                                                                        06424061
      R = ''; X = '';C = '0';T = '0';                                   06424161
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,']Å');                    06424261
      DO WHILE(T > C);                                                  06424361
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,']Å');                  06424461
        IF R ¬= 0 THEN DO;                                              06424561
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06424661
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+2);       06424761
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06424861
        C=C+1;                                                          06424961
        END;                                                            06425061
      END;                                                              06425161
                                                                        06425261
      R = ''; X = '';C = '0';T = '0';                                   06425361
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_1,'&#59;');                 06425461
      DO WHILE(T > C);                                                  06425561
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_1,'&#59;');               06425661
        IF R ¬= 0 THEN DO;                                              06425761
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,1,R-1)||               06425861
                  ' '||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_1,R+5);       06425963
        USER_FILE.DATA.ADDRESS_LINE_1 = Y;                              06426061
        C=C+1;                                                          06426161
        END;                                                            06426261
      END;                                                              06426361
                                                                        06426461
                                                    /*ADDRESS_LINE_2*/  06426561
      R = ''; X = '';C = '0';T = '0';                                   06426661
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'&AMP;');                 06426761
      DO WHILE(T > C);                                                  06426861
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'&AMP;');               06426961
        IF R ¬= 0 THEN DO;                                              06427061
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06427161
                 '&'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+5);        06427261
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06427361
        C=C+1;                                                          06427461
        END;                                                            06427561
      END;                                                              06427661
                                                                        06427761
      R = ''; X = '';C = '0';T = '0';                                   06427861
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'&#40;');                 06427961
      DO WHILE(T > C);                                                  06428061
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'&#40;');               06428161
        IF R ¬= 0 THEN DO;                                              06428261
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06428361
                 '('||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+5);        06428461
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06428561
        C=C+1;                                                          06428661
        END;                                                            06428761
      END;                                                              06428861
                                                                        06428961
      R = ''; X = '';C = '0';T = '0';                                   06429061
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'&#41;');                 06429161
      DO WHILE(T > C);                                                  06429261
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'&#41;');               06429361
        IF R ¬= 0 THEN DO;                                              06429461
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06429561
                 ')'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+5);        06429661
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06429761
        C=C+1;                                                          06429861
        END;                                                            06429961
      END;                                                              06430061
                                                                        06430161
      R = ''; X = '';C = '0';T = '0';                                   06430261
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'&#43;');                 06430361
      DO WHILE(T > C);                                                  06430461
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'&#43;');               06430561
        IF R ¬= 0 THEN DO;                                              06430661
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06430761
                 '+'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+5);        06430861
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06430961
        C=C+1;                                                          06431061
        END;                                                            06431161
      END;                                                              06431261
                                                                        06431361
      R = ''; X = '';C = '0';T = '0';                                   06431461
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'ä');                     06431561
      DO WHILE(T > C);                                                  06431661
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'ä');                   06431761
        IF R ¬= 0 THEN DO;                                              06431861
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06431961
                 'AE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+1);       06432061
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06432161
        C=C+1;                                                          06432261
        END;                                                            06432361
      END;                                                              06432461
                                                                        06432561
      R = ''; X = '';C = '0';T = '0';                                   06432661
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'Ü');                     06432761
      DO WHILE(T > C);                                                  06432861
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'Ü');                   06432961
        IF R ¬= 0 THEN DO;                                              06433061
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06433161
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+1);       06433261
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06433361
        C=C+1;                                                          06433461
        END;                                                            06433561
      END;                                                              06433661
                                                                        06433761
      R = ''; X = '';C = '0';T = '0';                                   06433861
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'ö');                     06433961
      DO WHILE(T > C);                                                  06434061
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'ö');                   06434161
        IF R ¬= 0 THEN DO;                                              06434261
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06434361
                 'OE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+1);       06434461
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06434561
        C=C+1;                                                          06434661
        END;                                                            06434761
      END;                                                              06434861
                                                                        06434961
      R = ''; X = '';C = '0';T = '0';                                   06435061
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'ü');                     06435161
      DO WHILE(T > C);                                                  06435261
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'ü');                   06435361
        IF R ¬= 0 THEN DO;                                              06435461
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06435561
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+1);       06435661
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06435761
        C=C+1;                                                          06435861
        END;                                                            06435961
      END;                                                              06436061
                                                                        06436161
      R = ''; X = '';C = '0';T = '0';                                   06436261
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'ß');                     06436361
      DO WHILE(T > C);                                                  06436461
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'ß');                   06436561
        IF R ¬= 0 THEN DO;                                              06436661
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06436761
                 'SS'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+1);       06436861
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06436961
        C=C+1;                                                          06437061
        END;                                                            06437161
      END;                                                              06437261
                                                                        06437361
      R = ''; X = '';C = '0';T = '0';                                   06437461
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'Ã');                    06437562
      DO WHILE(T > C);                                                  06437661
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'Ã');                  06437762
        IF R ¬= 0 THEN DO;                                              06437861
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06437961
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+2);       06438061
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06438161
        C=C+1;                                                          06438261
        END;                                                            06438361
      END;                                                              06438461
                                                                        06438561
      R = ''; X = '';C = '0';T = '0';                                   06438661
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,']Å');                    06438761
      DO WHILE(T > C);                                                  06438861
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,']Å');                  06438961
        IF R ¬= 0 THEN DO;                                              06439061
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06439161
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+2);       06439261
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06439361
        C=C+1;                                                          06439461
        END;                                                            06439561
      END;                                                              06440061
                                                                        06457357
      R = ''; X = '';C = '0';T = '0';                                   06457461
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_2,'&#59;');                 06457561
      DO WHILE(T > C);                                                  06457661
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_2,'&#59;');               06457761
        IF R ¬= 0 THEN DO;                                              06457861
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,1,R-1)||               06457961
                  ' '||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_2,R+5);       06458063
        USER_FILE.DATA.ADDRESS_LINE_2 = Y;                              06458161
        C=C+1;                                                          06458261
        END;                                                            06458361
      END;                                                              06458461
                                                                        06458561
                                                    /*ADDRESS_LINE_3*/  06458661
      R = ''; X = '';C = '0';T = '0';                                   06458761
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'&AMP;');                 06458861
      DO WHILE(T > C);                                                  06458961
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'&AMP;');               06459061
        IF R ¬= 0 THEN DO;                                              06459161
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06459261
                 '&'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+5);        06459361
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06459461
        C=C+1;                                                          06459561
        END;                                                            06459661
      END;                                                              06459761
                                                                        06459861
      R = ''; X = '';C = '0';T = '0';                                   06459961
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'&#40;');                 06460061
      DO WHILE(T > C);                                                  06460161
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'&#40;');               06460261
        IF R ¬= 0 THEN DO;                                              06460361
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06460461
                 '('||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+5);        06460561
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06460661
        C=C+1;                                                          06460761
        END;                                                            06460861
      END;                                                              06460961
                                                                        06461061
      R = ''; X = '';C = '0';T = '0';                                   06461161
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'&#41;');                 06461261
      DO WHILE(T > C);                                                  06461361
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'&#41;');               06461461
        IF R ¬= 0 THEN DO;                                              06461561
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06461661
                 ')'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+5);        06461761
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06461861
        C=C+1;                                                          06461961
        END;                                                            06462061
      END;                                                              06462161
                                                                        06462261
      R = ''; X = '';C = '0';T = '0';                                   06462361
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'&#43;');                 06462461
      DO WHILE(T > C);                                                  06462561
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'&#43;');               06462661
        IF R ¬= 0 THEN DO;                                              06462761
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06462861
                 '+'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+5);        06462961
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06463061
        C=C+1;                                                          06463161
        END;                                                            06463261
      END;                                                              06463361
                                                                        06463461
      R = ''; X = '';C = '0';T = '0';                                   06463561
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'ä');                     06463661
      DO WHILE(T > C);                                                  06463761
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'ä');                   06463861
        IF R ¬= 0 THEN DO;                                              06463961
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06464061
                 'AE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+1);       06464161
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06464261
        C=C+1;                                                          06464361
        END;                                                            06464461
      END;                                                              06464561
                                                                        06464661
      R = ''; X = '';C = '0';T = '0';                                   06464761
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'Ü');                     06464861
      DO WHILE(T > C);                                                  06464961
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'Ü');                   06465061
        IF R ¬= 0 THEN DO;                                              06465161
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06465261
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+1);       06465361
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06465461
        C=C+1;                                                          06465561
        END;                                                            06465661
      END;                                                              06465761
                                                                        06465861
      R = ''; X = '';C = '0';T = '0';                                   06465961
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'ö');                     06466061
      DO WHILE(T > C);                                                  06466161
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'ö');                   06466261
        IF R ¬= 0 THEN DO;                                              06466361
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06466461
                 'OE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+1);       06466561
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06466661
        C=C+1;                                                          06466761
        END;                                                            06466861
      END;                                                              06466961
                                                                        06467061
      R = ''; X = '';C = '0';T = '0';                                   06467161
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'ü');                     06467261
      DO WHILE(T > C);                                                  06467361
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'ü');                   06467461
        IF R ¬= 0 THEN DO;                                              06467561
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06467661
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+1);       06467761
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06467861
        C=C+1;                                                          06467961
        END;                                                            06468061
      END;                                                              06468161
                                                                        06468261
      R = ''; X = '';C = '0';T = '0';                                   06468361
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'ß');                     06468461
      DO WHILE(T > C);                                                  06468561
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'ß');                   06468661
        IF R ¬= 0 THEN DO;                                              06468761
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06468861
                 'SS'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+1);       06468961
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06469061
        C=C+1;                                                          06469161
        END;                                                            06469261
      END;                                                              06469361
                                                                        06469461
      R = ''; X = '';C = '0';T = '0';                                   06469561
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'Ã');                    06469662
      DO WHILE(T > C);                                                  06469761
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'Ã');                  06469862
        IF R ¬= 0 THEN DO;                                              06469961
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06470061
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+2);       06470161
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06470261
        C=C+1;                                                          06470361
        END;                                                            06470461
      END;                                                              06470561
                                                                        06470661
      R = ''; X = '';C = '0';T = '0';                                   06470761
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,']Å');                    06470861
      DO WHILE(T > C);                                                  06470961
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,']Å');                  06471061
        IF R ¬= 0 THEN DO;                                              06471161
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06471261
                 'UE'||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+2);       06471361
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06471461
        C=C+1;                                                          06471561
        END;                                                            06471661
      END;                                                              06471761
                                                                        06471861
      R = ''; X = '';C = '0';T = '0';                                   06471961
      T = TALLY(USER_FILE.DATA.ADDRESS_LINE_3,'&#59;');                 06472061
      DO WHILE(T > C);                                                  06472161
        R = INDEX(USER_FILE.DATA.ADDRESS_LINE_3,'&#59;');               06472261
        IF R ¬= 0 THEN DO;                                              06472361
        Y = SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,1,R-1)||               06472461
                  ' '||SUBSTR(USER_FILE.DATA.ADDRESS_LINE_3,R+5);       06472563
        USER_FILE.DATA.ADDRESS_LINE_3 = Y;                              06472661
        C=C+1;                                                          06472761
        END;                                                            06472861
      END;                                                              06472961
                                                                        06473061
 END RCBBIFU_HANDLE_SPECIAL_CHAR;                    /***EOC P594 ***/  06473161
1/*******************************************************************/  06473261
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  06473361
 /*******************************************************************/  06473461
  %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  06473561
 $DAIMOD (RCBBIFU);                      /* MODULE TO BE COMPILED   */  06473661
 /*******************************************************************/  06473761
 /* END OF ABR BLOCK                                                */  06473800
 /*******************************************************************/  06474000
 END RCBBIFU;                                                           06480000