 /* RCBBCZM - MERGE HW INVERNTORY DATA FROM IBASE AND SOF/WTAAS      */
 /*                                                                  */
 /********************************************************************/
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */
 /********************************************************************/
 /*                                                                  */
 /* MODULE           : RCBBCZM                                       */
 /*                                                                  */
 /* PROGRAM          : RCBBCZP                                       */
 /*                                                                  */
 /* LANGUAGE         : PLI                                           */
 /*                                                                  */
 /* TYPE             : BATCH                                         */
 /*                                                                  */
 /* DESCRIPTION      : RETRIEVE HW INVENTORY DATA FROM IBASE AND     */
 /*                    SOF/WTAAS, MERGE THE DATA AND CREATE TABLE    */
 /*                    LIKE FILES.                                   */
 /*                                                                  */
 /* INPUT            : - FILES : RCBBS16 HW PRODUCT (S1 - IBASE)     */
 /*                              RCBBS17 MES ORDER                   */
 /*                              RCBBS18 HW STATUS                   */
 /*                              RCBBS19 OU/HW                       */
 /*                              RCBBS1A HW/CUSTOMER                 */
 /*                              RCBBS1B SUPPLY CONTR.               */
 /*                              RCBBS1C MES ORDER/HW                */
 /*                              RCBBS1D HW PO / ORDER               */
 /*                              RCBBS1E HW PO REAL.                 */
 /*                              RCBBS1F FEATURES                    */
 /*                              RCBBS1G MES ORDER/HW PO IN ORDER    */
 /*                              RCBBS1H HW MOD. INFO                */
 /*                                                                  */
 /*                              RCBBS26 HW PRODUCT (S2 - SOF/WTAAS) */
 /*                              RCBBS27 MES ORDER                   */
 /*                              RCBBS28 HW STATUS                   */
 /*                              RCBBS29 OU/HW                       */
 /*                              RCBBS2A HW/CUSTOMER                 */
 /*                              RCBBS2B SUPPLY CONTR.               */
 /*                              RCBBS2C MES ORDER/HW                */
 /*                              RCBBS2D HW PO / ORDER               */
 /*                              RCBBS2E HW PO REAL.                 */
 /*                              RCBBS2F FEATURES                    */
 /*                              RCBBS2G MES ORDER/HW PO IN ORDER    */
 /*                              RCBBS2H HW MOD. INFO                */
 /*                                                                  */
 /*                    - DB2   : RCBV0500_PARM                       */
 /*                                                                  */
 /* OUTPUT           : - FILES : RCBBCA0 HW PRODUCT                  */
 /*                              RCBBCA1 MES ORDER                   */
 /*                              RCBBCA2 HW STATUS                   */
 /*                              RCBBCA3 OU/HW                       */
 /*                              RCBBCA4 HW/CUSTOMER                 */
 /*                              RCBBCA5 SUPPLY CONTR.               */
 /*                              RCBBCA6 MES ORDER/HW                */
 /*                              RCBBCA7 HW PO / ORDER               */
 /*                              RCBBCA8 HW PO REAL.                 */
 /*                              RCBBCA9 FEATURES                    */
 /*                              RCBBCAA MES ORDER/HW PO IN ORDER    */
 /*                              RCBBCAB HW MOD. INFO                */
 /*                              RCB0M10 MESSAGES ISSUED             */
 /*                                                                  */
 /* EXTERNAL MODULES : RCB0M1M - MESSAGE MODULE                      */
 /*                    RCB0E1M - ERROR MODULE                        */
 /*                    RCB0T1M - RETRIEVE SYSTEM DATE                */
 /*                    RCBI50M - GET PARAMETER                       */
 /*                    RCBG50M - UPDATE PARAMETER                    */
 /*                    RCB018M - CALCULATE HASH TOTAL                */
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */
 /*                                                                  */
 /* MESSAGES         : 0003,0004,0005,0007,0013,0014,0017,0018,      */
 /*                    0167,0173,0174,0175,9999                      */
 /*                                                                  */
 /* DEPENDENCIES     : RCBBCAM/RCBBOAM MODULE HAS TO BE RUN PRIOR    */
 /*                    TO RUNNING THIS MODULE                        */
 /*                                                                  */
 /* FREQUENCY        : USER DEPENDENT (ON REQUEST)                   */
 /*                                                                  */
 /* MAINTENANCE LOG  :                                               */
 /* ---------------                                                  */
 /*                                                                  */
 /* DATE       | WORK-ITEMNO. | DESCRIPTION                          */
 /* ---------------------------------------------------------------  */
 /* 2012-05-10 | RC01318      | PCR PCEDSP-0216:SUPPORT ADDITIONAL   */
 /*            |              | SOURCE FOR INVENTORY                 */
 /********************************************************************/
1RCBBCZM: PROC
          OPTIONS (MAIN)
          REORDER;
0/********************************************************************/
 /* FILE DECLARATIONS (NON GSAM)                                     */
 /********************************************************************/
0DCL RCBBS16  FILE RECORD INPUT;         /* HW PRODUCT FILE          */
0DCL RCBBS26  FILE RECORD INPUT;
0DCL RCBBS17  FILE RECORD INPUT;         /* MES ORDER FILE           */
0DCL RCBBS27  FILE RECORD INPUT;
0DCL RCBBS18  FILE RECORD INPUT;         /* HW STATUS FILE           */
0DCL RCBBS28  FILE RECORD INPUT;
0DCL RCBBS19  FILE RECORD INPUT;         /* OU/HW FILE               */
0DCL RCBBS29  FILE RECORD INPUT;
0DCL RCBBS1A  FILE RECORD INPUT;         /* HW/CUSTOMER FILE         */
0DCL RCBBS2A  FILE RECORD INPUT;
0DCL RCBBS1B  FILE RECORD INPUT;         /* SUPPLY CONTR FILE        */
0DCL RCBBS2B  FILE RECORD INPUT;
0DCL RCBBS1C  FILE RECORD INPUT;         /* MES ORDER/HW FILE        */
0DCL RCBBS2C  FILE RECORD INPUT;
0DCL RCBBS1D  FILE RECORD INPUT;         /* HW PO / ORDER FILE       */
0DCL RCBBS2D  FILE RECORD INPUT;
0DCL RCBBS1E  FILE RECORD INPUT;         /* HW PO REAL FILE          */
0DCL RCBBS2E  FILE RECORD INPUT;
0DCL RCBBS1F  FILE RECORD INPUT;         /* FEATURES FILE            */
0DCL RCBBS2F  FILE RECORD INPUT;
0DCL RCBBS1G  FILE RECORD INPUT;         /* MES ORDER/HW PO FILE     */
0DCL RCBBS2G  FILE RECORD INPUT;
0DCL RCBBS1H  FILE RECORD INPUT;         /* HW MOD. INFO FILE        */
0DCL RCBBS2H  FILE RECORD INPUT;
0DCL RCBPROC  FILE RECORD INPUT;         /* INPUT CARD FOR PROC_ID   */
0DCL RCBBCA0  FILE RECORD OUTPUT;        /* MERGED HW PRODUCT FILE   */
0DCL RCBBCA1  FILE RECORD OUTPUT;        /* MERGED MES ORDER FILE    */
0DCL RCBBCA2  FILE RECORD OUTPUT;        /* MERGED HW STATUS FILE    */
0DCL RCBBCA3  FILE RECORD OUTPUT;        /* MERGED OU/HW FILE        */
0DCL RCBBCA4  FILE RECORD OUTPUT;        /* MERGED HW/CUSTOMER FILE  */
0DCL RCBBCA5  FILE RECORD OUTPUT;        /* MERGED SUPPLY CONTR FILE */
0DCL RCBBCA6  FILE RECORD OUTPUT;        /* MERGED MES ORDER/HW FILE */
0DCL RCBBCA7  FILE RECORD OUTPUT;        /* MERGED HW PO / ORDER FILE*/
0DCL RCBBCA8  FILE RECORD OUTPUT;        /* MERGED HW PO REAL FILE   */
0DCL RCBBCA9  FILE RECORD OUTPUT;        /* MERGED FEATURES FILE     */
0DCL RCBBCAA  FILE RECORD OUTPUT;        /* MERGED MES ORDER/HW FILE */
0DCL RCBBCAB  FILE RECORD OUTPUT;        /* MERGED HW MOD. INFO FILE */
0/********************************************************************/
 /* RECORD STRUCTURES FOR INPUT FILES                                */
 /********************************************************************/
 /*                                                                  */
0DCL IOAREA0           CHAR(75);     /* IOAREA IBASE HW-PRODUCT FILE */
 DCL 1 RCBBS16_H     BASED(ADDR(IOAREA0)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS16_T     BASED(ADDR(IOAREA0)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS16_HW    BASED(ADDR(IOAREA0)),
       %INCLUDE RCBBAAS1;,
      3 RCB050S,
        %INCLUDE RCB050S;,
      3 RCB050SI,
        %INCLUDE RCB050SI;;

 DCL IOAREA1           CHAR(75);  /* IOAREA SOF/WTAAS HW-PRODUCT FILE */
 DCL 1 RCBBS26_H     BASED(ADDR(IOAREA1)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS26_T     BASED(ADDR(IOAREA1)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS26_HW    BASED(ADDR(IOAREA1)),
       %INCLUDE RCBBAAS1;,
      3 RCB050S,
        %INCLUDE RCB050S;,
      3 RCB050SI,
        %INCLUDE RCB050SI;;
                                   /*   IOAREA MERGE HW-PRODUCT FILE */
 DCL IOAREA2           CHAR(75);
 DCL 1 RCBBCA0_H     BASED(ADDR(IOAREA2)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA0_T     BASED(ADDR(IOAREA2)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA0_HW    BASED(ADDR(IOAREA2)),
       %INCLUDE RCBBAAS1;,
      3 RCB050S,
        %INCLUDE RCB050S;,
      3 RCB050SI,
        %INCLUDE RCB050SI;;
0                                     /* IOAREA IBASE MES-ORDER FILE */
 DCL IOAREA3        CHAR(46);
 DCL 1 RCBBS17_H    BASED(ADDR(IOAREA3)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS17_T    BASED(ADDR(IOAREA3)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS17_HW   BASED(ADDR(IOAREA3)),
       %INCLUDE RCBBAAS1;,
      3 RCB100S,
        %INCLUDE RCB100S;,
      3 RCB100SI,
        %INCLUDE RCB100SI;;
                                  /* IOAREA SOF/WTAAS MES-ORDER FILE */
 DCL IOAREA4        CHAR(46);
 DCL 1 RCBBS27_H    BASED(ADDR(IOAREA4)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS27_T    BASED(ADDR(IOAREA4)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS27_HW   BASED(ADDR(IOAREA4)),
       %INCLUDE RCBBAAS1;,
      3 RCB100S,
        %INCLUDE RCB100S;,
      3 RCB100SI,
        %INCLUDE RCB100SI;;
                                    /*   IOAREA MERGE MES-ORDER FILE */
 DCL IOAREA5        CHAR(46);
 DCL 1 RCBBCA1_H    BASED(ADDR(IOAREA5)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA1_T    BASED(ADDR(IOAREA5)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA1_HW   BASED(ADDR(IOAREA5)),
       %INCLUDE RCBBAAS1;,
      3 RCB100S,
        %INCLUDE RCB100S;,
      3 RCB100SI,
        %INCLUDE RCB100SI;;
                                     /* IOAREA IBASE HW STATUS FILE */
 DCL IOAREA6        CHAR(105);
 DCL 1 RCBBS18_H    BASED(ADDR(IOAREA6)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS18_T    BASED(ADDR(IOAREA6)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS18_HW   BASED(ADDR(IOAREA6)),
       %INCLUDE RCBBAAS1;,
      3 RCB110S,
        %INCLUDE RCB110S;,
      3 RCB110SI,
        %INCLUDE RCB110SI;;
                                 /* IOAREA SOF/WTAAS HW STATUS FILE */
 DCL IOAREA7        CHAR(105);
 DCL 1 RCBBS28_H    BASED(ADDR(IOAREA7)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS28_T    BASED(ADDR(IOAREA7)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS28_HW   BASED(ADDR(IOAREA7)),
       %INCLUDE RCBBAAS1;,
      3 RCB110S,
        %INCLUDE RCB110S;,
      3 RCB110SI,
        %INCLUDE RCB110SI;;
                                  /*   IOAREA MERGE HW STATUS FILE  */
 DCL IOAREA8        CHAR(105);
 DCL 1 RCBBCA2_H    BASED(ADDR(IOAREA8)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA2_T    BASED(ADDR(IOAREA8)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA2_HW   BASED(ADDR(IOAREA8)),
       %INCLUDE RCBBAAS1;,
      3 RCB110S,
        %INCLUDE RCB110S;,
      3 RCB110SI,
        %INCLUDE RCB110SI;;
                                         /* IOAREA IBASE OU/HW FILE */
 DCL IOAREA9        CHAR(108);
 DCL 1 RCBBS19_H    BASED(ADDR(IOAREA9)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS19_T    BASED(ADDR(IOAREA9)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS19_HW   BASED(ADDR(IOAREA9)),
       %INCLUDE RCBBAAS1;,
      3 RCB170S,
        %INCLUDE RCB170S;,
      3 RCB170SI,
        %INCLUDE RCB170SI;;
                                    /* IOAREA SOF/WTAAS OU/HW FILE */
 DCL IOAREA10       CHAR(108);
 DCL 1 RCBBS29_H    BASED(ADDR(IOAREA10)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS29_T    BASED(ADDR(IOAREA10)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS29_HW   BASED(ADDR(IOAREA10)),
       %INCLUDE RCBBAAS1;,
      3 RCB170S,
        %INCLUDE RCB170S;,
      3 RCB170SI,
        %INCLUDE RCB170SI;;
                                       /*   IOAREA MERGE OU/HW FILE */
 DCL IOAREA11       CHAR(108);
 DCL 1 RCBBCA3_H    BASED(ADDR(IOAREA11)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA3_T    BASED(ADDR(IOAREA11)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA3_HW   BASED(ADDR(IOAREA11)),
       %INCLUDE RCBBAAS1;,
      3 RCB170S,
        %INCLUDE RCB170S;,
      3 RCB170SI,
        %INCLUDE RCB170SI;;
                                   /* IOAREA IBASE HW/CUSTOMER FILE */
 DCL IOAREA12       CHAR(136);
 DCL 1 RCBBS1A_H    BASED(ADDR(IOAREA12)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1A_T    BASED(ADDR(IOAREA12)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1A_HW   BASED(ADDR(IOAREA12)),
       %INCLUDE RCBBAAS1;,
      3 RCB190S,
        %INCLUDE RCB190S;,
      3 RCB190SI,
        %INCLUDE RCB190SI;;
                               /* IOAREA SOF/WTAAS HW/CUSTOMER FILE */
 DCL IOAREA13       CHAR(136);
 DCL 1 RCBBS2A_H    BASED(ADDR(IOAREA13)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2A_T    BASED(ADDR(IOAREA13)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2A_HW   BASED(ADDR(IOAREA13)),
       %INCLUDE RCBBAAS1;,
      3 RCB190S,
        %INCLUDE RCB190S;,
      3 RCB190SI,
        %INCLUDE RCB190SI;;
                                 /*   IOAREA MERGE HW/CUSTOMER FILE */
 DCL IOAREA14       CHAR(136);
 DCL 1 RCBBCA4_H    BASED(ADDR(IOAREA14)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA4_T    BASED(ADDR(IOAREA14)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA4_HW   BASED(ADDR(IOAREA14)),
       %INCLUDE RCBBAAS1;,
      3 RCB190S,
        %INCLUDE RCB190S;,
      3 RCB190SI,
        %INCLUDE RCB190SI;;
                                   /* IOAREA IBASE SUPPLY CONTR FILE */
 DCL IOAREA15       CHAR(145);
 DCL 1 RCBBS1B_H    BASED(ADDR(IOAREA15)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1B_T    BASED(ADDR(IOAREA15)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1B_HW   BASED(ADDR(IOAREA15)),
       %INCLUDE RCBBAAS1;,
      3 RCB220S,
        %INCLUDE RCB220S;,
      3 RCB220SI,
        %INCLUDE RCB220SI;;
                               /* IOAREA SOF/WTAAS SUPPLY CONTR FILE */
 DCL IOAREA16       CHAR(145);
 DCL 1 RCBBS2B_H    BASED(ADDR(IOAREA16)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2B_T    BASED(ADDR(IOAREA16)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2B_HW   BASED(ADDR(IOAREA16)),
       %INCLUDE RCBBAAS1;,
      3 RCB220S,
        %INCLUDE RCB220S;,
      3 RCB220SI,
        %INCLUDE RCB220SI;;
                                /*   IOAREA MERGE SUPPLY CONTR FILE */
 DCL IOAREA17       CHAR(145);
 DCL 1 RCBBCA5_H    BASED(ADDR(IOAREA17)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA5_T    BASED(ADDR(IOAREA17)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA5_HW   BASED(ADDR(IOAREA17)),
       %INCLUDE RCBBAAS1;,
      3 RCB220S,
        %INCLUDE RCB220S;,
      3 RCB220SI,
        %INCLUDE RCB220SI;;
                                  /* IOAREA IBASE MES ORDER/HW FILE */
 DCL IOAREA18       CHAR(145);
 DCL 1 RCBBS1C_H    BASED(ADDR(IOAREA18)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1C_T    BASED(ADDR(IOAREA18)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1C_HW   BASED(ADDR(IOAREA18)),
       %INCLUDE RCBBAAS1;,
      3 RCB250S,
        %INCLUDE RCB250S;,
      3 RCB250SI,
        %INCLUDE RCB250SI;;
                               /* IOAREA SOF/WTAAS MES ORDER/HW FILE */
 DCL IOAREA19       CHAR(145);
 DCL 1 RCBBS2C_H    BASED(ADDR(IOAREA19)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2C_T    BASED(ADDR(IOAREA19)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2C_HW   BASED(ADDR(IOAREA19)),
       %INCLUDE RCBBAAS1;,
      3 RCB250S,
        %INCLUDE RCB250S;,
      3 RCB250SI,
        %INCLUDE RCB250SI;;
                                /*   IOAREA MERGE MES ORDER/HW FILE */
 DCL IOAREA20       CHAR(145);
 DCL 1 RCBBCA6_H    BASED(ADDR(IOAREA20)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA6_T    BASED(ADDR(IOAREA20)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA6_HW   BASED(ADDR(IOAREA20)),
       %INCLUDE RCBBAAS1;,
      3 RCB250S,
        %INCLUDE RCB250S;,
      3 RCB250SI,
        %INCLUDE RCB250SI;;
                                   /* IOAREA IBASE HW PO / ORDER FILE */
 DCL IOAREA21       CHAR(214);
 DCL 1 RCBBS1D_H    BASED(ADDR(IOAREA21)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1D_T    BASED(ADDR(IOAREA21)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1D_HW   BASED(ADDR(IOAREA21)),
       %INCLUDE RCBBAAS1;,
      3 RCB260S,
        %INCLUDE RCB260S;,
      3 RCB260SI,
        %INCLUDE RCB260SI;;
                              /* IOAREA SOF/WTAAS HW PO / ORDER FILE */
 DCL IOAREA22       CHAR(214);
 DCL 1 RCBBS2D_H    BASED(ADDR(IOAREA22)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2D_T    BASED(ADDR(IOAREA22)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2D_HW   BASED(ADDR(IOAREA22)),
       %INCLUDE RCBBAAS1;,
      3 RCB260S,
        %INCLUDE RCB260S;,
      3 RCB260SI,
        %INCLUDE RCB260SI;;
                                       /*   IOAREA MERGE OU/HW FILE */
 DCL IOAREA23       CHAR(214);
 DCL 1 RCBBCA7_H    BASED(ADDR(IOAREA23)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA7_T    BASED(ADDR(IOAREA23)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA7_HW   BASED(ADDR(IOAREA23)),
       %INCLUDE RCBBAAS1;,
      3 RCB260S,
        %INCLUDE RCB260S;,
      3 RCB260SI,
        %INCLUDE RCB260SI;;
                                      /* IOAREA IBASE HW PO REAL FILE */
 DCL IOAREA24       CHAR(104);
 DCL 1 RCBBS1E_H    BASED(ADDR(IOAREA24)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1E_T    BASED(ADDR(IOAREA24)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1E_HW   BASED(ADDR(IOAREA24)),
       %INCLUDE RCBBAAS1;,
      3 RCB300S,
        %INCLUDE RCB300S;,
      3 RCB300SI,
        %INCLUDE RCB300SI;;
                                  /* IOAREA SOF/WTAAS HW PO REAL FILE */
 DCL IOAREA25       CHAR(104);
 DCL 1 RCBBS2E_H    BASED(ADDR(IOAREA25)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2E_T    BASED(ADDR(IOAREA25)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2E_HW   BASED(ADDR(IOAREA25)),
       %INCLUDE RCBBAAS1;,
      3 RCB300S,
        %INCLUDE RCB300S;,
      3 RCB300SI,
        %INCLUDE RCB300SI;;
                                   /*   IOAREA MERGE HW PO REAL FILE */
 DCL IOAREA26       CHAR(104);
 DCL 1 RCBBCA8_H    BASED(ADDR(IOAREA26)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA8_T    BASED(ADDR(IOAREA26)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA8_HW   BASED(ADDR(IOAREA26)),
       %INCLUDE RCBBAAS1;,
      3 RCB300S,
        %INCLUDE RCB300S;,
      3 RCB300SI,
        %INCLUDE RCB300SI;;
                                       /* IOAREA IBASE FEATURES FILE */
 DCL IOAREA27       CHAR(111);
 DCL 1 RCBBS1F_H    BASED(ADDR(IOAREA27)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1F_T    BASED(ADDR(IOAREA27)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1F_HW   BASED(ADDR(IOAREA27)),
       %INCLUDE RCBBAAS1;,
      3 RCB310S,
        %INCLUDE RCB310S;,
      3 RCB310SI,
        %INCLUDE RCB310SI;;
                                   /* IOAREA SOF/WTAAS FEATURES FILE */
 DCL IOAREA28       CHAR(111);
 DCL 1 RCBBS2F_H    BASED(ADDR(IOAREA28)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2F_T    BASED(ADDR(IOAREA28)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2F_HW   BASED(ADDR(IOAREA28)),
       %INCLUDE RCBBAAS1;,
      3 RCB310S,
        %INCLUDE RCB310S;,
      3 RCB310SI,
        %INCLUDE RCB310SI;;
                                    /*   IOAREA MERGE FEATURES FILE */
 DCL IOAREA29       CHAR(111);
 DCL 1 RCBBCA9_H    BASED(ADDR(IOAREA29)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCA9_T    BASED(ADDR(IOAREA29)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCA9_HW   BASED(ADDR(IOAREA29)),
       %INCLUDE RCBBAAS1;,
      3 RCB310S,
        %INCLUDE RCB310S;,
      3 RCB310SI,
        %INCLUDE RCB310SI;;
                                 /* IOAREA IBASE MES ORDER/HW  FILE */
 DCL IOAREA30       CHAR(113);
 DCL 1 RCBBS1G_H    BASED(ADDR(IOAREA30)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1G_T    BASED(ADDR(IOAREA30)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1G_HW   BASED(ADDR(IOAREA30)),
       %INCLUDE RCBBAAS1;,
      3 RCB330S,
        %INCLUDE RCB330S;,
      3 RCB330SI,
        %INCLUDE RCB330SI;;
                              /* IOAREA SOF/WTAAS MES ORDER/HW  FILE */
 DCL IOAREA31       CHAR(113);
 DCL 1 RCBBS2G_H    BASED(ADDR(IOAREA31)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2G_T    BASED(ADDR(IOAREA31)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2G_HW   BASED(ADDR(IOAREA31)),
       %INCLUDE RCBBAAS1;,
      3 RCB330S,
        %INCLUDE RCB330S;,
      3 RCB330SI,
        %INCLUDE RCB330SI;;
                                /*   IOAREA MERGE MES ORDER/HW  FILE */
 DCL IOAREA32       CHAR(113);
 DCL 1 RCBBCAA_H    BASED(ADDR(IOAREA32)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCAA_T    BASED(ADDR(IOAREA32)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCAA_HW   BASED(ADDR(IOAREA32)),
       %INCLUDE RCBBAAS1;,
      3 RCB330S,
        %INCLUDE RCB330S;,
      3 RCB330SI,
        %INCLUDE RCB330SI;;
                                  /* IOAREA IBASE HW MOD. INFO FILE */
 DCL IOAREA33       CHAR(136);
 DCL 1 RCBBS1H_H    BASED(ADDR(IOAREA33)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS1H_T    BASED(ADDR(IOAREA33)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS1H_HW   BASED(ADDR(IOAREA33)),
       %INCLUDE RCBBAAS1;,
      3 RCB380S,
        %INCLUDE RCB380S;,
      3 RCB380SI,
        %INCLUDE RCB380SI;;
                              /* IOAREA SOF/WTAAS HW MOD. INFO FILE */
 DCL IOAREA34       CHAR(136);
 DCL 1 RCBBS2H_H    BASED(ADDR(IOAREA34)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBS2H_T    BASED(ADDR(IOAREA34)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBS2H_HW   BASED(ADDR(IOAREA34)),
       %INCLUDE RCBBAAS1;,
      3 RCB380S,
        %INCLUDE RCB380S;,
      3 RCB380SI,
        %INCLUDE RCB380SI;;
                                 /*   IOAREA MERGE HW MOD. INFO FILE */
 DCL IOAREA35       CHAR(136);
 DCL 1 RCBBCAB_H    BASED(ADDR(IOAREA35)),
       %INCLUDE RCBBAASH;;
 DCL 1 RCBBCAB_T    BASED(ADDR(IOAREA35)),
       %INCLUDE RCBBAAST;;
 DCL 1 RCBBCAB_HW   BASED(ADDR(IOAREA35)),
       %INCLUDE RCBBAAS1;,
      3 RCB380S,
        %INCLUDE RCB380S;,
      3 RCB380SI,
        %INCLUDE RCB380SI;;
                                                       /* INPUT CARD */
 DCL 1 RCBPROC_REC,
       %INCLUDE (RCBZ27S);;
0/********************************************************************/
 /* EXTERNAL PARAMETER INTERFACES                                    */
 /********************************************************************/
0DCL PTR_INT_AREA        PTR;
 DCL PTR_RET_AREA_BB     PTR;
 DCL PTR_COUNTRY_AREA    PTR;                   /* INTERFACE RCB019M */
0DCL 1 PARM_INT_AREA,                              /* INTERFACE AREA */
       %INCLUDE (RCBZ01S);;
0DCL 1 PARM_RET_AREA_BB,                           /* RETURN AREA    */
       %INCLUDE (RCBZ02S);;
0DCL 1 COUNTRY_AREA,                               /* COUNTRY AREA   */
       %INCLUDE (RCBZ26S);;
0/********************************************************************/
 /* MISCELLANEOUS FIELDS                                             */
 /********************************************************************/
0DCL 1 WORK_FIELDS,
        3 WRK_MOD_NAME             CHAR(08)      INIT ('RCBBCZM'),
        3 WRK_CTRYNO               CHAR(3),
        3 WRK_SOURCE_INDICATOR     CHAR(1),
        3 WRK_HASH_FIELD           CHAR(4),
        3 WRK_HASH_RCBBCA0         FIXED DEC (15,0),
        3 WRK_LENGTH_RCB024        FIXED BIN (15,0),
        3 WRK_FILE_RCBBS16         CHAR(7)       INIT ('RCBBS16'),
        3 WRK_FILE_RCBBS26         CHAR(7)       INIT ('RCBBS26'),
        3 WRK_FILE_RCBBS17         CHAR(7)       INIT ('RCBBS17'),
        3 WRK_FILE_RCBBS27         CHAR(7)       INIT ('RCBBS27'),
        3 WRK_FILE_RCBBS18         CHAR(7)       INIT ('RCBBS18'),
        3 WRK_FILE_RCBBS28         CHAR(7)       INIT ('RCBBS28'),
        3 WRK_FILE_RCBBS19         CHAR(7)       INIT ('RCBBS19'),
        3 WRK_FILE_RCBBS29         CHAR(7)       INIT ('RCBBS29'),
        3 WRK_FILE_RCBBS1A         CHAR(7)       INIT ('RCBBS1A'),
        3 WRK_FILE_RCBBS2A         CHAR(7)       INIT ('RCBBS2A'),
        3 WRK_FILE_RCBBS1B         CHAR(7)       INIT ('RCBBS1B'),
        3 WRK_FILE_RCBBS2B         CHAR(7)       INIT ('RCBBS2B'),
        3 WRK_FILE_RCBBS1C         CHAR(7)       INIT ('RCBBS1C'),
        3 WRK_FILE_RCBBS2C         CHAR(7)       INIT ('RCBBS2C'),
        3 WRK_FILE_RCBBS1D         CHAR(7)       INIT ('RCBBS1D'),
        3 WRK_FILE_RCBBS2D         CHAR(7)       INIT ('RCBBS2D'),
        3 WRK_FILE_RCBBS1E         CHAR(7)       INIT ('RCBBS1E'),
        3 WRK_FILE_RCBBS2E         CHAR(7)       INIT ('RCBBS2E'),
        3 WRK_FILE_RCBBS1F         CHAR(7)       INIT ('RCBBS1F'),
        3 WRK_FILE_RCBBS2F         CHAR(7)       INIT ('RCBBS2F'),
        3 WRK_FILE_RCBBS1G         CHAR(7)       INIT ('RCBBS1G'),
        3 WRK_FILE_RCBBS2G         CHAR(7)       INIT ('RCBBS2G'),
        3 WRK_FILE_RCBBS1H         CHAR(7)       INIT ('RCBBS1H'),
        3 WRK_FILE_RCBBS2H         CHAR(7)       INIT ('RCBBS2H'),
        3 WRK_FILE_ACT             CHAR(7)       INIT ('RCBBCA0'),
        3 WRK_DATE_TIME            CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS16   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS26   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS17   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS27   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS18   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS28   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS19   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS29   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1A   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2A   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1B   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2B   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1C   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2C   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1D   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2D   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1E   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2E   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1F   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2F   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1G   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2G   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS1H   CHAR(20)      INIT (' '),
        3 WRK_TIME_STAMP_RCBBS2H   CHAR(20)      INIT (' '),
        3 WRK_RUN_DATE             CHAR(10),
        3 WRK_EFF_DATE             CHAR(10),
        3 WRK_END_DATE             CHAR(10);
0/********************************************************************/
 /* COUNTS                                                           */
 /********************************************************************/
0DCL 1 COUNT,
       3 CNT_CTRY,
         5 RCBBS16       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS26       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA0       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS17       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS27       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA1       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS18       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS28       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA2       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS19       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS29       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA3       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1A       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2A       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA4       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1B       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2B       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA5       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1C       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2C       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA6       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1D       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2D       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA7       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1E       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2E       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA8       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1F       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2F       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCA9       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1G       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2G       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCAA       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS1H       FIXED DEC(9),    /* COUNT S1 RECORDS        */
         5 RCBBS2H       FIXED DEC(9),    /* COUNT S2 RECORDS        */
         5 RCBBCAB       FIXED DEC(9),    /* COUNT CA RECORDS        */
         5 RCBBS16_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS26_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA0_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS17_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS27_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA1_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS18_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS28_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA2_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS19_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS29_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA3_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1A_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2A_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA4_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1B_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2B_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA5_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1C_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2C_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA6_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1D_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2D_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA7_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1E_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2E_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA8_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1F_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2F_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCA9_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1G_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2G_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCAA_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
         5 RCBBS1H_HASH   FIXED DEC (15,0),/* HASH  S1 RECORDS        */
         5 RCBBS2H_HASH   FIXED DEC (15,0),/* HASH  S2 RECORDS        */
         5 RCBBCAB_HASH   FIXED DEC (15,0),/* HASH  CA RECORDS        */
       3 CNT_TOT,
         5 RCBBS16        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS17        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS18        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS19        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1A        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1B        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1C        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1D        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1E        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1F        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1G        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS1H        FIXED DEC (9),   /* TOTAL COUNT S1 RECORDS */
         5 RCBBS26        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS27        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS28        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS29        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2A        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2B        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2C        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2D        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2E        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2F        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2G        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBS2H        FIXED DEC (9),   /* TOTAL COUNT S2 RECORDS */
         5 RCBBCA0        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA1        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA2        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA3        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA4        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA5        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA6        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA7        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA8        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCA9        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCAA        FIXED DEC (9),   /* TOTAL COUNT CA RECORDS */
         5 RCBBCAB        FIXED DEC (9);   /* TOTAL COUNT CA RECORDS */
 DCL CNT_PIC9         PIC'(09)9';       /* CONVERSION OF COUNTS      */
 DCL CNT_PIC15        PIC'(15)9';       /* CONVERSION OF HASH TOTAL  */
 DCL TRUE                 BIT(1) INIT ('1'B);
 DCL FALSE                BIT(1) INIT ('0'B);
 DCL SWITCH_EOF_RCBPROC   BIT(1) INIT ('0'B);
0/********************************************************************/
 /* PROGRAM CONTROL PARAMETERS                                       */
 /********************************************************************/
0DCL 1 RCBP24S_UPSTR,
     %INCLUDE (RCBP24S);;
0DCL 1 RCBP24S_CEDS,
     %INCLUDE (RCBP24S);;
1/********************************************************************/
 /* DB2 TABLE STRUCTURES                                             */
 /********************************************************************/
0DCL 1 TB_RCBV500,
      %INCLUDE (RCB500S);;
 DCL 1 TB_RCBV500_I,
      %INCLUDE (RCB500SI);;
0DCL 1 TB_RCBP24S         BASED (ADDR (TB_RCBV500)),
        %INCLUDE (RCBP24S);;
1/********************************************************************/
 /* SORT KEYS                                                        */
 /********************************************************************/
 DCL 1 SSK,                          /* SMALLEST SORT KEY            */
      3 EOF                  CHAR(1)      INIT('0'),
      3 REC_TYPE             CHAR(2),
      3 CTRYNO               CHAR(3),
      3 PRODUCT_TYPE         CHAR(4),
      3 ORIGIN               CHAR(2),
      3 SEQUENCE_NUMBER      CHAR(28),
      3 COUNTRY_NUMBER       CHAR(3);
0DCL 1 SSK1,                         /* SMALLEST SORT KEY            */
      3 EOF                  CHAR(1)      INIT('0'),
      3 REC_TYPE             CHAR(2),
      3 CTRYNO               CHAR(3),
      3 MES_ORDER_NUMBER     CHAR(6),
      3 NAME_CODE            CHAR(1),
      3 FILLER1              CHAR(6);
0DCL 1 SSK2,                          /* SMALLEST SORT KEY            */
      3 EOF                  CHAR(1)      INIT('0'),
      3 REC_TYPE             CHAR(2),
      3 CTRYNO               CHAR(3),
      3 COUNTRY_NUMBER       CHAR(3),
      3 PRODUCT_TYPE         CHAR(4),
      3 ORIGIN               CHAR(2),
      3 SEQUENCE_NUMBER      CHAR(28),
      3 FILLER               CHAR(01);
 DCL 1 SSK3,                          /* SMALLEST SORT KEY            */
      3 EOF                  CHAR(1)      INIT('0'),
      3 REC_TYPE             CHAR(2),
      3 CTRYNO               CHAR(3),
      3 MES_ORDER_NUMBER     CHAR(6),
      3 NAME_CODE            CHAR(1),
      3 PRODUCT_TYPE         CHAR(4),
      3 ORIGIN               CHAR(2),
      3 SEQUENCE_NUMBER      CHAR(28),
      3 COUNTRY_NUMBER       CHAR(3);
0DCL 1 SSK4,                          /* SMALLEST SORT KEY */
      3 EOF                  CHAR(1)      INIT('0'),
      3 REC_TYPE             CHAR(2),
      3 CTRYNO               CHAR(3),
      3 ORDER_REF_NUMBER     CHAR(6),
      3 COUNTRY_NUMBER       CHAR(3);
0DCL 1 SSK5,                          /* SMALLEST SORT KEY          */
      3 EOF                  CHAR(1)      INIT('0'),
      3 REC_TYPE             CHAR(2),
      3 CTRYNO               CHAR(3),
      3 PRODUCT_TYPE         CHAR(4),
      3 ORIGIN               CHAR(2),
      3 SEQUENCE_NUMBER      CHAR(28),
      3 FEATURE_RPQ_CODE     CHAR(6),
      3 COUNTRY_NUMBER       CHAR(3);

 DCL 1 SK4,
      3 EOF                  CHAR(1)      INIT('0');
 DCL 1 SK5,
      3 EOF                  CHAR(1)      INIT('0');

 DCL 1 SK8,
      3 EOF                  CHAR(1)      INIT('0');
 DCL 1 SK9,
      3 EOF                  CHAR(1)      INIT('0');

 DCL 1 SK10,
      3 EOF                  CHAR(1)      INIT('0');
 DCL 1 SK11,
      3 EOF                  CHAR(1)      INIT('0');

 DCL 1 SK16,
      3 EOF                  CHAR(1)      INIT('0');
 DCL 1 SK17,
      3 EOF                  CHAR(1)      INIT('0');

 DCL 1 SK20,
      3 EOF                  CHAR(1)      INIT('0');
 DCL 1 SK21,
      3 EOF                  CHAR(1)      INIT('0');

 DCL 1 SK22,
      3 EOF                  CHAR(1)      INIT('0');
 DCL 1 SK23,
      3 EOF                  CHAR(1)      INIT('0');

 DCL 1 SK0  LIKE SSK;                     /* SORT KEY S1  FILE       */
 DCL 1 SK1  LIKE SSK;                     /* SORT KEY S2  FILE       */
 DCL 1 SK2  LIKE SSK1;                    /* SORT KEY S1  FILE       */
 DCL 1 SK3  LIKE SSK1;                    /* SORT KEY S2  FILE       */
 DCL 1 SK6  LIKE SSK2;                    /* SORT KEY S1  FILE       */
 DCL 1 SK7  LIKE SSK2;                    /* SORT KEY S2  FILE       */
 DCL 1 SK12 LIKE SSK3;                    /* SORT KEY S1  FILE       */
 DCL 1 SK13 LIKE SSK3;                    /* SORT KEY S2  FILE       */
 DCL 1 SK14 LIKE SSK4;                    /* SORT KEY S1  FILE       */
 DCL 1 SK15 LIKE SSK4;                    /* SORT KEY S2  FILE       */
 DCL 1 SK18 LIKE SSK5;                    /* SORT KEY S1  FILE       */
 DCL 1 SK19 LIKE SSK5;                    /* SORT KEY S2  FILE       */
 DCL 1 PREV_SSK     LIKE SSK;
 DCL 1 PREV_SSK1    LIKE SSK1;
 DCL 1 PREV_SSK2    LIKE SSK2;
 DCL 1 PREV_SSK3    LIKE SSK3;
 DCL 1 PREV_SSK4    LIKE SSK4;
 DCL 1 PREV_SSK5    LIKE SSK5;
1/********************************************************************/
 /* EXTERNAL ENTRIES                                                 */
 /********************************************************************/
0DCL RCB0M1M        EXT ENTRY;           /* MESSAGE MODULE           */
 DCL RCB0E1M        EXT ENTRY;           /* ERROR MODULE             */
 DCL RCB0T1M        EXT ENTRY;           /* RETRIEVE SYSTEM DATE     */
 DCL RCB018M        EXT ENTRY;           /* HASH TOTAL CALCULATION   */
 DCL RCB019M        EXT ENTRY;           /* RETRIEVE COUNTRY NUMBERS */
 DCL RCBI50M        EXT ENTRY;           /* INSERT   PARAMETER       */
 DCL RCBG50M        EXT ENTRY;           /* UPDATE   PARAMETER       */
 DCL RCBF50M        EXT ENTRY;           /* RETRIEVE PARAMETER       */
1/********************************************************************/
 /*  BUILTIN FUNCTIONS                                               */
 /********************************************************************/
0DCL (ADDR,
     CSTG,
     DATE,
     NULL,
     STG,
     PLIRETC,
     STRING,
     SUBSTR,
     HIGH,
     LOW,
     TIME)                   BUILTIN;
1/********************************************************************/
 /* ON ENDFILE                                                       */
 /********************************************************************/
0ON ENDFILE (RCBBS16)
   BEGIN;
   SK0.EOF = '1';
   END;

 ON ENDFILE (RCBBS26)
   BEGIN;
   SK1.EOF = '1';
   END;

0ON ENDFILE (RCBBS17)
   BEGIN;
   SK2.EOF = '1';
   END;

 ON ENDFILE (RCBBS27)
   BEGIN;
   SK3.EOF = '1';
   END;

0ON ENDFILE (RCBBS18)
   BEGIN;
   SK4.EOF = '1';
   END;

 ON ENDFILE (RCBBS28)
   BEGIN;
   SK5.EOF = '1';
   END;

0ON ENDFILE (RCBBS19)
   BEGIN;
   SK6.EOF = '1';
   END;

 ON ENDFILE (RCBBS29)
   BEGIN;
   SK7.EOF = '1';
   END;

0ON ENDFILE (RCBBS1A)
   BEGIN;
   SK8.EOF = '1';
   END;

 ON ENDFILE (RCBBS2A)
   BEGIN;
   SK9.EOF = '1';
   END;

0ON ENDFILE (RCBBS1B)
   BEGIN;
   SK10.EOF = '1';
   END;

 ON ENDFILE (RCBBS2B)
   BEGIN;
   SK11.EOF = '1';
   END;

0ON ENDFILE (RCBBS1C)
   BEGIN;
   SK12.EOF = '1';
   END;

 ON ENDFILE (RCBBS2C)
   BEGIN;
   SK13.EOF = '1';
   END;

0ON ENDFILE (RCBBS1D)
   BEGIN;
   SK14.EOF = '1';
   END;

 ON ENDFILE (RCBBS2D)
   BEGIN;
   SK15.EOF = '1';
   END;

0ON ENDFILE (RCBBS1E)
   BEGIN;
   SK16.EOF = '1';
   END;

 ON ENDFILE (RCBBS2E)
   BEGIN;
   SK17.EOF = '1';
   END;

0ON ENDFILE (RCBBS1F)
   BEGIN;
   SK18.EOF = '1';
   END;

 ON ENDFILE (RCBBS2F)
   BEGIN;
   SK19.EOF = '1';
   END;

0ON ENDFILE (RCBBS1G)
   BEGIN;
   SK20.EOF = '1';
   END;

 ON ENDFILE (RCBBS2G)
   BEGIN;
   SK21.EOF = '1';
   END;

0ON ENDFILE (RCBBS1H)
   BEGIN;
   SK22.EOF = '1';
   END;

 ON ENDFILE (RCBBS2H)
   BEGIN;
   SK23.EOF = '1';
   END;

 ON ENDFILE (RCBPROC)
   SWITCH_EOF_RCBPROC = TRUE;
0/********************************************************************/
 /* ON ERROR CONDITIONS                                              */
 /********************************************************************/
 %INCLUDE (RCB0E0M);
 END;
1/********************************************************************/
 /*                 S T A R T   P R O C E S S I N G                  */
1/********************************************************************/
 CALL R080_INIT_PROCESSING;               /* INIT PROCESSING         */

   CALL MERGE_RCBBS16_S26;      /* MERGE RCBBS16 AND RCBBS26 FILES   */
   CALL MERGE_RCBBS17_S27;      /* MERGE RCBBS17 AND RCBBS27 FILES   */
   CALL MERGE_RCBBS18_S28;      /* MERGE RCBBS18 AND RCBBS28 FILES   */
   CALL MERGE_RCBBS19_S29;      /* MERGE RCBBS19 AND RCBBS29 FILES   */
   CALL MERGE_RCBBS1A_S2A;      /* MERGE RCBBS1A AND RCBBS2A FILES   */
   CALL MERGE_RCBBS1B_S2B;      /* MERGE RCBBS1B AND RCBBS2B FILES   */
   CALL MERGE_RCBBS1C_S2C;      /* MERGE RCBBS1C AND RCBBS2C FILES   */
   CALL MERGE_RCBBS1D_S2D;      /* MERGE RCBBS1D AND RCBBS2D FILES   */
   CALL MERGE_RCBBS1E_S2E;      /* MERGE RCBBS1E AND RCBBS2E FILES   */
   CALL MERGE_RCBBS1F_S2F;      /* MERGE RCBBS1F AND RCBBS2F FILES   */
   CALL MERGE_RCBBS1G_S2G;      /* MERGE RCBBS1G AND RCBBS2G FILES   */
   CALL MERGE_RCBBS1H_S2H;      /* MERGE RCBBS1H AND RCBBS2H FILES   */

 CALL RCBBCZM_TERM;                       /* TERMINATE PROGRAM       */
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R080_INIT_PROCESSING                          */
 /*                                                                  */
 /* DESCRIPTION      : INIT PROCESSING                               */
 /*                                                                  */
 /********************************************************************/
 R080_INIT_PROCESSING: PROC;
                                   /* INIT SORT KEYS,COUNT VARIABLES */
 PTR_INT_AREA       = ADDR (PARM_INT_AREA);
 PTR_RET_AREA_BB    = ADDR (PARM_RET_AREA_BB);
 PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA);
                                     /* INITIALIZE MESSAGE AREA      */
 PARM_INT_AREA.MSG_AREA        = '';
 PARM_INT_AREA.ERR_AREA        = '';
 PARM_INT_AREA.MSG_REQUEST     = 'O';
 PARM_INT_AREA.MSG_TARGET      = 'F';
 PARM_INT_AREA.ID_SOURCE_APPL  = 'RCB';
 PARM_INT_AREA.ID_SOURCE_PROG  = SUBSTR(WRK_MOD_NAME,1,6) || 'P';
 PARM_INT_AREA.ID_MOD_PATH (1) = WRK_MOD_NAME;
 PARM_INT_AREA.ID_MOD_LEVEL    = 1;
 PARM_INT_AREA.PTR_PCB_IO      = NULL();
 PARM_INT_AREA.PTR_PCB_ALT     = NULL();
 PARM_INT_AREA.SYSTEM_TYPE     = 'B';
0PARM_INT_AREA.COUNTRY_NUMBER  = '';
                                     /* OPEN MESSAGE FILE            */
 CALL RCB0M1M (PTR_INT_AREA);
                                     /* RETRIEVE SYSTEM DATE         */

 CALL RCB0T1M (PTR_INT_AREA);
                                     /* INIT OTHER VARIABLES         */
 SSK                    = '';
 PREV_SSK               = '';
 SK0.EOF                = '0';
 SK1.EOF                = '0';
 COUNT                  =  0 ;
 WRK_CTRYNO             = LOW(3);
 WRK_DATE_TIME          = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();
 WRK_LENGTH_RCB024      = CSTG (TB_RCBP24S.TIME_STAMP) +
                          CSTG (TB_RCBP24S.HASH_TOTAL);

 OPEN FILE (RCBBS16);            /* OPEN ALL FILES                  */
 OPEN FILE (RCBBS26);
 OPEN FILE (RCBBS17);
 OPEN FILE (RCBBS27);
 OPEN FILE (RCBBS18);
 OPEN FILE (RCBBS28);
 OPEN FILE (RCBBS19);
 OPEN FILE (RCBBS29);
 OPEN FILE (RCBBS1A);
 OPEN FILE (RCBBS2A);
 OPEN FILE (RCBBS1B);
 OPEN FILE (RCBBS2B);
 OPEN FILE (RCBBS1C);
 OPEN FILE (RCBBS2C);
 OPEN FILE (RCBBS1D);
 OPEN FILE (RCBBS2D);
 OPEN FILE (RCBBS1E);
 OPEN FILE (RCBBS2E);
 OPEN FILE (RCBBS1F);
 OPEN FILE (RCBBS2F);
 OPEN FILE (RCBBS1G);
 OPEN FILE (RCBBS2G);
 OPEN FILE (RCBBS1H);
 OPEN FILE (RCBBS2H);
 OPEN FILE (RCBBCA0);
 OPEN FILE (RCBBCA1);
 OPEN FILE (RCBBCA2);
 OPEN FILE (RCBBCA3);
 OPEN FILE (RCBBCA4);
 OPEN FILE (RCBBCA5);
 OPEN FILE (RCBBCA6);
 OPEN FILE (RCBBCA7);
 OPEN FILE (RCBBCA8);
 OPEN FILE (RCBBCA9);
 OPEN FILE (RCBBCAA);
 OPEN FILE (RCBBCAB);
 OPEN FILE (RCBPROC);

 READ FILE (RCBPROC) INTO (RCBPROC_REC);  /* READ RCBPROC CARD */

 IF SWITCH_EOF_RCBPROC
 THEN
   DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBPROC';
     CALL RCB0M1M (PTR_INT_AREA);
     CALL RCBBCZM_ERROR (NULL(), 'OTHER', '#001');
   END;

 PARM_INT_AREA.PROC_ID = RCBPROC_REC.PROC_ID;
 CLOSE FILE (RCBPROC);

 END R080_INIT_PROCESSING;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_INIT_COUNTRY                          */
 /*                                                                  */
 /* DESCRIPTION      : INITIAL ACTIONS FOR A COUNTRY                 */
 /*                    RETRIEVE RCB024 PARAMETER FOR THE S1          */
 /*                    AND S2 FILE AND CHECK TIME STAMPS             */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_INIT_COUNTRY: PROC;
0COUNT.CNT_CTRY = 0;                  /* RESET COUNTRY COUNTERS    */
0PREV_SSK                     = SSK;
 PARM_INT_AREA.COUNTRY_NUMBER = SSK.CTRYNO;

 SELECT(WRK_FILE_ACT);
  WHEN ('RCBBCA1')
    DO;
     COUNT.CNT_CTRY = 0;              /* RESET COUNTRY COUNTERS    */
     PREV_SSK1      = SSK1;
     PARM_INT_AREA.COUNTRY_NUMBER = SSK1.CTRYNO;
     PREV_SSK.CTRYNO              = PREV_SSK1.CTRYNO;
     WRK_FILE_RCBBS16             = WRK_FILE_RCBBS17;
     WRK_TIME_STAMP_RCBBS16       = WRK_TIME_STAMP_RCBBS17;
     WRK_FILE_RCBBS26             = WRK_FILE_RCBBS27;
     WRK_TIME_STAMP_RCBBS26       = WRK_TIME_STAMP_RCBBS27;
   END;
  WHEN ('RCBBCA2')
   DO;
     RCBBS16_HW.RUN_DATE    = RCBBS18_HW.RUN_DATE;
     RCBBS26_HW.RUN_DATE    = RCBBS28_HW.RUN_DATE;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS18;
     WRK_TIME_STAMP_RCBBS16 = WRK_TIME_STAMP_RCBBS18;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS28;
     WRK_TIME_STAMP_RCBBS26 = WRK_TIME_STAMP_RCBBS28;
   END;
  WHEN ('RCBBCA3')
    DO;
     COUNT.CNT_CTRY = 0;              /* RESET COUNTRY COUNTERS    */
     PREV_SSK2      = SSK2;
     PARM_INT_AREA.COUNTRY_NUMBER = SSK2.CTRYNO;
     PREV_SSK.CTRYNO              = PREV_SSK2.CTRYNO;
     WRK_FILE_RCBBS16             = WRK_FILE_RCBBS19;
     WRK_TIME_STAMP_RCBBS16       = WRK_TIME_STAMP_RCBBS19;
     WRK_FILE_RCBBS26             = WRK_FILE_RCBBS29;
     WRK_TIME_STAMP_RCBBS26       = WRK_TIME_STAMP_RCBBS29;
     END;
  WHEN ('RCBBCA4')
     DO;
       COUNT.CNT_CTRY = 0;              /* RESET COUNTRY COUNTERS    */
       PREV_SSK2      = SSK2;
       PARM_INT_AREA.COUNTRY_NUMBER = SSK2.CTRYNO;
       PREV_SSK.CTRYNO              = PREV_SSK2.CTRYNO;
       RCBBS19_HW.RUN_DATE          = RCBBS1A_HW.RUN_DATE;
       RCBBS29_HW.RUN_DATE          = RCBBS2A_HW.RUN_DATE;
       WRK_FILE_RCBBS16             = WRK_FILE_RCBBS1A;
       WRK_TIME_STAMP_RCBBS16       = WRK_TIME_STAMP_RCBBS1A;
       WRK_FILE_RCBBS26             = WRK_FILE_RCBBS2A;
       WRK_TIME_STAMP_RCBBS26       = WRK_TIME_STAMP_RCBBS2A;
     END;
  WHEN ('RCBBCA5')
     DO;
       RCBBS16_HW.RUN_DATE    = RCBBS1B_HW.RUN_DATE;
       RCBBS26_HW.RUN_DATE    = RCBBS2B_HW.RUN_DATE;
       WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1B;
       WRK_TIME_STAMP_RCBBS16 = WRK_TIME_STAMP_RCBBS1B;
       WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2B;
       WRK_TIME_STAMP_RCBBS26 = WRK_TIME_STAMP_RCBBS2B;
     END;
  WHEN ('RCBBCA6')
     DO;
       COUNT.CNT_CTRY = 0;              /* RESET COUNTRY COUNTERS    */
       PREV_SSK3      = SSK3;
       PARM_INT_AREA.COUNTRY_NUMBER = SSK3.CTRYNO;
       PREV_SSK.CTRYNO              = PREV_SSK3.CTRYNO;
       WRK_FILE_RCBBS16             = WRK_FILE_RCBBS1C;
       WRK_TIME_STAMP_RCBBS16       = WRK_TIME_STAMP_RCBBS1C;
       WRK_FILE_RCBBS26             = WRK_FILE_RCBBS2C;
       WRK_TIME_STAMP_RCBBS26       = WRK_TIME_STAMP_RCBBS2C;
     END;
  WHEN ('RCBBCA7')
    DO;
      COUNT.CNT_CTRY = 0;              /* RESET COUNTRY COUNTERS    */
      PREV_SSK4      = SSK4;
      PARM_INT_AREA.COUNTRY_NUMBER = SSK4.CTRYNO;
      PREV_SSK.CTRYNO              = PREV_SSK4.CTRYNO;
      WRK_FILE_RCBBS16             = WRK_FILE_RCBBS1D;
      WRK_TIME_STAMP_RCBBS16       = WRK_TIME_STAMP_RCBBS1D;
      WRK_FILE_RCBBS26             = WRK_FILE_RCBBS2D;
      WRK_TIME_STAMP_RCBBS26       = WRK_TIME_STAMP_RCBBS2D;
    END;
  WHEN ('RCBBCA8')
    DO;
      RCBBS16_HW.RUN_DATE    = RCBBS1E_HW.RUN_DATE;
      RCBBS26_HW.RUN_DATE    = RCBBS2E_HW.RUN_DATE;
      WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1E;
      WRK_TIME_STAMP_RCBBS16 = WRK_TIME_STAMP_RCBBS1E;
      WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2E;
      WRK_TIME_STAMP_RCBBS26 = WRK_TIME_STAMP_RCBBS2E;
    END;
  WHEN ('RCBBCA9')
    DO;
      COUNT.CNT_CTRY = 0;              /* RESET COUNTRY COUNTERS    */
      PREV_SSK5      = SSK5;
      PARM_INT_AREA.COUNTRY_NUMBER = SSK5.CTRYNO;
      PREV_SSK.CTRYNO              = PREV_SSK5.CTRYNO;
      WRK_FILE_RCBBS16             = WRK_FILE_RCBBS1F;
      WRK_TIME_STAMP_RCBBS16       = WRK_TIME_STAMP_RCBBS1F;
      WRK_FILE_RCBBS26             = WRK_FILE_RCBBS2F;
      WRK_TIME_STAMP_RCBBS26       = WRK_TIME_STAMP_RCBBS2F;
    END;
  WHEN ('RCBBCAA')
    DO;
     COUNT.CNT_CTRY = 0;              /* RESET COUNTRY COUNTERS    */
     PREV_SSK1      = SSK1;
     PARM_INT_AREA.COUNTRY_NUMBER = SSK1.CTRYNO;
     PREV_SSK.CTRYNO              = PREV_SSK1.CTRYNO;
     RCBBS17_HW.RUN_DATE          = RCBBS1G_HW.RUN_DATE;
     RCBBS27_HW.RUN_DATE          = RCBBS2G_HW.RUN_DATE;
     WRK_FILE_RCBBS16             = WRK_FILE_RCBBS1G;
     WRK_TIME_STAMP_RCBBS16       = WRK_TIME_STAMP_RCBBS1G;
     WRK_FILE_RCBBS26             = WRK_FILE_RCBBS2G;
     WRK_TIME_STAMP_RCBBS26       = WRK_TIME_STAMP_RCBBS2G;
    END;
  WHEN ('RCBBCAB')
   DO;
     RCBBS16_HW.RUN_DATE    = RCBBS1H_HW.RUN_DATE;
     RCBBS26_HW.RUN_DATE    = RCBBS2H_HW.RUN_DATE;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1H;
     WRK_TIME_STAMP_RCBBS16 = WRK_TIME_STAMP_RCBBS1H;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2H;
     WRK_TIME_STAMP_RCBBS26 = WRK_TIME_STAMP_RCBBS2H;
   END;
   OTHERWISE;
  END;

 TB_RCBV500                   = '';
 TB_RCBV500_I                 = '';
 TB_RCBP24S.NUMBER            = 'RCB024';
 TB_RCBP24S.PROC_ID           =  RCBPROC_REC.PROC_ID;
 TB_RCBP24S.CTRYNO            =  PREV_SSK.CTRYNO;
 TB_RCBP24S.FILE_NAME         =  WRK_FILE_RCBBS16;
 TB_RCBP24S.SEQ_NUMBER        = '01';

0CALL RCBI50M ('U',                                        /* RC01219 */
               ADDR(TB_RCBV500),
               ADDR(TB_RCBV500_I),
               PTR_RET_AREA_BB,
               PTR_INT_AREA);
0SELECT(PARM_RET_AREA_BB.RETURN_CODE);
 WHEN (0)
   DO;
     RCBP24S_UPSTR = TB_RCBP24S, BY NAME;
   END;
 WHEN (4)
   DO;
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER    = 'I050';
     PARM_INT_AREA.MSG_VAR_CODES     = '';
     PARM_INT_AREA.MSG_VAR_CODE_6    = 'PN';
     PARM_INT_AREA.MSG_VAR_VALUE_6   = 'RCB024';
     PARM_INT_AREA.MSG_VAR_CODE_7    = 'PK';
     PARM_INT_AREA.MSG_VAR_VALUE_7   =  STRING (TB_RCBP24S.EXTRA_KEY);
     CALL RCB0M1M (PTR_INT_AREA);
     CALL RCBBCZM_ERROR (NULL(),
                        'OTHER',
                        '#002');
    END;
  OTHERWISE
    DO;
      CALL RCBBCZM_ERROR (ADDR (PARM_RET_AREA_BB.RETURN_SQL),
                          'DB2',
                          '#003');
    END;
  END;

 IF RCBP24S_UPSTR.TIME_STAMP ¬= WRK_TIME_STAMP_RCBBS16
 THEN
   DO;
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0174';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'TP';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_TIME_STAMP_RCBBS16;
     PARM_INT_AREA.MSG_VAR_CODE_8   = 'TP';
     PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBP24S_UPSTR.TIME_STAMP;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
       CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#004');
   END;

                                     /* RETRIEVE PARAMETER RCB024    */
 TB_RCBV500                   = '';
 TB_RCBV500_I                 = '';
 TB_RCBP24S.NUMBER            = 'RCB024';
 TB_RCBP24S.PROC_ID           = RCBPROC_REC.PROC_ID;
 TB_RCBP24S.CTRYNO            = PREV_SSK.CTRYNO;
 TB_RCBP24S.FILE_NAME         = WRK_FILE_RCBBS26;
 TB_RCBP24S.SEQ_NUMBER        = '01';

0CALL RCBI50M ('U',
               ADDR(TB_RCBV500),
               ADDR(TB_RCBV500_I),
               PTR_RET_AREA_BB,
               PTR_INT_AREA);
0SELECT(PARM_RET_AREA_BB.RETURN_CODE);
   WHEN (0)
     DO;
       RCBP24S_CEDS = TB_RCBP24S, BY NAME;
     END;
   WHEN (4)
     DO;
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';
       PARM_INT_AREA.MESSAGE_NUMBER    = 'I050';
       PARM_INT_AREA.MSG_VAR_CODES     = '';
       PARM_INT_AREA.MSG_VAR_CODE_6    = 'PN';
       PARM_INT_AREA.MSG_VAR_VALUE_6   = 'RCB024';
       PARM_INT_AREA.MSG_VAR_CODE_7    = 'PK';
       PARM_INT_AREA.MSG_VAR_VALUE_7   =  STRING (TB_RCBP24S.EXTRA_KEY);
       CALL RCB0M1M (PTR_INT_AREA);
       CALL RCBBCZM_ERROR (NULL(),
                          'OTHER',
                          '#005');
     END;
   OTHERWISE
     DO;
       CALL RCBBCZM_ERROR (ADDR (PARM_RET_AREA_BB.RETURN_SQL),
                           'DB2',
                           '#006');
     END;
 END;

 IF ((WRK_FILE_ACT = 'RCBBCA1' & SK3.EOF = '1') |
    ( WRK_FILE_ACT = 'RCBBCA6' & SK13.EOF = '1')|
    ( WRK_FILE_ACT = 'RCBBCA9' & SK19.EOF = '1')|
    ( WRK_FILE_ACT = 'RCBBCAA' & SK21.EOF = '1')) THEN
   RCBP24S_CEDS.TIME_STAMP = WRK_TIME_STAMP_RCBBS26;

 IF RCBP24S_CEDS.TIME_STAMP ¬= WRK_TIME_STAMP_RCBBS26
 THEN
   DO;
    PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
    PARM_INT_AREA.MSG_VAR_CODES    = '';
    PARM_INT_AREA.MESSAGE_NUMBER   = '0174';
    PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
    PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS26;
    PARM_INT_AREA.MSG_VAR_CODE_7   = 'TP';
    PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_TIME_STAMP_RCBBS26;
    PARM_INT_AREA.MSG_VAR_CODE_8   = 'TP';
    PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBP24S_CEDS.TIME_STAMP;
    CALL RCB0M1M (PTR_INT_AREA);
                                    /* ABEND                        */
        CALL RCBBCZM_ERROR (NULL(),
                        'OTHER',
                        '#007');
   END;
                      /* CHECK CORRECT RUN DATES IF COUNTRIES EQUAL */

 IF (WRK_FILE_ACT = 'RCBBCA0' | WRK_FILE_ACT = 'RCBBCA2' |
     WRK_FILE_ACT = 'RCBBCA5' | WRK_FILE_ACT = 'RCBBCA8' |
     WRK_FILE_ACT = 'RCBBCAB' )
 THEN DO;
   IF (SUBSTR (STRING(SSK),1,6) = SUBSTR (STRING(SK0),1,6)  &
       SUBSTR (STRING(SSK),1,6) = SUBSTR (STRING(SK1),1,6))
   THEN
     DO;
       IF (RCBBS16_HW.RUN_DATE ¬= RCBBS26_HW.RUN_DATE)
       THEN
         DO;
          PARM_INT_AREA.MSG_VAR_CODES    = '';
          PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
          PARM_INT_AREA.MESSAGE_NUMBER   = '0167';
          PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
          PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
          PARM_INT_AREA.MSG_VAR_CODE_7   = 'FL';
          PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_FILE_RCBBS26;
          PARM_INT_AREA.MSG_VAR_CODE_8   = 'D1';
          PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS16_HW.RUN_DATE;
          PARM_INT_AREA.MSG_VAR_CODE_9   = 'D2';
          PARM_INT_AREA.MSG_VAR_VALUE_9  = RCBBS26_HW.RUN_DATE;
          CALL RCB0M1M (PTR_INT_AREA);
          CALL RCBBCZM_ERROR (NULL(),
                             'OTHER',
                             '#008');
       END;
     END;
 END;
 IF ( WRK_FILE_ACT = 'RCBBCA1' | WRK_FILE_ACT = 'RCBBCAA' ) THEN DO;

 IF (SUBSTR (STRING(SSK1),1,6) = SUBSTR (STRING(SK2),1,6)  &
     SUBSTR (STRING(SSK1),1,6) = SUBSTR (STRING(SK3),1,6))
 THEN
   DO;
     IF (RCBBS17_HW.RUN_DATE ¬= RCBBS27_HW.RUN_DATE)
     THEN
       DO;
         PARM_INT_AREA.MSG_VAR_CODES    = '';
         PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
         PARM_INT_AREA.MESSAGE_NUMBER   = '0167';
         PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
         PARM_INT_AREA.MSG_VAR_CODE_7   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_FILE_RCBBS26;
         PARM_INT_AREA.MSG_VAR_CODE_6   = 'D1';
         PARM_INT_AREA.MSG_VAR_VALUE_6  = RCBBS17_HW.RUN_DATE;
         PARM_INT_AREA.MSG_VAR_CODE_7   = 'D2';
         PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS27_HW.RUN_DATE;
         CALL RCB0M1M (PTR_INT_AREA);
         CALL RCBBCZM_ERROR (NULL(),
                             'OTHER',
                             '#009');
       END;
   END;
 END;
 IF ( WRK_FILE_ACT = 'RCBBCA3' | WRK_FILE_ACT = 'RCBBCA4' ) THEN DO;

 IF (SUBSTR (STRING(SSK2),1,6) = SUBSTR (STRING(SK6),1,6)  &
     SUBSTR (STRING(SSK2),1,6) = SUBSTR (STRING(SK7),1,6))
 THEN
   DO;
     IF (RCBBS19_HW.RUN_DATE ¬= RCBBS29_HW.RUN_DATE)
     THEN
       DO;
         PARM_INT_AREA.MSG_VAR_CODES    = '';
         PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
         PARM_INT_AREA.MESSAGE_NUMBER   = '0167';
         PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
         PARM_INT_AREA.MSG_VAR_CODE_7   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_FILE_RCBBS26;
         PARM_INT_AREA.MSG_VAR_CODE_8   = 'D1';
         PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS19_HW.RUN_DATE;
         PARM_INT_AREA.MSG_VAR_CODE_9   = 'D2';
         PARM_INT_AREA.MSG_VAR_VALUE_9  = RCBBS29_HW.RUN_DATE;
         CALL RCB0M1M (PTR_INT_AREA);
         CALL RCBBCZM_ERROR (NULL(),
                             'OTHER',
                             '#010');
       END;
   END;
 END;
 IF ( WRK_FILE_ACT = 'RCBBCA6' ) THEN DO;

 IF (SUBSTR (STRING(SSK3),1,6) = SUBSTR (STRING(SK12),1,6)  &
     SUBSTR (STRING(SSK3),1,6) = SUBSTR (STRING(SK13),1,6))
 THEN
   DO;
     IF (RCBBS1C_HW.RUN_DATE ¬= RCBBS2C_HW.RUN_DATE)
     THEN
       DO;
         PARM_INT_AREA.MSG_VAR_CODES    = '';
         PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
         PARM_INT_AREA.MESSAGE_NUMBER   = '0167';
         PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
         PARM_INT_AREA.MSG_VAR_CODE_7   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_FILE_RCBBS26;
         PARM_INT_AREA.MSG_VAR_CODE_8   = 'D1';
         PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS1C_HW.RUN_DATE;
         PARM_INT_AREA.MSG_VAR_CODE_9   = 'D2';
         PARM_INT_AREA.MSG_VAR_VALUE_9  = RCBBS2C_HW.RUN_DATE;
         CALL RCB0M1M (PTR_INT_AREA);
         CALL RCBBCZM_ERROR (NULL(),
                             'OTHER',
                             '#011');
       END;
   END;
 END;
 IF ( WRK_FILE_ACT = 'RCBBCA7' ) THEN DO;

 IF (SUBSTR (STRING(SSK4),1,6) = SUBSTR (STRING(SK14),1,6)  &
     SUBSTR (STRING(SSK4),1,6) = SUBSTR (STRING(SK15),1,6))
 THEN
   DO;
     IF (RCBBS1D_HW.RUN_DATE ¬= RCBBS2D_HW.RUN_DATE)
     THEN
       DO;
         PARM_INT_AREA.MSG_VAR_CODES    = '';
         PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
         PARM_INT_AREA.MESSAGE_NUMBER   = '0167';
         PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
         PARM_INT_AREA.MSG_VAR_CODE_7   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_FILE_RCBBS26;
         PARM_INT_AREA.MSG_VAR_CODE_8   = 'D1';
         PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS1D_HW.RUN_DATE;
         PARM_INT_AREA.MSG_VAR_CODE_9   = 'D2';
         PARM_INT_AREA.MSG_VAR_VALUE_9  = RCBBS2D_HW.RUN_DATE;
         CALL RCB0M1M (PTR_INT_AREA);
         CALL RCBBCZM_ERROR (NULL(),
                             'OTHER',
                             '#012');
       END;
   END;
 END;
 IF ( WRK_FILE_ACT = 'RCBBCA9' ) THEN DO;

 IF (SUBSTR (STRING(SSK5),1,6) = SUBSTR (STRING(SK18),1,6)  &
     SUBSTR (STRING(SSK5),1,6) = SUBSTR (STRING(SK19),1,6))
 THEN
   DO;
     IF (RCBBS1F_HW.RUN_DATE ¬= RCBBS2F_HW.RUN_DATE)
     THEN
       DO;
         PARM_INT_AREA.MSG_VAR_CODES    = '';
         PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
         PARM_INT_AREA.MESSAGE_NUMBER   = '0167';
         PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
         PARM_INT_AREA.MSG_VAR_CODE_7   = 'FL';
         PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_FILE_RCBBS26;
         PARM_INT_AREA.MSG_VAR_CODE_8   = 'D1';
         PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS1F_HW.RUN_DATE;
         PARM_INT_AREA.MSG_VAR_CODE_9   = 'D2';
         PARM_INT_AREA.MSG_VAR_VALUE_9  = RCBBS2F_HW.RUN_DATE;
         CALL RCB0M1M (PTR_INT_AREA);
         CALL RCBBCZM_ERROR (NULL(),
                             'OTHER',
                             '#013');
       END;
   END;
 END;

0END RCBBCZM_INIT_COUNTRY;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : INIT_COUNTRY_INSERT                           */
 /*                                                                  */
 /* DESCRIPTION      : INSERT ALL THE COUNTRY PRESENT IN             */
 /*                    RCB000 PARAMETER                              */
 /*                                                                  */
 /********************************************************************/
0INIT_COUNTRY_INSERT: PROC;

  DCL I FIXED BIN(31) INIT('1');
  COUNTRY_AREA ='';
  CALL RCB019M (PTR_COUNTRY_AREA,PTR_INT_AREA);/* RETRIEVE COUNTRY  */
  DO WHILE(COUNTRY_AREA.CTRY_ARRAY(I).CTRYNO ¬= '');
    PREV_SSK.CTRYNO = COUNTRY_AREA.CTRY_ARRAY(I).CTRYNO;
    CALL RCBBCZM_SAVE_HASH;
    I=I+1;
  END;
   PREV_SSK.CTRYNO='';
 END INIT_COUNTRY_INSERT;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS16_S26                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS16 AND RCBBS26                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS16_S26: PROC;
                                 /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                 /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                  /* SET ITERATION CONDITIONS     */
 CALL PROCESS_CA0_2_5_8_B; /* MAIN PROCESSING */

 CALL R099_TERM_S16_S26;              /*TERMINATE RCBBCA0 PROCESSING*/

 END MERGE_RCBBS16_S26;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS17_S27                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS17 AND RCBBS27                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS17_S27: PROC;

 WRK_SOURCE_INDICATOR   = '';           /* INITIALISE ALL VARIABLES */
 SSK1                   = '';
 SK2                    = '';
 SK3                    = '';
 PREV_SSK1              = '';
 SK2.EOF                = '0';
 SK3.EOF                = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA1';

                                 /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                 /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;


 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                  /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA1_A; /* MAIN PROCESSING */

 CALL R099_TERM_S17_S27;             /*TERMINATE RCBBCA1 PROCESSING*/

 END MERGE_RCBBS17_S27;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS18_S28                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS18 AND RCBBS28                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS18_S28: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK                    = '';
 SK0                    = '';
 SK1                    = '';
 PREV_SSK               = '';
 SK0.EOF                = '0';
 SK1.EOF                = '0';
 SK4.EOF                = '0';
 SK5.EOF                = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA2';

                                 /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                 /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                  /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA0_2_5_8_B; /* MAIN PROCESSING */

 CALL R099_TERM_S18_S28;           /*TERMINATE RCBBCA2 PROCESSING  */

 END MERGE_RCBBS18_S28;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS19_S29                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS19 AND RCBBS29                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS19_S29: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SK6                    = '';
 SK7                    = '';
 SSK2                   = '';
 PREV_SSK2              = '';
 SK6.EOF                = '0';
 SK7.EOF                = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA3';

                                 /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                 /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                  /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA3_4; /* MAIN PROCESSING */

 CALL R099_TERM_S19_S29;              /*TERMINATE RCBBCA3 PROCESSING*/

 END MERGE_RCBBS19_S29;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1A_S2A                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1A AND RCBBS2A                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1A_S2A: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK2                   = '';
 SK6                    = '';
 SK7                    = '';
 PREV_SSK2              = '';
 SK6.EOF                = '0';
 SK7.EOF                = '0';
 SK8.EOF                = '0';
 SK9.EOF                = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA4';

                                 /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                 /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                  /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA3_4; /* MAIN PROCESSING */

 CALL R099_TERM_S1A_S2A;             /*TERMINATE RCBBCA4 PROCESSING*/

 END MERGE_RCBBS1A_S2A;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1B_S2B                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1B AND RCBBS2B                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1B_S2B: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK                    = '';
 SK0                    = '';
 SK1                    = '';
 PREV_SSK               = '';
 SK0.EOF                = '0';
 SK1.EOF                = '0';
 SK10.EOF               = '0';
 SK11.EOF               = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA5';

                                  /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                  /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                   /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA0_2_5_8_B; /* MAIN PROCESSING */

 CALL R099_TERM_S1B_S2B;               /*TERMINATE RCBBCA5 PROCESSING*/

 END MERGE_RCBBS1B_S2B;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1C_S2C                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1C AND RCBBS2C                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1C_S2C: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK3                   = '';
 PREV_SSK3              = '';
 SK12.EOF               = '0';
 SK13.EOF               = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA6';
                                  /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                  /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                   /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA6; /* MAIN PROCESSING */

 CALL R099_TERM_S1C_S2C;               /*TERMINATE RCBBCA6 PROCESSING*/

 END MERGE_RCBBS1C_S2C;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1D_S2D                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1D AND RCBBS2D                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1D_S2D: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK4                   = '';
 PREV_SSK4              = '';
 SK14.EOF               = '0';
 SK15.EOF               = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA7';
                                  /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                  /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;          /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                   /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA7; /* MAIN PROCESSING */

 CALL R099_TERM_S1D_S2D;               /*TERMINATE RCBBCA7 PROCESSING*/

 END MERGE_RCBBS1D_S2D;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1E_S2E                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1E AND RCBBS2E                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1E_S2E: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK                    = '';
 SK0                    = '';
 SK1                    = '';
 PREV_SSK               = '';
 SK0.EOF                = '0';
 SK1.EOF                = '0';
 SK16.EOF               = '0';
 SK17.EOF               = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA8';

                                  /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                  /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                   /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA0_2_5_8_B; /* MAIN PROCESSING */

 CALL R099_TERM_S1E_S2E;               /*TERMINATE RCBBCA8 PROCESSING*/

 END MERGE_RCBBS1E_S2E;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1F_S2F                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1F AND RCBBS2F                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1F_S2F: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK5                   = '';
 SK18                   = '';
 SK19                   = '';
 PREV_SSK5              = '';
 SK18.EOF               = '0';
 SK19.EOF               = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCA9';

                                  /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                  /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                   /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA9; /* MAIN PROCESSING */

 CALL R099_TERM_S1F_S2F;               /*TERMINATE RCBBCA9 PROCESSING*/

 END MERGE_RCBBS1F_S2F;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1G_S2G                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1G AND RCBBS2G                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1G_S2G: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK1                   = '';
 SK2                    = '';
 SK3                    = '';
 PREV_SSK1              = '';
 SK2.EOF                = '0';
 SK3.EOF                = '0';
 SK20.EOF               = '0';
 SK21.EOF               = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCAA';

                                 /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                 /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                  /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA1_A; /* MAIN PROCESSING */

 CALL R099_TERM_S1G_S2G;             /*TERMINATE RCBBCAA PROCESSING*/

 END MERGE_RCBBS1G_S2G;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : MERGE_RCBBS1H_S2H                             */
 /*                                                                  */
 /* DESCRIPTION      : MERGE RCBBS1H AND RCBBS2H                     */
 /*                                                                  */
 /********************************************************************/
 MERGE_RCBBS1H_S2H: PROC;

 WRK_SOURCE_INDICATOR   = '';            /* INITIALISE ALL VARIABLES */
 SSK                    = '';
 SK0                    = '';
 SK1                    = '';
 PREV_SSK               = '';
 SK0.EOF                = '0';
 SK1.EOF                = '0';
 SK22.EOF               = '0';
 SK23.EOF               = '0';
 COUNT                  =  0 ;
 WRK_FILE_ACT           = 'RCBBCAB';
                                  /* CHECK HEADER RECORDS            */
 CALL RCBBCZM_CHECK_HEADER;
 CALL RCBBCZM_FILL_HEADER;
                                  /* READ RECORDS OF BOTH FILES      */
 CALL R010_READ0;
 CALL R011_READ1;

 CALL INIT_COUNTRY_INSERT;         /* INSERT COUNTRY IN RCB000 PARM */
 CALL RCBBCZM_SIC;                   /* SET ITERATION CONDITIONS     */

 CALL PROCESS_CA0_2_5_8_B; /* MAIN PROCESSING */

 CALL R099_TERM_S1H_S2H;               /*TERMINATE RCBBCAB PROCESSING*/

 END MERGE_RCBBS1H_S2H;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : PROCESS_CA0_2_5_8_B                           */
 /*                                                                  */
 /* DESCRIPTION      : PROCESS THE FILES CA0,CA2,CA5,CA8,CAB FILES   */
 /********************************************************************/
 PROCESS_CA0_2_5_8_B: PROC;
0DO WHILE (SSK.EOF = '0'
        &  SSK.REC_TYPE ¬= '99');    /* WHILE NOT EOF                */
0  CALL RCBBCZM_INIT_COUNTRY;
0  DO WHILE (SUBSTR (STRING (PREV_SSK), 1, 6)  /* WHILE SAME COUNTRY */
             = SUBSTR (STRING (SSK), 1, 6));
      SELECT;
       WHEN(STRING(SK0) < STRING(SK1)) /* SOURCE S1 SMALLEST         */
          DO;
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
          END;
       WHEN(STRING(SK0) > STRING(SK1)) /* SOURCE S2 SMALLEST         */
          DO;
           CALL R031_INSERT_RCBBS26;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
       OTHERWISE DO;                 /* KEYS ARE EQUAL               */
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
      END;

     CALL RCBBCZM_SIC;               /* SET ITERATION CONDITIONS     */
   END;
0      CALL RCBBCZM_END_COUNTRY;                      /* END COUNTRY */
0END;

 END PROCESS_CA0_2_5_8_B;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : PROCESS_CA1_A                                 */
 /*                                                                  */
 /* DESCRIPTION      : PROCESS CA1,CAA FILES                         */
 /********************************************************************/
 PROCESS_CA1_A: PROC;
0DO WHILE (SSK1.EOF = '0'
        &  SSK1.REC_TYPE ¬= '99');    /* WHILE NOT EOF                */
0    CALL RCBBCZM_INIT_COUNTRY;
0  DO WHILE (SUBSTR (STRING (PREV_SSK1), 1, 6)  /* WHILE SAME COUNTRY */
             = SUBSTR (STRING (SSK1), 1, 6));
      SELECT;
       WHEN(STRING(SK2) < STRING(SK3)) /* SOURCE S1 SMALLEST         */
          DO;
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
          END;
       WHEN(STRING(SK2) > STRING(SK3)) /* SOURCE S2 SMALLEST         */
          DO;
           CALL R031_INSERT_RCBBS26;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
       OTHERWISE DO;                 /* KEYS ARE EQUAL               */
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
      END;

     CALL RCBBCZM_SIC;               /* SET ITERATION CONDITIONS     */
   END;
0      CALL RCBBCZM_END_COUNTRY;                      /* END COUNTRY */
0END;

 END PROCESS_CA1_A;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : PROCESS_CA3_4                                 */
 /*                                                                  */
 /* DESCRIPTION      : PROCESS CA3,CA4 FILES                         */
 /********************************************************************/
 PROCESS_CA3_4: PROC;

0DO WHILE (SSK2.EOF = '0'
        &  SSK2.REC_TYPE ¬= '99');    /* WHILE NOT EOF                */
0  CALL RCBBCZM_INIT_COUNTRY;
0  DO WHILE (SUBSTR (STRING (PREV_SSK2), 1, 6)  /* WHILE SAME COUNTRY */
             = SUBSTR (STRING (SSK2), 1, 6));
      SELECT;
       WHEN(STRING(SK6) < STRING(SK7)) /* SOURCE S1 SMALLEST         */
          DO;
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
          END;
       WHEN(STRING(SK6) > STRING(SK7)) /* SOURCE S2 SMALLEST         */
          DO;
           CALL R031_INSERT_RCBBS26;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
       OTHERWISE DO;                 /* KEYS ARE EQUAL               */
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
      END;

     CALL RCBBCZM_SIC;               /* SET ITERATION CONDITIONS     */
   END;
0      CALL RCBBCZM_END_COUNTRY;                      /* END COUNTRY */
0END;

 END PROCESS_CA3_4;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : PROCESS_CA6                                   */
 /*                                                                  */
 /* DESCRIPTION      : PROCESS CA6 FILES                             */
 /********************************************************************/
 PROCESS_CA6: PROC;

0DO WHILE (SSK3.EOF = '0'
        &  SSK3.REC_TYPE ¬= '99');    /* WHILE NOT EOF                */
0    CALL RCBBCZM_INIT_COUNTRY;
0  DO WHILE (SUBSTR (STRING (PREV_SSK3), 1, 6)  /* WHILE SAME COUNTRY */
             = SUBSTR (STRING (SSK3), 1, 6));
      SELECT;
       WHEN(STRING(SK12) < STRING(SK13)) /* SOURCE S1 SMALLEST      */
          DO;
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
          END;
       WHEN(STRING(SK12) > STRING(SK13)) /* SOURCE S2 SMALLEST      */
          DO;
           CALL R031_INSERT_RCBBS26;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
       OTHERWISE DO;                 /* KEYS ARE EQUAL               */
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
      END;

     CALL RCBBCZM_SIC;               /* SET ITERATION CONDITIONS     */
   END;
0      CALL RCBBCZM_END_COUNTRY;                      /* END COUNTRY */
0END;

 END PROCESS_CA6;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : PROCESS_CA7                                   */
 /*                                                                  */
 /* DESCRIPTION      : PROCESS CA7 FILES                             */
 /********************************************************************/
 PROCESS_CA7: PROC;

0DO WHILE (SSK4.EOF = '0'
        &  SSK4.REC_TYPE ¬= '99');    /* WHILE NOT EOF                */
0    CALL RCBBCZM_INIT_COUNTRY;
0  DO WHILE (SUBSTR (STRING (PREV_SSK4), 1, 6)  /* WHILE SAME COUNTRY */
             = SUBSTR (STRING (SSK4), 1, 6));
      SELECT;
       WHEN(STRING(SK14) < STRING(SK15))  /* SOURCE S1 SMALLEST      */
          DO;
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
          END;
       WHEN(STRING(SK14) > STRING(SK15))  /* SOURCE S2 SMALLEST      */
          DO;
           CALL R031_INSERT_RCBBS26;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
       OTHERWISE DO;                 /* KEYS ARE EQUAL               */
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
      END;

     CALL RCBBCZM_SIC;               /* SET ITERATION CONDITIONS     */
   END;
0      CALL RCBBCZM_END_COUNTRY;                      /* END COUNTRY */
0END;

 END PROCESS_CA7;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : PROCESS_CA9                                   */
 /*                                                                  */
 /* DESCRIPTION      : PROCESS CA9 FILES                             */
 /********************************************************************/
 PROCESS_CA9: PROC;

0DO WHILE (SSK5.EOF = '0'
        &  SSK5.REC_TYPE ¬= '99');    /* WHILE NOT EOF                */
0    CALL RCBBCZM_INIT_COUNTRY;
0  DO WHILE (SUBSTR (STRING (PREV_SSK5), 1, 6)  /* WHILE SAME COUNTRY */
             = SUBSTR (STRING (SSK5), 1, 6));
      SELECT;
       WHEN(STRING(SK18) < STRING(SK19))  /* SOURCE S1 SMALLEST      */
          DO;
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
          END;
       WHEN(STRING(SK18) > STRING(SK19))  /* SOURCE S2 SMALLEST      */
          DO;
           CALL R031_INSERT_RCBBS26;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
       OTHERWISE DO;                 /* KEYS ARE EQUAL               */
           CALL R030_INSERT_RCBBS16;
           CALL RCBBCZM_CALC1;
           CALL R010_READ0;
           CALL RCBBCZM_CALC2;
           CALL R011_READ1;
          END;
      END;

     CALL RCBBCZM_SIC;               /* SET ITERATION CONDITIONS     */
   END;
0      CALL RCBBCZM_END_COUNTRY;                      /* END COUNTRY */
0END;

 END PROCESS_CA9;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R010_READ0                                    */
 /*                                                                  */
 /* DESCRIPTION      : READ S1 FILE                                  */
 /********************************************************************/
 R010_READ0: PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 IOAREA0 = '';
 READ FILE(RCBBS16) INTO (IOAREA0);

 IF SK0.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK0.REC_TYPE = RCBBS16_H.REC_TYPE;
      IF RCBBS16_H.REC_TYPE = '02'
      THEN
        DO;
         SK0.CTRYNO            = RCBBS16_HW.CTRYNO;
         SK0.COUNTRY_NUMBER    = RCBBS16_HW.COUNTRY_NUMBER;
         SK0.PRODUCT_TYPE      = RCBBS16_HW.PRODUCT_TYPE;
         SK0.ORIGIN            = RCBBS16_HW.ORIGIN;
         SK0.SEQUENCE_NUMBER   = RCBBS16_HW.SEQUENCE_NUMBER;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 IOAREA3 = '';
 READ FILE(RCBBS17) INTO (IOAREA3);

 IF SK2.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK2.REC_TYPE = RCBBS17_H.REC_TYPE;
      IF RCBBS17_H.REC_TYPE = '02'
      THEN
        DO;
         SK2.CTRYNO            = RCBBS17_HW.CTRYNO;
         SK2.MES_ORDER_NUMBER  = RCBBS17_HW.MES_ORDER_NUMBER;
         SK2.NAME_CODE         = RCBBS17_HW.NAME_CODE;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 IOAREA6 = '';
 READ FILE(RCBBS18) INTO (IOAREA6);

 IF SK4.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK0.REC_TYPE = RCBBS18_H.REC_TYPE;
      IF RCBBS18_H.REC_TYPE = '02'
      THEN
        DO;
         SK0.CTRYNO            = RCBBS18_HW.CTRYNO;
         SK0.COUNTRY_NUMBER    = RCBBS18_HW.COUNTRY_NUMBER;
         SK0.PRODUCT_TYPE      = RCBBS18_HW.PRODUCT_TYPE;
         SK0.ORIGIN            = RCBBS18_HW.ORIGIN;
         SK0.SEQUENCE_NUMBER   = RCBBS18_HW.SEQUENCE_NUMBER;
        END;
     END;
   SK0.EOF = SK4.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 IOAREA9 = '';
 READ FILE(RCBBS19) INTO (IOAREA9);

 IF SK6.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK6.REC_TYPE = RCBBS19_H.REC_TYPE;
      IF RCBBS19_H.REC_TYPE = '02'
      THEN
        DO;
         SK6.CTRYNO               = RCBBS19_HW.CTRYNO;
         SK6.COUNTRY_NUMBER       = RCBBS19_HW.COUNTRY_NUMBER;
         SK6.PRODUCT_TYPE         = RCBBS19_HW.PRODUCT_TYPE;
         SK6.ORIGIN               = RCBBS19_HW.ORIGIN;
         SK6.SEQUENCE_NUMBER      = RCBBS19_HW.SEQUENCE_NUMBER;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 IOAREA12 = '';
 READ FILE(RCBBS1A) INTO (IOAREA12);
 IF SK8.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK6.REC_TYPE = RCBBS1A_H.REC_TYPE;
      IF RCBBS1A_H.REC_TYPE = '02'
      THEN
        DO;
         SK6.CTRYNO               = RCBBS1A_HW.CTRYNO;
         SK6.COUNTRY_NUMBER       = RCBBS1A_HW.COUNTRY_NUMBER;
         SK6.PRODUCT_TYPE         = RCBBS1A_HW.PRODUCT_TYPE;
         SK6.ORIGIN               = RCBBS1A_HW.ORIGIN;
         SK6.SEQUENCE_NUMBER      = RCBBS1A_HW.SEQUENCE_NUMBER;
         SK6.FILLER               = RCBBS1A_HW.TYPE_OF_RELATION;
        END;
     END;
  SK6.EOF = SK8.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 IOAREA15 = '';
 READ FILE(RCBBS1B) INTO (IOAREA15);

 IF SK10.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK0.REC_TYPE = RCBBS1B_H.REC_TYPE;
      IF RCBBS1B_H.REC_TYPE = '02'
      THEN
        DO;
         SK0.CTRYNO            = RCBBS1B_HW.CTRYNO;
         SK0.COUNTRY_NUMBER    = RCBBS1B_HW.COUNTRY_NUMBER;
         SK0.PRODUCT_TYPE      = RCBBS1B_HW.PRODUCT_TYPE;
         SK0.ORIGIN            = RCBBS1B_HW.ORIGIN;
         SK0.SEQUENCE_NUMBER   = RCBBS1B_HW.SEQUENCE_NUMBER;
        END;
     END;
   SK0.EOF = SK10.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 IOAREA18 = '';
 READ FILE(RCBBS1C) INTO (IOAREA18);

 IF SK12.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK12.REC_TYPE = RCBBS1C_H.REC_TYPE;
      IF RCBBS1C_H.REC_TYPE = '02'
      THEN
        DO;
         SK12.CTRYNO               = RCBBS1C_HW.CTRYNO;
         SK12.MES_ORDER_NUMBER     = RCBBS1C_HW.MES_ORDER_NUMBER;
         SK12.NAME_CODE            = RCBBS1C_HW.NAME_CODE;
         SK12.PRODUCT_TYPE         = RCBBS1C_HW.PRODUCT_TYPE;
         SK12.ORIGIN               = RCBBS1C_HW.ORIGIN;
         SK12.SEQUENCE_NUMBER      = RCBBS1C_HW.SEQUENCE_NUMBER;
         SK12.COUNTRY_NUMBER       = RCBBS1C_HW.COUNTRY_NUMBER;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 IOAREA21 = '';
 READ FILE(RCBBS1D) INTO (IOAREA21);

 IF SK14.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK14.REC_TYPE = RCBBS1D_H.REC_TYPE;
      IF RCBBS1D_H.REC_TYPE = '02'
      THEN
        DO;
         SK14.CTRYNO               = RCBBS1D_HW.CTRYNO;
         SK14.ORDER_REF_NUMBER     = RCBBS1D_HW.ORDER_REF_NUMBER;
         SK14.COUNTRY_NUMBER       = RCBBS1D_HW.COUNTRY_NUMBER;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 IOAREA24 = '';
 READ FILE(RCBBS1E) INTO (IOAREA24);

 IF SK16.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK0.REC_TYPE = RCBBS1E_H.REC_TYPE;
      IF RCBBS1E_H.REC_TYPE = '02'
      THEN
        DO;
         SK0.CTRYNO               = RCBBS1E_HW.CTRYNO;
         SK0.PRODUCT_TYPE         = RCBBS1E_HW.PRODUCT_TYPE;
         SK0.ORIGIN               = RCBBS1E_HW.ORIGIN;
         SK0.SEQUENCE_NUMBER      = RCBBS1E_HW.SEQUENCE_NUMBER;
         SK0.COUNTRY_NUMBER       = RCBBS1E_HW.COUNTRY_NUMBER;
        END;
     END;
   SK0.EOF = SK16.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 IOAREA27 = '';
 READ FILE(RCBBS1F) INTO (IOAREA27);

 IF SK18.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK18.REC_TYPE = RCBBS1F_H.REC_TYPE;
      IF RCBBS1F_H.REC_TYPE = '02'
      THEN
        DO;
         SK18.CTRYNO               = RCBBS1F_HW.CTRYNO;
         SK18.PRODUCT_TYPE         = RCBBS1F_HW.PRODUCT_TYPE;
         SK18.ORIGIN               = RCBBS1F_HW.ORIGIN;
         SK18.SEQUENCE_NUMBER      = RCBBS1F_HW.SEQUENCE_NUMBER;
         SK18.FEATURE_RPQ_CODE     = RCBBS1F_HW.FEATURE_RPQ_CODE;
         SK18.COUNTRY_NUMBER       = RCBBS1F_HW.COUNTRY_NUMBER;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 IOAREA30 = '';
 READ FILE(RCBBS1G) INTO (IOAREA30);
 IF SK20.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK2.REC_TYPE = RCBBS1G_H.REC_TYPE;
      IF RCBBS1G_H.REC_TYPE = '02'
      THEN
        DO;
         SK2.CTRYNO               = RCBBS1G_HW.CTRYNO;
         SK2.MES_ORDER_NUMBER     = RCBBS1G_HW.MES_ORDER_NUMBER;
         SK2.NAME_CODE            = RCBBS1G_HW.NAME_CODE;
         SK2.FILLER1              = RCBBS1G_HW.ORDER_REF_NUMBER;
        END;
     END;
   SK2.EOF = SK20.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 IOAREA33 = '';
 READ FILE(RCBBS1H) INTO (IOAREA33);

 IF SK22.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK0.REC_TYPE = RCBBS1H_H.REC_TYPE;
      IF RCBBS1H_H.REC_TYPE = '02'
      THEN
        DO;
         SK0.CTRYNO            = RCBBS1H_HW.CTRYNO;
         SK0.PRODUCT_TYPE      = RCBBS1H_HW.PRODUCT_TYPE;
         SK0.ORIGIN            = RCBBS1H_HW.ORIGIN;
         SK0.SEQUENCE_NUMBER   = RCBBS1H_HW.SEQUENCE_NUMBER;
         SK0.COUNTRY_NUMBER    = RCBBS1H_HW.COUNTRY_NUMBER;
        END;
     END;
   SK0.EOF = SK22.EOF;
 END;

 END R010_READ0;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CALC1                                 */
 /*                                                                  */
 /* DESCRIPTION      : CALC HASH TOTAL AND COUNTS FOR S1 FILES       */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CALC1: PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 COUNT.CNT_CTRY.RCBBS16   = COUNT.CNT_CTRY.RCBBS16 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS16_HW.RCB050S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS16_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 COUNT.CNT_CTRY.RCBBS17   = COUNT.CNT_CTRY.RCBBS17 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS17_HW.RCB100S.MES_ORDER_NUMBER, 1, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS17_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 COUNT.CNT_CTRY.RCBBS18   = COUNT.CNT_CTRY.RCBBS18 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS18_HW.RCB110S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS18_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 COUNT.CNT_CTRY.RCBBS19   = COUNT.CNT_CTRY.RCBBS19 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS19_HW.RCB170S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS19_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 COUNT.CNT_CTRY.RCBBS1A   = COUNT.CNT_CTRY.RCBBS1A + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1A_HW.RCB190S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1A_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 COUNT.CNT_CTRY.RCBBS1B   = COUNT.CNT_CTRY.RCBBS1B + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1B_HW.RCB220S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1B_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 COUNT.CNT_CTRY.RCBBS1C   = COUNT.CNT_CTRY.RCBBS1C + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1C_HW.RCB250S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1C_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 COUNT.CNT_CTRY.RCBBS1D   = COUNT.CNT_CTRY.RCBBS1D + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1D_HW.RCB260S.ORDER_REF_NUMBER, 1, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1D_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 COUNT.CNT_CTRY.RCBBS1E   = COUNT.CNT_CTRY.RCBBS1E + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1E_HW.RCB300S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1E_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 COUNT.CNT_CTRY.RCBBS1F   = COUNT.CNT_CTRY.RCBBS1F + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1F_HW.RCB310S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1F_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 COUNT.CNT_CTRY.RCBBS1G   = COUNT.CNT_CTRY.RCBBS1G + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1G_HW.RCB330S.MES_ORDER_NUMBER, 1, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1G_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 COUNT.CNT_CTRY.RCBBS1H   = COUNT.CNT_CTRY.RCBBS1H + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS1H_HW.RCB380S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS1H_HASH,
               PTR_INT_AREA);
 END;

 END RCBBCZM_CALC1;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R011_READ1                                    */
 /*                                                                  */
 /* DESCRIPTION      : READ S2 FILES                                 */
 /********************************************************************/
 R011_READ1: PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 IOAREA1 = '';
 READ FILE(RCBBS26) INTO (IOAREA1);
 IF SK1.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK1.REC_TYPE = RCBBS26_H.REC_TYPE;
      IF RCBBS26_H.REC_TYPE = '02'
      THEN
       DO;
         SK1.CTRYNO           = RCBBS26_HW.CTRYNO;
         SK1.COUNTRY_NUMBER   = RCBBS26_HW.COUNTRY_NUMBER;
         SK1.PRODUCT_TYPE     = RCBBS26_HW.PRODUCT_TYPE;
         SK1.ORIGIN           = RCBBS26_HW.ORIGIN;
         SK1.SEQUENCE_NUMBER  = RCBBS26_HW.SEQUENCE_NUMBER;
       END;
    END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 IOAREA4 = '';
 READ FILE(RCBBS27) INTO (IOAREA4);

 IF SK3.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK3.REC_TYPE = RCBBS27_H.REC_TYPE;
      IF RCBBS27_H.REC_TYPE = '02'
      THEN
       DO;
         SK3.CTRYNO            = RCBBS27_HW.CTRYNO;
         SK3.MES_ORDER_NUMBER  = RCBBS27_HW.MES_ORDER_NUMBER;
         SK3.NAME_CODE         = RCBBS27_HW.NAME_CODE;
       END;
    END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 IOAREA7 = '';
 READ FILE(RCBBS28) INTO (IOAREA7);
 IF SK5.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK1.REC_TYPE = RCBBS28_H.REC_TYPE;
      IF RCBBS28_H.REC_TYPE = '02'
      THEN
       DO;
         SK1.CTRYNO           = RCBBS28_HW.CTRYNO;
         SK1.COUNTRY_NUMBER   = RCBBS28_HW.COUNTRY_NUMBER;
         SK1.PRODUCT_TYPE     = RCBBS28_HW.PRODUCT_TYPE;
         SK1.ORIGIN           = RCBBS28_HW.ORIGIN;
         SK1.SEQUENCE_NUMBER  = RCBBS28_HW.SEQUENCE_NUMBER;
       END;
    END;
   SK1.EOF = SK5.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 IOAREA10 = '';
 READ FILE(RCBBS29) INTO (IOAREA10);
 IF SK7.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK7.REC_TYPE = RCBBS29_H.REC_TYPE;
      IF RCBBS29_H.REC_TYPE = '02'
      THEN
       DO;
         SK7.CTRYNO               = RCBBS29_HW.CTRYNO;
         SK7.COUNTRY_NUMBER       = RCBBS29_HW.COUNTRY_NUMBER;
         SK7.PRODUCT_TYPE         = RCBBS29_HW.PRODUCT_TYPE;
         SK7.ORIGIN               = RCBBS29_HW.ORIGIN;
         SK7.SEQUENCE_NUMBER      = RCBBS29_HW.SEQUENCE_NUMBER;
       END;
    END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 IOAREA13 = '';
 READ FILE(RCBBS2A) INTO (IOAREA13);
 IF SK9.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK7.REC_TYPE = RCBBS2A_H.REC_TYPE;
      IF RCBBS2A_H.REC_TYPE = '02'
      THEN
       DO;
         SK7.CTRYNO               = RCBBS2A_HW.CTRYNO;
         SK7.COUNTRY_NUMBER       = RCBBS2A_HW.COUNTRY_NUMBER;
         SK7.PRODUCT_TYPE         = RCBBS2A_HW.PRODUCT_TYPE;
         SK7.ORIGIN               = RCBBS2A_HW.ORIGIN;
         SK7.SEQUENCE_NUMBER      = RCBBS2A_HW.SEQUENCE_NUMBER;
         SK7.FILLER               = RCBBS2A_HW.TYPE_OF_RELATION;
       END;
    END;
  SK7.EOF = SK9.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 IOAREA16 = '';
 READ FILE(RCBBS2B) INTO (IOAREA16);
 IF SK11.EOF = '0' THEN                                   /* NOT EOF */
   DO;
     SK1.REC_TYPE = RCBBS2B_H.REC_TYPE;
      IF RCBBS2B_H.REC_TYPE = '02'
      THEN
       DO;
         SK1.CTRYNO           = RCBBS2B_HW.CTRYNO;
         SK1.COUNTRY_NUMBER   = RCBBS2B_HW.COUNTRY_NUMBER;
         SK1.PRODUCT_TYPE     = RCBBS2B_HW.PRODUCT_TYPE;
         SK1.ORIGIN           = RCBBS2B_HW.ORIGIN;
         SK1.SEQUENCE_NUMBER  = RCBBS2B_HW.SEQUENCE_NUMBER;
       END;
    END;
  SK1.EOF = SK11.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 IOAREA19 = '';
 READ FILE(RCBBS2C) INTO (IOAREA19);
 IF SK13.EOF = '0' THEN                                   /* NOT EOF */
   DO;
     SK13.REC_TYPE = RCBBS2C_H.REC_TYPE;
      IF RCBBS2C_H.REC_TYPE = '02'
      THEN
       DO;
         SK13.CTRYNO               = RCBBS2C_HW.CTRYNO;
         SK13.MES_ORDER_NUMBER     = RCBBS2C_HW.MES_ORDER_NUMBER;
         SK13.NAME_CODE            = RCBBS2C_HW.NAME_CODE;
         SK13.PRODUCT_TYPE         = RCBBS2C_HW.PRODUCT_TYPE;
         SK13.ORIGIN               = RCBBS2C_HW.ORIGIN;
         SK13.SEQUENCE_NUMBER      = RCBBS2C_HW.SEQUENCE_NUMBER;
         SK13.COUNTRY_NUMBER       = RCBBS2C_HW.COUNTRY_NUMBER;
       END;
    END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 IOAREA22 = '';
 READ FILE(RCBBS2D) INTO (IOAREA22);

 IF SK15.EOF = '0' THEN                                    /* NOT EOF */
   DO;
     SK15.REC_TYPE = RCBBS2D_H.REC_TYPE;
      IF RCBBS2D_H.REC_TYPE = '02'
      THEN
        DO;
         SK15.CTRYNO               = RCBBS2D_HW.CTRYNO;
         SK15.ORDER_REF_NUMBER     = RCBBS2D_HW.ORDER_REF_NUMBER;
         SK15.COUNTRY_NUMBER       = RCBBS2D_HW.COUNTRY_NUMBER;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 IOAREA25 = '';
 READ FILE(RCBBS2E) INTO (IOAREA25);

 IF SK17.EOF = '0' THEN
   DO;
     SK1.REC_TYPE = RCBBS2E_H.REC_TYPE;
      IF RCBBS2E_H.REC_TYPE = '02'
      THEN
        DO;
         SK1.CTRYNO               = RCBBS2E_HW.CTRYNO;
         SK1.PRODUCT_TYPE         = RCBBS2E_HW.PRODUCT_TYPE;
         SK1.ORIGIN               = RCBBS2E_HW.ORIGIN;
         SK1.SEQUENCE_NUMBER      = RCBBS2E_HW.SEQUENCE_NUMBER;
         SK1.COUNTRY_NUMBER       = RCBBS2E_HW.COUNTRY_NUMBER;
        END;
     END;
  SK1.EOF = SK17.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 IOAREA28 = '';
 READ FILE(RCBBS2F) INTO (IOAREA28);

 IF SK19.EOF = '0' THEN
   DO;
     SK19.REC_TYPE = RCBBS2F_H.REC_TYPE;
      IF RCBBS2F_H.REC_TYPE = '02'
      THEN
        DO;
         SK19.CTRYNO               = RCBBS2F_HW.CTRYNO;
         SK19.PRODUCT_TYPE         = RCBBS2F_HW.PRODUCT_TYPE;
         SK19.ORIGIN               = RCBBS2F_HW.ORIGIN;
         SK19.SEQUENCE_NUMBER      = RCBBS2F_HW.SEQUENCE_NUMBER;
         SK19.FEATURE_RPQ_CODE     = RCBBS2F_HW.FEATURE_RPQ_CODE;
         SK19.COUNTRY_NUMBER       = RCBBS2F_HW.COUNTRY_NUMBER;
        END;
     END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 IOAREA31 = '';
 READ FILE(RCBBS2G) INTO (IOAREA31);

 IF SK21.EOF = '0' THEN
   DO;
     SK3.REC_TYPE = RCBBS2G_H.REC_TYPE;
      IF RCBBS2G_H.REC_TYPE = '02'
      THEN
        DO;
         SK3.CTRYNO               = RCBBS2G_HW.CTRYNO;
         SK3.MES_ORDER_NUMBER     = RCBBS2G_HW.MES_ORDER_NUMBER;
         SK3.NAME_CODE            = RCBBS2G_HW.NAME_CODE;
         SK3.FILLER1              = RCBBS2G_HW.ORDER_REF_NUMBER;
        END;
     END;
  SK3.EOF = SK21.EOF;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 IOAREA34 = '';
 READ FILE(RCBBS2H) INTO (IOAREA34);

 IF SK23.EOF = '0' THEN
   DO;
     SK1.REC_TYPE = RCBBS2H_H.REC_TYPE;
      IF RCBBS2H_H.REC_TYPE = '02'
      THEN
        DO;
         SK1.CTRYNO            = RCBBS2H_HW.CTRYNO;
         SK1.PRODUCT_TYPE      = RCBBS2H_HW.PRODUCT_TYPE;
         SK1.ORIGIN            = RCBBS2H_HW.ORIGIN;
         SK1.SEQUENCE_NUMBER   = RCBBS2H_HW.SEQUENCE_NUMBER;
         SK1.COUNTRY_NUMBER    = RCBBS2H_HW.COUNTRY_NUMBER;
        END;
     END;
  SK1.EOF = SK23.EOF;
 END;

 END R011_READ1;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CALC2                                 */
 /*                                                                  */
 /* DESCRIPTION      : CALC HASH TOTAL AND COUNTS FOR S2 FILES       */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CALC2: PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 COUNT.CNT_CTRY.RCBBS26   = COUNT.CNT_CTRY.RCBBS26 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS26_HW.RCB050S.SEQUENCE_NUMBER, 3, 4);

 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS26_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 COUNT.CNT_CTRY.RCBBS27   = COUNT.CNT_CTRY.RCBBS27 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS27_HW.RCB100S.MES_ORDER_NUMBER, 1, 4);

 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS27_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 COUNT.CNT_CTRY.RCBBS28   = COUNT.CNT_CTRY.RCBBS28 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS28_HW.RCB110S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS28_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 COUNT.CNT_CTRY.RCBBS29   = COUNT.CNT_CTRY.RCBBS29 + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS29_HW.RCB170S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS29_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 COUNT.CNT_CTRY.RCBBS2A   = COUNT.CNT_CTRY.RCBBS2A + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2A_HW.RCB190S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2A_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 COUNT.CNT_CTRY.RCBBS2B   = COUNT.CNT_CTRY.RCBBS2B + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2B_HW.RCB220S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2B_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 COUNT.CNT_CTRY.RCBBS2C   = COUNT.CNT_CTRY.RCBBS2C + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2C_HW.RCB250S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2C_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 COUNT.CNT_CTRY.RCBBS2D   = COUNT.CNT_CTRY.RCBBS2D + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2D_HW.RCB260S.ORDER_REF_NUMBER, 1, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2D_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 COUNT.CNT_CTRY.RCBBS2E   = COUNT.CNT_CTRY.RCBBS2E + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2E_HW.RCB300S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2E_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 COUNT.CNT_CTRY.RCBBS2F   = COUNT.CNT_CTRY.RCBBS2F + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2F_HW.RCB310S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2F_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 COUNT.CNT_CTRY.RCBBS2G   = COUNT.CNT_CTRY.RCBBS2G + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2G_HW.RCB330S.MES_ORDER_NUMBER, 1, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2G_HASH,
               PTR_INT_AREA);
 END;
 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 COUNT.CNT_CTRY.RCBBS2H   = COUNT.CNT_CTRY.RCBBS2H + 1;
 WRK_HASH_FIELD           =
 SUBSTR (RCBBS2H_HW.RCB380S.SEQUENCE_NUMBER, 3, 4);
 CALL RCB018M (WRK_HASH_FIELD,
               COUNT.RCBBS2H_HASH,
               PTR_INT_AREA);
 END;

0END RCBBCZM_CALC2;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R030_INSERT                                   */
 /*                                                                  */
 /* DESCRIPTION      : WRITE TO 'CA' FILES-INSERT THE RECORDS FROM S1*/
 /*                                                                  */
 /********************************************************************/
 R030_INSERT_RCBBS16:PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 IOAREA2               = '';
 RCBBCA0_HW.REC_TYPE   = '02';
 RCBBCA0_HW.CTRYNO     = RCBBS16_HW.CTRYNO;
 RCBBCA0_HW.PGR_TYPE   = RCBBS16_HW.PGR_TYPE;
 RCBBCA0_HW.RUN_DATE   = RCBBS16_HW.RUN_DATE;
 RCBBCA0_HW.RCB050S    = RCBBS16_HW.RCB050S;
 RCBBCA0_HW.RCB050SI   = RCBBS16_HW.RCB050SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 IOAREA5               = '';
 RCBBCA1_HW.REC_TYPE   = '02';
 RCBBCA1_HW.CTRYNO     = RCBBS17_HW.CTRYNO;
 RCBBCA1_HW.PGR_TYPE   = RCBBS17_HW.PGR_TYPE;
 RCBBCA1_HW.RUN_DATE   = RCBBS17_HW.RUN_DATE;
 RCBBCA1_HW.RCB100S    = RCBBS17_HW.RCB100S;
 RCBBCA1_HW.RCB100SI   = RCBBS17_HW.RCB100SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 IOAREA8               = '';
 RCBBCA2_HW.REC_TYPE   = '02';
 RCBBCA2_HW.CTRYNO     = RCBBS18_HW.CTRYNO;
 RCBBCA2_HW.PGR_TYPE   = RCBBS18_HW.PGR_TYPE;
 RCBBCA2_HW.RUN_DATE   = RCBBS18_HW.RUN_DATE;
 RCBBCA2_HW.RCB110S    = RCBBS18_HW.RCB110S;
 RCBBCA2_HW.RCB110SI   = RCBBS18_HW.RCB110SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 IOAREA8               = '';
 RCBBCA3_HW.REC_TYPE   = '02';
 RCBBCA3_HW.CTRYNO     = RCBBS19_HW.CTRYNO;
 RCBBCA3_HW.PGR_TYPE   = RCBBS19_HW.PGR_TYPE;
 RCBBCA3_HW.RUN_DATE   = RCBBS19_HW.RUN_DATE;
 RCBBCA3_HW.RCB170S    = RCBBS19_HW.RCB170S;
 RCBBCA3_HW.RCB170SI   = RCBBS19_HW.RCB170SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 IOAREA14              = '';
 RCBBCA4_HW.REC_TYPE   = '02';
 RCBBCA4_HW.CTRYNO     = RCBBS1A_HW.CTRYNO;
 RCBBCA4_HW.PGR_TYPE   = RCBBS1A_HW.PGR_TYPE;
 RCBBCA4_HW.RUN_DATE   = RCBBS1A_HW.RUN_DATE;
 RCBBCA4_HW.RCB190S    = RCBBS1A_HW.RCB190S;
 RCBBCA4_HW.RCB190SI   = RCBBS1A_HW.RCB190SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 IOAREA17              = '';
 RCBBCA5_HW.REC_TYPE   = '02';
 RCBBCA5_HW.CTRYNO     = RCBBS1B_HW.CTRYNO;
 RCBBCA5_HW.PGR_TYPE   = RCBBS1B_HW.PGR_TYPE;
 RCBBCA5_HW.RUN_DATE   = RCBBS1B_HW.RUN_DATE;
 RCBBCA5_HW.RCB220S    = RCBBS1B_HW.RCB220S;
 RCBBCA5_HW.RCB220SI   = RCBBS1B_HW.RCB220SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 IOAREA20              = '';
 RCBBCA6_HW.REC_TYPE   = '02';
 RCBBCA6_HW.CTRYNO     = RCBBS1C_HW.CTRYNO;
 RCBBCA6_HW.PGR_TYPE   = RCBBS1C_HW.PGR_TYPE;
 RCBBCA6_HW.RUN_DATE   = RCBBS1C_HW.RUN_DATE;
 RCBBCA6_HW.RCB250S    = RCBBS1C_HW.RCB250S;
 RCBBCA6_HW.RCB250SI   = RCBBS1C_HW.RCB250SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 IOAREA23              = '';
 RCBBCA7_HW.REC_TYPE   = '02';
 RCBBCA7_HW.CTRYNO     = RCBBS1D_HW.CTRYNO;
 RCBBCA7_HW.PGR_TYPE   = RCBBS1D_HW.PGR_TYPE;
 RCBBCA7_HW.RUN_DATE   = RCBBS1D_HW.RUN_DATE;
 RCBBCA7_HW.RCB260S    = RCBBS1D_HW.RCB260S;
 RCBBCA7_HW.RCB260SI   = RCBBS1D_HW.RCB260SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 IOAREA26              = '';
 RCBBCA8_HW.REC_TYPE   = '02';
 RCBBCA8_HW.CTRYNO     = RCBBS1E_HW.CTRYNO;
 RCBBCA8_HW.PGR_TYPE   = RCBBS1E_HW.PGR_TYPE;
 RCBBCA8_HW.RUN_DATE   = RCBBS1E_HW.RUN_DATE;
 RCBBCA8_HW.RCB300S    = RCBBS1E_HW.RCB300S;
 RCBBCA8_HW.RCB300SI   = RCBBS1E_HW.RCB300SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 IOAREA29              = '';
 RCBBCA9_HW.REC_TYPE   = '02';
 RCBBCA9_HW.CTRYNO     = RCBBS1F_HW.CTRYNO;
 RCBBCA9_HW.PGR_TYPE   = RCBBS1F_HW.PGR_TYPE;
 RCBBCA9_HW.RUN_DATE   = RCBBS1F_HW.RUN_DATE;
 RCBBCA9_HW.RCB310S    = RCBBS1F_HW.RCB310S;
 RCBBCA9_HW.RCB310SI   = RCBBS1F_HW.RCB310SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 IOAREA32              = '';
 RCBBCAA_HW.REC_TYPE   = '02';
 RCBBCAA_HW.CTRYNO     = RCBBS1G_HW.CTRYNO;
 RCBBCAA_HW.PGR_TYPE   = RCBBS1G_HW.PGR_TYPE;
 RCBBCAA_HW.RUN_DATE   = RCBBS1G_HW.RUN_DATE;
 RCBBCAA_HW.RCB330S    = RCBBS1G_HW.RCB330S;
 RCBBCAA_HW.RCB330SI   = RCBBS1G_HW.RCB330SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 IOAREA35              = '';
 RCBBCAB_HW.REC_TYPE   = '02';
 RCBBCAB_HW.CTRYNO     = RCBBS1H_HW.CTRYNO;
 RCBBCAB_HW.PGR_TYPE   = RCBBS1H_HW.PGR_TYPE;
 RCBBCAB_HW.RUN_DATE   = RCBBS1H_HW.RUN_DATE;
 RCBBCAB_HW.RCB380S    = RCBBS1H_HW.RCB380S;
 RCBBCAB_HW.RCB380SI   = RCBBS1H_HW.RCB380SI;
 END;
                                                   /* DEFAULT FIELDS */
 CALL RCBBCZM_WRITE;

 END R030_INSERT_RCBBS16;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R031_INSERT                                   */
 /*                                                                  */
 /* DESCRIPTION      : WRITE TO 'CA' FILES-INSERT THE RECORDS FROM S2*/
 /*                                                                  */
 /********************************************************************/
 R031_INSERT_RCBBS26:PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 IOAREA2               = '';
 RCBBCA0_HW.REC_TYPE   = '02';
 RCBBCA0_HW.CTRYNO     = RCBBS26_HW.CTRYNO;
 RCBBCA0_HW.PGR_TYPE   = RCBBS26_HW.PGR_TYPE;
 RCBBCA0_HW.RUN_DATE   = RCBBS26_HW.RUN_DATE;
 RCBBCA0_HW.RCB050S    = RCBBS26_HW.RCB050S;
 RCBBCA0_HW.RCB050SI   = RCBBS26_HW.RCB050SI;
 END;
                                                   /* DEFAULT FIELDS */
 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 IOAREA5               = '';
 RCBBCA1_HW.REC_TYPE   = '02';
 RCBBCA1_HW.CTRYNO     = RCBBS27_HW.CTRYNO;
 RCBBCA1_HW.PGR_TYPE   = RCBBS27_HW.PGR_TYPE;
 RCBBCA1_HW.RUN_DATE   = RCBBS27_HW.RUN_DATE;
 RCBBCA1_HW.RCB100S    = RCBBS27_HW.RCB100S;
 RCBBCA1_HW.RCB100SI   = RCBBS27_HW.RCB100SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 IOAREA8               = '';
 RCBBCA2_HW.REC_TYPE   = '02';
 RCBBCA2_HW.CTRYNO     = RCBBS28_HW.CTRYNO;
 RCBBCA2_HW.PGR_TYPE   = RCBBS28_HW.PGR_TYPE;
 RCBBCA2_HW.RUN_DATE   = RCBBS28_HW.RUN_DATE;
 RCBBCA2_HW.RCB110S    = RCBBS28_HW.RCB110S;
 RCBBCA2_HW.RCB110SI   = RCBBS28_HW.RCB110SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 IOAREA11              = '';
 RCBBCA3_HW.REC_TYPE   = '02';
 RCBBCA3_HW.CTRYNO     = RCBBS29_HW.CTRYNO;
 RCBBCA3_HW.PGR_TYPE   = RCBBS29_HW.PGR_TYPE;
 RCBBCA3_HW.RUN_DATE   = RCBBS29_HW.RUN_DATE;
 RCBBCA3_HW.RCB170S    = RCBBS29_HW.RCB170S;
 RCBBCA3_HW.RCB170SI   = RCBBS29_HW.RCB170SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 IOAREA14              = '';
 RCBBCA4_HW.REC_TYPE   = '02';
 RCBBCA4_HW.CTRYNO     = RCBBS2A_HW.CTRYNO;
 RCBBCA4_HW.PGR_TYPE   = RCBBS2A_HW.PGR_TYPE;
 RCBBCA4_HW.RUN_DATE   = RCBBS2A_HW.RUN_DATE;
 RCBBCA4_HW.RCB190S    = RCBBS2A_HW.RCB190S;
 RCBBCA4_HW.RCB190SI   = RCBBS2A_HW.RCB190SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 IOAREA17              = '';
 RCBBCA5_HW.REC_TYPE   = '02';
 RCBBCA5_HW.CTRYNO     = RCBBS2B_HW.CTRYNO;
 RCBBCA5_HW.PGR_TYPE   = RCBBS2B_HW.PGR_TYPE;
 RCBBCA5_HW.RUN_DATE   = RCBBS2B_HW.RUN_DATE;
 RCBBCA5_HW.RCB220S    = RCBBS2B_HW.RCB220S;
 RCBBCA5_HW.RCB220SI   = RCBBS2B_HW.RCB220SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 IOAREA20              = '';
 RCBBCA6_HW.REC_TYPE   = '02';
 RCBBCA6_HW.CTRYNO     = RCBBS2C_HW.CTRYNO;
 RCBBCA6_HW.PGR_TYPE   = RCBBS2C_HW.PGR_TYPE;
 RCBBCA6_HW.RUN_DATE   = RCBBS2C_HW.RUN_DATE;
 RCBBCA6_HW.RCB250S    = RCBBS2C_HW.RCB250S;
 RCBBCA6_HW.RCB250SI   = RCBBS2C_HW.RCB250SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 IOAREA23              = '';
 RCBBCA7_HW.REC_TYPE   = '02';
 RCBBCA7_HW.CTRYNO     = RCBBS2D_HW.CTRYNO;
 RCBBCA7_HW.PGR_TYPE   = RCBBS2D_HW.PGR_TYPE;
 RCBBCA7_HW.RUN_DATE   = RCBBS2D_HW.RUN_DATE;
 RCBBCA7_HW.RCB260S    = RCBBS2D_HW.RCB260S;
 RCBBCA7_HW.RCB260SI   = RCBBS2D_HW.RCB260SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 IOAREA26              = '';
 RCBBCA8_HW.REC_TYPE   = '02';
 RCBBCA8_HW.CTRYNO     = RCBBS2E_HW.CTRYNO;
 RCBBCA8_HW.PGR_TYPE   = RCBBS2E_HW.PGR_TYPE;
 RCBBCA8_HW.RUN_DATE   = RCBBS2E_HW.RUN_DATE;
 RCBBCA8_HW.RCB300S    = RCBBS2E_HW.RCB300S;
 RCBBCA8_HW.RCB300SI   = RCBBS2E_HW.RCB300SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 IOAREA29              = '';
 RCBBCA9_HW.REC_TYPE   = '02';
 RCBBCA9_HW.CTRYNO     = RCBBS2F_HW.CTRYNO;
 RCBBCA9_HW.PGR_TYPE   = RCBBS2F_HW.PGR_TYPE;
 RCBBCA9_HW.RUN_DATE   = RCBBS2F_HW.RUN_DATE;
 RCBBCA9_HW.RCB310S    = RCBBS2F_HW.RCB310S;
 RCBBCA9_HW.RCB310SI   = RCBBS2F_HW.RCB310SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 IOAREA32              = '';
 RCBBCAA_HW.REC_TYPE   = '02';
 RCBBCAA_HW.CTRYNO     = RCBBS2G_HW.CTRYNO;
 RCBBCAA_HW.PGR_TYPE   = RCBBS2G_HW.PGR_TYPE;
 RCBBCAA_HW.RUN_DATE   = RCBBS2G_HW.RUN_DATE;
 RCBBCAA_HW.RCB330S    = RCBBS2G_HW.RCB330S;
 RCBBCAA_HW.RCB330SI   = RCBBS2G_HW.RCB330SI;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 IOAREA35              = '';
 RCBBCAB_HW.REC_TYPE   = '02';
 RCBBCAB_HW.CTRYNO     = RCBBS2H_HW.CTRYNO;
 RCBBCAB_HW.PGR_TYPE   = RCBBS2H_HW.PGR_TYPE;
 RCBBCAB_HW.RUN_DATE   = RCBBS2H_HW.RUN_DATE;
 RCBBCAB_HW.RCB380S    = RCBBS2H_HW.RCB380S;
 RCBBCAB_HW.RCB380SI   = RCBBS2H_HW.RCB380SI;
 END;

 CALL RCBBCZM_WRITE;

 END R031_INSERT_RCBBS26;

1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_WRITE                                 */
 /*                                                                  */
 /* DESCRIPTION      : WRITE RECORDS AND COUNT HASH TOTAL            */
 /*                                                                  */
 /********************************************************************/
 RCBBCZM_WRITE:PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
0WRITE FILE (RCBBCA0) FROM (IOAREA2);
 IF RCBBCA0_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA0 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA0_HW.RCB050S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA0_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
0WRITE FILE (RCBBCA1) FROM (IOAREA5);
 IF RCBBCA1_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA1 = COUNT.CNT_CTRY.RCBBCA1 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA1_HW.RCB100S.MES_ORDER_NUMBER, 1, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA1_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
0WRITE FILE (RCBBCA2) FROM (IOAREA8);
 IF RCBBCA2_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA2 = COUNT.CNT_CTRY.RCBBCA2 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA2_HW.RCB110S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA2_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
0WRITE FILE (RCBBCA3) FROM (IOAREA11);
 IF RCBBCA3_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA3 = COUNT.CNT_CTRY.RCBBCA3 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA3_HW.RCB170S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA3_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
0WRITE FILE (RCBBCA4) FROM (IOAREA14);
 IF RCBBCA4_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA4 = COUNT.CNT_CTRY.RCBBCA4 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA4_HW.RCB190S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA4_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
0WRITE FILE (RCBBCA5) FROM (IOAREA17);
 IF RCBBCA5_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA5 = COUNT.CNT_CTRY.RCBBCA5 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA5_HW.RCB220S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA5_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
0WRITE FILE (RCBBCA6) FROM (IOAREA20);
 IF RCBBCA6_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA6 = COUNT.CNT_CTRY.RCBBCA6 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA6_HW.RCB250S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA6_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
0WRITE FILE (RCBBCA7) FROM (IOAREA23);
 IF RCBBCA7_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA7 = COUNT.CNT_CTRY.RCBBCA7 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA7_HW.RCB260S.ORDER_REF_NUMBER, 1, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA7_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
0WRITE FILE (RCBBCA8) FROM (IOAREA26);
 IF RCBBCA8_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA8 = COUNT.CNT_CTRY.RCBBCA8 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA8_HW.RCB300S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA8_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
0WRITE FILE (RCBBCA9) FROM (IOAREA29);
 IF RCBBCA9_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCA9 = COUNT.CNT_CTRY.RCBBCA9 + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCA9_HW.RCB310S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCA9_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
0WRITE FILE (RCBBCAA) FROM (IOAREA32);
 IF RCBBCAA_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCAA = COUNT.CNT_CTRY.RCBBCAA + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCAA_HW.RCB330S.MES_ORDER_NUMBER, 1, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCAA_HASH,
                   PTR_INT_AREA);
 END;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
0WRITE FILE (RCBBCAB) FROM (IOAREA35);
 IF RCBBCAB_HW.REC_TYPE = '02'                   /* COUNT HASH */
 THEN
   DO;
     COUNT.CNT_CTRY.RCBBCAB = COUNT.CNT_CTRY.RCBBCAB + 1;
     WRK_HASH_FIELD =
     SUBSTR (RCBBCAB_HW.RCB380S.SEQUENCE_NUMBER, 3, 4);

     CALL RCB018M (WRK_HASH_FIELD,
                   COUNT.RCBBCAB_HASH,
                   PTR_INT_AREA);
 END;
 END;

 END RCBBCZM_WRITE;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_SIC                                   */
 /*                                                                  */
 /* DESCRIPTION      : SET ITERATION CONDITIONS                      */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_SIC: PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0' | WRK_FILE_ACT = 'RCBBCA2' |
     WRK_FILE_ACT = 'RCBBCA5' | WRK_FILE_ACT = 'RCBBCA8' |
     WRK_FILE_ACT = 'RCBBCAB' )
 THEN DO;
0PREV_SSK = SSK;

0IF STRING (SK0) < STRING (SK1)
 THEN
   DO;
     SSK = SK0;
   END;
 ELSE
   DO;
     SSK = SK1;
   END;
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SSK);              /* RC01141 */
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1' | WRK_FILE_ACT = 'RCBBCAA') THEN DO;
0PREV_SSK1 = SSK1;

0IF STRING (SK2) < STRING (SK3)
 THEN
   DO;
     SSK1 = SK2;
   END;
 ELSE
   DO;
     SSK1 = SK3;
   END;
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SSK1);              /* RC01141 */
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3' | WRK_FILE_ACT = 'RCBBCA4')
 THEN DO;
0PREV_SSK2 = SSK2;

0IF STRING (SK6) < STRING (SK7)
 THEN
   DO;
     SSK2 = SK6;
   END;
 ELSE
   DO;
     SSK2 = SK7;
   END;
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SSK2);              /* RC01141 */
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6')
 THEN DO;
0PREV_SSK3 = SSK3;

0IF STRING (SK12) < STRING (SK13)
 THEN
   DO;
     SSK3 = SK12;
   END;
 ELSE
   DO;
     SSK3 = SK13;
   END;
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SSK3);              /* RC01141 */
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7')
 THEN DO;
0PREV_SSK4 = SSK4;

0IF STRING (SK14) < STRING (SK15)
 THEN
   DO;
     SSK4 = SK14;
   END;
 ELSE
   DO;
     SSK4 = SK15;
   END;
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SSK4);              /* RC01141 */
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9')
 THEN DO;
0PREV_SSK5 = SSK5;

0IF STRING (SK18) < STRING (SK19)
 THEN
   DO;
     SSK5 = SK18;
   END;
 ELSE
   DO;
     SSK5 = SK19;
   END;
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SSK5);              /* RC01141 */
 END;

0END RCBBCZM_SIC;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_HEADER                          */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THE HEADERS                             */
 /*                    TIMESTAMPS OF BOTH FILE HEADERS ARE SAVED.    */
 /*                    SOURCE INDICATOR OF THE S1 FILE HEADER        */
 /*                    IS SAVED.                                     */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_HEADER: PROC;

 CALL R010_READ0;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK0.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS16';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#014');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS16_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS16';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS16_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#015');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS16_H.FILE_ID ¬= 'RCBBS16') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS16';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#016');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS16 = RCBBS16_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS16_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK2.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS17';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#017');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS17_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS17';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS17_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#018');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS17_H.FILE_ID ¬= 'RCBBS17') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS17';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#019');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS17 = RCBBS17_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS17_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK4.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS18';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#020');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS18_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS18';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS18_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#021');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS18_H.FILE_ID ¬= 'RCBBS18') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS18';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#022');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS18 = RCBBS18_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS18_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK6.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS19';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#023');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS19_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS19';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS19_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#024');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS19_H.FILE_ID ¬= 'RCBBS19') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS19';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#025');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS19 = RCBBS19_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS19_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK8.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1A';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#026');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1A_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1A';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1A_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#027');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1A_H.FILE_ID ¬= 'RCBBS1A') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1A';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#028');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1A = RCBBS1A_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1A_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK10.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1B';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#029');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1B_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1B';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1B_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#030');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1B_H.FILE_ID ¬= 'RCBBS1B') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1B';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#031');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1B = RCBBS1B_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1B_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK12.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1C';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#032');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1C_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1C';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1C_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#033');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1C_H.FILE_ID ¬= 'RCBBS1C') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1C';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#034');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1C = RCBBS1C_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1C_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK14.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1D';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#035');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1D_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1D';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1D_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#036');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1D_H.FILE_ID ¬= 'RCBBS1D') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1D';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#037');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1D = RCBBS1D_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1D_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK16.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1E';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#038');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1E_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1E';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1E_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#039');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1E_H.FILE_ID ¬= 'RCBBS1E') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1E';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#040');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1E = RCBBS1E_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1E_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK18.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1F';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#041');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1F_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1F';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1F_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#042');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1F_H.FILE_ID ¬= 'RCBBS1F') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1F';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#043');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1F = RCBBS1F_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1F_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK20.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1G';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#044');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1G_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1G';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1G_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#045');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1G_H.FILE_ID ¬= 'RCBBS1G') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1G';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#046');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1G = RCBBS1G_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1G_H.SOURCE_INDICATOR;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK22.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1H';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#047');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS1H_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1H';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS1H_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#048');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS1H_H.FILE_ID ¬= 'RCBBS1H') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1H';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#049');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS1H = RCBBS1H_H.TIMESTAMP;
                                   /* SAVE SOURCE_INDICATOR           */
 WRK_SOURCE_INDICATOR   = RCBBS1H_H.SOURCE_INDICATOR;
 END;

 CALL R011_READ1;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK1.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS26';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#050');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS26_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS26';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS26_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#051');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS26_H.FILE_ID  ¬= 'RCBBS26' ) DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS26';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#052');
     END;
   OTHERWISE;
   END;
                                     /* SAVE TIMESTAMP OF S2 FILE */
 WRK_TIME_STAMP_RCBBS26 = RCBBS26_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK3.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS27';
     CALL RCB0M1M (PTR_INT_AREA);
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS27_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS27';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS27_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#053');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS27_H.FILE_ID  ¬= 'RCBBS27' ) DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS27';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#054');
     END;
   OTHERWISE;
   END;
                                     /* SAVE TIMESTAMP OF S2 FILE */
 WRK_TIME_STAMP_RCBBS27 = RCBBS27_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK5.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS28';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#055');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS28_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS28';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS28_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#056');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS28_H.FILE_ID  ¬= 'RCBBS28' ) DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS28';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#057');
     END;
   OTHERWISE;
   END;
                                     /* SAVE TIMESTAMP OF S2 FILE */
 WRK_TIME_STAMP_RCBBS28 = RCBBS28_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK7.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS29';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#058');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS29_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS29';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS29_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#059');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS29_H.FILE_ID  ¬= 'RCBBS29' ) DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS29';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#060');
     END;
   OTHERWISE;
   END;
                                     /* SAVE TIMESTAMP OF S2 FILE */
 WRK_TIME_STAMP_RCBBS29 = RCBBS29_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK9.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2A';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#118');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2A_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2A';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2A_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#061');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2A_H.FILE_ID  ¬= 'RCBBS2A' ) DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2A';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#062');
     END;
   OTHERWISE;
   END;
                                     /* SAVE TIMESTAMP OF S2 FILE */
 WRK_TIME_STAMP_RCBBS2A = RCBBS2A_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK11.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2B';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#063');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2B_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2B';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2B_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#064');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2B_H.FILE_ID  ¬= 'RCBBS2B' ) DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2B';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#065');
     END;
   OTHERWISE;
   END;
                                     /* SAVE TIMESTAMP OF S2 FILE */
 WRK_TIME_STAMP_RCBBS2B = RCBBS2B_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK13.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2C';
     CALL RCB0M1M (PTR_INT_AREA);
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2C_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2C';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2C_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#066');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2C_H.FILE_ID ¬= 'RCBBS2C') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2C';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#067');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS2C = RCBBS2C_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK15.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2D';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#068');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2D_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2D';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2D_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#069');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2D_H.FILE_ID ¬= 'RCBBS2D') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2D';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#070');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS2D = RCBBS2D_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK17.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2E';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#071');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2E_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2E';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2E_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#072');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2E_H.FILE_ID ¬= 'RCBBS2E') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2E';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#073');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS2E = RCBBS2E_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK19.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2F';
     CALL RCB0M1M (PTR_INT_AREA);
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2F_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2F';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2F_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#074');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2F_H.FILE_ID ¬= 'RCBBS2F') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2F';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#075');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS2F = RCBBS2F_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK21.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2G';
     CALL RCB0M1M (PTR_INT_AREA);
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2G_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2G';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2G_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#077');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2G_H.FILE_ID ¬= 'RCBBS2G') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2G';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#078');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS2G = RCBBS2G_H.TIMESTAMP;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
 SELECT;
                                     /* EMPTY FILE                   */
   WHEN (SK23.EOF = '1') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0013';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2H';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#119');
     END;
                                     /* INVALID RECORD TYPE HEADER   */
   WHEN (RCBBS2H_HW.REC_TYPE ¬= '01') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0018';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2H';
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'RT';
     PARM_INT_AREA.MSG_VAR_VALUE_7  = RCBBS2H_HW.REC_TYPE;
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#079');
     END;
                                     /* INVALID FILE ID HEADER       */
   WHEN (RCBBS2H_H.FILE_ID ¬= 'RCBBS2H') DO;
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0014';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2H';
     CALL RCB0M1M (PTR_INT_AREA);
                                     /* ABEND                        */
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#080');
     END;
   OTHERWISE;
   END;
                                   /* SAVE TIMESTAMP OF S1 FILE */
 WRK_TIME_STAMP_RCBBS2H = RCBBS2H_H.TIMESTAMP;
 END;

 END RCBBCZM_CHECK_HEADER;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_HASH                            */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THAT THE HASH TOTALS FROM PARAMETER     */
 /*                    RCB024 MATCH WITH THE CALCULATED HASH TOTALS  */
 /*                    FROM THE S1 AND THE S2 FILES                  */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_HASH: PROC;
 IF COUNT.RCBBS16_HASH ¬= RCBP24S_UPSTR.HASH_TOTAL
 THEN
   DO;
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0175';
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'HT';
     CNT_PIC15                      = COUNT.RCBBS16_HASH;
     PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC15;
     PARM_INT_AREA.MSG_VAR_CODE_8   = 'HT';
     CNT_PIC15                      = RCBP24S_UPSTR.HASH_TOTAL;
     PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;
     CALL RCB0M1M (PTR_INT_AREA);
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#081');
   END;

 IF COUNT.RCBBS26_HASH ¬= RCBP24S_CEDS.HASH_TOTAL
 THEN
   DO;
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
     PARM_INT_AREA.MESSAGE_NUMBER   = '0175';
     PARM_INT_AREA.MSG_VAR_CODES    = '';
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
     PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS26;
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'HT';
     CNT_PIC15                      = COUNT.RCBBS26_HASH;
     PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC15;
     PARM_INT_AREA.MSG_VAR_CODE_8   = 'HT';
     CNT_PIC15                      = RCBP24S_CEDS.HASH_TOTAL;
     PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;
     CALL RCB0M1M (PTR_INT_AREA);
     CALL RCBBCZM_ERROR (NULL(),
                         'OTHER',
                         '#082');
 END;
0END RCBBCZM_CHECK_HASH;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_TRAILERS                        */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THE TRAILERS                            */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_TRAILERS_CA0: PROC;
 SELECT(WRK_FILE_ACT);
   WHEN('RCBBCA2') DO;
     RCBBS16_T.CNT_RECS = RCBBS18_T.CNT_RECS;
     RCBBS26_T.CNT_RECS = RCBBS28_T.CNT_RECS;
   END;
   WHEN('RCBBCA5') DO;
     RCBBS16_T.CNT_RECS = RCBBS1B_T.CNT_RECS;
     RCBBS26_T.CNT_RECS = RCBBS2B_T.CNT_RECS;
   END;
   WHEN('RCBBCA8') DO;
     RCBBS16_T.CNT_RECS = RCBBS1E_T.CNT_RECS;
     RCBBS26_T.CNT_RECS = RCBBS2E_T.CNT_RECS;
   END;
   WHEN('RCBBCAB') DO;
     RCBBS16_T.CNT_RECS = RCBBS1H_T.CNT_RECS;
     RCBBS26_T.CNT_RECS = RCBBS2H_T.CNT_RECS;
   END;
   OTHERWISE;
  END;

 IF SK0.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#083');
   END;

 IF RCBBS16_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS16
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  = COUNT.CNT_TOT.RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS16_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#084');
   END;

 CALL R010_READ0;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK0.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE'||WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#085');
   END;


 IF SK1.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#086');
   END;

 IF RCBBS26_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS26
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  =  COUNT.CNT_TOT.RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS26_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#087');
   END;

 CALL R011_READ1;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK1.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#088');
   END;

 END RCBBCZM_CHECK_TRAILERS_CA0;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_TRAILERS                        */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THE TRAILERS                            */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_TRAILERS_CA1: PROC;
 IF(WRK_FILE_ACT = 'RCBBCAA') THEN DO;
     RCBBS17_T.CNT_RECS = RCBBS1G_T.CNT_RECS;
     RCBBS27_T.CNT_RECS = RCBBS2G_T.CNT_RECS;
  END;

 IF SK2.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#089');
 END;

 IF RCBBS17_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS16
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  = COUNT.CNT_TOT.RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS17_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#090');
   END;

 CALL R010_READ0;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK2.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE '||WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#091');
  END;


 IF SK3.EOF ¬= '1'
 THEN DO;

 IF RCBBS27_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS26
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  =  COUNT.CNT_TOT.RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS27_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#092');
   END;

 CALL R011_READ1;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK3.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#093');
   END;
 END;

 END RCBBCZM_CHECK_TRAILERS_CA1;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_TRAILERS                        */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THE TRAILERS                            */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_TRAILERS_CA3: PROC;
 IF(WRK_FILE_ACT = 'RCBBCA4') THEN DO;
     RCBBS19_T.CNT_RECS = RCBBS1A_T.CNT_RECS;
     RCBBS29_T.CNT_RECS = RCBBS2A_T.CNT_RECS;
  END;

 IF SK6.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#094');
   END;

 IF RCBBS19_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS16
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  = COUNT.CNT_TOT.RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS19_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#095');
   END;

 CALL R010_READ0;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK6.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE '||WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#096');
   END;


 IF SK7.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#097');
   END;

 IF RCBBS29_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS26
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  =  COUNT.CNT_TOT.RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS29_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#098');
   END;

 CALL R011_READ1;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK7.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#099');
   END;

 END RCBBCZM_CHECK_TRAILERS_CA3;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_TRAILERS                        */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THE TRAILERS                            */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_TRAILERS_CA6: PROC;

 IF SK12.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#100');
 END;

 IF RCBBS1C_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS16
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  = COUNT.CNT_TOT.RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS1C_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#101');
   END;

 CALL R010_READ0;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK12.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE '||WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#102');
   END;


 IF SK13.EOF ¬= '1'
 THEN DO;                            /* NO TRAILER RECORD            */

 IF RCBBS2C_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS26
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  =  COUNT.CNT_TOT.RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS2C_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#103');
   END;

 CALL R011_READ1;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK13.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#104');
   END;
 END;

 END RCBBCZM_CHECK_TRAILERS_CA6;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_TRAILERS                        */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THE TRAILERS                            */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_TRAILERS_CA7: PROC;

 IF SK14.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#105');
   END;

 IF RCBBS1D_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS16
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  = COUNT.CNT_TOT.RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS1D_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#106');
   END;

 CALL R010_READ0;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK14.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE '||WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#107');
   END;


 IF SK15.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#108');
   END;

 IF RCBBS2D_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS26
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  =  COUNT.CNT_TOT.RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS2D_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#109');
   END;

 CALL R011_READ1;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK15.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#110');
   END;

 END RCBBCZM_CHECK_TRAILERS_CA7;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_CHECK_TRAILERS                        */
 /*                                                                  */
 /* DESCRIPTION      : CHECK THE TRAILERS                            */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_CHECK_TRAILERS_CA9: PROC;

 IF SK18.EOF = '1'
 THEN DO;                            /* NO TRAILER RECORD            */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0017';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#111');
 END;

 IF RCBBS1F_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS16
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE ' || WRK_FILE_RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  = COUNT.CNT_TOT.RCBBS16;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS1F_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#112');
   END;

 CALL R010_READ0;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK18.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'IBASE FILE '||WRK_FILE_RCBBS16;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#113');
   END;


 IF SK19.EOF ¬= '1'
 THEN DO;                            /* NO TRAILER RECORD            */

 IF RCBBS2F_T.CNT_RECS ¬= COUNT.CNT_TOT.RCBBS26
 THEN DO;                          /* INVALID COUNT TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0007';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_7   = 'C7';
   PARM_INT_AREA.MSG_VAR_VALUE_7  =  COUNT.CNT_TOT.RCBBS26;
   PARM_INT_AREA.MSG_VAR_CODE_8   = 'C8';
   PARM_INT_AREA.MSG_VAR_VALUE_8  = RCBBS26_T.CNT_RECS;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#114');
   END;

 CALL R011_READ1;                    /* CHECK RECORDS AFTER TRAILER  */
 IF SK19.EOF = '0'
 THEN DO;                          /* RECORDS AFTER TRAILER        */
   PARM_INT_AREA.MSG_VAR_CODES    = '';
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
   PARM_INT_AREA.MESSAGE_NUMBER   = '0015';
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
   PARM_INT_AREA.MSG_VAR_VALUE_6  = 'SOF/WTAAS FILE '||WRK_FILE_RCBBS26;
   CALL RCB0M1M (PTR_INT_AREA);
   CALL RCBBCZM_ERROR (NULL(),
                      'OTHER',
                      '#115');
   END;
 END;

 END RCBBCZM_CHECK_TRAILERS_CA9;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_FILL_HEADER                           */
 /*                                                                  */
 /* DESCRIPTION      : FILL THE HEADER OF THE ACTION FILE            */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_FILL_HEADER: PROC;

 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
0IOAREA2                     = '';
 RCBBCA0_H.REC_TYPE          = '01';
 RCBBCA0_H.FILE_ID           = 'RCBBCA0';
 RCBBCA0_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA0_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
0IOAREA5                     = '';
 RCBBCA1_H.REC_TYPE          = '01';
 RCBBCA1_H.FILE_ID           = 'RCBBCA1';
 RCBBCA1_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA1_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
0IOAREA8                     = '';
 RCBBCA2_H.REC_TYPE          = '01';
 RCBBCA2_H.FILE_ID           = 'RCBBCA2';
 RCBBCA2_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA2_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
0IOAREA11                    = '';
 RCBBCA3_H.REC_TYPE          = '01';
 RCBBCA3_H.FILE_ID           = 'RCBBCA3';
 RCBBCA3_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA3_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
0IOAREA14                    = '';
 RCBBCA4_H.REC_TYPE          = '01';
 RCBBCA4_H.FILE_ID           = 'RCBBCA4';
 RCBBCA4_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA4_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
0IOAREA17                    = '';
 RCBBCA5_H.REC_TYPE          = '01';
 RCBBCA5_H.FILE_ID           = 'RCBBCA5';
 RCBBCA5_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA5_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
0IOAREA20                    = '';
 RCBBCA6_H.REC_TYPE          = '01';
 RCBBCA6_H.FILE_ID           = 'RCBBCA6';
 RCBBCA6_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA6_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
0IOAREA23                    = '';
 RCBBCA7_H.REC_TYPE          = '01';
 RCBBCA7_H.FILE_ID           = 'RCBBCA7';
 RCBBCA7_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA7_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
0IOAREA26                    = '';
 RCBBCA8_H.REC_TYPE          = '01';
 RCBBCA8_H.FILE_ID           = 'RCBBCA8';
 RCBBCA8_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA8_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
0IOAREA29                    = '';
 RCBBCA9_H.REC_TYPE          = '01';
 RCBBCA9_H.FILE_ID           = 'RCBBCA9';
 RCBBCA9_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCA9_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
0IOAREA32                    = '';
 RCBBCAA_H.REC_TYPE          = '01';
 RCBBCAA_H.FILE_ID           = 'RCBBCAA';
 RCBBCAA_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCAA_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
0IOAREA35                    = '';
 RCBBCAB_H.REC_TYPE          = '01';
 RCBBCAB_H.FILE_ID           = 'RCBBCAB';
 RCBBCAB_H.SOURCE_INDICATOR  = WRK_SOURCE_INDICATOR;
 RCBBCAB_H.TIMESTAMP         = WRK_DATE_TIME;
 END;

 CALL RCBBCZM_WRITE;
 END RCBBCZM_FILL_HEADER;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_FILL_TRAILERS                         */
 /*                                                                  */
 /* DESCRIPTION      : FILL THE TRAILER                              */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_FILL_TRAILERS: PROC;
 IF (WRK_FILE_ACT = 'RCBBCA0') THEN DO;
0IOAREA2             = '';
 RCBBCA0_T.REC_TYPE = '99';
 RCBBCA0_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA1') THEN DO;
0IOAREA5             = '';
 RCBBCA1_T.REC_TYPE = '99';
 RCBBCA1_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA2') THEN DO;
0IOAREA8             = '';
 RCBBCA2_T.REC_TYPE = '99';
 RCBBCA2_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA3') THEN DO;
0IOAREA11            = '';
 RCBBCA3_T.REC_TYPE = '99';
 RCBBCA3_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA4') THEN DO;
0IOAREA14            = '';
 RCBBCA4_T.REC_TYPE = '99';
 RCBBCA4_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA5') THEN DO;
0IOAREA17            = '';
 RCBBCA5_T.REC_TYPE = '99';
 RCBBCA5_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA6') THEN DO;
0IOAREA20            = '';
 RCBBCA6_T.REC_TYPE = '99';
 RCBBCA6_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA7') THEN DO;
0IOAREA23            = '';
 RCBBCA7_T.REC_TYPE = '99';
 RCBBCA7_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA8') THEN DO;
0IOAREA26            = '';
 RCBBCA8_T.REC_TYPE = '99';
 RCBBCA8_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCA9') THEN DO;
0IOAREA29            = '';
 RCBBCA9_T.REC_TYPE = '99';
 RCBBCA9_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCAA') THEN DO;
0IOAREA32            = '';
 RCBBCAA_T.REC_TYPE = '99';
 RCBBCAA_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;
 IF (WRK_FILE_ACT = 'RCBBCAB') THEN DO;
0IOAREA35            = '';
 RCBBCAB_T.REC_TYPE = '99';
 RCBBCAB_T.CNT_RECS = COUNT.CNT_TOT.RCBBCA0;
 END;

 CALL RCBBCZM_WRITE;
 END RCBBCZM_FILL_TRAILERS;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_SAVE_HASH                             */
 /*                                                                  */
 /* DESCRIPTION      : SAVE HASH TOTAL INFORMATION ON PARAMETER.     */
 /*                    IF THE PARAMETER DOES NOT YET EXIST, IT WILL  */
 /*                    BE INSERTED.                                  */
 /*                                                                  */
 /*                    ISSUE MESSAGE 0173                            */
 /*                                                                  */
 /********************************************************************/
0 RCBBCZM_SAVE_HASH : PROC;
                                     /* INIT TABLESTRUCTURE          */
 TB_RCBV500                  = '';
 TB_RCBV500_I                = '';
 TB_RCBP24S.NUMBER           = 'RCB024';
 TB_RCBP24S.PROC_ID          = RCBPROC_REC.PROC_ID;
 TB_RCBP24S.CTRYNO           = PREV_SSK.CTRYNO;
 TB_RCBP24S.FILE_NAME        = WRK_FILE_ACT;
 TB_RCBP24S.SEQ_NUMBER       = '01';
 TB_RCBP24S.TIME_STAMP       = WRK_DATE_TIME;
 TB_RCBP24S.HASH_TOTAL       = COUNT.RCBBCA0_HASH;
 TB_RCBP24S.LENGTH_PARM      = WRK_LENGTH_RCB024;

0CALL RCBG50M (ADDR(TB_RCBV500),    /* UPDATE PARAMETER RCB024    */
               ADDR(TB_RCBV500_I),
               PTR_RET_AREA_BB,
               PTR_INT_AREA);
0SELECT(PARM_RET_AREA_BB.RETURN_CODE);
   WHEN (0);
   WHEN (4)                          /* WHEN NOT FOUND THEN INSERT  */
     DO;
       CALL RCBF50M (ADDR(TB_RCBV500),
                     ADDR(TB_RCBV500_I),
                     PTR_RET_AREA_BB,
                     PTR_INT_AREA);
       SELECT(PARM_RET_AREA_BB.RETURN_CODE);
         WHEN (0);
         OTHERWISE
           DO;
             CALL RCBBCZM_ERROR (ADDR (PARM_RET_AREA_BB.RETURN_SQL),
                                 'DB2',
                                 '#116');
           END;
       END;
     END;
   OTHERWISE
      DO;
        CALL RCBBCZM_ERROR (ADDR (PARM_RET_AREA_BB.RETURN_SQL),
                            'DB2',
                            '#117');
      END;
 END;

 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0173';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_ACT;
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'TP';
 PARM_INT_AREA.MSG_VAR_VALUE_7  = WRK_DATE_TIME;
 PARM_INT_AREA.MSG_VAR_CODE_8   = 'HT';
 CNT_PIC15                      = COUNT.RCBBCA0_HASH;
 PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;
 CALL RCB0M1M (PTR_INT_AREA);

0END RCBBCZM_SAVE_HASH;

1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_END_COUNTRY                           */
 /*                                                                  */
 /* DESCRIPTION      : ENDING ACTIONS FOR A COUNTRY                  */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_END_COUNTRY: PROC;

 SELECT(WRK_FILE_ACT);
  WHEN ('RCBBCA1')
    DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS17;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS27;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA1;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS17;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS27;
     PREV_SSK.CTRYNO        = PREV_SSK1.CTRYNO;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA1_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS17_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS27_HASH;
   END;
  WHEN ('RCBBCA2')
   DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS18;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS28;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA2;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS18;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS28;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA2_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS18_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS28_HASH;
   END;
  WHEN ('RCBBCA3')
    DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS19;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS29;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA3;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS19;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS29;
     PREV_SSK.CTRYNO        = PREV_SSK2.CTRYNO;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA3_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS19_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS29_HASH;
     END;
  WHEN ('RCBBCA4')
     DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1A;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2A;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA4;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1A;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2A;
     PREV_SSK.CTRYNO        = PREV_SSK2.CTRYNO;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA4_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1A_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2A_HASH;
     END;
  WHEN ('RCBBCA5')
     DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1B;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2B;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA5;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1B;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2B;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA5_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1B_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2B_HASH;
     END;
  WHEN ('RCBBCA6')
     DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1C;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2C;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA6;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1C;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2C;
     PREV_SSK.CTRYNO        = PREV_SSK3.CTRYNO;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA6_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1C_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2C_HASH;
     END;
  WHEN ('RCBBCA7')
    DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1D;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2D;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA7;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1D;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2D;
     PREV_SSK.CTRYNO        = PREV_SSK4.CTRYNO;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA7_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1D_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2D_HASH;
    END;
  WHEN ('RCBBCA8')
    DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1E;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2E;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA8;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1E;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2E;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA8_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1E_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2E_HASH;
    END;
  WHEN ('RCBBCA9')
    DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1F;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2F;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCA9;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1F;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2F;
     PREV_SSK.CTRYNO        = PREV_SSK5.CTRYNO;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCA9_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1F_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2F_HASH;
    END;
  WHEN ('RCBBCAA')
    DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1G;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2G;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCAA;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1G;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2G;
     PREV_SSK.CTRYNO        = PREV_SSK1.CTRYNO;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCAA_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1G_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2G_HASH;
    END;
  WHEN ('RCBBCAB')
   DO;
     COUNT.CNT_CTRY.RCBBS16 = COUNT.CNT_CTRY.RCBBS1H;
     COUNT.CNT_CTRY.RCBBS26 = COUNT.CNT_CTRY.RCBBS2H;
     COUNT.CNT_CTRY.RCBBCA0 = COUNT.CNT_CTRY.RCBBCAB;
     WRK_FILE_RCBBS16       = WRK_FILE_RCBBS1H;
     WRK_FILE_RCBBS26       = WRK_FILE_RCBBS2H;
     COUNT.RCBBCA0_HASH     = COUNT.RCBBCAB_HASH;
     COUNT.RCBBS16_HASH     = COUNT.RCBBS1H_HASH;
     COUNT.RCBBS26_HASH     = COUNT.RCBBS2H_HASH;
   END;
   OTHERWISE;
  END;

                                                  /* CLOSE ALL FILES */
 COUNT.CNT_TOT.RCBBS16   =  COUNT.CNT_TOT.RCBBS16
                              + COUNT.CNT_CTRY.RCBBS16;
 COUNT.CNT_TOT.RCBBS26   =  COUNT.CNT_TOT.RCBBS26
                              + COUNT.CNT_CTRY.RCBBS26;
 COUNT.CNT_TOT.RCBBCA0   =  COUNT.CNT_TOT.RCBBCA0
                              + COUNT.CNT_CTRY.RCBBCA0;

 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';     /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS16;
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_RCBBS26;
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_FILE_ACT;
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_CTRY.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

 CALL RCBBCZM_CHECK_HASH;   /* CHECK HASH OF S1 AND S2 FILE */
 CALL RCBBCZM_SAVE_HASH;    /* SAVE  HASH OF ACTION FILE IN RCB024  */
0END RCBBCZM_END_COUNTRY;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S16_S26                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S16_S26: PROC;

 CALL RCBBCZM_CHECK_TRAILERS_CA0;
 CALL RCBBCZM_FILL_TRAILERS;


 CLOSE FILE (RCBBS16);
 CLOSE FILE (RCBBS26);
 CLOSE FILE (RCBBCA0);
                                     /* ISSUE END MESSAGE            */
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS16';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS26';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA0';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

                                     /* ISSUE END MESSAGE            */
 END R099_TERM_S16_S26;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S17_S27                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S17_S27: PROC;

 CALL RCBBCZM_CHECK_TRAILERS_CA1;
 CALL RCBBCZM_FILL_TRAILERS;

 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS17';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS27';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA1';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

 END R099_TERM_S17_S27;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S18_S28                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S18_S28: PROC;

 CALL RCBBCZM_CHECK_TRAILERS_CA0;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS18';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS28';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA2';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S18_S28;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S19_S29                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S19_S29: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA3;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS19';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS29';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA3';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S19_S29;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1A_S2A                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1A_S2A: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA3;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1A';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2A';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA4';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

 END R099_TERM_S1A_S2A;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1B_S2B                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1B_S2B: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA0;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1B';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2B';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA5';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S1B_S2B;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1C_S2C                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1C_S2C: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA6;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1C';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2C';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA6';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S1C_S2C;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1D_S2D                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1D_S2D: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA7;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1D';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2D';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA7';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S1D_S2D;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1E_S2E                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1E_S2E: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA0;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1E';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2E';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA8';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S1E_S2E;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1F_S2F                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1F_S2F: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA9;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1F';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2F';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCA9';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S1F_S2F;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1G_S2G                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1G_S2G: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA1;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1G';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2G';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCAA';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S1G_S2G;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : R099_TERM_S1H_S2H                             */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 R099_TERM_S1H_S2H: PROC;
 CALL RCBBCZM_CHECK_TRAILERS_CA0;
 CALL RCBBCZM_FILL_TRAILERS;
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';      /* ISSUE COUNT MESSAGES */
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS1H';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS16;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBS2H';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBS26;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);

0PARM_INT_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';
 PARM_INT_AREA.MSG_VAR_CODES    = '';
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';
 PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCBBCAB';
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';
 CNT_PIC9                       = COUNT.CNT_TOT.RCBBCA0;
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;
 CALL RCB0M1M (PTR_INT_AREA);
 END R099_TERM_S1H_S2H;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_TERM                                  */
 /*                                                                  */
 /* DESCRIPTION      : TERMINATE PROGRAM                             */
 /*                                                                  */
 /********************************************************************/
 RCBBCZM_TERM: PROC;

 CLOSE FILE (RCBBS16);
 CLOSE FILE (RCBBS26);
 CLOSE FILE (RCBBS17);
 CLOSE FILE (RCBBS27);
 CLOSE FILE (RCBBS18);
 CLOSE FILE (RCBBS28);
 CLOSE FILE (RCBBS19);
 CLOSE FILE (RCBBS29);
 CLOSE FILE (RCBBS1A);
 CLOSE FILE (RCBBS2A);
 CLOSE FILE (RCBBS1B);
 CLOSE FILE (RCBBS2B);
 CLOSE FILE (RCBBS1C);
 CLOSE FILE (RCBBS2C);
 CLOSE FILE (RCBBS1D);
 CLOSE FILE (RCBBS2D);
 CLOSE FILE (RCBBS1E);
 CLOSE FILE (RCBBS2E);
 CLOSE FILE (RCBBS1F);
 CLOSE FILE (RCBBS2F);
 CLOSE FILE (RCBBS1G);
 CLOSE FILE (RCBBS2G);
 CLOSE FILE (RCBBS1H);
 CLOSE FILE (RCBBS2H);
 CLOSE FILE (RCBBCA0);
 CLOSE FILE (RCBBCA1);
 CLOSE FILE (RCBBCA2);
 CLOSE FILE (RCBBCA3);
 CLOSE FILE (RCBBCA4);
 CLOSE FILE (RCBBCA5);
 CLOSE FILE (RCBBCA6);
 CLOSE FILE (RCBBCA7);
 CLOSE FILE (RCBBCA8);
 CLOSE FILE (RCBBCA9);
 CLOSE FILE (RCBBCAA);
 CLOSE FILE (RCBBCAB);

 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'IS';
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '9999';
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';
 CALL RCB0M1M (PTR_INT_AREA);
                                     /* CLOSE MESSAGE FILE           */
 PARM_INT_AREA.MSG_REQUEST    = 'C';
 CALL RCB0M1M (PTR_INT_AREA);
 END RCBBCZM_TERM;
1/********************************************************************/
 /*                                                                  */
 /* MODULE NAME      : RCBBCZM_ERROR                                 */
 /*                                                                  */
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */
 /*                    THE INPUT VARIABLES                           */
 /*                                                                  */
 /********************************************************************/
0RCBBCZM_ERROR: PROC (PTR_ERROR,ERR_TYPE,CALL_ID);

 DCL PTR_ERROR    PTR;
 DCL ERR_TYPE     CHAR(8);
 DCL CALL_ID      CHAR(4);

 PARM_INT_AREA.PTR_ERROR         = PTR_ERROR;
 PARM_INT_AREA.ERR_TYPE          = ERR_TYPE;
 PARM_INT_AREA.CALL_ID           = CALL_ID;
 CALL RCB0E1M (PTR_INT_AREA);

0END RCBBCZM_ERROR;
 /*******************************************************************/
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */
 $DAIMOD (RCBBCZM);                      /* MODULE TO BE COMPILED   */
0/*******************************************************************/
 /* END OF ABR BLOCK                                                */
 /*******************************************************************/
 END RCBBCZM;