1/* RCBBIBM - UPDATE PRIME INPUT RCBT0051_PI_HW_PR TABLE              */00011022
 /*********************************************************************/00020021
 /*                                                                   */00030021
 /*********************************************************************/00040021
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991      */00050021
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                       */00060021
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                   */00070021
 /*********************************************************************/00080021
 /*                                                                   */00090021
 /* MODULE NAME      : RCBBIBM                                        */00100021
 /*                                                                   */00110021
 /* PROGRAM NAME     : RCBBIBP                                        */00120021
 /*                                                                   */00130021
 /* LANGUAGE         : PLISQL                                         */00140021
 /*                                                                   */00150021
 /* TYPE             : BATCH                                          */00160021
 /*                                                                   */00170021
 /* DESCRIPTION      : UPDATE MACHINE INVENTORY FROM PRIME INPUT      */00180021
 /*                    TRANSACTION FILE.                              */00190021
 /*                                                                   */00200021
 /* INPUT            : - DB2   : RCBT0051_PI_HW_PR                    */00210021
 /*                              RCBT0040_OU                          */00220021
 /*                              RCBT0070_HW_PO                       */00230021
 /*                              RCBT0500_PARM                        */00240021
 /*                    - FILE  : RCBBIB0 PRIME INPUT INVENTORY        */00250021
 /*                                                                   */00260021
 /* OUTPUT           : - DB2   : RCBT0051_PI_HW_PR                    */00270021
 /*                            : RCBT0070_HW_PO                       */00280021
 /*                            : RCBBIB1 REJECTED PRIME INPUT         */00290021
 /*                            : RCB0M10 MESSAGE FILE                 */00300021
 /*                                                                   */00310021
 /* SEC TRANSACTIONS :  ----                                          */00320021
 /*                                                                   */00330021
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE               */00340021
 /*                    - RCB0M1M   COMMON MESSAGE ROUTINE             */00350021
 /*                    - RCB0T1M   COMMON MESSAGE ROUTINE             */00360021
 /*                    - RCB004M   CHECK/CONVERT DATE                 */00370021
 /*                    - RCB019M   RETRIEVE COUNTRY NUMBERS           */00380021
 /*                    - RCB020M   RETRIEVE RUN DATE                  */00390021
 /*                    - RCBF07M   INSERT IN TABLE 70                 */00400021
 /*                    - RCBG07M   UPDATE IN TABLE 70                 */00410021
 /*                    - RCBI07M   SELECT IN TABLE 70                 */00420021
 /*                    - RCBF82M   INSERT IN TABLE 51                 */00430021
 /*                    - RCBG82M   UPDATE IN TABLE 51                 */00440021
 /*                    - RCBI82M   REFERENCE TABLE 51                 */00450021
 /*                    - RCBI04M   REFERENCE TABLE 40                 */00460021
 /*                                                                   */00470021
 /* MESSAGES         : 0002 - PROGRAM RUN DATE RETRIEVED              */00480021
 /*                    0003 - NUMBER RECORDS READ, BLOCKED, ACCEPTED  */00490021
 /*                           REJECTED OR SKIPPED                     */00500021
 /*                    0004 - NUMBER OF RECORDS WRITTEN               */00510021
 /*                    0005 - NO COUNTRY FOUND FOR PROGRAM            */00520021
 /*                    0010 - FIELD DEFAULTED                         */00530021
 /*                    0012 - DATE INCORRECT                          */00540021
 /*                    0013 - EMPTY FILE OR DATABASE                  */00550021
 /*                    0019 - INVALID ACTION ASKED FOR                */00560021
 /*                    0025 - THE KEY OF THE INPUT RECORD IS          */00570021
 /*                           INCOMPLETE                              */00580021
 /*                    0026 - FIELD HAS INVALID VALUE                 */00590021
 /*                    0027 - INCORRECT DATE SEQUENCE                 */00600021
 /*                    0028 - WARRANTY TYPE NOT FILLED DURING         */00610021
 /*                           WARRANTY                                */00620021
 /*                    0029 - TYPE OF WARRANTY IS INVALID             */00630021
 /*                    0030 - TYPE OF MAINTENANCE IS INVALID          */00640021
 /*                    0031 - BOTH TYPE OF MAINTENCE AND TYPE OF      */00650021
 /*                           WARRANTY ARE BLANK                      */00660021
 /*                    0032 - NO DELETE WAS DONE                      */00670021
 /*                    0033 - THE INPUT RECORD WAS REJECTED           */00680021
 /*                    0051 - SOURCE INDICATOR NOT FILLED             */00690021
 /*                    0148 - RECORDS FOUND TO INSERT, UPDATE OR      */00700021
 /*                           DELETE                                  */00710021
 /*                    0181 - COUNTRY WAS NOT REQUESTED, ALL RECORDS  */00720021
 /*                           SKIPPED                                 */00730021
 /*                    0184 - COUNTRY REQUESTED, BUT NOT PRESENT      */00740021
 /*                    9999 - PROGRAM SUCCESSFULLY ENDED              */00750021
 /*                                                                   */00760021
 /* SCREENS          : ----                                           */00770021
 /*                                                                   */00780021
 /* DEPENDENCIES     : NONE                                           */00790021
 /*                                                                   */00800021
 /* FREQUENCY        : USER DEPENDENT (ON REQUEST)                    */00810021
 /*                                                                   */00820021
1/*  MAINTENANCE LOG :                                                */00830021
 /*  ---------------                                                  */00840021
 /*                                                                   */00850021
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                          */00860021
 /*  --------------------------------------------------------------   */00870021
 /*  1996-05-01 | ----         | CEDS FIRST IMPLEMENTATION            */00880021
 /*  1996-06-07 | PTM 0947     | DEFAULTS OVERWRITTEN IN INSERT       */00890021
 /*  1996-10-31 | RA01170      | DESIGN CHANGES BECAUSE OF ADDING     */00900021
 /*             |              | SOURCE INDICATOR                     */00910021
 /*             | PTM 0986     | ADD EXIST/EXIST-NOT CHECK ON FIELD   */00920021
 /*             |              | TYPE-MODEL IN TABLE T0070            */00930021
 /*  1996-12-19 | PTM 1013     | WHEN UPDATING RCBV070 DO NOT UPDATE  */00940021
 /*             |              | THE SOURCE_INDICATOR                 */00950021
 /*  1997-04-11 | PTM1036      | CORRECTED PROLOG                     */00960021
 /*  1997-09-10 | RC01191      | CEDS ENHANCEMENTS FOR HVP DATA       */00970021
 /*  1997-13-04 | PTM1117      | ONLY UPDATE T070                     */00980021
 /*             |              |   IF EFF_DATE < T070.EFF_DATE        */00990021
 /*  1997-13-04 | PTM1132      | BUILT_TO_MODEL MUST ALWAYS BE        */01000021
 /*             |              |  UPDATED                             */01010021
 /*  27-02-1998 | PTM1160      | OU_CODE DEFAULT FOR ITALY            */01020021
 /*  12-05-1998 | PTM1179      | NO CHECK ON CUST.NO FOR HONG KONG 738*/01030021
 /*  14-08-1998 | PTM1201      | NO CHECK ON CUST.NO FOR HONG KONG 736*/01040021
 /*             |              | PRC 672 TAIWAN 858                   */01050021
 /*  19-10-1998 | PTM1215      | MESSAGE 0148 WRITTEN TO WRONG SLOT   */01060021
 /*  20-11-2001 | RA01229      | SERVICE REFERENCE INTERIM SOLUTION   */01070021
 /*  03-14-2002 | PTM1380      | INSERT CURRENT TYPE IN T0070         */01080021
 /*  22-04-2004 | JP3746       | FIX FOR JAPAN FOR ALPHA CUSTOMER NOS */01090021
 /*  2004-06-30 | RB01242      | INCREASE LENGTH OF SERIAL NUMBER     */01100021
 /*  2007-03-27 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY        */01110021
 /*             |              | MACHINES                             */01120021
 /*  2007-11-07 | CEDS00000357 |CHANGED FOR WARRANTY_SPLT_DATE IN T051*/01130021
 /*  2007-11-13 | RB01283      |LENOVO FLAG                           */01140021
 /*  2007-12-11 | RB01284      |SDF TO SLC MAPPING                    */01150021
 /*  2008-05-15 | CEDS00000394 |PROCESS JAPAN(760) SHRINKWRAP RECORDS */01160021
 /*  2008-06-07 | CEDS00000402 |NULL INDICATORS HANDELED              */01170021
 /*  2009-06-12 | CEDS00000473 |SOURCE INDICATOR UPDATE IS RESTRICTED */01180021
 /*             |              |WHEN SOURCE INDICATOR IN T51 IS "O"   */01190021
 /*********************************************************************/01200021
1RCBBIBM: PROC                                                          01210021
          OPTIONS (MAIN)                                                01220021
          REORDER;                                                      01230021
0/*********************************************************************/01240021
 /* FILE DECLARATIONS (NON GSAM)                                      */01250021
 /*********************************************************************/01260021
0DCL RCB0M10  FILE RECORD OUTPUT;                                       01270021
 DCL RCBBIB0  FILE RECORD INPUT;                                        01280021
 DCL RCBBIB1  FILE RECORD OUTPUT;                                       01290021
0/*********************************************************************/01300021
 /* EXTERNAL ENTRIES                                                  */01310021
 /*********************************************************************/01320021
0DCL PLIXOPT   EXTERNAL                                                 01330021
               CHAR (30) VARYING INIT ('ISA(10K),NOSTAE');              01340021
 DCL RCB0E1M   ENTRY  EXTERNAL;        /* COMMON ERROR ROUTINE        */01350021
 DCL RCB0M1M   ENTRY  EXTERNAL;        /* COMMON MESSAGE ROUTINE      */01360021
 DCL RCB0T1M   ENTRY  EXTERNAL;        /* COMMON MESSAGE ROUTINE      */01370021
 DCL RCB004M   ENTRY  EXTERNAL;        /* CHECK/CONVERT DATE          */01380021
 DCL RCB019M   ENTRY  EXTERNAL;        /* RETRIEVE COUNTRY NUMBERS    */01390021
 DCL RCB020M   ENTRY  EXTERNAL;        /* RETRIEVE RUN DATE           */01400021
 DCL RCBF07M   ENTRY  EXTERNAL;        /* INSERT T070                 */01410021
 DCL RCBG07M   ENTRY  EXTERNAL;        /* UPDATE T070         PTM1117 */01420021
 DCL RCBI07M   ENTRY  EXTERNAL;        /* SELECT T070         PTM1117 */01430021
 DCL RCBF82M   ENTRY  EXTERNAL;        /* INSERT T051                 */01440021
 DCL RCBG82M   ENTRY  EXTERNAL;        /* UPDATE T051                 */01450021
 DCL RCBI82M   ENTRY  EXTERNAL;        /* REFERENCE T051              */01460021
 DCL RCBI04M   ENTRY  EXTERNAL;        /* REFERENCE T040              */01470021
 DCL RCBI50M   ENTRY  EXTERNAL;        /* RETRIEVE PEW SOURCE RB01284 */01480021
1/*********************************************************************/01490021
 /* EXTERNAL PARAMETER INTERFACES                                     */01500021
 /*********************************************************************/01510021
0DCL PTR_INT_AREA        PTR;                                           01520021
 DCL PTR_RETURN_AREA     PTR;                                           01530021
 DCL PTR_DATE_AREA       PTR;                                           01540021
 DCL PTR_COUNTRY_AREA    PTR;                                           01550021
 DCL PTR_RUN_DATE_AREA   PTR;                                           01560021
                                                                        01570021
 DCL 1 PARM_INT_AREA,                  /* INTERFACE AREA              */01580021
       %INCLUDE (RCBZ01S);;                                             01590021
 DCL 1 COUNTRY_AREA,                   /* COUNTRY AREA                */01600021
       %INCLUDE (RCBZ26S);;                                             01610021
 DCL 1 RETURN_AREA,                    /* RETURN AREA                 */01620021
       %INCLUDE (RCBZ02S);;                                             01630021
 DCL 1 DATE_AREA,                      /* DATE AREA                   */01640021
       %INCLUDE (RCBZ03S);;                                             01650021
 DCL 1 RUN_DATE_AREA,                  /* RUN DATE AREA               */01660021
       %INCLUDE (RCBZ28S);;                                             01670021
 DCL 1 VALID_TPMNT,                    /* TPMNTS                      */01680021
       %INCLUDE (RCBZ99S);;            /* RA01229                     */01690021
0/*********************************************************************/01700021
 /* DB2 SQLCA                                                         */01710021
 /*********************************************************************/01720021
0EXEC SQL                                                               01730021
   INCLUDE SQLCA;                                                       01740021
0/*********************************************************************/01750021
 /* DB2 TABLE STRUCTURES                                              */01760021
 /*********************************************************************/01770021
0DCL PTR_RCBV040    PTR;               /* PTR OU ROW                  */01780021
 DCL PTR_RCBV040I   PTR;               /* PTR NULL-IND. OU            */01790021
 DCL 1 TB_RCBV040,                     /* ORG UNIT  ROW               */01800021
       %INCLUDE (RCB040S);;                                             01810021
 DCL 1 TB_RCBV040_I,                   /* NULL-IND. ORG UNIT          */01820021
       %INCLUDE (RCB040SI);;                                            01830021
 DCL PTR_RCBV051    PTR;               /* PTR INVENTORY ROW           */01840021
 DCL PTR_RCBV051I   PTR;               /* PTR NULL-IND. INVENTORY     */01850021
 DCL 1 TB_RCBV051,                     /* INVENTORY ROW               */01860021
       %INCLUDE (RCB051S);;                                             01870021
 DCL 1 TB_RCBV051_I,                   /* NULL-IND. INVENTORY         */01880021
       %INCLUDE (RCB051SI);;                                            01890021
 DCL PTR_RCBV070    PTR;               /* PTR HW PO ROW               */01900021
 DCL PTR_RCBV070I   PTR;               /* PTR NULL-IND. HW PO         */01910021
 DCL PTR_RCBV070_2  PTR;               /* PTR HW PO ROW       PTM1117 */01920021
 DCL PTR_RCBV070I_2 PTR;               /* PTR NULL-IND. HW PO PTM1117 */01930021
 DCL 1 TB_RCBV070,                     /* HW PO ROW                   */01940021
       %INCLUDE (RCB070S);;                                             01950021
 DCL 1 TB_RCBV070_I,                   /* NULL-IND. HW PO             */01960021
       %INCLUDE (RCB070SI);;                                            01970021
                                       /* SOC RB01284                 */01980021
 DCL PTR_RCBV500    PTR;               /* PTR PARAMETER ROW           */01990021
 DCL PTR_RCBV500I   PTR;               /* PTR NULL-IND. PARAMETER     */02000021
 DCL 1 TB_RCBV500,                     /* PARAMETER ROW               */02010021
       %INCLUDE (RCB500S);;                                             02020021
 DCL 1 TB_RCBV500_I,                   /* NULL-IND. PARAMETER         */02030021
       %INCLUDE (RCB500SI);;           /* EOC RB01284                 */02040021
1/*********************************************************************/02050021
 /*  PROGRAM CONTROL PARAMETERS                       /* SOC RB01284  */02060021
 /*********************************************************************/02070021
0DCL 1 TB_RCB151        BASED(PTR_RCBV500),                             02080021
       %INCLUDE (RCBP151S);;                                            02090021
0DCL 1 RCB151,                                                          02100021
       %INCLUDE (RCBP151S);;                          /* EOC RB01284  */02110021
0/*********************************************************************/02120021
 /*  RECORD STRUCTURES FOR FILES                                      */02130021
 /*********************************************************************/02140021
0DCL RCBBIB0_REC       CHAR(119);      /*RB01283*//*RB01281*//*RA01242*/02150021
 DCL 1 RCBBIB0_PR_I BASED(ADDR(RCBBIB0_REC)),                           02160021
     %INCLUDE(RCBBIBS);;                                                02170021
 DCL RCBBIB1_REC       CHAR(119);      /*RB01283*//*RB01281*//*RA01242*/02180021
1/*********************************************************************/02190021
 /*  PROGRAM CONTROL PARAMETERS                                       */02200021
 /*********************************************************************/02210021
0DCL NBR_ARRAY     FIXED DEC (3,0)     INIT(0);                         02220021
0/*********************************************************************/02230021
 /*  COUNTS                                                           */02240021
 /*********************************************************************/02250021
0DCL 1 CNTS,                                                            02260021
   3 CNT_CTRY,                                                          02270021
     5 READ_CNT            FIXED BIN(31),                               02280021
     5 REJ_CNT             FIXED BIN(31),                               02290021
     5 INS_CNT             FIXED BIN(31),                               02300021
     5 UPD_CNT             FIXED BIN(31),                               02310021
     5 DEL_CNT             FIXED BIN(31),                               02320021
     5 SD_CNT              FIXED BIN(31),                               02330021
     5 WRT_CNT             FIXED BIN(31),                               02340021
     5 SKP_CNT             FIXED BIN(31),                               02350021
   3 CNT_TOT,                                                           02360021
     5 READ_CNT            FIXED BIN(31),                               02370021
     5 REJ_CNT             FIXED BIN(31),                               02380021
     5 INS_CNT             FIXED BIN(31),                               02390021
     5 UPD_CNT             FIXED BIN(31),                               02400021
     5 DEL_CNT             FIXED BIN(31),                               02410021
     5 SD_CNT              FIXED BIN(31),                               02420021
     5 WRT_CNT             FIXED BIN(31),                               02430021
     5 SKP_CNT             FIXED BIN(31);                               02440021
 DCL CNT_PIC9              PIC'(9)9';                                   02450021
 DCL CNT_PIC15             PIC'(15)9';                                  02460021
0/*********************************************************************/02470021
 /*  BIT SWITCHES                                                     */02480021
 /*********************************************************************/02490021
0DCL TRUE                    BIT (1)         INIT('1'B);                02500021
 DCL FALSE                   BIT (1)         INIT('0'B);                02510021
 DCL REJECT                  BIT (1)         INIT('0'B);                02520021
 DCL FOUND                   BIT (1)         INIT('0'B);                02530021
 DCL SW_SKIP_CTRY            BIT (1)         INIT('0'B);                02540021
 DCL SWITCH_END_COUNTRIES    BIT (1)         INIT('0'B);                02550021
 DCL EOF_RCBBIB0             BIT (1)         INIT('0'B);                02560021
 DCL SWITCH_PEW_SOURCE       BIT (1)         INIT('0'B);   /* RB01284 */02570021
1/*********************************************************************/02580021
 /*  ALL OTHER USED TEMPORARY FIELDS                                  */02590021
 /*********************************************************************/02600021
0DCL WRK_MOD_NAME            CHAR (08) INIT ('RCBBIBM ');               02610021
 DCL WRK_PGM_NAME            CHAR (08) INIT ('RCBBIBP ');               02620021
 DCL WRK_SYSTEM_TYPE         CHAR (01) INIT ('B');                      02630021
 DCL WRK_RUN_DATE            CHAR (10);                                 02640021
 DCL WRK_RCBBIB0             CHAR (07) INIT ('RCBBIB0');                02650021
 DCL WRK_RCBBIB1             CHAR (07) INIT ('RCBBIB1');                02660021
 DCL WRK_CTRYNO              CHAR (03) INIT ('');                       02670021
 DCL WRK_PGR_RUN_TYPE        CHAR (03) INIT ('');                       02680021
 DCL WRK_CTRY_FILE_PREV      CHAR (03);                                 02690021
0DCL 1 WRK_INDNULL,                                          /*RC01191*/02700021
       3 SERVICE_LVL_CODE_1  FIXED BIN(15),                             02710021
       3 WARRANTY_SPLT_DATE  FIXED BIN(15),                             02720021
       3 SERVICE_LVL_CODE_2  FIXED BIN(15),                             02730021
       3 SERVICE_LVL_CODE_C  FIXED BIN(15),             /* SOC RB01281*/02740021
 /*    3 SERVICE_LVL_CODE_C  FIXED BIN(15);                           */02750021
       3 F_TYPE_OF_WARRANTY FIXED BIN(15),              /* EOC RB01281*/02760021
       3 WARRANTY_LIABILITY FIXED BIN(15);                 /* RB01283 */02770021
0/*********************************************************************/02780021
 /*  BUILTIN FUNCTIONS                                                */02790021
 /*********************************************************************/02800021
0DCL (ADDR,                                                             02810021
      NULL,                                                             02820021
      VERIFY,                                                           02830021
      INDEX,                                                            02840021
      DATE,                                                             02850021
      SUBSTR)           BUILTIN;                                        02860021
0/*********************************************************************/02870021
 /* ON ERROR CONDITIONS                                               */02880021
 /*********************************************************************/02890021
0%INCLUDE (RCB0E0M);                                                    02900021
   END;                                                                 02910021
 ON ENDFILE(RCBBIB0) EOF_RCBBIB0 = '1'B;                                02920021
0/*********************************************************************/02930021
 /*  MERGE CONDITIONS                                                 */02940021
 /*                                                   * SOC   *RC01191*/02950021
 /*  MERGE_ONLY     = OVERWRITE ROW TABLE RCBT051 WITH DEALER CODE    */02960021
 /*                                                                   */02970021
 /*  MERGE_ALL_EXCL = OVERWRITE ROW TABLE RCBT051 WITH INPUT RECORD   */02980021
 /*                   EXCEPT FOR DEALER CODE                          */02990021
 /*                                                   * EOC   *RC01191*/03000021
 /*********************************************************************/03010021
0DCL 1 MERGE_UPDATE_STATES,                                             03020021
       3 MERGE_ONLY             CHAR(1) INIT('1'),                      03030021
       3 MERGE_ALL_EXCL         CHAR(1) INIT('2'),                      03040021
       3 MERGE_ALL_MEMBERS      CHAR(1) INIT('3');                      03050021
1/*********************************************************************/03060021
 /*                 S T A R T   P R O C E S S I N G                   */03070021
 /*********************************************************************/03080021
0CALL RCBBIBM_INIT_PROGRAM;                                             03090021
                                                                        03100021
 IF EOF_RCBBIB0                                                         03110021
 THEN DO;                                                               03120021
   PARM_INT_AREA.MSG_VAR_CODES   = '';                                  03130021
   PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                03140021
   PARM_INT_AREA.MESSAGE_NUMBER  = '0013';                              03150021
   PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                                03160021
   PARM_INT_AREA.MSG_VAR_VALUE_6 = 'RCBBIB0';                           03170021
   CALL RCB0M1M (PTR_INT_AREA);                                         03180021
 END;                                                                   03190021
 ELSE DO;                                                               03200021
   CALL RCBBIBM_INIT_COUNTRY;                                           03210021
   DO WHILE (¬(SWITCH_END_COUNTRIES & EOF_RCBBIB0));                    03220021
                                    /* MORE RECORDS FOR THIS COUNTRY? */03230021
     DO WHILE (((RCBBIB0_PR_I.COUNTRY_NUMBER = WRK_CTRY_FILE_PREV) &    03240021
               ¬EOF_RCBBIB0)  &                                         03250021
               ((RCBBIB0_PR_I.COUNTRY_NUMBER <= WRK_CTRYNO)|            03260021
                                     SWITCH_END_COUNTRIES));            03270021
       CNTS.CNT_CTRY.READ_CNT = CNTS.CNT_CTRY.READ_CNT + 1;             03280021
       IF SW_SKIP_CTRY                                                  03290021
       THEN DO;                                                         03300021
         WRITE FILE(RCBBIB1) FROM(RCBBIB0_REC);                         03310021
         CNT_CTRY.SKP_CNT = CNT_CTRY.SKP_CNT + 1;                       03320021
         CNT_CTRY.WRT_CNT = CNT_CTRY.WRT_CNT + 1;                       03330021
       END;                                                             03340021
       ELSE DO;                                                         03350021
         CALL RCBBIBM_VALIDATE_RECORD;                                  03360021
         CALL RCBBIBM_PROCESS_RECORD;                                   03370021
       END;                                                             03380021
       CALL RCBBIBM_READ_RECORD;                                        03390021
     END;                                                               03400021
     CALL RCBBIBM_TERM_COUNTRY;                                         03410021
     CALL RCBBIBM_INIT_COUNTRY;                                         03420021
     WRK_CTRY_FILE_PREV = RCBBIB0_PR_I.COUNTRY_NUMBER;                  03430021
   END;                                                                 03440021
 END;                                                                   03450021
                                                                        03460021
 CALL RCBBIBM_TERM_PROGRAM;                                             03470021
1/*********************************************************************/03480021
 /*                                                                   */03490021
 /* MODULE NAME      : READ_RECORD                                    */03500021
 /*                                                                   */03510021
 /* DESCRIPTION      : READ INVENTORY PRIME INPUT                     */03520021
 /*                                                                   */03530021
 /*********************************************************************/03540021
0RCBBIBM_READ_RECORD: PROC;                                             03550021
                                                                        03560021
 WRK_CTRY_FILE_PREV = RCBBIB0_PR_I.COUNTRY_NUMBER;                      03570021
 READ FILE(RCBBIB0) INTO(RCBBIB0_REC);                                  03580021
 PARM_INT_AREA.SEQUENCE_KEY = RCBBIB0_PR_I.COUNTRY_NUMBER ||            03590021
                              RCBBIB0_PR_I.PRODUCT_TYPE ||              03600021
                              RCBBIB0_PR_I.ORIGIN ||                    03610021
                              RCBBIB0_PR_I.SEQUENCE_NUMBER;             03620021
 REJECT = '0'B;                                                         03630021
                                                                        03640021
 END RCBBIBM_READ_RECORD;                                               03650021
1/*********************************************************************/03660021
 /*                                                                   */03670021
 /* MODULE NAME      : VALIDATE_RECORD                                */03680021
 /*                                                                   */03690021
 /* DESCRIPTION      : CHECK PRIME INVENTORY INPUT                    */03700021
 /*                                                                   */03710021
 /*********************************************************************/03720021
0RCBBIBM_VALIDATE_RECORD: PROC;                                         03730021
                                                                        03740021
 IF INDEX(RCBBIB0_PR_I.PRODUCT_TYPE,' ')    ¬= 0 |                      03750021
    INDEX(RCBBIB0_PR_I.ORIGIN      ,' ')    ¬= 0 |                      03760021
    INDEX(RCBBIB0_PR_I.COUNTRY_NUMBER,' ')  ¬= 0                        03770021
 THEN DO;                                                               03780021
   PARM_INT_AREA.MSG_VAR_CODES   = '';                                  03790021
   PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                                03800021
   PARM_INT_AREA.MESSAGE_NUMBER  = '0025';                              03810021
   PARM_INT_AREA.MSG_VAR_CODE_6  = 'HW';                                03820021
   PARM_INT_AREA.MSG_VAR_VALUE_6 = RCBBIB0_PR_I.PRODUCT_TYPE ||         03830021
                                   RCBBIB0_PR_I.ORIGIN       ||         03840021
                                   RCBBIB0_PR_I.SEQUENCE_NUMBER;        03850021
   PARM_INT_AREA.MSG_VAR_CODE_7  = 'CY';                                03860021
   PARM_INT_AREA.MSG_VAR_VALUE_7 = WRK_CTRYNO;                          03870021
   CALL RCB0M1M (PTR_INT_AREA);                                         03880021
   REJECT = '1'B;                                                       03890021
 END;                                                                   03900021
 IF RCBBIB0_PR_I.ACTION_CODE ¬= 'A' &                                   03910021
    RCBBIB0_PR_I.ACTION_CODE ¬= 'D'                                     03920021
 THEN DO;                                                               03930021
   PARM_INT_AREA.MSG_VAR_CODES   = '';                                  03940021
   PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                03950021
   PARM_INT_AREA.MESSAGE_NUMBER  = '0019';                              03960021
   PARM_INT_AREA.MSG_VAR_CODE_6  = 'AC';                                03970021
   PARM_INT_AREA.MSG_VAR_VALUE_6 = RCBBIB0_PR_I.ACTION_CODE;            03980021
   CALL RCB0M1M (PTR_INT_AREA);                                         03990021
   REJECT = '1'B;                                                       04000021
 END;                                                                   04010021
 IF RCBBIB0_PR_I.SOURCE_INDICATOR = ''                                  04020021
 THEN DO;                                                               04030021
   PARM_INT_AREA.MSG_VAR_CODES   = '';                                  04040021
   PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                04050021
   PARM_INT_AREA.MESSAGE_NUMBER  = '0051';                              04060021
   PARM_INT_AREA.MSG_VAR_CODE_6  = 'SI';                                04070021
   PARM_INT_AREA.MSG_VAR_VALUE_6 = RCBBIB0_PR_I.SOURCE_INDICATOR;       04080021
   CALL RCB0M1M (PTR_INT_AREA);                                         04090021
   REJECT = '1'B;                                                       04100021
 END;                                                                   04110021
                                      /* IF SO FAR NOT OK EOC CHECKS  */04120021
 IF REJECT = '0'B                                                       04130021
 THEN DO;                                                               04140021
   CALL RCBBIBM_RETRIEVE;                                               04150021
   IF ACTION_CODE = 'A'                                                 04160021
   THEN DO;                                                             04170021
     IF FOUND ='1'B                                                     04180021
     THEN DO;                                                           04190021
       IF RCBBIB0_PR_I.SOURCE_INDICATOR = 'S'                           04200021
       THEN DO;                                                         04210021
         CALL RCBBIBM_MERGE(MERGE_ALL_EXCL);                            04220021
       END;                                                             04230021
       ELSE DO;                                                         04240021
         IF TB_RCBV051.SOURCE_INDICATOR = 'S'                           04250021
         THEN                                                           04260021
           CALL RCBBIBM_MERGE(MERGE_ONLY);                              04270021
         ELSE                                                           04280021
           CALL RCBBIBM_MERGE(MERGE_ALL_MEMBERS);                       04290021
       END;                                                             04300021
     END;                                                               04310021
     ELSE DO;                                 /* INSERT FOR RCBT0051  */04320021
       TB_RCBV051 = RCBBIB0_PR_I, BY NAME;                              04330021
       IF TB_RCBV051.SERVICE_LVL_CODE_1 <= ''        /* SOC   *RC01191*/04340021
       THEN DO;                                                         04350021
         WRK_INDNULL.SERVICE_LVL_CODE_1 = -1;                           04360021
         TB_RCBV051_I.INDNULL(11)       = -1;                           04370021
       END;                                                             04380021
       ELSE DO;                                                         04390021
         WRK_INDNULL.SERVICE_LVL_CODE_1 = 0;                            04400021
         TB_RCBV051_I.INDNULL(11)       = 0;                            04410021
       END;                                                             04420021
       IF TB_RCBV051.SERVICE_LVL_CODE_2 <= ''                           04430021
       THEN DO;                                                         04440021
         WRK_INDNULL.SERVICE_LVL_CODE_2 = -1;                           04450021
         TB_RCBV051_I.INDNULL(13)       = -1;                           04460021
       END;                                                             04470021
       ELSE DO;                                                         04480021
         WRK_INDNULL.SERVICE_LVL_CODE_2 = 0;                            04490021
         TB_RCBV051_I.INDNULL(13)       = 0;                            04500021
       END;                                                             04510021
       IF TB_RCBV051.WARRANTY_SPLT_DATE <= ''                           04520021
       THEN DO;                                                         04530021
         WRK_INDNULL.WARRANTY_SPLT_DATE = -1;                           04540021
         TB_RCBV051_I.INDNULL(12)       = -1;                           04550021
       END;                                                             04560021
       ELSE DO;                                                         04570021
         WRK_INDNULL.WARRANTY_SPLT_DATE = 0;                            04580021
         TB_RCBV051_I.INDNULL(12)       = 0;                            04590021
       END;                                          /* EOC   *RC01191*/04600021
       IF TB_RCBV051.F_TYPE_OF_WARRANTY<= ''         /* SOC   *RB01281*/04610021
       THEN DO;                                                         04620021
         WRK_INDNULL.F_TYPE_OF_WARRANTY = -1;                           04630021
         TB_RCBV051_I.INDNULL(22)       = -1;                           04640021
       END;                                                             04650021
       ELSE DO;                                                         04660021
         WRK_INDNULL.F_TYPE_OF_WARRANTY = 0;                            04670021
         TB_RCBV051_I.INDNULL(22)       = 0;                            04680021
       END;                                          /* EOC   *RB01281*/04690021
       IF TB_RCBV051.SERVICE_LVL_CODE_C <= ''                           04700021
       THEN DO;                                                         04710021
         WRK_INDNULL.SERVICE_LVL_CODE_C = -1;                           04720021
         TB_RCBV051_I.INDNULL(19)       = -1;                           04730021
       END;                                                             04740021
       ELSE DO;                                                         04750021
         WRK_INDNULL.SERVICE_LVL_CODE_C = 0;                            04760021
         TB_RCBV051_I.INDNULL(19)       = 0;                            04770021
       END;                                                             04780021
       IF TB_RCBV051.WARRANTY_LIABILITY <= ''           /* SOC RB01283*/04790021
       THEN DO;                                                         04800021
         WRK_INDNULL.WARRANTY_LIABILITY = -1;                           04810021
         TB_RCBV051_I.INDNULL(23)       = -1;                           04820021
       END;                                                             04830021
       ELSE DO;                                                         04840021
         WRK_INDNULL.WARRANTY_LIABILITY = 0;                            04850021
         TB_RCBV051_I.INDNULL(23)       = 0;                            04860021
       END;                                             /* EOC RB01283*/04870021
     END;                                                               04880021
     CALL RCBBIBM_DATE_CHECK(TB_RCBV051.INSTALL_DATE);                  04890021
     CALL RCBBIBM_DATE_CHECK(TB_RCBV051.WARRANTY_EXP_DATE);             04900021
 /* THE FOLLOWING CODE HAS BEEN COMMENTED OUT FOR JAPAN REF JP3746 */   04910021
 /*                                                     SOC JP3746      04920021
     IF VERIFY(SUBSTR(TB_RCBV051.CUSTOMER_NUMBER,3,6),'0123456789')¬=0  04930021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '738'                             04940021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '736'                             04950021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '672'                             04960021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '858'                             04970021
     THEN DO;                                                           04980021
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              04990021
       PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                            05000021
       PARM_INT_AREA.MESSAGE_NUMBER  = '0026';                          05010021
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FN';                            05020021
       PARM_INT_AREA.MSG_VAR_VALUE_6 = 'CUSTOMER_NUMBER';               05030021
       PARM_INT_AREA.MSG_VAR_CODE_7  = 'FV';                            05040021
       PARM_INT_AREA.MSG_VAR_VALUE_7 = TB_RCBV051.CUSTOMER_NUMBER;      05050021
       CALL RCB0M1M (PTR_INT_AREA);                                     05060021
       REJECT = '1'B;                                                   05070021
     END; EOC JP3746                                                    05080021
 */                                                                     05090021
     IF TB_RCBV051.CUSTOMER_NR_EXTEND = '   '                           05100021
     THEN                                                               05110021
       TB_RCBV051.CUSTOMER_NR_EXTEND = '000';                           05120021
     IF VERIFY(TB_RCBV051.CUSTOMER_NR_EXTEND,'0123456789')¬=0           05130021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '738'               /* PTM1179 */ 05140021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '736'               /* PTM1201 */ 05150021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '760'            /*CEDS00000394*/ 05160021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '672'               /* PTM1201 */ 05170021
     & RCBBIB0_PR_I.COUNTRY_NUMBER ¬= '858'               /* PTM1201 */ 05180021
     THEN DO;                                                           05190021
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              05200021
       PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                            05210021
       PARM_INT_AREA.MESSAGE_NUMBER  = '0026';                          05220021
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FN';                            05230021
       PARM_INT_AREA.MSG_VAR_VALUE_6 = 'CUSTOMER_NR_EXTEND';            05240021
       PARM_INT_AREA.MSG_VAR_CODE_7  = 'FV';                            05250021
       PARM_INT_AREA.MSG_VAR_VALUE_7 = TB_RCBV051.CUSTOMER_NR_EXTEND;   05260021
       CALL RCB0M1M (PTR_INT_AREA);                                     05270021
       REJECT = '1'B;                                                   05280021
     END;                                                               05290021
     IF TB_RCBV051.DEALER_NUMBER ¬= '' &                                05300021
        INDEX(TB_RCBV051.DEALER_NUMBER,' ') ¬= 0                        05310021
     THEN DO;                                                           05320021
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              05330021
       PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                            05340021
       PARM_INT_AREA.MESSAGE_NUMBER  = '0026';                          05350021
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FN';                            05360021
       PARM_INT_AREA.MSG_VAR_VALUE_6 = 'DEALER_NUMBER';                 05370021
       PARM_INT_AREA.MSG_VAR_CODE_7  = 'FV';                            05380021
       PARM_INT_AREA.MSG_VAR_VALUE_7 = TB_RCBV051.DEALER_NUMBER;        05390021
       CALL RCB0M1M (PTR_INT_AREA);                                     05400021
       REJECT = '1'B;                                                   05410021
     END;                                                               05420021
     IF TB_RCBV051.WARRANTY_EXP_DATE < TB_RCBV051.INSTALL_DATE          05430021
     THEN DO;                                                           05440021
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              05450021
       PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                            05460021
       PARM_INT_AREA.MESSAGE_NUMBER  = '0027';                          05470021
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'D4';                            05480021
       PARM_INT_AREA.MSG_VAR_VALUE_6 = TB_RCBV051.INSTALL_DATE;         05490021
       PARM_INT_AREA.MSG_VAR_CODE_7  = 'D5';                            05500021
       PARM_INT_AREA.MSG_VAR_VALUE_7 = TB_RCBV051.WARRANTY_EXP_DATE;    05510021
       CALL RCB0M1M (PTR_INT_AREA);                                     05520021
       REJECT = '1'B;                                                   05530021
     END;                                                               05540021
     IF TB_RCBV051.WARRANTY_EXP_DATE  >  WRK_RUN_DATE &                 05550021
        TB_RCBV051.TYPE_OF_WARRANTY    = ' '                            05560021
     THEN DO;                                                           05570021
       PARM_INT_AREA.MSG_VAR_CODES  = '';                               05580021
       PARM_INT_AREA.MESSAGE_TYPE   = 'BU';                             05590021
       PARM_INT_AREA.MESSAGE_NUMBER = '0028';                           05600021
       CALL RCB0M1M (PTR_INT_AREA);                                     05610021
       REJECT = '1'B;                                                   05620021
     END;                                                               05630021
     IF TB_RCBV051.WARRANTY_SPLT_DATE >  WRK_RUN_DATE & /* SOC RB01281*/05640021
        TB_RCBV051.TYPE_OF_WARRANTY    = ' '                            05650021
     THEN DO;                                                           05660021
       PARM_INT_AREA.MSG_VAR_CODES  = '';                               05670021
       PARM_INT_AREA.MESSAGE_TYPE   = 'BU';                             05680021
       PARM_INT_AREA.MESSAGE_NUMBER = '0032';                           05690021
       CALL RCB0M1M (PTR_INT_AREA);                                     05700021
       REJECT = '1'B;                                                   05710021
     END;                                                               05720021
     IF TB_RCBV051.WARRANTY_SPLT_DATE ¬= '' THEN /* CEDS00000357*/      05730021
     DO;                                         /* CEDS00000357*/      05740021
       IF TB_RCBV051.WARRANTY_EXP_DATE  >  WRK_RUN_DATE >               05750021
          TB_RCBV051.WARRANTY_SPLT_DATE &                               05760021
          TB_RCBV051.F_TYPE_OF_WARRANTY = ' '                           05770021
       THEN DO;                                                         05780021
         PARM_INT_AREA.MSG_VAR_CODES  = '';                             05790021
         PARM_INT_AREA.MESSAGE_TYPE   = 'BU';                           05800021
         PARM_INT_AREA.MESSAGE_NUMBER = '0033';                         05810021
         CALL RCB0M1M (PTR_INT_AREA);                                   05820021
         REJECT = '1'B;                                                 05830021
       END;                                             /* EOC RB01281*/05840021
     END;                                       /* CEDS00000357*/       05850021
     IF TB_RCBV051.TYPE_OF_WARRANTY ¬= ' ' &                            05860021
       VERIFY(TB_RCBV051.TYPE_OF_WARRANTY,VALID_TPMNT.TPMNT_WAR)¬=   '0'05870021
     THEN DO;                                                           05880021
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              05890021
       PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                            05900021
       PARM_INT_AREA.MESSAGE_NUMBER  = '0029';                          05910021
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FV';                            05920021
       PARM_INT_AREA.MSG_VAR_VALUE_6 = TB_RCBV051.TYPE_OF_WARRANTY;     05930021
       CALL RCB0M1M (PTR_INT_AREA);                                     05940021
       REJECT = '1'B;                                                   05950021
     END;                                                               05960021
     IF TB_RCBV051.TYPE_OF_MAINT ¬= ' ' &                               05970021
       VERIFY(TB_RCBV051.TYPE_OF_MAINT,VALID_TPMNT.TPMNT_NO_WAR)¬='0'   05980021
     THEN DO;                                                           05990021
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              06000021
       PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                            06010021
       PARM_INT_AREA.MESSAGE_NUMBER  = '0030';                          06020021
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FV';                            06030021
       PARM_INT_AREA.MSG_VAR_VALUE_6 = TB_RCBV051.TYPE_OF_MAINT;        06040021
       CALL RCB0M1M (PTR_INT_AREA);                                     06050021
       REJECT = '1'B;                                                   06060021
     END;                                                               06070021
     IF TB_RCBV051.TYPE_OF_WARRANTY   = ' ' &                           06080021
        TB_RCBV051.F_TYPE_OF_WARRANTY = ' ' &             /* RB01281*/  06090021
        TB_RCBV051.TYPE_OF_MAINT      = ' '                             06100021
     THEN DO;                                                           06110021
       PARM_INT_AREA.MSG_VAR_CODES  = '';                               06120021
       PARM_INT_AREA.MESSAGE_TYPE   = 'BU';                             06130021
       PARM_INT_AREA.MESSAGE_NUMBER = '0031';                           06140021
       CALL RCB0M1M (PTR_INT_AREA);                                     06150021
       REJECT = '1'B;                                                   06160021
     END;                                                               06170021
     TB_RCBV040.COUNTRY_NUMBER = WRK_CTRYNO;                            06180021
     TB_RCBV040.OU_CODE = TB_RCBV051.OU_CODE;                           06190021
     CALL RCBI04M (PTR_RCBV040,                                         06200021
                   PTR_RCBV040I,                                        06210021
                   PTR_RETURN_AREA,                                     06220021
                   PTR_INT_AREA);                                       06230021
     SELECT (RETURN_AREA.RETURN_CODE);                                  06240021
     WHEN (0);                                                          06250021
     WHEN (4)                                                           06260021
       DO;                                                              06270021
         PARM_INT_AREA.COUNTRY_NUMBER  = WRK_CTRYNO;                    06280021
         PARM_INT_AREA.MSG_VAR_CODES   = '';                            06290021
         PARM_INT_AREA.MESSAGE_TYPE    = 'BU';                          06300021
         PARM_INT_AREA.MESSAGE_NUMBER  = '0010';                        06310021
         PARM_INT_AREA.MSG_VAR_CODE_6  = 'FN';                          06320021
         PARM_INT_AREA.MSG_VAR_VALUE_6 = 'OU_CODE';                     06330021
         PARM_INT_AREA.MSG_VAR_CODE_7  = 'OV';                          06340021
         PARM_INT_AREA.MSG_VAR_VALUE_7 = TB_RCBV051.OU_CODE;            06350021
         PARM_INT_AREA.MSG_VAR_CODE_8  = 'NV';                          06360021
         PARM_INT_AREA.MSG_VAR_VALUE_8 = '';                            06370021
         CALL RCB0M1M (PTR_INT_AREA);                                   06380021
         IF TB_RCBV040.COUNTRY_NUMBER = '758'          /* SOC PTM1160 */06390021
         THEN                                                           06400021
            TB_RCBV051.OU_CODE     = '9001   ';                         06410021
         ELSE                                                           06420021
            TB_RCBV051.OU_CODE     = '';               /* EOC PTM1160 */06430021
       END;                                                             06440021
     OTHERWISE                                                          06450021
       DO;                                                              06460021
         CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),               06470021
                            'DB2','#001');                              06480021
       END;                                                             06490021
     END;                                                               06500021
   END;                                                                 06510021
 END;                                                                   06520021
                                                                        06530021
 END RCBBIBM_VALIDATE_RECORD;                                           06540021
1/*********************************************************************/06550021
 /*                                                                   */06560021
 /* MODULE NAME      : PROCESS_RECORD                                 */06570021
 /*                                                                   */06580021
 /* DESCRIPTION      : PROCESS INVENTORY PRIME INPUT                  */06590021
 /*                                                                   */06600021
 /*********************************************************************/06610021
0RCBBIBM_PROCESS_RECORD: PROC;                                          06620021
                                                                        06630021
 IF REJECT = '1'B                                                       06640021
 THEN DO;                                                               06650021
   WRITE FILE(RCBBIB1) FROM(RCBBIB0_REC);                               06660021
   PARM_INT_AREA.MSG_VAR_CODES      = '';                               06670021
   PARM_INT_AREA.MESSAGE_TYPE       = 'BU';                             06680021
   PARM_INT_AREA.MESSAGE_NUMBER     = '0033';                           06690021
   PARM_INT_AREA.MSG_VAR_CODE_6     = 'SK';                             06700021
   PARM_INT_AREA.MSG_VAR_VALUE_6    = PARM_INT_AREA.SEQUENCE_KEY;       06710021
   CALL RCB0M1M (PTR_INT_AREA);                                         06720021
   CNT_CTRY.REJ_CNT = CNT_CTRY.REJ_CNT + 1;                             06730021
   CNT_CTRY.WRT_CNT = CNT_CTRY.WRT_CNT + 1;                             06740021
 END;                                                                   06750021
 ELSE DO;                                                               06760021
   IF (ACTION_CODE = 'A')  & (FOUND= '0'B)                              06770021
   THEN                                                                 06780021
     CALL RCBBIBM_INSERT;                                               06790021
   IF (ACTION_CODE = 'A')  & (FOUND= '1'B)                              06800021
   THEN DO;                                                             06810021
     CALL RCBBIBM_UPDATE;                                               06820021
     CNTS.CNT_CTRY.UPD_CNT = CNTS.CNT_CTRY.UPD_CNT + 1;                 06830021
   END;                                                                 06840021
   IF ACTION_CODE = 'D'                                                 06850021
   THEN DO;                                                             06860021
                                                       /* SOC RC01191 */06870021
     /* CHECK IF THE WARRANTY EXPIRATION DATE IS STILL VALID AFTER    */06880021
     /* THE RUN DATE. IF SO THE WARRANTY EXPIRATION DATE MUST BE SET  */06890021
     /* TO THE RUN DATE. IF THE WARRANTY SPLIT DATE IS ALSO STILL     */06900021
     /* VALID AFTER THE RUN DATE THE WARRANTY SPLIT DATE MUST BE SET  */06910021
     /* TO DB2 NULL, AS WELL AS THE RELATED FIELD SERVICE LEVEL CODE 2*/06920021
                                                       /* EOC RC01191 */06930021
     IF (FOUND = '1'B)                                                  06940021
          & (TB_RCBV051.WARRANTY_EXP_DATE > WRK_RUN_DATE)               06950021
     THEN DO;                                                           06960021
       TB_RCBV051.WARRANTY_EXP_DATE = WRK_RUN_DATE ;                    06970021
       TB_RCBV051.SOURCE_INDICATOR  = RCBBIB0_PR_I.SOURCE_INDICATOR;    06980021
                                                       /* SOC RC01191 */06990021
       IF TB_RCBV051.WARRANTY_SPLT_DATE > WRK_RUN_DATE &                07000021
          TB_RCBV051_I.INDNULL(12)     ¬= -1                            07010021
       THEN DO;                                                         07020021
         TB_RCBV051_I.INDNULL(12) = -1;        /* WARRANTY SPLIT DATE */07030021
         TB_RCBV051_I.INDNULL(13) = -1;        /* SERVICE LEVEL CODE 2*/07040021
       END;                                                             07050021
                                                       /* EOC *RC01191*/07060021
       CALL RCBBIBM_UPDATE;                                             07070021
       CNTS.CNT_CTRY.DEL_CNT = CNTS.CNT_CTRY.DEL_CNT + 1;               07080021
     END;                                                               07090021
     ELSE DO;                                                           07100021
       PARM_INT_AREA.MSG_VAR_CODES = '';                                07110021
       PARM_INT_AREA.MESSAGE_TYPE = 'BU';                               07120021
       PARM_INT_AREA.MESSAGE_NUMBER = '0032';                           07130021
       PARM_INT_AREA.MSG_VAR_CODE_6 = 'SK';                             07140021
       PARM_INT_AREA.MSG_VAR_VALUE_6 = PARM_INT_AREA.SEQUENCE_KEY;      07150021
       CALL RCB0M1M (PTR_INT_AREA);                                     07160021
       CNTS.CNT_CTRY.SD_CNT = CNTS.CNT_CTRY.SD_CNT + 1;                 07170021
     END;                                                               07180021
   END;                                                                 07190021
   EXEC SQL COMMIT;                                                     07200021
 END;                                                                   07210021
                                                                        07220021
 END RCBBIBM_PROCESS_RECORD;                                            07230021
1/*********************************************************************/07240021
 /*                                                                   */07250021
 /* MODULE NAME      : MERGE                                          */07260021
 /*                                                                   */07270021
 /* DESCRIPTION      : MERGE UPDATE RECORD WITH ORIGINAL RECORD       */07280021
 /*                                                                   */07290021
 /* IF THE WARRANTY EXPIRATION DATE HAS NOT CHANGED THE SERVICE       */07300021
 /* LEVEL CODES CAN ONLY BE UPDATED IF THEY WERE NOT ALREADY FILLED   */07310021
 /* IN.                                                               */07320021
 /* IF THE WARRANTY EXPIRATION DATE HAS CHANGED THE RELATED FIELDS    */07330021
 /* SLC'S, TYPE OF WARRANTY AND WARRANTY SPLIT DATE MUST BE UPDATED   */07340021
 /* WITH THE VALUES FROM THE INPUT FILE.                              */07350021
 /*                                                                   */07360021
 /*                                                                   */07370021
 /*********************************************************************/07380021
0RCBBIBM_MERGE: PROC(UPDATE_SPEC);                                      07390021
                                                                        07400021
 DCL UPDATE_SPEC   CHAR(1);                                             07410021
 IF SWITCH_PEW_SOURCE = TRUE THEN                      /* SOC RB01284 */07420021
   DO;                                                                  07430021
     IF RCBBIB0_PR_I.SERVICE_LVL_CODE_1 ¬='' THEN                       07440021
       DO;                                                              07450021
         TB_RCBV051.SERVICE_LVL_CODE_1 =                                07460021
                                    RCBBIB0_PR_I.SERVICE_LVL_CODE_1;    07470021
         TB_RCBV051_I.INDNULL(11)      = 0;       /* SOC CEDS00000402 */07480021
       END;                                                             07490021
     ELSE DO;                                                           07500021
         TB_RCBV051.SERVICE_LVL_CODE_1 = '';                            07510021
         TB_RCBV051_I.INDNULL(11)      = -1;                            07520021
     END;                                         /* EOC CEDS00000402 */07530021
     IF RCBBIB0_PR_I.SERVICE_LVL_CODE_2 ¬='' THEN                       07540021
       DO;                                                              07550021
         TB_RCBV051.SERVICE_LVL_CODE_2 =                                07560021
                                    RCBBIB0_PR_I.SERVICE_LVL_CODE_2;    07570021
         TB_RCBV051_I.INDNULL(13)      = 0;       /* SOC CEDS00000402 */07580021
       END;                                                             07590021
     ELSE DO;                                                           07600021
         TB_RCBV051.SERVICE_LVL_CODE_2 = '';                            07610021
         TB_RCBV051_I.INDNULL(13)      = -1;                            07620021
     END;                                         /* EOC CEDS00000402 */07630021
     IF RCBBIB0_PR_I.SERVICE_LVL_CODE_C ¬='' THEN                       07640021
       DO;                                                              07650021
         TB_RCBV051.SERVICE_LVL_CODE_C =                                07660021
                                    RCBBIB0_PR_I.SERVICE_LVL_CODE_C;    07670021
         TB_RCBV051_I.INDNULL(19)      = 0;       /* SOC CEDS00000402 */07680021
       END;                                                             07690021
     ELSE DO;                                                           07700021
         TB_RCBV051.SERVICE_LVL_CODE_C = '';                            07710021
         TB_RCBV051_I.INDNULL(19)      = -1;                            07720021
     END;                                         /* EOC CEDS00000402 */07730021
   END;                                                /* EOC *RB01284*/07740021
                                                       /* SOC *RC01191*/07750021
 IF RCBBIB0_PR_I.WARRANTY_EXP_DATE ¬= TB_RCBV051.WARRANTY_EXP_DATE |    07760021
   (TB_RCBV051_I.INDNULL(11) = -1      &                                07770021
     RCBBIB0_PR_I.SERVICE_LVL_CODE_1 ¬= '')                             07780021
 THEN DO;                                                               07790021
    TB_RCBV051.WARRANTY_EXP_DATE   = RCBBIB0_PR_I.WARRANTY_EXP_DATE;    07800021
    IF RCBBIB0_PR_I.SERVICE_LVL_CODE_1 ¬=''                             07810021
    THEN DO;                                                            07820021
       TB_RCBV051.SERVICE_LVL_CODE_1 =                                  07830021
                                    RCBBIB0_PR_I.SERVICE_LVL_CODE_1;    07840021
       TB_RCBV051_I.INDNULL(11)      = 0;                               07850021
    END;                                                                07860021
    ELSE DO;                                                            07870021
       TB_RCBV051.SERVICE_LVL_CODE_1 = '';                              07880021
       TB_RCBV051_I.INDNULL(11)      = -1;                              07890021
    END;                                                                07900021
    IF RCBBIB0_PR_I.TYPE_OF_WARRANTY ¬= ''                              07910021
    THEN                                                                07920021
       TB_RCBV051.TYPE_OF_WARRANTY   = RCBBIB0_PR_I.TYPE_OF_WARRANTY;   07930021
    ELSE                                                                07940021
       TB_RCBV051.TYPE_OF_WARRANTY   = '';                              07950021
    IF RCBBIB0_PR_I.F_TYPE_OF_WARRANTY ¬= ''            /* SOC RB01281*/07960021
    THEN                                                                07970021
      DO;                                             /* CEDS00000402 */07980021
       TB_RCBV051.F_TYPE_OF_WARRANTY =  RCBBIB0_PR_I.F_TYPE_OF_WARRANTY;07990021
       TB_RCBV051_I.INDNULL(22)      = 0;             /* CEDS00000402 */08000021
      END;                                            /* CEDS00000402 */08010021
    ELSE                                                                08020021
      DO;                                             /* CEDS00000402 */08030021
       TB_RCBV051.F_TYPE_OF_WARRANTY= '';               /* EOC RB01281*/08040021
       TB_RCBV051_I.INDNULL(22)     = -1;             /* CEDS00000402 */08050021
      END;                                            /* CEDS00000402 */08060021
    IF RCBBIB0_PR_I.SERVICE_LVL_CODE_2 ¬=''                             08070021
    THEN DO;                                                            08080021
       TB_RCBV051.SERVICE_LVL_CODE_2 =                                  08090021
                                    RCBBIB0_PR_I.SERVICE_LVL_CODE_2;    08100021
       TB_RCBV051_I.INDNULL(13)      = 0;                               08110021
    END;                                                                08120021
    ELSE DO;                                                            08130021
       TB_RCBV051.SERVICE_LVL_CODE_2 = '';                              08140021
       TB_RCBV051_I.INDNULL(13)      = -1;                              08150021
    END;                                                                08160021
    IF RCBBIB0_PR_I.WARRANTY_SPLT_DATE  ¬=''                            08170021
    THEN DO;                                                            08180021
       TB_RCBV051.WARRANTY_SPLT_DATE =                                  08190021
                                    RCBBIB0_PR_I.WARRANTY_SPLT_DATE;    08200021
       TB_RCBV051_I.INDNULL(12) = 0;                                    08210021
    END;                                                                08220021
    ELSE DO;                                                            08230021
       TB_RCBV051_I.INDNULL(12) = -1;                                   08240021
    END;                                                                08250021
    IF RCBBIB0_PR_I.SERVICE_LVL_CODE_C ¬=''                             08260021
    THEN DO;                                                            08270021
       TB_RCBV051.SERVICE_LVL_CODE_C =                                  08280021
                                    RCBBIB0_PR_I.SERVICE_LVL_CODE_C;    08290021
       TB_RCBV051_I.INDNULL(19)      = 0;                               08300021
    END;                                                                08310021
    ELSE DO;                                                            08320021
       TB_RCBV051.SERVICE_LVL_CODE_C = '';                              08330021
       TB_RCBV051_I.INDNULL(19)      = -1;                              08340021
    END;                                                                08350021
 END;                                                                   08360021
                                                       /* EOC *RC01191*/08370021
 IF ((UPDATE_SPEC = MERGE_ONLY) |                                       08380021
     (UPDATE_SPEC = MERGE_ALL_MEMBERS))                                 08390021
 THEN DO;                                                               08400021
   IF RCBBIB0_PR_I.DEALER_NUMBER ¬=''                                   08410021
   THEN DO;                                                             08420021
     TB_RCBV051.DEALER_NUMBER       = RCBBIB0_PR_I.DEALER_NUMBER;       08430021
   END;                                                                 08440021
   IF SWITCH_PEW_SOURCE = TRUE THEN                    /* SOC RB01284 */08450021
     DO;                                                                08460021
       IF RCBBIB0_PR_I.SERVICE_DELIV_FLAG ¬= '' THEN                    08470021
          DO;                                         /* CEDS00000402 */08480021
            TB_RCBV051.SERVICE_DELIV_FLAG =                             08490021
                             RCBBIB0_PR_I.SERVICE_DELIV_FLAG;           08500021
            TB_RCBV051_I.INDNULL(10)      = 0;    /* SOC CEDS00000402 */08510021
          END;                                                          08520021
       ELSE DO;                                                         08530021
            TB_RCBV051.SERVICE_DELIV_FLAG = '';                         08540021
            TB_RCBV051_I.INDNULL(10)      = -1;                         08550021
       END;                                       /* EOC CEDS00000402 */08560021
     END;                                              /* EOC RB01284 */08570021
 END;                                                                   08580021
 IF ((UPDATE_SPEC = MERGE_ALL_EXCL) |                                   08590021
     (UPDATE_SPEC = MERGE_ALL_MEMBERS))                                 08600021
 THEN DO;                                                               08610021
   IF RCBBIB0_PR_I.MODEL_NUMBER ¬= ''                                   08620021
   THEN                                                                 08630021
      TB_RCBV051.MODEL_NUMBER       = RCBBIB0_PR_I.MODEL_NUMBER;        08640021
   IF RCBBIB0_PR_I.INSTALL_DATE ¬= ''                                   08650021
   THEN                                                                 08660021
     TB_RCBV051.INSTALL_DATE        = RCBBIB0_PR_I.INSTALL_DATE;        08670021
   IF RCBBIB0_PR_I.TYPE_OF_MAINT ¬= ''                                  08680021
   THEN                                                                 08690021
      TB_RCBV051.TYPE_OF_MAINT      = RCBBIB0_PR_I.TYPE_OF_MAINT;       08700021
   IF RCBBIB0_PR_I.CUSTOMER_NUMBER ¬=''                                 08710021
   THEN                                                                 08720021
     TB_RCBV051.CUSTOMER_NUMBER     = RCBBIB0_PR_I.CUSTOMER_NUMBER;     08730021
   IF RCBBIB0_PR_I.CUSTOMER_NR_EXTEND ¬=''                              08740021
   THEN                                                                 08750021
     TB_RCBV051.CUSTOMER_NR_EXTEND  = RCBBIB0_PR_I.CUSTOMER_NR_EXTEND;  08760021
   IF RCBBIB0_PR_I.OU_CODE ¬=''                                         08770021
   THEN                                                                 08780021
      TB_RCBV051.OU_CODE            = RCBBIB0_PR_I.OU_CODE;             08790021
   IF RCBBIB0_PR_I.SOURCE_INDICATOR ¬=''                                08800021
    & TB_RCBV051.SOURCE_INDICATOR   ¬= 'O'            /* CEDS00000473 */08810021
   THEN                                                                 08820021
      TB_RCBV051.SOURCE_INDICATOR   = RCBBIB0_PR_I.SOURCE_INDICATOR;    08830021
                                                     /* SOC   *RC01191*/08840021
   IF RCBBIB0_PR_I.SERVICE_DELIV_FLAG ¬=''                              08850021
   THEN                                                                 08860021
      TB_RCBV051.SERVICE_DELIV_FLAG = RCBBIB0_PR_I.SERVICE_DELIV_FLAG;  08870021
                                                     /* EOC   *RC01191*/08880021
   IF SWITCH_PEW_SOURCE = TRUE THEN                  /* SOC   RB01284 */08890021
     DO;                                                                08900021
       IF RCBBIB0_PR_I.DEALER_NUMBER ¬='' THEN                          08910021
          DO;                                         /* CEDS00000402 */08920021
            TB_RCBV051.DEALER_NUMBER    = RCBBIB0_PR_I.DEALER_NUMBER;   08930021
            TB_RCBV051_I.INDNULL(18)      = 0;    /* SOC CEDS00000402 */08940021
          END;                                                          08950021
       ELSE DO;                                                         08960021
            TB_RCBV051.DEALER_NUMBER      = '';                         08970021
            TB_RCBV051_I.INDNULL(18)      = -1;                         08980021
       END;                                       /* EOC CEDS00000402 */08990021
     END;                                            /* EOC   RB01284 */09000021
 END;                                                                   09010021
  IF RCBBIB0_PR_I.WARRANTY_LIABILITY ¬=''             /* SOC RB01283 */ 09020021
  THEN DO;                                                              09030021
     TB_RCBV051.WARRANTY_LIABILITY = RCBBIB0_PR_I.WARRANTY_LIABILITY;   09040021
     TB_RCBV051_I.INDNULL(23)      = 0;                                 09050021
  END;                                                                  09060021
  ELSE DO;                                                              09070021
       IF TB_RCBV051.WARRANTY_LIABILITY ='' THEN                        09080021
       TB_RCBV051_I.INDNULL(23)      = -1;                              09090021
  END;                                               /* EOC RB01283 */  09100021
                                                                        09110021
                                                     /* SOC    PTM1132*/09120021
 IF RCBBIB0_PR_I.BUILT_TO_MODEL_NR ¬=''                                 09130021
 THEN                                                                   09140021
    TB_RCBV051.BUILT_TO_MODEL_NR  = RCBBIB0_PR_I.BUILT_TO_MODEL_NR;     09150021
                                                     /* EOC    PTM1132*/09160021
                                                                        09170021
 END RCBBIBM_MERGE;                                                     09180021
1/*********************************************************************/09190021
 /*                                                                   */09200021
 /* MODULE NAME      : INSERT                                         */09210021
 /*                                                                   */09220021
 /* DESCRIPTION      : INSERT ROW INTO RCBV051_CUSTOMER USING         */09230021
 /*                    RCBF82M                                        */09240021
 /*                                                                   */09250021
 /*********************************************************************/09260021
0RCBBIBM_INSERT: PROC;                                                  09270021
                                       /* SET INDICATORS              */09280021
 TB_RCBV051_I = 0;                                                      09290021
 TB_RCBV051_I.INDNULL(11) = WRK_INDNULL.SERVICE_LVL_CODE_1;  /*RC01191*/09300021
 TB_RCBV051_I.INDNULL(12) = WRK_INDNULL.WARRANTY_SPLT_DATE;  /*RC01191*/09310021
 TB_RCBV051_I.INDNULL(13) = WRK_INDNULL.SERVICE_LVL_CODE_2;  /*RC01191*/09320021
 TB_RCBV051_I.INDNULL(19) = WRK_INDNULL.SERVICE_LVL_CODE_C;  /*RA01229*/09330021
 TB_RCBV051_I.INDNULL(22) = WRK_INDNULL.F_TYPE_OF_WARRANTY;  /*RB01281*/09340021
 TB_RCBV051_I.INDNULL(23) = WRK_INDNULL.WARRANTY_LIABILITY;  /*RB01283*/09350021
                                       /* INSERT INTO TABLE           */09360021
 CALL RCBF82M (PTR_RCBV051,                                             09370021
               PTR_RCBV051I,                                            09380021
               PTR_RETURN_AREA,                                         09390021
               PTR_INT_AREA);                                           09400021
 SELECT (RETURN_AREA.RETURN_CODE);                                      09410021
 WHEN (0)                                                               09420021
   DO;                                                                  09430021
     CNTS.CNT_CTRY.INS_CNT = CNTS.CNT_CTRY.INS_CNT + 1;                 09440021
   END;                                                                 09450021
 WHEN (8)                              /* FOREIGN KEY MISSING         */09460021
   DO;                                                                  09470021
     SELECT (SUBSTR(RETURN_AREA.RETURN_FK,1,5));                        09480021
     WHEN ('FK070')                                                     09490021
       DO;                                                              09500021
         CALL RCBBIBM_INSERT_TB_RCBV070;                                09510021
       END;                                                             09520021
     OTHERWISE                                                          09530021
       DO;                                                              09540021
         CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),               09550021
                            'DB2','#002');                              09560021
       END;                                                             09570021
     END;                                                               09580021
   CALL RCBF82M (PTR_RCBV051,            /* RETRY INSERT * SOC*RC01191*/09590021
                 PTR_RCBV051I,                                          09600021
                 PTR_RETURN_AREA,                                       09610021
                 PTR_INT_AREA);                                         09620021
   SELECT (RETURN_AREA.RETURN_CODE);                                    09630021
     WHEN (0)                                                           09640021
       DO;                                                              09650021
         CNTS.CNT_CTRY.INS_CNT = CNTS.CNT_CTRY.INS_CNT + 1;             09660021
       END;                                                             09670021
     OTHERWISE                                                          09680021
       DO;                                                              09690021
         CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),               09700021
                            'DB2','#003');                              09710021
       END;                                                             09720021
     END;                                             /* EOC  *RC01191*/09730021
   END;                                                                 09740021
 OTHERWISE                                                              09750021
   DO;                                                                  09760021
     CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                   09770021
                        'DB2','#004');                                  09780021
   END;                                                                 09790021
 END;                                                                   09800021
                                                                        09810021
 END RCBBIBM_INSERT;                                                    09820021
1/*********************************************************************/09830021
 /*                                                                   */09840021
 /* MODULE NAME      : INSERT_TB_RCBV070                              */09850021
 /*                                                                   */09860021
 /* DESCRIPTION      : INSERT ROW FOR RCBV0070_HW_PO USING            */09870021
 /*                    RCBF07M AND RETRY PREVIOUS STEP                */09880021
 /*                                                                   */09890021
 /*********************************************************************/09900021
0RCBBIBM_INSERT_TB_RCBV070: PROC;                                       09910021
                                       /* FILL DUMMY RECORD           */09920021
 TB_RCBV070                  = '';                                      09930021
 TB_RCBV070_I.INDNULL (*)    = 0;                                       09940021
 TB_RCBV070.COUNTRY_NUMBER   = TB_RCBV051.COUNTRY_NUMBER;               09950021
 TB_RCBV070.PRODUCT_TYPE     = TB_RCBV051.PRODUCT_TYPE;                 09960021
 TB_RCBV070.MODEL_NUMBER     = TB_RCBV051.MODEL_NUMBER;                 09970021
 TB_RCBV070.PRODUCT_NAME     = 'CREATED BY PRIME INPUT';                09980021
 TB_RCBV070.VENDOR_NAME      = '';                                      09990021
 TB_RCBV070.RETAIN_FLAG      = '0';                                     10000021
 TB_RCBV070.HW_REQUEST_REOLS = '0';                                     10010021
 TB_RCBV070.HW_REQUEST_BMICS = '0';                                     10020021
 TB_RCBV070.HW_REQUEST_CEDS  = '1';                                     10030021
 TB_RCBV070.SOURCE_INDICATOR = 'O';                                     10040021
 TB_RCBV070.LAST_CHANGE_DATE = WRK_RUN_DATE;                            10050021
 TB_RCBV070.EFFECTIVE_DATE   = TB_RCBV051.INSTALL_DATE;                 10060021
 IF TB_RCBV070.EFFECTIVE_DATE  > WRK_RUN_DATE                           10070021
 THEN                                                                   10080021
   TB_RCBV070.EFFECTIVE_DATE   = WRK_RUN_DATE;        /* PTM 1380 */    10090021
 TB_RCBV070.END_DATE         = '9999-12-31';                            10100021
                                       /* INSERT IN TABLE             */10110021
 IF TB_RCBV070.MODEL_NUMBER ¬= ''                                       10120021
 THEN DO;                                                               10130021
   CALL RCBF07M (PTR_RCBV070,                                           10140021
                 PTR_RCBV070I,                                          10150021
                 PTR_RETURN_AREA,                                       10160021
                 PTR_INT_AREA);                                         10170021
   SELECT (RETURN_AREA.RETURN_CODE);                                    10180021
   WHEN (0,4);                                                          10190021
   OTHERWISE                                                            10200021
     DO;                                                                10210021
       CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                 10220021
                          'DB2','#005');                                10230021
     END;                                                               10240021
   END;                                                                 10250021
 END;                                                                   10260021
 TB_RCBV070.MODEL_NUMBER     = '';                                      10270021
 CALL RCBF07M (PTR_RCBV070,                                             10280021
               PTR_RCBV070I,                                            10290021
               PTR_RETURN_AREA,                                         10300021
               PTR_INT_AREA);                                           10310021
 SELECT (RETURN_AREA.RETURN_CODE);                                      10320021
   WHEN (0);                                                            10330021
   WHEN (4)                                            /* SOC PTM1117 */10340021
     DO;                               /* ROW ALREADY IN TABLE 70     */10350021
       CALL RCBI07M (PTR_RCBV070,      /* SELECT EXISTING ROW         */10360021
                     PTR_RCBV070I,                                      10370021
                     PTR_RETURN_AREA,                                   10380021
                     PTR_INT_AREA);                                     10390021
                                                                        10400021
       SELECT (RETURN_AREA.RETURN_CODE);                                10410021
         WHEN (0);                                                      10420021
         OTHERWISE                                                      10430021
           DO;                                                          10440021
             CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),           10450021
                                'DB2','#006');                          10460021
           END;                                                         10470021
         END;                                                           10480021
                                                                        10490021
       TB_RCBV070.HW_REQUEST_CEDS = '1';                                10500021
                                                                        10510021
       IF TB_RCBV051.INSTALL_DATE < TB_RCBV070.EFFECTIVE_DATE           10520021
       THEN                                                             10530021
         DO;                                                            10540021
           TB_RCBV070.EFFECTIVE_DATE = TB_RCBV051.INSTALL_DATE;         10550021
         END;                                                           10560021
                                                                        10570021
       TB_RCBV070.END_DATE = '9999-12-31';                              10580021
                                                                        10590021
       CALL RCBG07M (PTR_RCBV070,      /* UPDATE ROW                  */10600021
                     PTR_RCBV070I,                                      10610021
                     PTR_RETURN_AREA,                                   10620021
                     PTR_INT_AREA);                                     10630021
                                                                        10640021
       SELECT (RETURN_AREA.RETURN_CODE);                                10650021
         WHEN (0);                                                      10660021
         OTHERWISE                                                      10670021
           DO;                                                          10680021
             CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),           10690021
                                'DB2','#007');                          10700021
           END;                                                         10710021
         END;                                                           10720021
     END;                              /* ROW ALREADY IN TABLE 70     */10730021
                                                       /* EOC PTM1117 */10740021
   OTHERWISE                                                            10750021
     DO;                                                                10760021
       CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                 10770021
                          'DB2','#008');                                10780021
     END;                                                               10790021
   END;                                                                 10800021
                                                                        10810021
 END RCBBIBM_INSERT_TB_RCBV070;                                         10820021
1/*********************************************************************/10830021
 /*                                                                   */10840021
 /* MODULE NAME      : RETRIEVE                                       */10850021
 /*                                                                   */10860021
 /* DESCRIPTION      : FIND ROW IN RCBV051_CUSTOMER USING             */10870021
 /*                    RCBI82M                                        */10880021
 /*                                                                   */10890021
 /*********************************************************************/10900021
0RCBBIBM_RETRIEVE: PROC;                                                10910021
                                                                        10920021
 TB_RCBV051_I = 0;                                                      10930021
 TB_RCBV051 = RCBBIB0_PR_I, BY NAME;                                    10940021
                                       /* RETRIEVE CURRENT ROW        */10950021
 CALL RCBI82M (PTR_RCBV051,                                             10960021
               PTR_RCBV051I,                                            10970021
               PTR_RETURN_AREA,                                         10980021
               PTR_INT_AREA);                                           10990021
 SELECT (RETURN_AREA.RETURN_CODE);                                      11000021
 WHEN (0)                                                               11010021
   DO;                                                                  11020021
   FOUND = '1'B;                                                        11030021
   END;                                                                 11040021
 WHEN (4)                                                               11050021
   FOUND = '0'B;                                                        11060021
 OTHERWISE                                                              11070021
   DO;                                                                  11080021
     CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                   11090021
                        'DB2','#009');                                  11100021
   END;                                                                 11110021
 END;                                                                   11120021
                                                                        11130021
 END RCBBIBM_RETRIEVE;                                                  11140021
1/*********************************************************************/11150021
 /*                                                                   */11160021
 /* MODULE NAME      : UPDATE                                         */11170021
 /*                                                                   */11180021
 /* DESCRIPTION      : UPDATE ROW IN RCBV051_CUSTOMER USING           */11190021
 /*                    RCBF82M                                        */11200021
 /*                                                                   */11210021
 /*********************************************************************/11220021
0RCBBIBM_UPDATE: PROC;                                                  11230021
                                       /* UPDATE TABLE                */11240021
 CALL RCBG82M (PTR_RCBV051,                                             11250021
               PTR_RCBV051I,                                            11260021
               PTR_RETURN_AREA,                                         11270021
               PTR_INT_AREA);                                           11280021
 SELECT (RETURN_AREA.RETURN_CODE);                                      11290021
 WHEN (0);                                                              11300021
 WHEN (8)                              /* FOREIGN KEY MISSING         */11310021
   DO;                                                                  11320021
     SELECT (SUBSTR(RETURN_AREA.RETURN_FK,1,5));                        11330021
     WHEN ('FK070')                                                     11340021
       DO;                                                              11350021
         CALL RCBBIBM_INSERT_TB_RCBV070;                                11360021
       END;                                                             11370021
     OTHERWISE                                                          11380021
       DO;                                                              11390021
         CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),               11400021
                            'DB2','#010');                              11410021
       END;                                                             11420021
     END;                                                               11430021
     CALL RCBG82M (PTR_RCBV051,          /*  RETRY UPDATE *SOC*RC01191*/11440021
                   PTR_RCBV051I,                                        11450021
                   PTR_RETURN_AREA,                                     11460021
                   PTR_INT_AREA);                                       11470021
     SELECT (RETURN_AREA.RETURN_CODE);                                  11480021
     WHEN (0);                                                          11490021
     OTHERWISE                                                          11500021
       DO;                                                              11510021
         CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),               11520021
                            'DB2','#011');                              11530021
       END;                                                             11540021
     END;                                                               11550021
   END;                                                /*EOC  *RC01191*/11560021
 OTHERWISE                                                              11570021
   DO;                                                                  11580021
     CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                   11590021
                        'DB2','#012');                                  11600021
   END;                                                                 11610021
 END;                                                                   11620021
                                                                        11630021
 END RCBBIBM_UPDATE;                                                    11640021
1/*********************************************************************/11650021
 /*                                                                   */11660021
 /* MODULE NAME      : INIT_PROGRAM                                   */11670021
 /*                                                                   */11680021
 /* DESCRIPTION      : INITIALISE PROGRAM VARIABLES. OPEN FILES       */11690021
 /*                                                                   */11700021
 /*********************************************************************/11710021
0RCBBIBM_INIT_PROGRAM: PROC;                                            11720021
                                       /* INITIALISE POINTERS         */11730021
 PTR_INT_AREA       = ADDR(PARM_INT_AREA);                              11740021
 PTR_COUNTRY_AREA   = ADDR(COUNTRY_AREA);                               11750021
 PTR_RETURN_AREA    = ADDR(RETURN_AREA);                                11760021
 PTR_DATE_AREA      = ADDR(DATE_AREA);                                  11770021
 PTR_RUN_DATE_AREA  = ADDR(RUN_DATE_AREA);                              11780021
 PTR_RCBV070        = ADDR(TB_RCBV070);                                 11790021
 PTR_RCBV070I       = ADDR(TB_RCBV070_I);                               11800021
 PTR_RCBV051        = ADDR(TB_RCBV051);                                 11810021
 PTR_RCBV051I       = ADDR(TB_RCBV051_I);                               11820021
 PTR_RCBV040        = ADDR(TB_RCBV040);                                 11830021
 PTR_RCBV040I       = ADDR(TB_RCBV040_I);                               11840021
                                       /* INITIALISE INTERFACE        */11850021
                                       /* AREA AND OPEN MESSAGE FILE  */11860021
 PTR_RCBV500        = ADDR (TB_RCBV500);                  /* RB01284  */11870021
 PTR_RCBV500I       = ADDR (TB_RCBV500_I);                /* RB01284  */11880021
 PARM_INT_AREA.MSG_AREA       = '';                                     11890021
 PARM_INT_AREA.ERR_AREA       = ' ';                                    11900021
 PARM_INT_AREA.MSG_REQUEST    = 'O';                                    11910021
 PARM_INT_AREA.MSG_TARGET     = 'F';                                    11920021
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                  11930021
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PGM_NAME;                           11940021
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           11950021
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      11960021
 PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                        11970021
 PARM_INT_AREA.PTR_PCB_IO     = NULL;                                   11980021
 PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                   11990021
 PARM_INT_AREA.TXN_CODE       = '';                                     12000021
 PARM_INT_AREA.VERSION        = '';                                     12010021
 CALL RCB0M1M(PTR_INT_AREA);                                            12020021
 PARM_INT_AREA.MSG_REQUEST    = 'P';                                    12030021
                                       /* RETRIEVE SYSTEM DATE        */12040021
 CALL RCB0T1M(PTR_INT_AREA);                                            12050021
                                                                        12060021
 OPEN FILE(RCBBIB0);                                                    12070021
 OPEN FILE(RCBBIB1);                                                    12080021
                                                                        12090021
 CALL RCB019M (PTR_COUNTRY_AREA,       /* RETRIEVE ALL COUNTRIES      */12100021
               PTR_INT_AREA);          /* THEY COME SORTED            */12110021
 IF COUNTRY_AREA.COUNT_CTRY = 0                                         12120021
 THEN                                                                   12130021
   DO;                                                                  12140021
     PARM_INT_AREA.COUNTRY_NUMBER    = '';                              12150021
     PARM_INT_AREA.MSG_VAR_CODES     = '';                              12160021
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            12170021
     PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                          12180021
     CALL RCB0M1M (PTR_INT_AREA);                                       12190021
     CALL RCBBIBM_ERROR (NULL, 'OTHER', '#013');                        12200021
   END;                                                                 12210021
 SWITCH_END_COUNTRIES = FALSE;                                          12220021
 CNTS                 = '';                                             12230021
 CALL RCBBIBM_READ_RECORD;                                              12240021
 WRK_CTRY_FILE_PREV = RCBBIB0_PR_I.COUNTRY_NUMBER;                      12250021
                                                                        12260021
 END RCBBIBM_INIT_PROGRAM;                                              12270021
1/*********************************************************************/12280021
 /*                                                                   */12290021
 /* MODULE NAME      : INIT_COUNTRY                                   */12300021
 /*                                                                   */12310021
 /* DESCRIPTION      : INITIALISE FOR A NEW COUNTRY                   */12320021
 /*                                                                   */12330021
 /*********************************************************************/12340021
0RCBBIBM_INIT_COUNTRY: PROC;                                            12350021
                                                                        12360021
 IF (((RCBBIB0_PR_I.COUNTRY_NUMBER > WRK_CTRYNO) |                      12370021
      EOF_RCBBIB0) &                   /* INPUT FILE AHEAD            */12380021
     ¬SWITCH_END_COUNTRIES )           /* NOT END OF PARAMETER LIST   */12390021
 THEN DO;                                                               12400021
   NBR_ARRAY = NBR_ARRAY + 1;                                           12410021
   IF NBR_ARRAY > COUNTRY_AREA.COUNT_CTRY                               12420021
   THEN                                                                 12430021
      SWITCH_END_COUNTRIES = TRUE;                                      12440021
   ELSE                                                                 12450021
     DO;                                                                12460021
       WRK_CTRYNO =                                                     12470021
         COUNTRY_AREA.CTRY_ARRAY.CTRYNO(NBR_ARRAY);                     12480021
       PARM_INT_AREA.COUNTRY_NUMBER = WRK_CTRYNO;                       12490021
       WRK_PGR_RUN_TYPE =                                               12500021
         COUNTRY_AREA.CTRY_ARRAY.PGR_TYPE(NBR_ARRAY);                   12510021
     END;                                                               12520021
 END;                                                                   12530021
                                       /* MORE INPUT COUNTRIES IN     */12540021
                                       /* FILE THEN IN PARAMETER      */12550021
 IF (((RCBBIB0_PR_I.COUNTRY_NUMBER <WRK_CTRYNO) | SWITCH_END_COUNTRIES) 12560021
      & ¬EOF_RCBBIB0)                                                   12570021
 THEN DO;                                                               12580021
   SW_SKIP_CTRY = '1'B;                                                 12590021
                                /* GIVE MESSAGE ABOUT COUNTRY IGNORED */12600021
   PARM_INT_AREA.COUNTRY_NUMBER     = RCBBIB0_PR_I.COUNTRY_NUMBER;      12610021
   PARM_INT_AREA.MSG_VAR_CODES      = '';                               12620021
   PARM_INT_AREA.MESSAGE_TYPE       = 'IS';                             12630021
   PARM_INT_AREA.MESSAGE_NUMBER     = '0181';                           12640021
   PARM_INT_AREA.MSG_VAR_CODE_6     = 'CY';                             12650021
   PARM_INT_AREA.MSG_VAR_VALUE_6    = RCBBIB0_PR_I.COUNTRY_NUMBER;      12660021
   CALL RCB0M1M (PTR_INT_AREA);                                         12670021
 END;                                                                   12680021
 IF ¬SWITCH_END_COUNTRIES &            /* NEW COUNTRY FOUND DATE      */12690021
                                       /* RETRIEVE NOT POSTPONED      */12700021
    ((WRK_CTRYNO <= RCBBIB0_PR_I.COUNTRY_NUMBER )| EOF_RCBBIB0)         12710021
 THEN                                                                   12720021
                                       /* RETRIEVE RUN DATE           */12730021
       CALL RCBBIBM_RETRIEVE_RCB001;                                    12740021
                                                                        12750021
 SWITCH_PEW_SOURCE = FALSE;                            /* SOC RB01284 */12760021
                                                                        12770021
 RCB151                  = '';                                          12780021
 TB_RCBV500              = '';                                          12790021
 TB_RCBV500_I            = '';                                          12800021
 TB_RCB151.NUMBER        = 'RCB151';                                    12810021
 TB_RCB151.CTRYNO        = WRK_CTRYNO;                                  12820021
 CALL RCBI50M ('R',                                                     12830021
               PTR_RCBV500,                                             12840021
               PTR_RCBV500I,                                            12850021
               PTR_RETURN_AREA,                                         12860021
               PTR_INT_AREA);                                           12870021
 SELECT(RETURN_AREA.RETURN_CODE);                                       12880021
   WHEN(0)                                                              12890021
     DO;                                                                12900021
       RCB151  =  TB_RCB151;                                            12910021
       IF (RCB151.PEW_AUTH_SOURCE = 'L' |                               12920021
           RCB151.PEW_AUTH_SOURCE = 'Y' ) THEN                          12930021
         SWITCH_PEW_SOURCE        = TRUE;                               12940021
     END;                                                               12950021
   WHEN(4)                                                              12960021
     DO;                                                                12970021
       TB_RCBV500              = '';                                    12980021
       TB_RCBV500_I            = '';                                    12990021
       TB_RCB151.NUMBER        = 'RCB151';                              13000021
       TB_RCB151.CTRYNO        = '***';                                 13010021
       CALL RCBI50M ('R',                                               13020021
                      PTR_RCBV500,                                      13030021
                      PTR_RCBV500I,                                     13040021
                      PTR_RETURN_AREA,                                  13050021
                      PTR_INT_AREA);                                    13060021
       SELECT(RETURN_AREA.RETURN_CODE);                                 13070021
          WHEN(0)                                                       13080021
            DO;                                                         13090021
               RCB151  =  TB_RCB151;                                    13100021
               IF (RCB151.PEW_AUTH_SOURCE = 'L' |                       13110021
                   RCB151.PEW_AUTH_SOURCE = 'Y') THEN                   13120021
                   SWITCH_PEW_SOURCE      = TRUE;                       13130021
            END;                                                        13140021
          WHEN(4)                                                       13150021
                SWITCH_PEW_SOURCE      = FALSE;                         13160021
          OTHERWISE                                                     13170021
            DO;                                                         13180021
              CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),          13190021
                                 'DB2','#236');                         13200021
            END;                                                        13210021
       END;                                                             13220021
     END;                                                               13230021
     OTHERWISE                                                          13240021
       DO;                                                              13250021
         CALL RCBBIBM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),               13260021
                            'DB2','#237');                              13270021
       END;                                                             13280021
 END;                                                  /* SOC RB01284 */13290021
                                                                        13300021
 END RCBBIBM_INIT_COUNTRY;                                              13310021
1/*********************************************************************/13320021
 /*                                                                   */13330021
 /* MODULE NAME      : RETRIEVE_RCB001                                */13340021
 /*                                                                   */13350021
 /* DESCRIPTION      : RETRIEVE RCB001                                */13360021
 /*                                                                   */13370021
 /* COMMENT          : ADDED AS PART OF IMPLEMENTATION OF PTM 416     */13380021
 /*                                                                   */13390021
 /*********************************************************************/13400021
 RCBBIBM_RETRIEVE_RCB001 : PROC;                                        13410021
                                       /* RETRIEVE RUN DATE           */13420021
 RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                       13430021
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 13440021
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_RUN_TYPE;                           13450021
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       13460021
               PTR_INT_AREA);                                           13470021
 IF RUN_DATE_AREA.RUN_DATE = ''        /* NO RUN DATE RCB001 FOUND    */13480021
 THEN                                                                   13490021
   DO;                                                                  13500021
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          13510021
   END;                                                                 13520021
 ELSE                                                                   13530021
   DO;                                                                  13540021
     WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                             13550021
   END;                                                                 13560021
 PARM_INT_AREA.RUN_DATE         = WRK_RUN_DATE;                         13570021
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           13580021
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   13590021
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 13600021
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               13610021
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 13620021
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         13630021
 CALL RCB0M1M(PTR_INT_AREA);                                            13640021
                                                                        13650021
 END RCBBIBM_RETRIEVE_RCB001;                                           13660021
1/*********************************************************************/13670021
 /*                                                                   */13680021
 /* MODULE NAME      : TERM_COUNTRY                                   */13690021
 /*                                                                   */13700021
 /* DESCRIPTION      : TERMINATE FOR THE CURRENT COUNTRY              */13710021
 /*                                                                   */13720021
 /*********************************************************************/13730021
0RCBBIBM_TERM_COUNTRY: PROC;                                            13740021
                                                                        13750021
 IF SW_SKIP_CTRY = '1'B                                                 13760021
 THEN DO;                                                               13770021
   SW_SKIP_CTRY = '0'B;                                                 13780021
                                       /*******************************/13790021
                                       /* ADAPT THE COUNTERS          */13800021
                                       /*******************************/13810021
   CNT_TOT.READ_CNT = CNT_TOT.READ_CNT +                                13820021
                           CNT_CTRY.READ_CNT;                           13830021
   CNT_TOT.WRT_CNT = CNT_TOT.WRT_CNT +                                  13840021
                           CNT_CTRY.WRT_CNT;                            13850021
   CNT_TOT.SKP_CNT = CNT_TOT.SKP_CNT +                                  13860021
                           CNT_CTRY.SKP_CNT;                            13870021
                              /****************************************/13880021
                              /* MESSAGES: READ + PROCESSED + SKIPPED */13890021
                              /*           REJECTED INSERTED          */13900021
                              /****************************************/13910021
   PARM_INT_AREA.MSG_VAR_CODES  = '';                                   13920021
   PARM_INT_AREA.MESSAGE_TYPE   = 'IS';                                 13930021
   PARM_INT_AREA.MESSAGE_NUMBER = '0003';                               13940021
                                       /* RCBBIB0 FILE                */13950021
   PARM_INT_AREA.COUNTRY_NUMBER           =                             13960021
                                     WRK_CTRY_FILE_PREV;                13970021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                         13980021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'FL';                       13990021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = 'RCBBIB0 INVENT';           14000021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'C1';                       14010021
   CNT_PIC9 = CNTS.CNT_CTRY.READ_CNT;                                   14020021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = CNT_PIC9;                   14030021
   PARM_INT_AREA.MSG_VAR_CODE_9           = 'C3';                       14040021
   CNT_PIC9 = CNTS.CNT_CTRY.READ_CNT -                                  14050021
              CNTS.CNT_CTRY.WRT_CNT;                                    14060021
   PARM_INT_AREA.MSG_VAR_VALUE_9          = CNT_PIC9;                   14070021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_10 = 'C4';                       14080021
   CNT_PIC9 = CNTS.CNT_CTRY.REJ_CNT;                                    14090021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_10= CNT_PIC9;                   14100021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_11 = 'C5';                       14110021
   CNT_PIC9 = CNTS.CNT_CTRY.SKP_CNT;                                    14120021
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_11= CNT_PIC9;                   14130021
   CALL RCB0M1M (PTR_INT_AREA);                                         14140021
 END;                                                                   14150021
 ELSE DO;                                                               14160021
                           /*******************************************/14170021
                           /* GIVE WARNING IF ALL COUNTS ZERO FOR     */14180021
                           /* A COUNTRY (MSG 184) --> COUNTRY MISSING */14190021
                           /*******************************************/14200021
   IF CNT_CTRY.READ_CNT = 0                                             14210021
   THEN DO;                                                             14220021
       PARM_INT_AREA.COUNTRY_NUMBER           = WRK_CTRYNO;             14230021
       PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                   14240021
       PARM_INT_AREA.MESSAGE_NUMBER           = '0184';                 14250021
       PARM_INT_AREA.MSG_VAR_CODES            = ' ';                    14260021
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'CY';                   14270021
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =  WRK_CTRYNO;            14280021
       CALL RCB0M1M (PTR_INT_AREA);                                     14290021
   END;                                                                 14300021
   ELSE DO;                                                             14310021
                                       /*******************************/14320021
                                       /* ADAPT THE COUNTERS          */14330021
                                       /*******************************/14340021
     CNT_TOT.READ_CNT = CNT_TOT.READ_CNT +                              14350021
                             CNT_CTRY.READ_CNT;                         14360021
     CNT_TOT.WRT_CNT = CNT_TOT.WRT_CNT +                                14370021
                             CNT_CTRY.WRT_CNT;                          14380021
     CNT_TOT.SKP_CNT = CNT_TOT.SKP_CNT +                                14390021
                             CNT_CTRY.SKP_CNT;                          14400021
     CNT_TOT.REJ_CNT = CNT_TOT.REJ_CNT +                                14410021
                             CNT_CTRY.REJ_CNT;                          14420021
     CNT_TOT.INS_CNT = CNT_TOT.INS_CNT +                                14430021
                             CNT_CTRY.INS_CNT;                          14440021
     CNT_TOT.UPD_CNT = CNT_TOT.UPD_CNT +                                14450021
                             CNT_CTRY.UPD_CNT;                          14460021
     CNT_TOT.DEL_CNT = CNT_TOT.DEL_CNT +                                14470021
                             CNT_CTRY.DEL_CNT;                          14480021
     CNT_TOT.SD_CNT = CNT_TOT.SD_CNT +                                  14490021
                             CNT_CTRY.SD_CNT;                           14500021
                              /****************************************/14510021
                              /* MESSAGES: READ + PROCESSED + SKIPPED */14520021
                              /*           REJECTED INSERTED          */14530021
                              /****************************************/14540021
     PARM_INT_AREA.MSG_VAR_CODES = '';                                  14550021
     PARM_INT_AREA.MESSAGE_TYPE = 'IS';                                 14560021
     PARM_INT_AREA.MESSAGE_NUMBER = '0003';                             14570021
                                                                        14580021
                                       /* RCBBIB0 FILE                */14590021
     PARM_INT_AREA.COUNTRY_NUMBER           = WRK_CTRYNO;               14600021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                       14610021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'FL';                     14620021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = 'RCBBIB0 INVENT';         14630021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'C1';                     14640021
     CNT_PIC9 = CNTS.CNT_CTRY.READ_CNT;                                 14650021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = CNT_PIC9;                 14660021
     PARM_INT_AREA.MSG_VAR_CODE_9           = 'C3';                     14670021
     CNT_PIC9 = CNTS.CNT_CTRY.READ_CNT -                                14680021
                CNTS.CNT_CTRY.WRT_CNT;                                  14690021
     PARM_INT_AREA.MSG_VAR_VALUE_9          = CNT_PIC9;                 14700021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_10 = 'C4';                     14710021
     CNT_PIC9 = CNTS.CNT_CTRY.REJ_CNT;                                  14720021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_10 = CNT_PIC9;                14730021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_11 = 'C5';                     14740021
     CNT_PIC9 = CNTS.CNT_CTRY.SKP_CNT;                                  14750021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_11 = CNT_PIC9;                14760021
     CALL RCB0M1M (PTR_INT_AREA);                                       14770021
                              /****************************************/14780021
                              /* MESSAGES: NUMBER OF RECORDS IN FILES */14790021
                              /****************************************/14800021
     PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                     14810021
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0004';                   14820021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                       14830021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'FL';                     14840021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = 'RCBBIB1';                14850021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'C6';                     14860021
     CNT_PIC9 = CNTS.CNT_CTRY.WRT_CNT ;                                 14870021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = CNT_PIC9;                 14880021
     CALL RCB0M1M (PTR_INT_AREA);                                       14890021
                                  /************************************/14900021
                                  /* MESSAGES: NUMBER OF ROWS CHANGED */14910021
                                  /************************************/14920021
     PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                     14930021
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0148';                   14940021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                       14950021
                                                       /* SOC PTM1215 */14960021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'IN';                     14970021
     CNT_PIC9 = CNTS.CNT_CTRY.INS_CNT;                                  14980021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = CNT_PIC9;                 14990021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'UP';                     15000021
     CNT_PIC9 = CNTS.CNT_CTRY.UPD_CNT;                                  15010021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = CNT_PIC9;                 15020021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8  = 'DL';                     15030021
     CNT_PIC9 = CNTS.CNT_CTRY.DEL_CNT;                                  15040021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8 = CNT_PIC9;                 15050021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9  = 'SD';                     15060021
     CNT_PIC9 = CNTS.CNT_CTRY.SD_CNT;                                   15070021
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9 = CNT_PIC9;                 15080021
     CALL RCB0M1M (PTR_INT_AREA);                                       15090021
                                                       /* EOC PTM1215 */15100021
   END;                                                                 15110021
 END;                                                                   15120021
                                       /* RE_INITIALISE CTRY COUNTERS */15130021
 CNTS.CNT_CTRY    = '';                                                 15140021
                                                                        15150021
 END RCBBIBM_TERM_COUNTRY;                                              15160021
1/*********************************************************************/15170021
 /*                                                                   */15180021
 /* MODULE NAME      : TERM_PROGRAM                                   */15190021
 /*                                                                   */15200021
 /* DESCRIPTION      : TERMINATE PROGRAM                              */15210021
 /*                                                                   */15220021
 /*********************************************************************/15230021
0RCBBIBM_TERM_PROGRAM: PROC;                                            15240021
                                                                        15250021
 PARM_INT_AREA.COUNTRY_NUMBER = '';                                     15260021
                              /****************************************/15270021
                              /* MESSAGES: READ + PROCESSED + SKIPPED */15280021
                              /* FOR THE DIFFERENT DATABASES          */15290021
                              /****************************************/15300021
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   15310021
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 15320021
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';                               15330021
                                       /* RBDGCM0 CUSTOMER            */15340021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       15350021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'FL';                     15360021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = 'RBDGCM0 CUSTOMER';       15370021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C1';                     15380021
 CNT_PIC9 = CNTS.CNT_TOT.READ_CNT;                                      15390021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = CNT_PIC9;                 15400021
 PARM_INT_AREA.MSG_VAR_CODE_9               = 'C3';                     15410021
 CNT_PIC9 = CNTS.CNT_TOT.READ_CNT -                                     15420021
            CNTS.CNT_TOT.WRT_CNT ;                                      15430021
 PARM_INT_AREA.MSG_VAR_VALUE_9              = CNT_PIC9;                 15440021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_10     = 'C4';                     15450021
 CNT_PIC9 = CNTS.CNT_TOT.REJ_CNT;                                       15460021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_10    = CNT_PIC9;                 15470021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_11     = 'C5';                     15480021
 CNT_PIC9 = CNTS.CNT_TOT.SKP_CNT;                                       15490021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_11    = CNT_PIC9;                 15500021
 CALL RCB0M1M (PTR_INT_AREA);                                           15510021
                              /****************************************/15520021
                              /* MESSAGES: NUMBER OF RECORDS IN FILES */15530021
                              /****************************************/15540021
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     15550021
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0004';                   15560021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       15570021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'FL';                     15580021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = 'RCBBIB1';                15590021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C6';                     15600021
 CNT_PIC9 = CNTS.CNT_TOT.WRT_CNT;                                       15610021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = CNT_PIC9;                 15620021
 CALL RCB0M1M (PTR_INT_AREA);                                           15630021
                                  /************************************/15640021
                                  /* MESSAGES: NUMBER OF ROWS CHANGED */15650021
                                  /************************************/15660021
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     15670021
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0148';                   15680021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       15690021
                                                       /* SOC PTM1215 */15700021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'IN';                     15710021
 CNT_PIC9 = CNTS.CNT_TOT.INS_CNT;                                       15720021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = CNT_PIC9;                 15730021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'UP';                     15740021
 CNT_PIC9 = CNTS.CNT_TOT.UPD_CNT;                                       15750021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = CNT_PIC9;                 15760021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8      = 'DL';                     15770021
 CNT_PIC9 = CNTS.CNT_TOT.DEL_CNT;                                       15780021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8     = CNT_PIC9;                 15790021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_9      = 'SD';                     15800021
 CNT_PIC9 = CNTS.CNT_TOT.SD_CNT;                                        15810021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_9     = CNT_PIC9;                 15820021
 CALL RCB0M1M (PTR_INT_AREA);                                           15830021
                                                       /* EOC PTM1215 */15840021
                                       /*******************************/15850021
                                       /* END THE PROGRAM             */15860021
                                       /*******************************/15870021
                                       /*******************************/15880021
                                       /* ISSUE END MESSAGE           */15890021
                                       /*******************************/15900021
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         15910021
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'IS';                        15920021
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '9999';                      15930021
 CALL RCB0M1M (PTR_INT_AREA);                                           15940021
                                       /*******************************/15950021
                                       /* CLOSE MESSAGE FILE          */15960021
                                       /*******************************/15970021
 PARM_INT_AREA.MSG_REQUEST    = 'C';                                    15980021
 CALL RCB0M1M(PTR_INT_AREA);                                            15990021
                                                                        16000021
 CLOSE FILE(RCBBIB0);                                                   16010021
 CLOSE FILE(RCBBIB1);                                                   16020021
                                                                        16030021
 END RCBBIBM_TERM_PROGRAM;                                              16040021
1/*********************************************************************/16050021
 /*                                                                   */16060021
 /* MODULE NAME      : RCBBIBM_DATE_CHECK                             */16070021
 /*                                                                   */16080021
 /* DESCRIPTION      : VERIFY IF DATE IS ISO                          */16090021
 /*                                                                   */16100021
 /*********************************************************************/16110021
0RCBBIBM_DATE_CHECK: PROC(DATE_IN);                                     16120021
                                                                        16130021
 DCL DATE_IN                 CHAR(10);                                  16140021
                                                                        16150021
 DATE_AREA                   = '';                                      16160021
 DATE_AREA.WD_IN_FORMAT      = 'ISO';                                   16170021
 DATE_AREA.WD_OUT_FORMAT     = 'ISO';                                   16180021
 DATE_AREA.WD_FUNCTION       = 'V';                                     16190021
 DATE_AREA.WD_IN_DATE        = DATE_IN;                                 16200021
 CALL RCB004M (PTR_DATE_AREA);                                          16210021
 IF DATE_AREA.WD_STATUS = ' '                                           16220021
 THEN;                                                                  16230021
 ELSE DO;                                                               16240021
   CALL RCBBIBM_ISSUE_INV_DATE ;                                        16250021
   REJECT = '1'B;                                                       16260021
 END;                                                                   16270021
 /* NEXT ROUTINE IS INTERNAL TO DATE_CHECK                            */16280021
0/*********************************************************************/16290021
 /*                                                                   */16300021
 /* MODULE NAME      : RCBBIBM_ISSUE_INV_DATE                         */16310021
 /*                                                                   */16320021
 /* DESCRIPTION      : ISSUE MESSAGE INVALID DATE USING               */16330021
 /*                    RCB0M1M                                        */16340021
 /*                                                                   */16350021
 /*********************************************************************/16360021
0RCBBIBM_ISSUE_INV_DATE: PROC;                                          16370021
                                                                        16380021
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  16390021
 PARM_INT_AREA.MESSAGE_NUMBER  = '0012';                                16400021
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    16410021
 PARM_INT_AREA.MSG_VAR_CODE_7  = 'DT';                                  16420021
 PARM_INT_AREA.MSG_VAR_VALUE_7 = DATE_IN;                               16430021
 CALL RCB0M1M (PTR_INT_AREA);                                           16440021
 END RCBBIBM_ISSUE_INV_DATE;                                            16450021
                                                                        16460021
 END RCBBIBM_DATE_CHECK;                                                16470021
1/*********************************************************************/16480021
 /*                                                                   */16490021
 /* MODULE NAME      : RCBBIBM_ERROR                                  */16500021
 /*                                                                   */16510021
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING   */16520021
 /*                    THE INPUT VARIABLES                            */16530021
 /*                                                                   */16540021
 /*********************************************************************/16550021
0RCBBIBM_ERROR: PROC     (PTR_ERROR,                                    16560021
                          ERR_TYPE,                                     16570021
                          CALL_ID);                                     16580021
 DCL PTR_ERROR    PTR;                                                  16590021
 DCL ERR_TYPE     CHAR(8);                                              16600021
 DCL CALL_ID      CHAR(4);                                              16610021
                                                                        16620021
 PARM_INT_AREA.PTR_ERROR      = PTR_ERROR;                              16630021
 PARM_INT_AREA.ERR_TYPE       = ERR_TYPE;                               16640021
 PARM_INT_AREA.CALL_ID        = CALL_ID;                                16650021
 CALL RCB0E1M (PTR_INT_AREA);                                           16660021
                                                                        16670021
 END RCBBIBM_ERROR;                                                     16680021
1/*********************************************************************/16690021
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                       */16700021
 /*********************************************************************/16710021
0%INCLUDE DAIFPLH ;                    /* COMPILE DATE/TIME STAMP     */16720021
 $DAIMOD (RCBBIBM);                    /* MODULE TO BE COMPILED       */16730021
0/*********************************************************************/16740021
 /* END OF ABR BLOCK                                                  */16750021
 /*********************************************************************/16760021
0END RCBBIBM;                                                           16770021