1/* RCBBA1U - USER EXIT - CRITICAL CUSTOMER DATA CODE                */ 00018000
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* MODULE NAME      : RCBBA1U                                       */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME     : RCBBA1U                                       */ 00060000
 /*                                                                  */ 00070000
 /* LANGUAGE         : PLISQL                                        */ 00080000
 /*                                                                  */ 00090000
 /* TYPE             : LINKABLE MODULE                               */ 00100000
 /*                                                                  */ 00110000
 /* DESCRIPTION      : USER EXIT FOR CUSTOMER INFORMATION            */ 00120000
 /*                    TO BE USED IN THE SOF CUSTOMER RECON          */ 00130000
 /*                                                                  */ 00140000
 /*                    VIA THIS EXIT THE FOLLOWING FIELD CAN BE      */ 00150000
 /*                    FILLED:                                       */ 00160000
 /*                                                                  */ 00170000
 /*                    - CRIT_CUST_DATA_CDE  (CRITICAL CUSTOMER DATA */ 00180000
 /*                                           CODE)                  */ 00190000
 /*                                                                  */ 00200000
 /* NOTE 1           : IF YOU WANT TO USE THIS EXIT BE SURE TO SET   */ 00210000
 /*                    SWITCH_USER_EXIT TO TRUE                      */ 00220000
 /*                                                                  */ 00230000
 /* INPUT            : - CUSTOMER RECORD                             */ 00240000
 /*                    - CUSTOMER MODIFIABLE INFO. RECORD            */ 00250000
 /*                    - DB2   : NONE                                */ 00260000
 /*                                                                  */ 00270000
 /* OUTPUT           : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00280000
 /*                  : - FILE : RCB0M10                              */ 00290000
 /*                                                                  */ 00300000
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00310000
 /*                                                                  */ 00320000
 /* MESSAGES         : ----                                          */ 00330000
 /*                                                                  */ 00340000
 /* DEPENDENCIES     : NONE                                          */ 00350000
 /*                                                                  */ 00360000
 /* FREQUENCY        : ----                                          */ 00370000
 /*                                                                  */ 00380000
 /*  MAINTENANCE LOG :                                               */ 00390000
 /*  ---------------                                                 */ 00400000
 /*                                                                  */ 00410000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00420000
 /*  --------------------------------------------------------------  */ 00430000
 /*  1992-07-03 | CED001       | CEDS QUICKFIX A4                    */ 00440000
 /*  1993-05-10 | RC1032       | MCO AND TABLE CHANGES               */ 00450000
 /*  1993-11-30 | CED0014      | CHANGE FETCH INTO CALL SEE PTM 374  */ 00460000
 /*  1997-04-11 | PTM1036      | CORRECTED PROLOG                    */ 00470000
 /*  1997-04-29 | PTM0892      | REMOVE DECLARES UNUSED EXT.ENTRIES  */ 00480000
 /*  2016-11-08 | PCEDSP-0686  | (L) LOAD CRIT CUST FLAG FOR GERMANY */ 00481000
 /*                                                                  */ 00490000
 /********************************************************************/ 00500000
1RCBBA1U: PROC    (PTR_SWITCH_USER_EXIT,                                00510000
                   PTR_RCBV0010,                                        00520000
                   PTR_RCBV0350,                                        00530000
                   PTR_INT_AREA)                                        00540000
          REORDER;                                                      00550000
0DEFAULT RANGE (*)        STATIC;                                       00560000
1/********************************************************************/ 00570000
 /*  PARAMETERS                                                      */ 00580000
 /********************************************************************/ 00590000
0DCL PTR_SWITCH_USER_EXIT     PTR;                                      00600000
0DCL PTR_RCBV0010             PTR;                                      00610000
0DCL PTR_RCBV0350             PTR;                                      00620000
0DCL PTR_INT_AREA             PTR;          /* INTERFACE AREA         */00630000
1/********************************************************************/ 00640000
 /*  EXTERNAL ENTRIES                                                */ 00650000
 /********************************************************************/ 00660000
0DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 00670000
1/********************************************************************/ 00670100
 /*  FILE DECLARATIONS                                               */ 00670200
 /********************************************************************/ 00670300
                                                   /* SOC PCEDSP-0686*/ 00670400
 DCL ROLCCDT        FILE         /* INTERMEDIATE (SORTIN) FILE      */  00670500
                    RECORD                                              00670600
                    INPUT                                               00670700
                    SEQUENTIAL                                          00670800
                    ENV (FB RECSIZE(12));                               00671100
                                                   /* EOC PCEDSP-0686*/ 00671700
 /********************************************************************/ 00671800
 /*  RECORD STRUCTURES                                               */ 00671900
 /********************************************************************/ 00672000
                                                   /* SOC PCEDSP-0686*/ 00672100
 DCL 1 FILE_ROLCCDT,                                                    00672300
       3 COUNTRY_NUM      CHAR(03),        /*WTAAS COUNTRY NUMBER    */ 00672400
       3 CUSTOMER_NUM     CHAR(08),        /*CUSTOMER NUMBER         */ 00672500
       3 SPACE_CTRY_USE   CHAR(01);        /*SPACE COUNTRY USE       */ 00672600
                                                   /* EOC PCEDSP-0686*/ 00674000
0/********************************************************************/ 00680000
 /* ON ERROR CONDITIONS                                              */ 00690000
 /********************************************************************/ 00700000
0%INCLUDE (RCB0E0M);                                                    00710000
  END;                                                                  00720000
                                                   /* SOC PCEDSP-0686*/ 00720100
  ON ENDFILE(ROLCCDT)                                                   00721000
  BEGIN;                                                                00721100
     EOF_ROLCCDT = TRUE ;                                               00721200
  END;                                                                  00721300
                                                   /* EOC PCEDSP-0686*/ 00722000
 /********************************************************************/ 00730000
 /*                                                                  */ 00740000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 00750000
 /* AND CALL THE ERROR ROUTINE:                                      */ 00760000
 /*                                                                  */ 00770000
 /*                                                                  */ 00780000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 00790000
 /*                                                                  */ 00800000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 00810000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 00820000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 00830000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 00840000
 /*                                                                  */ 00850000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 00860000
 /*                                                                  */ 00870000
 /********************************************************************/ 00880000
0/********************************************************************/ 00890000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 00900000
 /********************************************************************/ 00910000
0DCL SWITCH_USER_EXIT BIT (1) BASED (PTR_SWITCH_USER_EXIT);             00920000
0DCL 1 PARM_RCBV0010          BASED (PTR_RCBV0010),  /* CUSTOMER     */ 00930000
       %INCLUDE (RCBBAAS1);,                                            00940000
       3 TB_RCBV010,                                                    00950000
         %INCLUDE (RCB010S);,                                           00960000
       3 TB_RCBV010_IND,                                                00970000
         %INCLUDE (RCB010SI);;                                          00980000
0DCL 1 PARM_RCBV0350          BASED (PTR_RCBV0350),  /* CUSTOMER MOD.*/ 00990000
       %INCLUDE (RCBBAAS1);,                                            01000000
       3 TB_RCBV350,                                                    01010000
         %INCLUDE (RCB350S);,                                           01020000
       3 TB_RCBV350_IND,                                                01030000
         %INCLUDE (RCB350SI);;                                          01040000
0DCL 1 PARM_INT_AREA          BASED (PTR_INT_AREA),                     01050000
      %INCLUDE (RCBZ01S);;                                              01060000
                                                                        01060100
1/********************************************************************/ 01070000
 /* DB2 TABLE STRUCTURES                                             */ 01080000
 /********************************************************************/ 01090000
1/********************************************************************/ 01100000
 /*  BIT SWITCHES                                                    */ 01110000
 /********************************************************************/ 01120000
0DCL TRUE           BIT (1) INIT ('1'B);                                01130000
 DCL FALSE          BIT (1) INIT ('0'B);                                01140000
                                                   /* SOC PCEDSP-0686*/ 01140100
 DCL EOF_ROLCCDT    BIT (1) INIT ('0'B);                                01141000
                                                   /* EOC PCEDSP-0686*/ 01142000
0/********************************************************************/ 01150000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01160000
 /********************************************************************/ 01170000
0DCL 1 WORK_FIELDS,                                                     01180000
       3 WRK_LEVEL      FIXED BIN (15),                                 01190000
       3 WRK_INDNULL    FIXED BIN (15);                                 01200000
1/********************************************************************/ 01210000
 /*  BUILTIN FUNCTIONS                                               */ 01220000
 /********************************************************************/ 01230000
0DCL (ADDR,                                                             01240000
      NULL)   BUILTIN;                                                  01250000
1/********************************************************************/ 01260000
 /* DB2/SQL SQLCA                                                    */ 01270000
 /********************************************************************/ 01280000
0 EXEC SQL                                                              01290000
    INCLUDE SQLCA                                                       01300000
    ;                                                                   01310000
1/********************************************************************/ 01320000
 /*                 S T A R T   P R O C E S S I N G                  */ 01330000
 /********************************************************************/ 01340000
0                                        /* SET LEVEL AND MOD NAME   */ 01350000
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            01360000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     01370000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBBA1U';                     01380000
0                                        /* USER DEFINED PROCESS     */ 01390000
 SWITCH_USER_EXIT = TRUE;                                               01400000
                                         /* END USER DEFINED PROCESS */ 01410000
0                                        /* RESET LEVEL              */ 01420000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            01430000
 /********************************************************************* 01430272
 *SOC PCEDSP-0686                                                     * 01430372
 *BELOW CRIT CUST FLAG LOGIC IS ONLY APPLIED WHEN "ROLCCDT" FILE IS   * 01430472
 *DEFINED IN JOB.                                                     * 01430572
 *********************************************************************/ 01430672
 EOF_ROLCCDT = FALSE;                                                   01430700
 OPEN FILE(ROLCCDT);                                                    01430800
 READ FILE(ROLCCDT) INTO(FILE_ROLCCDT);                                 01430900
 DO WHILE (¬EOF_ROLCCDT) ;                                              01431000
    IF ((FILE_ROLCCDT.CUSTOMER_NUM =                                    01431400
             PARM_RCBV0010.TB_RCBV010.CUSTOMER_NUMBER) &                01431500
       (FILE_ROLCCDT.SPACE_CTRY_USE = 'M' |                             01431600
        FILE_ROLCCDT.SPACE_CTRY_USE = 'S')) THEN                        01431700
        DO;                                                             01432000
          PARM_RCBV0010.TB_RCBV010.CRIT_CUST_DATA_CDE = 'Y';            01433000
           PUT SKIP LIST('UPDATED CUST_DATA_CDE: ',                     01433100
                                FILE_ROLCCDT.CUSTOMER_NUM);             01433200
          EOF_ROLCCDT = TRUE;                                           01433600
        END;                                                            01435000
    ELSE                                                                01436000
        DO;                                                             01436100
          PARM_RCBV0010.TB_RCBV010.CRIT_CUST_DATA_CDE = ' ';            01437000
        END;                                                            01439000
    READ FILE(ROLCCDT) INTO(FILE_ROLCCDT);                              01439200
 END;                                                                   01439500
 CLOSE FILE(ROLCCDT);                                                   01439700
 /********************************************************************* 01439872
 *EOC PCEDSP-0686                                                     * 01439972
 *********************************************************************/ 01440272
                                                                        01440372
1/*******************************************************************/  01441000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  01450000
 /*******************************************************************/  01460000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  01470000
 $DAIMOD (RCBBA1U);                      /* MODULE TO BE COMPILED   */  01480000
0/*******************************************************************/  01490000
 /* END OF ABR BLOCK                                                */  01500000
 /*******************************************************************/  01510000
0END RCBBA1U;                                                           01520000