 /* RCBC29P - ATO TRANSLATION DISPLAY DETAILS                        */ 00019927
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* TRANSACTION CODE    : RC29                                       */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME        : RCBC29M                                    */ 00060000
 /*                                                                  */ 00070000
 /* TYPE                : CICS/VS                                    */ 00080000
 /*                                                                  */ 00090000
 /* USED MAPSET         : RCBM29                                     */ 00100000
 /*      MAP            : RCBM29                                     */ 00110000
 /*                                                                  */ 00120000
 /* DESCRIPTION         : AGREEMENT TRANSLATION DISPLAY DETAILS      */ 00130000
 /*                                                                  */ 00140000
 /* LINKED TRANSACTION  : RC29                                       */ 00150000
 /*                                                                  */ 00160000
 /* MESSAGES            :                                            */ 00170000
 /*                                                                  */ 00180000
 /*                                                                  */ 00190000
 /*  MAINTENANCE LOG :                                               */ 00200000
 /*  ---------------                                                 */ 00210000
 /*                                                                  */ 00220000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00230000
 /*  --------------------------------------------------------------  */ 00240000
 /*  2003/12/08 | RB01245      | TACTICAL SERVICE REFERENCE          */ 00250000
 /*  2008/07/31 | CEDS00000432 | Corrected the Country Change        */ 00251022
 /*             |              | functionality                       */ 00252022
 /*                                                                  */ 00260000
 /********************************************************************/ 00270000
1RCBC29M: PROC(COMMPTR)                                                 00280000
          OPTIONS (MAIN)                                                00290000
          REORDER;                                                      00300000
0/********************************************************************/ 00310000
 /*                                                                  */ 00320000
 /********************************************************************/ 00330000
                                                                        00340000
 /*0DCL PLIXOPT   VAR  CHAR (256)                                       00350003
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;         */ 00360003
                                                                        00370000
0/********************************************************************/ 00380000
 /*  BMS RELATED CONSTANTS                                           */ 00390000
 /********************************************************************/ 00400000
 %INCLUDE DFHBMSCA;                                                     00410000
0/********************************************************************/ 00420000
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00430000
 /********************************************************************/ 00440000
 %INCLUDE DFHAID;                                                       00450000
1/********************************************************************/ 00460000
 /*  COMMUNICATION AREA                                              */ 00470000
 /********************************************************************/ 00480000
     %INCLUDE (RCBCP2S);                                                00490000
     %INCLUDE (RCBCHDS);,                                               00500000
     %INCLUDE (RCBC00S);,                                               00510000
     %INCLUDE (RCBC29S);;                                               00520000
0/********************************************************************/ 00530000
 /*  MAP STRUCTURES                                                  */ 00540000
 /********************************************************************/ 00550000
 %INCLUDE (RCBM29);                                                     00560000
0/********************************************************************/ 00570000
 /*  DB2 STRUCTURES                                                  */ 00580000
 /********************************************************************/ 00590000
 DCL 1 RCB610S,                                                         00600000
     %INCLUDE (RCB610S);;                                               00610000
 DCL 1 RCB610SI,                                                        00620000
     %INCLUDE (RCB610SI);;                                              00630000
 DCL 1 RCB560S,                                                         00640000
     %INCLUDE (RCB560S);;                                               00650000
 DCL 1 RCB560SI,                                                        00660000
     %INCLUDE (RCB560SI);;                                              00670000
0/********************************************************************/ 00680000
 /*  NULL INDICATORS                                                 */ 00690000
 /********************************************************************/ 00700000
 DCL 1 NULL610      BASED(ADDR(RCB610SI)),                              00710000
       3 NUL610A    FIXED BIN(15) INIT(0),                              00720000
       3 NUL610B    FIXED BIN(15) INIT(0),                              00730000
       3 NUL610C    FIXED BIN(15) INIT(0),                              00740000
       3 NUL610D    FIXED BIN(15) INIT(0),                              00750000
       3 NUL610E    FIXED BIN(15) INIT(0),                              00760000
       3 NUL610F    FIXED BIN(15) INIT(0);                              00770000
                                                                        00780000
0/********************************************************************/ 00790000
 /*  RETURN CODES                                                    */ 00800000
 /********************************************************************/ 00810000
 DCL RESPONSE     FIXED BINARY(31) INIT(0);  /*RETURN CODE        */    00820000
 DCL CODE_EXPLAIN FIXED BINARY(31) INIT(0);  /*RETURN CODE EXPLAIN*/    00830000
-/********************************************************************/ 00840000
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 00850000
 /********************************************************************/ 00860000
  EXEC SQL  WHENEVER NOT FOUND   CONTINUE   ;/*                      */ 00870000
  EXEC SQL  WHENEVER SQLWARNING  CONTINUE   ;/*                      */ 00880000
  EXEC SQL  WHENEVER SQLERROR    CONTINUE   ;/*                      */ 00890000
0/********************************************************************/ 00900000
 /*  WORKING DECLARATIONS                                            */ 00910000
 /********************************************************************/ 00920000
 DCL SCREEN_ERROR             BIT(1) INIT('0'B);                        00930000
 DCL PF5_FLAG                 BIT(1) INIT('0'B);                        00940000
 DCL ACT_SEL                  BIT(1) INIT('0'B);                        00950000
 DCL MAP_OK_FLAG              BIT(1) INIT('0'B);                        00960000
 DCL T470_FLAG                BIT(1) INIT('0'B);                        00970000
 DCL T610_UPD_FLAG            BIT(1) INIT('0'B);                        00980000
 DCL WRK_REC_COUNT            FIXED BIN(15) INIT(0);                    00990000
 DCL WRK_PIC                  PIC 'ZZ9' INIT(0);                        01000000
 DCL WRK_FD                   FIXED DEC(3,0) INIT(0);                   01010000
 DCL PIC_CNT                  PIC 'ZZZZ9' INIT(0);                      01020000
 DCL WRK_SLC                  CHAR(3) INIT('');                         01030000
 DCL SALINE                   CHAR(52)                                  01040000
         INIT('Set Act to A(dd) D(elete) C(hange) and make changes.');  01050000
 DCL PFLINE1                  CHAR(64) INIT                             01060000
   ('F1=Help F2=Clear F3=Return F7=Bkwd F8=Fwd F9=Top/Bot');            01070000
 DCL PFLINE1A                 CHAR(64) INIT                             01080000
   ('F1=Help F2=Clear F3=Return F5=Execute F7=Bkwd F8=Fwd F9=Top/Bot'); 01090000
 DCL ALPHANUM                 CHAR(37) INIT                             01100000
   ('ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890 ');                           01110000
 DCL TOMLIST                  CHAR(23) INIT ('ABCDEFGLNPUVZ1234567890');01120000
 DCL NUMERIC                  CHAR(11) INIT ('1234567890 ');            01130000
 DCL COMMAREA_STRING          CHAR(5984) INIT('');                      01140000
 DCL WRKMAP_DATA              CHAR(500) INIT('');                       01150000
 DCL 1 WRKMAP                 BASED(ADDR(WRKMAP_DATA)),                 01160000
     %INCLUDE RCBB56J;;                                                 01170000
 /********************************************************************/ 01180000
 /*  MESSAGES                                                        */ 01190000
 /********************************************************************/ 01200000
 DCL ERR_MESSAGE2 CHAR(30) INIT('ERROR IN SENDING MAP ');               01210000
 DCL ERR_MESSAGE3 CHAR(30) INIT('ERROR IN RECEIVING MAP ');             01220000
 DCL ERR_MESSAGE14 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       01230000
 DCL ERR_MESSAGE30 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       01240000
 DCL ERR_O004 CHAR(30) INIT('Invalid use of Function Key');             01250000
 DCL ERR_O022 CHAR(19) INIT('Press F5 to execute');                     01260000
 DCL ERR_O030 CHAR(24) INIT('Already on first page');                   01270000
 DCL ERR_O031 CHAR(23) INIT('Already on last page');                    01280000
 DCL ERR_O032 CHAR(17) INIT('No item selected');                        01290000
 DCL ERR_O053 CHAR(18) INIT('Nothing is updated');                      01300000
 DCL ERR_O057 CHAR(70) INIT                                             01310000
 ('You are not authorized to use the function for this Country number');01320000
 DCL ERR_O072 CHAR(25) INIT('Country number is invalid');               01330000
 DCL ERR_O079 CHAR(70) INIT                                             01340000
 ('Not allowed to maintain ATO translation,no activity report created');01350000
 DCL ERR_O098 CHAR(25) INIT('Invalid command entered');                 01360000
 DCL ERR_O101 CHAR(33) INIT('Field must be filled in correctly');       01370000
 DCL ERR_O120 CHAR(65) INIT                                             01380000
  ('Row for update not found. Choose action = A or fill in new values');01390000
 DCL ERR_O121 CHAR(65) INIT                                             01400000
  ('Row for delete not found. Choose action = A or fill in new values');01410000
 DCL ERR_O122 CHAR(41) INIT                                             01420000
  ('Delete successful. Enter new data or EXIT');                        01430000
 DCL ERR_O123 CHAR(41) INIT                                             01440000
  ('Insert successful. Enter new data or EXIT');                        01450000
 DCL ERR_O124 CHAR(41) INIT                                             01460000
  ('Update successful. Enter new data or EXIT');                        01470000
 DCL ERR_O127 CHAR(48) INIT                                             01480000
  ('Invalid action. Choose one of the valid options');                  01490000
 DCL ERR_O142 CHAR(40) INIT('Service_Level_Code does not exist');       01500000
0/********************************************************************/ 01510000
 /*  TS AREA                                                         */ 01520000
 /********************************************************************/ 01530000
 DCL 1 TS_REC,                                                          01540000
       3 TYPE       CHAR(3) INIT(''),                                   01550000
       3 OPTION     CHAR(1) INIT(''),                                   01560000
       3 TOM        CHAR(1) INIT(''),                                   01570000
       3 ST         CHAR(1) INIT(''),                                   01580000
       3 SLC        CHAR(3) INIT('');                                   01590000
0/********************************************************************/ 01600000
 /*                 BUILD IN FUNCTIONS                               */ 01610000
 /********************************************************************/ 01620000
0DCL (LENGTH,                                                           01630000
      STRING,                                                           01640000
      SUBSTR,                                                           01650000
      VERIFY,                                                           01660000
      DECIMAL,                                                          01670000
      DATETIME,                                                         01680000
      CHAR,                                                             01690000
      NULL,                                                             01700000
      CSTG,                                                             01710000
      STG,                                                              01720000
      ADDR)   BUILTIN;                                                  01730000
-/********************************************************************/ 01740000
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 01750000
 /********************************************************************/ 01760000
  EXEC SQL  INCLUDE  SQLCA;                                             01770000
-/********************************************************************/ 01780000
 /****   DECLARATIONS OF DB2 CURSORS                              ****/ 01790000
 /********************************************************************/ 01800000
  EXEC SQL  DECLARE C_610 CURSOR FOR                                    01810000
            SELECT AGREEMENT_TYPE                                       01820000
                  ,AGREEMENT_OPTION                                     01830000
                  ,TYPE_OF_MAINT                                        01840000
                  ,SERVICE_TYPE                                         01850000
                  ,SERVICE_LVL_CODE                                     01860000
            FROM RCBV0610_TRANS_ATO                                     01870000
            WHERE COUNTRY_NUMBER       = :WRK_COUNTRY_NUMBER            01880000
              AND ((AGREEMENT_TYPE     = :RCBM29I.TYPE_SELI             01890000
               OR  :TYPE_ENT           = 'N')                           01900000
              AND  (AGREEMENT_OPTION   = :RCBM29I.OPTION_SELI           01910000
               OR  :OPTION_ENT         = 'N')                           01920000
              AND  (TYPE_OF_MAINT      = :RCBM29I.TOM_SELI              01930000
               OR  :TOM_ENT            = 'N')                           01940000
              AND  (SERVICE_TYPE       = :RCBM29I.ST_SELI               01950000
               OR  :ST_ENT             = 'N')                           01960000
              AND  (SERVICE_LVL_CODE   = :RCBM29I.SLC_SELI              01970000
               OR  :SLC_ENT            = 'N'))                          01980000
            ORDER BY AGREEMENT_TYPE,AGREEMENT_OPTION                    01990000
            FOR FETCH ONLY                                              02000000
            WITH UR;                                                    02010000
                                                                        02020000
1/********************************************************************/ 02030000
 /*                   M A I N   P R O C E S S I N G                  */ 02040000
 /*                                                                  */ 02050000
 /********************************************************************/ 02060000
0RCBM29O.MSG_LINEO = '';                                                02070000
                                                                        02080000
 IF EIBCALEN = 0 THEN                                                   02090000
 DO;                                                                    02100000
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   02110000
 END;                                                                   02120000
                                                                        02130000
 IF HEADER.NEXT = '99' THEN                                             02140000
 DO;                                                                    02150000
   HEADER.NEXT = '00';                                                  02160000
   CALL RCBC29M_CLEAR_WORK;                                             02170000
   CALL RCBC29M_CLEAR_MAP;                                              02180000
   TMP_COUNTRY_NUMBER = WRK_COUNTRY_NUMBER;                             02190000
   CALL RCBC29M_SEND_MAP;                                               02200000
 END;                                                                   02210000
                                                                        02220000
 IF HEADER.NEXT = 'H1' THEN                                             02230000
 DO;                                                                    02240000
   HEADER.NEXT = '00';                                                  02250000
   CALL RCBC29M_CLEAR_MAP;                                              02260000
   IF TYPE_SEL ¬= '**' THEN                                             02270000
   DO;                                                                  02280000
     CALL RCBC29M_GET_ATO;                                              02290000
     CALL RCBC29M_FILL_MAP;                                             02300000
   END;                                                                 02310000
   CALL RCBC29M_GET_CSR_POS;                                            02320000
   CALL RCBC29M_RESTORE_MAP;                                            02330000
   CALL RCBC29M_SEND_MAP_CSR;                                           02340000
 END;                                                                   02350000
                                                                        02360000
 SELECT (EIBAID);                                                       02370000
   WHEN (DFHPF1,DFHPF13)                                                02380000
   DO;                                                                  02390000
     CALL RCBC29M_RECEIVE_MAP;                                          02400000
     CALL RCBC29M_SAVE_MAP;                                             02410000
     CALL RCBC29M_HELP_MAP;                                             02420000
   END;                                                                 02430000
                                                                        02440000
   WHEN (DFHPF2,DFHPF14)                                                02450000
   DO;                                                                  02460000
     CALL RCBC29M_CLEAR_WORK;                                           02470000
     CALL RCBC29M_CLEAR_MAP;                                            02480000
     CALL RCBC29M_SEND_MAP;                                             02490000
   END;                                                                 02500000
                                                                        02510000
   WHEN (DFHPF3,DFHPF15)                                                02520000
   DO;                                                                  02530000
     HEADER.NEXT = 'H1';                                                02540000
     CALL RCBC29M_CLEAR_WORK;                                           02550000
     CALL RCBC29M_CLEAR_MAP;                                            02560000
     TS_Q = 'RC00' || EIBTRMID;                                         02570000
     EXEC CICS IGNORE CONDITION QIDERR;                                 02580000
     EXEC CICS DELETEQ TS QUEUE(TS_Q);                                  02590000
     EXEC CICS HANDLE CONDITION QIDERR;                                 02600000
                                                                        02610000
     EXEC CICS XCTL                                                     02620000
         PROGRAM('RCBC20P')                                             02630000
         COMMAREA(COMMAREA)                                             02640000
         LENGTH(CSTG(COMMAREA))                                         02650000
         RESP(RESPONSE)                                                 02660000
         RESP2(CODE_EXPLAIN);                                           02670000
   END;                                                                 02680000
                                                                        02690000
   WHEN (DFHPF5,DFHPF17)                                                02700000
   DO;                                                                  02710000
     IF ADMIN_FLAG  = FALSE                                             02720000
      & UPD_OK_FLAG = FALSE THEN                                        02730000
     DO;                                                                02740000
       RCBM29O.MSG_LINEO = ERR_O004;                                    02750000
       RCBM29I.TYPE_SELL = -1;                                          02760000
       CALL RCBC29M_SEND_MAP_CSR;                                       02770000
     END;                                                               02780000
                                                                        02790000
     CALL RCBC29M_RECEIVE_MAP;                                          02800000
                                                    /*SOC CEDS00000432*/02801022
     IF (RCBM29I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER                  02802022
       | RCBM29I.TYPE_SELI       ¬= TYPE_SEL                            02803022
       | RCBM29I.OPTION_SELI     ¬= OPTION_SEL                          02804022
       | RCBM29I.TOM_SELI        ¬= TOM_SEL                             02805022
       | RCBM29I.ST_SELI         ¬= ST_SEL                              02806022
       | RCBM29I.SLC_SELI        ¬= SLC_SEL) THEN                       02807022
                                                                        02808022
       CALL RCBC29M_VALIDATE_MAP;                   /*EOC CEDS00000432*/02809022
                                                                        02809122
     PF5_FLAG = TRUE;                                                   02810000
     CALL RCBC29M_CHECK_MAP;                                            02820000
                                                                        02830000
     CALL RCBC29M_CLEAR_MAP;                                            02840000
     CALL RCBC29M_GET_ATO;                                              02850000
     CALL RCBC29M_FILL_MAP;                                             02860000
                                                                        02870000
     IF T610_UPD_FLAG = TRUE THEN                                       02880000
     DO;                                                                02890000
       RCBM29O.MSG_LINEO  = 'Updates have been done';                   02900000
       T610_UPD_FLAG = FALSE;                                           02910000
     END;                                                               02920000
     CALL RCBC29M_SEND_MAP;                                             02930000
   END;                                                                 02940000
                                                                        02950000
   WHEN (DFHPF7,DFHPF19)                                                02960000
   DO;                                                                  02970000
     IF TS_CNT = 0 THEN                                                 02980000
     DO;                                                                02990000
       CALL RCBC29M_CLEAR_MAP;                                          03000000
       CALL RCBC29M_SEND_MAP;                                           03010000
     END;                                                               03020000
                                                                        03030000
     IF L - 16 < 0 THEN                                                 03040000
     DO;                                                                03050000
       J = 0;                                                           03060000
       RCBM29O.MSG_LINEO = ERR_O030;                                    03070000
       CALL RCBC29M_FILL_MAP;                                           03080000
       CALL RCBC29M_SEND_MAP;                                           03090000
     END;                                                               03100000
     ELSE DO;                                                           03110000
       J = L - 16;                                                      03120000
       CALL RCBC29M_FILL_MAP;                                           03130000
       CALL RCBC29M_SEND_MAP;                                           03140000
     END;                                                               03150000
   END;                                                                 03160000
                                                                        03170000
   WHEN (DFHPF8,DFHPF20)                                                03180000
   DO;                                                                  03190000
     IF TS_CNT = 0 THEN                                                 03200000
     DO;                                                                03210000
       CALL RCBC29M_CLEAR_MAP;                                          03220000
       CALL RCBC29M_SEND_MAP;                                           03230000
     END;                                                               03240000
                                                                        03250000
     IF J >= TS_CNT THEN                                                03260000
     DO;                                                                03270000
       J = J - K;                                                       03280000
       RCBM29O.MSG_LINEO = ERR_O031;                                    03290000
       CALL RCBC29M_FILL_MAP;                                           03300000
       CALL RCBC29M_SEND_MAP;                                           03310000
     END;                                                               03320000
                                                                        03330000
     CALL RCBC29M_FILL_MAP;                                             03340000
     CALL RCBC29M_SEND_MAP;                                             03350000
   END;                                                                 03360000
                                                                        03370000
   WHEN (DFHPF9,DFHPF21)                                                03380000
   DO;                                                                  03390000
     IF TS_CNT = 0 THEN                                                 03400000
     DO;                                                                03410000
       CALL RCBC29M_CLEAR_MAP;                                          03420000
       CALL RCBC29M_SEND_MAP;                                           03430000
     END;                                                               03440000
                                                                        03450000
     IF O = 0                                                           03460000
      & TS_CNT > 15 THEN                                                03470000
     DO;                                                                03480000
       O = 1;                                                           03490000
       J = TS_CNT - 15;                                                 03500000
       IF J < 1 THEN J = 1;                                             03510000
       CALL RCBC29M_FILL_MAP;                                           03520000
       CALL RCBC29M_SEND_MAP;                                           03530000
     END;                                                               03540000
                                                                        03550000
     O = 0;                                                             03560000
     J = 0;                                                             03570000
     CALL RCBC29M_FILL_MAP;                                             03580000
     CALL RCBC29M_SEND_MAP;                                             03590000
   END;                                                                 03600000
                                                                        03610000
   WHEN (DFHENTER)                                                      03620000
   DO;                                                                  03630000
     CALL RCBC29M_RECEIVE_MAP;                                          03640000
                                                                        03650000
     DO I = 1 TO 15;                                                    03660000
       IF VERIFY(RCBM29I.ACTIONI(I), 'ACD') = 0 THEN                    03670000
       DO;                                                              03680000
         ACT_SEL = TRUE;                                                03690000
       END;                                                             03700000
     END;                                                               03710000
                                                                        03720000
     IF (RCBM29I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER                  03730000
       | RCBM29I.TYPE_SELI       ¬= TYPE_SEL                            03740000
       | RCBM29I.OPTION_SELI     ¬= OPTION_SEL                          03750000
       | RCBM29I.TOM_SELI        ¬= TOM_SEL                             03760000
       | RCBM29I.ST_SELI         ¬= ST_SEL                              03770000
       | RCBM29I.SLC_SELI        ¬= SLC_SEL)                            03780000
    /* & ACT_SEL                  = FALSE THEN*/        /*CEDS00000432*/03781022
       | ACT_SEL                  = FALSE THEN          /*CEDS00000432*/03782022
     DO;                                                                03783022
       CALL RCBC29M_VALIDATE_MAP;                                       03810000
       CALL RCBC29M_CHECK_MAP;                          /*CEDS00000432*/03811022
       CALL RCBC29M_GET_ATO;                                            03820000
       CALL RCBC29M_FILL_MAP;                                           03830000
       CALL RCBC29M_SEND_MAP_CSR;                                       03840000
     END;                                                               03850000
                                                                        03860000
     ACT_SEL = FALSE;                                                   03870000
     CALL RCBC29M_CHECK_MAP;                                            03880000
     CALL RCBC29M_GET_ATO;                                              03890000
     CALL RCBC29M_FILL_MAP;                                             03900000
     CALL RCBC29M_SEND_MAP;                                             03910000
   END;                                                                 03920000
                                                                        03930000
   WHEN (DFHCLEAR)                                                      03940000
   DO;                                                                  03950000
     EXEC CICS SEND                                                     03960000
        CONTROL                                                         03970000
        ERASE                                                           03980000
        FREEKB;                                                         03990000
     EXEC CICS RETURN;                                                  04000000
   END;                                                                 04010000
                                                                        04020000
   OTHERWISE                                                            04030000
   DO;                                                                  04040000
     CALL RCBC29M_RECEIVE_MAP;                                          04050000
     RCBM29O.MSG_LINEO  = ERR_O004;                                     04060000
     RCBM29I.ACTIONL(1) = -1;                                           04070000
     CALL RCBC29M_SEND_MAP_CSR;                                         04080000
   END;                                                                 04090000
                                                                        04100000
 END;                                                                   04110000
1/********************************************************************/ 04120000
 /*      FILL MAP RCBM29                                             */ 04130000
 /********************************************************************/ 04140000
0RCBC29M_FILL_MAP: PROC;                                                04150000
                                                                        04160000
 CALL RCBC29M_CLEAR_MAP;                                                04170000
 RCBM29O.TYPE_SELO   = TYPE_SEL;                                        04180000
 RCBM29O.OPTION_SELO = OPTION_SEL;                                      04190000
 RCBM29O.TOM_SELO    = TOM_SEL;                                         04200000
 RCBM29O.ST_SELO     = ST_SEL;                                          04210000
 RCBM29O.SLC_SELO    = SLC_SEL;                                         04220000
                                                                        04230000
 K = 0;                                                                 04240000
 PIC_CNT         = J + 1;                                               04250000
 IF PIC_CNT = 0 THEN PIC_CNT = 1;                                       04260000
 RCBM29O.INCNTO  = PIC_CNT;                                             04270000
 L               = PIC_CNT;                                             04280000
 PIC_CNT         = TS_CNT;                                              04290000
 RCBM29O.TOTCNTO = PIC_CNT;                                             04300000
                                                                        04310000
 RCBM29I.ACTIONL(1) = -1;                                               04320000
                                                                        04330000
 DO I = 1 TO 15;                                                        04340000
                                                                        04350000
   IF J <= TS_CNT THEN                                                  04360000
   DO;                                                                  04370000
     J = J + 1;     /* NUMBER OF LINES DISPLAYED */                     04380000
     K = K + 1;     /* NUMBER OF LINES DISPLAYED ON CURRENT SCREEN */   04390000
     EXEC CICS READQ TS QUEUE(TS_Q) INTO(TS_REC) ITEM(J);               04400000
     RCBM29O.AGREEMENT_TYPEO(I)   = TS_REC.TYPE;                        04410000
     RCBM29O.AGREEMENT_OPTIONO(I) = TS_REC.OPTION;                      04420000
     RCBM29O.TYPE_OF_MAINTO(I)    = TS_REC.TOM;                         04430000
     RCBM29O.SERVICE_TYPEO(I)     = TS_REC.ST;                          04440000
     RCBM29O.SERVICE_LVL_CODEO(I) = TS_REC.SLC;                         04450000
     RCBM29O.AGREEMENT_TYPEA(I)   = DFHBMPRF;                           04460000
     FILL_FLAG(I)                 = TRUE;                               04470000
   END;                                                                 04480000
                                                                        04490000
   IF J >= TS_CNT THEN                                                  04500000
     I = 16;                                                            04510000
 END;                                                                   04520000
                                                                        04530000
0END RCBC29M_FILL_MAP;                                                  04540000
1/********************************************************************/ 04550000
 /*      RECEIVE MAP RCBM29                                          */ 04560000
 /********************************************************************/ 04570000
0RCBC29M_RECEIVE_MAP: PROC;                                             04580000
                                                                        04590000
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      04600000
    MAP('RCBM29')                                                       04610000
    MAPSET('RCBM29')                                                    04620000
    RESP(RESPONSE)                                                      04630000
    RESP2(CODE_EXPLAIN);                                                04640000
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      04650000
    WHEN(DFHRESP(NORMAL))                                               04660000
    DO;                                                                 04670000
      HEADER.RET_CODE = '';        /* INITIALISE RETURN CODES  */       04680000
      HEADER.SUB_CODE = '';                                             04690000
    END;                                                                04700000
                                                                        04710000
    OTHERWISE                                                           04720000
    DO;                                                                 04730000
      RCBM29O.MSG_LINEO = ERR_MESSAGE3;                                 04740000
      CALL RCBC29M_SEND_MAP;                                            04750000
    END;                                                                04760000
 END;                                                                   04770000
                                                                        04780000
0END RCBC29M_RECEIVE_MAP;                                               04790000
1/********************************************************************/ 04800000
 /*      VALIDATE MAP RCBM29                                         */ 04810000
 /********************************************************************/ 04820000
0RCBC29M_VALIDATE_MAP: PROC;                                            04830000
                                                                        04840000
 TYPE_ENT   = 'N';                                                      04850000
 OPTION_ENT = 'N';                                                      04860000
 TOM_ENT    = 'N';                                                      04870000
 ST_ENT     = 'N';                                                      04880000
 SLC_ENT    = 'N';                                                      04890000
 TYPE_SEL   = '';                                                       04900000
 OPTION_SEL = '';                                                       04910000
 TOM_SEL    = '';                                                       04920000
 ST_SEL     = '';                                                       04930000
 SLC_SEL    = '';                                                       04940000
                                                                        04950000
 IF RCBM29I.TYPE_SELL   = 0 THEN                                        04960000
   RCBM29O.TYPE_SELO    = '';                                           04970000
 IF RCBM29I.OPTION_SELL = 0 THEN                                        04980000
   RCBM29O.OPTION_SELO  = '';                                           04990000
 IF RCBM29I.TOM_SELL    = 0 THEN                                        05000000
   RCBM29O.TOM_SELO     = '';                                           05010000
 IF RCBM29I.ST_SELL     = 0 THEN                                        05020000
   RCBM29O.ST_SELO      = '';                                           05030000
 IF RCBM29I.SLC_SELL    = 0 THEN                                        05040000
   RCBM29O.SLC_SELO     = '';                                           05050000
                                                                        05060000
 IF WRK_COUNTRY_NUMBER ¬= RCBM29I.COUNTRY_NUMBERI THEN                  05070000
 DO;                                                                    05080000
   SEL_OPT = '9';                                                       05090000
   WRK_COUNTRY_NUMBER = RCBM29I.COUNTRY_NUMBERI;                        05100000
                                                                        05110000
   EXEC CICS LINK                                                       05120000
      PROGRAM('RCBC99P')                                                05130000
      COMMAREA(COMMAREA)                                                05140000
      LENGTH(CSTG(COMMAREA));                                           05150000
                                                                        05160000
   IF CTY_OK_FLAG = FALSE THEN                                          05170000
   DO;                                                                  05180000
     RCBM29O.MSG_LINEO       = ERR_O072;                                05190000
     RCBM29I.COUNTRY_NUMBERL = -1;                                      05200000
     RCBM29O.COUNTRY_NUMBERC = DFHRED;                                  05210000
     WRK_COUNTRY_NUMBER      = '001';                                   05220000
     CALL RCBC29M_CLEAR_MAP_2;                                          05230000
     CALL RCBC29M_SEND_MAP_CSR;                                         05240000
   END;                                                                 05250000
                                                                        05260000
   IF OK_FLAG = FALSE THEN                                              05270000
   DO;                                                                  05280000
     RCBM29O.MSG_LINEO       = ERR_O057;                                05290000
     RCBM29I.COUNTRY_NUMBERL = -1;                                      05300000
     RCBM29O.COUNTRY_NUMBERC = DFHRED;                                  05310000
     WRK_COUNTRY_NUMBER      = '001';                                   05320000
     CALL RCBC29M_CLEAR_MAP_2;                                          05330000
     CALL RCBC29M_SEND_MAP_CSR;                                         05340000
   END;                                                                 05350000
                                                                        05360000
   IF RCB025_FLAG = FALSE THEN                                          05370000
   DO;                                                                  05380000
     RCBM29O.MSG_LINEO =                                                05390000
                     'Parameter RCB025 is missing for this country';    05400000
     RCBM29O.COUNTRY_NUMBERC = DFHRED;                                  05410000
     RCBM29I.COUNTRY_NUMBERL = -1;                                      05420000
     WRK_COUNTRY_NUMBER      = '001';                                   05430000
     CALL RCBC29M_CLEAR_MAP_2;                                          05440000
     CALL RCBC29M_SEND_MAP_CSR;                                         05450000
   END;                                                                 05460000
                                                                        05470000
   IF RCB098_FLAG = FALSE THEN                                          05480000
   DO;                                                                  05490000
     RCBM29O.MSG_LINEO =                                                05500000
                     'Parameter RCB098 is missing for this country';    05510000
     RCBM29O.COUNTRY_NUMBERC = DFHRED;                                  05520000
     RCBM29I.COUNTRY_NUMBERL = -1;                                      05530000
     WRK_COUNTRY_NUMBER      = '001';                                   05540000
     CALL RCBC29M_CLEAR_MAP_2;                                          05550000
     CALL RCBC29M_SEND_MAP_CSR;                                         05560000
   END;                                                                 05570000
                                                                        05580000
   IF ASCA_STOP_FLAG = TRUE THEN                                        05590000
   DO;                                                                  05600000
     RCBM29O.MSG_LINEO       = ERR_O079;                                05610000
     RCBM29O.COUNTRY_NUMBERC = DFHRED;                                  05620000
     RCBM29I.COUNTRY_NUMBERL = -1;                                      05630000
     WRK_COUNTRY_NUMBER      = '001';                                   05640000
     CALL RCBC29M_CLEAR_MAP_2;                                          05650000
     CALL RCBC29M_SEND_MAP_CSR;                                         05660000
   END;                                                                 05670000
                                                                        05680000
   WRK_COUNTRY_NUMBER = RCBM29I.COUNTRY_NUMBERI;                        05690000
 END;                                                                   05700000
                                                                        05710000
 IF RCBM29I.TYPE_SELI ¬= '' THEN                                        05720000
 DO;                                                                    05730000
   TYPE_ENT = 'Y';                                                      05740000
   TYPE_SEL = RCBM29O.TYPE_SELO;                                        05750000
 END;                                                                   05760000
                                                                        05770000
 IF RCBM29I.OPTION_SELI ¬= '' THEN                                      05780000
 DO;                                                                    05790000
   OPTION_ENT = 'Y';                                                    05800000
   OPTION_SEL = RCBM29O.OPTION_SELO;                                    05810000
 END;                                                                   05820000
                                                                        05830000
 IF RCBM29I.TOM_SELI ¬= '' THEN                                         05840000
 DO;                                                                    05850000
   TOM_ENT = 'Y';                                                       05860000
   TOM_SEL = RCBM29O.TOM_SELO;                                          05870000
 END;                                                                   05880000
                                                                        05890000
 IF RCBM29I.ST_SELI ¬= '' THEN                                          05900000
 DO;                                                                    05910000
   ST_ENT = 'Y';                                                        05920000
   ST_SEL = RCBM29O.ST_SELO;                                            05930000
 END;                                                                   05940000
                                                                        05950000
 IF RCBM29I.SLC_SELI ¬= '' THEN                                         05960000
 DO;                                                                    05970000
   SLC_ENT = 'Y';                                                       05980000
   SLC_SEL = RCBM29O.SLC_SELO;                                          05990000
 END;                                                                   06000000
                                                                        06010000
0END RCBC29M_VALIDATE_MAP;                                              06020000
1/********************************************************************/ 06030000
 /*      CHECK MAP RCBM29                                            */ 06040000
 /********************************************************************/ 06050000
0RCBC29M_CHECK_MAP: PROC;                                               06060000
                                                                        06070000
 T610_UPD_FLAG = FALSE;                                                 06080000
 MAP_OK_FLAG   = TRUE;                                                  06090000
                                                                        06100000
 DO I = 1 TO 15;                                                        06110000
   IF VERIFY(RCBM29I.ACTIONI(I), ' ACD') ¬= 0 THEN                      06120000
   DO;                                                                  06130000
     RCBM29I.ACTIONL(I) = -1;                                           06140000
     RCBM29O.ACTIONC(I) = DFHRED;                                       06150000
     MAP_OK_FLAG        = FALSE;                                        06160000
   END;                                                                 06170000
 END;                                                                   06180000
                                                                        06190000
 IF MAP_OK_FLAG = FALSE THEN                                            06200000
 DO;                                                                    06210000
   CALL RCBC29M_PROTECT_MAP;                                            06220000
   RCBM29O.MSG_LINEO = ERR_O127;                                        06230000
   CALL RCBC29M_SEND_MAP_CSR;                                           06240000
 END;                                                                   06250000
                                                                        06260000
 DO I = 1 TO 15;                                                        06270000
   IF VERIFY(RCBM29I.ACTIONI(I), 'AC') = 0 THEN                         06280000
   DO;                                                                  06290000
     CALL RCBC29M_UPDATE_CHECK;                                         06300000
   END;                                                                 06310000
                                                                        06320000
   IF VERIFY(RCBM29I.ACTIONI(I), 'ACD') = 0                             06330000
    & PF5_FLAG = FALSE THEN                                             06340000
   DO;                                                                  06350000
     CALL RCBC29M_PROTECT_MAP;                                          06360000
     RCBM29O.MSG_LINEO = ERR_O022;                                      06370000
     CALL RCBC29M_SEND_MAP;                                             06380000
   END;                                                                 06390000
                                                                        06400000
   IF RCBM29I.ACTIONI(I) = 'A' THEN                                     06410000
   DO;                                                                  06420000
     CALL RCBC29M_CHECK_ADD;                                            06430000
     IF PF5_FLAG = TRUE THEN                                            06440000
     DO;                                                                06450000
       CALL RCBC29M_DEFINE_ATO;                                         06460000
       WRK_ACTION = '1';                                                06470000
       CALL RCBC29M_UPD_T560;                                           06480000
       RCBM29I.ACTIONI(I) = '';                                         06490000
     END;                                                               06500000
   END;                                                                 06510000
                                                                        06520000
   IF RCBM29I.ACTIONI(I) = 'C'                                          06530000
    & PF5_FLAG           = TRUE THEN                                    06540000
   DO;                                                                  06550000
     CALL RCBC29M_UPDATE_ATO;                                           06560000
     WRK_ACTION = '2';                                                  06570000
     CALL RCBC29M_UPD_T560;                                             06580000
     RCBM29I.ACTIONI(I) = '';                                           06590000
   END;                                                                 06600000
                                                                        06610000
   IF RCBM29I.ACTIONI(I) = 'D'                                          06620000
    & PF5_FLAG           = TRUE THEN                                    06630000
   DO;                                                                  06640000
     CALL RCBC29M_DELETE_ATO;                                           06650000
     WRK_ACTION = '3';                                                  06660000
     CALL RCBC29M_UPD_T560;                                             06670000
     RCBM29I.ACTIONI(I) = '';                                           06680000
   END;                                                                 06690000
 END;                                                                   06700000
                                                                        06710000
0END RCBC29M_CHECK_MAP;                                                 06720000
1/********************************************************************/ 06730000
 /*      CHECK FIELDS FOR CORRECTNESS                                */ 06740000
 /********************************************************************/ 06750000
0RCBC29M_UPDATE_CHECK: PROC;                                            06760000
                                                                        06770000
 ERR_FLAG = FALSE;                                                      06780000
                                                                        06790000
 IF RCBM29I.AGREEMENT_TYPEL(I)   = 0 THEN                               06800000
   RCBM29O.AGREEMENT_TYPEO(I)    = '';                                  06810000
 IF RCBM29I.AGREEMENT_OPTIONL(I) = 0 THEN                               06820000
   RCBM29O.AGREEMENT_OPTIONO(I)  = '';                                  06830000
 IF RCBM29I.TYPE_OF_MAINTL(I)    = 0 THEN                               06840000
   RCBM29O.TYPE_OF_MAINTO(I)     = '';                                  06850000
 IF RCBM29I.SERVICE_TYPEL(I)     = 0 THEN                               06860000
   RCBM29O.SERVICE_TYPEO(I)      = '';                                  06870000
 IF RCBM29I.SERVICE_LVL_CODEL(I) = 0 THEN                               06880000
   RCBM29O.SERVICE_LVL_CODEO(I)  = '';                                  06890000
                                                                        06900000
 IF RCBM29I.SERVICE_LVL_CODEI(I) ¬= '' THEN                             06910000
 DO;                                                                    06920000
   WRK_SLC = RCBM29I.SERVICE_LVL_CODEI(I);                              06930000
   CALL RCBC29M_GET_T470;                                               06940000
                                                                        06950000
   IF T470_FLAG = FALSE THEN                                            06960000
   DO;                                                                  06970000
     RCBM29O.MSG_LINEO            = ERR_O142;                           06980000
     RCBM29O.SERVICE_LVL_CODEC(I) = DFHRED;                             06990000
     RCBM29I.SERVICE_LVL_CODEL(I) = -1;                                 07000000
     ERR_FLAG = TRUE;                                                   07010000
   END;                                                                 07020000
 END;                                                                   07030000
                                                                        07040000
 IF VERIFY(RCBM29I.SERVICE_TYPEI(I), ALPHANUM) ¬= 0 THEN                07050000
 DO;                                                                    07060000
   RCBM29O.MSG_LINEO        = ERR_O101;                                 07070000
   RCBM29O.SERVICE_TYPEC(I) = DFHRED;                                   07080000
   RCBM29I.SERVICE_TYPEL(I) = -1;                                       07090000
   ERR_FLAG = TRUE;                                                     07100000
 END;                                                                   07110000
                                                                        07120000
 IF VERIFY(RCBM29I.TYPE_OF_MAINTI(I), TOMLIST) ¬= 0 THEN                07130000
 DO;                                                                    07140000
   RCBM29O.MSG_LINEO         = ERR_O101;                                07150000
   RCBM29O.TYPE_OF_MAINTC(I) = DFHRED;                                  07160000
   RCBM29I.TYPE_OF_MAINTL(I) = -1;                                      07170000
   ERR_FLAG = TRUE;                                                     07180000
 END;                                                                   07190000
                                                                        07200000
 IF VERIFY(RCBM29I.AGREEMENT_OPTIONI(I), ALPHANUM) ¬= 0 THEN            07210000
 DO;                                                                    07220000
   RCBM29O.MSG_LINEO            = ERR_O101;                             07230000
   RCBM29O.AGREEMENT_OPTIONC(I) = DFHRED;                               07240000
   RCBM29I.AGREEMENT_OPTIONL(I) = -1;                                   07250000
   ERR_FLAG = TRUE;                                                     07260000
 END;                                                                   07270000
                                                                        07280000
 IF VERIFY(RCBM29I.AGREEMENT_TYPEI(I), ALPHANUM) ¬= 0 THEN              07290000
 DO;                                                                    07300000
   RCBM29O.MSG_LINEO          = ERR_O101;                               07310000
   RCBM29O.AGREEMENT_TYPEC(I) = DFHRED;                                 07320000
   RCBM29I.AGREEMENT_TYPEL(I) = -1;                                     07330000
   ERR_FLAG = TRUE;                                                     07340000
 END;                                                                   07350000
                                                                        07360000
 IF ERR_FLAG = TRUE THEN                                                07370000
 DO;                                                                    07380000
   CALL RCBC29M_PROTECT_MAP;                                            07390000
   CALL RCBC29M_SEND_MAP_CSR;                                           07400000
 END;                                                                   07410000
                                                                        07420000
0END RCBC29M_UPDATE_CHECK;                                              07430000
1/********************************************************************/ 07440000
 /*      VALIDATE RECORD TO BE ADDED                                 */ 07450000
 /********************************************************************/ 07460000
0RCBC29M_CHECK_ADD: PROC;                                               07470000
                                                                        07480000
 IF RCBM29I.AGREEMENT_TYPEI(I) = '' THEN                                07490000
 DO;                                                                    07500000
   CALL RCBC29M_PROTECT_MAP;                                            07510000
   RCBM29O.MSG_LINEO          = ERR_O101;                               07520000
   RCBM29O.AGREEMENT_TYPEC(I) = DFHRED;                                 07530000
   RCBM29I.AGREEMENT_TYPEL(I) = -1;                                     07540000
   CALL RCBC29M_SEND_MAP_CSR;                                           07550000
 END;                                                                   07560000
                                                                        07570000
0END RCBC29M_CHECK_ADD;                                                 07580000
1/********************************************************************/ 07590000
 /*      GET ATO                                                     */ 07600000
 /********************************************************************/ 07610000
0RCBC29M_GET_ATO: PROC;                                                 07620000
                                                                        07630000
 TS_Q = 'RC00' || EIBTRMID;                                             07640000
                                                                        07650000
 EXEC CICS IGNORE CONDITION QIDERR;                                     07660000
                                                                        07670000
 EXEC CICS DELETEQ TS QUEUE(TS_Q);                                      07680000
                                                                        07690000
 EXEC CICS HANDLE CONDITION QIDERR;                                     07700000
                                                                        07710000
 OK_FLAG = TRUE;                                                        07720000
 TS_CNT = 0;                                                            07730000
 J      = 0;                                                            07740000
 L      = 1;                                                            07750000
                                                                        07760000
 EXEC SQL  OPEN C_610;                                                  07770000
                                                                        07780000
 SELECT(SQLCA.SQLCODE);                                                 07790000
   WHEN(0);                                                             07800000
   WHEN(100)                                                            07810000
   DO;                                                                  07820000
     CALL RCBC29M_SEND_MAP;                                             07830000
   END;                                                                 07840000
   OTHERWISE                                                            07850000
   DO;                                                                  07860000
     RCBM29O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   07870000
     CALL RCBC29M_SEND_MAP_CSR;                                         07880000
   END;                                                                 07890000
 END;                                                                   07900000
                                                                        07910000
 DO WHILE (OK_FLAG = TRUE);                                             07920000
   RCB610SI.INDNULL(*) = 0;                                             07930000
   TS_REC.TYPE   = '';                                                  07940000
   TS_REC.OPTION = '';                                                  07950000
   TS_REC.TOM    = '';                                                  07960000
   TS_REC.ST     = '';                                                  07970000
   TS_REC.SLC    = '';                                                  07980000
                                                                        07990000
   EXEC SQL  FETCH C_610                                                08000000
             INTO :TS_REC.TYPE                                          08010000
                 ,:TS_REC.OPTION                                        08020000
                 ,:RCB610S.TYPE_OF_MAINT        :NUL610D                08030000
                 ,:RCB610S.SERVICE_TYPE         :NUL610E                08040000
                 ,:RCB610S.SERVICE_LVL_CODE     :NUL610F;               08050000
                                                                        08060000
   IF (SQLCODE = 0) THEN                                                08070000
   DO;                                                                  08080000
     IF NUL610D     ¬= -1 THEN                                          08090000
       TS_REC.TOM    = RCB610S.TYPE_OF_MAINT;                           08100000
     IF NUL610E     ¬= -1 THEN                                          08110000
       TS_REC.ST     = RCB610S.SERVICE_TYPE;                            08120000
     IF NUL610F     ¬= -1 THEN                                          08130000
       TS_REC.SLC    = RCB610S.SERVICE_LVL_CODE;                        08140000
                                                                        08150000
     EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                      08160000
     TS_CNT = TS_CNT + 1;                                               08170000
   END;                                                                 08180000
                                                                        08190000
   IF (SQLCODE ¬= 0) THEN                                               08200000
   DO;                                                                  08210000
     OK_FLAG = FALSE;                                                   08220000
   END;                                                                 08230000
 END;                                                                   08240000
                                                                        08250000
 EXEC SQL  CLOSE C_610;                                                 08260000
                                                                        08270000
 IF TS_CNT = 0 THEN                                                     08280000
 DO;                                                                    08290000
   CALL RCBC29M_CLEAR_MAP;                                              08300000
   IF (RCBM29I.TYPE_SELI   ¬= ''                                        08310000
    |  RCBM29I.OPTION_SELI ¬= ''                                        08320000
    |  RCBM29I.TOM_SELI    ¬= ''                                        08330000
    |  RCBM29I.ST_SELI     ¬= ''                                        08340000
    |  RCBM29I.SLC_SELI    ¬= '') THEN                                  08350000
     RCBM29O.MSG_LINEO = 'No items found for this search criteria';     08360000
   ELSE                                                                 08370000
     RCBM29O.MSG_LINEO = 'No items found for the selected country';     08380000
   CALL RCBC29M_SEND_MAP;                                               08390000
 END;                                                                   08400000
                                                                        08410000
0END RCBC29M_GET_ATO;                                                   08420000
1/********************************************************************/ 08430000
 /*      GET RCBT0470 RECORD                                         */ 08440000
 /********************************************************************/ 08450000
0RCBC29M_GET_T470: PROC;                                                08460000
                                                                        08470000
 T470_FLAG = FALSE;                                                     08480000
 WRK_REC_COUNT = 0;                                                     08490000
                                                                        08500000
 EXEC SQL                                                               08510000
   SELECT COUNT(*)                                                      08520000
   INTO :WRK_REC_COUNT                                                  08530000
   FROM RCBV0470_SERV_COND                                              08540000
   WHERE SERVICE_LVL_CODE = :WRK_SLC;                                   08550000
                                                                        08560000
 IF WRK_REC_COUNT ¬= 0 THEN                                             08570000
 DO;                                                                    08580000
   T470_FLAG = TRUE;                                                    08590000
 END;                                                                   08600000
                                                                        08610000
0END RCBC29M_GET_T470;                                                  08620000
1/********************************************************************/ 08630000
 /*      UPDATE T610 RECORD                                          */ 08640000
 /********************************************************************/ 08650000
0RCBC29M_UPDATE_ATO: PROC;                                              08660000
                                                                        08670000
 RCB610S   = '';                                                        08680000
 RCB610SI.INDNULL(*) = 0;                                               08690000
                                                                        08700000
 RCB610S.AGREEMENT_TYPE   = RCBM29I.AGREEMENT_TYPEI(I);                 08710000
 RCB610S.AGREEMENT_OPTION = RCBM29I.AGREEMENT_OPTIONI(I);               08720000
                                                                        08730000
 IF RCBM29I.TYPE_OF_MAINTI(I) = '' THEN                                 08740000
   NUL610D = -1;                                                        08750000
 ELSE                                                                   08760000
   RCB610S.TYPE_OF_MAINT = RCBM29I.TYPE_OF_MAINTI(I);                   08770000
                                                                        08780000
 IF RCBM29I.SERVICE_TYPEI(I) = '' THEN                                  08790000
   NUL610E = -1;                                                        08800000
 ELSE                                                                   08810000
   RCB610S.SERVICE_TYPE = RCBM29I.SERVICE_TYPEI(I);                     08820000
                                                                        08830000
 IF RCBM29I.SERVICE_LVL_CODEI(I) = '' THEN                              08840000
   NUL610F = -1;                                                        08850000
 ELSE                                                                   08860000
   RCB610S.SERVICE_LVL_CODE = RCBM29I.SERVICE_LVL_CODEI(I);             08870000
                                                                        08880000
 EXEC SQL                                                               08890000
    UPDATE RCBV0610_TRANS_ATO                                           08900000
    SET TYPE_OF_MAINT    = :RCB610S.TYPE_OF_MAINT      :NUL610D         08910000
       ,SERVICE_TYPE     = :RCB610S.SERVICE_TYPE       :NUL610E         08920000
       ,SERVICE_LVL_CODE = :RCB610S.SERVICE_LVL_CODE   :NUL610F         08930000
    WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                        08940000
      AND AGREEMENT_TYPE   = :RCB610S.AGREEMENT_TYPE                    08950000
      AND AGREEMENT_OPTION = :RCB610S.AGREEMENT_OPTION;                 08960000
                                                                        08970000
 SELECT (SQLCA.SQLCODE);                                                08980000
   WHEN (0);                                                            08990000
                                                                        09000000
   WHEN (100)                                                           09010000
   DO;                                                                  09020000
     CALL RCBC29M_DEFINE_ATO;                                           09030000
   END;                                                                 09040000
                                                                        09050000
   OTHERWISE                                                            09060000
   DO;                                                                  09070000
     CALL RCBC29M_PROTECT_MAP;                                          09080000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       09090000
     RCBM29O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0610 UPDATE = '       09100000
                       || PIC_EXPLAIN;                                  09110000
     RCBM29O.ACTIONC(I) = DFHRED;                                       09120000
     RCBM29I.ACTIONL(I) = -1;                                           09130000
     CALL RCBC29M_SEND_MAP_CSR;                                         09140000
   END;                                                                 09150000
 END;                                                                   09160000
                                                                        09170000
 T610_UPD_FLAG = TRUE;                                                  09180000
                                                                        09190000
0END RCBC29M_UPDATE_ATO;                                                09200000
1/********************************************************************/ 09210000
 /*      CREATE T610 RECORD                                          */ 09220000
 /********************************************************************/ 09230000
0RCBC29M_DEFINE_ATO: PROC;                                              09240000
                                                                        09250000
 RCB610S   = '';                                                        09260000
 RCB610SI.INDNULL(*) = 0;                                               09270000
                                                                        09280000
 RCB610S.COUNTRY_NUMBER   = WRK_COUNTRY_NUMBER;                         09290000
 RCB610S.AGREEMENT_TYPE   = RCBM29I.AGREEMENT_TYPEI(I);                 09300000
 RCB610S.AGREEMENT_OPTION = RCBM29I.AGREEMENT_OPTIONI(I);               09310000
                                                                        09320000
 IF RCBM29I.TYPE_OF_MAINTI(I) = '' THEN                                 09330000
   NUL610D = -1;                                                        09340000
 ELSE                                                                   09350000
   RCB610S.TYPE_OF_MAINT = RCBM29I.TYPE_OF_MAINTI(I);                   09360000
                                                                        09370000
 IF RCBM29I.SERVICE_TYPEI(I) = '' THEN                                  09380000
   NUL610E = -1;                                                        09390000
 ELSE                                                                   09400000
   RCB610S.SERVICE_TYPE = RCBM29I.SERVICE_TYPEI(I);                     09410000
                                                                        09420000
 IF RCBM29I.SERVICE_LVL_CODEI(I) = '' THEN                              09430000
   NUL610F = -1;                                                        09440000
 ELSE                                                                   09450000
   RCB610S.SERVICE_LVL_CODE = RCBM29I.SERVICE_LVL_CODEI(I);             09460000
                                                                        09470000
 EXEC SQL                                                               09480000
      INSERT INTO RCBV0610_TRANS_ATO                                    09490000
         (COUNTRY_NUMBER                                                09500000
         ,AGREEMENT_TYPE                                                09510000
         ,AGREEMENT_OPTION                                              09520000
         ,TYPE_OF_MAINT                                                 09530000
         ,SERVICE_TYPE                                                  09540000
         ,SERVICE_LVL_CODE)                                             09550000
      VALUES (:RCB610S:RCB610SI.INDNULL);                               09560000
                                                                        09570000
 SELECT (SQLCA.SQLCODE);                                                09580000
   WHEN (0);                                                            09590000
                                                                        09600000
   WHEN (-803)                                                          09610000
   DO;                                                                  09620000
     CALL RCBC29M_PROTECT_MAP;                                          09630000
     RCBM29O.MSG_LINEO           = 'ATO already exists';                09640000
     RCBM29O.AGREEMENT_TYPEC(I)   = DFHRED;                             09650000
     RCBM29O.AGREEMENT_OPTIONC(I) = DFHRED;                             09660000
     RCBM29I.ACTIONL(I)           = -1;                                 09670000
     CALL RCBC29M_SEND_MAP_CSR;                                         09680000
   END;                                                                 09690000
                                                                        09700000
   OTHERWISE                                                            09710000
   DO;                                                                  09720000
     CALL RCBC29M_PROTECT_MAP;                                          09730000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       09740000
     RCBM29O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0610 INSERT = '       09750000
                       || PIC_EXPLAIN;                                  09760000
     RCBM29O.ACTIONC(I) = DFHRED;                                       09770000
     RCBM29I.ACTIONL(I) = -1;                                           09780000
     CALL RCBC29M_SEND_MAP_CSR;                                         09790000
   END;                                                                 09800000
 END;                                                                   09810000
                                                                        09820000
 T610_UPD_FLAG = TRUE;                                                  09830000
                                                                        09840000
0END RCBC29M_DEFINE_ATO;                                                09850000
1/********************************************************************/ 09860000
 /*      DELETE T610 RECORD                                          */ 09870000
 /********************************************************************/ 09880000
0RCBC29M_DELETE_ATO: PROC;                                              09890000
                                                                        09900000
 RCB610S    = '';                                                       09910000
                                                                        09920000
 RCB610S.AGREEMENT_TYPE   = RCBM29I.AGREEMENT_TYPEI(I);                 09930000
 RCB610S.AGREEMENT_OPTION = RCBM29I.AGREEMENT_OPTIONI(I);               09940000
 EXEC SQL                                                               09950000
      DELETE FROM RCBV0610_TRANS_ATO                                    09960000
      WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                      09970000
        AND AGREEMENT_TYPE   = :RCB610S.AGREEMENT_TYPE                  09980000
        AND AGREEMENT_OPTION = :RCB610S.AGREEMENT_OPTION;               09990000
                                                                        10000000
 SELECT (SQLCA.SQLCODE);                                                10010000
   WHEN (0);                                                            10020000
                                                                        10030000
   WHEN (100)                                                           10040000
   DO;                                                                  10050000
     CALL RCBC29M_PROTECT_MAP;                                          10060000
     RCBM29O.MSG_LINEO  = ERR_O121;                                     10070000
     RCBM29O.ACTIONC(I) = DFHRED;                                       10080000
     RCBM29I.ACTIONL(I) = -1;                                           10090000
     CALL RCBC29M_SEND_MAP_CSR;                                         10100000
   END;                                                                 10110000
                                                                        10120000
   OTHERWISE                                                            10130000
   DO;                                                                  10140000
     CALL RCBC29M_PROTECT_MAP;                                          10150000
     PIC_EXPLAIN        = SQLCA.SQLCODE;                                10160000
     RCBM29O.MSG_LINEO  = 'DB2 ERROR - RC FROM RCBT0610 DELETE = '      10170000
                       || PIC_EXPLAIN;                                  10180000
     RCBM29O.ACTIONC(I) = DFHRED;                                       10190000
     RCBM29I.ACTIONL(I) = -1;                                           10200000
     CALL RCBC29M_SEND_MAP_CSR;                                         10210000
   END;                                                                 10220000
 END;                                                                   10230000
                                                                        10240000
 T610_UPD_FLAG = TRUE;                                                  10250000
                                                                        10260000
0END RCBC29M_DELETE_ATO;                                                10270000
1/********************************************************************/ 10280000
 /*      CREATE T560 RECORD                                          */ 10290000
 /********************************************************************/ 10300000
0RCBC29M_UPD_T560: PROC;                                                10310000
                                                                        10320000
 DCL WRK_TIME_IN  CHAR(26) INIT('');                                    10330000
                                                                        10340000
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         10350000
                                                                        10360000
 WRKMAP_DATA = ' ';                                                     10370000
 WRKMAP.AGREEMENT_TYPE   = RCBM29I.AGREEMENT_TYPEI(I);                  10380000
 WRKMAP.AGREEMENT_OPTION = RCBM29I.AGREEMENT_OPTIONI(I);                10390000
 WRKMAP.TYPE_OF_MAINT    = RCBM29I.TYPE_OF_MAINTI(I);                   10400000
 WRKMAP.SERVICE_TYPE     = RCBM29I.SERVICE_TYPEI(I);                    10410000
 WRKMAP.SERVICE_LVL_CODE = RCBM29I.SERVICE_LVL_CODEI(I);                10420000
                                                                        10430000
 RCB560S                = '';                                           10440000
 RCB560SI.INDNULL(*)    = 0;                                            10450000
 RCB560S.COUNTRY_NUMBER = WRK_COUNTRY_NUMBER;                           10460000
 RCB560S.TXN_CODE       = 'RCBTXN29';                                   10470000
 RCB560S.TIMESTAMP      = WRK_TIME_IN;                                  10480000
 RCB560S.USERID         = HEADER.USERID;                                10490000
 RCB560S.ACTION         = WRK_ACTION;                                   10500000
 RCB560S.DATA           = WRKMAP_DATA;                                  10510000
                                                                        10520000
 EXEC SQL                                                               10530000
      INSERT INTO RCBV0560_XACTION                                      10540000
      (COUNTRY_NUMBER,                                                  10550000
       TXN_CODE,                                                        10560000
       TIMESTAMP,                                                       10570000
       USERID,                                                          10580000
       ACTION,                                                          10590000
       DATA)                                                            10600000
        VALUES (:RCB560S:RCB560SI.INDNULL);                             10610000
                                                                        10620000
 SELECT(SQLCA.SQLCODE);                                                 10630000
   WHEN(0);                                                             10640000
   OTHERWISE                                                            10650000
   DO;                                                                  10660000
     CALL RCBC29M_PROTECT_MAP;                                          10670000
     RET_CODE = SQLCA.SQLCODE;                                          10680000
     SUB_CODE = SQLCA.SQLCABC;                                          10690000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       10700000
     RCBM29O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0560 INSERT = '       10710000
                        || PIC_EXPLAIN;                                 10720000
     CALL RCBC29M_SEND_MAP;                                             10730000
   END;                                                                 10740000
 END;                                                                   10750000
                                                                        10760000
0END RCBC29M_UPD_T560;                                                  10770000
1/********************************************************************/ 10780000
 /*      GET CURSOR POSITION                                         */ 10790000
 /*         FROR RETURN FROM HALP SCREENS                            */ 10800000
 /********************************************************************/ 10810000
0RCBC29M_GET_CSR_POS: PROC;                                             10820000
                                                                        10830000
 RCBM29I.ACTIONL(1) = 0;                                                10840000
 SELECT(CSR_POS);                                                       10850000
   WHEN(1)  RCBM29I.TYPE_SELL                  = -1;                    10860000
   WHEN(2)  RCBM29I.OPTION_SELL                = -1;                    10870000
   WHEN(3)  RCBM29I.TOM_SELL                   = -1;                    10880000
   WHEN(4)  RCBM29I.ST_SELL                    = -1;                    10890000
   WHEN(5)  RCBM29I.SLC_SELL                   = -1;                    10900000
   WHEN(6)  RCBM29I.ACTIONL(CSR_ROW)           = -1;                    10910000
   WHEN(7)  RCBM29I.AGREEMENT_TYPEL(CSR_ROW)   = -1;                    10920000
   WHEN(8)  RCBM29I.AGREEMENT_OPTIONL(CSR_ROW) = -1;                    10930000
   WHEN(9)  RCBM29I.TYPE_OF_MAINTL(CSR_ROW)    = -1;                    10940000
   WHEN(10) RCBM29I.SERVICE_TYPEL(CSR_ROW)     = -1;                    10950000
   WHEN(11) RCBM29I.SERVICE_LVL_CODEL(CSR_ROW) = -1;                    10960000
   WHEN(12) RCBM29I.COUNTRY_NUMBERL            = -1;                    10970000
   OTHERWISE RCBM29I.TYPE_SELL                 = -1;                    10980000
 END;                                                                   10990000
                                                                        11000000
0END RCBC29M_GET_CSR_POS;                                               11010000
1/********************************************************************/ 11020000
 /*      CLEAR WORK                                                  */ 11030000
 /********************************************************************/ 11040000
0RCBC29M_CLEAR_WORK: PROC;                                              11050000
                                                                        11060000
 PF5_FLAG     = FALSE;                                                  11070000
                                                                        11080000
 WRK_AGREEMENT_TYPE   = '';                                             11090000
 WRK_AGREEMENT_OPTION = '';                                             11100000
 WRK_TYPE_OF_MAINT    = '';                                             11110000
 WRK_SERVICE_TYPE     = '';                                             11120000
 TYPE_SEL   = '**';                                                     11130000
 OPTION_SEL = '*';                                                      11140000
 TOM_SEL    = '*';                                                      11150000
 ST_SEL     = '*';                                                      11160000
 SLC_SEL    = '***';                                                    11170000
 TYPE_ENT   = 'N';                                                      11180000
 OPTION_ENT = 'N';                                                      11190000
 TOM_ENT    = 'N';                                                      11200000
 ST_ENT     = 'N';                                                      11210000
 SLC_ENT    = 'N';                                                      11220000
                                                                        11230000
0END RCBC29M_CLEAR_WORK;                                                11240000
1/********************************************************************/ 11250000
 /*      CLEAR MAP RCBM29                                            */ 11260000
 /********************************************************************/ 11270000
0RCBC29M_CLEAR_MAP: PROC;                                               11280000
                                                                        11290000
 RCBM29O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                          11300000
 RCBM29O.INCNTO     = '';                                               11310000
 RCBM29O.TOTCNTO    = '';                                               11320000
                                                                        11330000
 DO I = 1 TO 15;                                                        11340000
   RCBM29O.ACTIONO(I)           = '';                                   11350000
   RCBM29O.AGREEMENT_TYPEO(I)   = '';                                   11360000
   RCBM29O.AGREEMENT_OPTIONO(I) = '';                                   11370000
   RCBM29O.TYPE_OF_MAINTO(I)    = '';                                   11380000
   RCBM29O.SERVICE_TYPEO(I)     = '';                                   11390000
   RCBM29O.SERVICE_LVL_CODEO(I) = '';                                   11400000
   FILL_FLAG(I)                 = FALSE;                                11410000
 END;                                                                   11420000
                                                                        11430000
0END RCBC29M_CLEAR_MAP;                                                 11440000
1/********************************************************************/ 11450000
 /*      CLEAR MAP RCBM29 2                                          */ 11460000
 /********************************************************************/ 11470000
0RCBC29M_CLEAR_MAP_2: PROC;                                             11480000
                                                                        11490000
 RCBM29O.INCNTO     = '';                                               11500000
 RCBM29O.TOTCNTO    = '';                                               11510000
                                                                        11520000
 DO I = 1 TO 15;                                                        11530000
   RCBM29O.ACTIONO(I)           = '';                                   11540000
   RCBM29O.AGREEMENT_TYPEO(I)   = '';                                   11550000
   RCBM29O.AGREEMENT_OPTIONO(I) = '';                                   11560000
   RCBM29O.TYPE_OF_MAINTO(I)    = '';                                   11570000
   RCBM29O.SERVICE_TYPEO(I)     = '';                                   11580000
   RCBM29O.SERVICE_LVL_CODEO(I) = '';                                   11590000
   FILL_FLAG(I)                 = FALSE;                                11600000
 END;                                                                   11610000
                                                                        11620000
0END RCBC29M_CLEAR_MAP_2;                                               11630000
1/********************************************************************/ 11640000
 /*       SAVE MAP RCBM29                                            */ 11650000
 /********************************************************************/ 11660000
0RCBC29M_SAVE_MAP: PROC;                                                11670000
                                                                        11680000
 DO I = 1 TO 15;                                                        11690000
   TMP_ACTION(I)           = RCBM29I.ACTIONI(I);                        11700000
   TMP_AGREEMENT_TYPE(I)   = RCBM29I.AGREEMENT_TYPEI(I);                11710000
   TMP_AGREEMENT_OPTION(I) = RCBM29I.AGREEMENT_OPTIONI(I);              11720000
   TMP_TYPE_OF_MAINT(I)    = RCBM29I.TYPE_OF_MAINTI(I);                 11730000
   TMP_SERVICE_TYPE(I)     = RCBM29I.SERVICE_TYPEI(I);                  11740000
   TMP_SERVICE_LVL_CODE(I) = RCBM29I.SERVICE_LVL_CODEI(I);              11750000
   TMP_FILL_FLAG(I)        = FILL_FLAG(I);                              11760000
 END;                                                                   11770000
                                                                        11780000
0END RCBC29M_SAVE_MAP;                                                  11790000
1/********************************************************************/ 11800000
 /*    RESTORE MAP RCBM29                                            */ 11810000
 /********************************************************************/ 11820000
0RCBC29M_RESTORE_MAP: PROC;                                             11830000
                                                                        11840000
 DO I = 1 TO 15;                                                        11850000
   RCBM29O.ACTIONO(I)           = TMP_ACTION(I);                        11860000
   RCBM29O.AGREEMENT_TYPEO(I)   = TMP_AGREEMENT_TYPE(I);                11870000
   RCBM29O.AGREEMENT_OPTIONO(I) = TMP_AGREEMENT_OPTION(I);              11880000
   RCBM29O.TYPE_OF_MAINTO(I)    = TMP_TYPE_OF_MAINT(I);                 11890000
   RCBM29O.SERVICE_TYPEO(I)     = TMP_SERVICE_TYPE(I);                  11900000
   RCBM29O.SERVICE_LVL_CODEO(I) = TMP_SERVICE_LVL_CODE(I);              11910000
   FILL_FLAG(I)                 = TMP_FILL_FLAG(I);                     11920000
 END;                                                                   11930000
                                                                        11940000
0END RCBC29M_RESTORE_MAP;                                               11950000
1/********************************************************************/ 11960000
 /*      PROTECT MAP RCBM24                                          */ 11970000
 /********************************************************************/ 11980000
0RCBC29M_PROTECT_MAP: PROC;                                             11990000
                                                                        12000000
 DO M = 1 TO 15;                                                        12010000
   IF FILL_FLAG(M) = TRUE THEN                                          12020000
   DO;                                                                  12030000
     RCBM29O.AGREEMENT_TYPEA(M) = DFHBMPRF;                             12040000
   END;                                                                 12050000
 END;                                                                   12060000
                                                                        12070000
0END RCBC29M_PROTECT_MAP;                                               12080000
1/********************************************************************/ 12090000
 /*      SEND MAP RCBM29                                             */ 12100000
 /********************************************************************/ 12110000
0RCBC29M_SEND_MAP: PROC;                                                12120000
                                                                        12130000
 IF ADMIN_FLAG  = TRUE                                                  12140000
  | UPD_OK_FLAG = TRUE THEN                                             12150000
 DO;                                                                    12160000
   RCBM29O.PFLINEO = PFLINE1A;                                          12170000
   RCBM29O.SALINEO = SALINE;                                            12180000
 END;                                                                   12190000
 ELSE DO                                                                12200000
   RCBM29O.PFLINEO = PFLINE1;                                           12210000
 END;                                                                   12220000
                                                                        12230000
0EXEC CICS SEND                                                         12240000
    MAP('RCBM29')                                                       12250000
    MAPSET('RCBM29')                                                    12260000
    FREEKB                                                              12270000
    ERASE                                                               12280000
    RESP(RESPONSE)                                                      12290000
    RESP2(CODE_EXPLAIN);                                                12300000
                                                                        12310000
0SELECT(RESPONSE);                                                      12320000
    WHEN(DFHRESP(NORMAL))                                               12330000
    DO;                                                                 12340000
      EXEC CICS RETURN                                                  12350000
         TRANSID('RC29')                                                12360000
         COMMAREA(COMMAREA)                                             12370000
         LENGTH(CSTG(COMMAREA));                                        12380000
    END;                                                                12390000
    OTHERWISE                                                           12400000
    DO;                                                                 12410000
      RCBM29O.MSG_LINEO = ERR_MESSAGE2 || 'RCBM29';                     12420000
      CALL RCBC29M_SEND_MAP;                                            12430000
    END;                                                                12440000
 END;                                                                   12450000
0END RCBC29M_SEND_MAP;                                                  12460000
1/********************************************************************/ 12470000
 /*      SEND MAP WITH CSR SET                                       */ 12480000
 /********************************************************************/ 12490000
 RCBC29M_SEND_MAP_CSR : PROC;                                           12500000
                                                                        12510000
 IF ADMIN_FLAG  = TRUE                                                  12520000
  | UPD_OK_FLAG = TRUE THEN                                             12530000
 DO;                                                                    12540000
   RCBM29O.PFLINEO = PFLINE1A;                                          12550000
   RCBM29O.SALINEO = SALINE;                                            12560000
 END;                                                                   12570000
 ELSE DO                                                                12580000
   RCBM29O.PFLINEO = PFLINE1;                                           12590000
   RCBM29O.SALINEO ='';                                /*CEDS00000432*/ 12591022
 END;                                                                   12600000
                                                                        12610000
 EXEC CICS SEND                                                         12620000
    MAP('RCBM29')                                                       12630000
    MAPSET('RCBM29')                                                    12640000
    CURSOR                                                              12650000
    ERASE                                                               12660000
    FREEKB;                                                             12670000
                                                                        12680000
 EXEC CICS RETURN                                                       12690000
    TRANSID('RC29')                                                     12700000
    COMMAREA(COMMAREA)                                                  12710000
    LENGTH(CSTG(COMMAREA));                                             12720000
                                                                        12730000
 END RCBC29M_SEND_MAP_CSR;                                              12740000
1/********************************************************************/ 12750000
 /*      SEND HELP MAP                                               */ 12760000
 /********************************************************************/ 12770000
0RCBC29M_HELP_MAP: PROC;                                                12780000
                                                                        12790000
 HEADER.NEXT = 'H1';                                                    12800000
 HELP_FLAG   = FALSE;                                                   12810000
 CSR_POS     = 1;                                                       12820000
 CSR_ROW     = 1;                                                       12830000
                                                                        12840000
 DO N = 1 TO 15;                                                        12850000
   CSR_ROW = N;                                                         12860000
   IF RCBM29I.ACTIONF(N) = CSR_HELP                                     12870000
    | RCBM29I.ACTIONF(N) = CSR_EOF THEN                                 12880000
   DO;                                                                  12890000
     N = 16;                                                            12900000
     CSR_POS   = 6;                                                     12910000
     HELP_FLAG = TRUE;                                                  12920000
     EXEC CICS SEND                                                     12930000
        MAP('ACTACD')                                                   12940000
        MAPSET('RCBHELP')                                               12950000
        FREEKB                                                          12960000
        ERASE;                                                          12970000
   END;                                                                 12980000
                                                                        12990000
   IF RCBM29I.AGREEMENT_TYPEF(N) = CSR_HELP                             13000000
    | RCBM29I.AGREEMENT_TYPEF(N) = CSR_EOF THEN                         13010000
   DO;                                                                  13020000
     N = 16;                                                            13030000
     CSR_POS   = 7;                                                     13040000
     HELP_FLAG = TRUE;                                                  13050000
     EXEC CICS SEND                                                     13060000
        MAP('AGRTYP')                                                   13070000
        MAPSET('RCBHELP')                                               13080000
        FREEKB                                                          13090000
        ERASE;                                                          13100000
   END;                                                                 13110000
                                                                        13120000
   IF RCBM29I.AGREEMENT_OPTIONF(N) = CSR_HELP                           13130000
    | RCBM29I.AGREEMENT_OPTIONF(N) = CSR_EOF THEN                       13140000
   DO;                                                                  13150000
     N = 16;                                                            13160000
     CSR_POS   = 8;                                                     13170000
     HELP_FLAG = TRUE;                                                  13180000
     EXEC CICS SEND                                                     13190000
        MAP('AGROPT')                                                   13200000
        MAPSET('RCBHELP')                                               13210000
        FREEKB                                                          13220000
        ERASE;                                                          13230000
   END;                                                                 13240000
                                                                        13250000
   IF RCBM29I.TYPE_OF_MAINTF(N) = CSR_HELP                              13260000
    | RCBM29I.TYPE_OF_MAINTF(N) = CSR_EOF THEN                          13270000
   DO;                                                                  13280000
     N = 16;                                                            13290000
     CSR_POS   = 9;                                                     13300000
     HELP_FLAG = TRUE;                                                  13310000
     EXEC CICS SEND                                                     13320000
        MAP('TOM')                                                      13330000
        MAPSET('RCBHELP')                                               13340000
        FREEKB                                                          13350000
        ERASE;                                                          13360006
     ITERATE:                                                           13370008
   END;                                                                 13380000
                                                                        13390000
   IF RCBM29I.SERVICE_TYPEF(N) = CSR_HELP                               13400000
    | RCBM29I.SERVICE_TYPEF(N) = CSR_EOF THEN                           13410000
   DO;                                                                  13420000
     N = 16;                                                            13430000
     CSR_POS   = 10;                                                    13440000
     HELP_FLAG = TRUE;                                                  13450000
     EXEC CICS SEND                                                     13460000
        MAP('SERVTYP')                                                  13470000
        MAPSET('RCBHELP')                                               13480000
        FREEKB                                                          13490000
        ERASE;                                                          13500000
   END;                                                                 13510000
                                                                        13520000
   IF RCBM29I.SERVICE_LVL_CODEF(N) = CSR_HELP                           13530000
    | RCBM29I.SERVICE_LVL_CODEF(N) = CSR_EOF THEN                       13540000
   DO;                                                                  13550000
     N = 16;                                                            13560000
     CSR_POS   = 11;                                                    13570000
     HELP_FLAG = TRUE;                                                  13580000
     EXEC CICS SEND                                                     13590000
        MAP('SLC')                                                      13600000
        MAPSET('RCBHELP')                                               13610000
        FREEKB                                                          13620000
        ERASE;                                                          13630000
   END;                                                                 13640000
                                                                        13650000
 END;                                                                   13660000
                                                                        13670000
 IF RCBM29I.TYPE_SELF = CSR_HELP                                        13680000
  | RCBM29I.TYPE_SELF = CSR_EOF THEN                                    13690000
 DO;                                                                    13700000
   CSR_POS   = 1;                                                       13710000
 END;                                                                   13720000
                                                                        13730000
 IF RCBM29I.OPTION_SELF = CSR_HELP                                      13740000
  | RCBM29I.OPTION_SELF = CSR_EOF THEN                                  13750000
 DO;                                                                    13760000
   CSR_POS   = 2;                                                       13770000
 END;                                                                   13780000
                                                                        13790000
 IF RCBM29I.TOM_SELF = CSR_HELP                                         13800000
  | RCBM29I.TOM_SELF = CSR_EOF THEN                                     13810000
 DO;                                                                    13820000
   CSR_POS   = 3;                                                       13830000
 END;                                                                   13840000
                                                                        13850000
 IF RCBM29I.ST_SELF = CSR_HELP                                          13860000
  | RCBM29I.ST_SELF = CSR_EOF THEN                                      13870000
 DO;                                                                    13880000
   CSR_POS   = 4;                                                       13890000
 END;                                                                   13900000
                                                                        13910000
 IF RCBM29I.SLC_SELF = CSR_HELP                                         13920000
  | RCBM29I.SLC_SELF = CSR_EOF THEN                                     13930000
 DO;                                                                    13940000
   CSR_POS   = 5;                                                       13950000
 END;                                                                   13960000
                                                                        13970000
 IF RCBM29I.COUNTRY_NUMBERF = CSR_HELP                                  13980000
  | RCBM29I.COUNTRY_NUMBERF = CSR_EOF THEN                              13990000
 DO;                                                                    14000000
   CSR_POS   = 12;                                                      14010000
 END;                                                                   14020000
                                                                        14030000
 IF HELP_FLAG = FALSE THEN                                              14040000
 DO;                                                                    14050000
   EXEC CICS SEND                                                       14060000
      MAP('RCBH29')                                                     14070000
      MAPSET('RCBM29')                                                  14080000
      FREEKB                                                            14090000
      ERASE;                                                            14100000
 END;                                                                   14110000
                                                                        14120000
                                                                        14130000
0EXEC CICS RETURN                                                       14140000
    TRANSID('RC29')                                                     14150000
    COMMAREA(COMMAREA)                                                  14160000
    LENGTH(CSTG(COMMAREA))                                              14170000
    RESP(RESPONSE)                                                      14180000
    RESP2(CODE_EXPLAIN);                                                14190000
                                                                        14200000
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 14210000
    WHEN(DFHRESP(NORMAL));                                              14220000
    WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */ 14230000
                                                                        14240000
    DO;                                                                 14250000
      COMMAREA_LENGTH = EIBCALEN;                                       14260000
      EXEC CICS RETURN                                                  14270000
         TRANSID('RC29')                                                14280000
         COMMAREA(COMMAREA)                                             14290000
         LENGTH(COMMAREA_LENGTH);                                       14300000
    END;                                                                14310000
                                                                        14320000
    OTHERWISE                                                           14330000
    DO;                                                                 14340000
      RCBM29O.MSG_LINEO = ERR_MESSAGE14;                                14350000
      CALL RCBC29M_SEND_MAP;                                            14360000
    END;                                                                14370000
 END;                                                                   14380000
                                                                        14390000
0END RCBC29M_HELP_MAP;                                                  14400000
1/*******************************************************************/  14410000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  14420000
 /*******************************************************************/  14430000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  14440000
  $DAIMOD (RCBC29M);                     /* MODULE TO BE COMPILED   */  14450000
0/*******************************************************************/  14460000
 /* END OF ABR BLOCK '                                              */  14470000
 /*******************************************************************/  14480000
0 END RCBC29M;                                                          14490000