 /* RCBC11P - PARAMETER TABLE SETUP                                  */ 00011028
 /********************************************************************/ 00020027
 /*                                                                  */ 00030027
 /* TRANSACTION CODE    : RC11                                       */ 00040027
 /*                                                                  */ 00050027
 /* PROGRAM NAME        : RCBC11M                                    */ 00060027
 /*                                                                  */ 00070027
 /* TYPE                : CICS/VS                                    */ 00080027
 /*                                                                  */ 00090027
 /* USED MAPSET         : RCBM11*                                    */ 00100027
 /*      MAP            : RCBM11*                                    */ 00110027
 /*                                                                  */ 00120027
 /*                                                                  */ 00130027
 /* DESCRIPTION         : _ PARAMETER TABLE SETUP                    */ 00140027
 /*                                                                  */ 00150027
 /* LINKED TRANSACTION  : - RC00                                     */ 00160027
 /*                                                                  */ 00170027
 /* MESSAGES            :                                            */ 00180027
 /*                                                                  */ 00190027
 /*                                                                  */ 00200027
 /*  MAINTENANCE LOG :                                               */ 00210027
 /*  ---------------                                                 */ 00220027
 /*                                                                  */ 00230027
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00240027
 /*  --------------------------------------------------------------  */ 00250027
 /*  2001-10-10 | RC01230      | CSP TO PL1/CICS CONVERSION          */ 00260027
 /*  2003-05-22 | RB01237      | HVP DATA HANDLING - CEREOLS         */ 00270027
 /*  2003-07-08 | RB01238      | ER-HUB EXTRACT                      */ 00280027
 /*  2004/03/24 | RB01261      | MAKE COUNTRY NUMBER CHANGEABLE      */ 00290027
 /*  2004/03/24 | RB01263      | MINOR CICS CHANGES                  */ 00300027
 /*  2004/10/02 | RB01249      | CUSTOMER ENGINEERING OU MISMATCH    */ 00310027
 /*  2008/05/20 | RB01290      | ACCEPT CONTRACTS ON INTERNAL        */ 00320027
 /*             |              | MACHINES                            */ 00330027
 /*                                                                  */ 00340027
 /********************************************************************/ 00350027
1RCBC11M: PROC(COMMPTR)                                                 00360027
          OPTIONS (MAIN)                                                00370027
          REORDER;                                                      00380027
0/********************************************************************/ 00390027
 /*  EXTERNAL ENTRIES                                                */ 00400027
 /********************************************************************/ 00410027
                                                                        00420027
0DCL PLIXOPT   VAR  CHAR (256)                                          00430027
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;            00440027
                                                                        00450027
 DCL RCB004N ENTRY EXTERNAL;                                            00460027
0/********************************************************************/ 00470027
 /*  BMS RELATED CONSTANTS                                           */ 00480027
 /********************************************************************/ 00490027
 %INCLUDE DFHBMSCA;                                                     00500027
0/********************************************************************/ 00510027
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00520027
 /********************************************************************/ 00530027
 %INCLUDE DFHAID;                                                       00540027
1/********************************************************************/ 00550027
 /*  COMMUNICATION AREA                                              */ 00560027
 /********************************************************************/ 00570027
     %INCLUDE (RCBCP2S);                                                00580027
     %INCLUDE (RCBCHDS);,                                               00590027
     %INCLUDE (RCBC00S);,                                               00600027
     %INCLUDE (RCBC11S);;                                               00610027
1/********************************************************************/ 00620027
 /*  DATE WORK AREA                                                  */ 00630027
 /********************************************************************/ 00640027
 DCL 1 DATE_AREA,                                                       00650027
     %INCLUDE (RCBZ03S);;                                               00660027
0/********************************************************************/ 00670027
 /*  MAP STRUCTURES                                                  */ 00680027
 /********************************************************************/ 00690027
 %INCLUDE (RCBM11);                                                     00700027
0/********************************************************************/ 00710027
 /*  DB2 STRUCTURES                                                  */ 00720027
 /********************************************************************/ 00730027
 DCL 1 RCBV0505,                                                        00740027
     %INCLUDE (RCB505S);;                                               00750027
0/********************************************************************/ 00760027
 /*  RETURN CODES                                                    */ 00770027
 /********************************************************************/ 00780027
 DCL RESPONSE     FIXED BINARY(31) INIT(0);    /*RETURN CODE         */ 00790027
 DCL CODE_EXPLAIN FIXED BINARY(31) INIT(0);    /*RETURN CODE EXPLAIN */ 00800027
-/********************************************************************/ 00810027
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 00820027
 /********************************************************************/ 00830027
  EXEC SQL  WHENEVER NOT FOUND  CONTINUE;                               00840027
  EXEC SQL  WHENEVER SQLWARNING CONTINUE;                               00850027
  EXEC SQL  WHENEVER SQLERROR   CONTINUE;                               00860027
-/********************************************************************/ 00870027
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 00880027
 /********************************************************************/ 00890027
  EXEC SQL INCLUDE SQLCA;                                               00900027
0/********************************************************************/ 00910027
 /*  WORKING DECLARATIONS                                            */ 00920027
 /********************************************************************/ 00930027
 DCL PF5_FLAG         BIT(1) INIT('0'B);                                00940027
 DCL T040_FLAG        BIT(1) INIT('0'B);                                00950027
 DCL DATE_ERROR       BIT(1) INIT('0'B);                                00960027
 DCL ERROR_FLAG       BIT(1) INIT('0'B);                                00970027
 DCL SECOND_FLAG      BIT(1) INIT('0'B);                                00980027
 DCL ALPHN            CHAR(36)                                          00990027
                       INIT('0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ');    01000027
 DCL ALPHANUM         CHAR(37)                                          01010027
                       INIT(' 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ');   01020027
 DCL ALPHA            CHAR(26)                                          01030027
                       INIT('ABCDEFGHIJKLMNOPQRSTUVWXYZ');              01040027
 DCL NUMER            CHAR(10)                                          01050027
                       INIT('0123456789');                              01060027
 DCL NUMB             CHAR(11)                                          01070027
                       INIT('0123456789 ');                             01080027
 DCL STLIST           CHAR(39)                                          01090027
                       INIT(' 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ=+'); 01100027
 DCL WRK_HK_LINE      CHAR(8) INIT('');                                 01110027
 DCL WRK_ST_LINE      CHAR(36) INIT('');                                01120027
 DCL WRK_FEAT_LINE    CHAR(240) INIT('');                               01130027
 DCL WRK_QTY_IN       CHAR(9) INIT('');                                 01140027
 DCL WRK_QTY          CHAR(9) INIT('');                                 01150027
 DCL WRK_CNT          FIXED BIN(15) INIT(0);                            01160027
 DCL WRK_MSG          CHAR(75) INIT('');                                01170027
 DCL COMMAREA_STRING  CHAR(5984) INIT('');                              01180027
 DCL TOMLIST          CHAR (15) INIT ('01235ABCDEFGLP');/*SOC RB01290*/ 01190027
 DCL MSLIST           CHAR  (7) INIT ('1236789');                       01200027
                                                        /*EOC RB01290*/ 01210027
0/********************************************************************/ 01220027
 /*  MESSAGES                                                        */ 01230027
 /********************************************************************/ 01240027
 DCL ERR_MESSAGE3  CHAR(30) INIT('ERROR IN RECEIVING MAP ');            01250027
 DCL ERR_MESSAGE4  CHAR(30) INIT('INVREQ IN EXECUTING ASSIGNMENT');     01260027
 DCL ERR_MESSAGE14 CHAR(33) INIT('ERROR IN EXECUTING ASSIGNMENT    ');  01270027
 DCL ERR_MESSAGE30 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       01280027
 DCL ERR_O002 CHAR(13) INIT('Invalid Date ');             /* RB01290 */ 01290027
 DCL ERR_O004 CHAR(27) INIT('Invalid use of function key');             01300027
 DCL ERR_O022 CHAR(19) INIT('Press F5 to execute');                     01310027
 DCL ERR_O057 CHAR(70) INIT                                             01320027
 ('You are not authorized to use the function for this Country number');01330027
 DCL ERR_O072 CHAR(25) INIT('Country number is invalid');               01340027
 DCL ERR_O098 CHAR(23) INIT('Invalid command entered');                 01350027
 DCL ERR_O101 CHAR(33) INIT('Field must be filled in correctly');       01360027
 DCL ERR_O102 CHAR(51) INIT                                             01370027
  ('Not supported parameter, please correct and reenter');              01380027
 DCL ERR_O104 CHAR(62) INIT                                             01390027
  ('Unexpected system ERR_Or, please reenter or exit and try later');   01400027
 DCL ERR_O105 CHAR(65) INIT                                             01410027
  ('Parameter successful INSERTED/UPDATED enter new parameter or exit');01420027
 DCL ERR_O107 CHAR(48) INIT                                             01430027
  ('Make a selection and press ENTER or F3 to return');                 01440027
 DCL ERR_O109 CHAR(28) INIT('Parameter successful DELETED');            01450027
 DCL ERR_O110 CHAR(39) INIT('Row not found, please enter new or exit'); 01460027
                                                       /*SOC RB01290 */ 01470027
 DCL ERR_O215 CHAR(17) INIT('Invalid TOM Value');                       01480027
 DCL ERR_O216 CHAR(27) INIT                                             01490027
  ('Type Of Contract is mandate');                                      01500027
 DCL ERR_O217 CHAR(23) INIT('Invalid Machine Status ');                 01510027
                                                       /*EOC RB01290 */ 01520027
0/********************************************************************/ 01530027
 /*                 BUILD IN FUNCTIONS                               */ 01540027
 /********************************************************************/ 01550027
0DCL (LENGTH,                                                           01560027
      STRING,                                                           01570027
      SUBSTR,                                                           01580027
      VERIFY,                                                           01590027
      DECIMAL,                                                          01600027
      DATETIME,                                                         01610027
      CHAR,                                                             01620027
      NULL,                                                             01630027
      CSTG,                                                             01640027
      ADDR)   BUILTIN;                                                  01650027
1/********************************************************************/ 01660027
 /*                   M A I N   P R O C E S S I N G                  */ 01670027
 /*                                                                  */ 01680027
 /********************************************************************/ 01690027
                                                                        01700027
 IF EIBCALEN = 0 THEN                                                   01710027
 DO;                                                                    01720027
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   01730027
 END;                                                                   01740027
                                                                        01750027
 IF HEADER.NEXT = '99' THEN                                             01760027
 DO;                                                                    01770027
   CALL RCBC11M_INITIAL_LOAD;                                           01780027
   CALL RCBC11M_CLEAR_WORK;                                             01790027
   WRK_COUNTRY_NUMBER = HEADER.IOPUCTY;                                 01800027
   CALL RCBC11M_SEND_MAP;                                               01810027
 END;                                                                   01820027
                                                                        01830027
 IF REQUEST_ID = 'H' THEN                                               01840027
 DO;                                                                    01850027
   REQUEST_ID = '0';                                                    01860027
   CALL RCBC11M_FILL_MAP;                                               01870027
   CALL RCBC11M_GET_CSR_POS;                                            01880027
   CALL RCBC11M_SEND_MAP_CSR;                                           01890027
 END;                                                                   01900027
                                                                        01910027
 SELECT (EIBAID);                                                       01920027
   WHEN (DFHPF1,DFHPF13)                                                01930027
   DO;                                                                  01940027
     REQUEST_ID = 'H';                                                  01950027
     CALL RCBC11M_REC_MAPS;                                             01960027
     CALL RCBC11M_SAVE_MAP;                                             01970027
     CALL RCBC11M_HELP_MAP;                                             01980027
   END;                                                                 01990027
                                                                        02000027
   WHEN (DFHPF3,DFHPF15)                                                02010027
   DO;                                                                  02020027
     IF HEADER.NEXT = '00' THEN                                         02030027
     DO;                                                                02040027
       HEADER.NEXT = 'H1';                                              02050027
       EXEC CICS XCTL                                                   02060027
           PROGRAM('RCBC00P')                                           02070027
           COMMAREA(COMMAREA)                                           02080027
           LENGTH(CSTG(COMMAREA))                                       02090027
           RESP(RESPONSE)                                               02100027
           RESP2(CODE_EXPLAIN);                                         02110027
     END;                                                               02120027
     ELSE DO;                                                           02130027
       CALL RCBC11M_CLEAR_WORK;                                         02140027
       HEADER.NEXT = '00';                                              02150027
       CALL RCBC11M_FILL_MAP;                                           02160027
       CALL RCBC11M_SEND_MAP;                                           02170027
     END;                                                               02180027
   END;                                                                 02190027
                                                                        02200027
   WHEN (DFHPF5,DFHPF17)                                                02210027
   DO;                                                                  02220027
     PF5_FLAG = TRUE;                                                   02230027
     CALL RCBC11M_REC_MAP;                                              02240027
   END;                                                                 02250027
                                                                        02260027
   WHEN (DFHENTER)                                                      02270027
   DO;                                                                  02280027
     CALL RCBC11M_REC_MAP;                                              02290027
   END;                                                                 02300027
                                                                        02310027
   WHEN (DFHCLEAR)                                                      02320027
   DO;                                                                  02330027
     EXEC CICS SEND                                                     02340027
        CONTROL                                                         02350027
        ERASE                                                           02360027
        FREEKB;                                                         02370027
     EXEC CICS RETURN;                                                  02380027
   END;                                                                 02390027
                                                                        02400027
   OTHERWISE                        /* INVALID KEY ENTERED */           02410027
   DO;                                                                  02420027
     CALL RCBC11M_REC_MAPS;                                             02430027
     CALL RCBC11M_SAVE_MAP;                                             02440027
     CALL RCBC11M_FILL_MAP;                                             02450027
     CALL RCBC11M_SET_ERR;                                              02460027
     CALL RCBC11M_SEND_MAP_CSR;                                         02470027
   END;                                                                 02480027
                                                                        02490027
 END;                                                                   02500027
1/********************************************************************/ 02510027
 /*      INITIAL PROGRAM LOAD                                        */ 02520027
 /********************************************************************/ 02530027
0RCBC11M_INITIAL_LOAD : PROC;                                           02540027
                                                                        02550027
 RCBM110O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02560027
 RCBM111O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02570027
 RCBM112O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02580027
 RCBM113O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02590027
 RCBM114O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02600027
 RCBM115O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02610027
 RCBM116O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02620027
 RCBM117O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02630027
 RCBM118O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02640027
 RCBM119O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02650027
 RCBM11AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02660027
 RCBM11BO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02670027
 RCBM11CO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02680027
 RCBM11DO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02690027
 RCBM11EO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02700027
 RCBM11FO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02710027
 RCBM11GO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02720027
 RCBM11HO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02730027
 RCBM11IO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02740027
 RCBM11JO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02750027
 RCBM11KO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02760027
 RCBM11LO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         02770027
 RCBM11MO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;           /* RB01290 */ 02780027
                                                                        02790027
 HEADER.NEXT = '00';                                                    02800027
                                                                        02810027
0END RCBC11M_INITIAL_LOAD;                                              02820027
1/********************************************************************/ 02830027
 /*      RECEIVE MAP SELECTION                                       */ 02840027
 /********************************************************************/ 02850027
0RCBC11M_REC_MAP: PROC;                                                 02860027
                                                                        02870027
 SELECT (HEADER.NEXT);                                                  02880027
   WHEN ('00') CALL RCBC11M_REC_RCBM110;                                02890027
   WHEN ('05') CALL RCBC11M_REC_RCBM111;                                02900027
   WHEN ('07') CALL RCBC11M_REC_RCBM112;                                02910027
   WHEN ('08') CALL RCBC11M_REC_RCBM113;                                02920027
   WHEN ('09') CALL RCBC11M_REC_RCBM114;                                02930027
   WHEN ('10') CALL RCBC11M_REC_RCBM115;                                02940027
   WHEN ('11') CALL RCBC11M_REC_RCBM116;                                02950027
   WHEN ('12') CALL RCBC11M_REC_RCBM117;                                02960027
   WHEN ('13') CALL RCBC11M_REC_RCBM118;                                02970027
   WHEN ('15') CALL RCBC11M_REC_RCBM119;                                02980027
   WHEN ('16') CALL RCBC11M_REC_RCBM11A;                                02990027
   WHEN ('17') CALL RCBC11M_REC_RCBM11B;                                03000027
   WHEN ('18') CALL RCBC11M_REC_RCBM11C;                                03010027
   WHEN ('19') CALL RCBC11M_REC_RCBM11D;                                03020027
   WHEN ('22') CALL RCBC11M_REC_RCBM11E;                                03030027
   WHEN ('23') CALL RCBC11M_REC_RCBM11F;                                03040027
   WHEN ('25') CALL RCBC11M_REC_RCBM11G;                                03050027
   WHEN ('26') CALL RCBC11M_REC_RCBM11H;                                03060027
   WHEN ('36') CALL RCBC11M_REC_RCBM11I;                                03070027
   WHEN ('40') CALL RCBC11M_REC_RCBM11J;                                03080027
   WHEN ('50') CALL RCBC11M_REC_RCBM11K;                                03090027
   WHEN ('69') CALL RCBC11M_REC_RCBM11L;                                03100027
   WHEN ('70') CALL RCBC11M_REC_RCBM11M;                  /* RB01290 */ 03110027
 END;                                                                   03120027
                                                                        03130027
0END RCBC11M_REC_MAP;                                                   03140027
1/********************************************************************/ 03150027
 /*      RECEIVE MAP RCBM110 - BASE MAP                              */ 03160027
 /********************************************************************/ 03170027
0RCBC11M_REC_RCBM110: PROC;                                             03180027
                                                                        03190027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      03200027
    MAP('RCBM110')                                                      03210027
    MAPSET('RCBM11')                                                    03220027
    RESP(RESPONSE)                                                      03230027
    RESP2(CODE_EXPLAIN);                                                03240027
                                                                        03250027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      03260027
   WHEN(DFHRESP(NORMAL))                                                03270027
   DO;                                                                  03280027
     PIC_EXPLAIN          = '';                                         03290027
     WRK_PARAMETER_NUMBER = '';                                         03300027
                                                                        03310027
     IF RCBM110I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             03320027
     DO;                                                                03330027
       WRK_COUNTRY_NUMBER = RCBM110I.COUNTRY_NUMBERI;                   03340027
       EXEC CICS LINK                                                   03350027
          PROGRAM('RCBC99P')                                            03360027
          COMMAREA(COMMAREA)                                            03370027
          LENGTH(CSTG(COMMAREA));                                       03380027
                                                                        03390027
       IF OK_FLAG = FALSE THEN                                          03400027
       DO;                                                              03410027
         RCBM110O.MSG_LINEO       = ERR_O057;                           03420027
         RCBM110I.COUNTRY_NUMBERL = -1;                                 03430027
         RCBM110O.COUNTRY_NUMBERC = DFHRED;                             03440027
         WRK_COUNTRY_NUMBER       = '001';                              03450027
         CALL RCBC11M_SEND_MAP_CSR;                                     03460027
       END;                                                             03470027
                                                                        03480027
       IF CTY_OK_FLAG = FALSE THEN                                      03490027
       DO;                                                              03500027
         RCBM110O.MSG_LINEO       = ERR_O072;                           03510027
         RCBM110I.COUNTRY_NUMBERL = -1;                                 03520027
         RCBM110O.COUNTRY_NUMBERC = DFHRED;                             03530027
         WRK_COUNTRY_NUMBER       = '001';                              03540027
         CALL RCBC11M_SEND_MAP_CSR;                                     03550027
       END;                                                             03560027
     END;                                                               03570027
                                                                        03580027
  /* DO I = 1 TO 21;  */                                  /* RB01290 */ 03590027
     DO I = 1 TO 22;                                      /* RB01290 */ 03600027
       IF RCBM110I.SELL(I) = 0 THEN                                     03610027
         RCBM110O.SELO(I)  = '';                                        03620027
     END;                                                               03630027
                                                                        03640027
     IF RCBM110I.SELI(1) ¬= '' THEN                                     03650027
     DO;                                                                03660027
       HEADER.NEXT          = '05';                                     03670027
       WRK_PARAMETER_NUMBER = 'RCB005';                                 03680027
     END;                                                               03690027
                                                                        03700027
     IF RCBM110I.SELI(2) ¬= '' THEN                     /*SOC RB01290*/ 03710027
     DO;                                                                03720027
       HEADER.NEXT          = '70';                                     03730027
       WRK_PARAMETER_NUMBER = 'RCB070';                                 03740027
     END;                                               /*EOC RB01290*/ 03750027
                                                                        03760027
     IF RCBM110I.SELI(3) ¬= '' THEN                                     03770027
     DO;                                                                03780027
       HEADER.NEXT          = '07';                                     03790027
       WRK_PARAMETER_NUMBER = 'RCB007';                                 03800027
     END;                                                               03810027
                                                                        03820027
     IF RCBM110I.SELI(4) ¬= '' THEN                                     03830027
     DO;                                                                03840027
       HEADER.NEXT          = '08';                                     03850027
       WRK_PARAMETER_NUMBER = 'RCB008';                                 03860027
     END;                                                               03870027
                                                                        03880027
     IF RCBM110I.SELI(5) ¬= '' THEN                                     03890027
     DO;                                                                03900027
       HEADER.NEXT          = '09';                                     03910027
       WRK_PARAMETER_NUMBER = 'RCB009';                                 03920027
     END;                                                               03930027
                                                                        03940027
     IF RCBM110I.SELI(6) ¬= '' THEN                                     03950027
     DO;                                                                03960027
       HEADER.NEXT          = '10';                                     03970027
       WRK_PARAMETER_NUMBER = 'RCB010';                                 03980027
     END;                                                               03990027
                                                                        04000027
     IF RCBM110I.SELI(7) ¬= '' THEN                                     04010027
     DO;                                                                04020027
       HEADER.NEXT          = '11';                                     04030027
       WRK_PARAMETER_NUMBER = 'RCB011';                                 04040027
     END;                                                               04050027
                                                                        04060027
     IF RCBM110I.SELI(8) ¬= '' THEN                                     04070027
     DO;                                                                04080027
       HEADER.NEXT          = '12';                                     04090027
       WRK_PARAMETER_NUMBER = 'RCB012';                                 04100027
     END;                                                               04110027
                                                                        04120027
     IF RCBM110I.SELI(9) ¬= '' THEN                                     04130027
     DO;                                                                04140027
       HEADER.NEXT          = '13';                                     04150027
       WRK_PARAMETER_NUMBER = 'RCB013';                                 04160027
     END;                                                               04170027
                                                                        04180027
     IF RCBM110I.SELI(10) ¬= '' THEN                                    04190027
     DO;                                                                04200027
       HEADER.NEXT          = '15';                                     04210027
       WRK_PARAMETER_NUMBER = 'RCB015';                                 04220027
     END;                                                               04230027
                                                                        04240027
     IF RCBM110I.SELI(11) ¬= '' THEN                                    04250027
     DO;                                                                04260027
       HEADER.NEXT          = '16';                                     04270027
       WRK_PARAMETER_NUMBER = 'RCB016';                                 04280027
     END;                                                               04290027
                                                                        04300027
     IF RCBM110I.SELI(12) ¬= '' THEN                                    04310027
     DO;                                                                04320027
       HEADER.NEXT          = '17';                                     04330027
       WRK_PARAMETER_NUMBER = 'RCB017';                                 04340027
     END;                                                               04350027
                                                                        04360027
     IF RCBM110I.SELI(13) ¬= '' THEN                                    04370027
     DO;                                                                04380027
       HEADER.NEXT          = '18';                                     04390027
       WRK_PARAMETER_NUMBER = 'RCB018';                                 04400027
     END;                                                               04410027
                                                                        04420027
     IF RCBM110I.SELI(14) ¬= '' THEN                                    04430027
     DO;                                                                04440027
       HEADER.NEXT          = '19';                                     04450027
       WRK_PARAMETER_NUMBER = 'RCB019';                                 04460027
     END;                                                               04470027
                                                                        04480027
     IF RCBM110I.SELI(15) ¬= '' THEN                                    04490027
     DO;                                                                04500027
       HEADER.NEXT          = '22';                                     04510027
       WRK_PARAMETER_NUMBER = 'RCB022';                                 04520027
     END;                                                               04530027
                                                                        04540027
     IF RCBM110I.SELI(16) ¬= '' THEN                                    04550027
     DO;                                                                04560027
       HEADER.NEXT          = '23';                                     04570027
       WRK_PARAMETER_NUMBER = 'RCB023';                                 04580027
     END;                                                               04590027
                                                                        04600027
     IF RCBM110I.SELI(17) ¬= '' THEN                                    04610027
     DO;                                                                04620027
       HEADER.NEXT          = '25';                                     04630027
       WRK_PARAMETER_NUMBER = 'RCB025';                                 04640027
     END;                                                               04650027
                                                                        04660027
     IF RCBM110I.SELI(18) ¬= '' THEN                                    04670027
     DO;                                                                04680027
       HEADER.NEXT          = '26';                                     04690027
       WRK_PARAMETER_NUMBER = 'RCB026';                                 04700027
     END;                                                               04710027
                                                                        04720027
     IF RCBM110I.SELI(19) ¬= '' THEN                                    04730027
     DO;                                                                04740027
       HEADER.NEXT          = '36';                                     04750027
       WRK_PARAMETER_NUMBER = 'RCB036';                                 04760027
     END;                                                               04770027
                                                                        04780027
     IF RCBM110I.SELI(20) ¬= '' THEN                                    04790027
     DO;                                                                04800027
       HEADER.NEXT          = '40';                                     04810027
       WRK_PARAMETER_NUMBER = 'RCB040';                                 04820027
     END;                                                               04830027
                                                                        04840027
     IF RCBM110I.SELI(21) ¬= '' THEN                                    04850027
     DO;                                                                04860027
       HEADER.NEXT          = '50';                                     04870027
       WRK_PARAMETER_NUMBER = 'RCB050';                                 04880027
     END;                                                               04890027
                                                                        04900027
     IF RCBM110I.SELI(22) ¬= '' THEN                                    04910027
     DO;                                                                04920027
       HEADER.NEXT          = '69';                                     04930027
       WRK_PARAMETER_NUMBER = 'RCB069';                                 04940027
     END;                                                               04950027
                                                                        04960027
                                                                        04970027
     IF WRK_PARAMETER_NUMBER = '' THEN                                  04980027
     DO;                                                                04990027
       RCBM110O.MSG_LINEO = ERR_O107;                                   05000027
       CALL RCBC11M_SEND_MAP;                                           05010027
     END;                                                               05020027
   END;                                                                 05030027
                                                                        05040027
   OTHERWISE                                                            05050027
   DO;                                                                  05060027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3;                                 05070027
     CALL RCBC11M_SEND_MAP;                                             05080027
   END;                                                                 05090027
 END;                                                                   05100027
                                                                        05110027
 CALL RCBC11M_FILL_MAP;                                                 05120027
 CALL RCBC11M_SEND_MAP;                                                 05130027
                                                                        05140027
0END RCBC11M_REC_RCBM110;                                               05150027
1/********************************************************************/ 05160027
 /*      RECEIVE MAP RCBM111 - RCB005                                */ 05170027
 /********************************************************************/ 05180027
0RCBC11M_REC_RCBM111 : PROC;                                            05190027
                                                                        05200027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      05210027
    MAP('RCBM111')                                                      05220027
    MAPSET('RCBM11')                                                    05230027
    RESP(RESPONSE)                                                      05240027
    RESP2(CODE_EXPLAIN);                                                05250027
                                                                        05260027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      05270027
   WHEN(DFHRESP(NORMAL))                                                05280027
   DO;                                                                  05290027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        05300027
     ERROR_FLAG = FALSE;                                                05310027
                                                                        05320027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM111I.PARAMETER_EFF_DATEI)) THEN      05330027
     DO;                                                                05340027
       RCBM111I.PARAMETER_EFF_DATEL = -1;                               05350027
       RCBM111O.PARAMETER_EFF_DATEC = DFHRED;                           05360027
       RCBM111O.MSG_LINEO           = ERR_O101;                         05370027
       ERROR_FLAG = TRUE;                                               05380027
     END;                                                               05390027
                                                                        05400027
     WRK_PARAMETER_EFF_DATE = RCBM111I.PARAMETER_EFF_DATEI;             05410027
                                                                        05420027
     IF RCBM111I.PI_TO_CEREOLSI ¬= 'Y'                                  05430027
      & RCBM111I.PI_TO_CEREOLSI ¬= 'N' THEN                             05440027
     DO;                                                                05450027
       RCBM111I.PI_TO_CEREOLSL = -1;                                    05460027
       RCBM111O.PI_TO_CEREOLSC = DFHRED;                                05470027
       RCBM111O.MSG_LINEO  = ERR_O101;                                  05480027
       ERROR_FLAG = TRUE;                                               05490027
     END;                                                               05500027
                                                                        05510027
     WRK_PI_TO_CEREOLS = RCBM111I.PI_TO_CEREOLSI;                       05520027
                                                                        05530027
     IF RCBM111I.PI_TO_BMTI ¬= 'Y'                                      05540027
      & RCBM111I.PI_TO_BMTI ¬= 'N' THEN                                 05550027
     DO;                                                                05560027
       RCBM111I.PI_TO_BMTL = -1;                                        05570027
       RCBM111O.PI_TO_BMTC = DFHRED;                                    05580027
       RCBM111O.MSG_LINEO  = ERR_O101;                                  05590027
       ERROR_FLAG = TRUE;                                               05600027
     END;                                                               05610027
                                                                        05620027
     WRK_PI_TO_BMT = RCBM111I.PI_TO_BMTI;                               05630027
                                                                        05640027
     IF VERIFY(RCBM111I.PI_TO_RCMSI, 'YN') ¬= 0 THEN                    05650027
     DO;                                                                05660027
       RCBM111I.PI_TO_RCMSL = -1;                                       05670027
       RCBM111O.PI_TO_RCMSC = DFHRED;                                   05680027
       RCBM111O.MSG_LINEO   = ERR_O101;                                 05690027
       ERROR_FLAG = TRUE;                                               05700027
     END;                                                               05710027
                                                                        05720027
     WRK_PI_TO_RCMS = RCBM111I.PI_TO_RCMSI;                             05730027
                                                                        05740027
     IF RCBM111I.HOR_DATE_FUTL = 0 THEN                                 05750027
       RCBM111O.HOR_DATE_FUTO  = '';                                    05760027
                                                                        05770027
     WRK_QTY_IN = RCBM111I.HOR_DATE_FUTI;                               05780027
     WRK_CNT = 3;                                                       05790027
     CALL RCBC11M_VALID_QTY;                                            05800027
                                                                        05810027
     IF OK_FLAG = FALSE THEN                                            05820027
     DO;                                                                05830027
       RCBM111I.HOR_DATE_FUTL = -1;                                     05840027
       RCBM111O.HOR_DATE_FUTC = DFHRED;                                 05850027
       RCBM111O.MSG_LINEO     = ERR_O101;                               05860027
       ERROR_FLAG = TRUE;                                               05870027
     END;                                                               05880027
                                                                        05890027
     RCBM111O.HOR_DATE_FUTO = WRK_QTY_IN;                               05900027
     WRK_HOR_DATE_FUT       = RCBM111I.HOR_DATE_FUTI;                   05910027
                                                                        05920027
     IF RCBM111I.RET_PERIOD_HISTL = 0 THEN                              05930027
       RCBM111O.RET_PERIOD_HISTO  = '';                                 05940027
                                                                        05950027
     WRK_QTY_IN = RCBM111I.RET_PERIOD_HISTI;                            05960027
     WRK_CNT = 3;                                                       05970027
     CALL RCBC11M_VALID_QTY;                                            05980027
                                                                        05990027
     IF OK_FLAG = FALSE THEN                                            06000027
     DO;                                                                06010027
       RCBM111I.RET_PERIOD_HISTL = -1;                                  06020027
       RCBM111O.RET_PERIOD_HISTC = DFHRED;                              06030027
       RCBM111O.MSG_LINEO        = ERR_O101;                            06040027
       ERROR_FLAG = TRUE;                                               06050027
     END;                                                               06060027
                                                                        06070027
     RCBM111O.RET_PERIOD_HISTO = WRK_QTY_IN;                            06080027
     WRK_RET_PERIOD_HIST       = RCBM111I.RET_PERIOD_HISTI;             06090027
                                                                        06100027
     IF VERIFY(RCBM111I.ADDRESS_RESI,'01') ¬= 0 THEN                    06110027
     DO;                                                                06120027
       RCBM111I.ADDRESS_RESL = -1;                                      06130027
       RCBM111O.ADDRESS_RESC = DFHRED;                                  06140027
       RCBM111O.MSG_LINEO    = ERR_O101;                                06150027
       ERROR_FLAG = TRUE;                                               06160027
     END;                                                               06170027
                                                                        06180027
     WRK_ADDRESS_RES = RCBM111I.ADDRESS_RESI;                           06190027
                                                                        06200027
     IF VERIFY(RCBM111I.CU_EXTR_VOLUMEI,'01') ¬= 0 THEN                 06210027
     DO;                                                                06220027
       RCBM111I.CU_EXTR_VOLUMEL = -1;                                   06230027
       RCBM111O.CU_EXTR_VOLUMEC = DFHRED;                               06240027
       RCBM111O.MSG_LINEO       = ERR_O101;                             06250027
       ERROR_FLAG = TRUE;                                               06260027
     END;                                                               06270027
                                                                        06280027
     WRK_CU_EXTR_VOLUME = RCBM111I.CU_EXTR_VOLUMEI;                     06290027
                                                                        06300027
     IF VERIFY(RCBM111I.SW_EXTR_VOLUMEI,'AR') ¬= 0 THEN                 06310027
     DO;                                                                06320027
       RCBM111I.SW_EXTR_VOLUMEL = -1;                                   06330027
       RCBM111O.SW_EXTR_VOLUMEC = DFHRED;                               06340027
       RCBM111O.MSG_LINEO       = ERR_O101;                             06350027
       ERROR_FLAG = TRUE;                                               06360027
     END;                                                               06370027
                                                                        06380027
     WRK_SW_EXTR_VOLUME = RCBM111I.SW_EXTR_VOLUMEI;                     06390027
                                                                        06400027
     IF RCBM111I.DESCRIPTIONL = 0 THEN                                  06410027
     DO;                                                                06420027
       RCBM111O.DESCRIPTIONO = ' ';                                     06430027
     END;                                                               06440027
                                                                        06450027
     WRK_DESCRIPTION = RCBM111I.DESCRIPTIONI;                           06460027
                                                                        06470027
     IF VERIFY(SUBSTR(RCBM111I.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       06480027
      | VERIFY(SUBSTR(RCBM111I.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  06490027
     DO;                                                                06500027
       RCBM111I.PROGRAM_RUN_TYPEL = -1;                                 06510027
       RCBM111O.PROGRAM_RUN_TYPEC = DFHRED;                             06520027
       RCBM111O.MSG_LINEO         = ERR_O101;                           06530027
       ERROR_FLAG = TRUE;                                               06540027
     END;                                                               06550027
                                                                        06560027
     WRK_PROGRAM_RUN_TYPE = RCBM111I.PROGRAM_RUN_TYPEI;                 06570027
                                                                        06580027
     IF RCBM111I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             06590027
     DO;                                                                06600027
       WRK_COUNTRY_NUMBER = RCBM111I.COUNTRY_NUMBERI;                   06610027
       EXEC CICS LINK                                                   06620027
          PROGRAM('RCBC99P')                                            06630027
          COMMAREA(COMMAREA)                                            06640027
          LENGTH(CSTG(COMMAREA));                                       06650027
                                                                        06660027
       IF OK_FLAG = FALSE THEN                                          06670027
       DO;                                                              06680027
         RCBM111O.MSG_LINEO       = ERR_O057;                           06690027
         RCBM111I.COUNTRY_NUMBERL = -1;                                 06700027
         RCBM111O.COUNTRY_NUMBERC = DFHRED;                             06710027
         WRK_COUNTRY_NUMBER       = '001';                              06720027
         ERROR_FLAG = TRUE;                                             06730027
       END;                                                             06740027
                                                                        06750027
       IF CTY_OK_FLAG = FALSE THEN                                      06760027
       DO;                                                              06770027
         RCBM111O.MSG_LINEO       = ERR_O072;                           06780027
         RCBM111I.COUNTRY_NUMBERL = -1;                                 06790027
         RCBM111O.COUNTRY_NUMBERC = DFHRED;                             06800027
         WRK_COUNTRY_NUMBER       = '001';                              06810027
         ERROR_FLAG = TRUE;                                             06820027
       END;                                                             06830027
     END;                                                               06840027
                                                                        06850027
     IF VERIFY(RCBM111I.ACTIONI,'12') ¬= 0 THEN                         06860027
     DO;                                                                06870027
       RCBM111I.ACTIONL   = -1;                                         06880027
       RCBM111O.ACTIONC   = DFHRED;                                     06890027
       RCBM111O.MSG_LINEO = ERR_O101;                                   06900027
       ERROR_FLAG = TRUE;                                               06910027
     END;                                                               06920027
                                                                        06930027
     WRK_ACTION = RCBM111I.ACTIONI;                                     06940027
                                                                        06950027
     IF ERROR_FLAG = TRUE THEN                                          06960027
     DO;                                                                06970027
       CALL RCBC11M_SEND_MAP_CSR;                                       06980027
     END;                                                               06990027
                                                                        07000027
     IF PF5_FLAG = TRUE THEN                                            07010027
     DO;                                                                07020027
       WRK_RET_PERIOD_HIST_P       = WRK_RET_PERIOD_HIST;               07030027
       WRK_HOR_DATE_FUT_P          = WRK_HOR_DATE_FUT;                  07040027
       RCBV0505.PARAMETER_NUMBER   = 'RCB005';                          07050027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 07060027
                                  || WRK_PROGRAM_RUN_TYPE;              07070027
                                                                        07080027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   07090027
       RCBV0505.PARAMETER_VALUE    = WRK_SW_EXTR_VOLUME                 07100027
                                  || WRK_CU_EXTR_VOLUME                 07110027
                                  || WRK_ADDRESS_RES                    07120027
                                  || WRK_RET_PERIOD_HIST_P              07130027
                                  || WRK_HOR_DATE_FUT_P                 07140027
                                  || WRK_PI_TO_RCMS                     07150027
                                  || WRK_PI_TO_BMT                      07160027
                                  || WRK_PI_TO_CEREOLS;                 07170027
                                                                        07180027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            07190027
                                                                        07200027
       CALL RCBC11M_UPD_T505;                                           07210027
     END;                                                               07220027
     ELSE                                                               07230027
     DO;                                                                07240027
       WRK_MSG = ERR_O022;                                              07250027
       CALL RCBC11M_FILL_MAP;                                           07260027
       CALL RCBC11M_SEND_MAP;                                           07270027
     END;                                                               07280027
   END;                                                                 07290027
                                                                        07300027
   OTHERWISE                                                            07310027
   DO;                                                                  07320027
     HEADER.NEXT = '00';                                                07330027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM111';                   07340027
     CALL RCBC11M_SEND_MAP_CSR;                                         07350027
   END;                                                                 07360027
 END;                                                                   07370027
                                                                        07380027
0END RCBC11M_REC_RCBM111;                                               07390027
1/********************************************************************/ 07400027
 /*      RECEIVE MAP RCBM112 - RCB007                                */ 07410027
 /********************************************************************/ 07420027
0RCBC11M_REC_RCBM112 : PROC;                                            07430027
                                                                        07440027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      07450027
    MAP('RCBM112')                                                      07460027
    MAPSET('RCBM11')                                                    07470027
    RESP(RESPONSE)                                                      07480027
    RESP2(CODE_EXPLAIN);                                                07490027
                                                                        07500027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      07510027
   WHEN(DFHRESP(NORMAL))                                                07520027
   DO;                                                                  07530027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        07540027
     ERROR_FLAG = FALSE;                                                07550027
                                                                        07560027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM112I.PARAMETER_EFF_DATEI)) THEN      07570027
     DO;                                                                07580027
       RCBM112I.PARAMETER_EFF_DATEL = -1;                               07590027
       RCBM112O.PARAMETER_EFF_DATEC = DFHRED;                           07600027
       RCBM112O.MSG_LINEO           = ERR_O101;                         07610027
       ERROR_FLAG = TRUE;                                               07620027
     END;                                                               07630027
                                                                        07640027
     WRK_PARAMETER_EFF_DATE = RCBM112I.PARAMETER_EFF_DATEI;             07650027
                                                                        07660027
     IF RCBM112I.MAX_REC_AGE_DIFFL = 0 THEN                             07670027
       RCBM112O.MAX_REC_AGE_DIFFO  = '';                                07680027
                                                                        07690027
     WRK_QTY_IN = RCBM112I.MAX_REC_AGE_DIFFI;                           07700027
     WRK_CNT = 5;                                                       07710027
     CALL RCBC11M_VALID_QTY;                                            07720027
                                                                        07730027
     IF OK_FLAG = FALSE THEN                                            07740027
     DO;                                                                07750027
       RCBM112I.MAX_REC_AGE_DIFFL = -1;                                 07760027
       RCBM112O.MAX_REC_AGE_DIFFC = DFHRED;                             07770027
       RCBM112O.MSG_LINEO         = ERR_O101;                           07780027
       ERROR_FLAG = TRUE;                                               07790027
     END;                                                               07800027
                                                                        07810027
     RCBM112O.MAX_REC_AGE_DIFFO = WRK_QTY_IN;                           07820027
     WRK_MAX_REC_AGE_DIFF      = RCBM112I.MAX_REC_AGE_DIFFI;            07830027
                                                                        07840027
     IF VERIFY(RCBM112I.ADDR_LIN_INDI,'YN') ¬= 0 THEN                   07850027
     DO;                                                                07860027
       RCBM112I.ADDR_LIN_INDL = -1;                                     07870027
       RCBM112O.ADDR_LIN_INDC = DFHRED;                                 07880027
       RCBM112O.MSG_LINEO     = ERR_O101;                               07890027
       ERROR_FLAG = TRUE;                                               07900027
     END;                                                               07910027
                                                                        07920027
     WRK_ADDR_LIN_IND = RCBM112I.ADDR_LIN_INDI;                         07930027
                                                                        07940027
     IF RCBM112I.DESCRIPTIONL = 0 THEN                                  07950027
     DO;                                                                07960027
       RCBM112O.DESCRIPTIONO = ' ';                                     07970027
     END;                                                               07980027
                                                                        07990027
     WRK_DESCRIPTION = RCBM112I.DESCRIPTIONI;                           08000027
                                                                        08010027
     IF VERIFY(SUBSTR(RCBM112I.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       08020027
      | VERIFY(SUBSTR(RCBM112I.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  08030027
     DO;                                                                08040027
       RCBM112I.PROGRAM_RUN_TYPEL = -1;                                 08050027
       RCBM112O.PROGRAM_RUN_TYPEC = DFHRED;                             08060027
       RCBM112O.MSG_LINEO         = ERR_O101;                           08070027
       ERROR_FLAG = TRUE;                                               08080027
     END;                                                               08090027
                                                                        08100027
     WRK_PROGRAM_RUN_TYPE = RCBM112I.PROGRAM_RUN_TYPEI;                 08110027
                                                                        08120027
     IF RCBM112I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             08130027
     DO;                                                                08140027
       WRK_COUNTRY_NUMBER = RCBM112I.COUNTRY_NUMBERI;                   08150027
       EXEC CICS LINK                                                   08160027
          PROGRAM('RCBC99P')                                            08170027
          COMMAREA(COMMAREA)                                            08180027
          LENGTH(CSTG(COMMAREA));                                       08190027
                                                                        08200027
       IF OK_FLAG = FALSE THEN                                          08210027
       DO;                                                              08220027
         RCBM112O.MSG_LINEO       = ERR_O057;                           08230027
         RCBM112I.COUNTRY_NUMBERL = -1;                                 08240027
         RCBM112O.COUNTRY_NUMBERC = DFHRED;                             08250027
         WRK_COUNTRY_NUMBER       = '001';                              08260027
         ERROR_FLAG = TRUE;                                             08270027
       END;                                                             08280027
                                                                        08290027
       IF CTY_OK_FLAG = FALSE THEN                                      08300027
       DO;                                                              08310027
         RCBM112O.MSG_LINEO       = ERR_O072;                           08320027
         RCBM112I.COUNTRY_NUMBERL = -1;                                 08330027
         RCBM112O.COUNTRY_NUMBERC = DFHRED;                             08340027
         WRK_COUNTRY_NUMBER       = '001';                              08350027
         ERROR_FLAG = TRUE;                                             08360027
       END;                                                             08370027
     END;                                                               08380027
                                                                        08390027
     IF VERIFY(RCBM112I.ACTIONI,'12') ¬= 0 THEN                         08400027
     DO;                                                                08410027
       RCBM112I.ACTIONL   = -1;                                         08420027
       RCBM112O.ACTIONC   = DFHRED;                                     08430027
       RCBM112O.MSG_LINEO = ERR_O101;                                   08440027
       ERROR_FLAG = TRUE;                                               08450027
     END;                                                               08460027
                                                                        08470027
     WRK_ACTION = RCBM112I.ACTIONI;                                     08480027
                                                                        08490027
     IF ERROR_FLAG = TRUE THEN                                          08500027
     DO;                                                                08510027
       CALL RCBC11M_SEND_MAP_CSR;                                       08520027
     END;                                                               08530027
                                                                        08540027
     IF PF5_FLAG = TRUE THEN                                            08550027
     DO;                                                                08560027
       WRK_MAX_REC_AGE_DIFF_P      = WRK_MAX_REC_AGE_DIFF;              08570027
       RCBV0505.PARAMETER_NUMBER   = 'RCB007';                          08580027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 08590027
                                  || WRK_PROGRAM_RUN_TYPE;              08600027
                                                                        08610027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   08620027
       RCBV0505.PARAMETER_VALUE    = WRK_ADDR_LIN_IND                   08630027
                                  || WRK_MAX_REC_AGE_DIFF_P;            08640027
                                                                        08650027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            08660027
                                                                        08670027
       CALL RCBC11M_UPD_T505;                                           08680027
     END;                                                               08690027
     ELSE                                                               08700027
     DO;                                                                08710027
       WRK_MSG = ERR_O022;                                              08720027
       CALL RCBC11M_FILL_MAP;                                           08730027
       CALL RCBC11M_SEND_MAP;                                           08740027
     END;                                                               08750027
   END;                                                                 08760027
                                                                        08770027
   OTHERWISE                                                            08780027
   DO;                                                                  08790027
     HEADER.NEXT = '00';                                                08800027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM112';                   08810027
     CALL RCBC11M_SEND_MAP;                                             08820027
   END;                                                                 08830027
 END;                                                                   08840027
                                                                        08850027
0END RCBC11M_REC_RCBM112;                                               08860027
1/********************************************************************/ 08870027
 /*      RECEIVE MAP RCBM113 - RCB008                                */ 08880027
 /********************************************************************/ 08890027
0RCBC11M_REC_RCBM113 : PROC;                                            08900027
                                                                        08910027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      08920027
    MAP('RCBM113')                                                      08930027
    MAPSET('RCBM11')                                                    08940027
    RESP(RESPONSE)                                                      08950027
    RESP2(CODE_EXPLAIN);                                                08960027
                                                                        08970027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      08980027
   WHEN(DFHRESP(NORMAL))                                                08990027
   DO;                                                                  09000027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        09010027
     ERROR_FLAG = FALSE;                                                09020027
                                                                        09030027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM113I.PARAMETER_EFF_DATEI)) THEN      09040027
     DO;                                                                09050027
       RCBM113I.PARAMETER_EFF_DATEL = -1;                               09060027
       RCBM113O.PARAMETER_EFF_DATEC = DFHRED;                           09070027
       RCBM113O.MSG_LINEO           = ERR_O101;                         09080027
       ERROR_FLAG = TRUE;                                               09090027
     END;                                                               09100027
                                                                        09110027
     WRK_PARAMETER_EFF_DATE = RCBM113I.PARAMETER_EFF_DATEI;             09120027
                                                                        09130027
     IF VERIFY(RCBM113I.FEATURE_STORE_INDI, '01') ¬= 0 THEN             09140027
     DO;                                                                09150027
       RCBM113I.FEATURE_STORE_INDL = -1;                                09160027
       RCBM113O.FEATURE_STORE_INDC = DFHRED;                            09170027
       RCBM113O.MSG_LINEO          = ERR_O101;                          09180027
       ERROR_FLAG = TRUE;                                               09190027
     END;                                                               09200027
                                                                        09210027
     WRK_FEATURE_STORE_IND  = RCBM113I.FEATURE_STORE_INDI;              09220027
                                                                        09230027
     IF RCBM113I.DESCRIPTIONL = 0 THEN                                  09240027
     DO;                                                                09250027
       RCBM113O.DESCRIPTIONO = ' ';                                     09260027
     END;                                                               09270027
                                                                        09280027
     WRK_DESCRIPTION = RCBM113I.DESCRIPTIONI;                           09290027
                                                                        09300027
     IF RCBM113I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             09310027
     DO;                                                                09320027
       WRK_COUNTRY_NUMBER = RCBM113I.COUNTRY_NUMBERI;                   09330027
       EXEC CICS LINK                                                   09340027
          PROGRAM('RCBC99P')                                            09350027
          COMMAREA(COMMAREA)                                            09360027
          LENGTH(CSTG(COMMAREA));                                       09370027
                                                                        09380027
       IF OK_FLAG = FALSE THEN                                          09390027
       DO;                                                              09400027
         RCBM113O.MSG_LINEO       = ERR_O057;                           09410027
         RCBM113I.COUNTRY_NUMBERL = -1;                                 09420027
         RCBM113O.COUNTRY_NUMBERC = DFHRED;                             09430027
         WRK_COUNTRY_NUMBER       = '001';                              09440027
         ERROR_FLAG = TRUE;                                             09450027
       END;                                                             09460027
                                                                        09470027
       IF CTY_OK_FLAG = FALSE THEN                                      09480027
       DO;                                                              09490027
         RCBM113O.MSG_LINEO       = ERR_O072;                           09500027
         RCBM113I.COUNTRY_NUMBERL = -1;                                 09510027
         RCBM113O.COUNTRY_NUMBERC = DFHRED;                             09520027
         WRK_COUNTRY_NUMBER       = '001';                              09530027
         ERROR_FLAG = TRUE;                                             09540027
       END;                                                             09550027
     END;                                                               09560027
                                                                        09570027
     IF VERIFY(RCBM113I.ACTIONI,'12') ¬= 0 THEN                         09580027
     DO;                                                                09590027
       RCBM113I.ACTIONL   = -1;                                         09600027
       RCBM113O.ACTIONC   = DFHRED;                                     09610027
       RCBM113O.MSG_LINEO = ERR_O101;                                   09620027
       ERROR_FLAG = TRUE;                                               09630027
     END;                                                               09640027
                                                                        09650027
     WRK_ACTION = RCBM113I.ACTIONI;                                     09660027
                                                                        09670027
     IF ERROR_FLAG = TRUE THEN                                          09680027
     DO;                                                                09690027
       CALL RCBC11M_SEND_MAP_CSR;                                       09700027
     END;                                                               09710027
                                                                        09720027
     IF PF5_FLAG = TRUE THEN                                            09730027
     DO;                                                                09740027
       RCBV0505.PARAMETER_NUMBER   = 'RCB008';                          09750027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                09760027
                                                                        09770027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   09780027
       RCBV0505.PARAMETER_VALUE    = WRK_FEATURE_STORE_IND;             09790027
                                                                        09800027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            09810027
                                                                        09820027
       CALL RCBC11M_UPD_T505;                                           09830027
     END;                                                               09840027
     ELSE                                                               09850027
     DO;                                                                09860027
       WRK_MSG = ERR_O022;                                              09870027
       CALL RCBC11M_FILL_MAP;                                           09880027
       CALL RCBC11M_SEND_MAP;                                           09890027
     END;                                                               09900027
   END;                                                                 09910027
                                                                        09920027
   OTHERWISE                                                            09930027
   DO;                                                                  09940027
     HEADER.NEXT = '00';                                                09950027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM113';                   09960027
     CALL RCBC11M_SEND_MAP;                                             09970027
   END;                                                                 09980027
 END;                                                                   09990027
                                                                        10000027
0END RCBC11M_REC_RCBM113;                                               10010027
1/********************************************************************/ 10020027
 /*      RECEIVE MAP RCBM114 - RCB009                                */ 10030027
 /********************************************************************/ 10040027
0RCBC11M_REC_RCBM114 : PROC;                                            10050027
                                                                        10060027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      10070027
    MAP('RCBM114')                                                      10080027
    MAPSET('RCBM11')                                                    10090027
    RESP(RESPONSE)                                                      10100027
    RESP2(CODE_EXPLAIN);                                                10110027
                                                                        10120027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      10130027
   WHEN(DFHRESP(NORMAL))                                                10140027
   DO;                                                                  10150027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        10160027
     ERROR_FLAG = FALSE;                                                10170027
                                                                        10180027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM114I.PARAMETER_EFF_DATEI)) THEN      10190027
     DO;                                                                10200027
       RCBM114I.PARAMETER_EFF_DATEL = -1;                               10210027
       RCBM114O.PARAMETER_EFF_DATEC = DFHRED;                           10220027
       RCBM114O.MSG_LINEO           = ERR_O101;                         10230027
       ERROR_FLAG = TRUE;                                               10240027
     END;                                                               10250027
                                                                        10260027
     WRK_PARAMETER_EFF_DATE = RCBM114I.PARAMETER_EFF_DATEI;             10270027
                                                                        10280027
     WRK_FEAT_LINE = '';                                                10290027
     J = 1;                                                             10300027
     DO I = 1 TO 40;                                                    10310027
       IF RCBM114I.FEATL(I) ¬= 0 THEN                                   10320027
       DO;                                                              10330027
         IF VERIFY(RCBM114I.FEATI(I),ALPHANUM) ¬= 0 THEN                10340027
         DO;                                                            10350027
           RCBM114I.FEATL(I)  = -1;                                     10360027
           RCBM114O.FEATC(I)  = DFHRED;                                 10370027
           RCBM114O.MSG_LINEO = ERR_O101;                               10380027
           ERROR_FLAG = TRUE;                                           10390027
         END;                                                           10400027
                                                                        10410027
         WRK_FEAT(I) = RCBM114I.FEATI(I);                               10420027
         SUBSTR(WRK_FEAT_LINE,J,6) = RCBM114I.FEATI(I);                 10430027
         J = J + 6;                                                     10440027
       END;                                                             10450027
     END;                                                               10460027
                                                                        10470027
     IF RCBM114I.DESCRIPTIONL = 0 THEN                                  10480027
     DO;                                                                10490027
       RCBM114O.DESCRIPTIONO = ' ';                                     10500027
     END;                                                               10510027
                                                                        10520027
     WRK_DESCRIPTION = RCBM114I.DESCRIPTIONI;                           10530027
                                                                        10540027
     IF RCBM114I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             10550027
     DO;                                                                10560027
       WRK_COUNTRY_NUMBER = RCBM114I.COUNTRY_NUMBERI;                   10570027
       EXEC CICS LINK                                                   10580027
          PROGRAM('RCBC99P')                                            10590027
          COMMAREA(COMMAREA)                                            10600027
          LENGTH(CSTG(COMMAREA));                                       10610027
                                                                        10620027
       IF OK_FLAG = FALSE THEN                                          10630027
       DO;                                                              10640027
         RCBM114O.MSG_LINEO       = ERR_O057;                           10650027
         RCBM114I.COUNTRY_NUMBERL = -1;                                 10660027
         RCBM114O.COUNTRY_NUMBERC = DFHRED;                             10670027
         WRK_COUNTRY_NUMBER       = '001';                              10680027
         ERROR_FLAG = TRUE;                                             10690027
       END;                                                             10700027
                                                                        10710027
       IF CTY_OK_FLAG = FALSE THEN                                      10720027
       DO;                                                              10730027
         RCBM114O.MSG_LINEO       = ERR_O072;                           10740027
         RCBM114I.COUNTRY_NUMBERL = -1;                                 10750027
         RCBM114O.COUNTRY_NUMBERC = DFHRED;                             10760027
         WRK_COUNTRY_NUMBER       = '001';                              10770027
         ERROR_FLAG = TRUE;                                             10780027
       END;                                                             10790027
     END;                                                               10800027
                                                                        10810027
     IF VERIFY(RCBM114I.ACTIONI,'12') ¬= 0 THEN                         10820027
     DO;                                                                10830027
       RCBM114I.ACTIONL   = -1;                                         10840027
       RCBM114O.ACTIONC   = DFHRED;                                     10850027
       RCBM114O.MSG_LINEO = ERR_O101;                                   10860027
       ERROR_FLAG = TRUE;                                               10870027
     END;                                                               10880027
                                                                        10890027
     WRK_ACTION = RCBM114I.ACTIONI;                                     10900027
                                                                        10910027
     IF ERROR_FLAG = TRUE THEN                                          10920027
     DO;                                                                10930027
       CALL RCBC11M_SEND_MAP_CSR;                                       10940027
     END;                                                               10950027
                                                                        10960027
     IF PF5_FLAG = TRUE THEN                                            10970027
     DO;                                                                10980027
       RCBV0505.PARAMETER_NUMBER   = 'RCB009';                          10990027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                11000027
                                                                        11010027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   11020027
       RCBV0505.PARAMETER_VALUE    = WRK_FEAT_LINE;                     11030027
                                                                        11040027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            11050027
                                                                        11060027
       CALL RCBC11M_UPD_T505;                                           11070027
     END;                                                               11080027
     ELSE                                                               11090027
     DO;                                                                11100027
       WRK_MSG = ERR_O022;                                              11110027
       CALL RCBC11M_FILL_MAP;                                           11120027
       CALL RCBC11M_SEND_MAP;                                           11130027
     END;                                                               11140027
   END;                                                                 11150027
                                                                        11160027
   OTHERWISE                                                            11170027
   DO;                                                                  11180027
     HEADER.NEXT = '00';                                                11190027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM114';                   11200027
     CALL RCBC11M_SEND_MAP;                                             11210027
   END;                                                                 11220027
 END;                                                                   11230027
                                                                        11240027
0END RCBC11M_REC_RCBM114;                                               11250027
1/********************************************************************/ 11260027
 /*      RECEIVE MAP RCBM115 - RCB010                                */ 11270027
 /********************************************************************/ 11280027
0RCBC11M_REC_RCBM115 : PROC;                                            11290027
                                                                        11300027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      11310027
    MAP('RCBM115')                                                      11320027
    MAPSET('RCBM11')                                                    11330027
    RESP(RESPONSE)                                                      11340027
    RESP2(CODE_EXPLAIN);                                                11350027
                                                                        11360027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      11370027
   WHEN(DFHRESP(NORMAL))                                                11380027
   DO;                                                                  11390027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        11400027
     ERROR_FLAG = FALSE;                                                11410027
                                                                        11420027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM115I.PARAMETER_EFF_DATEI)) THEN      11430027
     DO;                                                                11440027
       RCBM115I.PARAMETER_EFF_DATEL = -1;                               11450027
       RCBM115O.PARAMETER_EFF_DATEC = DFHRED;                           11460027
       RCBM115O.MSG_LINEO           = ERR_O101;                         11470027
       ERROR_FLAG = TRUE;                                               11480027
     END;                                                               11490027
                                                                        11500027
     WRK_PARAMETER_EFF_DATE = RCBM115I.PARAMETER_EFF_DATEI;             11510027
                                                                        11520027
     IF VERIFY(RCBM115I.EXTRACT_TYPEI,'FUIL') ¬= 0 THEN                 11530027
     DO;                                                                11540027
       RCBM115I.EXTRACT_TYPEL = -1;                                     11550027
       RCBM115O.EXTRACT_TYPEC = DFHRED;                                 11560027
       RCBM115O.MSG_LINEO     = ERR_O101;                               11570027
       ERROR_FLAG = TRUE;                                               11580027
     END;                                                               11590027
                                                                        11600027
     WRK_EXTRACT_TYPE = RCBM115I.EXTRACT_TYPEI;                         11610027
                                                                        11620027
     IF VERIFY(RCBM115I.RCMS_GROUP_IDI,NUMER) ¬= 0                      11630027
      | RCBM115I.RCMS_GROUP_IDI > '20' THEN                             11640027
     DO;                                                                11650027
       RCBM115I.RCMS_GROUP_IDL = -1;                                    11660027
       RCBM115O.RCMS_GROUP_IDC = DFHRED;                                11670027
       RCBM115O.MSG_LINEO      = ERR_O101;                              11680027
       ERROR_FLAG = TRUE;                                               11690027
     END;                                                               11700027
                                                                        11710027
     WRK_RCMS_GROUP_ID = RCBM115I.RCMS_GROUP_IDI;                       11720027
                                                                        11730027
     IF RCBM115I.DESCRIPTIONL = 0 THEN                                  11740027
     DO;                                                                11750027
       RCBM115O.DESCRIPTIONO = ' ';                                     11760027
     END;                                                               11770027
                                                                        11780027
     WRK_DESCRIPTION = RCBM115I.DESCRIPTIONI;                           11790027
                                                                        11800027
     IF VERIFY(SUBSTR(RCBM115I.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       11810027
      | VERIFY(SUBSTR(RCBM115I.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  11820027
     DO;                                                                11830027
       RCBM115I.PROGRAM_RUN_TYPEL = -1;                                 11840027
       RCBM115O.PROGRAM_RUN_TYPEC = DFHRED;                             11850027
       RCBM115O.MSG_LINEO         = ERR_O101;                           11860027
       ERROR_FLAG = TRUE;                                               11870027
     END;                                                               11880027
                                                                        11890027
     WRK_PROGRAM_RUN_TYPE = RCBM115I.PROGRAM_RUN_TYPEI;                 11900027
                                                                        11910027
     IF RCBM115I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             11920027
     DO;                                                                11930027
       WRK_COUNTRY_NUMBER = RCBM115I.COUNTRY_NUMBERI;                   11940027
       EXEC CICS LINK                                                   11950027
          PROGRAM('RCBC99P')                                            11960027
          COMMAREA(COMMAREA)                                            11970027
          LENGTH(CSTG(COMMAREA));                                       11980027
                                                                        11990027
       IF OK_FLAG = FALSE THEN                                          12000027
       DO;                                                              12010027
         RCBM115O.MSG_LINEO       = ERR_O057;                           12020027
         RCBM115I.COUNTRY_NUMBERL = -1;                                 12030027
         RCBM115O.COUNTRY_NUMBERC = DFHRED;                             12040027
         WRK_COUNTRY_NUMBER       = '001';                              12050027
         ERROR_FLAG = TRUE;                                             12060027
       END;                                                             12070027
                                                                        12080027
       IF CTY_OK_FLAG = FALSE THEN                                      12090027
       DO;                                                              12100027
         RCBM115O.MSG_LINEO       = ERR_O072;                           12110027
         RCBM115I.COUNTRY_NUMBERL = -1;                                 12120027
         RCBM115O.COUNTRY_NUMBERC = DFHRED;                             12130027
         WRK_COUNTRY_NUMBER       = '001';                              12140027
         ERROR_FLAG = TRUE;                                             12150027
       END;                                                             12160027
     END;                                                               12170027
                                                                        12180027
     IF VERIFY(RCBM115I.ACTIONI,'12') ¬= 0 THEN                         12190027
     DO;                                                                12200027
       RCBM115I.ACTIONL   = -1;                                         12210027
       RCBM115O.ACTIONC   = DFHRED;                                     12220027
       RCBM115O.MSG_LINEO = ERR_O101;                                   12230027
       ERROR_FLAG = TRUE;                                               12240027
     END;                                                               12250027
                                                                        12260027
     WRK_ACTION = RCBM115I.ACTIONI;                                     12270027
                                                                        12280027
     IF ERROR_FLAG = TRUE THEN                                          12290027
     DO;                                                                12300027
       CALL RCBC11M_SEND_MAP_CSR;                                       12310027
     END;                                                               12320027
                                                                        12330027
     IF PF5_FLAG = TRUE THEN                                            12340027
     DO;                                                                12350027
       RCBV0505.PARAMETER_NUMBER   = 'RCB010';                          12360027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 12370027
                                  || WRK_PROGRAM_RUN_TYPE               12380027
                                  || WRK_RCMS_GROUP_ID;                 12390027
                                                                        12400027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   12410027
       RCBV0505.PARAMETER_VALUE    = WRK_EXTRACT_TYPE;                  12420027
                                                                        12430027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            12440027
                                                                        12450027
       CALL RCBC11M_UPD_T505;                                           12460027
     END;                                                               12470027
     ELSE                                                               12480027
     DO;                                                                12490027
       WRK_MSG = ERR_O022;                                              12500027
       CALL RCBC11M_FILL_MAP;                                           12510027
       CALL RCBC11M_SEND_MAP;                                           12520027
     END;                                                               12530027
   END;                                                                 12540027
                                                                        12550027
   OTHERWISE                                                            12560027
   DO;                                                                  12570027
     HEADER.NEXT = '00';                                                12580027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM115';                   12590027
     CALL RCBC11M_SEND_MAP;                                             12600027
   END;                                                                 12610027
 END;                                                                   12620027
                                                                        12630027
0END RCBC11M_REC_RCBM115;                                               12640027
1/********************************************************************/ 12650027
 /*      RECEIVE MAP RCBM116 - RCB011                                */ 12660027
 /********************************************************************/ 12670027
0RCBC11M_REC_RCBM116 : PROC;                                            12680027
                                                                        12690027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      12700027
    MAP('RCBM116')                                                      12710027
    MAPSET('RCBM11')                                                    12720027
    RESP(RESPONSE)                                                      12730027
    RESP2(CODE_EXPLAIN);                                                12740027
                                                                        12750027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      12760027
   WHEN(DFHRESP(NORMAL))                                                12770027
   DO;                                                                  12780027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        12790027
     ERROR_FLAG = FALSE;                                                12800027
                                                                        12810027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM116I.PARAMETER_EFF_DATEI)) THEN      12820027
     DO;                                                                12830027
       RCBM116I.PARAMETER_EFF_DATEL = -1;                               12840027
       RCBM116O.PARAMETER_EFF_DATEC = DFHRED;                           12850027
       RCBM116O.MSG_LINEO           = ERR_O101;                         12860027
       ERROR_FLAG = TRUE;                                               12870027
     END;                                                               12880027
                                                                        12890027
     WRK_PARAMETER_EFF_DATE = RCBM116I.PARAMETER_EFF_DATEI;             12900027
                                                                        12910027
     IF VERIFY(RCBM116I.UPDATE_TYPEI,'DEF') ¬= 0 THEN                   12920027
     DO;                                                                12930027
       RCBM116I.UPDATE_TYPEL = -1;                                      12940027
       RCBM116O.UPDATE_TYPEC = DFHRED;                                  12950027
       RCBM116O.MSG_LINEO    = ERR_O101;                                12960027
       ERROR_FLAG = TRUE;                                               12970027
     END;                                                               12980027
                                                                        12990027
     WRK_UPDATE_TYPE = RCBM116I.UPDATE_TYPEI;                           13000027
                                                                        13010027
     IF VERIFY(RCBM116I.RCMS_GROUP_IDI,NUMER) ¬= 0                      13020027
       | RCBM116I.RCMS_GROUP_IDI > '20' THEN                            13030027
     DO;                                                                13040027
       RCBM116I.RCMS_GROUP_IDL = -1;                                    13050027
       RCBM116O.RCMS_GROUP_IDC = DFHRED;                                13060027
       RCBM116O.MSG_LINEO      = ERR_O101;                              13070027
       ERROR_FLAG = TRUE;                                               13080027
     END;                                                               13090027
                                                                        13100027
     WRK_RCMS_GROUP_ID = RCBM116I.RCMS_GROUP_IDI;                       13110027
                                                                        13120027
     IF RCBM116I.OU_CODEL = 0 THEN                                      13130027
     DO;                                                                13140027
       RCBM116O.OU_CODEO = ' ';                                         13150027
     END;                                                               13160027
                                                                        13170027
     WRK_OU_CODE = RCBM116I.OU_CODEI;                                   13180027
                                                                        13190027
     CALL RCBC11M_GET_T040;                                             13200027
     IF T040_FLAG = FALSE THEN                                          13210027
     DO;                                                                13220027
       RCBM116I.OU_CODEL  = -1;                                         13230027
       RCBM116O.OU_CODEC  = DFHRED;                                     13240027
       RCBM116O.MSG_LINEO = ERR_O101;                                   13250027
       ERROR_FLAG = TRUE;                                               13260027
     END;                                                               13270027
                                                                        13280027
     IF RCBM116I.DESCRIPTIONL = 0 THEN                                  13290027
     DO;                                                                13300027
       RCBM116O.DESCRIPTIONO = ' ';                                     13310027
     END;                                                               13320027
                                                                        13330027
     WRK_DESCRIPTION = RCBM116I.DESCRIPTIONI;                           13340027
                                                                        13350027
     IF VERIFY(SUBSTR(RCBM116I.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       13360027
      | VERIFY(SUBSTR(RCBM116I.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  13370027
     DO;                                                                13380027
       RCBM116I.PROGRAM_RUN_TYPEL = -1;                                 13390027
       RCBM116O.PROGRAM_RUN_TYPEC = DFHRED;                             13400027
       RCBM116O.MSG_LINEO         = ERR_O101;                           13410027
       ERROR_FLAG = TRUE;                                               13420027
     END;                                                               13430027
                                                                        13440027
     WRK_PROGRAM_RUN_TYPE = RCBM116I.PROGRAM_RUN_TYPEI;                 13450027
                                                                        13460027
     IF RCBM116I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             13470027
     DO;                                                                13480027
       WRK_COUNTRY_NUMBER = RCBM116I.COUNTRY_NUMBERI;                   13490027
       EXEC CICS LINK                                                   13500027
          PROGRAM('RCBC99P')                                            13510027
          COMMAREA(COMMAREA)                                            13520027
          LENGTH(CSTG(COMMAREA));                                       13530027
                                                                        13540027
       IF OK_FLAG = FALSE THEN                                          13550027
       DO;                                                              13560027
         RCBM116O.MSG_LINEO       = ERR_O057;                           13570027
         RCBM116I.COUNTRY_NUMBERL = -1;                                 13580027
         RCBM116O.COUNTRY_NUMBERC = DFHRED;                             13590027
         WRK_COUNTRY_NUMBER       = '001';                              13600027
         ERROR_FLAG = TRUE;                                             13610027
       END;                                                             13620027
                                                                        13630027
       IF CTY_OK_FLAG = FALSE THEN                                      13640027
       DO;                                                              13650027
         RCBM116O.MSG_LINEO       = ERR_O072;                           13660027
         RCBM116I.COUNTRY_NUMBERL = -1;                                 13670027
         RCBM116O.COUNTRY_NUMBERC = DFHRED;                             13680027
         WRK_COUNTRY_NUMBER       = '001';                              13690027
         ERROR_FLAG = TRUE;                                             13700027
       END;                                                             13710027
     END;                                                               13720027
                                                                        13730027
     IF VERIFY(RCBM116I.ACTIONI,'12') ¬= 0 THEN                         13740027
     DO;                                                                13750027
       RCBM116I.ACTIONL   = -1;                                         13760027
       RCBM116O.ACTIONC   = DFHRED;                                     13770027
       RCBM116O.MSG_LINEO = ERR_O101;                                   13780027
       ERROR_FLAG = TRUE;                                               13790027
     END;                                                               13800027
                                                                        13810027
     WRK_ACTION = RCBM116I.ACTIONI;                                     13820027
                                                                        13830027
     IF ERROR_FLAG = TRUE THEN                                          13840027
     DO;                                                                13850027
       CALL RCBC11M_SEND_MAP_CSR;                                       13860027
     END;                                                               13870027
                                                                        13880027
     IF PF5_FLAG = TRUE THEN                                            13890027
     DO;                                                                13900027
       RCBV0505.PARAMETER_NUMBER   = 'RCB011';                          13910027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 13920027
                                  || WRK_PROGRAM_RUN_TYPE               13930027
                                  || WRK_OU_CODE                        13940027
                                  || WRK_RCMS_GROUP_ID;                 13950027
                                                                        13960027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   13970027
       RCBV0505.PARAMETER_VALUE    = WRK_UPDATE_TYPE;                   13980027
                                                                        13990027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            14000027
                                                                        14010027
       CALL RCBC11M_UPD_T505;                                           14020027
     END;                                                               14030027
     ELSE                                                               14040027
     DO;                                                                14050027
       WRK_MSG = ERR_O022;                                              14060027
       CALL RCBC11M_FILL_MAP;                                           14070027
       CALL RCBC11M_SEND_MAP;                                           14080027
     END;                                                               14090027
   END;                                                                 14100027
                                                                        14110027
   OTHERWISE                                                            14120027
   DO;                                                                  14130027
     HEADER.NEXT = '00';                                                14140027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM116';                   14150027
     CALL RCBC11M_SEND_MAP;                                             14160027
   END;                                                                 14170027
 END;                                                                   14180027
                                                                        14190027
0END RCBC11M_REC_RCBM116;                                               14200027
1/********************************************************************/ 14210027
 /*      RECEIVE MAP RCBM117 - RCB012                                */ 14220027
 /********************************************************************/ 14230027
0RCBC11M_REC_RCBM117 : PROC;                                            14240027
                                                                        14250027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      14260027
    MAP('RCBM117')                                                      14270027
    MAPSET('RCBM11')                                                    14280027
    RESP(RESPONSE)                                                      14290027
    RESP2(CODE_EXPLAIN);                                                14300027
                                                                        14310027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      14320027
   WHEN(DFHRESP(NORMAL))                                                14330027
   DO;                                                                  14340027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        14350027
     ERROR_FLAG = FALSE;                                                14360027
                                                                        14370027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM117I.PARAMETER_EFF_DATEI)) THEN      14380027
     DO;                                                                14390027
       RCBM117I.PARAMETER_EFF_DATEL = -1;                               14400027
       RCBM117O.PARAMETER_EFF_DATEC = DFHRED;                           14410027
       RCBM117O.MSG_LINEO           = ERR_O101;                         14420027
       ERROR_FLAG = TRUE;                                               14430027
     END;                                                               14440027
                                                                        14450027
     WRK_PARAMETER_EFF_DATE = RCBM117I.PARAMETER_EFF_DATEI;             14460027
                                                                        14470027
     IF RCBM117I.CHECKPOINT_LIMITL = 0 THEN                             14480027
       RCBM117O.CHECKPOINT_LIMITO  = '';                                14490027
                                                                        14500027
     WRK_QTY_IN = RCBM117I.CHECKPOINT_LIMITI;                           14510027
     WRK_CNT = 9;                                                       14520027
     CALL RCBC11M_VALID_QTY;                                            14530027
                                                                        14540027
     IF OK_FLAG = FALSE THEN                                            14550027
     DO;                                                                14560027
       RCBM117I.CHECKPOINT_LIMITL = -1;                                 14570027
       RCBM117O.CHECKPOINT_LIMITC = DFHRED;                             14580027
       RCBM117O.MSG_LINEO         = ERR_O101;                           14590027
       ERROR_FLAG = TRUE;                                               14600027
     END;                                                               14610027
                                                                        14620027
     RCBM117O.CHECKPOINT_LIMITO = WRK_QTY_IN;                           14630027
     WRK_CHECKPOINT_LIMIT       = RCBM117I.CHECKPOINT_LIMITI;           14640027
                                                                        14650027
     IF RCBM117I.DESCRIPTIONL = 0 THEN                                  14660027
     DO;                                                                14670027
       RCBM117O.DESCRIPTIONO = ' ';                                     14680027
     END;                                                               14690027
                                                                        14700027
     WRK_DESCRIPTION = RCBM117I.DESCRIPTIONI;                           14710027
                                                                        14720027
     IF VERIFY(RCBM117I.PROGRAM_NAMEI, ALPHANUM) ¬= 0 THEN              14730027
     DO;                                                                14740027
       RCBM117I.PROGRAM_NAMEL = -1;                                     14750027
       RCBM117O.PROGRAM_NAMEC = DFHRED;                                 14760027
       RCBM117O.MSG_LINEO     = ERR_O101;                               14770027
       ERROR_FLAG = TRUE;                                               14780027
     END;                                                               14790027
                                                                        14800027
     WRK_PROGRAM_NAME = RCBM117I.PROGRAM_NAMEI;                         14810027
                                                                        14820027
     IF VERIFY(SUBSTR(RCBM117I.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       14830027
      | VERIFY(SUBSTR(RCBM117I.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  14840027
     DO;                                                                14850027
       RCBM117I.PROGRAM_RUN_TYPEL = -1;                                 14860027
       RCBM117O.PROGRAM_RUN_TYPEC = DFHRED;                             14870027
       RCBM117O.MSG_LINEO         = ERR_O101;                           14880027
       ERROR_FLAG = TRUE;                                               14890027
     END;                                                               14900027
                                                                        14910027
     WRK_PROGRAM_RUN_TYPE = RCBM117I.PROGRAM_RUN_TYPEI;                 14920027
                                                                        14930027
     IF RCBM117I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             14940027
     DO;                                                                14950027
       WRK_COUNTRY_NUMBER = RCBM117I.COUNTRY_NUMBERI;                   14960027
       EXEC CICS LINK                                                   14970027
          PROGRAM('RCBC99P')                                            14980027
          COMMAREA(COMMAREA)                                            14990027
          LENGTH(CSTG(COMMAREA));                                       15000027
                                                                        15010027
       IF OK_FLAG = FALSE THEN                                          15020027
       DO;                                                              15030027
         RCBM117O.MSG_LINEO       = ERR_O057;                           15040027
         RCBM117I.COUNTRY_NUMBERL = -1;                                 15050027
         RCBM117O.COUNTRY_NUMBERC = DFHRED;                             15060027
         WRK_COUNTRY_NUMBER       = '001';                              15070027
         ERROR_FLAG = TRUE;                                             15080027
       END;                                                             15090027
                                                                        15100027
       IF CTY_OK_FLAG = FALSE THEN                                      15110027
       DO;                                                              15120027
         RCBM117O.MSG_LINEO       = ERR_O072;                           15130027
         RCBM117I.COUNTRY_NUMBERL = -1;                                 15140027
         RCBM117O.COUNTRY_NUMBERC = DFHRED;                             15150027
         WRK_COUNTRY_NUMBER       = '001';                              15160027
         ERROR_FLAG = TRUE;                                             15170027
       END;                                                             15180027
     END;                                                               15190027
                                                                        15200027
     IF VERIFY(RCBM117I.ACTIONI,'12') ¬= 0 THEN                         15210027
     DO;                                                                15220027
       RCBM117I.ACTIONL   = -1;                                         15230027
       RCBM117O.ACTIONC   = DFHRED;                                     15240027
       RCBM117O.MSG_LINEO = ERR_O101;                                   15250027
       ERROR_FLAG = TRUE;                                               15260027
     END;                                                               15270027
                                                                        15280027
     WRK_ACTION = RCBM117I.ACTIONI;                                     15290027
                                                                        15300027
     IF ERROR_FLAG = TRUE THEN                                          15310027
     DO;                                                                15320027
       CALL RCBC11M_SEND_MAP_CSR;                                       15330027
     END;                                                               15340027
                                                                        15350027
     IF PF5_FLAG = TRUE THEN                                            15360027
     DO;                                                                15370027
       WRK_CHECKPOINT_LIMIT_P      = WRK_CHECKPOINT_LIMIT;              15380027
       RCBV0505.PARAMETER_NUMBER   = 'RCB012';                          15390027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 15400027
                                  || WRK_PROGRAM_RUN_TYPE               15410027
                                  || WRK_PROGRAM_NAME;                  15420027
                                                                        15430027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   15440027
       RCBV0505.PARAMETER_VALUE    = WRK_CHECKPOINT_LIMIT_P;            15450027
                                                                        15460027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            15470027
                                                                        15480027
       CALL RCBC11M_UPD_T505;                                           15490027
     END;                                                               15500027
     ELSE                                                               15510027
     DO;                                                                15520027
       WRK_MSG = ERR_O022;                                              15530027
       CALL RCBC11M_FILL_MAP;                                           15540027
       CALL RCBC11M_SEND_MAP;                                           15550027
     END;                                                               15560027
   END;                                                                 15570027
                                                                        15580027
   OTHERWISE                                                            15590027
   DO;                                                                  15600027
     HEADER.NEXT = '00';                                                15610027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM117';                   15620027
     CALL RCBC11M_SEND_MAP;                                             15630027
   END;                                                                 15640027
 END;                                                                   15650027
                                                                        15660027
0END RCBC11M_REC_RCBM117;                                               15670027
1/********************************************************************/ 15680027
 /*      RECEIVE MAP RCBM118 - RCB013                                */ 15690027
 /********************************************************************/ 15700027
0RCBC11M_REC_RCBM118 : PROC;                                            15710027
                                                                        15720027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      15730027
    MAP('RCBM118')                                                      15740027
    MAPSET('RCBM11')                                                    15750027
    RESP(RESPONSE)                                                      15760027
    RESP2(CODE_EXPLAIN);                                                15770027
                                                                        15780027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      15790027
   WHEN(DFHRESP(NORMAL))                                                15800027
   DO;                                                                  15810027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        15820027
     ERROR_FLAG = FALSE;                                                15830027
                                                                        15840027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM118I.PARAMETER_EFF_DATEI)) THEN      15850027
     DO;                                                                15860027
       RCBM118I.PARAMETER_EFF_DATEL = -1;                               15870027
       RCBM118O.PARAMETER_EFF_DATEC = DFHRED;                           15880027
       RCBM118O.MSG_LINEO           = ERR_O101;                         15890027
       ERROR_FLAG = TRUE;                                               15900027
     END;                                                               15910027
                                                                        15920027
     WRK_PARAMETER_EFF_DATE = RCBM118I.PARAMETER_EFF_DATEI;             15930027
                                                                        15940027
     IF VERIFY(RCBM118I.MAINT_SYSTEM_SWI,'CU') ¬= 0 THEN                15950027
     DO;                                                                15960027
       RCBM118I.MAINT_SYSTEM_SWL = -1;                                  15970027
       RCBM118O.MAINT_SYSTEM_SWC = DFHRED;                              15980027
       RCBM118O.MSG_LINEO        = ERR_O101;                            15990027
       ERROR_FLAG = TRUE;                                               16000027
     END;                                                               16010027
                                                                        16020027
     WRK_MAINT_SYSTEM_SW = RCBM118I.MAINT_SYSTEM_SWI;                   16030027
                                                                        16040027
     IF VERIFY(RCBM118I.MAINT_SYSTEM_HWI,'CU') ¬= 0 THEN                16050027
     DO;                                                                16060027
       RCBM118I.MAINT_SYSTEM_HWL = -1;                                  16070027
       RCBM118O.MAINT_SYSTEM_HWC = DFHRED;                              16080027
       RCBM118O.MSG_LINEO        = ERR_O101;                            16090027
       ERROR_FLAG = TRUE;                                               16100027
     END;                                                               16110027
                                                                        16120027
     WRK_MAINT_SYSTEM_HW = RCBM118I.MAINT_SYSTEM_HWI;                   16130027
                                                                        16140027
     IF RCBM118I.DESCRIPTIONL = 0 THEN                                  16150027
     DO;                                                                16160027
       RCBM118O.DESCRIPTIONO = ' ';                                     16170027
     END;                                                               16180027
                                                                        16190027
     WRK_DESCRIPTION = RCBM118I.DESCRIPTIONI;                           16200027
                                                                        16210027
     IF RCBM118I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             16220027
     DO;                                                                16230027
       WRK_COUNTRY_NUMBER = RCBM118I.COUNTRY_NUMBERI;                   16240027
       EXEC CICS LINK                                                   16250027
          PROGRAM('RCBC99P')                                            16260027
          COMMAREA(COMMAREA)                                            16270027
          LENGTH(CSTG(COMMAREA));                                       16280027
                                                                        16290027
       IF OK_FLAG = FALSE THEN                                          16300027
       DO;                                                              16310027
         RCBM118O.MSG_LINEO       = ERR_O057;                           16320027
         RCBM118I.COUNTRY_NUMBERL = -1;                                 16330027
         RCBM118O.COUNTRY_NUMBERC = DFHRED;                             16340027
         WRK_COUNTRY_NUMBER       = '001';                              16350027
         ERROR_FLAG = TRUE;                                             16360027
       END;                                                             16370027
                                                                        16380027
       IF CTY_OK_FLAG = FALSE THEN                                      16390027
       DO;                                                              16400027
         RCBM118O.MSG_LINEO       = ERR_O072;                           16410027
         RCBM118I.COUNTRY_NUMBERL = -1;                                 16420027
         RCBM118O.COUNTRY_NUMBERC = DFHRED;                             16430027
         WRK_COUNTRY_NUMBER       = '001';                              16440027
         ERROR_FLAG = TRUE;                                             16450027
       END;                                                             16460027
     END;                                                               16470027
                                                                        16480027
     IF VERIFY(RCBM118I.ACTIONI,'12') ¬= 0 THEN                         16490027
     DO;                                                                16500027
       RCBM118I.ACTIONL   = -1;                                         16510027
       RCBM118O.ACTIONC   = DFHRED;                                     16520027
       RCBM118O.MSG_LINEO = ERR_O101;                                   16530027
       ERROR_FLAG = TRUE;                                               16540027
     END;                                                               16550027
                                                                        16560027
     WRK_ACTION = RCBM118I.ACTIONI;                                     16570027
                                                                        16580027
     IF ERROR_FLAG = TRUE THEN                                          16590027
     DO;                                                                16600027
       CALL RCBC11M_SEND_MAP_CSR;                                       16610027
     END;                                                               16620027
                                                                        16630027
     IF PF5_FLAG = TRUE THEN                                            16640027
     DO;                                                                16650027
       RCBV0505.PARAMETER_NUMBER   = 'RCB013';                          16660027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                16670027
                                                                        16680027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   16690027
       RCBV0505.PARAMETER_VALUE    = WRK_MAINT_SYSTEM_HW                16700027
                                  || WRK_MAINT_SYSTEM_SW;               16710027
                                                                        16720027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            16730027
                                                                        16740027
       CALL RCBC11M_UPD_T505;                                           16750027
     END;                                                               16760027
     ELSE                                                               16770027
     DO;                                                                16780027
       WRK_MSG = ERR_O022;                                              16790027
       CALL RCBC11M_FILL_MAP;                                           16800027
       CALL RCBC11M_SEND_MAP;                                           16810027
     END;                                                               16820027
   END;                                                                 16830027
                                                                        16840027
   OTHERWISE                                                            16850027
   DO;                                                                  16860027
     HEADER.NEXT = '00';                                                16870027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM118';                   16880027
     CALL RCBC11M_SEND_MAP;                                             16890027
   END;                                                                 16900027
 END;                                                                   16910027
                                                                        16920027
0END RCBC11M_REC_RCBM118;                                               16930027
1/********************************************************************/ 16940027
 /*      RECEIVE MAP RCBM119 - RCB015                                */ 16950027
 /********************************************************************/ 16960027
0RCBC11M_REC_RCBM119 : PROC;                                            16970027
                                                                        16980027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      16990027
    MAP('RCBM119')                                                      17000027
    MAPSET('RCBM11')                                                    17010027
    RESP(RESPONSE)                                                      17020027
    RESP2(CODE_EXPLAIN);                                                17030027
                                                                        17040027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      17050027
   WHEN(DFHRESP(NORMAL))                                                17060027
   DO;                                                                  17070027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        17080027
     ERROR_FLAG = FALSE;                                                17090027
                                                                        17100027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM119I.PARAMETER_EFF_DATEI)) THEN      17110027
     DO;                                                                17120027
       RCBM119I.PARAMETER_EFF_DATEL = -1;                               17130027
       RCBM119O.PARAMETER_EFF_DATEC = DFHRED;                           17140027
       RCBM119O.MSG_LINEO           = ERR_O101;                         17150027
       ERROR_FLAG = TRUE;                                               17160027
     END;                                                               17170027
                                                                        17180027
     WRK_PARAMETER_EFF_DATE = RCBM119I.PARAMETER_EFF_DATEI;             17190027
                                                                        17200027
     IF VERIFY(RCBM119I.PEW_WED_INDI, 'YN') ¬= 0 THEN                   17210027
     DO;                                                                17220027
       RCBM119I.PEW_WED_INDL = -1;                                      17230027
       RCBM119O.PEW_WED_INDC = DFHRED;                                  17240027
       RCBM119O.MSG_LINEO     = ERR_O101;                               17250027
       ERROR_FLAG = TRUE;                                               17260027
     END;                                                               17270027
                                                                        17280027
     WRK_PEW_WED_IND = RCBM119I.PEW_WED_INDI;                           17290027
                                                                        17300027
     IF RCBM119I.DESCRIPTIONL = 0 THEN                                  17310027
     DO;                                                                17320027
       RCBM119O.DESCRIPTIONO = ' ';                                     17330027
     END;                                                               17340027
                                                                        17350027
     WRK_DESCRIPTION = RCBM119I.DESCRIPTIONI;                           17360027
                                                                        17370027
     IF VERIFY(SUBSTR(RCBM119I.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       17380027
      | VERIFY(SUBSTR(RCBM119I.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  17390027
     DO;                                                                17400027
       RCBM119I.PROGRAM_RUN_TYPEL = -1;                                 17410027
       RCBM119O.PROGRAM_RUN_TYPEC = DFHRED;                             17420027
       RCBM119O.MSG_LINEO         = ERR_O101;                           17430027
       ERROR_FLAG = TRUE;                                               17440027
     END;                                                               17450027
                                                                        17460027
     WRK_PROGRAM_RUN_TYPE = RCBM119I.PROGRAM_RUN_TYPEI;                 17470027
                                                                        17480027
     IF RCBM119I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             17490027
     DO;                                                                17500027
       WRK_COUNTRY_NUMBER = RCBM119I.COUNTRY_NUMBERI;                   17510027
       EXEC CICS LINK                                                   17520027
          PROGRAM('RCBC99P')                                            17530027
          COMMAREA(COMMAREA)                                            17540027
          LENGTH(CSTG(COMMAREA));                                       17550027
                                                                        17560027
       IF OK_FLAG = FALSE THEN                                          17570027
       DO;                                                              17580027
         RCBM119O.MSG_LINEO       = ERR_O057;                           17590027
         RCBM119I.COUNTRY_NUMBERL = -1;                                 17600027
         RCBM119O.COUNTRY_NUMBERC = DFHRED;                             17610027
         WRK_COUNTRY_NUMBER       = '001';                              17620027
         ERROR_FLAG = TRUE;                                             17630027
       END;                                                             17640027
                                                                        17650027
       IF CTY_OK_FLAG = FALSE THEN                                      17660027
       DO;                                                              17670027
         RCBM119O.MSG_LINEO       = ERR_O072;                           17680027
         RCBM119I.COUNTRY_NUMBERL = -1;                                 17690027
         RCBM119O.COUNTRY_NUMBERC = DFHRED;                             17700027
         WRK_COUNTRY_NUMBER       = '001';                              17710027
         ERROR_FLAG = TRUE;                                             17720027
       END;                                                             17730027
     END;                                                               17740027
                                                                        17750027
     IF VERIFY(RCBM119I.ACTIONI,'12') ¬= 0 THEN                         17760027
     DO;                                                                17770027
       RCBM119I.ACTIONL   = -1;                                         17780027
       RCBM119O.ACTIONC   = DFHRED;                                     17790027
       RCBM119O.MSG_LINEO = ERR_O101;                                   17800027
       ERROR_FLAG = TRUE;                                               17810027
     END;                                                               17820027
                                                                        17830027
     WRK_ACTION = RCBM119I.ACTIONI;                                     17840027
                                                                        17850027
     IF ERROR_FLAG = TRUE THEN                                          17860027
     DO;                                                                17870027
       CALL RCBC11M_SEND_MAP_CSR;                                       17880027
     END;                                                               17890027
                                                                        17900027
     IF PF5_FLAG = TRUE THEN                                            17910027
     DO;                                                                17920027
       RCBV0505.PARAMETER_NUMBER   = 'RCB015';                          17930027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 17940027
                                  || WRK_PROGRAM_RUN_TYPE;              17950027
                                                                        17960027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   17970027
       RCBV0505.PARAMETER_VALUE    = WRK_PEW_WED_IND;                   17980027
                                                                        17990027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            18000027
                                                                        18010027
       CALL RCBC11M_UPD_T505;                                           18020027
     END;                                                               18030027
     ELSE                                                               18040027
     DO;                                                                18050027
       WRK_MSG = ERR_O022;                                              18060027
       CALL RCBC11M_FILL_MAP;                                           18070027
       CALL RCBC11M_SEND_MAP;                                           18080027
     END;                                                               18090027
   END;                                                                 18100027
                                                                        18110027
   OTHERWISE                                                            18120027
   DO;                                                                  18130027
     HEADER.NEXT = '00';                                                18140027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM119';                   18150027
     CALL RCBC11M_SEND_MAP;                                             18160027
   END;                                                                 18170027
 END;                                                                   18180027
                                                                        18190027
0END RCBC11M_REC_RCBM119;                                               18200027
1/********************************************************************/ 18210027
 /*      RECEIVE MAP RCBM11A - RCB016                                */ 18220027
 /********************************************************************/ 18230027
0RCBC11M_REC_RCBM11A : PROC;                                            18240027
                                                                        18250027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      18260027
    MAP('RCBM11A')                                                      18270027
    MAPSET('RCBM11')                                                    18280027
    RESP(RESPONSE)                                                      18290027
    RESP2(CODE_EXPLAIN);                                                18300027
                                                                        18310027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      18320027
   WHEN(DFHRESP(NORMAL))                                                18330027
   DO;                                                                  18340027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        18350027
     ERROR_FLAG = FALSE;                                                18360027
                                                                        18370027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11AI.PARAMETER_EFF_DATEI)) THEN      18380027
     DO;                                                                18390027
       RCBM11AI.PARAMETER_EFF_DATEL = -1;                               18400027
       RCBM11AO.PARAMETER_EFF_DATEC = DFHRED;                           18410027
       RCBM11AO.MSG_LINEO           = ERR_O101;                         18420027
       ERROR_FLAG = TRUE;                                               18430027
     END;                                                               18440027
                                                                        18450027
     WRK_PARAMETER_EFF_DATE = RCBM11AI.PARAMETER_EFF_DATEI;             18460027
                                                                        18470027
     IF VERIFY(RCBM11AI.OU_REPORTI, 'YN') ¬= 0 THEN                     18480027
     DO;                                                                18490027
       RCBM11AI.OU_REPORTL = -1;                                        18500027
       RCBM11AO.OU_REPORTC = DFHRED;                                    18510027
       RCBM11AO.MSG_LINEO  = ERR_O101;                                  18520027
       ERROR_FLAG = TRUE;                                               18530027
     END;                                                               18540027
                                                                        18550027
     WRK_OU_REPORT = RCBM11AI.OU_REPORTI;                               18560027
                                                                        18570027
     IF RCBM11AI.DESCRIPTIONL = 0 THEN                                  18580027
     DO;                                                                18590027
       RCBM11AO.DESCRIPTIONO = ' ';                                     18600027
     END;                                                               18610027
                                                                        18620027
     WRK_DESCRIPTION = RCBM11AI.DESCRIPTIONI;                           18630027
                                                                        18640027
     IF VERIFY(SUBSTR(RCBM11AI.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       18650027
      | VERIFY(SUBSTR(RCBM11AI.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  18660027
     DO;                                                                18670027
       RCBM11AI.PROGRAM_RUN_TYPEL = -1;                                 18680027
       RCBM11AO.PROGRAM_RUN_TYPEC = DFHRED;                             18690027
       RCBM11AO.MSG_LINEO         = ERR_O101;                           18700027
       ERROR_FLAG = TRUE;                                               18710027
     END;                                                               18720027
                                                                        18730027
     WRK_PROGRAM_RUN_TYPE = RCBM11AI.PROGRAM_RUN_TYPEI;                 18740027
                                                                        18750027
     IF RCBM11AI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             18760027
     DO;                                                                18770027
       WRK_COUNTRY_NUMBER = RCBM11AI.COUNTRY_NUMBERI;                   18780027
       EXEC CICS LINK                                                   18790027
          PROGRAM('RCBC99P')                                            18800027
          COMMAREA(COMMAREA)                                            18810027
          LENGTH(CSTG(COMMAREA));                                       18820027
                                                                        18830027
       IF OK_FLAG = FALSE THEN                                          18840027
       DO;                                                              18850027
         RCBM11AO.MSG_LINEO       = ERR_O057;                           18860027
         RCBM11AI.COUNTRY_NUMBERL = -1;                                 18870027
         RCBM11AO.COUNTRY_NUMBERC = DFHRED;                             18880027
         WRK_COUNTRY_NUMBER       = '001';                              18890027
         ERROR_FLAG = TRUE;                                             18900027
       END;                                                             18910027
                                                                        18920027
       IF CTY_OK_FLAG = FALSE THEN                                      18930027
       DO;                                                              18940027
         RCBM11AO.MSG_LINEO       = ERR_O072;                           18950027
         RCBM11AI.COUNTRY_NUMBERL = -1;                                 18960027
         RCBM11AO.COUNTRY_NUMBERC = DFHRED;                             18970027
         WRK_COUNTRY_NUMBER       = '001';                              18980027
         ERROR_FLAG = TRUE;                                             18990027
       END;                                                             19000027
     END;                                                               19010027
                                                                        19020027
     IF RCBM11AI.PROCESS_IDI ¬= 'DR05'                                  19030027
      & RCBM11AI.PROCESS_IDI ¬= 'DR06'                                  19040027
      & RCBM11AI.PROCESS_IDI ¬= 'DR07'                                  19050027
      & RCBM11AI.PROCESS_IDI ¬= 'DN01' THEN                             19060027
     DO;                                                                19070027
       RCBM11AI.PROCESS_IDL = -1;                                       19080027
       RCBM11AO.PROCESS_IDC = DFHRED;                                   19090027
       RCBM11AO.MSG_LINEO   = ERR_O101;                                 19100027
       ERROR_FLAG = TRUE;                                               19110027
     END;                                                               19120027
                                                                        19130027
     WRK_PROCESS_ID = RCBM11AI.PROCESS_IDI;                             19140027
                                                                        19150027
     IF VERIFY(RCBM11AI.ACTIONI,'12') ¬= 0 THEN                         19160027
     DO;                                                                19170027
       RCBM11AI.ACTIONL   = -1;                                         19180027
       RCBM11AO.ACTIONC   = DFHRED;                                     19190027
       RCBM11AO.MSG_LINEO = ERR_O101;                                   19200027
       ERROR_FLAG = TRUE;                                               19210027
     END;                                                               19220027
                                                                        19230027
     WRK_ACTION = RCBM11AI.ACTIONI;                                     19240027
                                                                        19250027
     IF ERROR_FLAG = TRUE THEN                                          19260027
     DO;                                                                19270027
       CALL RCBC11M_SEND_MAP_CSR;                                       19280027
     END;                                                               19290027
                                                                        19300027
     IF PF5_FLAG = TRUE THEN                                            19310027
     DO;                                                                19320027
       RCBV0505.PARAMETER_NUMBER   = 'RCB016';                          19330027
       RCBV0505.PARAMETER_KEY      = WRK_PROCESS_ID                     19340027
                                  || WRK_COUNTRY_NUMBER                 19350027
                                  || WRK_PROGRAM_RUN_TYPE;              19360027
                                                                        19370027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   19380027
       RCBV0505.PARAMETER_VALUE    = WRK_OU_REPORT;                     19390027
                                                                        19400027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            19410027
                                                                        19420027
       CALL RCBC11M_UPD_T505;                                           19430027
     END;                                                               19440027
     ELSE                                                               19450027
     DO;                                                                19460027
       WRK_MSG = ERR_O022;                                              19470027
       CALL RCBC11M_FILL_MAP;                                           19480027
       CALL RCBC11M_SEND_MAP;                                           19490027
     END;                                                               19500027
   END;                                                                 19510027
                                                                        19520027
   OTHERWISE                                                            19530027
   DO;                                                                  19540027
     HEADER.NEXT = '00';                                                19550027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11A';                   19560027
     CALL RCBC11M_SEND_MAP;                                             19570027
   END;                                                                 19580027
 END;                                                                   19590027
                                                                        19600027
0END RCBC11M_REC_RCBM11A;                                               19610027
1/********************************************************************/ 19620027
 /*      RECEIVE MAP RCBM11B - RCB017                                */ 19630027
 /********************************************************************/ 19640027
0RCBC11M_REC_RCBM11B : PROC;                                            19650027
                                                                        19660027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      19670027
    MAP('RCBM11B')                                                      19680027
    MAPSET('RCBM11')                                                    19690027
    RESP(RESPONSE)                                                      19700027
    RESP2(CODE_EXPLAIN);                                                19710027
                                                                        19720027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      19730027
   WHEN(DFHRESP(NORMAL))                                                19740027
   DO;                                                                  19750027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        19760027
     ERROR_FLAG = FALSE;                                                19770027
                                                                        19780027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11BI.PARAMETER_EFF_DATEI)) THEN      19790027
     DO;                                                                19800027
       RCBM11BI.PARAMETER_EFF_DATEL = -1;                               19810027
       RCBM11BO.PARAMETER_EFF_DATEC = DFHRED;                           19820027
       RCBM11BO.MSG_LINEO           = ERR_O101;                         19830027
       ERROR_FLAG = TRUE;                                               19840027
     END;                                                               19850027
                                                                        19860027
     WRK_PARAMETER_EFF_DATE = RCBM11BI.PARAMETER_EFF_DATEI;             19870027
                                                                        19880027
     IF VERIFY(RCBM11BI.AREA_INDICATORI, '12') ¬= 0 THEN                19890027
     DO;                                                                19900027
       RCBM11BI.AREA_INDICATORL = -1;                                   19910027
       RCBM11BO.AREA_INDICATORC = DFHRED;                               19920027
       RCBM11BO.MSG_LINEO       = ERR_O101;                             19930027
       ERROR_FLAG = TRUE;                                               19940027
     END;                                                               19950027
                                                                        19960027
     WRK_AREA_INDICATOR = RCBM11BI.AREA_INDICATORI;                     19970027
                                                                        19980027
     IF RCBM11BI.DESCRIPTIONL = 0 THEN                                  19990027
     DO;                                                                20000027
       RCBM11BO.DESCRIPTIONO = ' ';                                     20010027
     END;                                                               20020027
                                                                        20030027
     WRK_DESCRIPTION = RCBM11BI.DESCRIPTIONI;                           20040027
                                                                        20050027
     IF RCBM11BI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             20060027
     DO;                                                                20070027
       WRK_COUNTRY_NUMBER = RCBM11BI.COUNTRY_NUMBERI;                   20080027
       EXEC CICS LINK                                                   20090027
          PROGRAM('RCBC99P')                                            20100027
          COMMAREA(COMMAREA)                                            20110027
          LENGTH(CSTG(COMMAREA));                                       20120027
                                                                        20130027
       IF OK_FLAG = FALSE THEN                                          20140027
       DO;                                                              20150027
         RCBM11BO.MSG_LINEO       = ERR_O057;                           20160027
         RCBM11BI.COUNTRY_NUMBERL = -1;                                 20170027
         RCBM11BO.COUNTRY_NUMBERC = DFHRED;                             20180027
         WRK_COUNTRY_NUMBER       = '001';                              20190027
         ERROR_FLAG = TRUE;                                             20200027
       END;                                                             20210027
                                                                        20220027
       IF CTY_OK_FLAG = FALSE THEN                                      20230027
       DO;                                                              20240027
         RCBM11BO.MSG_LINEO       = ERR_O072;                           20250027
         RCBM11BI.COUNTRY_NUMBERL = -1;                                 20260027
         RCBM11BO.COUNTRY_NUMBERC = DFHRED;                             20270027
         WRK_COUNTRY_NUMBER       = '001';                              20280027
         ERROR_FLAG = TRUE;                                             20290027
       END;                                                             20300027
     END;                                                               20310027
                                                                        20320027
     IF VERIFY(RCBM11BI.ACTIONI,'12') ¬= 0 THEN                         20330027
     DO;                                                                20340027
       RCBM11BI.ACTIONL   = -1;                                         20350027
       RCBM11BO.ACTIONC   = DFHRED;                                     20360027
       RCBM11BO.MSG_LINEO = ERR_O101;                                   20370027
       ERROR_FLAG = TRUE;                                               20380027
     END;                                                               20390027
                                                                        20400027
     WRK_ACTION = RCBM11BI.ACTIONI;                                     20410027
                                                                        20420027
     IF ERROR_FLAG = TRUE THEN                                          20430027
     DO;                                                                20440027
       CALL RCBC11M_SEND_MAP_CSR;                                       20450027
     END;                                                               20460027
                                                                        20470027
     IF PF5_FLAG = TRUE THEN                                            20480027
     DO;                                                                20490027
       RCBV0505.PARAMETER_NUMBER   = 'RCB017';                          20500027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                20510027
                                                                        20520027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   20530027
       RCBV0505.PARAMETER_VALUE    = WRK_AREA_INDICATOR;                20540027
                                                                        20550027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            20560027
                                                                        20570027
       CALL RCBC11M_UPD_T505;                                           20580027
     END;                                                               20590027
     ELSE                                                               20600027
     DO;                                                                20610027
       WRK_MSG = ERR_O022;                                              20620027
       CALL RCBC11M_FILL_MAP;                                           20630027
       CALL RCBC11M_SEND_MAP;                                           20640027
     END;                                                               20650027
   END;                                                                 20660027
                                                                        20670027
   OTHERWISE                                                            20680027
   DO;                                                                  20690027
     HEADER.NEXT = '00';                                                20700027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11B';                   20710027
     CALL RCBC11M_SEND_MAP;                                             20720027
   END;                                                                 20730027
 END;                                                                   20740027
                                                                        20750027
0END RCBC11M_REC_RCBM11B;                                               20760027
1/********************************************************************/ 20770027
 /*      RECEIVE MAP RCBM11C - RCB018                                */ 20780027
 /********************************************************************/ 20790027
0RCBC11M_REC_RCBM11C : PROC;                                            20800027
                                                                        20810027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      20820027
    MAP('RCBM11C')                                                      20830027
    MAPSET('RCBM11')                                                    20840027
    RESP(RESPONSE)                                                      20850027
    RESP2(CODE_EXPLAIN);                                                20860027
                                                                        20870027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      20880027
   WHEN(DFHRESP(NORMAL))                                                20890027
   DO;                                                                  20900027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        20910027
     ERROR_FLAG = FALSE;                                                20920027
                                                                        20930027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11CI.PARAMETER_EFF_DATEI)) THEN      20940027
     DO;                                                                20950027
       RCBM11CI.PARAMETER_EFF_DATEL = -1;                               20960027
       RCBM11CO.PARAMETER_EFF_DATEC = DFHRED;                           20970027
       RCBM11CO.MSG_LINEO           = ERR_O101;                         20980027
       ERROR_FLAG = TRUE;                                               20990027
     END;                                                               21000027
                                                                        21010027
     WRK_PARAMETER_EFF_DATE = RCBM11CI.PARAMETER_EFF_DATEI;             21020027
                                                                        21030027
     IF VERIFY(RCBM11CI.ZIP_CODE_IDI,ALPHANUM) ¬= 0 THEN                21040027
     DO;                                                                21050027
       RCBM11CI.ZIP_CODE_IDL = -1;                                      21060027
       RCBM11CO.ZIP_CODE_IDC = DFHRED;                                  21070027
       RCBM11CO.MSG_LINEO    = ERR_O101;                                21080027
       ERROR_FLAG = TRUE;                                               21090027
     END;                                                               21100027
                                                                        21110027
     WRK_ZIP_CODE_ID = RCBM11CI.ZIP_CODE_IDI;                           21120027
                                                                        21130027
     IF RCBM11CI.DESCRIPTIONL = 0 THEN                                  21140027
     DO;                                                                21150027
       RCBM11CO.DESCRIPTIONO = ' ';                                     21160027
     END;                                                               21170027
                                                                        21180027
     WRK_DESCRIPTION = RCBM11CI.DESCRIPTIONI;                           21190027
                                                                        21200027
     IF RCBM11CI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             21210027
     DO;                                                                21220027
       WRK_COUNTRY_NUMBER = RCBM11CI.COUNTRY_NUMBERI;                   21230027
       EXEC CICS LINK                                                   21240027
          PROGRAM('RCBC99P')                                            21250027
          COMMAREA(COMMAREA)                                            21260027
          LENGTH(CSTG(COMMAREA));                                       21270027
                                                                        21280027
       IF OK_FLAG = FALSE THEN                                          21290027
       DO;                                                              21300027
         RCBM11CO.MSG_LINEO       = ERR_O057;                           21310027
         RCBM11CI.COUNTRY_NUMBERL = -1;                                 21320027
         RCBM11CO.COUNTRY_NUMBERC = DFHRED;                             21330027
         WRK_COUNTRY_NUMBER       = '001';                              21340027
         ERROR_FLAG = TRUE;                                             21350027
       END;                                                             21360027
                                                                        21370027
       IF CTY_OK_FLAG = FALSE THEN                                      21380027
       DO;                                                              21390027
         RCBM11CO.MSG_LINEO       = ERR_O072;                           21400027
         RCBM11CI.COUNTRY_NUMBERL = -1;                                 21410027
         RCBM11CO.COUNTRY_NUMBERC = DFHRED;                             21420027
         WRK_COUNTRY_NUMBER       = '001';                              21430027
         ERROR_FLAG = TRUE;                                             21440027
       END;                                                             21450027
     END;                                                               21460027
                                                                        21470027
     IF VERIFY(RCBM11CI.ACTIONI,'12') ¬= 0 THEN                         21480027
     DO;                                                                21490027
       RCBM11CI.ACTIONL   = -1;                                         21500027
       RCBM11CO.ACTIONC   = DFHRED;                                     21510027
       RCBM11CO.MSG_LINEO = ERR_O101;                                   21520027
       ERROR_FLAG = TRUE;                                               21530027
     END;                                                               21540027
                                                                        21550027
     WRK_ACTION = RCBM11CI.ACTIONI;                                     21560027
                                                                        21570027
     IF ERROR_FLAG = TRUE THEN                                          21580027
     DO;                                                                21590027
       CALL RCBC11M_SEND_MAP_CSR;                                       21600027
     END;                                                               21610027
                                                                        21620027
     IF PF5_FLAG = TRUE THEN                                            21630027
     DO;                                                                21640027
       RCBV0505.PARAMETER_NUMBER   = 'RCB018';                          21650027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                21660027
                                                                        21670027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   21680027
       RCBV0505.PARAMETER_VALUE    = WRK_ZIP_CODE_ID;                   21690027
                                                                        21700027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            21710027
                                                                        21720027
       CALL RCBC11M_UPD_T505;                                           21730027
     END;                                                               21740027
     ELSE                                                               21750027
     DO;                                                                21760027
       WRK_MSG = ERR_O022;                                              21770027
       CALL RCBC11M_FILL_MAP;                                           21780027
       CALL RCBC11M_SEND_MAP;                                           21790027
     END;                                                               21800027
   END;                                                                 21810027
                                                                        21820027
   OTHERWISE                                                            21830027
   DO;                                                                  21840027
     HEADER.NEXT = '00';                                                21850027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11C';                   21860027
     CALL RCBC11M_SEND_MAP;                                             21870027
   END;                                                                 21880027
 END;                                                                   21890027
                                                                        21900027
0END RCBC11M_REC_RCBM11C;                                               21910027
1/********************************************************************/ 21920027
 /*      RECEIVE MAP RCBM11D - RCB019                                */ 21930027
 /********************************************************************/ 21940027
0RCBC11M_REC_RCBM11D : PROC;                                            21950027
                                                                        21960027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      21970027
    MAP('RCBM11D')                                                      21980027
    MAPSET('RCBM11')                                                    21990027
    RESP(RESPONSE)                                                      22000027
    RESP2(CODE_EXPLAIN);                                                22010027
                                                                        22020027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      22030027
   WHEN(DFHRESP(NORMAL))                                                22040027
   DO;                                                                  22050027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        22060027
     ERROR_FLAG = FALSE;                                                22070027
                                                                        22080027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11DI.PARAMETER_EFF_DATEI)) THEN      22090027
     DO;                                                                22100027
       RCBM11DI.PARAMETER_EFF_DATEL = -1;                               22110027
       RCBM11DO.PARAMETER_EFF_DATEC = DFHRED;                           22120027
       RCBM11DO.MSG_LINEO           = ERR_O101;                         22130027
       ERROR_FLAG = TRUE;                                               22140027
     END;                                                               22150027
                                                                        22160027
     WRK_PARAMETER_EFF_DATE = RCBM11DI.PARAMETER_EFF_DATEI;             22170027
                                                                        22180027
     IF VERIFY(RCBM11DI.CHIS_TABLE_INDI,'CNO') ¬= 0 THEN                22190027
     DO;                                                                22200027
       RCBM11DI.CHIS_TABLE_INDL = -1;                                   22210027
       RCBM11DO.CHIS_TABLE_INDC = DFHRED;                               22220027
       RCBM11DO.MSG_LINEO       = ERR_O101;                             22230027
       ERROR_FLAG = TRUE;                                               22240027
     END;                                                               22250027
                                                                        22260027
     WRK_CHIS_TABLE_IND = RCBM11DI.CHIS_TABLE_INDI;                     22270027
                                                                        22280027
     IF RCBM11DI.DESCRIPTIONL = 0 THEN                                  22290027
     DO;                                                                22300027
       RCBM11DO.DESCRIPTIONO = ' ';                                     22310027
     END;                                                               22320027
                                                                        22330027
     WRK_DESCRIPTION = RCBM11DI.DESCRIPTIONI;                           22340027
                                                                        22350027
     IF RCBM11DI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             22360027
     DO;                                                                22370027
       WRK_COUNTRY_NUMBER = RCBM11DI.COUNTRY_NUMBERI;                   22380027
       EXEC CICS LINK                                                   22390027
          PROGRAM('RCBC99P')                                            22400027
          COMMAREA(COMMAREA)                                            22410027
          LENGTH(CSTG(COMMAREA));                                       22420027
                                                                        22430027
       IF OK_FLAG = FALSE THEN                                          22440027
       DO;                                                              22450027
         RCBM11DO.MSG_LINEO       = ERR_O057;                           22460027
         RCBM11DI.COUNTRY_NUMBERL = -1;                                 22470027
         RCBM11DO.COUNTRY_NUMBERC = DFHRED;                             22480027
         WRK_COUNTRY_NUMBER       = '001';                              22490027
         ERROR_FLAG = TRUE;                                             22500027
       END;                                                             22510027
                                                                        22520027
       IF CTY_OK_FLAG = FALSE THEN                                      22530027
       DO;                                                              22540027
         RCBM11DO.MSG_LINEO       = ERR_O072;                           22550027
         RCBM11DI.COUNTRY_NUMBERL = -1;                                 22560027
         RCBM11DO.COUNTRY_NUMBERC = DFHRED;                             22570027
         WRK_COUNTRY_NUMBER       = '001';                              22580027
         ERROR_FLAG = TRUE;                                             22590027
       END;                                                             22600027
     END;                                                               22610027
                                                                        22620027
     IF VERIFY(RCBM11DI.ACTIONI,'12') ¬= 0 THEN                         22630027
     DO;                                                                22640027
       RCBM11DI.ACTIONL   = -1;                                         22650027
       RCBM11DO.ACTIONC   = DFHRED;                                     22660027
       RCBM11DO.MSG_LINEO = ERR_O101;                                   22670027
       ERROR_FLAG = TRUE;                                               22680027
     END;                                                               22690027
                                                                        22700027
     WRK_ACTION = RCBM11DI.ACTIONI;                                     22710027
                                                                        22720027
     IF ERROR_FLAG = TRUE THEN                                          22730027
     DO;                                                                22740027
       CALL RCBC11M_SEND_MAP_CSR;                                       22750027
     END;                                                               22760027
                                                                        22770027
     IF PF5_FLAG = TRUE THEN                                            22780027
     DO;                                                                22790027
       RCBV0505.PARAMETER_NUMBER   = 'RCB019';                          22800027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                22810027
                                                                        22820027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   22830027
       RCBV0505.PARAMETER_VALUE    = WRK_CHIS_TABLE_IND;                22840027
                                                                        22850027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            22860027
                                                                        22870027
       CALL RCBC11M_UPD_T505;                                           22880027
     END;                                                               22890027
     ELSE                                                               22900027
     DO;                                                                22910027
       WRK_MSG = ERR_O022;                                              22920027
       CALL RCBC11M_FILL_MAP;                                           22930027
       CALL RCBC11M_SEND_MAP;                                           22940027
     END;                                                               22950027
   END;                                                                 22960027
                                                                        22970027
   OTHERWISE                                                            22980027
   DO;                                                                  22990027
     HEADER.NEXT = '00';                                                23000027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11D';                   23010027
     CALL RCBC11M_SEND_MAP;                                             23020027
   END;                                                                 23030027
 END;                                                                   23040027
                                                                        23050027
0END RCBC11M_REC_RCBM11D;                                               23060027
1/********************************************************************/ 23070027
 /*      RECEIVE MAP RCBM11E - RCB022                                */ 23080027
 /********************************************************************/ 23090027
0RCBC11M_REC_RCBM11E : PROC;                                            23100027
                                                                        23110027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      23120027
    MAP('RCBM11E')                                                      23130027
    MAPSET('RCBM11')                                                    23140027
    RESP(RESPONSE)                                                      23150027
    RESP2(CODE_EXPLAIN);                                                23160027
                                                                        23170027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      23180027
   WHEN(DFHRESP(NORMAL))                                                23190027
   DO;                                                                  23200027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        23210027
     ERROR_FLAG = FALSE;                                                23220027
                                                                        23230027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11EI.PARAMETER_EFF_DATEI)) THEN      23240027
     DO;                                                                23250027
       RCBM11EI.PARAMETER_EFF_DATEL = -1;                               23260027
       RCBM11EO.PARAMETER_EFF_DATEC = DFHRED;                           23270027
       RCBM11EO.MSG_LINEO           = ERR_O101;                         23280027
       ERROR_FLAG = TRUE;                                               23290027
     END;                                                               23300027
                                                                        23310027
     WRK_PARAMETER_EFF_DATE = RCBM11EI.PARAMETER_EFF_DATEI;             23320027
                                                                        23330027
     IF RCBM11EI.DESCRIPTIONL = 0 THEN                                  23340027
     DO;                                                                23350027
       RCBM11EO.DESCRIPTIONO = ' ';                                     23360027
     END;                                                               23370027
                                                                        23380027
     WRK_DESCRIPTION = RCBM11EI.DESCRIPTIONI;                           23390027
                                                                        23400027
     IF RCBM11EI.HORIZON_PERIODL = 0 THEN                               23410027
       RCBM11EO.HORIZON_PERIODO  = '';                                  23420027
                                                                        23430027
     IF VERIFY(RCBM11EI.HORIZON_PERIODI, NUMER) ¬= 0 THEN               23440027
     DO;                                                                23450027
       RCBM11EI.HORIZON_PERIODL = -1;                                   23460027
       RCBM11EO.HORIZON_PERIODC = DFHRED;                               23470027
       RCBM11EO.MSG_LINEO       = ERR_O101;                             23480027
       ERROR_FLAG = TRUE;                                               23490027
     END;                                                               23500027
                                                                        23510027
     WRK_HORIZON_PERIOD = RCBM11EI.HORIZON_PERIODI;                     23520027
                                                                        23530027
     IF RCBM11EI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             23540027
     DO;                                                                23550027
       WRK_COUNTRY_NUMBER = RCBM11EI.COUNTRY_NUMBERI;                   23560027
       EXEC CICS LINK                                                   23570027
          PROGRAM('RCBC99P')                                            23580027
          COMMAREA(COMMAREA)                                            23590027
          LENGTH(CSTG(COMMAREA));                                       23600027
                                                                        23610027
       IF OK_FLAG = FALSE THEN                                          23620027
       DO;                                                              23630027
         RCBM11EO.MSG_LINEO       = ERR_O057;                           23640027
         RCBM11EI.COUNTRY_NUMBERL = -1;                                 23650027
         RCBM11EO.COUNTRY_NUMBERC = DFHRED;                             23660027
         WRK_COUNTRY_NUMBER       = '001';                              23670027
         ERROR_FLAG = TRUE;                                             23680027
       END;                                                             23690027
                                                                        23700027
       IF CTY_OK_FLAG = FALSE THEN                                      23710027
       DO;                                                              23720027
         RCBM11EO.MSG_LINEO       = ERR_O072;                           23730027
         RCBM11EI.COUNTRY_NUMBERL = -1;                                 23740027
         RCBM11EO.COUNTRY_NUMBERC = DFHRED;                             23750027
         WRK_COUNTRY_NUMBER       = '001';                              23760027
         ERROR_FLAG = TRUE;                                             23770027
       END;                                                             23780027
     END;                                                               23790027
                                                                        23800027
     IF VERIFY(RCBM11EI.ACTIONI,'12') ¬= 0 THEN                         23810027
     DO;                                                                23820027
       RCBM11EI.ACTIONL   = -1;                                         23830027
       RCBM11EO.ACTIONC   = DFHRED;                                     23840027
       RCBM11EO.MSG_LINEO = ERR_O101;                                   23850027
       ERROR_FLAG = TRUE;                                               23860027
     END;                                                               23870027
                                                                        23880027
     WRK_ACTION = RCBM11EI.ACTIONI;                                     23890027
                                                                        23900027
     IF ERROR_FLAG = TRUE THEN                                          23910027
     DO;                                                                23920027
       CALL RCBC11M_SEND_MAP_CSR;                                       23930027
     END;                                                               23940027
                                                                        23950027
     IF PF5_FLAG = TRUE THEN                                            23960027
     DO;                                                                23970027
       WRK_HORIZON_PERIOD_P        = WRK_HORIZON_PERIOD;                23980027
       RCBV0505.PARAMETER_NUMBER   = 'RCB022';                          23990027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 24000027
                                  || 'RCBBGBP';                         24010027
                                                                        24020027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   24030027
       RCBV0505.PARAMETER_VALUE    = WRK_HORIZON_PERIOD_P;              24040027
                                                                        24050027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            24060027
                                                                        24070027
       CALL RCBC11M_UPD_T505;                                           24080027
     END;                                                               24090027
     ELSE                                                               24100027
     DO;                                                                24110027
       WRK_MSG = ERR_O022;                                              24120027
       CALL RCBC11M_FILL_MAP;                                           24130027
       CALL RCBC11M_SEND_MAP;                                           24140027
     END;                                                               24150027
   END;                                                                 24160027
                                                                        24170027
   OTHERWISE                                                            24180027
   DO;                                                                  24190027
     HEADER.NEXT = '00';                                                24200027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11E';                   24210027
     CALL RCBC11M_SEND_MAP;                                             24220027
   END;                                                                 24230027
 END;                                                                   24240027
                                                                        24250027
0END RCBC11M_REC_RCBM11E;                                               24260027
1/********************************************************************/ 24270027
 /*      RECEIVE MAP RCBM11F - RCB023                                */ 24280027
 /********************************************************************/ 24290027
0RCBC11M_REC_RCBM11F : PROC;                                            24300027
                                                                        24310027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      24320027
    MAP('RCBM11F')                                                      24330027
    MAPSET('RCBM11')                                                    24340027
    RESP(RESPONSE)                                                      24350027
    RESP2(CODE_EXPLAIN);                                                24360027
                                                                        24370027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      24380027
   WHEN(DFHRESP(NORMAL))                                                24390027
   DO;                                                                  24400027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        24410027
     ERROR_FLAG = FALSE;                                                24420027
                                                                        24430027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11FI.PARAMETER_EFF_DATEI)) THEN      24440027
     DO;                                                                24450027
       RCBM11FI.PARAMETER_EFF_DATEL = -1;                               24460027
       RCBM11FO.PARAMETER_EFF_DATEC = DFHRED;                           24470027
       RCBM11FO.MSG_LINEO           = ERR_O101;                         24480027
       ERROR_FLAG = TRUE;                                               24490027
     END;                                                               24500027
                                                                        24510027
     WRK_PARAMETER_EFF_DATE = RCBM11FI.PARAMETER_EFF_DATEI;             24520027
                                                                        24530027
     IF VERIFY(RCBM11FI.SOURCE_DK_DOCI, ALPHANUM) ¬= 0 THEN             24540027
     DO;                                                                24550027
       RCBM11FI.SOURCE_DK_DOCL = -1;                                    24560027
       RCBM11FO.SOURCE_DK_DOCC = DFHRED;                                24570027
       RCBM11FO.MSG_LINEO      = ERR_O101;                              24580027
       ERROR_FLAG = TRUE;                                               24590027
     END;                                                               24600027
                                                                        24610027
     WRK_SOURCE_DK_DOC = RCBM11FI.SOURCE_DK_DOCI;                       24620027
                                                                        24630027
     IF VERIFY(RCBM11FI.SOURCE_DC_DOCI, ALPHANUM) ¬= 0 THEN             24640027
     DO;                                                                24650027
       RCBM11FI.SOURCE_DC_DOCL = -1;                                    24660027
       RCBM11FO.SOURCE_DC_DOCC = DFHRED;                                24670027
       RCBM11FO.MSG_LINEO      = ERR_O101;                              24680027
       ERROR_FLAG = TRUE;                                               24690027
     END;                                                               24700027
                                                                        24710027
     WRK_SOURCE_DC_DOC = RCBM11FI.SOURCE_DC_DOCI;                       24720027
                                                                        24730027
     IF RCBM11FI.DESCRIPTIONL = 0 THEN                                  24740027
     DO;                                                                24750027
       RCBM11FO.DESCRIPTIONO = ' ';                                     24760027
     END;                                                               24770027
                                                                        24780027
     WRK_DESCRIPTION = RCBM11FI.DESCRIPTIONI;                           24790027
                                                                        24800027
     IF RCBM11FI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             24810027
     DO;                                                                24820027
       WRK_COUNTRY_NUMBER = RCBM11FI.COUNTRY_NUMBERI;                   24830027
       EXEC CICS LINK                                                   24840027
          PROGRAM('RCBC99P')                                            24850027
          COMMAREA(COMMAREA)                                            24860027
          LENGTH(CSTG(COMMAREA));                                       24870027
                                                                        24880027
       IF OK_FLAG = FALSE THEN                                          24890027
       DO;                                                              24900027
         RCBM11FO.MSG_LINEO       = ERR_O057;                           24910027
         RCBM11FI.COUNTRY_NUMBERL = -1;                                 24920027
         RCBM11FO.COUNTRY_NUMBERC = DFHRED;                             24930027
         WRK_COUNTRY_NUMBER       = '001';                              24940027
         ERROR_FLAG = TRUE;                                             24950027
       END;                                                             24960027
                                                                        24970027
       IF CTY_OK_FLAG = FALSE THEN                                      24980027
       DO;                                                              24990027
         RCBM11FO.MSG_LINEO       = ERR_O072;                           25000027
         RCBM11FI.COUNTRY_NUMBERL = -1;                                 25010027
         RCBM11FO.COUNTRY_NUMBERC = DFHRED;                             25020027
         WRK_COUNTRY_NUMBER       = '001';                              25030027
         ERROR_FLAG = TRUE;                                             25040027
       END;                                                             25050027
     END;                                                               25060027
                                                                        25070027
     IF VERIFY(RCBM11FI.ACTIONI,'12') ¬= 0 THEN                         25080027
     DO;                                                                25090027
       RCBM11FI.ACTIONL   = -1;                                         25100027
       RCBM11FO.ACTIONC   = DFHRED;                                     25110027
       RCBM11FO.MSG_LINEO = ERR_O101;                                   25120027
       ERROR_FLAG = TRUE;                                               25130027
     END;                                                               25140027
                                                                        25150027
     WRK_ACTION = RCBM11FI.ACTIONI;                                     25160027
                                                                        25170027
     IF ERROR_FLAG = TRUE THEN                                          25180027
     DO;                                                                25190027
       CALL RCBC11M_SEND_MAP_CSR;                                       25200027
     END;                                                               25210027
                                                                        25220027
     IF PF5_FLAG = TRUE THEN                                            25230027
     DO;                                                                25240027
       RCBV0505.PARAMETER_NUMBER   = 'RCB023';                          25250027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                25260027
                                                                        25270027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   25280027
       RCBV0505.PARAMETER_VALUE    = WRK_SOURCE_DC_DOC                  25290027
                                  || WRK_SOURCE_DC_DOC;                 25300027
                                                                        25310027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            25320027
                                                                        25330027
       CALL RCBC11M_UPD_T505;                                           25340027
     END;                                                               25350027
     ELSE                                                               25360027
     DO;                                                                25370027
       WRK_MSG = ERR_O022;                                              25380027
       CALL RCBC11M_FILL_MAP;                                           25390027
       CALL RCBC11M_SEND_MAP;                                           25400027
     END;                                                               25410027
   END;                                                                 25420027
                                                                        25430027
   OTHERWISE                                                            25440027
   DO;                                                                  25450027
     HEADER.NEXT = '00';                                                25460027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11F';                   25470027
     CALL RCBC11M_SEND_MAP;                                             25480027
   END;                                                                 25490027
 END;                                                                   25500027
                                                                        25510027
0END RCBC11M_REC_RCBM11F;                                               25520027
1/********************************************************************/ 25530027
 /*      RECEIVE MAP RCBM11G - RCB025                                */ 25540027
 /********************************************************************/ 25550027
0RCBC11M_REC_RCBM11G : PROC;                                            25560027
                                                                        25570027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      25580027
    MAP('RCBM11G')                                                      25590027
    MAPSET('RCBM11')                                                    25600027
    RESP(RESPONSE)                                                      25610027
    RESP2(CODE_EXPLAIN);                                                25620027
                                                                        25630027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      25640027
   WHEN(DFHRESP(NORMAL))                                                25650027
   DO;                                                                  25660027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        25670027
     ERROR_FLAG = FALSE;                                                25680027
                                                                        25690027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11GI.PARAMETER_EFF_DATEI)) THEN      25700027
     DO;                                                                25710027
       RCBM11GI.PARAMETER_EFF_DATEL = -1;                               25720027
       RCBM11GO.PARAMETER_EFF_DATEC = DFHRED;                           25730027
       RCBM11GO.MSG_LINEO           = ERR_O101;                         25740027
       ERROR_FLAG = TRUE;                                               25750027
     END;                                                               25760027
                                                                        25770027
     WRK_PARAMETER_EFF_DATE = RCBM11GI.PARAMETER_EFF_DATEI;             25780027
                                                                        25790027
     IF RCBM11GI.NUMBER_OF_DAYSL = 0 THEN                               25800027
       RCBM11GO.NUMBER_OF_DAYSO  = '';                                  25810027
                                                                        25820027
     WRK_QTY_IN = RCBM11GI.NUMBER_OF_DAYSI;                             25830027
     WRK_CNT = 3;                                                       25840027
     CALL RCBC11M_VALID_QTY;                                            25850027
                                                                        25860027
     IF OK_FLAG = FALSE THEN                                            25870027
     DO;                                                                25880027
       RCBM11GI.NUMBER_OF_DAYSL = -1;                                   25890027
       RCBM11GO.NUMBER_OF_DAYSC = DFHRED;                               25900027
       RCBM11GO.MSG_LINEO         = ERR_O101;                           25910027
       ERROR_FLAG = TRUE;                                               25920027
     END;                                                               25930027
                                                                        25940027
     RCBM11GO.NUMBER_OF_DAYSO = WRK_QTY_IN;                             25950027
     WRK_NUMBER_OF_DAYS       = RCBM11GI.NUMBER_OF_DAYSI;               25960027
                                                                        25970027
     IF RCBM11GI.DESCRIPTIONL = 0 THEN                                  25980027
     DO;                                                                25990027
       RCBM11GO.DESCRIPTIONO = ' ';                                     26000027
     END;                                                               26010027
                                                                        26020027
     WRK_DESCRIPTION = RCBM11GI.DESCRIPTIONI;                           26030027
                                                                        26040027
     IF RCBM11GI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             26050027
     DO;                                                                26060027
       WRK_COUNTRY_NUMBER = RCBM11GI.COUNTRY_NUMBERI;                   26070027
       EXEC CICS LINK                                                   26080027
          PROGRAM('RCBC99P')                                            26090027
          COMMAREA(COMMAREA)                                            26100027
          LENGTH(CSTG(COMMAREA));                                       26110027
                                                                        26120027
       IF OK_FLAG = FALSE THEN                                          26130027
       DO;                                                              26140027
         RCBM11GO.MSG_LINEO       = ERR_O057;                           26150027
         RCBM11GI.COUNTRY_NUMBERL = -1;                                 26160027
         RCBM11GO.COUNTRY_NUMBERC = DFHRED;                             26170027
         WRK_COUNTRY_NUMBER       = '001';                              26180027
         ERROR_FLAG = TRUE;                                             26190027
       END;                                                             26200027
                                                                        26210027
       IF CTY_OK_FLAG = FALSE THEN                                      26220027
       DO;                                                              26230027
         RCBM11GO.MSG_LINEO       = ERR_O072;                           26240027
         RCBM11GI.COUNTRY_NUMBERL = -1;                                 26250027
         RCBM11GO.COUNTRY_NUMBERC = DFHRED;                             26260027
         WRK_COUNTRY_NUMBER       = '001';                              26270027
         ERROR_FLAG = TRUE;                                             26280027
       END;                                                             26290027
     END;                                                               26300027
                                                                        26310027
     IF VERIFY(RCBM11GI.ACTIONI,'12') ¬= 0 THEN                         26320027
     DO;                                                                26330027
       RCBM11GI.ACTIONL   = -1;                                         26340027
       RCBM11GO.ACTIONC   = DFHRED;                                     26350027
       RCBM11GO.MSG_LINEO = ERR_O101;                                   26360027
       ERROR_FLAG = TRUE;                                               26370027
     END;                                                               26380027
                                                                        26390027
     WRK_ACTION = RCBM11GI.ACTIONI;                                     26400027
                                                                        26410027
     IF ERROR_FLAG = TRUE THEN                                          26420027
     DO;                                                                26430027
       CALL RCBC11M_SEND_MAP_CSR;                                       26440027
     END;                                                               26450027
                                                                        26460027
     IF PF5_FLAG = TRUE THEN                                            26470027
     DO;                                                                26480027
       WRK_NUMBER_OF_DAYS_P        = WRK_NUMBER_OF_DAYS;                26490027
       RCBV0505.PARAMETER_NUMBER   = 'RCB025';                          26500027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                26510027
                                                                        26520027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   26530027
       RCBV0505.PARAMETER_VALUE    = WRK_NUMBER_OF_DAYS_P;              26540027
                                                                        26550027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            26560027
                                                                        26570027
       CALL RCBC11M_UPD_T505;                                           26580027
     END;                                                               26590027
     ELSE                                                               26600027
     DO;                                                                26610027
       WRK_MSG = ERR_O022;                                              26620027
       CALL RCBC11M_FILL_MAP;                                           26630027
       CALL RCBC11M_SEND_MAP;                                           26640027
     END;                                                               26650027
   END;                                                                 26660027
                                                                        26670027
   OTHERWISE                                                            26680027
   DO;                                                                  26690027
     HEADER.NEXT = '00';                                                26700027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11G';                   26710027
     CALL RCBC11M_SEND_MAP;                                             26720027
   END;                                                                 26730027
 END;                                                                   26740027
                                                                        26750027
0END RCBC11M_REC_RCBM11G;                                               26760027
1/********************************************************************/ 26770027
 /*      RECEIVE MAP RCBM11H - RCB026                                */ 26780027
 /********************************************************************/ 26790027
0RCBC11M_REC_RCBM11H : PROC;                                            26800027
                                                                        26810027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      26820027
    MAP('RCBM11H')                                                      26830027
    MAPSET('RCBM11')                                                    26840027
    RESP(RESPONSE)                                                      26850027
    RESP2(CODE_EXPLAIN);                                                26860027
                                                                        26870027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      26880027
   WHEN(DFHRESP(NORMAL))                                                26890027
   DO;                                                                  26900027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        26910027
     ERROR_FLAG = FALSE;                                                26920027
                                                                        26930027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11HI.PARAMETER_EFF_DATEI)) THEN      26940027
     DO;                                                                26950027
       RCBM11HI.PARAMETER_EFF_DATEL = -1;                               26960027
       RCBM11HO.PARAMETER_EFF_DATEC = DFHRED;                           26970027
       RCBM11HO.MSG_LINEO           = ERR_O101;                         26980027
       ERROR_FLAG = TRUE;                                               26990027
     END;                                                               27000027
                                                                        27010027
     WRK_PARAMETER_EFF_DATE = RCBM11HI.PARAMETER_EFF_DATEI;             27020027
                                                                        27030027
     IF VERIFY(RCBM11HI.ADDR_TYPEI,'123456') ¬= 0 THEN                  27040027
     DO;                                                                27050027
       RCBM11HI.ADDR_TYPEL = -1;                                        27060027
       RCBM11HO.ADDR_TYPEC = DFHRED;                                    27070027
       RCBM11HO.MSG_LINEO         = ERR_O101;                           27080027
       ERROR_FLAG = TRUE;                                               27090027
     END;                                                               27100027
                                                                        27110027
     WRK_ADDR_TYPE = RCBM11HI.ADDR_TYPEI;                               27120027
                                                                        27130027
     IF RCBM11HI.DESCRIPTIONL = 0 THEN                                  27140027
     DO;                                                                27150027
       RCBM11HO.DESCRIPTIONO = ' ';                                     27160027
     END;                                                               27170027
                                                                        27180027
     WRK_DESCRIPTION = RCBM11HI.DESCRIPTIONI;                           27190027
                                                                        27200027
     IF VERIFY(SUBSTR(RCBM11HI.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       27210027
      | VERIFY(SUBSTR(RCBM11HI.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  27220027
     DO;                                                                27230027
       RCBM11HI.PROGRAM_RUN_TYPEL = -1;                                 27240027
       RCBM11HO.PROGRAM_RUN_TYPEC = DFHRED;                             27250027
       RCBM11HO.MSG_LINEO         = ERR_O101;                           27260027
       ERROR_FLAG = TRUE;                                               27270027
     END;                                                               27280027
                                                                        27290027
     WRK_PROGRAM_RUN_TYPE = RCBM11HI.PROGRAM_RUN_TYPEI;                 27300027
                                                                        27310027
     IF RCBM11HI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             27320027
     DO;                                                                27330027
       WRK_COUNTRY_NUMBER = RCBM11HI.COUNTRY_NUMBERI;                   27340027
       EXEC CICS LINK                                                   27350027
          PROGRAM('RCBC99P')                                            27360027
          COMMAREA(COMMAREA)                                            27370027
          LENGTH(CSTG(COMMAREA));                                       27380027
                                                                        27390027
       IF OK_FLAG = FALSE THEN                                          27400027
       DO;                                                              27410027
         RCBM11HO.MSG_LINEO       = ERR_O057;                           27420027
         RCBM11HI.COUNTRY_NUMBERL = -1;                                 27430027
         RCBM11HO.COUNTRY_NUMBERC = DFHRED;                             27440027
         WRK_COUNTRY_NUMBER       = '001';                              27450027
         ERROR_FLAG = TRUE;                                             27460027
       END;                                                             27470027
                                                                        27480027
       IF CTY_OK_FLAG = FALSE THEN                                      27490027
       DO;                                                              27500027
         RCBM11HO.MSG_LINEO       = ERR_O072;                           27510027
         RCBM11HI.COUNTRY_NUMBERL = -1;                                 27520027
         RCBM11HO.COUNTRY_NUMBERC = DFHRED;                             27530027
         WRK_COUNTRY_NUMBER       = '001';                              27540027
         ERROR_FLAG = TRUE;                                             27550027
       END;                                                             27560027
     END;                                                               27570027
                                                                        27580027
     IF VERIFY(RCBM11HI.ACTIONI,'12') ¬= 0 THEN                         27590027
     DO;                                                                27600027
       RCBM11HI.ACTIONL   = -1;                                         27610027
       RCBM11HO.ACTIONC   = DFHRED;                                     27620027
       RCBM11HO.MSG_LINEO = ERR_O101;                                   27630027
       ERROR_FLAG = TRUE;                                               27640027
     END;                                                               27650027
                                                                        27660027
     WRK_ACTION = RCBM11HI.ACTIONI;                                     27670027
                                                                        27680027
     IF ERROR_FLAG = TRUE THEN                                          27690027
     DO;                                                                27700027
       CALL RCBC11M_SEND_MAP_CSR;                                       27710027
     END;                                                               27720027
                                                                        27730027
     IF PF5_FLAG = TRUE THEN                                            27740027
     DO;                                                                27750027
       RCBV0505.PARAMETER_NUMBER   = 'RCB026';                          27760027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 27770027
                                  || WRK_PROGRAM_RUN_TYPE;              27780027
                                                                        27790027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   27800027
       RCBV0505.PARAMETER_VALUE    = WRK_ADDR_TYPE;                     27810027
                                                                        27820027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            27830027
                                                                        27840027
       CALL RCBC11M_UPD_T505;                                           27850027
     END;                                                               27860027
     ELSE                                                               27870027
     DO;                                                                27880027
       WRK_MSG = ERR_O022;                                              27890027
       CALL RCBC11M_FILL_MAP;                                           27900027
       CALL RCBC11M_SEND_MAP;                                           27910027
     END;                                                               27920027
   END;                                                                 27930027
                                                                        27940027
   OTHERWISE                                                            27950027
   DO;                                                                  27960027
     HEADER.NEXT = '00';                                                27970027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11H';                   27980027
     CALL RCBC11M_SEND_MAP;                                             27990027
   END;                                                                 28000027
 END;                                                                   28010027
                                                                        28020027
0END RCBC11M_REC_RCBM11H;                                               28030027
1/********************************************************************/ 28040027
 /*      RECEIVE MAP RCBM11I - RCB036                                */ 28050027
 /********************************************************************/ 28060027
0RCBC11M_REC_RCBM11I : PROC;                                            28070027
                                                                        28080027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      28090027
    MAP('RCBM11I')                                                      28100027
    MAPSET('RCBM11')                                                    28110027
    RESP(RESPONSE)                                                      28120027
    RESP2(CODE_EXPLAIN);                                                28130027
                                                                        28140027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      28150027
   WHEN(DFHRESP(NORMAL))                                                28160027
   DO;                                                                  28170027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        28180027
     ERROR_FLAG = FALSE;                                                28190027
                                                                        28200027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11II.PARAMETER_EFF_DATEI)) THEN      28210027
     DO;                                                                28220027
       RCBM11II.PARAMETER_EFF_DATEL = -1;                               28230027
       RCBM11IO.PARAMETER_EFF_DATEC = DFHRED;                           28240027
       RCBM11IO.MSG_LINEO           = ERR_O101;                         28250027
       ERROR_FLAG = TRUE;                                               28260027
     END;                                                               28270027
                                                                        28280027
     WRK_PARAMETER_EFF_DATE = RCBM11II.PARAMETER_EFF_DATEI;             28290027
                                                                        28300027
     IF VERIFY(RCBM11II.PERF_SYSTEMI, 'CE') ¬= 0 THEN                   28310027
     DO;                                                                28320027
       RCBM11II.PERF_SYSTEML = -1;                                      28330027
       RCBM11IO.PERF_SYSTEMC = DFHRED;                                  28340027
       RCBM11IO.MSG_LINEO     = ERR_O101;                               28350027
       ERROR_FLAG = TRUE;                                               28360027
     END;                                                               28370027
                                                                        28380027
     WRK_PERF_SYSTEM = RCBM11II.PERF_SYSTEMI;                           28390027
                                                                        28400027
     IF RCBM11II.DESCRIPTIONL = 0 THEN                                  28410027
     DO;                                                                28420027
       RCBM11IO.DESCRIPTIONO = ' ';                                     28430027
     END;                                                               28440027
                                                                        28450027
     WRK_DESCRIPTION = RCBM11II.DESCRIPTIONI;                           28460027
                                                                        28470027
     IF RCBM11II.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             28480027
     DO;                                                                28490027
       WRK_COUNTRY_NUMBER = RCBM11II.COUNTRY_NUMBERI;                   28500027
       EXEC CICS LINK                                                   28510027
          PROGRAM('RCBC99P')                                            28520027
          COMMAREA(COMMAREA)                                            28530027
          LENGTH(CSTG(COMMAREA));                                       28540027
                                                                        28550027
       IF OK_FLAG = FALSE THEN                                          28560027
       DO;                                                              28570027
         RCBM11IO.MSG_LINEO       = ERR_O057;                           28580027
         RCBM11II.COUNTRY_NUMBERL = -1;                                 28590027
         RCBM11IO.COUNTRY_NUMBERC = DFHRED;                             28600027
         WRK_COUNTRY_NUMBER       = '001';                              28610027
         ERROR_FLAG = TRUE;                                             28620027
       END;                                                             28630027
                                                                        28640027
       IF CTY_OK_FLAG = FALSE THEN                                      28650027
       DO;                                                              28660027
         RCBM11IO.MSG_LINEO       = ERR_O072;                           28670027
         RCBM11II.COUNTRY_NUMBERL = -1;                                 28680027
         RCBM11IO.COUNTRY_NUMBERC = DFHRED;                             28690027
         WRK_COUNTRY_NUMBER       = '001';                              28700027
         ERROR_FLAG = TRUE;                                             28710027
       END;                                                             28720027
     END;                                                               28730027
                                                                        28740027
     IF VERIFY(RCBM11II.ACTIONI,'12') ¬= 0 THEN                         28750027
     DO;                                                                28760027
       RCBM11II.ACTIONL   = -1;                                         28770027
       RCBM11IO.ACTIONC   = DFHRED;                                     28780027
       RCBM11IO.MSG_LINEO = ERR_O101;                                   28790027
       ERROR_FLAG = TRUE;                                               28800027
     END;                                                               28810027
                                                                        28820027
     WRK_ACTION = RCBM11II.ACTIONI;                                     28830027
                                                                        28840027
     IF ERROR_FLAG = TRUE THEN                                          28850027
     DO;                                                                28860027
       CALL RCBC11M_SEND_MAP_CSR;                                       28870027
     END;                                                               28880027
                                                                        28890027
     IF PF5_FLAG = TRUE THEN                                            28900027
     DO;                                                                28910027
       RCBV0505.PARAMETER_NUMBER   = 'RCB036';                          28920027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                28930027
                                                                        28940027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   28950027
       RCBV0505.PARAMETER_VALUE    = WRK_PERF_SYSTEM;                   28960027
                                                                        28970027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            28980027
                                                                        28990027
       CALL RCBC11M_UPD_T505;                                           29000027
     END;                                                               29010027
     ELSE                                                               29020027
     DO;                                                                29030027
       WRK_MSG = ERR_O022;                                              29040027
       CALL RCBC11M_FILL_MAP;                                           29050027
       CALL RCBC11M_SEND_MAP;                                           29060027
     END;                                                               29070027
   END;                                                                 29080027
                                                                        29090027
   OTHERWISE                                                            29100027
   DO;                                                                  29110027
     HEADER.NEXT = '00';                                                29120027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11I';                   29130027
     CALL RCBC11M_SEND_MAP;                                             29140027
   END;                                                                 29150027
 END;                                                                   29160027
                                                                        29170027
0END RCBC11M_REC_RCBM11I;                                               29180027
1/********************************************************************/ 29190027
 /*      RECEIVE MAP RCBM11J - RCB040                                */ 29200027
 /********************************************************************/ 29210027
0RCBC11M_REC_RCBM11J : PROC;                                            29220027
                                                                        29230027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      29240027
    MAP('RCBM11J')                                                      29250027
    MAPSET('RCBM11')                                                    29260027
    RESP(RESPONSE)                                                      29270027
    RESP2(CODE_EXPLAIN);                                                29280027
                                                                        29290027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      29300027
   WHEN(DFHRESP(NORMAL))                                                29310027
   DO;                                                                  29320027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        29330027
     ERROR_FLAG = FALSE;                                                29340027
                                                                        29350027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11JI.PARAMETER_EFF_DATEI)) THEN      29360027
     DO;                                                                29370027
       RCBM11JI.PARAMETER_EFF_DATEL = -1;                               29380027
       RCBM11JO.PARAMETER_EFF_DATEC = DFHRED;                           29390027
       RCBM11JO.MSG_LINEO           = ERR_O101;                         29400027
       ERROR_FLAG = TRUE;                                               29410027
     END;                                                               29420027
                                                                        29430027
     WRK_PARAMETER_EFF_DATE = RCBM11JI.PARAMETER_EFF_DATEI;             29440027
                                                                        29450027
     WRK_HK_LINE = '';                                                  29460027
     J = 1;                                                             29470027
     DO I = 1 TO 8;                                                     29480027
       IF VERIFY(RCBM11JI.HK_SELI(I),'01') ¬= 0 THEN                    29490027
       DO;                                                              29500027
         RCBM11JI.HK_SELL(I) = -1;                                      29510027
         RCBM11JO.HK_SELC(I) = DFHRED;                                  29520027
         RCBM11JO.MSG_LINEO  = ERR_O101;                                29530027
         ERROR_FLAG = TRUE;                                             29540027
       END;                                                             29550027
       WRK_HK_SEL(I) = RCBM11JI.HK_SELI(I);                             29560027
       SUBSTR(WRK_HK_LINE,J,1) = RCBM11JI.HK_SELI(I);                   29570027
       J = J + 1;                                                       29580027
     END;                                                               29590027
                                                                        29600027
     IF RCBM11JI.RET_PER_POL = 0 THEN                                   29610027
       RCBM11JO.RET_PER_POO  = '';                                      29620027
                                                                        29630027
     WRK_QTY_IN = RCBM11JI.RET_PER_POI;                                 29640027
     WRK_CNT = 5;                                                       29650027
     CALL RCBC11M_VALID_QTY;                                            29660027
                                                                        29670027
     IF OK_FLAG = FALSE THEN                                            29680027
     DO;                                                                29690027
       RCBM11JI.RET_PER_POL = -1;                                       29700027
       RCBM11JO.RET_PER_POC = DFHRED;                                   29710027
       RCBM11JO.MSG_LINEO   = ERR_O101;                                 29720027
       ERROR_FLAG = TRUE;                                               29730027
     END;                                                               29740027
                                                                        29750027
     RCBM11JO.RET_PER_POO = WRK_QTY_IN;                                 29760027
     WRK_RET_PER_PO       = RCBM11JI.RET_PER_POI;                       29770027
                                                                        29780027
     IF RCBM11JI.RET_PER_GLOBALL = 0 THEN                               29790027
       RCBM11JO.RET_PER_GLOBALO  = '';                                  29800027
                                                                        29810027
     WRK_QTY_IN = RCBM11JI.RET_PER_GLOBALI;                             29820027
     WRK_CNT = 5;                                                       29830027
     CALL RCBC11M_VALID_QTY;                                            29840027
                                                                        29850027
     IF OK_FLAG = FALSE THEN                                            29860027
     DO;                                                                29870027
       RCBM11JI.RET_PER_GLOBALL = -1;                                   29880027
       RCBM11JO.RET_PER_GLOBALC = DFHRED;                               29890027
       RCBM11JO.MSG_LINEO       = ERR_O101;                             29900027
       ERROR_FLAG = TRUE;                                               29910027
     END;                                                               29920027
                                                                        29930027
     RCBM11JO.RET_PER_GLOBALO = WRK_QTY_IN;                             29940027
     WRK_RET_PER_GLOBAL       = RCBM11JI.RET_PER_GLOBALI;               29950027
                                                                        29960027
     IF RCBM11JI.DESCRIPTIONL = 0 THEN                                  29970027
     DO;                                                                29980027
       RCBM11JO.DESCRIPTIONO = ' ';                                     29990027
     END;                                                               30000027
                                                                        30010027
     WRK_DESCRIPTION        = RCBM11JI.DESCRIPTIONI;                    30020027
                                                                        30030027
     IF VERIFY(SUBSTR(RCBM11JI.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       30040027
      | VERIFY(SUBSTR(RCBM11JI.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  30050027
     DO;                                                                30060027
       RCBM11JI.PROGRAM_RUN_TYPEL = -1;                                 30070027
       RCBM11JO.PROGRAM_RUN_TYPEC = DFHRED;                             30080027
       RCBM11JO.MSG_LINEO         = ERR_O101;                           30090027
       ERROR_FLAG = TRUE;                                               30100027
     END;                                                               30110027
                                                                        30120027
     WRK_PROGRAM_RUN_TYPE   = RCBM11JI.PROGRAM_RUN_TYPEI;               30130027
                                                                        30140027
     IF RCBM11JI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             30150027
     DO;                                                                30160027
       WRK_COUNTRY_NUMBER = RCBM11JI.COUNTRY_NUMBERI;                   30170027
       EXEC CICS LINK                                                   30180027
          PROGRAM('RCBC99P')                                            30190027
          COMMAREA(COMMAREA)                                            30200027
          LENGTH(CSTG(COMMAREA));                                       30210027
                                                                        30220027
       IF OK_FLAG = FALSE THEN                                          30230027
       DO;                                                              30240027
         RCBM11JO.MSG_LINEO       = ERR_O057;                           30250027
         RCBM11JI.COUNTRY_NUMBERL = -1;                                 30260027
         RCBM11JO.COUNTRY_NUMBERC = DFHRED;                             30270027
         WRK_COUNTRY_NUMBER       = '001';                              30280027
         ERROR_FLAG = TRUE;                                             30290027
       END;                                                             30300027
                                                                        30310027
       IF CTY_OK_FLAG = FALSE THEN                                      30320027
       DO;                                                              30330027
         RCBM11JO.MSG_LINEO       = ERR_O072;                           30340027
         RCBM11JI.COUNTRY_NUMBERL = -1;                                 30350027
         RCBM11JO.COUNTRY_NUMBERC = DFHRED;                             30360027
         WRK_COUNTRY_NUMBER       = '001';                              30370027
         ERROR_FLAG = TRUE;                                             30380027
       END;                                                             30390027
     END;                                                               30400027
                                                                        30410027
     IF VERIFY(RCBM11JI.ACTIONI,'12') ¬= 0 THEN                         30420027
     DO;                                                                30430027
       RCBM11JI.ACTIONL   = -1;                                         30440027
       RCBM11JO.ACTIONC   = DFHRED;                                     30450027
       RCBM11JO.MSG_LINEO = ERR_O101;                                   30460027
       ERROR_FLAG = TRUE;                                               30470027
     END;                                                               30480027
                                                                        30490027
     WRK_ACTION             = RCBM11JI.ACTIONI;                         30500027
                                                                        30510027
     IF ERROR_FLAG = TRUE THEN                                          30520027
     DO;                                                                30530027
       CALL RCBC11M_SEND_MAP_CSR;                                       30540027
     END;                                                               30550027
                                                                        30560027
     IF PF5_FLAG = TRUE THEN                                            30570027
     DO;                                                                30580027
       WRK_RET_PER_GLOBAL_P        = WRK_RET_PER_GLOBAL;                30590027
       WRK_RET_PER_PO_P            = WRK_RET_PER_PO;                    30600027
       RCBV0505.PARAMETER_NUMBER   = 'RCB040';                          30610027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 30620027
                                  || WRK_PROGRAM_RUN_TYPE;              30630027
                                                                        30640027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   30650027
       RCBV0505.PARAMETER_VALUE    = WRK_RET_PER_GLOBAL_P               30660027
                                  || WRK_RET_PER_PO_P                   30670027
                                  || WRK_HK_LINE;                       30680027
                                                                        30690027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            30700027
                                                                        30710027
       CALL RCBC11M_UPD_T505;                                           30720027
     END;                                                               30730027
     ELSE                                                               30740027
     DO;                                                                30750027
       WRK_MSG = ERR_O022;                                              30760027
       CALL RCBC11M_FILL_MAP;                                           30770027
       CALL RCBC11M_SEND_MAP;                                           30780027
     END;                                                               30790027
   END;                                                                 30800027
                                                                        30810027
   OTHERWISE                                                            30820027
   DO;                                                                  30830027
     HEADER.NEXT = '00';                                                30840027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11J';                   30850027
     CALL RCBC11M_SEND_MAP;                                             30860027
   END;                                                                 30870027
 END;                                                                   30880027
                                                                        30890027
0END RCBC11M_REC_RCBM11J;                                               30900027
1/********************************************************************/ 30910027
 /*      RECEIVE MAP RCBM11K - RCB050                                */ 30920027
 /********************************************************************/ 30930027
0RCBC11M_REC_RCBM11K : PROC;                                            30940027
                                                                        30950027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      30960027
    MAP('RCBM11K')                                                      30970027
    MAPSET('RCBM11')                                                    30980027
    RESP(RESPONSE)                                                      30990027
    RESP2(CODE_EXPLAIN);                                                31000027
                                                                        31010027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      31020027
   WHEN(DFHRESP(NORMAL))                                                31030027
   DO;                                                                  31040027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        31050027
     ERROR_FLAG = FALSE;                                                31060027
                                                                        31070027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11KI.PARAMETER_EFF_DATEI)) THEN      31080027
     DO;                                                                31090027
       RCBM11KI.PARAMETER_EFF_DATEL = -1;                               31100027
       RCBM11KO.PARAMETER_EFF_DATEC = DFHRED;                           31110027
       RCBM11KO.MSG_LINEO           = ERR_O101;                         31120027
       ERROR_FLAG = TRUE;                                               31130027
     END;                                                               31140027
                                                                        31150027
     WRK_PARAMETER_EFF_DATE = RCBM11KI.PARAMETER_EFF_DATEI;             31160027
                                                                        31170027
     IF RCBM11KI.NUMBER_OF_DAYSL = 0 THEN                               31180027
       RCBM11KO.NUMBER_OF_DAYSO  = '';                                  31190027
                                                                        31200027
     WRK_QTY_IN = RCBM11KI.NUMBER_OF_DAYSI;                             31210027
     WRK_CNT = 3;                                                       31220027
     CALL RCBC11M_VALID_QTY;                                            31230027
                                                                        31240027
     IF OK_FLAG = FALSE THEN                                            31250027
     DO;                                                                31260027
       RCBM11KI.NUMBER_OF_DAYSL = -1;                                   31270027
       RCBM11KO.NUMBER_OF_DAYSC = DFHRED;                               31280027
       RCBM11KO.MSG_LINEO         = ERR_O101;                           31290027
       ERROR_FLAG = TRUE;                                               31300027
     END;                                                               31310027
                                                                        31320027
     RCBM11KO.NUMBER_OF_DAYSO = WRK_QTY_IN;                             31330027
     WRK_NUMBER_OF_DAYS       = RCBM11KI.NUMBER_OF_DAYSI;               31340027
                                                                        31350027
     IF RCBM11KI.DESCRIPTIONL = 0 THEN                                  31360027
     DO;                                                                31370027
       RCBM11KO.DESCRIPTIONO = ' ';                                     31380027
     END;                                                               31390027
                                                                        31400027
     WRK_DESCRIPTION        = RCBM11KI.DESCRIPTIONI;                    31410027
                                                                        31420027
     IF RCBM11KI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             31430027
     DO;                                                                31440027
       WRK_COUNTRY_NUMBER = RCBM11KI.COUNTRY_NUMBERI;                   31450027
       EXEC CICS LINK                                                   31460027
          PROGRAM('RCBC99P')                                            31470027
          COMMAREA(COMMAREA)                                            31480027
          LENGTH(CSTG(COMMAREA));                                       31490027
                                                                        31500027
       IF OK_FLAG = FALSE THEN                                          31510027
       DO;                                                              31520027
         RCBM11KO.MSG_LINEO       = ERR_O057;                           31530027
         RCBM11KI.COUNTRY_NUMBERL = -1;                                 31540027
         RCBM11KO.COUNTRY_NUMBERC = DFHRED;                             31550027
         WRK_COUNTRY_NUMBER       = '001';                              31560027
         ERROR_FLAG = TRUE;                                             31570027
       END;                                                             31580027
                                                                        31590027
       IF CTY_OK_FLAG = FALSE THEN                                      31600027
       DO;                                                              31610027
         RCBM11KO.MSG_LINEO       = ERR_O072;                           31620027
         RCBM11KI.COUNTRY_NUMBERL = -1;                                 31630027
         RCBM11KO.COUNTRY_NUMBERC = DFHRED;                             31640027
         WRK_COUNTRY_NUMBER       = '001';                              31650027
         ERROR_FLAG = TRUE;                                             31660027
       END;                                                             31670027
     END;                                                               31680027
                                                                        31690027
     IF VERIFY(RCBM11KI.ACTIONI,'12') ¬= 0 THEN                         31700027
     DO;                                                                31710027
       RCBM11KI.ACTIONL   = -1;                                         31720027
       RCBM11KO.ACTIONC   = DFHRED;                                     31730027
       RCBM11KO.MSG_LINEO = ERR_O101;                                   31740027
       ERROR_FLAG = TRUE;                                               31750027
     END;                                                               31760027
                                                                        31770027
     WRK_ACTION             = RCBM11KI.ACTIONI;                         31780027
                                                                        31790027
     IF ERROR_FLAG = TRUE THEN                                          31800027
     DO;                                                                31810027
       CALL RCBC11M_SEND_MAP_CSR;                                       31820027
     END;                                                               31830027
                                                                        31840027
     IF PF5_FLAG = TRUE THEN                                            31850027
     DO;                                                                31860027
       WRK_NUMBER_OF_DAYS_P        = WRK_NUMBER_OF_DAYS;                31870027
       RCBV0505.PARAMETER_NUMBER   = 'RCB050';                          31880027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER;                31890027
                                                                        31900027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   31910027
       RCBV0505.PARAMETER_VALUE    = WRK_NUMBER_OF_DAYS_P;              31920027
                                                                        31930027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            31940027
                                                                        31950027
       CALL RCBC11M_UPD_T505;                                           31960027
     END;                                                               31970027
     ELSE                                                               31980027
     DO;                                                                31990027
       WRK_MSG = ERR_O022;                                              32000027
       CALL RCBC11M_FILL_MAP;                                           32010027
       CALL RCBC11M_SEND_MAP;                                           32020027
     END;                                                               32030027
   END;                                                                 32040027
                                                                        32050027
   OTHERWISE                                                            32060027
   DO;                                                                  32070027
     HEADER.NEXT = '00';                                                32080027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11K';                   32090027
     CALL RCBC11M_SEND_MAP;                                             32100027
   END;                                                                 32110027
 END;                                                                   32120027
                                                                        32130027
0END RCBC11M_REC_RCBM11K;                                               32140027
1/********************************************************************/ 32150027
 /*      RECEIVE MAP RCBM11L - RCB069                                */ 32160027
 /********************************************************************/ 32170027
0RCBC11M_REC_RCBM11L : PROC;                                            32180027
                                                                        32190027
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      32200027
    MAP('RCBM11L')                                                      32210027
    MAPSET('RCBM11')                                                    32220027
    RESP(RESPONSE)                                                      32230027
    RESP2(CODE_EXPLAIN);                                                32240027
                                                                        32250027
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      32260027
   WHEN(DFHRESP(NORMAL))                                                32270027
   DO;                                                                  32280027
     PIC_EXPLAIN = '';            /* INITIALISE RETURN CODES  */        32290027
     ERROR_FLAG = FALSE;                                                32300027
                                                                        32310027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11LI.PARAMETER_EFF_DATEI)) THEN      32320027
     DO;                                                                32330027
       RCBM11LI.PARAMETER_EFF_DATEL = -1;                               32340027
       RCBM11LO.PARAMETER_EFF_DATEC = DFHRED;                           32350027
       RCBM11LO.MSG_LINEO           = ERR_O101;                         32360027
       ERROR_FLAG = TRUE;                                               32370027
     END;                                                               32380027
                                                                        32390027
     WRK_PARAMETER_EFF_DATE = RCBM11LI.PARAMETER_EFF_DATEI;             32400027
                                                                        32410027
     IF RCBM11LI.OU_CODEL = 0 THEN                                      32420027
       RCBM11LO.OU_CODEO  = '';                                         32430027
                                                                        32440027
     IF VERIFY(RCBM11LI.OU_CODEI, ALPHANUM) ¬= 0                        32450027
      | RCBM11LI.OU_CODEI = '' THEN                                     32460027
     DO;                                                                32470027
       RCBM11LI.OU_CODEL  = -1;                                         32480027
       RCBM11LO.OU_CODEC  = DFHRED;                                     32490027
       RCBM11LO.MSG_LINEO = ERR_O101;                                   32500027
       ERROR_FLAG = TRUE;                                               32510027
     END;                                                               32520027
                                                                        32530027
     J = 0;                                                             32540027
     DO I = 7 TO 1 BY -1;                                               32550027
       IF SUBSTR(RCBM11LI.OU_CODEI,I,1) ¬= '' THEN                      32560027
       DO;                                                              32570027
         J = 1;                                                         32580027
       END;                                                             32590027
       ELSE DO;                                                         32600027
         IF J = 1 THEN                                                  32610027
         DO;                                                            32620027
           RCBM11LI.OU_CODEL  = -1;                                     32630027
           RCBM11LO.OU_CODEC  = DFHRED;                                 32640027
           RCBM11LO.MSG_LINEO = ERR_O101;                               32650027
           ERROR_FLAG = TRUE;                                           32660027
         END;                                                           32670027
       END;                                                             32680027
     END;                                                               32690027
                                                                        32700027
     WRK_OU_CODE = RCBM11LI.OU_CODEI;                                   32710027
                                                                        32720027
     IF RCBM11LI.DESCRIPTIONL = 0 THEN                                  32730027
       RCBM11LO.DESCRIPTIONO = ' ';                                     32740027
                                                                        32750027
     WRK_DESCRIPTION = RCBM11LI.DESCRIPTIONI;                           32760027
                                                                        32770027
     IF VERIFY(SUBSTR(RCBM11LI.PROGRAM_RUN_TYPEI,1,1),ALPHA) ¬= 0       32780027
      | VERIFY(SUBSTR(RCBM11LI.PROGRAM_RUN_TYPEI,2,2),NUMER) ¬= 0 THEN  32790027
     DO;                                                                32800027
       RCBM11LI.PROGRAM_RUN_TYPEL = -1;                                 32810027
       RCBM11LO.PROGRAM_RUN_TYPEC = DFHRED;                             32820027
       RCBM11LO.MSG_LINEO         = ERR_O101;                           32830027
       ERROR_FLAG = TRUE;                                               32840027
     END;                                                               32850027
                                                                        32860027
     WRK_PROGRAM_RUN_TYPE = RCBM11LI.PROGRAM_RUN_TYPEI;                 32870027
                                                                        32880027
     IF RCBM11LI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             32890027
     DO;                                                                32900027
       WRK_COUNTRY_NUMBER = RCBM11LI.COUNTRY_NUMBERI;                   32910027
       EXEC CICS LINK                                                   32920027
          PROGRAM('RCBC99P')                                            32930027
          COMMAREA(COMMAREA)                                            32940027
          LENGTH(CSTG(COMMAREA));                                       32950027
                                                                        32960027
       IF OK_FLAG = FALSE THEN                                          32970027
       DO;                                                              32980027
         RCBM11LO.MSG_LINEO       = ERR_O057;                           32990027
         RCBM11LI.COUNTRY_NUMBERL = -1;                                 33000027
         RCBM11LO.COUNTRY_NUMBERC = DFHRED;                             33010027
         WRK_COUNTRY_NUMBER       = '001';                              33020027
         ERROR_FLAG = TRUE;                                             33030027
       END;                                                             33040027
                                                                        33050027
       IF CTY_OK_FLAG = FALSE THEN                                      33060027
       DO;                                                              33070027
         RCBM11LO.MSG_LINEO       = ERR_O072;                           33080027
         RCBM11LI.COUNTRY_NUMBERL = -1;                                 33090027
         RCBM11LO.COUNTRY_NUMBERC = DFHRED;                             33100027
         WRK_COUNTRY_NUMBER       = '001';                              33110027
         ERROR_FLAG = TRUE;                                             33120027
       END;                                                             33130027
     END;                                                               33140027
                                                                        33150027
     IF VERIFY(RCBM11LI.ACTIONI,'12') ¬= 0 THEN                         33160027
     DO;                                                                33170027
       RCBM11LI.ACTIONL   = -1;                                         33180027
       RCBM11LO.ACTIONC   = DFHRED;                                     33190027
       RCBM11LO.MSG_LINEO = ERR_O101;                                   33200027
       ERROR_FLAG = TRUE;                                               33210027
     END;                                                               33220027
                                                                        33230027
     WRK_ACTION = RCBM11LI.ACTIONI;                                     33240027
                                                                        33250027
     IF ERROR_FLAG = TRUE THEN                                          33260027
     DO;                                                                33270027
       CALL RCBC11M_SEND_MAP_CSR;                                       33280027
     END;                                                               33290027
                                                                        33300027
     IF PF5_FLAG = TRUE THEN                                            33310027
     DO;                                                                33320027
       RCBV0505.PARAMETER_NUMBER   = 'RCB069';                          33330027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 33340027
                                  || WRK_PROGRAM_RUN_TYPE;              33350027
                                                                        33360027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   33370027
                                                                        33380027
       IF WRK_OU_CODE              = 'COUNTRY' THEN                     33390027
         RCBV0505.PARAMETER_VALUE  = '';                                33400027
       else                                                             33410027
         RCBV0505.PARAMETER_VALUE  = WRK_OU_CODE;                       33420027
                                                                        33430027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            33440027
                                                                        33450027
       CALL RCBC11M_UPD_T505;                                           33460027
     END;                                                               33470027
     ELSE                                                               33480027
     DO;                                                                33490027
       WRK_MSG = ERR_O022;                                              33500027
       CALL RCBC11M_FILL_MAP;                                           33510027
       CALL RCBC11M_SEND_MAP;                                           33520027
     END;                                                               33530027
   END;                                                                 33540027
                                                                        33550027
   OTHERWISE                                                            33560027
   DO;                                                                  33570027
     HEADER.NEXT = '00';                                                33580027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11L';                   33590027
     CALL RCBC11M_SEND_MAP;                                             33600027
   END;                                                                 33610027
 END;                                                                   33620027
                                                                        33630027
0END RCBC11M_REC_RCBM11L;                                               33640027
1/********************************************************************/ 33650027
 /*      RECEIVE MAP RCBM11M - RCB070                   SOC RB01290  */ 33660027
 /********************************************************************/ 33670027
0RCBC11M_REC_RCBM11M : PROC;                                            33680027
                                                                        33690027
 EXEC CICS RECEIVE                               /*RECEIVE DRIVER MAP*/ 33700027
    MAP('RCBM11M')                                                      33710027
    MAPSET('RCBM11')                                                    33720027
    RESP(RESPONSE)                                                      33730027
    RESP2(CODE_EXPLAIN);                                                33740027
                                                                        33750027
 SELECT(RESPONSE);                                   /*CHECK RESPONSE*/ 33760027
   WHEN(DFHRESP(NORMAL))                                                33770027
   DO;                                                                  33780027
     PIC_EXPLAIN = '';                      /*INITIALISE RETURN CODES*/ 33790027
     ERROR_FLAG = FALSE;                                                33800027
                                                                        33810027
     IF ( ¬ RCBC11M_VALID_DATE(RCBM11MI.PARAMETER_EFF_DATEI)) THEN      33820027
     DO;                                                                33830027
       RCBM11MI.PARAMETER_EFF_DATEL = -1;                               33840027
       RCBM11MO.PARAMETER_EFF_DATEC = DFHRED;                           33850027
       RCBM11MO.MSG_LINEO = ERR_O002;                                   33860027
       ERROR_FLAG = TRUE;                                               33870027
     END;                                                               33880027
                                                                        33890027
     WRK_PARAMETER_EFF_DATE = RCBM11MI.PARAMETER_EFF_DATEI;             33900027
                                                                        33910027
     IF RCBM11MI.MACHINE_STATUSL = 0 THEN                               33920027
       RCBM11MO.MACHINE_STATUSO  = '';                                  33930027
                                                                        33940027
     IF VERIFY(RCBM11MI.MACHINE_STATUSI, ALPHANUM) ¬= 0                 33950027
      | RCBM11MI.MACHINE_STATUSI = '' THEN                              33960027
     DO;                                                                33970027
       RCBM11MI.MACHINE_STATUSL  = -1;                                  33980027
       RCBM11MO.MACHINE_STATUSC = DFHRED;                               33990027
       RCBM11MO.MSG_LINEO = ERR_O101;                                   34000027
       ERROR_FLAG = TRUE;                                               34010027
     END;                                                               34020027
     ELSE DO;                                                           34030027
        IF VERIFY (RCBM11MI.MACHINE_STATUSI, MSLIST) ¬= 0 THEN          34040027
        DO;                                                             34050027
          RCBM11MI.MACHINE_STATUSL = -1;                                34060027
          RCBM11MO.MACHINE_STATUSC = DFHRED;                            34070027
          RCBM11MO.MSG_LINEO = ERR_O217;                                34080027
          ERROR_FLAG = TRUE;                                            34090027
        END;                                                            34100027
        ELSE                                                            34110027
          WRK_MACHINE_STATUS = RCBM11MI.MACHINE_STATUSI;                34120027
     END;                                                               34130027
                                                                        34140027
     IF RCBM11MI.TYPE_OF_MAINTL = 0 THEN                                34150027
       RCBM11MO.TYPE_OF_MAINTO  = '';                                   34160027
                                                                        34170027
     IF VERIFY(RCBM11MI.TYPE_OF_MAINTI, ALPHANUM) ¬= 0                  34180027
      | RCBM11MI.TYPE_OF_MAINTI = '' THEN                               34190027
     DO;                                                                34200027
       RCBM11MI.TYPE_OF_MAINTL  = -1;                                   34210027
       RCBM11MO.TYPE_OF_MAINTC = DFHRED;                                34220027
       RCBM11MO.MSG_LINEO = ERR_O101;                                   34230027
       ERROR_FLAG = TRUE;                                               34240027
     END;                                                               34250027
     ELSE DO;                                                           34260027
       IF VERIFY (RCBM11MI.TYPE_OF_MAINTI, TOMLIST) ¬= 0 THEN           34270027
       DO;                                                              34280027
          RCBM11MI.TYPE_OF_MAINTL = -1;                                 34290027
          RCBM11MO.TYPE_OF_MAINTC = DFHRED;                             34300027
          RCBM11MO.MSG_LINEO = ERR_O215;                                34310027
          ERROR_FLAG = TRUE;                                            34320027
       END;                                                             34330027
       ELSE                                                             34340027
          WRK_TYPE_OF_MAINT = RCBM11MI.TYPE_OF_MAINTI;                  34350027
     END;                                                               34360027
                                                                        34370027
     IF RCBM11MI.TYPE_OF_CONTRACTL = 0 THEN                             34380027
       RCBM11MO.TYPE_OF_CONTRACTO  = '';                                34390027
                                                                        34400027
     IF RCBM11MI.TYPE_OF_CONTRACTI = '' THEN                            34410027
     DO;                                                                34420027
        RCBM11MI.TYPE_OF_CONTRACTL  = -1;                               34430027
        RCBM11MO.TYPE_OF_CONTRACTC  = DFHRED;                           34440027
        RCBM11MO.MSG_LINEO = ERR_O216;                                  34450027
        ERROR_FLAG = TRUE;                                              34460027
     END;                                                               34470027
     ELSE DO;                                                           34480027
        IF VERIFY(RCBM11MI.TYPE_OF_CONTRACTI, ALPHANUM) ¬= 0 THEN       34490027
        DO;                                                             34500027
          RCBM11MI.TYPE_OF_CONTRACTL  = -1;                             34510027
          RCBM11MO.TYPE_OF_CONTRACTC  = DFHRED;                         34520027
          RCBM11MO.MSG_LINEO = ERR_O101;                                34530027
          ERROR_FLAG = TRUE;                                            34540027
        END;                                                            34550027
        ELSE                                                            34560027
           WRK_TYPE_OF_CONTRACT = RCBM11MI.TYPE_OF_CONTRACTI;           34570027
     END;                                                               34580027
                                                                        34590027
     J = 0;                                                             34600027
     DO I = 10 TO 1 BY -1;                                              34610027
       IF SUBSTR(RCBM11MI.TYPE_OF_CONTRACTI,I,1) ¬= '' THEN             34620027
       DO;                                                              34630027
         J = 1;                                                         34640027
       END;                                                             34650027
       ELSE DO;                                                         34660027
         IF J = 1 THEN                                                  34670027
         DO;                                                            34680027
           RCBM11MI.TYPE_OF_CONTRACTL  = -1;                            34690027
           RCBM11MO.TYPE_OF_CONTRACTC  = DFHRED;                        34700027
           RCBM11MO.MSG_LINEO = ERR_O101;                               34710027
           ERROR_FLAG = TRUE;                                           34720027
         END;                                                           34730027
       END;                                                             34740027
     END;                                                               34750027
                                                                        34760027
     IF RCBM11MI.DESCRIPTIONL = 0 THEN                                  34770027
       RCBM11MO.DESCRIPTIONO = '';                                      34780027
                                                                        34790027
     WRK_DESCRIPTION = RCBM11MI.DESCRIPTIONI;                           34800027
                                                                        34810027
                                                                        34820027
     IF RCBM11MI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER THEN             34830027
     DO;                                                                34840027
       WRK_COUNTRY_NUMBER = RCBM11MI.COUNTRY_NUMBERI;                   34850027
       EXEC CICS LINK                                                   34860027
          PROGRAM('RCBC99P')                                            34870027
          COMMAREA(COMMAREA)                                            34880027
          LENGTH(CSTG(COMMAREA));                                       34890027
                                                                        34900027
       IF OK_FLAG = FALSE THEN                                          34910027
       DO;                                                              34920027
         RCBM11MO.MSG_LINEO       = ERR_O057;                           34930027
         RCBM11MI.COUNTRY_NUMBERL = -1;                                 34940027
         RCBM11MO.COUNTRY_NUMBERC = DFHRED;                             34950027
         WRK_COUNTRY_NUMBER       = '001';                              34960027
         ERROR_FLAG = TRUE;                                             34970027
       END;                                                             34980027
                                                                        34990027
       IF CTY_OK_FLAG = FALSE THEN                                      35000027
       DO;                                                              35010027
         RCBM11MO.MSG_LINEO       = ERR_O072;                           35020027
         RCBM11MI.COUNTRY_NUMBERL = -1;                                 35030027
         RCBM11MO.COUNTRY_NUMBERC = DFHRED;                             35040027
         WRK_COUNTRY_NUMBER       = '001';                              35050027
         ERROR_FLAG = TRUE;                                             35060027
       END;                                                             35070027
     END;                                                               35080027
                                                                        35090027
     IF VERIFY(RCBM11MI.ACTIONI,'12') ¬= 0 THEN                         35100027
     DO;                                                                35110027
       RCBM11MI.ACTIONL   = -1;                                         35120027
       RCBM11MO.ACTIONC   = DFHRED;                                     35130027
       RCBM11MO.MSG_LINEO = ERR_O101;                                   35140027
       ERROR_FLAG = TRUE;                                               35150027
     END;                                                               35160027
                                                                        35170027
     WRK_ACTION = RCBM11MI.ACTIONI;                                     35180027
                                                                        35190027
     IF ERROR_FLAG = TRUE THEN                                          35200027
     DO;                                                                35210027
       CALL RCBC11M_SEND_MAP_CSR;                                       35220027
     END;                                                               35230027
                                                                        35240027
     IF PF5_FLAG = TRUE THEN                                            35250027
     DO;                                                                35260027
       RCBV0505.PARAMETER_NUMBER   = 'RCB070';                          35270027
       RCBV0505.PARAMETER_KEY      = WRK_COUNTRY_NUMBER                 35280027
                                  || WRK_TYPE_OF_CONTRACT;              35290027
                                                                        35300027
       RCBV0505.DESCRIPTION        = WRK_DESCRIPTION;                   35310027
                                                                        35320027
       RCBV0505.PARAMETER_VALUE    = WRK_TYPE_OF_MAINT                  35330027
                                  || WRK_MACHINE_STATUS;                35340027
                                                                        35350027
                                                                        35360027
       RCBV0505.PARAMETER_EFF_DATE = WRK_PARAMETER_EFF_DATE;            35370027
                                                                        35380027
       CALL RCBC11M_UPD_T505;                                           35390027
     END;                                                               35400027
     ELSE                                                               35410027
     DO;                                                                35420027
       WRK_MSG = ERR_O022;                                              35430027
       CALL RCBC11M_FILL_MAP;                                           35440027
       CALL RCBC11M_SEND_MAP;                                           35450027
     END;                                                               35460027
   END;                                                                 35470027
                                                                        35480027
   OTHERWISE                                                            35490027
   DO;                                                                  35500027
     HEADER.NEXT = '00';                                                35510027
     RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM11M';                   35520027
     CALL RCBC11M_SEND_MAP;                                             35530027
   END;                                                                 35540027
 END;                                                                   35550027
                                                                        35560027
0END RCBC11M_REC_RCBM11M;                               /*EOC RB01290*/ 35570027
1/********************************************************************/ 35580027
 /*      RECEIVE MAPS FOR HELP/ERROR                                 */ 35590027
 /********************************************************************/ 35600027
0RCBC11M_REC_MAPS: PROC;                                                35610027
                                                                        35620027
 SELECT (HEADER.NEXT);                                                  35630027
   WHEN ('00')                                                          35640027
     EXEC CICS RECEIVE                                                  35650027
        MAP('RCBM110')                                                  35660027
        MAPSET('RCBM11')                                                35670027
        RESP(RESPONSE)                                                  35680027
        RESP2(CODE_EXPLAIN);                                            35690027
   WHEN ('05')                                                          35700027
     EXEC CICS RECEIVE                                                  35710027
        MAP('RCBM111')                                                  35720027
        MAPSET('RCBM11')                                                35730027
        RESP(RESPONSE)                                                  35740027
        RESP2(CODE_EXPLAIN);                                            35750027
   WHEN ('07')                                                          35760027
     EXEC CICS RECEIVE                                                  35770027
        MAP('RCBM112')                                                  35780027
        MAPSET('RCBM11')                                                35790027
        RESP(RESPONSE)                                                  35800027
        RESP2(CODE_EXPLAIN);                                            35810027
   WHEN ('08')                                                          35820027
     EXEC CICS RECEIVE                                                  35830027
        MAP('RCBM113')                                                  35840027
        MAPSET('RCBM11')                                                35850027
        RESP(RESPONSE)                                                  35860027
        RESP2(CODE_EXPLAIN);                                            35870027
   WHEN ('09')                                                          35880027
     EXEC CICS RECEIVE                                                  35890027
        MAP('RCBM114')                                                  35900027
        MAPSET('RCBM11')                                                35910027
        RESP(RESPONSE)                                                  35920027
        RESP2(CODE_EXPLAIN);                                            35930027
   WHEN ('10')                                                          35940027
     EXEC CICS RECEIVE                                                  35950027
        MAP('RCBM115')                                                  35960027
        MAPSET('RCBM11')                                                35970027
        RESP(RESPONSE)                                                  35980027
        RESP2(CODE_EXPLAIN);                                            35990027
   WHEN ('11')                                                          36000027
     EXEC CICS RECEIVE                                                  36010027
        MAP('RCBM116')                                                  36020027
        MAPSET('RCBM11')                                                36030027
        RESP(RESPONSE)                                                  36040027
        RESP2(CODE_EXPLAIN);                                            36050027
   WHEN ('12')                                                          36060027
     EXEC CICS RECEIVE                                                  36070027
        MAP('RCBM117')                                                  36080027
        MAPSET('RCBM11')                                                36090027
        RESP(RESPONSE)                                                  36100027
        RESP2(CODE_EXPLAIN);                                            36110027
   WHEN ('13')                                                          36120027
     EXEC CICS RECEIVE                                                  36130027
        MAP('RCBM118')                                                  36140027
        MAPSET('RCBM11')                                                36150027
        RESP(RESPONSE)                                                  36160027
        RESP2(CODE_EXPLAIN);                                            36170027
   WHEN ('15')                                                          36180027
     EXEC CICS RECEIVE                                                  36190027
        MAP('RCBM119')                                                  36200027
        MAPSET('RCBM11')                                                36210027
        RESP(RESPONSE)                                                  36220027
        RESP2(CODE_EXPLAIN);                                            36230027
   WHEN ('16')                                                          36240027
     EXEC CICS RECEIVE                                                  36250027
        MAP('RCBM11A')                                                  36260027
        MAPSET('RCBM11')                                                36270027
        RESP(RESPONSE)                                                  36280027
        RESP2(CODE_EXPLAIN);                                            36290027
   WHEN ('17')                                                          36300027
     EXEC CICS RECEIVE                                                  36310027
        MAP('RCBM11B')                                                  36320027
        MAPSET('RCBM11')                                                36330027
        RESP(RESPONSE)                                                  36340027
        RESP2(CODE_EXPLAIN);                                            36350027
   WHEN ('18')                                                          36360027
     EXEC CICS RECEIVE                                                  36370027
        MAP('RCBM11C')                                                  36380027
        MAPSET('RCBM11')                                                36390027
        RESP(RESPONSE)                                                  36400027
        RESP2(CODE_EXPLAIN);                                            36410027
   WHEN ('19')                                                          36420027
     EXEC CICS RECEIVE                                                  36430027
        MAP('RCBM11D')                                                  36440027
        MAPSET('RCBM11')                                                36450027
        RESP(RESPONSE)                                                  36460027
        RESP2(CODE_EXPLAIN);                                            36470027
   WHEN ('22')                                                          36480027
     EXEC CICS RECEIVE                                                  36490027
        MAP('RCBM11E')                                                  36500027
        MAPSET('RCBM11')                                                36510027
        RESP(RESPONSE)                                                  36520027
        RESP2(CODE_EXPLAIN);                                            36530027
   WHEN ('23')                                                          36540027
     EXEC CICS RECEIVE                                                  36550027
        MAP('RCBM11F')                                                  36560027
        MAPSET('RCBM11')                                                36570027
        RESP(RESPONSE)                                                  36580027
        RESP2(CODE_EXPLAIN);                                            36590027
   WHEN ('25')                                                          36600027
     EXEC CICS RECEIVE                                                  36610027
        MAP('RCBM11G')                                                  36620027
        MAPSET('RCBM11')                                                36630027
        RESP(RESPONSE)                                                  36640027
        RESP2(CODE_EXPLAIN);                                            36650027
   WHEN ('26')                                                          36660027
     EXEC CICS RECEIVE                                                  36670027
        MAP('RCBM11H')                                                  36680027
        MAPSET('RCBM11')                                                36690027
        RESP(RESPONSE)                                                  36700027
        RESP2(CODE_EXPLAIN);                                            36710027
   WHEN ('36')                                                          36720027
     EXEC CICS RECEIVE                                                  36730027
        MAP('RCBM11I')                                                  36740027
        MAPSET('RCBM11')                                                36750027
        RESP(RESPONSE)                                                  36760027
        RESP2(CODE_EXPLAIN);                                            36770027
   WHEN ('40')                                                          36780027
     EXEC CICS RECEIVE                                                  36790027
        MAP('RCBM11J')                                                  36800027
        MAPSET('RCBM11')                                                36810027
        RESP(RESPONSE)                                                  36820027
        RESP2(CODE_EXPLAIN);                                            36830027
   WHEN ('50')                                                          36840027
     EXEC CICS RECEIVE                                                  36850027
        MAP('RCBM11K')                                                  36860027
        MAPSET('RCBM11')                                                36870027
        RESP(RESPONSE)                                                  36880027
        RESP2(CODE_EXPLAIN);                                            36890027
   WHEN ('69')                                                          36900027
     EXEC CICS RECEIVE                                                  36910027
        MAP('RCBM11L')                                                  36920027
        MAPSET('RCBM11')                                                36930027
        RESP(RESPONSE)                                                  36940027
        RESP2(CODE_EXPLAIN);                                            36950027
   WHEN ('70')                                          /*SOC RB01290*/ 36960027
     EXEC CICS RECEIVE                                                  36970027
        MAP('RCBM11M')                                                  36980027
        MAPSET('RCBM11')                                                36990027
        RESP(RESPONSE)                                                  37000027
        RESP2(CODE_EXPLAIN);                            /*EOC RB01290*/ 37010027
 END;                                                                   37020027
                                                                        37030027
0END RCBC11M_REC_MAPS;                                                  37040027
1/********************************************************************/ 37050027
 /*      SET ERROR MSG FOR PF ERROR                                  */ 37060027
 /********************************************************************/ 37070027
0RCBC11M_SET_ERR: PROC;                                                 37080027
                                                                        37090027
 SELECT (HEADER.NEXT);                                                  37100027
   WHEN ('00')                                                          37110027
   DO;                                                                  37120027
     RCBM110O.MSG_LINEO = ERR_O004;                                     37130027
     RCBM110I.SELL      = -1;                                           37140027
   END;                                                                 37150027
   WHEN ('05')                                                          37160027
   DO;                                                                  37170027
     RCBM111O.MSG_LINEO = ERR_O004;                                     37180027
     RCBM111I.ACTIONL   = -1;                                           37190027
   END;                                                                 37200027
   WHEN ('07')                                                          37210027
   DO;                                                                  37220027
     RCBM112O.MSG_LINEO = ERR_O004;                                     37230027
     RCBM112I.ACTIONL   = -1;                                           37240027
   END;                                                                 37250027
   WHEN ('08')                                                          37260027
   DO;                                                                  37270027
     RCBM113O.MSG_LINEO = ERR_O004;                                     37280027
     RCBM113I.ACTIONL   = -1;                                           37290027
   END;                                                                 37300027
   WHEN ('09')                                                          37310027
   DO;                                                                  37320027
     RCBM114O.MSG_LINEO = ERR_O004;                                     37330027
     RCBM114I.ACTIONL   = -1;                                           37340027
   END;                                                                 37350027
   WHEN ('10')                                                          37360027
   DO;                                                                  37370027
     RCBM115O.MSG_LINEO = ERR_O004;                                     37380027
     RCBM115I.ACTIONL   = -1;                                           37390027
   END;                                                                 37400027
   WHEN ('11')                                                          37410027
   DO;                                                                  37420027
     RCBM116O.MSG_LINEO = ERR_O004;                                     37430027
     RCBM116I.ACTIONL   = -1;                                           37440027
   END;                                                                 37450027
   WHEN ('12')                                                          37460027
   DO;                                                                  37470027
     RCBM117O.MSG_LINEO = ERR_O004;                                     37480027
     RCBM117I.ACTIONL   = -1;                                           37490027
   END;                                                                 37500027
   WHEN ('13')                                                          37510027
   DO;                                                                  37520027
     RCBM118O.MSG_LINEO = ERR_O004;                                     37530027
     RCBM118I.ACTIONL   = -1;                                           37540027
   END;                                                                 37550027
   WHEN ('15')                                                          37560027
   DO;                                                                  37570027
     RCBM119O.MSG_LINEO = ERR_O004;                                     37580027
     RCBM119I.ACTIONL   = -1;                                           37590027
   END;                                                                 37600027
   WHEN ('16')                                                          37610027
   DO;                                                                  37620027
     RCBM11AO.MSG_LINEO = ERR_O004;                                     37630027
     RCBM11AI.ACTIONL   = -1;                                           37640027
   END;                                                                 37650027
   WHEN ('17')                                                          37660027
   DO;                                                                  37670027
     RCBM11BO.MSG_LINEO = ERR_O004;                                     37680027
     RCBM11BI.ACTIONL   = -1;                                           37690027
   END;                                                                 37700027
   WHEN ('18')                                                          37710027
   DO;                                                                  37720027
     RCBM11CO.MSG_LINEO = ERR_O004;                                     37730027
     RCBM11CI.ACTIONL   = -1;                                           37740027
   END;                                                                 37750027
   WHEN ('19')                                                          37760027
   DO;                                                                  37770027
     RCBM11DO.MSG_LINEO = ERR_O004;                                     37780027
     RCBM11DI.ACTIONL   = -1;                                           37790027
   END;                                                                 37800027
   WHEN ('22')                                                          37810027
   DO;                                                                  37820027
     RCBM11EO.MSG_LINEO = ERR_O004;                                     37830027
     RCBM11EI.ACTIONL   = -1;                                           37840027
   END;                                                                 37850027
   WHEN ('23')                                                          37860027
   DO;                                                                  37870027
     RCBM11FO.MSG_LINEO = ERR_O004;                                     37880027
     RCBM11FI.ACTIONL   = -1;                                           37890027
   END;                                                                 37900027
   WHEN ('25')                                                          37910027
   DO;                                                                  37920027
     RCBM11GO.MSG_LINEO = ERR_O004;                                     37930027
     RCBM11GI.ACTIONL   = -1;                                           37940027
   END;                                                                 37950027
   WHEN ('26')                                                          37960027
   DO;                                                                  37970027
     RCBM11HO.MSG_LINEO = ERR_O004;                                     37980027
     RCBM11HI.ACTIONL   = -1;                                           37990027
   END;                                                                 38000027
   WHEN ('36')                                                          38010027
   DO;                                                                  38020027
     RCBM11IO.MSG_LINEO = ERR_O004;                                     38030027
     RCBM11II.ACTIONL   = -1;                                           38040027
   END;                                                                 38050027
   WHEN ('40')                                                          38060027
   DO;                                                                  38070027
     RCBM11JO.MSG_LINEO = ERR_O004;                                     38080027
     RCBM11JI.ACTIONL   = -1;                                           38090027
   END;                                                                 38100027
   WHEN ('50')                                                          38110027
   DO;                                                                  38120027
     RCBM11KO.MSG_LINEO = ERR_O004;                                     38130027
     RCBM11KI.ACTIONL   = -1;                                           38140027
   END;                                                                 38150027
   WHEN ('69')                                                          38160027
   DO;                                                                  38170027
     RCBM11LO.MSG_LINEO = ERR_O004;                                     38180027
     RCBM11LI.ACTIONL   = -1;                                           38190027
   END;                                                                 38200027
   WHEN ('70')                                          /*SOC RB01290*/ 38210027
   DO;                                                                  38220027
     RCBM11MO.MSG_LINEO = ERR_O004;                                     38230027
     RCBM11MI.ACTIONL   = -1;                                           38240027
   END;                                                 /*EOC RB01290*/ 38250027
 END;                                                                   38260027
                                                                        38270027
0END RCBC11M_SET_ERR;                                                   38280027
1/********************************************************************/ 38290027
 /*      UPDATE T505                                                 */ 38300027
 /********************************************************************/ 38310027
0RCBC11M_UPD_T505: PROC;                                                38320027
                                                                        38330027
 IF WRK_ACTION = '1' THEN                                               38340027
 DO;                                                                    38350027
   EXEC SQL                                                             38360027
     INSERT INTO RCBV0505_USER_PARM                                     38370027
     VALUES (:RCBV0505.PARAMETER_NUMBER                                 38380027
            ,:RCBV0505.PARAMETER_KEY                                    38390027
            ,:RCBV0505.PARAMETER_EFF_DATE                               38400027
            ,:RCBV0505.DESCRIPTION                                      38410027
            ,:RCBV0505.PARAMETER_VALUE);                                38420027
                                                                        38430027
     SELECT(SQLCODE);                                                   38440027
       WHEN(0)                                                          38450027
       DO;                                                              38460027
         IF SECOND_FLAG = TRUE THEN RETURN;                             38470027
         CALL RCBC11M_CLEAR_WORK;                                       38480027
     /*  HEADER.NEXT = '00';  */                                        38490027
         WRK_MSG = ERR_O105;                                            38500027
         CALL RCBC11M_FILL_MAP;                                         38510027
     /*  RCBM110O.MSG_LINEO = ERR_O105; */                              38520027
         CALL RCBC11M_SEND_MAP;                                         38530027
       END;                                                             38540027
       WHEN(-803)                                                       38550027
       DO;                                                              38560027
       EXEC SQL                                                         38570027
         DELETE FROM RCBV0505_USER_PARM                                 38580027
         WHERE  PARAMETER_NUMBER   = :RCBV0505.PARAMETER_NUMBER         38590027
           AND  PARAMETER_KEY      = :RCBV0505.PARAMETER_KEY            38600027
           AND  PARAMETER_EFF_DATE = :RCBV0505.PARAMETER_EFF_DATE;      38610027
                                                                        38620027
       EXEC SQL                                                         38630027
         INSERT INTO RCBV0505_USER_PARM                                 38640027
         VALUES (:RCBV0505.PARAMETER_NUMBER                             38650027
                ,:RCBV0505.PARAMETER_KEY                                38660027
                ,:RCBV0505.PARAMETER_EFF_DATE                           38670027
                ,:RCBV0505.DESCRIPTION                                  38680027
                ,:RCBV0505.PARAMETER_VALUE);                            38690027
                                                                        38700027
     /*  EXEC SQL                                                       38710027
         UPDATE RCBV0505_USER_PARM                                      38720027
         SET DESCRIPTION         = :RCBV0505.DESCRIPTION                38730027
            ,USERPARM_VALUE      = :RCBV0505.PARAMETER_VALUE            38740027
            ,PARAMETER_EFF_DATE  = :RCBV0505.PARAMETER_EFF_DATE         38750027
         WHERE  PARAMETER_NUMBER = :RCBV0505.PARAMETER_NUMBER           38760027
           AND  PARAMETER_KEY    = :RCBV0505.PARAMETER_KEY;             38770027
     */                                                                 38780027
         SELECT(SQLCODE);                                               38790027
           WHEN(0)                                                      38800027
           DO;                                                          38810027
             IF SECOND_FLAG = TRUE THEN RETURN;                         38820027
             CALL RCBC11M_CLEAR_WORK;                                   38830027
        /*   HEADER.NEXT = '00';  */                                    38840027
             WRK_MSG = ERR_O105;                                        38850027
             CALL RCBC11M_FILL_MAP;                                     38860027
        /*   RCBM110O.MSG_LINEO = ERR_O105;  */                         38870027
             CALL RCBC11M_SEND_MAP;                                     38880027
           END;                                                         38890027
           OTHERWISE                                                    38900027
           DO;                                                          38910027
             HEADER.NEXT = '00';                                        38920027
             PIC_EXPLAIN = SQLCA.SQLCODE;                               38930027
             RCBM110O.MSG_LINEO = 'UPDATE NOT PERFORMED - DB2 ERROR'    38940027
                           || PIC_EXPLAIN;                              38950027
             CALL RCBC11M_SEND_MAP;                                     38960027
           END;                                                         38970027
         END;                                                           38980027
       END;                                                             38990027
       OTHERWISE                                                        39000027
       DO;                                                              39010027
         HEADER.NEXT = '00';                                            39020027
         PIC_EXPLAIN = SQLCA.SQLCODE;                                   39030027
         RCBM110O.MSG_LINEO = 'UPDATE NOT PERFORMED - DB2 ERROR '       39040027
                           || PIC_EXPLAIN;                              39050027
         CALL RCBC11M_SEND_MAP;                                         39060027
       END;                                                             39070027
     END;                                                               39080027
 END;                                                                   39090027
 IF WRK_ACTION = '2' THEN                                               39100027
 DO;                                                                    39110027
   EXEC SQL                                                             39120027
     DELETE FROM RCBV0505_USER_PARM                                     39130027
     WHERE  PARAMETER_NUMBER   = :RCBV0505.PARAMETER_NUMBER             39140027
       AND  PARAMETER_KEY      = :RCBV0505.PARAMETER_KEY                39150027
       AND  PARAMETER_EFF_DATE = :RCBV0505.PARAMETER_EFF_DATE;          39160027
                                                                        39170027
     SELECT(SQLCODE);                                                   39180027
       WHEN(0)                                                          39190027
       DO;                                                              39200027
         IF SECOND_FLAG = TRUE THEN RETURN;                             39210027
         CALL RCBC11M_CLEAR_WORK;                                       39220027
         WRK_MSG = ERR_O109;                                            39230027
         CALL RCBC11M_FILL_MAP;                                         39240027
     /*  HEADER.NEXT = '00';                                            39250027
         RCBM110O.MSG_LINEO = ERR_O109; */                              39260027
         CALL RCBC11M_SEND_MAP;                                         39270027
       END;                                                             39280027
       WHEN(100)                                                        39290027
       DO;                                                              39300027
         WRK_MSG = 'No records found to delete';                        39310027
         CALL RCBC11M_FILL_MAP;                                         39320027
         CALL RCBC11M_SEND_MAP;                                         39330027
       END;                                                             39340027
       OTHERWISE                                                        39350027
       DO;                                                              39360027
         PIC_EXPLAIN = SQLCA.SQLCODE;                                   39370027
         IF HEADER.NEXT = '05' THEN                                     39380027
         RCBM111O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39390027
                           || PIC_EXPLAIN;                              39400027
         IF HEADER.NEXT = '07' THEN                                     39410027
         RCBM112O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39420027
                           || PIC_EXPLAIN;                              39430027
         IF HEADER.NEXT = '08' THEN                                     39440027
         RCBM113O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39450027
                           || PIC_EXPLAIN;                              39460027
         IF HEADER.NEXT = '09' THEN                                     39470027
         RCBM114O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39480027
                           || PIC_EXPLAIN;                              39490027
         IF HEADER.NEXT = '10' THEN                                     39500027
         RCBM115O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39510027
                           || PIC_EXPLAIN;                              39520027
         IF HEADER.NEXT = '11' THEN                                     39530027
         RCBM116O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39540027
                           || PIC_EXPLAIN;                              39550027
         IF HEADER.NEXT = '12' THEN                                     39560027
         RCBM117O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39570027
                           || PIC_EXPLAIN;                              39580027
         IF HEADER.NEXT = '13' THEN                                     39590027
         RCBM118O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39600027
                           || PIC_EXPLAIN;                              39610027
         IF HEADER.NEXT = '15' THEN                                     39620027
         RCBM119O.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39630027
                           || PIC_EXPLAIN;                              39640027
         IF HEADER.NEXT = '16' THEN                                     39650027
         RCBM11AO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39660027
                           || PIC_EXPLAIN;                              39670027
         IF HEADER.NEXT = '17' THEN                                     39680027
         RCBM11BO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39690027
                           || PIC_EXPLAIN;                              39700027
         IF HEADER.NEXT = '18' THEN                                     39710027
         RCBM11CO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39720027
                           || PIC_EXPLAIN;                              39730027
         IF HEADER.NEXT = '19' THEN                                     39740027
         RCBM11DO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39750027
                           || PIC_EXPLAIN;                              39760027
         IF HEADER.NEXT = '22' THEN                                     39770027
         RCBM11EO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39780027
                           || PIC_EXPLAIN;                              39790027
         IF HEADER.NEXT = '23' THEN                                     39800027
         RCBM11FO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39810027
                           || PIC_EXPLAIN;                              39820027
         IF HEADER.NEXT = '25' THEN                                     39830027
         RCBM11GO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39840027
                           || PIC_EXPLAIN;                              39850027
         IF HEADER.NEXT = '26' THEN                                     39860027
         RCBM11HO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39870027
                           || PIC_EXPLAIN;                              39880027
         IF HEADER.NEXT = '36' THEN                                     39890027
         RCBM11IO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39900027
                           || PIC_EXPLAIN;                              39910027
         IF HEADER.NEXT = '40' THEN                                     39920027
         RCBM11JO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39930027
                           || PIC_EXPLAIN;                              39940027
         IF HEADER.NEXT = '50' THEN                                     39950027
         RCBM11KO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39960027
                           || PIC_EXPLAIN;                              39970027
         IF HEADER.NEXT = '69' THEN                                     39980027
         RCBM11LO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       39990027
                           || PIC_EXPLAIN;                              40000027
                                                        /*SOC RB01290*/ 40010027
         IF HEADER.NEXT = '70' THEN                                     40020027
         RCBM11LO.MSG_LINEO = 'DELETE NOT PERFORMED - DB2 ERROR '       40030027
                           || PIC_EXPLAIN;              /*EOC RB01290*/ 40040027
         CALL RCBC11M_SEND_MAP;                                         40050027
       END;                                                             40060027
     END;                                                               40070027
 END;                                                                   40080027
0END RCBC11M_UPD_T505;                                                  40090027
1/********************************************************************/ 40100027
 /*      VALIDATE DATE PROCESSING                                    */ 40110027
 /********************************************************************/ 40120027
0RCBC11M_VALID_DATE: PROC(A_DATE ) RETURNS(BIT(1));                     40130027
                                                                        40140027
 DCL PTR_DATE_AREA  PTR;                                                40150027
 DCL A_DATE         CHAR(*);                                            40160027
 DCL L_RET          BIT(1) INIT(TRUE);                                  40170027
 PTR_DATE_AREA = ADDR(DATE_AREA);                                       40180027
                                                                        40190027
 DATE_AREA               = '';                                          40200027
 DATE_AREA.WD_IN_FORMAT  = 'ISO';                                       40210027
 DATE_AREA.WD_OUT_FORMAT = 'ISO';                                       40220027
 DATE_AREA.WD_FUNCTION   = 'V';  /*VALIDATE*/                           40230027
 DATE_AREA.WD_IN_DATE    = A_DATE;                                      40240027
 CALL RCB004N (PTR_DATE_AREA);                                          40250027
 /* TEST RESULT FROM RCB004M */                                         40260027
 IF ( DATE_AREA.WD_STATUS ¬= ' ' ) THEN                                 40270027
   DO;                                                                  40280027
     L_RET = FALSE;                                                     40290027
   END;                                                                 40300027
                                                                        40310027
 RETURN( L_RET );                                                       40320027
                                                                        40330027
0END RCBC11M_VALID_DATE;                                                40340027
1/********************************************************************/ 40350027
 /*      VALIDATE QUANTITY PROCESSING                                */ 40360027
 /********************************************************************/ 40370027
0RCBC11M_VALID_QTY: PROC;                                               40380027
                                                                        40390027
 WRK_QTY = '000000000';                                                 40400027
                                                                        40410027
 OK_FLAG = TRUE;                                                        40420027
 L = 0;                                                                 40430027
 M = 0;                                                                 40440027
 O = WRK_CNT;                                                           40450027
                                                                        40460027
 IF WRK_QTY_IN                = ''                                      40470027
  | VERIFY(WRK_QTY_IN, NUMB) ¬= 0 THEN                                  40480027
 DO;                                                                    40490027
   OK_FLAG = FALSE;                                                     40500027
   RETURN;                                                              40510027
 END;                                                                   40520027
                                                                        40530027
 DO I = WRK_CNT TO 1 BY -1;                                             40540027
   IF SUBSTR(WRK_QTY_IN,I,1) = '' THEN                                  40550027
   DO;                                                                  40560027
     IF M = 1 THEN L = 1;                                               40570027
   END;                                                                 40580027
   ELSE DO;                                                             40590027
     IF L = 1 & M = 1 THEN                                              40600027
     DO;                                                                40610027
       OK_FLAG = FALSE;                                                 40620027
       RETURN;                                                          40630027
     END;                                                               40640027
     SUBSTR(WRK_QTY,O,1) = SUBSTR(WRK_QTY_IN,I,1);                      40650027
     O = O - 1;                                                         40660027
     M = 1;                                                             40670027
   END;                                                                 40680027
 END;                                                                   40690027
                                                                        40700027
 WRK_QTY_IN = WRK_QTY;                                                  40710027
                                                                        40720027
0END RCBC11M_VALID_QTY;                                                 40730027
1/********************************************************************/ 40740027
 /*      FILL MAP FROM WRK FIELDS                                    */ 40750027
 /********************************************************************/ 40760027
0RCBC11M_FILL_MAP : PROC;                                               40770027
                                                                        40780027
 SELECT(HEADER.NEXT);                                                   40790027
   WHEN('00')                                                           40800027
   DO;                                                                  40810027
     RCBM110O.COUNTRY_NUMBERO = HEADER.IOPUCTY;                         40820027
     WRK_COUNTRY_NUMBER       = HEADER.IOPUCTY;                         40830027
   END;                                                                 40840027
   WHEN('05')                                                           40850027
   DO;                                                                  40860027
     RCBM111O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 40870027
     RCBM111O.ACTIONO             = WRK_ACTION;                         40880027
     RCBM111O.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               40890027
     RCBM111O.DESCRIPTIONO        = WRK_DESCRIPTION;                    40900027
     RCBM111O.SW_EXTR_VOLUMEO     = WRK_SW_EXTR_VOLUME;                 40910027
     RCBM111O.CU_EXTR_VOLUMEO     = WRK_CU_EXTR_VOLUME;                 40920027
     RCBM111O.ADDRESS_RESO        = WRK_ADDRESS_RES;                    40930027
     RCBM111O.RET_PERIOD_HISTO    = WRK_RET_PERIOD_HIST;                40940027
     RCBM111O.HOR_DATE_FUTO       = WRK_HOR_DATE_FUT;                   40950027
     RCBM111O.PI_TO_RCMSO         = WRK_PI_TO_RCMS;                     40960027
     RCBM111O.PI_TO_BMTO          = WRK_PI_TO_BMT;                      40970027
     RCBM111O.PI_TO_CEREOLSO      = WRK_PI_TO_CEREOLS;                  40980027
     RCBM111O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             40990027
     RCBM111O.MSG_LINEO           = WRK_MSG;                            41000027
   END;                                                                 41010027
   WHEN('07')                                                           41020027
   DO;                                                                  41030027
     RCBM112O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41040027
     RCBM112O.ACTIONO             = WRK_ACTION;                         41050027
     RCBM112O.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               41060027
     RCBM112O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41070027
     RCBM112O.ADDR_LIN_INDO       = WRK_ADDR_LIN_IND;                   41080027
     RCBM112O.MAX_REC_AGE_DIFFO   = WRK_MAX_REC_AGE_DIFF;               41090027
     RCBM112O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41100027
     RCBM112O.MSG_LINEO           = WRK_MSG;                            41110027
   END;                                                                 41120027
   WHEN('08')                                                           41130027
   DO;                                                                  41140027
     RCBM113O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41150027
     RCBM113O.ACTIONO             = WRK_ACTION;                         41160027
     RCBM113O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41170027
     RCBM113O.FEATURE_STORE_INDO  = WRK_FEATURE_STORE_IND;              41180027
     RCBM113O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41190027
     RCBM113O.MSG_LINEO           = WRK_MSG;                            41200027
   END;                                                                 41210027
   WHEN('09')                                                           41220027
   DO;                                                                  41230027
     RCBM114O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41240027
     RCBM114O.ACTIONO             = WRK_ACTION;                         41250027
     RCBM114O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41260027
     DO I = 1 TO 40;                                                    41270027
       RCBM114O.FEATO(I)          = WRK_FEAT(I);                        41280027
     END;                                                               41290027
     RCBM114O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41300027
     RCBM114O.MSG_LINEO           = WRK_MSG;                            41310027
   END;                                                                 41320027
   WHEN('10')                                                           41330027
   DO;                                                                  41340027
     RCBM115O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41350027
     RCBM115O.ACTIONO             = WRK_ACTION;                         41360027
     RCBM115O.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               41370027
     RCBM115O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41380027
     RCBM115O.RCMS_GROUP_IDO      = WRK_RCMS_GROUP_ID;                  41390027
     RCBM115O.EXTRACT_TYPEO       = WRK_EXTRACT_TYPE;                   41400027
     RCBM115O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41410027
     RCBM115O.MSG_LINEO           = WRK_MSG;                            41420027
   END;                                                                 41430027
   WHEN('11')                                                           41440027
   DO;                                                                  41450027
     RCBM116O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41460027
     RCBM116O.ACTIONO             = WRK_ACTION;                         41470027
     RCBM116O.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               41480027
     RCBM116O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41490027
     RCBM116O.OU_CODEO            = WRK_OU_CODE;                        41500027
     RCBM116O.RCMS_GROUP_IDO      = WRK_RCMS_GROUP_ID;                  41510027
     RCBM116O.UPDATE_TYPEO        = WRK_UPDATE_TYPE;                    41520027
     RCBM116O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41530027
     RCBM116O.MSG_LINEO           = WRK_MSG;                            41540027
   END;                                                                 41550027
   WHEN('12')                                                           41560027
   DO;                                                                  41570027
     RCBM117O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41580027
     RCBM117O.ACTIONO             = WRK_ACTION;                         41590027
     RCBM117O.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               41600027
     RCBM117O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41610027
     RCBM117O.PROGRAM_NAMEO       = WRK_PROGRAM_NAME;                   41620027
     RCBM117O.CHECKPOINT_LIMITO   = WRK_CHECKPOINT_LIMIT;               41630027
     RCBM117O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41640027
     RCBM117O.MSG_LINEO           = WRK_MSG;                            41650027
   END;                                                                 41660027
   WHEN('13')                                                           41670027
   DO;                                                                  41680027
     RCBM118O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41690027
     RCBM118O.ACTIONO             = WRK_ACTION;                         41700027
     RCBM118O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41710027
     RCBM118O.MAINT_SYSTEM_HWO    = WRK_MAINT_SYSTEM_HW;                41720027
     RCBM118O.MAINT_SYSTEM_SWO    = WRK_MAINT_SYSTEM_SW;                41730027
     RCBM118O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41740027
     RCBM118O.MSG_LINEO           = WRK_MSG;                            41750027
   END;                                                                 41760027
   WHEN('15')                                                           41770027
   DO;                                                                  41780027
     RCBM119O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41790027
     RCBM119O.ACTIONO             = WRK_ACTION;                         41800027
     RCBM119O.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               41810027
     RCBM119O.DESCRIPTIONO        = WRK_DESCRIPTION;                    41820027
     RCBM119O.PEW_WED_INDO        = WRK_PEW_WED_IND;                    41830027
     RCBM119O.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41840027
     RCBM119O.MSG_LINEO           = WRK_MSG;                            41850027
   END;                                                                 41860027
   WHEN('16')                                                           41870027
   DO;                                                                  41880027
     RCBM11AO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 41890027
     RCBM11AO.ACTIONO             = WRK_ACTION;                         41900027
     RCBM11AO.PROCESS_IDO         = WRK_PROCESS_ID;                     41910027
     RCBM11AO.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               41920027
     RCBM11AO.DESCRIPTIONO        = WRK_DESCRIPTION;                    41930027
     RCBM11AO.OU_REPORTO          = WRK_OU_REPORT;                      41940027
     RCBM11AO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             41950027
     RCBM11AO.MSG_LINEO           = WRK_MSG;                            41960027
   END;                                                                 41970027
   WHEN('17')                                                           41980027
   DO;                                                                  41990027
     RCBM11BO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42000027
     RCBM11BO.ACTIONO             = WRK_ACTION;                         42010027
     RCBM11BO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42020027
     RCBM11BO.AREA_INDICATORO     = WRK_AREA_INDICATOR;                 42030027
     RCBM11BO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42040027
     RCBM11BO.MSG_LINEO           = WRK_MSG;                            42050027
   END;                                                                 42060027
   WHEN('18')                                                           42070027
   DO;                                                                  42080027
     RCBM11CO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42090027
     RCBM11CO.ACTIONO             = WRK_ACTION;                         42100027
     RCBM11CO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42110027
     RCBM11CO.ZIP_CODE_IDO        = WRK_ZIP_CODE_ID;                    42120027
     RCBM11CO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42130027
     RCBM11CO.MSG_LINEO           = WRK_MSG;                            42140027
   END;                                                                 42150027
   WHEN('19')                                                           42160027
   DO;                                                                  42170027
     RCBM11DO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42180027
     RCBM11DO.ACTIONO             = WRK_ACTION;                         42190027
     RCBM11DO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42200027
     RCBM11DO.CHIS_TABLE_INDO     = WRK_CHIS_TABLE_IND;                 42210027
     RCBM11DO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42220027
     RCBM11DO.MSG_LINEO           = WRK_MSG;                            42230027
   END;                                                                 42240027
   WHEN('22')                                                           42250027
   DO;                                                                  42260027
     RCBM11EO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42270027
     RCBM11EO.ACTIONO             = WRK_ACTION;                         42280027
     RCBM11EO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42290027
     RCBM11EO.HORIZON_PERIODO     = WRK_HORIZON_PERIOD;                 42300027
     RCBM11EO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42310027
     RCBM11EO.MSG_LINEO           = WRK_MSG;                            42320027
   END;                                                                 42330027
   WHEN('23')                                                           42340027
   DO;                                                                  42350027
     RCBM11FO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42360027
     RCBM11FO.ACTIONO             = WRK_ACTION;                         42370027
     RCBM11FO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42380027
     RCBM11FO.SOURCE_DC_DOCO      = WRK_SOURCE_DC_DOC;                  42390027
     RCBM11FO.SOURCE_DK_DOCO      = WRK_SOURCE_DK_DOC;                  42400027
     RCBM11FO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42410027
     RCBM11FO.MSG_LINEO           = WRK_MSG;                            42420027
   END;                                                                 42430027
   WHEN('25')                                                           42440027
   DO;                                                                  42450027
     RCBM11GO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42460027
     RCBM11GO.ACTIONO             = WRK_ACTION;                         42470027
     RCBM11GO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42480027
     RCBM11GO.NUMBER_OF_DAYSO     = WRK_NUMBER_OF_DAYS;                 42490027
     RCBM11GO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42500027
     RCBM11GO.MSG_LINEO           = WRK_MSG;                            42510027
   END;                                                                 42520027
   WHEN('26')                                                           42530027
   DO;                                                                  42540027
     RCBM11HO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42550027
     RCBM11HO.ACTIONO             = WRK_ACTION;                         42560027
     RCBM11HO.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               42570027
     RCBM11HO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42580027
     RCBM11HO.ADDR_TYPEO          = WRK_ADDR_TYPE;                      42590027
     RCBM11HO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42600027
     RCBM11HO.MSG_LINEO           = WRK_MSG;                            42610027
   END;                                                                 42620027
   WHEN('36')                                                           42630027
   DO;                                                                  42640027
     RCBM11IO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42650027
     RCBM11IO.ACTIONO             = WRK_ACTION;                         42660027
     RCBM11IO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42670027
     RCBM11IO.PERF_SYSTEMO        = WRK_PERF_SYSTEM;                    42680027
     RCBM11IO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42690027
     RCBM11IO.MSG_LINEO           = WRK_MSG;                            42700027
   END;                                                                 42710027
   WHEN('40')                                                           42720027
   DO;                                                                  42730027
     RCBM11JO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42740027
     RCBM11JO.ACTIONO             = WRK_ACTION;                         42750027
     RCBM11JO.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               42760027
     RCBM11JO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42770027
     RCBM11JO.RET_PER_GLOBALO     = WRK_RET_PER_GLOBAL;                 42780027
     RCBM11JO.RET_PER_POO         = WRK_RET_PER_PO;                     42790027
     DO I = 1 TO 8;                                                     42800027
       RCBM11JO.HK_SELO(I)        = WRK_HK_SEL(I);                      42810027
     END;                                                               42820027
     RCBM11JO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42830027
     RCBM11JO.MSG_LINEO           = WRK_MSG;                            42840027
   END;                                                                 42850027
   WHEN('50')                                                           42860027
   DO;                                                                  42870027
     RCBM11KO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42880027
     RCBM11KO.ACTIONO             = WRK_ACTION;                         42890027
     RCBM11KO.DESCRIPTIONO        = WRK_DESCRIPTION;                    42900027
     RCBM11KO.NUMBER_OF_DAYSO     = WRK_NUMBER_OF_DAYS;                 42910027
     RCBM11KO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             42920027
     RCBM11KO.MSG_LINEO           = WRK_MSG;                            42930027
   END;                                                                 42940027
   WHEN('69')                                                           42950027
   DO;                                                                  42960027
     RCBM11LO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 42970027
     RCBM11LO.ACTIONO             = WRK_ACTION;                         42980027
     RCBM11LO.PROGRAM_RUN_TYPEO   = WRK_PROGRAM_RUN_TYPE;               42990027
     RCBM11LO.DESCRIPTIONO        = WRK_DESCRIPTION;                    43000027
     RCBM11LO.OU_CODEO            = WRK_OU_CODE;                        43010027
     RCBM11LO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             43020027
     RCBM11LO.MSG_LINEO           = WRK_MSG;                            43030027
   END;                                                                 43040027
   WHEN('70')                                           /*SOC RB01290*/ 43050027
   DO;                                                                  43060027
     RCBM11MO.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                 43070027
     RCBM11MO.ACTIONO             = WRK_ACTION;                         43080027
     RCBM11MO.DESCRIPTIONO        = WRK_DESCRIPTION;                    43090027
     RCBM11MO.TYPE_OF_CONTRACTO   = WRK_TYPE_OF_CONTRACT;               43100027
     RCBM11MO.TYPE_OF_MAINTO      = WRK_TYPE_OF_MAINT;                  43110027
     RCBM11MO.MACHINE_STATUSO     = WRK_MACHINE_STATUS;                 43120027
     RCBM11MO.PARAMETER_EFF_DATEO = WRK_PARAMETER_EFF_DATE;             43130027
     RCBM11MO.MSG_LINEO           = WRK_MSG;                            43140027
   END;                                                 /*EOC RB01290*/ 43150027
 END;                                                                   43160027
                                                                        43170027
0END RCBC11M_FILL_MAP;                                                  43180027
1/********************************************************************/ 43190027
 /*      SAVE MAP TO   WRK FIELDS                                    */ 43200027
 /********************************************************************/ 43210027
0RCBC11M_SAVE_MAP : PROC;                                               43220027
                                                                        43230027
 SELECT(HEADER.NEXT);                                                   43240027
   WHEN('00');                                                          43250027
   WHEN('05')                                                           43260027
   DO;                                                                  43270027
     WRK_ACTION             = RCBM111I.ACTIONI;                         43280027
     WRK_PROGRAM_RUN_TYPE   = RCBM111I.PROGRAM_RUN_TYPEI;               43290027
     WRK_DESCRIPTION        = RCBM111I.DESCRIPTIONI;                    43300027
     WRK_SW_EXTR_VOLUME     = RCBM111I.SW_EXTR_VOLUMEI;                 43310027
     WRK_CU_EXTR_VOLUME     = RCBM111I.CU_EXTR_VOLUMEI;                 43320027
     WRK_ADDRESS_RES        = RCBM111I.ADDRESS_RESI;                    43330027
     WRK_RET_PERIOD_HIST    = RCBM111I.RET_PERIOD_HISTI;                43340027
     WRK_HOR_DATE_FUT       = RCBM111I.HOR_DATE_FUTI;                   43350027
     WRK_PI_TO_RCMS         = RCBM111I.PI_TO_RCMSI;                     43360027
     WRK_PI_TO_BMT          = RCBM111I.PI_TO_BMTI;                      43370027
     WRK_PI_TO_CEREOLS      = RCBM111I.PI_TO_CEREOLSI;                  43380027
     WRK_PARAMETER_EFF_DATE = RCBM111I.PARAMETER_EFF_DATEI;             43390027
   END;                                                                 43400027
   WHEN('07')                                                           43410027
   DO;                                                                  43420027
     WRK_ACTION             = RCBM112I.ACTIONI;                         43430027
     WRK_PROGRAM_RUN_TYPE   = RCBM112I.PROGRAM_RUN_TYPEI;               43440027
     WRK_DESCRIPTION        = RCBM112I.DESCRIPTIONI;                    43450027
     WRK_ADDR_LIN_IND       = RCBM112I.ADDR_LIN_INDI;                   43460027
     WRK_MAX_REC_AGE_DIFF   = RCBM112I.MAX_REC_AGE_DIFFI;               43470027
     WRK_PARAMETER_EFF_DATE = RCBM112I.PARAMETER_EFF_DATEI;             43480027
   END;                                                                 43490027
   WHEN('08')                                                           43500027
   DO;                                                                  43510027
     WRK_ACTION             = RCBM113I.ACTIONI;                         43520027
     WRK_DESCRIPTION        = RCBM113I.DESCRIPTIONI;                    43530027
     WRK_FEATURE_STORE_IND  = RCBM113I.FEATURE_STORE_INDI;              43540027
     WRK_PARAMETER_EFF_DATE = RCBM113I.PARAMETER_EFF_DATEI;             43550027
   END;                                                                 43560027
   WHEN('09')                                                           43570027
   DO;                                                                  43580027
     WRK_ACTION             = RCBM114I.ACTIONI;                         43590027
     WRK_DESCRIPTION        = RCBM114I.DESCRIPTIONI;                    43600027
     DO I = 1 TO 40                                                     43610027
       WRK_FEAT(I)          = RCBM114I.FEATI(I);                        43620027
     END;                                                               43630027
     WRK_PARAMETER_EFF_DATE = RCBM114I.PARAMETER_EFF_DATEI;             43640027
   END;                                                                 43650027
   WHEN('10')                                                           43660027
   DO;                                                                  43670027
     WRK_ACTION             = RCBM115I.ACTIONI;                         43680027
     WRK_PROGRAM_RUN_TYPE   = RCBM115I.PROGRAM_RUN_TYPEI;               43690027
     WRK_DESCRIPTION        = RCBM115I.DESCRIPTIONI;                    43700027
     WRK_RCMS_GROUP_ID      = RCBM115I.RCMS_GROUP_IDI;                  43710027
     WRK_EXTRACT_TYPE       = RCBM115I.EXTRACT_TYPEI;                   43720027
     WRK_PARAMETER_EFF_DATE = RCBM115I.PARAMETER_EFF_DATEI;             43730027
   END;                                                                 43740027
   WHEN('11')                                                           43750027
   DO;                                                                  43760027
     WRK_ACTION             = RCBM116I.ACTIONI;                         43770027
     WRK_PROGRAM_RUN_TYPE   = RCBM116I.PROGRAM_RUN_TYPEI;               43780027
     WRK_DESCRIPTION        = RCBM116I.DESCRIPTIONI;                    43790027
     WRK_OU_CODE            = RCBM116I.OU_CODEI;                        43800027
     WRK_RCMS_GROUP_ID      = RCBM116I.RCMS_GROUP_IDI;                  43810027
     WRK_UPDATE_TYPE        = RCBM116I.UPDATE_TYPEI;                    43820027
     WRK_PARAMETER_EFF_DATE = RCBM116I.PARAMETER_EFF_DATEI;             43830027
   END;                                                                 43840027
   WHEN('12')                                                           43850027
   DO;                                                                  43860027
     WRK_ACTION             = RCBM117I.ACTIONI;                         43870027
     WRK_PROGRAM_RUN_TYPE   = RCBM117I.PROGRAM_RUN_TYPEI;               43880027
     WRK_DESCRIPTION        = RCBM117I.DESCRIPTIONI;                    43890027
     WRK_PROGRAM_NAME       = RCBM117I.PROGRAM_NAMEI;                   43900027
     WRK_CHECKPOINT_LIMIT   = RCBM117I.CHECKPOINT_LIMITI;               43910027
     WRK_PARAMETER_EFF_DATE = RCBM117I.PARAMETER_EFF_DATEI;             43920027
   END;                                                                 43930027
   WHEN('13')                                                           43940027
   DO;                                                                  43950027
     WRK_ACTION             = RCBM118I.ACTIONI;                         43960027
     WRK_DESCRIPTION        = RCBM118I.DESCRIPTIONI;                    43970027
     WRK_MAINT_SYSTEM_HW    = RCBM118I.MAINT_SYSTEM_HWI;                43980027
     WRK_MAINT_SYSTEM_SW    = RCBM118I.MAINT_SYSTEM_SWI;                43990027
     WRK_PARAMETER_EFF_DATE = RCBM118I.PARAMETER_EFF_DATEI;             44000027
   END;                                                                 44010027
   WHEN('15')                                                           44020027
   DO;                                                                  44030027
     WRK_ACTION             = RCBM119I.ACTIONI;                         44040027
     WRK_PROGRAM_RUN_TYPE   = RCBM119I.PROGRAM_RUN_TYPEI;               44050027
     WRK_DESCRIPTION        = RCBM119I.DESCRIPTIONI;                    44060027
     WRK_PEW_WED_IND        = RCBM119I.PEW_WED_INDI;                    44070027
     WRK_PARAMETER_EFF_DATE = RCBM119I.PARAMETER_EFF_DATEI;             44080027
   END;                                                                 44090027
   WHEN('16')                                                           44100027
   DO;                                                                  44110027
     WRK_ACTION             = RCBM11AI.ACTIONI;                         44120027
     WRK_PROCESS_ID         = RCBM11AI.PROCESS_IDI;                     44130027
     WRK_PROGRAM_RUN_TYPE   = RCBM11AI.PROGRAM_RUN_TYPEI;               44140027
     WRK_DESCRIPTION        = RCBM11AI.DESCRIPTIONI;                    44150027
     WRK_OU_REPORT          = RCBM11AI.OU_REPORTI;                      44160027
     WRK_PARAMETER_EFF_DATE = RCBM11AI.PARAMETER_EFF_DATEI;             44170027
   END;                                                                 44180027
   WHEN('17')                                                           44190027
   DO;                                                                  44200027
     WRK_ACTION             = RCBM11BI.ACTIONI;                         44210027
     WRK_DESCRIPTION        = RCBM11BI.DESCRIPTIONI;                    44220027
     WRK_AREA_INDICATOR     = RCBM11BI.AREA_INDICATORI;                 44230027
     WRK_PARAMETER_EFF_DATE = RCBM11BI.PARAMETER_EFF_DATEI;             44240027
   END;                                                                 44250027
   WHEN('18')                                                           44260027
   DO;                                                                  44270027
     WRK_ACTION             = RCBM11CI.ACTIONI;                         44280027
     WRK_DESCRIPTION        = RCBM11CI.DESCRIPTIONI;                    44290027
     WRK_ZIP_CODE_ID        = RCBM11CI.ZIP_CODE_IDI;                    44300027
     WRK_PARAMETER_EFF_DATE = RCBM11CI.PARAMETER_EFF_DATEI;             44310027
   END;                                                                 44320027
   WHEN('19')                                                           44330027
   DO;                                                                  44340027
     WRK_ACTION             = RCBM11DI.ACTIONI;                         44350027
     WRK_DESCRIPTION        = RCBM11DI.DESCRIPTIONI;                    44360027
     WRK_CHIS_TABLE_IND     = RCBM11DI.CHIS_TABLE_INDI;                 44370027
     WRK_PARAMETER_EFF_DATE = RCBM11DI.PARAMETER_EFF_DATEI;             44380027
   END;                                                                 44390027
   WHEN('22')                                                           44400027
   DO;                                                                  44410027
     WRK_ACTION             = RCBM11EI.ACTIONI;                         44420027
     WRK_DESCRIPTION        = RCBM11EI.DESCRIPTIONI;                    44430027
     WRK_HORIZON_PERIOD     = RCBM11EI.HORIZON_PERIODI;                 44440027
     WRK_PARAMETER_EFF_DATE = RCBM11EI.PARAMETER_EFF_DATEI;             44450027
   END;                                                                 44460027
   WHEN('23')                                                           44470027
   DO;                                                                  44480027
     WRK_ACTION             = RCBM11FI.ACTIONI;                         44490027
     WRK_DESCRIPTION        = RCBM11FI.DESCRIPTIONI;                    44500027
     WRK_SOURCE_DC_DOC      = RCBM11FI.SOURCE_DC_DOCI;                  44510027
     WRK_SOURCE_DK_DOC      = RCBM11FI.SOURCE_DK_DOCI;                  44520027
     WRK_PARAMETER_EFF_DATE = RCBM11FI.PARAMETER_EFF_DATEI;             44530027
   END;                                                                 44540027
   WHEN('25')                                                           44550027
   DO;                                                                  44560027
     WRK_ACTION             = RCBM11GI.ACTIONI;                         44570027
     WRK_DESCRIPTION        = RCBM11GI.DESCRIPTIONI;                    44580027
     WRK_NUMBER_OF_DAYS     = RCBM11GI.NUMBER_OF_DAYSI;                 44590027
     WRK_PARAMETER_EFF_DATE = RCBM11GI.PARAMETER_EFF_DATEI;             44600027
   END;                                                                 44610027
   WHEN('26')                                                           44620027
   DO;                                                                  44630027
     WRK_ACTION             = RCBM11HI.ACTIONI;                         44640027
     WRK_PROGRAM_RUN_TYPE   = RCBM11HI.PROGRAM_RUN_TYPEI;               44650027
     WRK_DESCRIPTION        = RCBM11HI.DESCRIPTIONI;                    44660027
     WRK_ADDR_TYPE          = RCBM11HI.ADDR_TYPEI;                      44670027
     WRK_PARAMETER_EFF_DATE = RCBM11HI.PARAMETER_EFF_DATEI;             44680027
   END;                                                                 44690027
   WHEN('36')                                                           44700027
   DO;                                                                  44710027
     WRK_ACTION             = RCBM11II.ACTIONI;                         44720027
     WRK_DESCRIPTION        = RCBM11II.DESCRIPTIONI;                    44730027
     WRK_PERF_SYSTEM        = RCBM11II.PERF_SYSTEMI;                    44740027
     WRK_PARAMETER_EFF_DATE = RCBM11II.PARAMETER_EFF_DATEI;             44750027
   END;                                                                 44760027
   WHEN('40')                                                           44770027
   DO;                                                                  44780027
     WRK_ACTION             = RCBM11JI.ACTIONI;                         44790027
     WRK_PROGRAM_RUN_TYPE   = RCBM11JI.PROGRAM_RUN_TYPEI;               44800027
     WRK_DESCRIPTION        = RCBM11JI.DESCRIPTIONI;                    44810027
     WRK_RET_PER_GLOBAL     = RCBM11JI.RET_PER_GLOBALI;                 44820027
     WRK_RET_PER_PO         = RCBM11JI.RET_PER_POI;                     44830027
     DO I = 1 TO 8                                                      44840027
       WRK_HK_SEL(I)        = RCBM11JI.HK_SELI(I);                      44850027
     END;                                                               44860027
     WRK_PARAMETER_EFF_DATE = RCBM11JI.PARAMETER_EFF_DATEI;             44870027
   END;                                                                 44880027
   WHEN('50')                                                           44890027
   DO;                                                                  44900027
     WRK_ACTION             = RCBM11KI.ACTIONI;                         44910027
     WRK_DESCRIPTION        = RCBM11KI.DESCRIPTIONI;                    44920027
     WRK_NUMBER_OF_DAYS     = RCBM11KI.NUMBER_OF_DAYSI;                 44930027
     WRK_PARAMETER_EFF_DATE = RCBM11KI.PARAMETER_EFF_DATEI;             44940027
   END;                                                                 44950027
   WHEN('69')                                                           44960027
   DO;                                                                  44970027
     WRK_ACTION             = RCBM11LI.ACTIONI;                         44980027
     WRK_PROGRAM_RUN_TYPE   = RCBM11LI.PROGRAM_RUN_TYPEI;               44990027
     WRK_DESCRIPTION        = RCBM11LI.DESCRIPTIONI;                    45000027
     WRK_OU_CODE            = RCBM11LI.OU_CODEI;                        45010027
     WRK_PARAMETER_EFF_DATE = RCBM11LI.PARAMETER_EFF_DATEI;             45020027
   END;                                                                 45030027
   WHEN('70')                                           /*SOC RB01290*/ 45040027
   DO;                                                                  45050027
     WRK_ACTION             = RCBM11MI.ACTIONI;                         45060027
     WRK_DESCRIPTION        = RCBM11MI.DESCRIPTIONI;                    45070027
     WRK_TYPE_OF_CONTRACT   = RCBM11MI.TYPE_OF_CONTRACTI;               45080027
     WRK_TYPE_OF_MAINT      = RCBM11MI.TYPE_OF_MAINTI;                  45090027
     WRK_MACHINE_STATUS     = RCBM11MI.MACHINE_STATUSI;                 45100027
     WRK_PARAMETER_EFF_DATE = RCBM11MI.PARAMETER_EFF_DATEI;             45110027
   END;                                                 /*EOC RB01290*/ 45120027
 END;                                                                   45130027
                                                                        45140027
0END RCBC11M_SAVE_MAP;                                                  45150027
1/********************************************************************/ 45160027
 /*      GET RCBT0040 RECORD                                         */ 45170027
 /********************************************************************/ 45180027
0RCBC11M_GET_T040: PROC;                                                45190027
                                                                        45200027
 T040_FLAG = FALSE;                                                     45210027
                                                                        45220027
 EXEC SQL                                                               45230027
   SELECT COUNT(*)                                                      45240027
   INTO :O                                                              45250027
   FROM RCBV0040_OU                                                     45260027
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           45270027
     AND OU_CODE        = :WRK_OU_CODE;                                 45280027
                                                                        45290027
 IF O ¬= 0 THEN                                                         45300027
 DO;                                                                    45310027
   T040_FLAG = TRUE;                                                    45320027
 END;                                                                   45330027
                                                                        45340027
0END RCBC11M_GET_T040;                                                  45350027
1/********************************************************************/ 45360027
 /*      GET CURSOR POSITION                                         */ 45370027
 /*         FOR RETURN FROM HELP SCREENS                             */ 45380027
 /********************************************************************/ 45390027
0RCBC11M_GET_CSR_POS: PROC;                                             45400027
                                                                        45410027
 SELECT(HEADER.NEXT);                                                   45420027
   WHEN('00')                                                           45430027
   DO;                                                                  45440027
     RCBM110I.SELL(1) = -1;                                             45450027
   END;                                                                 45460027
                                                                        45470027
   WHEN('05')                                                           45480027
   DO;                                                                  45490027
     SELECT(CSR_POS);                                                   45500027
       WHEN(1)  RCBM111I.ACTIONL             = -1;                      45510027
       WHEN(2)  RCBM111I.PROGRAM_RUN_TYPEL   = -1;                      45520027
       WHEN(3)  RCBM111I.DESCRIPTIONL        = -1;                      45530027
       WHEN(4)  RCBM111I.SW_EXTR_VOLUMEL     = -1;                      45540027
       WHEN(5)  RCBM111I.CU_EXTR_VOLUMEL     = -1;                      45550027
       WHEN(6)  RCBM111I.ADDRESS_RESL        = -1;                      45560027
       WHEN(7)  RCBM111I.RET_PERIOD_HISTL    = -1;                      45570027
       WHEN(8)  RCBM111I.HOR_DATE_FUTL       = -1;                      45580027
       WHEN(9)  RCBM111I.PI_TO_RCMSL         = -1;                      45590027
       WHEN(10) RCBM111I.PI_TO_BMTL          = -1;                      45600027
       WHEN(11) RCBM111I.PI_TO_CEREOLSL      = -1;                      45610027
       WHEN(12) RCBM111I.PARAMETER_EFF_DATEL = -1;                      45620027
       WHEN(13) RCBM111I.COUNTRY_NUMBERL     = -1;                      45630027
       OTHERWISE RCBM111I.ACTIONL            = -1;                      45640027
     END;                                                               45650027
   END;                                                                 45660027
                                                                        45670027
   WHEN('07')                                                           45680027
   DO;                                                                  45690027
     SELECT(CSR_POS);                                                   45700027
       WHEN(1)  RCBM112I.ACTIONL             = -1;                      45710027
       WHEN(2)  RCBM112I.PROGRAM_RUN_TYPEL   = -1;                      45720027
       WHEN(3)  RCBM112I.DESCRIPTIONL        = -1;                      45730027
       WHEN(4)  RCBM112I.ADDR_LIN_INDL       = -1;                      45740027
       WHEN(5)  RCBM112I.MAX_REC_AGE_DIFFL   = -1;                      45750027
       WHEN(6)  RCBM112I.PARAMETER_EFF_DATEL = -1;                      45760027
       WHEN(7)  RCBM112I.COUNTRY_NUMBERL     = -1;                      45770027
       OTHERWISE RCBM112I.ACTIONL            = -1;                      45780027
     END;                                                               45790027
   END;                                                                 45800027
                                                                        45810027
   WHEN('08')                                                           45820027
   DO;                                                                  45830027
     SELECT(CSR_POS);                                                   45840027
       WHEN(1)  RCBM113I.ACTIONL             = -1;                      45850027
       WHEN(2)  RCBM113I.DESCRIPTIONL        = -1;                      45860027
       WHEN(3)  RCBM113I.FEATURE_STORE_INDL  = -1;                      45870027
       WHEN(4)  RCBM113I.PARAMETER_EFF_DATEL = -1;                      45880027
       WHEN(5)  RCBM113I.COUNTRY_NUMBERL     = -1;                      45890027
       OTHERWISE RCBM113I.ACTIONL            = -1;                      45900027
     END;                                                               45910027
   END;                                                                 45920027
                                                                        45930027
   WHEN('09')                                                           45940027
   DO;                                                                  45950027
     SELECT(CSR_POS);                                                   45960027
       WHEN(1)  RCBM114I.ACTIONL             = -1;                      45970027
       WHEN(2)  RCBM114I.DESCRIPTIONL        = -1;                      45980027
       WHEN(3)  RCBM114I.FEATL(CSR_ROW)      = -1;                      45990027
       WHEN(4)  RCBM114I.PARAMETER_EFF_DATEL = -1;                      46000027
       WHEN(5)  RCBM114I.COUNTRY_NUMBERL     = -1;                      46010027
       OTHERWISE RCBM114I.ACTIONL            = -1;                      46020027
     END;                                                               46030027
   END;                                                                 46040027
                                                                        46050027
   WHEN('10')                                                           46060027
   DO;                                                                  46070027
     SELECT(CSR_POS);                                                   46080027
       WHEN(1)  RCBM115I.ACTIONL             = -1;                      46090027
       WHEN(2)  RCBM115I.PROGRAM_RUN_TYPEL   = -1;                      46100027
       WHEN(3)  RCBM115I.RCMS_GROUP_IDL      = -1;                      46110027
       WHEN(4)  RCBM115I.DESCRIPTIONL        = -1;                      46120027
       WHEN(5)  RCBM115I.EXTRACT_TYPEL       = -1;                      46130027
       WHEN(6)  RCBM115I.PARAMETER_EFF_DATEL = -1;                      46140027
       WHEN(7)  RCBM115I.COUNTRY_NUMBERL     = -1;                      46150027
       OTHERWISE RCBM115I.ACTIONL            = -1;                      46160027
     END;                                                               46170027
   END;                                                                 46180027
                                                                        46190027
   WHEN('11')                                                           46200027
   DO;                                                                  46210027
     SELECT(CSR_POS);                                                   46220027
       WHEN(1)  RCBM116I.ACTIONL             = -1;                      46230027
       WHEN(2)  RCBM116I.PROGRAM_RUN_TYPEL   = -1;                      46240027
       WHEN(3)  RCBM116I.OU_CODEL            = -1;                      46250027
       WHEN(4)  RCBM116I.RCMS_GROUP_IDL      = -1;                      46260027
       WHEN(5)  RCBM116I.DESCRIPTIONL        = -1;                      46270027
       WHEN(6)  RCBM116I.UPDATE_TYPEL        = -1;                      46280027
       WHEN(7)  RCBM116I.PARAMETER_EFF_DATEL = -1;                      46290027
       WHEN(8)  RCBM116I.COUNTRY_NUMBERL     = -1;                      46300027
       OTHERWISE RCBM116I.ACTIONL            = -1;                      46310027
     END;                                                               46320027
   END;                                                                 46330027
                                                                        46340027
   WHEN('12')                                                           46350027
   DO;                                                                  46360027
     SELECT(CSR_POS);                                                   46370027
       WHEN(1)  RCBM117I.ACTIONL             = -1;                      46380027
       WHEN(2)  RCBM117I.PROGRAM_RUN_TYPEL   = -1;                      46390027
       WHEN(3)  RCBM117I.PROGRAM_NAMEL       = -1;                      46400027
       WHEN(4)  RCBM117I.DESCRIPTIONL        = -1;                      46410027
       WHEN(5)  RCBM117I.CHECKPOINT_LIMITL   = -1;                      46420027
       WHEN(6)  RCBM117I.PARAMETER_EFF_DATEL = -1;                      46430027
       WHEN(7)  RCBM117I.COUNTRY_NUMBERL     = -1;                      46440027
       OTHERWISE RCBM117I.ACTIONL            = -1;                      46450027
     END;                                                               46460027
   END;                                                                 46470027
                                                                        46480027
   WHEN('13')                                                           46490027
   DO;                                                                  46500027
     SELECT(CSR_POS);                                                   46510027
       WHEN(1)  RCBM118I.ACTIONL             = -1;                      46520027
       WHEN(2)  RCBM118I.DESCRIPTIONL        = -1;                      46530027
       WHEN(3)  RCBM118I.MAINT_SYSTEM_HWL    = -1;                      46540027
       WHEN(4)  RCBM118I.MAINT_SYSTEM_SWL    = -1;                      46550027
       WHEN(5)  RCBM118I.PARAMETER_EFF_DATEL = -1;                      46560027
       WHEN(6)  RCBM118I.COUNTRY_NUMBERL     = -1;                      46570027
       OTHERWISE RCBM118I.ACTIONL            = -1;                      46580027
     END;                                                               46590027
   END;                                                                 46600027
                                                                        46610027
   WHEN('15')                                                           46620027
   DO;                                                                  46630027
     SELECT(CSR_POS);                                                   46640027
       WHEN(1)  RCBM119I.ACTIONL             = -1;                      46650027
       WHEN(2)  RCBM119I.PROGRAM_RUN_TYPEL   = -1;                      46660027
       WHEN(3)  RCBM119I.DESCRIPTIONL        = -1;                      46670027
       WHEN(4)  RCBM119I.PEW_WED_INDL        = -1;                      46680027
       WHEN(5)  RCBM119I.PARAMETER_EFF_DATEL = -1;                      46690027
       WHEN(6)  RCBM119I.COUNTRY_NUMBERL     = -1;                      46700027
       OTHERWISE RCBM119I.ACTIONL            = -1;                      46710027
     END;                                                               46720027
   END;                                                                 46730027
                                                                        46740027
   WHEN('16')                                                           46750027
   DO;                                                                  46760027
     SELECT(CSR_POS);                                                   46770027
       WHEN(1)  RCBM11AI.ACTIONL             = -1;                      46780027
       WHEN(2)  RCBM11AI.PROCESS_IDL         = -1;                      46790027
       WHEN(3)  RCBM11AI.PROGRAM_RUN_TYPEL   = -1;                      46800027
       WHEN(4)  RCBM11AI.DESCRIPTIONL        = -1;                      46810027
       WHEN(5)  RCBM11AI.OU_REPORTL          = -1;                      46820027
       WHEN(6)  RCBM11AI.PARAMETER_EFF_DATEL = -1;                      46830027
       WHEN(7)  RCBM11AI.COUNTRY_NUMBERL     = -1;                      46840027
       OTHERWISE RCBM11AI.ACTIONL            = -1;                      46850027
     END;                                                               46860027
   END;                                                                 46870027
                                                                        46880027
   WHEN('17')                                                           46890027
   DO;                                                                  46900027
     SELECT(CSR_POS);                                                   46910027
       WHEN(1)  RCBM11BI.ACTIONL             = -1;                      46920027
       WHEN(2)  RCBM11BI.DESCRIPTIONL        = -1;                      46930027
       WHEN(3)  RCBM11BI.AREA_INDICATORL     = -1;                      46940027
       WHEN(4)  RCBM11BI.PARAMETER_EFF_DATEL = -1;                      46950027
       WHEN(5)  RCBM11BI.COUNTRY_NUMBERL     = -1;                      46960027
       OTHERWISE RCBM11BI.ACTIONL            = -1;                      46970027
     END;                                                               46980027
   END;                                                                 46990027
                                                                        47000027
   WHEN('18')                                                           47010027
   DO;                                                                  47020027
     SELECT(CSR_POS);                                                   47030027
       WHEN(1)  RCBM11CI.ACTIONL             = -1;                      47040027
       WHEN(2)  RCBM11CI.DESCRIPTIONL        = -1;                      47050027
       WHEN(3)  RCBM11CI.ZIP_CODE_IDL        = -1;                      47060027
       WHEN(4)  RCBM11CI.PARAMETER_EFF_DATEL = -1;                      47070027
       WHEN(5)  RCBM11CI.COUNTRY_NUMBERL     = -1;                      47080027
       OTHERWISE RCBM11CI.ACTIONL            = -1;                      47090027
     END;                                                               47100027
   END;                                                                 47110027
                                                                        47120027
   WHEN('19')                                                           47130027
   DO;                                                                  47140027
     SELECT(CSR_POS);                                                   47150027
       WHEN(1)  RCBM11DI.ACTIONL             = -1;                      47160027
       WHEN(2)  RCBM11DI.DESCRIPTIONL        = -1;                      47170027
       WHEN(3)  RCBM11DI.CHIS_TABLE_INDL     = -1;                      47180027
       WHEN(4)  RCBM11DI.PARAMETER_EFF_DATEL = -1;                      47190027
       WHEN(5)  RCBM11DI.COUNTRY_NUMBERL     = -1;                      47200027
       OTHERWISE RCBM11DI.ACTIONL            = -1;                      47210027
     END;                                                               47220027
   END;                                                                 47230027
                                                                        47240027
   WHEN('22')                                                           47250027
   DO;                                                                  47260027
     SELECT(CSR_POS);                                                   47270027
       WHEN(1)  RCBM11EI.ACTIONL             = -1;                      47280027
       WHEN(2)  RCBM11EI.DESCRIPTIONL        = -1;                      47290027
       WHEN(3)  RCBM11EI.HORIZON_PERIODL     = -1;                      47300027
       WHEN(4)  RCBM11EI.PARAMETER_EFF_DATEL = -1;                      47310027
       WHEN(5)  RCBM11EI.COUNTRY_NUMBERL     = -1;                      47320027
       OTHERWISE RCBM11EI.ACTIONL            = -1;                      47330027
     END;                                                               47340027
   END;                                                                 47350027
                                                                        47360027
   WHEN('23')                                                           47370027
   DO;                                                                  47380027
     SELECT(CSR_POS);                                                   47390027
       WHEN(1)  RCBM11FI.ACTIONL             = -1;                      47400027
       WHEN(2)  RCBM11FI.DESCRIPTIONL        = -1;                      47410027
       WHEN(3)  RCBM11FI.SOURCE_DC_DOCL      = -1;                      47420027
       WHEN(4)  RCBM11FI.SOURCE_DK_DOCL      = -1;                      47430027
       WHEN(5)  RCBM11FI.PARAMETER_EFF_DATEL = -1;                      47440027
       WHEN(6)  RCBM11FI.COUNTRY_NUMBERL     = -1;                      47450027
       OTHERWISE RCBM11FI.ACTIONL            = -1;                      47460027
     END;                                                               47470027
   END;                                                                 47480027
                                                                        47490027
   WHEN('25')                                                           47500027
   DO;                                                                  47510027
     SELECT(CSR_POS);                                                   47520027
       WHEN(1)  RCBM11GI.ACTIONL             = -1;                      47530027
       WHEN(2)  RCBM11GI.DESCRIPTIONL        = -1;                      47540027
       WHEN(3)  RCBM11GI.NUMBER_OF_DAYSL     = -1;                      47550027
       WHEN(4)  RCBM11GI.PARAMETER_EFF_DATEL = -1;                      47560027
       WHEN(5)  RCBM11GI.COUNTRY_NUMBERL     = -1;                      47570027
       OTHERWISE RCBM11GI.ACTIONL            = -1;                      47580027
     END;                                                               47590027
   END;                                                                 47600027
                                                                        47610027
   WHEN('26')                                                           47620027
   DO;                                                                  47630027
     SELECT(CSR_POS);                                                   47640027
       WHEN(1)  RCBM11HI.ACTIONL             = -1;                      47650027
       WHEN(2)  RCBM11HI.PROGRAM_RUN_TYPEL   = -1;                      47660027
       WHEN(3)  RCBM11HI.DESCRIPTIONL        = -1;                      47670027
       WHEN(4)  RCBM11HI.ADDR_TYPEL          = -1;                      47680027
       WHEN(5)  RCBM11HI.PARAMETER_EFF_DATEL = -1;                      47690027
       WHEN(6)  RCBM11HI.COUNTRY_NUMBERL     = -1;                      47700027
       OTHERWISE RCBM11HI.ACTIONL            = -1;                      47710027
     END;                                                               47720027
   END;                                                                 47730027
                                                                        47740027
   WHEN('36')                                                           47750027
   DO;                                                                  47760027
     SELECT(CSR_POS);                                                   47770027
       WHEN(1)  RCBM11II.ACTIONL             = -1;                      47780027
       WHEN(2)  RCBM11II.DESCRIPTIONL        = -1;                      47790027
       WHEN(3)  RCBM11II.PERF_SYSTEML        = -1;                      47800027
       WHEN(4)  RCBM11II.PARAMETER_EFF_DATEL = -1;                      47810027
       WHEN(5)  RCBM11II.COUNTRY_NUMBERL     = -1;                      47820027
       OTHERWISE RCBM11II.ACTIONL            = -1;                      47830027
     END;                                                               47840027
   END;                                                                 47850027
                                                                        47860027
   WHEN('40')                                                           47870027
   DO;                                                                  47880027
     SELECT(CSR_POS);                                                   47890027
       WHEN(1)  RCBM11JI.ACTIONL             = -1;                      47900027
       WHEN(2)  RCBM11JI.PROGRAM_RUN_TYPEL   = -1;                      47910027
       WHEN(3)  RCBM11JI.DESCRIPTIONL        = -1;                      47920027
       WHEN(4)  RCBM11JI.RET_PER_GLOBALL     = -1;                      47930027
       WHEN(5)  RCBM11JI.RET_PER_POL         = -1;                      47940027
       WHEN(6)  RCBM11JI.HK_SELL(CSR_ROW)    = -1;                      47950027
       WHEN(7)  RCBM11JI.PARAMETER_EFF_DATEL = -1;                      47960027
       WHEN(8)  RCBM11JI.COUNTRY_NUMBERL     = -1;                      47970027
       OTHERWISE RCBM11JI.ACTIONL            = -1;                      47980027
     END;                                                               47990027
   END;                                                                 48000027
                                                                        48010027
   WHEN('50')                                                           48020027
   DO;                                                                  48030027
     SELECT(CSR_POS);                                                   48040027
       WHEN(1)  RCBM11KI.ACTIONL             = -1;                      48050027
       WHEN(2)  RCBM11KI.DESCRIPTIONL        = -1;                      48060027
       WHEN(3)  RCBM11KI.NUMBER_OF_DAYSL     = -1;                      48070027
       WHEN(4)  RCBM11KI.PARAMETER_EFF_DATEL = -1;                      48080027
       WHEN(5)  RCBM11KI.COUNTRY_NUMBERL     = -1;                      48090027
       OTHERWISE RCBM11KI.ACTIONL            = -1;                      48100027
     END;                                                               48110027
   END;                                                                 48120027
                                                                        48130027
   WHEN('69')                                                           48140027
   DO;                                                                  48150027
     SELECT(CSR_POS);                                                   48160027
       WHEN(1)  RCBM11LI.ACTIONL             = -1;                      48170027
       WHEN(2)  RCBM11LI.PROGRAM_RUN_TYPEL   = -1;                      48180027
       WHEN(3)  RCBM11LI.DESCRIPTIONL        = -1;                      48190027
       WHEN(4)  RCBM11LI.OU_CODEL            = -1;                      48200027
       WHEN(5)  RCBM11LI.PARAMETER_EFF_DATEL = -1;                      48210027
       WHEN(6)  RCBM11LI.COUNTRY_NUMBERL     = -1;                      48220027
       OTHERWISE RCBM11LI.ACTIONL            = -1;                      48230027
     END;                                                               48240027
   END;                                                                 48250027
   WHEN('70')                                           /*SOC RB01290*/ 48260027
   DO;                                                                  48270027
     SELECT(CSR_POS);                                                   48280027
       WHEN(1)  RCBM11MI.ACTIONL             = -1;                      48290027
       WHEN(2)  RCBM11MI.DESCRIPTIONL        = -1;                      48300027
       WHEN(3)  RCBM11MI.TYPE_OF_CONTRACTL   = -1;                      48310027
       WHEN(4)  RCBM11MI.TYPE_OF_MAINTL      = -1;                      48320027
       WHEN(5)  RCBM11MI.MACHINE_STATUSL     = -1;                      48330027
       WHEN(6)  RCBM11MI.PARAMETER_EFF_DATEL = -1;                      48340027
       WHEN(7)  RCBM11MI.COUNTRY_NUMBERL     = -1;                      48350027
       OTHERWISE RCBM11MI.ACTIONL            = -1;                      48360027
     END;                                                               48370027
   END;                                                 /*EOC RB01290*/ 48380027
                                                                        48390027
 END;                                                                   48400027
                                                                        48410027
0END RCBC11M_GET_CSR_POS;                                               48420027
1/********************************************************************/ 48430027
 /*      SEND MAP                                                    */ 48440027
 /********************************************************************/ 48450027
0RCBC11M_SEND_MAP : PROC;                                               48460027
                                                                        48470027
 SELECT(HEADER.NEXT);                                                   48480027
   WHEN('00')                                                           48490027
   DO;                                                                  48500027
     EXEC CICS SEND                                                     48510027
        MAP('RCBM110')                                                  48520027
        MAPSET('RCBM11')                                                48530027
        FREEKB                                                          48540027
        ERASE;                                                          48550027
   END;                                                                 48560027
   WHEN('05')                                                           48570027
   DO;                                                                  48580027
     EXEC CICS SEND                                                     48590027
        MAP('RCBM111')                                                  48600027
        MAPSET('RCBM11')                                                48610027
        FREEKB                                                          48620027
        ERASE;                                                          48630027
   END;                                                                 48640027
   WHEN('07')                                                           48650027
   DO;                                                                  48660027
     EXEC CICS SEND                                                     48670027
        MAP('RCBM112')                                                  48680027
        MAPSET('RCBM11')                                                48690027
        FREEKB                                                          48700027
        ERASE;                                                          48710027
   END;                                                                 48720027
   WHEN('08')                                                           48730027
   DO;                                                                  48740027
     EXEC CICS SEND                                                     48750027
        MAP('RCBM113')                                                  48760027
        MAPSET('RCBM11')                                                48770027
        ERASE                                                           48780027
        FREEKB;                                                         48790027
   END;                                                                 48800027
   WHEN('09')                                                           48810027
   DO;                                                                  48820027
     EXEC CICS SEND                                                     48830027
        MAP('RCBM114')                                                  48840027
        MAPSET('RCBM11')                                                48850027
        ERASE                                                           48860027
        FREEKB;                                                         48870027
   END;                                                                 48880027
   WHEN('10')                                                           48890027
   DO;                                                                  48900027
     EXEC CICS SEND                                                     48910027
        MAP('RCBM115')                                                  48920027
        MAPSET('RCBM11')                                                48930027
        ERASE                                                           48940027
        FREEKB;                                                         48950027
   END;                                                                 48960027
   WHEN('11')                                                           48970027
   DO;                                                                  48980027
     EXEC CICS SEND                                                     48990027
        MAP('RCBM116')                                                  49000027
        MAPSET('RCBM11')                                                49010027
        ERASE                                                           49020027
        FREEKB;                                                         49030027
   END;                                                                 49040027
   WHEN('12')                                                           49050027
   DO;                                                                  49060027
     EXEC CICS SEND                                                     49070027
        MAP('RCBM117')                                                  49080027
        MAPSET('RCBM11')                                                49090027
        ERASE                                                           49100027
        FREEKB;                                                         49110027
   END;                                                                 49120027
   WHEN('13')                                                           49130027
   DO;                                                                  49140027
     EXEC CICS SEND                                                     49150027
        MAP('RCBM118')                                                  49160027
        MAPSET('RCBM11')                                                49170027
        ERASE                                                           49180027
        FREEKB;                                                         49190027
   END;                                                                 49200027
   WHEN('15')                                                           49210027
   DO;                                                                  49220027
     EXEC CICS SEND                                                     49230027
        MAP('RCBM119')                                                  49240027
        MAPSET('RCBM11')                                                49250027
        ERASE                                                           49260027
        FREEKB;                                                         49270027
   END;                                                                 49280027
   WHEN('16')                                                           49290027
   DO;                                                                  49300027
     EXEC CICS SEND                                                     49310027
        MAP('RCBM11A')                                                  49320027
        MAPSET('RCBM11')                                                49330027
        ERASE                                                           49340027
        FREEKB;                                                         49350027
   END;                                                                 49360027
   WHEN('17')                                                           49370027
   DO;                                                                  49380027
     EXEC CICS SEND                                                     49390027
        MAP('RCBM11B')                                                  49400027
        MAPSET('RCBM11')                                                49410027
        ERASE                                                           49420027
        FREEKB;                                                         49430027
   END;                                                                 49440027
   WHEN('18')                                                           49450027
   DO;                                                                  49460027
     EXEC CICS SEND                                                     49470027
        MAP('RCBM11C')                                                  49480027
        MAPSET('RCBM11')                                                49490027
        ERASE                                                           49500027
        FREEKB;                                                         49510027
   END;                                                                 49520027
   WHEN('19')                                                           49530027
   DO;                                                                  49540027
     EXEC CICS SEND                                                     49550027
        MAP('RCBM11D')                                                  49560027
        MAPSET('RCBM11')                                                49570027
        ERASE                                                           49580027
        FREEKB;                                                         49590027
   END;                                                                 49600027
   WHEN('22')                                                           49610027
   DO;                                                                  49620027
     EXEC CICS SEND                                                     49630027
        MAP('RCBM11E')                                                  49640027
        MAPSET('RCBM11')                                                49650027
        ERASE                                                           49660027
        FREEKB;                                                         49670027
   END;                                                                 49680027
   WHEN('23')                                                           49690027
   DO;                                                                  49700027
     EXEC CICS SEND                                                     49710027
        MAP('RCBM11F')                                                  49720027
        MAPSET('RCBM11')                                                49730027
        ERASE                                                           49740027
        FREEKB;                                                         49750027
   END;                                                                 49760027
   WHEN('25')                                                           49770027
   DO;                                                                  49780027
     EXEC CICS SEND                                                     49790027
        MAP('RCBM11G')                                                  49800027
        MAPSET('RCBM11')                                                49810027
        ERASE                                                           49820027
        FREEKB;                                                         49830027
   END;                                                                 49840027
   WHEN('26')                                                           49850027
   DO;                                                                  49860027
     EXEC CICS SEND                                                     49870027
        MAP('RCBM11H')                                                  49880027
        MAPSET('RCBM11')                                                49890027
        ERASE                                                           49900027
        FREEKB;                                                         49910027
   END;                                                                 49920027
   WHEN('36')                                                           49930027
   DO;                                                                  49940027
     EXEC CICS SEND                                                     49950027
        MAP('RCBM11I')                                                  49960027
        MAPSET('RCBM11')                                                49970027
        ERASE                                                           49980027
        FREEKB;                                                         49990027
   END;                                                                 50000027
   WHEN('40')                                                           50010027
   DO;                                                                  50020027
     EXEC CICS SEND                                                     50030027
        MAP('RCBM11J')                                                  50040027
        MAPSET('RCBM11')                                                50050027
        ERASE                                                           50060027
        FREEKB;                                                         50070027
   END;                                                                 50080027
   WHEN('50')                                                           50090027
   DO;                                                                  50100027
     EXEC CICS SEND                                                     50110027
        MAP('RCBM11K')                                                  50120027
        MAPSET('RCBM11')                                                50130027
        ERASE                                                           50140027
        FREEKB;                                                         50150027
   END;                                                                 50160027
   WHEN('69')                                                           50170027
   DO;                                                                  50180027
     EXEC CICS SEND                                                     50190027
        MAP('RCBM11L')                                                  50200027
        MAPSET('RCBM11')                                                50210027
        ERASE                                                           50220027
        FREEKB;                                                         50230027
   END;                                                                 50240027
   WHEN('70')                                           /*SOC RB01290*/ 50250027
   DO;                                                                  50260027
     EXEC CICS SEND                                                     50270027
        MAP('RCBM11M')                                                  50280027
        MAPSET('RCBM11')                                                50290027
        ERASE                                                           50300027
        FREEKB;                                                         50310027
   END;                                                 /*EOC RB01290*/ 50320027
 END;                                                                   50330027
                                                                        50340027
0EXEC CICS RETURN                                                       50350027
    TRANSID('RC11')                                                     50360027
    COMMAREA(COMMAREA)                                                  50370027
    LENGTH(CSTG(COMMAREA))                                              50380027
    RESP(RESPONSE)                                                      50390027
    RESP2(CODE_EXPLAIN);                                                50400027
                                                                        50410027
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 50420027
    WHEN(DFHRESP(NORMAL));                                              50430027
    WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */ 50440027
    DO;                                                                 50450027
       COMMAREA_LENGTH = EIBCALEN;                                      50460027
       EXEC CICS RETURN                                                 50470027
          TRANSID('RC11')                                               50480027
          COMMAREA(COMMAREA)                                            50490027
          LENGTH(COMMAREA_LENGTH);                                      50500027
    END;                                                                50510027
    OTHERWISE                                                           50520027
    DO;                                                                 50530027
       RCBM110O.MSG_LINEO = ERR_MESSAGE30;                              50540027
       CALL RCBC11M_SEND_MAP_CSR;                                       50550027
    END;                                                                50560027
 END;                                                                   50570027
                                                                        50580027
0END RCBC11M_SEND_MAP;                                                  50590027
1/********************************************************************/ 50600027
 /*      SEND MAP WITH CSR SET                                       */ 50610027
 /********************************************************************/ 50620027
 RCBC11M_SEND_MAP_CSR : PROC;                                           50630027
                                                                        50640027
 SELECT(HEADER.NEXT);                                                   50650027
   WHEN('00')                                                           50660027
   DO;                                                                  50670027
     EXEC CICS SEND                                                     50680027
        MAP('RCBM110')                                                  50690027
        MAPSET('RCBM11')                                                50700027
        CURSOR                                                          50710027
        ERASE                                                           50720027
        FREEKB;                                                         50730027
   END;                                                                 50740027
   WHEN('05')                                                           50750027
   DO;                                                                  50760027
     EXEC CICS SEND                                                     50770027
        MAP('RCBM111')                                                  50780027
        MAPSET('RCBM11')                                                50790027
        CURSOR                                                          50800027
        ERASE                                                           50810027
        FREEKB;                                                         50820027
   END;                                                                 50830027
   WHEN('07')                                                           50840027
   DO;                                                                  50850027
     EXEC CICS SEND                                                     50860027
        MAP('RCBM112')                                                  50870027
        MAPSET('RCBM11')                                                50880027
        CURSOR                                                          50890027
        ERASE                                                           50900027
        FREEKB;                                                         50910027
   END;                                                                 50920027
   WHEN('08')                                                           50930027
   DO;                                                                  50940027
     EXEC CICS SEND                                                     50950027
        MAP('RCBM113')                                                  50960027
        MAPSET('RCBM11')                                                50970027
        CURSOR                                                          50980027
        ERASE                                                           50990027
        FREEKB;                                                         51000027
   END;                                                                 51010027
   WHEN('09')                                                           51020027
   DO;                                                                  51030027
     EXEC CICS SEND                                                     51040027
        MAP('RCBM114')                                                  51050027
        MAPSET('RCBM11')                                                51060027
        CURSOR                                                          51070027
        ERASE                                                           51080027
        FREEKB;                                                         51090027
   END;                                                                 51100027
   WHEN('10')                                                           51110027
   DO;                                                                  51120027
     EXEC CICS SEND                                                     51130027
        MAP('RCBM115')                                                  51140027
        MAPSET('RCBM11')                                                51150027
        CURSOR                                                          51160027
        ERASE                                                           51170027
        FREEKB;                                                         51180027
   END;                                                                 51190027
   WHEN('11')                                                           51200027
   DO;                                                                  51210027
     EXEC CICS SEND                                                     51220027
        MAP('RCBM116')                                                  51230027
        MAPSET('RCBM11')                                                51240027
        CURSOR                                                          51250027
        ERASE                                                           51260027
        FREEKB;                                                         51270027
   END;                                                                 51280027
   WHEN('12')                                                           51290027
   DO;                                                                  51300027
     EXEC CICS SEND                                                     51310027
        MAP('RCBM117')                                                  51320027
        MAPSET('RCBM11')                                                51330027
        CURSOR                                                          51340027
        ERASE                                                           51350027
        FREEKB;                                                         51360027
   END;                                                                 51370027
   WHEN('13')                                                           51380027
   DO;                                                                  51390027
     EXEC CICS SEND                                                     51400027
        MAP('RCBM118')                                                  51410027
        MAPSET('RCBM11')                                                51420027
        CURSOR                                                          51430027
        ERASE                                                           51440027
        FREEKB;                                                         51450027
   END;                                                                 51460027
   WHEN('15')                                                           51470027
   DO;                                                                  51480027
     EXEC CICS SEND                                                     51490027
        MAP('RCBM119')                                                  51500027
        MAPSET('RCBM11')                                                51510027
        CURSOR                                                          51520027
        ERASE                                                           51530027
        FREEKB;                                                         51540027
   END;                                                                 51550027
   WHEN('16')                                                           51560027
   DO;                                                                  51570027
     EXEC CICS SEND                                                     51580027
        MAP('RCBM11A')                                                  51590027
        MAPSET('RCBM11')                                                51600027
        CURSOR                                                          51610027
        ERASE                                                           51620027
        FREEKB;                                                         51630027
   END;                                                                 51640027
   WHEN('17')                                                           51650027
   DO;                                                                  51660027
     EXEC CICS SEND                                                     51670027
        MAP('RCBM11B')                                                  51680027
        MAPSET('RCBM11')                                                51690027
        CURSOR                                                          51700027
        ERASE                                                           51710027
        FREEKB;                                                         51720027
   END;                                                                 51730027
   WHEN('18')                                                           51740027
   DO;                                                                  51750027
     EXEC CICS SEND                                                     51760027
        MAP('RCBM11C')                                                  51770027
        MAPSET('RCBM11')                                                51780027
        CURSOR                                                          51790027
        ERASE                                                           51800027
        FREEKB;                                                         51810027
   END;                                                                 51820027
   WHEN('19')                                                           51830027
   DO;                                                                  51840027
     EXEC CICS SEND                                                     51850027
        MAP('RCBM11D')                                                  51860027
        MAPSET('RCBM11')                                                51870027
        CURSOR                                                          51880027
        ERASE                                                           51890027
        FREEKB;                                                         51900027
   END;                                                                 51910027
   WHEN('22')                                                           51920027
   DO;                                                                  51930027
     EXEC CICS SEND                                                     51940027
        MAP('RCBM11E')                                                  51950027
        MAPSET('RCBM11')                                                51960027
        CURSOR                                                          51970027
        ERASE                                                           51980027
        FREEKB;                                                         51990027
   END;                                                                 52000027
   WHEN('23')                                                           52010027
   DO;                                                                  52020027
     EXEC CICS SEND                                                     52030027
        MAP('RCBM11F')                                                  52040027
        MAPSET('RCBM11')                                                52050027
        CURSOR                                                          52060027
        ERASE                                                           52070027
        FREEKB;                                                         52080027
   END;                                                                 52090027
   WHEN('25')                                                           52100027
   DO;                                                                  52110027
     EXEC CICS SEND                                                     52120027
        MAP('RCBM11G')                                                  52130027
        MAPSET('RCBM11')                                                52140027
        CURSOR                                                          52150027
        ERASE                                                           52160027
        FREEKB;                                                         52170027
   END;                                                                 52180027
   WHEN('26')                                                           52190027
   DO;                                                                  52200027
     EXEC CICS SEND                                                     52210027
        MAP('RCBM11H')                                                  52220027
        MAPSET('RCBM11')                                                52230027
        CURSOR                                                          52240027
        ERASE                                                           52250027
        FREEKB;                                                         52260027
   END;                                                                 52270027
   WHEN('36')                                                           52280027
   DO;                                                                  52290027
     EXEC CICS SEND                                                     52300027
        MAP('RCBM11I')                                                  52310027
        MAPSET('RCBM11')                                                52320027
        CURSOR                                                          52330027
        ERASE                                                           52340027
        FREEKB;                                                         52350027
   END;                                                                 52360027
   WHEN('40')                                                           52370027
   DO;                                                                  52380027
     EXEC CICS SEND                                                     52390027
        MAP('RCBM11J')                                                  52400027
        MAPSET('RCBM11')                                                52410027
        CURSOR                                                          52420027
        ERASE                                                           52430027
        FREEKB;                                                         52440027
   END;                                                                 52450027
   WHEN('50')                                                           52460027
   DO;                                                                  52470027
     EXEC CICS SEND                                                     52480027
        MAP('RCBM11K')                                                  52490027
        MAPSET('RCBM11')                                                52500027
        CURSOR                                                          52510027
        ERASE                                                           52520027
        FREEKB;                                                         52530027
   END;                                                                 52540027
   WHEN('69')                                                           52550027
   DO;                                                                  52560027
     EXEC CICS SEND                                                     52570027
        MAP('RCBM11L')                                                  52580027
        MAPSET('RCBM11')                                                52590027
        CURSOR                                                          52600027
        ERASE                                                           52610027
        FREEKB;                                                         52620027
   END;                                                                 52630027
   WHEN('70')                                           /*SOC RB01290*/ 52640027
   DO;                                                                  52650027
     EXEC CICS SEND                                                     52660027
        MAP('RCBM11M')                                                  52670027
        MAPSET('RCBM11')                                                52680027
        CURSOR                                                          52690027
        ERASE                                                           52700027
        FREEKB;                                                         52710027
   END;                                                 /*EOC RB01290*/ 52720027
 END;                                                                   52730027
                                                                        52740027
 EXEC CICS RETURN                                                       52750027
    TRANSID('RC11')                                                     52760027
    COMMAREA(COMMAREA)                                                  52770027
    LENGTH(CSTG(COMMAREA));                                             52780027
                                                                        52790027
 END RCBC11M_SEND_MAP_CSR;                                              52800027
1/********************************************************************/ 52810027
 /*      SEND HELP MAP                                               */ 52820027
 /********************************************************************/ 52830027
0RCBC11M_HELP_MAP: PROC;                                                52840027
                                                                        52850027
 HELP_FLAG  = FALSE;                                                    52860027
 CSR_POS    = 1;                                                        52870027
 CSR_ROW    = 1;                                                        52880027
                                                                        52890027
 SELECT(HEADER.NEXT);                                                   52900027
   WHEN('00')                                                           52910027
   DO;                                                                  52920027
     CSR_POS   = 1;                                                     52930027
     HELP_FLAG = TRUE;                                                  52940027
     EXEC CICS SEND                                                     52950027
        MAP('RCBH11')                                                   52960027
        MAPSET('RCBM11')                                                52970027
        FREEKB                                                          52980027
        ERASE;                                                          52990027
   END;                                                                 53000027
                                                                        53010027
   WHEN('05')                                                           53020027
   DO;                                                                  53030027
     SELECT(RESPONSE);                                                  53040027
       WHEN(DFHRESP(NORMAL))                                            53050027
       DO;                                                              53060027
         IF RCBM111I.ACTIONF = CSR_HELP                                 53070027
          | RCBM111I.ACTIONF = CSR_EOF THEN                             53080027
         DO;                                                            53090027
           CSR_POS   = 1;                                               53100027
           HELP_FLAG = TRUE;                                            53110027
           EXEC CICS SEND                                               53120027
              MAP('ACT12')                                              53130027
              MAPSET('RCBHELP')                                         53140027
              FREEKB                                                    53150027
              ERASE;                                                    53160027
         END;                                                           53170027
                                                                        53180027
         IF RCBM111I.PROGRAM_RUN_TYPEF = CSR_HELP                       53190027
          | RCBM111I.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   53200027
         DO;                                                            53210027
           CSR_POS   = 2;                                               53220027
           HELP_FLAG = TRUE;                                            53230027
           EXEC CICS SEND                                               53240027
              MAP('PROGRT')                                             53250027
              MAPSET('RCBHELP')                                         53260027
              FREEKB                                                    53270027
              ERASE;                                                    53280027
         END;                                                           53290027
                                                                        53300027
         IF RCBM111I.DESCRIPTIONF = CSR_HELP                            53310027
          | RCBM111I.DESCRIPTIONF = CSR_EOF THEN                        53320027
         DO;                                                            53330027
           CSR_POS   = 3;                                               53340027
           HELP_FLAG = TRUE;                                            53350027
           EXEC CICS SEND                                               53360027
              MAP('DESC')                                               53370027
              MAPSET('RCBHELP')                                         53380027
              FREEKB                                                    53390027
              ERASE;                                                    53400027
         END;                                                           53410027
                                                                        53420027
         IF RCBM111I.SW_EXTR_VOLUMEF = CSR_HELP                         53430027
          | RCBM111I.SW_EXTR_VOLUMEF = CSR_EOF THEN                     53440027
         DO;                                                            53450027
           CSR_POS   = 4;                                               53460027
           HELP_FLAG = TRUE;                                            53470027
           EXEC CICS SEND                                               53480027
              MAP('SWEXT')                                              53490027
              MAPSET('RCBHELP')                                         53500027
              FREEKB                                                    53510027
              ERASE;                                                    53520027
         END;                                                           53530027
                                                                        53540027
         IF RCBM111I.CU_EXTR_VOLUMEF = CSR_HELP                         53550027
          | RCBM111I.CU_EXTR_VOLUMEF = CSR_EOF THEN                     53560027
         DO;                                                            53570027
           CSR_POS   = 5;                                               53580027
           HELP_FLAG = TRUE;                                            53590027
           EXEC CICS SEND                                               53600027
              MAP('EXTVOL')                                             53610027
              MAPSET('RCBHELP')                                         53620027
              FREEKB                                                    53630027
              ERASE;                                                    53640027
         END;                                                           53650027
                                                                        53660027
         IF RCBM111I.ADDRESS_RESF = CSR_HELP                            53670027
          | RCBM111I.ADDRESS_RESF = CSR_EOF THEN                        53680027
         DO;                                                            53690027
           CSR_POS   = 6;                                               53700027
           HELP_FLAG = TRUE;                                            53710027
           EXEC CICS SEND                                               53720027
              MAP('ADDRES')                                             53730027
              MAPSET('RCBHELP')                                         53740027
              FREEKB                                                    53750027
              ERASE;                                                    53760027
         END;                                                           53770027
                                                                        53780027
         IF RCBM111I.RET_PERIOD_HISTF = CSR_HELP                        53790027
          | RCBM111I.RET_PERIOD_HISTF = CSR_EOF THEN                    53800027
         DO;                                                            53810027
           CSR_POS   = 7;                                               53820027
           HELP_FLAG = TRUE;                                            53830027
           EXEC CICS SEND                                               53840027
              MAP('RETPERH')                                            53850027
              MAPSET('RCBHELP')                                         53860027
              FREEKB                                                    53870027
              ERASE;                                                    53880027
         END;                                                           53890027
                                                                        53900027
         IF RCBM111I.HOR_DATE_FUTF = CSR_HELP                           53910027
          | RCBM111I.HOR_DATE_FUTF = CSR_EOF THEN                       53920027
         DO;                                                            53930027
           CSR_POS   = 8;                                               53940027
           HELP_FLAG = TRUE;                                            53950027
           EXEC CICS SEND                                               53960027
              MAP('HORDATF')                                            53970027
              MAPSET('RCBHELP')                                         53980027
              FREEKB                                                    53990027
              ERASE;                                                    54000027
         END;                                                           54010027
                                                                        54020027
         IF RCBM111I.PI_TO_RCMSF = CSR_HELP                             54030027
          | RCBM111I.PI_TO_RCMSF = CSR_EOF THEN                         54040027
         DO;                                                            54050027
           CSR_POS   = 9;                                               54060027
           HELP_FLAG = TRUE;                                            54070027
           EXEC CICS SEND                                               54080027
              MAP('PITOR')                                              54090027
              MAPSET('RCBHELP')                                         54100027
              FREEKB                                                    54110027
              ERASE;                                                    54120027
         END;                                                           54130027
                                                                        54140027
         IF RCBM111I.PI_TO_BMTF = CSR_HELP                              54150027
          | RCBM111I.PI_TO_BMTF = CSR_EOF THEN                          54160027
         DO;                                                            54170027
           CSR_POS   = 10;                                              54180027
           HELP_FLAG = TRUE;                                            54190027
           EXEC CICS SEND                                               54200027
              MAP('PITOB')                                              54210027
              MAPSET('RCBHELP')                                         54220027
              FREEKB                                                    54230027
              ERASE;                                                    54240027
         END;                                                           54250027
                                                                        54260027
         IF RCBM111I.PI_TO_CEREOLSF = CSR_HELP                          54270027
          | RCBM111I.PI_TO_CEREOLSF = CSR_EOF THEN                      54280027
         DO;                                                            54290027
           CSR_POS   = 11;                                              54300027
           HELP_FLAG = TRUE;                                            54310027
           EXEC CICS SEND                                               54320027
              MAP('PITOCE')                                             54330027
              MAPSET('RCBHELP')                                         54340027
              FREEKB                                                    54350027
              ERASE;                                                    54360027
         END;                                                           54370027
                                                                        54380027
         IF RCBM111I.PARAMETER_EFF_DATEF = CSR_HELP                     54390027
          | RCBM111I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 54400027
         DO;                                                            54410027
           CSR_POS   = 12;                                              54420027
           HELP_FLAG = TRUE;                                            54430027
           EXEC CICS SEND                                               54440027
              MAP('PEFFDAT')                                            54450027
              MAPSET('RCBHELP')                                         54460027
              FREEKB                                                    54470027
              ERASE;                                                    54480027
         END;                                                           54490027
                                                                        54500027
         IF RCBM111I.COUNTRY_NUMBERF = CSR_HELP                         54510027
          | RCBM111I.COUNTRY_NUMBERF = CSR_EOF THEN                     54520027
         DO;                                                            54530027
           CSR_POS   = 13;                                              54540027
           HELP_FLAG = TRUE;                                            54550027
           EXEC CICS SEND                                               54560027
              MAP('CTYNO')                                              54570027
              MAPSET('RCBHELP')                                         54580027
              FREEKB                                                    54590027
              ERASE;                                                    54600027
         END;                                                           54610027
       END;                                                             54620027
                                                                        54630027
       OTHERWISE                                                        54640027
       DO;                                                              54650027
         HEADER.NEXT = '00';                                            54660027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1105';              54670027
         CALL RCBC11M_SEND_MAP;                                         54680027
       END;                                                             54690027
     END;                                                               54700027
   END;                                                                 54710027
                                                                        54720027
   WHEN('07')                                                           54730027
   DO;                                                                  54740027
     SELECT(RESPONSE);                                                  54750027
       WHEN(DFHRESP(NORMAL))                                            54760027
       DO;                                                              54770027
         IF RCBM112I.ACTIONF = CSR_HELP                                 54780027
          | RCBM112I.ACTIONF = CSR_EOF THEN                             54790027
         DO;                                                            54800027
           CSR_POS   = 1;                                               54810027
           HELP_FLAG = TRUE;                                            54820027
           EXEC CICS SEND                                               54830027
              MAP('ACT12')                                              54840027
              MAPSET('RCBHELP')                                         54850027
              FREEKB                                                    54860027
              ERASE;                                                    54870027
         END;                                                           54880027
                                                                        54890027
         IF RCBM112I.PROGRAM_RUN_TYPEF = CSR_HELP                       54900027
          | RCBM112I.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   54910027
         DO;                                                            54920027
           CSR_POS   = 2;                                               54930027
           HELP_FLAG = TRUE;                                            54940027
           EXEC CICS SEND                                               54950027
              MAP('PROGRT')                                             54960027
              MAPSET('RCBHELP')                                         54970027
              FREEKB                                                    54980027
              ERASE;                                                    54990027
         END;                                                           55000027
                                                                        55010027
         IF RCBM112I.DESCRIPTIONF = CSR_HELP                            55020027
          | RCBM112I.DESCRIPTIONF = CSR_EOF THEN                        55030027
         DO;                                                            55040027
           CSR_POS   = 3;                                               55050027
           HELP_FLAG = TRUE;                                            55060027
           EXEC CICS SEND                                               55070027
              MAP('DESC')                                               55080027
              MAPSET('RCBHELP')                                         55090027
              FREEKB                                                    55100027
              ERASE;                                                    55110027
         END;                                                           55120027
                                                                        55130027
         IF RCBM112I.ADDR_LIN_INDF = CSR_HELP                           55140027
          | RCBM112I.ADDR_LIN_INDF = CSR_EOF THEN                       55150027
         DO;                                                            55160027
           CSR_POS   = 4;                                               55170027
           HELP_FLAG = TRUE;                                            55180027
           EXEC CICS SEND                                               55190027
              MAP('ADDLIND')                                            55200027
              MAPSET('RCBHELP')                                         55210027
              FREEKB                                                    55220027
              ERASE;                                                    55230027
         END;                                                           55240027
                                                                        55250027
         IF RCBM112I.MAX_REC_AGE_DIFFF = CSR_HELP                       55260027
          | RCBM112I.MAX_REC_AGE_DIFFF = CSR_EOF THEN                   55270027
         DO;                                                            55280027
           CSR_POS   = 5;                                               55290027
           HELP_FLAG = TRUE;                                            55300027
           EXEC CICS SEND                                               55310027
              MAP('MAXAGE')                                             55320027
              MAPSET('RCBHELP')                                         55330027
              FREEKB                                                    55340027
              ERASE;                                                    55350027
         END;                                                           55360027
                                                                        55370027
         IF RCBM112I.PARAMETER_EFF_DATEF = CSR_HELP                     55380027
          | RCBM112I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 55390027
         DO;                                                            55400027
           CSR_POS   = 6;                                               55410027
           HELP_FLAG = TRUE;                                            55420027
           EXEC CICS SEND                                               55430027
              MAP('PEFFDAT')                                            55440027
              MAPSET('RCBHELP')                                         55450027
              FREEKB                                                    55460027
              ERASE;                                                    55470027
         END;                                                           55480027
                                                                        55490027
         IF RCBM112I.COUNTRY_NUMBERF = CSR_HELP                         55500027
          | RCBM112I.COUNTRY_NUMBERF = CSR_EOF THEN                     55510027
         DO;                                                            55520027
           CSR_POS   = 7;                                               55530027
           HELP_FLAG = TRUE;                                            55540027
           EXEC CICS SEND                                               55550027
              MAP('CTYNO')                                              55560027
              MAPSET('RCBHELP')                                         55570027
              FREEKB                                                    55580027
              ERASE;                                                    55590027
         END;                                                           55600027
       END;                                                             55610027
                                                                        55620027
       OTHERWISE                                                        55630027
       DO;                                                              55640027
         HEADER.NEXT = '00';                                            55650027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1107';              55660027
         CALL RCBC11M_SEND_MAP;                                         55670027
       END;                                                             55680027
     END;                                                               55690027
   END;                                                                 55700027
                                                                        55710027
   WHEN('08')                                                           55720027
   DO;                                                                  55730027
     SELECT(RESPONSE);                                                  55740027
       WHEN(DFHRESP(NORMAL))                                            55750027
       DO;                                                              55760027
         IF RCBM113I.ACTIONF = CSR_HELP                                 55770027
          | RCBM113I.ACTIONF = CSR_EOF THEN                             55780027
         DO;                                                            55790027
           CSR_POS   = 1;                                               55800027
           HELP_FLAG = TRUE;                                            55810027
           EXEC CICS SEND                                               55820027
              MAP('ACT12')                                              55830027
              MAPSET('RCBHELP')                                         55840027
              FREEKB                                                    55850027
              ERASE;                                                    55860027
         END;                                                           55870027
                                                                        55880027
         IF RCBM113I.DESCRIPTIONF = CSR_HELP                            55890027
          | RCBM113I.DESCRIPTIONF = CSR_EOF THEN                        55900027
         DO;                                                            55910027
           CSR_POS   = 2;                                               55920027
           HELP_FLAG = TRUE;                                            55930027
           EXEC CICS SEND                                               55940027
              MAP('DESC')                                               55950027
              MAPSET('RCBHELP')                                         55960027
              FREEKB                                                    55970027
              ERASE;                                                    55980027
         END;                                                           55990027
                                                                        56000027
         IF RCBM113I.FEATURE_STORE_INDF = CSR_HELP                      56010027
          | RCBM113I.FEATURE_STORE_INDF = CSR_EOF THEN                  56020027
         DO;                                                            56030027
           CSR_POS   = 3;                                               56040027
           HELP_FLAG = TRUE;                                            56050027
           EXEC CICS SEND                                               56060027
              MAP('FSIND')                                              56070027
              MAPSET('RCBHELP')                                         56080027
              FREEKB                                                    56090027
              ERASE;                                                    56100027
         END;                                                           56110027
                                                                        56120027
         IF RCBM113I.PARAMETER_EFF_DATEF = CSR_HELP                     56130027
          | RCBM113I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 56140027
         DO;                                                            56150027
           CSR_POS   = 4;                                               56160027
           HELP_FLAG = TRUE;                                            56170027
           EXEC CICS SEND                                               56180027
              MAP('PEFFDAT')                                            56190027
              MAPSET('RCBHELP')                                         56200027
              FREEKB                                                    56210027
              ERASE;                                                    56220027
         END;                                                           56230027
                                                                        56240027
         IF RCBM113I.COUNTRY_NUMBERF = CSR_HELP                         56250027
          | RCBM113I.COUNTRY_NUMBERF = CSR_EOF THEN                     56260027
         DO;                                                            56270027
           CSR_POS   = 5;                                               56280027
           HELP_FLAG = TRUE;                                            56290027
           EXEC CICS SEND                                               56300027
              MAP('CTYNO')                                              56310027
              MAPSET('RCBHELP')                                         56320027
              FREEKB                                                    56330027
              ERASE;                                                    56340027
         END;                                                           56350027
       END;                                                             56360027
                                                                        56370027
       OTHERWISE                                                        56380027
       DO;                                                              56390027
         HEADER.NEXT = '00';                                            56400027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1108';              56410027
         CALL RCBC11M_SEND_MAP;                                         56420027
       END;                                                             56430027
     END;                                                               56440027
   END;                                                                 56450027
                                                                        56460027
   WHEN('09')                                                           56470027
   DO;                                                                  56480027
     SELECT(RESPONSE);                                                  56490027
       WHEN(DFHRESP(NORMAL))                                            56500027
       DO;                                                              56510027
         IF RCBM114I.ACTIONF = CSR_HELP                                 56520027
          | RCBM114I.ACTIONF = CSR_EOF THEN                             56530027
         DO;                                                            56540027
           CSR_POS   = 1;                                               56550027
           HELP_FLAG = TRUE;                                            56560027
           EXEC CICS SEND                                               56570027
              MAP('ACT12')                                              56580027
              MAPSET('RCBHELP')                                         56590027
              FREEKB                                                    56600027
              ERASE;                                                    56610027
         END;                                                           56620027
                                                                        56630027
         IF RCBM114I.DESCRIPTIONF = CSR_HELP                            56640027
          | RCBM114I.DESCRIPTIONF = CSR_EOF THEN                        56650027
         DO;                                                            56660027
           CSR_POS   = 2;                                               56670027
           HELP_FLAG = TRUE;                                            56680027
           EXEC CICS SEND                                               56690027
              MAP('DESC')                                               56700027
              MAPSET('RCBHELP')                                         56710027
              FREEKB                                                    56720027
              ERASE;                                                    56730027
         END;                                                           56740027
                                                                        56750027
         DO N = 1 TO 40;                                                56760027
           CSR_ROW   = N;                                               56770027
           IF RCBM114I.FEATF(N) = CSR_HELP                              56780027
            | RCBM114I.FEATF(N) = CSR_EOF THEN                          56790027
           DO;                                                          56800027
             N = 41;                                                    56810027
             CSR_POS   = 3;                                             56820027
             HELP_FLAG = TRUE;                                          56830027
             EXEC CICS SEND                                             56840027
                MAP('FEATS')                                            56850027
                MAPSET('RCBHELP')                                       56860027
                FREEKB                                                  56870027
                ERASE;                                                  56880027
           END;                                                         56890027
         END;                                                           56900027
                                                                        56910027
         IF RCBM114I.PARAMETER_EFF_DATEF = CSR_HELP                     56920027
          | RCBM114I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 56930027
         DO;                                                            56940027
           CSR_POS   = 4;                                               56950027
           HELP_FLAG = TRUE;                                            56960027
           EXEC CICS SEND                                               56970027
              MAP('PEFFDAT')                                            56980027
              MAPSET('RCBHELP')                                         56990027
              FREEKB                                                    57000027
              ERASE;                                                    57010027
         END;                                                           57020027
                                                                        57030027
         IF RCBM114I.COUNTRY_NUMBERF = CSR_HELP                         57040027
          | RCBM114I.COUNTRY_NUMBERF = CSR_EOF THEN                     57050027
         DO;                                                            57060027
           CSR_POS   = 5;                                               57070027
           HELP_FLAG = TRUE;                                            57080027
           EXEC CICS SEND                                               57090027
              MAP('CTYNO')                                              57100027
              MAPSET('RCBHELP')                                         57110027
              FREEKB                                                    57120027
              ERASE;                                                    57130027
         END;                                                           57140027
       END;                                                             57150027
                                                                        57160027
       OTHERWISE                                                        57170027
       DO;                                                              57180027
         HEADER.NEXT = '00';                                            57190027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1109';              57200027
         CALL RCBC11M_SEND_MAP;                                         57210027
       END;                                                             57220027
     END;                                                               57230027
   END;                                                                 57240027
                                                                        57250027
   WHEN('10')                                                           57260027
   DO;                                                                  57270027
     SELECT(RESPONSE);                                                  57280027
       WHEN(DFHRESP(NORMAL))                                            57290027
       DO;                                                              57300027
         IF RCBM115I.ACTIONF = CSR_HELP                                 57310027
          | RCBM115I.ACTIONF = CSR_EOF THEN                             57320027
         DO;                                                            57330027
           CSR_POS   = 1;                                               57340027
           HELP_FLAG = TRUE;                                            57350027
           EXEC CICS SEND                                               57360027
              MAP('ACT12')                                              57370027
              MAPSET('RCBHELP')                                         57380027
              FREEKB                                                    57390027
              ERASE;                                                    57400027
         END;                                                           57410027
                                                                        57420027
         IF RCBM115I.PROGRAM_RUN_TYPEF = CSR_HELP                       57430027
          | RCBM115I.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   57440027
         DO;                                                            57450027
           CSR_POS   = 2;                                               57460027
           HELP_FLAG = TRUE;                                            57470027
           EXEC CICS SEND                                               57480027
              MAP('PROGRT')                                             57490027
              MAPSET('RCBHELP')                                         57500027
              FREEKB                                                    57510027
              ERASE;                                                    57520027
         END;                                                           57530027
                                                                        57540027
         IF RCBM115I.RCMS_GROUP_IDF = CSR_HELP                          57550027
          | RCBM115I.RCMS_GROUP_IDF = CSR_EOF THEN                      57560027
         DO;                                                            57570027
           CSR_POS   = 3;                                               57580027
           HELP_FLAG = TRUE;                                            57590027
           EXEC CICS SEND                                               57600027
              MAP('RCMSGRP')                                            57610027
              MAPSET('RCBHELP')                                         57620027
              FREEKB                                                    57630027
              ERASE;                                                    57640027
         END;                                                           57650027
                                                                        57660027
         IF RCBM115I.DESCRIPTIONF = CSR_HELP                            57670027
          | RCBM115I.DESCRIPTIONF = CSR_EOF THEN                        57680027
         DO;                                                            57690027
           CSR_POS   = 4;                                               57700027
           HELP_FLAG = TRUE;                                            57710027
           EXEC CICS SEND                                               57720027
              MAP('DESC')                                               57730027
              MAPSET('RCBHELP')                                         57740027
              FREEKB                                                    57750027
              ERASE;                                                    57760027
         END;                                                           57770027
                                                                        57780027
         IF RCBM115I.EXTRACT_TYPEF = CSR_HELP                           57790027
          | RCBM115I.EXTRACT_TYPEF = CSR_EOF THEN                       57800027
         DO;                                                            57810027
           CSR_POS   = 5;                                               57820027
           HELP_FLAG = TRUE;                                            57830027
           EXEC CICS SEND                                               57840027
              MAP('EXTTYP')                                             57850027
              MAPSET('RCBHELP')                                         57860027
              FREEKB                                                    57870027
              ERASE;                                                    57880027
         END;                                                           57890027
                                                                        57900027
         IF RCBM115I.PARAMETER_EFF_DATEF = CSR_HELP                     57910027
          | RCBM115I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 57920027
         DO;                                                            57930027
           CSR_POS   = 6;                                               57940027
           HELP_FLAG = TRUE;                                            57950027
           EXEC CICS SEND                                               57960027
              MAP('PEFFDAT')                                            57970027
              MAPSET('RCBHELP')                                         57980027
              FREEKB                                                    57990027
              ERASE;                                                    58000027
         END;                                                           58010027
                                                                        58020027
         IF RCBM115I.COUNTRY_NUMBERF = CSR_HELP                         58030027
          | RCBM115I.COUNTRY_NUMBERF = CSR_EOF THEN                     58040027
         DO;                                                            58050027
           CSR_POS   = 7;                                               58060027
           HELP_FLAG = TRUE;                                            58070027
           EXEC CICS SEND                                               58080027
              MAP('CTYNO')                                              58090027
              MAPSET('RCBHELP')                                         58100027
              FREEKB                                                    58110027
              ERASE;                                                    58120027
         END;                                                           58130027
       END;                                                             58140027
                                                                        58150027
       OTHERWISE                                                        58160027
       DO;                                                              58170027
         HEADER.NEXT = '00';                                            58180027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1110';              58190027
         CALL RCBC11M_SEND_MAP;                                         58200027
       END;                                                             58210027
     END;                                                               58220027
   END;                                                                 58230027
                                                                        58240027
   WHEN('11')                                                           58250027
   DO;                                                                  58260027
     SELECT(RESPONSE);                                                  58270027
       WHEN(DFHRESP(NORMAL))                                            58280027
       DO;                                                              58290027
         IF RCBM116I.ACTIONF = CSR_HELP                                 58300027
          | RCBM116I.ACTIONF = CSR_EOF THEN                             58310027
         DO;                                                            58320027
           CSR_POS   = 1;                                               58330027
           HELP_FLAG = TRUE;                                            58340027
           EXEC CICS SEND                                               58350027
              MAP('ACT12')                                              58360027
              MAPSET('RCBHELP')                                         58370027
              FREEKB                                                    58380027
              ERASE;                                                    58390027
         END;                                                           58400027
                                                                        58410027
         IF RCBM116I.PROGRAM_RUN_TYPEF = CSR_HELP                       58420027
          | RCBM116I.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   58430027
         DO;                                                            58440027
           CSR_POS   = 2;                                               58450027
           HELP_FLAG = TRUE;                                            58460027
           EXEC CICS SEND                                               58470027
              MAP('PROGRT')                                             58480027
              MAPSET('RCBHELP')                                         58490027
              FREEKB                                                    58500027
              ERASE;                                                    58510027
         END;                                                           58520027
                                                                        58530027
         IF RCBM116I.OU_CODEF = CSR_HELP                                58540027
          | RCBM116I.OU_CODEF = CSR_EOF THEN                            58550027
         DO;                                                            58560027
           CSR_POS   = 3;                                               58570027
           HELP_FLAG = TRUE;                                            58580027
           EXEC CICS SEND                                               58590027
              MAP('OUCODE')                                             58600027
              MAPSET('RCBHELP')                                         58610027
              FREEKB                                                    58620027
              ERASE;                                                    58630027
         END;                                                           58640027
                                                                        58650027
         IF RCBM116I.RCMS_GROUP_IDF = CSR_HELP                          58660027
          | RCBM116I.RCMS_GROUP_IDF = CSR_EOF THEN                      58670027
         DO;                                                            58680027
           CSR_POS   = 4;                                               58690027
           HELP_FLAG = TRUE;                                            58700027
           EXEC CICS SEND                                               58710027
              MAP('RCMSGRP')                                            58720027
              MAPSET('RCBHELP')                                         58730027
              FREEKB                                                    58740027
              ERASE;                                                    58750027
         END;                                                           58760027
                                                                        58770027
         IF RCBM116I.DESCRIPTIONF = CSR_HELP                            58780027
          | RCBM116I.DESCRIPTIONF = CSR_EOF THEN                        58790027
         DO;                                                            58800027
           CSR_POS   = 5;                                               58810027
           HELP_FLAG = TRUE;                                            58820027
           EXEC CICS SEND                                               58830027
              MAP('DESC')                                               58840027
              MAPSET('RCBHELP')                                         58850027
              FREEKB                                                    58860027
              ERASE;                                                    58870027
         END;                                                           58880027
                                                                        58890027
         IF RCBM116I.UPDATE_TYPEF = CSR_HELP                            58900027
          | RCBM116I.UPDATE_TYPEF = CSR_EOF THEN                        58910027
         DO;                                                            58920027
           CSR_POS   = 6;                                               58930027
           HELP_FLAG = TRUE;                                            58940027
           EXEC CICS SEND                                               58950027
              MAP('UPDTYPE')                                            58960027
              MAPSET('RCBHELP')                                         58970027
              FREEKB                                                    58980027
              ERASE;                                                    58990027
         END;                                                           59000027
                                                                        59010027
         IF RCBM116I.PARAMETER_EFF_DATEF = CSR_HELP                     59020027
          | RCBM116I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 59030027
         DO;                                                            59040027
           CSR_POS   = 7;                                               59050027
           HELP_FLAG = TRUE;                                            59060027
           EXEC CICS SEND                                               59070027
              MAP('PEFFDAT')                                            59080027
              MAPSET('RCBHELP')                                         59090027
              FREEKB                                                    59100027
              ERASE;                                                    59110027
         END;                                                           59120027
                                                                        59130027
         IF RCBM116I.COUNTRY_NUMBERF = CSR_HELP                         59140027
          | RCBM116I.COUNTRY_NUMBERF = CSR_EOF THEN                     59150027
         DO;                                                            59160027
           CSR_POS   = 8;                                               59170027
           HELP_FLAG = TRUE;                                            59180027
           EXEC CICS SEND                                               59190027
              MAP('CTYNO')                                              59200027
              MAPSET('RCBHELP')                                         59210027
              FREEKB                                                    59220027
              ERASE;                                                    59230027
         END;                                                           59240027
       END;                                                             59250027
                                                                        59260027
       OTHERWISE                                                        59270027
       DO;                                                              59280027
         HEADER.NEXT = '00';                                            59290027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1111';              59300027
         CALL RCBC11M_SEND_MAP;                                         59310027
       END;                                                             59320027
     END;                                                               59330027
   END;                                                                 59340027
                                                                        59350027
   WHEN('12')                                                           59360027
   DO;                                                                  59370027
     SELECT(RESPONSE);                                                  59380027
       WHEN(DFHRESP(NORMAL))                                            59390027
       DO;                                                              59400027
         IF RCBM117I.ACTIONF = CSR_HELP                                 59410027
          | RCBM117I.ACTIONF = CSR_EOF THEN                             59420027
         DO;                                                            59430027
           CSR_POS   = 1;                                               59440027
           HELP_FLAG = TRUE;                                            59450027
           EXEC CICS SEND                                               59460027
              MAP('ACT12')                                              59470027
              MAPSET('RCBHELP')                                         59480027
              FREEKB                                                    59490027
              ERASE;                                                    59500027
         END;                                                           59510027
                                                                        59520027
         IF RCBM117I.PROGRAM_RUN_TYPEF = CSR_HELP                       59530027
          | RCBM117I.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   59540027
         DO;                                                            59550027
           CSR_POS   = 2;                                               59560027
           HELP_FLAG = TRUE;                                            59570027
           EXEC CICS SEND                                               59580027
              MAP('PROGRT')                                             59590027
              MAPSET('RCBHELP')                                         59600027
              FREEKB                                                    59610027
              ERASE;                                                    59620027
         END;                                                           59630027
                                                                        59640027
         IF RCBM117I.PROGRAM_NAMEF = CSR_HELP                           59650027
          | RCBM117I.PROGRAM_NAMEF = CSR_EOF THEN                       59660027
         DO;                                                            59670027
           CSR_POS   = 3;                                               59680027
           HELP_FLAG = TRUE;                                            59690027
           EXEC CICS SEND                                               59700027
              MAP('PROGNAM')                                            59710027
              MAPSET('RCBHELP')                                         59720027
              FREEKB                                                    59730027
              ERASE;                                                    59740027
         END;                                                           59750027
                                                                        59760027
         IF RCBM117I.DESCRIPTIONF = CSR_HELP                            59770027
          | RCBM117I.DESCRIPTIONF = CSR_EOF THEN                        59780027
         DO;                                                            59790027
           CSR_POS   = 4;                                               59800027
           HELP_FLAG = TRUE;                                            59810027
           EXEC CICS SEND                                               59820027
              MAP('DESC')                                               59830027
              MAPSET('RCBHELP')                                         59840027
              FREEKB                                                    59850027
              ERASE;                                                    59860027
         END;                                                           59870027
                                                                        59880027
         IF RCBM117I.CHECKPOINT_LIMITF = CSR_HELP                       59890027
          | RCBM117I.CHECKPOINT_LIMITF = CSR_EOF THEN                   59900027
         DO;                                                            59910027
           CSR_POS   = 5;                                               59920027
           HELP_FLAG = TRUE;                                            59930027
           EXEC CICS SEND                                               59940027
              MAP('CHKLIM')                                             59950027
              MAPSET('RCBHELP')                                         59960027
              FREEKB                                                    59970027
              ERASE;                                                    59980027
         END;                                                           59990027
                                                                        60000027
         IF RCBM117I.PARAMETER_EFF_DATEF = CSR_HELP                     60010027
          | RCBM117I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 60020027
         DO;                                                            60030027
           CSR_POS   = 6;                                               60040027
           HELP_FLAG = TRUE;                                            60050027
           EXEC CICS SEND                                               60060027
              MAP('PEFFDAT')                                            60070027
              MAPSET('RCBHELP')                                         60080027
              FREEKB                                                    60090027
              ERASE;                                                    60100027
         END;                                                           60110027
                                                                        60120027
         IF RCBM117I.COUNTRY_NUMBERF = CSR_HELP                         60130027
          | RCBM117I.COUNTRY_NUMBERF = CSR_EOF THEN                     60140027
         DO;                                                            60150027
           CSR_POS   = 7;                                               60160027
           HELP_FLAG = TRUE;                                            60170027
           EXEC CICS SEND                                               60180027
              MAP('CTYNO')                                              60190027
              MAPSET('RCBHELP')                                         60200027
              FREEKB                                                    60210027
              ERASE;                                                    60220027
         END;                                                           60230027
       END;                                                             60240027
                                                                        60250027
       OTHERWISE                                                        60260027
       DO;                                                              60270027
         HEADER.NEXT = '00';                                            60280027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1112';              60290027
         CALL RCBC11M_SEND_MAP;                                         60300027
       END;                                                             60310027
     END;                                                               60320027
   END;                                                                 60330027
                                                                        60340027
   WHEN('13')                                                           60350027
   DO;                                                                  60360027
     SELECT(RESPONSE);                                                  60370027
       WHEN(DFHRESP(NORMAL))                                            60380027
       DO;                                                              60390027
         IF RCBM118I.ACTIONF = CSR_HELP                                 60400027
          | RCBM118I.ACTIONF = CSR_EOF THEN                             60410027
         DO;                                                            60420027
           CSR_POS   = 1;                                               60430027
           HELP_FLAG = TRUE;                                            60440027
           EXEC CICS SEND                                               60450027
              MAP('ACT12')                                              60460027
              MAPSET('RCBHELP')                                         60470027
              FREEKB                                                    60480027
              ERASE;                                                    60490027
         END;                                                           60500027
                                                                        60510027
         IF RCBM118I.DESCRIPTIONF = CSR_HELP                            60520027
          | RCBM118I.DESCRIPTIONF = CSR_EOF THEN                        60530027
         DO;                                                            60540027
           CSR_POS   = 2;                                               60550027
           HELP_FLAG = TRUE;                                            60560027
           EXEC CICS SEND                                               60570027
              MAP('DESC')                                               60580027
              MAPSET('RCBHELP')                                         60590027
              FREEKB                                                    60600027
              ERASE;                                                    60610027
         END;                                                           60620027
                                                                        60630027
         IF RCBM118I.MAINT_SYSTEM_HWF = CSR_HELP                        60640027
          | RCBM118I.MAINT_SYSTEM_HWF = CSR_EOF THEN                    60650027
         DO;                                                            60660027
           CSR_POS   = 3;                                               60670027
           HELP_FLAG = TRUE;                                            60680027
           EXEC CICS SEND                                               60690027
              MAP('MNTSYS')                                             60700027
              MAPSET('RCBHELP')                                         60710027
              FREEKB                                                    60720027
              ERASE;                                                    60730027
         END;                                                           60740027
                                                                        60750027
         IF RCBM118I.MAINT_SYSTEM_SWF = CSR_HELP                        60760027
          | RCBM118I.MAINT_SYSTEM_SWF = CSR_EOF THEN                    60770027
         DO;                                                            60780027
           CSR_POS   = 4;                                               60790027
           HELP_FLAG = TRUE;                                            60800027
           EXEC CICS SEND                                               60810027
              MAP('MNTSYS')                                             60820027
              MAPSET('RCBHELP')                                         60830027
              FREEKB                                                    60840027
              ERASE;                                                    60850027
         END;                                                           60860027
                                                                        60870027
         IF RCBM118I.PARAMETER_EFF_DATEF = CSR_HELP                     60880027
          | RCBM118I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 60890027
         DO;                                                            60900027
           CSR_POS   = 5;                                               60910027
           HELP_FLAG = TRUE;                                            60920027
           EXEC CICS SEND                                               60930027
              MAP('PEFFDAT')                                            60940027
              MAPSET('RCBHELP')                                         60950027
              FREEKB                                                    60960027
              ERASE;                                                    60970027
         END;                                                           60980027
                                                                        60990027
         IF RCBM118I.COUNTRY_NUMBERF = CSR_HELP                         61000027
          | RCBM118I.COUNTRY_NUMBERF = CSR_EOF THEN                     61010027
         DO;                                                            61020027
           CSR_POS   = 6;                                               61030027
           HELP_FLAG = TRUE;                                            61040027
           EXEC CICS SEND                                               61050027
              MAP('CTYNO')                                              61060027
              MAPSET('RCBHELP')                                         61070027
              FREEKB                                                    61080027
              ERASE;                                                    61090027
         END;                                                           61100027
       END;                                                             61110027
                                                                        61120027
       OTHERWISE                                                        61130027
       DO;                                                              61140027
         HEADER.NEXT = '00';                                            61150027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1113';              61160027
         CALL RCBC11M_SEND_MAP;                                         61170027
       END;                                                             61180027
     END;                                                               61190027
   END;                                                                 61200027
                                                                        61210027
   WHEN('15')                                                           61220027
   DO;                                                                  61230027
     SELECT(RESPONSE);                                                  61240027
       WHEN(DFHRESP(NORMAL))                                            61250027
       DO;                                                              61260027
         IF RCBM119I.ACTIONF = CSR_HELP                                 61270027
          | RCBM119I.ACTIONF = CSR_EOF THEN                             61280027
         DO;                                                            61290027
           CSR_POS   = 1;                                               61300027
           HELP_FLAG = TRUE;                                            61310027
           EXEC CICS SEND                                               61320027
              MAP('ACT12')                                              61330027
              MAPSET('RCBHELP')                                         61340027
              FREEKB                                                    61350027
              ERASE;                                                    61360027
         END;                                                           61370027
                                                                        61380027
         IF RCBM119I.PROGRAM_RUN_TYPEF = CSR_HELP                       61390027
          | RCBM119I.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   61400027
         DO;                                                            61410027
           CSR_POS   = 2;                                               61420027
           HELP_FLAG = TRUE;                                            61430027
           EXEC CICS SEND                                               61440027
              MAP('PROGRT')                                             61450027
              MAPSET('RCBHELP')                                         61460027
              FREEKB                                                    61470027
              ERASE;                                                    61480027
         END;                                                           61490027
                                                                        61500027
         IF RCBM119I.DESCRIPTIONF = CSR_HELP                            61510027
          | RCBM119I.DESCRIPTIONF = CSR_EOF THEN                        61520027
         DO;                                                            61530027
           CSR_POS   = 3;                                               61540027
           HELP_FLAG = TRUE;                                            61550027
           EXEC CICS SEND                                               61560027
              MAP('DESC')                                               61570027
              MAPSET('RCBHELP')                                         61580027
              FREEKB                                                    61590027
              ERASE;                                                    61600027
         END;                                                           61610027
                                                                        61620027
         IF RCBM119I.PEW_WED_INDF = CSR_HELP                            61630027
          | RCBM119I.PEW_WED_INDF = CSR_EOF THEN                        61640027
         DO;                                                            61650027
           CSR_POS   = 4;                                               61660027
           HELP_FLAG = TRUE;                                            61670027
           EXEC CICS SEND                                               61680027
              MAP('PEWIND')                                             61690027
              MAPSET('RCBHELP')                                         61700027
              FREEKB                                                    61710027
              ERASE;                                                    61720027
         END;                                                           61730027
                                                                        61740027
         IF RCBM119I.PARAMETER_EFF_DATEF = CSR_HELP                     61750027
          | RCBM119I.PARAMETER_EFF_DATEF = CSR_EOF THEN                 61760027
         DO;                                                            61770027
           CSR_POS   = 5;                                               61780027
           HELP_FLAG = TRUE;                                            61790027
           EXEC CICS SEND                                               61800027
              MAP('PEFFDAT')                                            61810027
              MAPSET('RCBHELP')                                         61820027
              FREEKB                                                    61830027
              ERASE;                                                    61840027
         END;                                                           61850027
                                                                        61860027
         IF RCBM119I.COUNTRY_NUMBERF = CSR_HELP                         61870027
          | RCBM119I.COUNTRY_NUMBERF = CSR_EOF THEN                     61880027
         DO;                                                            61890027
           CSR_POS   = 6;                                               61900027
           HELP_FLAG = TRUE;                                            61910027
           EXEC CICS SEND                                               61920027
              MAP('CTYNO')                                              61930027
              MAPSET('RCBHELP')                                         61940027
              FREEKB                                                    61950027
              ERASE;                                                    61960027
         END;                                                           61970027
       END;                                                             61980027
                                                                        61990027
       OTHERWISE                                                        62000027
       DO;                                                              62010027
         HEADER.NEXT = '00';                                            62020027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1115';              62030027
         CALL RCBC11M_SEND_MAP;                                         62040027
       END;                                                             62050027
     END;                                                               62060027
   END;                                                                 62070027
                                                                        62080027
   WHEN('16')                                                           62090027
   DO;                                                                  62100027
     SELECT(RESPONSE);                                                  62110027
       WHEN(DFHRESP(NORMAL))                                            62120027
       DO;                                                              62130027
         IF RCBM11AI.ACTIONF = CSR_HELP                                 62140027
          | RCBM11AI.ACTIONF = CSR_EOF THEN                             62150027
         DO;                                                            62160027
           CSR_POS   = 1;                                               62170027
           HELP_FLAG = TRUE;                                            62180027
           EXEC CICS SEND                                               62190027
              MAP('ACT12')                                              62200027
              MAPSET('RCBHELP')                                         62210027
              FREEKB                                                    62220027
              ERASE;                                                    62230027
         END;                                                           62240027
                                                                        62250027
         IF RCBM11AI.PROCESS_IDF = CSR_HELP                             62260027
          | RCBM11AI.PROCESS_IDF = CSR_EOF THEN                         62270027
         DO;                                                            62280027
           CSR_POS   = 2;                                               62290027
           HELP_FLAG = TRUE;                                            62300027
           EXEC CICS SEND                                               62310027
              MAP('PROCID1')                                            62320027
              MAPSET('RCBHELP')                                         62330027
              FREEKB                                                    62340027
              ERASE;                                                    62350027
         END;                                                           62360027
                                                                        62370027
         IF RCBM11AI.PROGRAM_RUN_TYPEF = CSR_HELP                       62380027
          | RCBM11AI.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   62390027
         DO;                                                            62400027
           CSR_POS   = 3;                                               62410027
           HELP_FLAG = TRUE;                                            62420027
           EXEC CICS SEND                                               62430027
              MAP('PROGRT')                                             62440027
              MAPSET('RCBHELP')                                         62450027
              FREEKB                                                    62460027
              ERASE;                                                    62470027
         END;                                                           62480027
                                                                        62490027
         IF RCBM11AI.DESCRIPTIONF = CSR_HELP                            62500027
          | RCBM11AI.DESCRIPTIONF = CSR_EOF THEN                        62510027
         DO;                                                            62520027
           CSR_POS   = 4;                                               62530027
           HELP_FLAG = TRUE;                                            62540027
           EXEC CICS SEND                                               62550027
              MAP('DESC')                                               62560027
              MAPSET('RCBHELP')                                         62570027
              FREEKB                                                    62580027
              ERASE;                                                    62590027
         END;                                                           62600027
                                                                        62610027
         IF RCBM11AI.OU_REPORTF = CSR_HELP                              62620027
          | RCBM11AI.OU_REPORTF = CSR_EOF THEN                          62630027
         DO;                                                            62640027
           CSR_POS   = 5;                                               62650027
           HELP_FLAG = TRUE;                                            62660027
           EXEC CICS SEND                                               62670027
              MAP('OUREP')                                              62680027
              MAPSET('RCBHELP')                                         62690027
              FREEKB                                                    62700027
              ERASE;                                                    62710027
         END;                                                           62720027
                                                                        62730027
         IF RCBM11AI.PARAMETER_EFF_DATEF = CSR_HELP                     62740027
          | RCBM11AI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 62750027
         DO;                                                            62760027
           CSR_POS   = 6;                                               62770027
           HELP_FLAG = TRUE;                                            62780027
           EXEC CICS SEND                                               62790027
              MAP('PEFFDAT')                                            62800027
              MAPSET('RCBHELP')                                         62810027
              FREEKB                                                    62820027
              ERASE;                                                    62830027
         END;                                                           62840027
                                                                        62850027
         IF RCBM11AI.COUNTRY_NUMBERF = CSR_HELP                         62860027
          | RCBM11AI.COUNTRY_NUMBERF = CSR_EOF THEN                     62870027
         DO;                                                            62880027
           CSR_POS   = 7;                                               62890027
           HELP_FLAG = TRUE;                                            62900027
           EXEC CICS SEND                                               62910027
              MAP('CTYNO')                                              62920027
              MAPSET('RCBHELP')                                         62930027
              FREEKB                                                    62940027
              ERASE;                                                    62950027
         END;                                                           62960027
       END;                                                             62970027
                                                                        62980027
       OTHERWISE                                                        62990027
       DO;                                                              63000027
         HEADER.NEXT = '00';                                            63010027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1116';              63020027
         CALL RCBC11M_SEND_MAP;                                         63030027
       END;                                                             63040027
     END;                                                               63050027
   END;                                                                 63060027
                                                                        63070027
   WHEN('17')                                                           63080027
   DO;                                                                  63090027
     SELECT(RESPONSE);                                                  63100027
       WHEN(DFHRESP(NORMAL))                                            63110027
       DO;                                                              63120027
         IF RCBM11BI.ACTIONF = CSR_HELP                                 63130027
          | RCBM11BI.ACTIONF = CSR_EOF THEN                             63140027
         DO;                                                            63150027
           CSR_POS   = 1;                                               63160027
           HELP_FLAG = TRUE;                                            63170027
           EXEC CICS SEND                                               63180027
              MAP('ACT12')                                              63190027
              MAPSET('RCBHELP')                                         63200027
              FREEKB                                                    63210027
              ERASE;                                                    63220027
         END;                                                           63230027
                                                                        63240027
         IF RCBM11BI.DESCRIPTIONF = CSR_HELP                            63250027
          | RCBM11BI.DESCRIPTIONF = CSR_EOF THEN                        63260027
         DO;                                                            63270027
           CSR_POS   = 2;                                               63280027
           HELP_FLAG = TRUE;                                            63290027
           EXEC CICS SEND                                               63300027
              MAP('DESC')                                               63310027
              MAPSET('RCBHELP')                                         63320027
              FREEKB                                                    63330027
              ERASE;                                                    63340027
         END;                                                           63350027
                                                                        63360027
         IF RCBM11BI.AREA_INDICATORF = CSR_HELP                         63370027
          | RCBM11BI.AREA_INDICATORF = CSR_EOF THEN                     63380027
         DO;                                                            63390027
           CSR_POS   = 3;                                               63400027
           HELP_FLAG = TRUE;                                            63410027
           EXEC CICS SEND                                               63420027
              MAP('AREAIND')                                            63430027
              MAPSET('RCBHELP')                                         63440027
              FREEKB                                                    63450027
              ERASE;                                                    63460027
         END;                                                           63470027
                                                                        63480027
         IF RCBM11BI.PARAMETER_EFF_DATEF = CSR_HELP                     63490027
          | RCBM11BI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 63500027
         DO;                                                            63510027
           CSR_POS   = 4;                                               63520027
           HELP_FLAG = TRUE;                                            63530027
           EXEC CICS SEND                                               63540027
              MAP('PEFFDAT')                                            63550027
              MAPSET('RCBHELP')                                         63560027
              FREEKB                                                    63570027
              ERASE;                                                    63580027
         END;                                                           63590027
                                                                        63600027
         IF RCBM11BI.COUNTRY_NUMBERF = CSR_HELP                         63610027
          | RCBM11BI.COUNTRY_NUMBERF = CSR_EOF THEN                     63620027
         DO;                                                            63630027
           CSR_POS   = 5;                                               63640027
           HELP_FLAG = TRUE;                                            63650027
           EXEC CICS SEND                                               63660027
              MAP('CTYNO')                                              63670027
              MAPSET('RCBHELP')                                         63680027
              FREEKB                                                    63690027
              ERASE;                                                    63700027
         END;                                                           63710027
       END;                                                             63720027
                                                                        63730027
       OTHERWISE                                                        63740027
       DO;                                                              63750027
         HEADER.NEXT = '00';                                            63760027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1117';              63770027
         CALL RCBC11M_SEND_MAP;                                         63780027
       END;                                                             63790027
     END;                                                               63800027
   END;                                                                 63810027
                                                                        63820027
   WHEN('18')                                                           63830027
   DO;                                                                  63840027
     SELECT(RESPONSE);                                                  63850027
       WHEN(DFHRESP(NORMAL))                                            63860027
       DO;                                                              63870027
         IF RCBM11CI.ACTIONF = CSR_HELP                                 63880027
          | RCBM11CI.ACTIONF = CSR_EOF THEN                             63890027
         DO;                                                            63900027
           CSR_POS   = 1;                                               63910027
           HELP_FLAG = TRUE;                                            63920027
           EXEC CICS SEND                                               63930027
              MAP('ACT12')                                              63940027
              MAPSET('RCBHELP')                                         63950027
              FREEKB                                                    63960027
              ERASE;                                                    63970027
         END;                                                           63980027
                                                                        63990027
         IF RCBM11CI.DESCRIPTIONF = CSR_HELP                            64000027
          | RCBM11CI.DESCRIPTIONF = CSR_EOF THEN                        64010027
         DO;                                                            64020027
           CSR_POS   = 2;                                               64030027
           HELP_FLAG = TRUE;                                            64040027
           EXEC CICS SEND                                               64050027
              MAP('DESC')                                               64060027
              MAPSET('RCBHELP')                                         64070027
              FREEKB                                                    64080027
              ERASE;                                                    64090027
         END;                                                           64100027
                                                                        64110027
         IF RCBM11CI.ZIP_CODE_IDF = CSR_HELP                            64120027
          | RCBM11CI.ZIP_CODE_IDF = CSR_EOF THEN                        64130027
         DO;                                                            64140027
           CSR_POS   = 3;                                               64150027
           HELP_FLAG = TRUE;                                            64160027
           EXEC CICS SEND                                               64170027
              MAP('ZIPCODI')                                            64180027
              MAPSET('RCBHELP')                                         64190027
              FREEKB                                                    64200027
              ERASE;                                                    64210027
         END;                                                           64220027
                                                                        64230027
         IF RCBM11CI.PARAMETER_EFF_DATEF = CSR_HELP                     64240027
          | RCBM11CI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 64250027
         DO;                                                            64260027
           CSR_POS   = 4;                                               64270027
           HELP_FLAG = TRUE;                                            64280027
           EXEC CICS SEND                                               64290027
              MAP('PEFFDAT')                                            64300027
              MAPSET('RCBHELP')                                         64310027
              FREEKB                                                    64320027
              ERASE;                                                    64330027
         END;                                                           64340027
                                                                        64350027
         IF RCBM11CI.COUNTRY_NUMBERF = CSR_HELP                         64360027
          | RCBM11CI.COUNTRY_NUMBERF = CSR_EOF THEN                     64370027
         DO;                                                            64380027
           CSR_POS   = 5;                                               64390027
           HELP_FLAG = TRUE;                                            64400027
           EXEC CICS SEND                                               64410027
              MAP('CTYNO')                                              64420027
              MAPSET('RCBHELP')                                         64430027
              FREEKB                                                    64440027
              ERASE;                                                    64450027
         END;                                                           64460027
       END;                                                             64470027
                                                                        64480027
       OTHERWISE                                                        64490027
       DO;                                                              64500027
         HEADER.NEXT = '00';                                            64510027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1118';              64520027
         CALL RCBC11M_SEND_MAP;                                         64530027
       END;                                                             64540027
     END;                                                               64550027
   END;                                                                 64560027
                                                                        64570027
   WHEN('19')                                                           64580027
   DO;                                                                  64590027
     SELECT(RESPONSE);                                                  64600027
       WHEN(DFHRESP(NORMAL))                                            64610027
       DO;                                                              64620027
         IF RCBM11DI.ACTIONF = CSR_HELP                                 64630027
          | RCBM11DI.ACTIONF = CSR_EOF THEN                             64640027
         DO;                                                            64650027
           CSR_POS   = 1;                                               64660027
           HELP_FLAG = TRUE;                                            64670027
           EXEC CICS SEND                                               64680027
              MAP('ACT12')                                              64690027
              MAPSET('RCBHELP')                                         64700027
              FREEKB                                                    64710027
              ERASE;                                                    64720027
         END;                                                           64730027
                                                                        64740027
         IF RCBM11DI.DESCRIPTIONF = CSR_HELP                            64750027
          | RCBM11DI.DESCRIPTIONF = CSR_EOF THEN                        64760027
         DO;                                                            64770027
           CSR_POS   = 2;                                               64780027
           HELP_FLAG = TRUE;                                            64790027
           EXEC CICS SEND                                               64800027
              MAP('DESC')                                               64810027
              MAPSET('RCBHELP')                                         64820027
              FREEKB                                                    64830027
              ERASE;                                                    64840027
         END;                                                           64850027
                                                                        64860027
         IF RCBM11DI.CHIS_TABLE_INDF = CSR_HELP                         64870027
          | RCBM11DI.CHIS_TABLE_INDF = CSR_EOF THEN                     64880027
         DO;                                                            64890027
           CSR_POS   = 3;                                               64900027
           HELP_FLAG = TRUE;                                            64910027
           EXEC CICS SEND                                               64920027
              MAP('CHISTI')                                             64930027
              MAPSET('RCBHELP')                                         64940027
              FREEKB                                                    64950027
              ERASE;                                                    64960027
         END;                                                           64970027
                                                                        64980027
         IF RCBM11DI.PARAMETER_EFF_DATEF = CSR_HELP                     64990027
          | RCBM11DI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 65000027
         DO;                                                            65010027
           CSR_POS   = 4;                                               65020027
           HELP_FLAG = TRUE;                                            65030027
           EXEC CICS SEND                                               65040027
              MAP('PEFFDAT')                                            65050027
              MAPSET('RCBHELP')                                         65060027
              FREEKB                                                    65070027
              ERASE;                                                    65080027
         END;                                                           65090027
                                                                        65100027
         IF RCBM11DI.COUNTRY_NUMBERF = CSR_HELP                         65110027
          | RCBM11DI.COUNTRY_NUMBERF = CSR_EOF THEN                     65120027
         DO;                                                            65130027
           CSR_POS   = 5;                                               65140027
           HELP_FLAG = TRUE;                                            65150027
           EXEC CICS SEND                                               65160027
              MAP('CTYNO')                                              65170027
              MAPSET('RCBHELP')                                         65180027
              FREEKB                                                    65190027
              ERASE;                                                    65200027
         END;                                                           65210027
       END;                                                             65220027
                                                                        65230027
       OTHERWISE                                                        65240027
       DO;                                                              65250027
         HEADER.NEXT = '00';                                            65260027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1119';              65270027
         CALL RCBC11M_SEND_MAP;                                         65280027
       END;                                                             65290027
     END;                                                               65300027
   END;                                                                 65310027
                                                                        65320027
   WHEN('22')                                                           65330027
   DO;                                                                  65340027
     SELECT(RESPONSE);                                                  65350027
       WHEN(DFHRESP(NORMAL))                                            65360027
       DO;                                                              65370027
         IF RCBM11EI.ACTIONF = CSR_HELP                                 65380027
          | RCBM11EI.ACTIONF = CSR_EOF THEN                             65390027
         DO;                                                            65400027
           CSR_POS   = 1;                                               65410027
           HELP_FLAG = TRUE;                                            65420027
           EXEC CICS SEND                                               65430027
              MAP('ACT12')                                              65440027
              MAPSET('RCBHELP')                                         65450027
              FREEKB                                                    65460027
              ERASE;                                                    65470027
         END;                                                           65480027
                                                                        65490027
         IF RCBM11EI.DESCRIPTIONF = CSR_HELP                            65500027
          | RCBM11EI.DESCRIPTIONF = CSR_EOF THEN                        65510027
         DO;                                                            65520027
           CSR_POS   = 2;                                               65530027
           HELP_FLAG = TRUE;                                            65540027
           EXEC CICS SEND                                               65550027
              MAP('DESC')                                               65560027
              MAPSET('RCBHELP')                                         65570027
              FREEKB                                                    65580027
              ERASE;                                                    65590027
         END;                                                           65600027
                                                                        65610027
         IF RCBM11EI.HORIZON_PERIODF = CSR_HELP                         65620027
          | RCBM11EI.HORIZON_PERIODF = CSR_EOF THEN                     65630027
         DO;                                                            65640027
           CSR_POS   = 3;                                               65650027
           HELP_FLAG = TRUE;                                            65660027
           EXEC CICS SEND                                               65670027
              MAP('HORPER')                                             65680027
              MAPSET('RCBHELP')                                         65690027
              FREEKB                                                    65700027
              ERASE;                                                    65710027
         END;                                                           65720027
                                                                        65730027
         IF RCBM11EI.PARAMETER_EFF_DATEF = CSR_HELP                     65740027
          | RCBM11EI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 65750027
         DO;                                                            65760027
           CSR_POS   = 4;                                               65770027
           HELP_FLAG = TRUE;                                            65780027
           EXEC CICS SEND                                               65790027
              MAP('PEFFDAT')                                            65800027
              MAPSET('RCBHELP')                                         65810027
              FREEKB                                                    65820027
              ERASE;                                                    65830027
         END;                                                           65840027
                                                                        65850027
         IF RCBM11EI.COUNTRY_NUMBERF = CSR_HELP                         65860027
          | RCBM11EI.COUNTRY_NUMBERF = CSR_EOF THEN                     65870027
         DO;                                                            65880027
           CSR_POS   = 5;                                               65890027
           HELP_FLAG = TRUE;                                            65900027
           EXEC CICS SEND                                               65910027
              MAP('CTYNO')                                              65920027
              MAPSET('RCBHELP')                                         65930027
              FREEKB                                                    65940027
              ERASE;                                                    65950027
         END;                                                           65960027
       END;                                                             65970027
                                                                        65980027
       OTHERWISE                                                        65990027
       DO;                                                              66000027
         HEADER.NEXT = '00';                                            66010027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1122';              66020027
         CALL RCBC11M_SEND_MAP;                                         66030027
       END;                                                             66040027
     END;                                                               66050027
   END;                                                                 66060027
                                                                        66070027
   WHEN('23')                                                           66080027
   DO;                                                                  66090027
     SELECT(RESPONSE);                                                  66100027
       WHEN(DFHRESP(NORMAL))                                            66110027
       DO;                                                              66120027
         IF RCBM11FI.ACTIONF = CSR_HELP                                 66130027
          | RCBM11FI.ACTIONF = CSR_EOF THEN                             66140027
         DO;                                                            66150027
           CSR_POS   = 1;                                               66160027
           HELP_FLAG = TRUE;                                            66170027
           EXEC CICS SEND                                               66180027
              MAP('ACT12')                                              66190027
              MAPSET('RCBHELP')                                         66200027
              FREEKB                                                    66210027
              ERASE;                                                    66220027
         END;                                                           66230027
                                                                        66240027
         IF RCBM11FI.DESCRIPTIONF = CSR_HELP                            66250027
          | RCBM11FI.DESCRIPTIONF = CSR_EOF THEN                        66260027
         DO;                                                            66270027
           CSR_POS   = 2;                                               66280027
           HELP_FLAG = TRUE;                                            66290027
           EXEC CICS SEND                                               66300027
              MAP('DESC')                                               66310027
              MAPSET('RCBHELP')                                         66320027
              FREEKB                                                    66330027
              ERASE;                                                    66340027
         END;                                                           66350027
                                                                        66360027
         IF RCBM11FI.SOURCE_DC_DOCF = CSR_HELP                          66370027
          | RCBM11FI.SOURCE_DC_DOCF = CSR_EOF THEN                      66380027
         DO;                                                            66390027
           CSR_POS   = 3;                                               66400027
           HELP_FLAG = TRUE;                                            66410027
           EXEC CICS SEND                                               66420027
              MAP('SRCDOC')                                             66430027
              MAPSET('RCBHELP')                                         66440027
              FREEKB                                                    66450027
              ERASE;                                                    66460027
         END;                                                           66470027
                                                                        66480027
         IF RCBM11FI.SOURCE_DK_DOCF = CSR_HELP                          66490027
          | RCBM11FI.SOURCE_DK_DOCF = CSR_EOF THEN                      66500027
         DO;                                                            66510027
           CSR_POS   = 4;                                               66520027
           HELP_FLAG = TRUE;                                            66530027
           EXEC CICS SEND                                               66540027
              MAP('SRCDOC')                                             66550027
              MAPSET('RCBHELP')                                         66560027
              FREEKB                                                    66570027
              ERASE;                                                    66580027
         END;                                                           66590027
                                                                        66600027
         IF RCBM11FI.PARAMETER_EFF_DATEF = CSR_HELP                     66610027
          | RCBM11FI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 66620027
         DO;                                                            66630027
           CSR_POS   = 5;                                               66640027
           HELP_FLAG = TRUE;                                            66650027
           EXEC CICS SEND                                               66660027
              MAP('PEFFDAT')                                            66670027
              MAPSET('RCBHELP')                                         66680027
              FREEKB                                                    66690027
              ERASE;                                                    66700027
         END;                                                           66710027
                                                                        66720027
         IF RCBM11FI.COUNTRY_NUMBERF = CSR_HELP                         66730027
          | RCBM11FI.COUNTRY_NUMBERF = CSR_EOF THEN                     66740027
         DO;                                                            66750027
           CSR_POS   = 6;                                               66760027
           HELP_FLAG = TRUE;                                            66770027
           EXEC CICS SEND                                               66780027
              MAP('CTYNO')                                              66790027
              MAPSET('RCBHELP')                                         66800027
              FREEKB                                                    66810027
              ERASE;                                                    66820027
         END;                                                           66830027
       END;                                                             66840027
                                                                        66850027
       OTHERWISE                                                        66860027
       DO;                                                              66870027
         HEADER.NEXT = '00';                                            66880027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1123';              66890027
         CALL RCBC11M_SEND_MAP;                                         66900027
       END;                                                             66910027
     END;                                                               66920027
   END;                                                                 66930027
                                                                        66940027
   WHEN('25')                                                           66950027
   DO;                                                                  66960027
     SELECT(RESPONSE);                                                  66970027
       WHEN(DFHRESP(NORMAL))                                            66980027
       DO;                                                              66990027
         IF RCBM11GI.ACTIONF = CSR_HELP                                 67000027
          | RCBM11GI.ACTIONF = CSR_EOF THEN                             67010027
         DO;                                                            67020027
           CSR_POS   = 1;                                               67030027
           HELP_FLAG = TRUE;                                            67040027
           EXEC CICS SEND                                               67050027
              MAP('ACT12')                                              67060027
              MAPSET('RCBHELP')                                         67070027
              FREEKB                                                    67080027
              ERASE;                                                    67090027
         END;                                                           67100027
                                                                        67110027
         IF RCBM11GI.DESCRIPTIONF = CSR_HELP                            67120027
          | RCBM11GI.DESCRIPTIONF = CSR_EOF THEN                        67130027
         DO;                                                            67140027
           CSR_POS   = 2;                                               67150027
           HELP_FLAG = TRUE;                                            67160027
           EXEC CICS SEND                                               67170027
              MAP('DESC')                                               67180027
              MAPSET('RCBHELP')                                         67190027
              FREEKB                                                    67200027
              ERASE;                                                    67210027
         END;                                                           67220027
                                                                        67230027
         IF RCBM11GI.NUMBER_OF_DAYSF = CSR_HELP                         67240027
          | RCBM11GI.NUMBER_OF_DAYSF = CSR_EOF THEN                     67250027
         DO;                                                            67260027
           CSR_POS   = 3;                                               67270027
           HELP_FLAG = TRUE;                                            67280027
           EXEC CICS SEND                                               67290027
              MAP('NUMDAYS')                                            67300027
              MAPSET('RCBHELP')                                         67310027
              FREEKB                                                    67320027
              ERASE;                                                    67330027
         END;                                                           67340027
                                                                        67350027
         IF RCBM11GI.PARAMETER_EFF_DATEF = CSR_HELP                     67360027
          | RCBM11GI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 67370027
         DO;                                                            67380027
           CSR_POS   = 4;                                               67390027
           HELP_FLAG = TRUE;                                            67400027
           EXEC CICS SEND                                               67410027
              MAP('PEFFDAT')                                            67420027
              MAPSET('RCBHELP')                                         67430027
              FREEKB                                                    67440027
              ERASE;                                                    67450027
         END;                                                           67460027
                                                                        67470027
         IF RCBM11GI.COUNTRY_NUMBERF = CSR_HELP                         67480027
          | RCBM11GI.COUNTRY_NUMBERF = CSR_EOF THEN                     67490027
         DO;                                                            67500027
           CSR_POS   = 5;                                               67510027
           HELP_FLAG = TRUE;                                            67520027
           EXEC CICS SEND                                               67530027
              MAP('CTYNO')                                              67540027
              MAPSET('RCBHELP')                                         67550027
              FREEKB                                                    67560027
              ERASE;                                                    67570027
         END;                                                           67580027
       END;                                                             67590027
                                                                        67600027
       OTHERWISE                                                        67610027
       DO;                                                              67620027
         HEADER.NEXT = '00';                                            67630027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1125';              67640027
         CALL RCBC11M_SEND_MAP;                                         67650027
       END;                                                             67660027
     END;                                                               67670027
   END;                                                                 67680027
                                                                        67690027
   WHEN('26')                                                           67700027
   DO;                                                                  67710027
     SELECT(RESPONSE);                                                  67720027
       WHEN(DFHRESP(NORMAL))                                            67730027
       DO;                                                              67740027
         IF RCBM11HI.ACTIONF = CSR_HELP                                 67750027
          | RCBM11HI.ACTIONF = CSR_EOF THEN                             67760027
         DO;                                                            67770027
           CSR_POS   = 1;                                               67780027
           HELP_FLAG = TRUE;                                            67790027
           EXEC CICS SEND                                               67800027
              MAP('ACT12')                                              67810027
              MAPSET('RCBHELP')                                         67820027
              FREEKB                                                    67830027
              ERASE;                                                    67840027
         END;                                                           67850027
                                                                        67860027
         IF RCBM11HI.PROGRAM_RUN_TYPEF = CSR_HELP                       67870027
          | RCBM11HI.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   67880027
         DO;                                                            67890027
           CSR_POS   = 2;                                               67900027
           HELP_FLAG = TRUE;                                            67910027
           EXEC CICS SEND                                               67920027
              MAP('PROGRT')                                             67930027
              MAPSET('RCBHELP')                                         67940027
              FREEKB                                                    67950027
              ERASE;                                                    67960027
         END;                                                           67970027
                                                                        67980027
         IF RCBM11HI.DESCRIPTIONF = CSR_HELP                            67990027
          | RCBM11HI.DESCRIPTIONF = CSR_EOF THEN                        68000027
         DO;                                                            68010027
           CSR_POS   = 3;                                               68020027
           HELP_FLAG = TRUE;                                            68030027
           EXEC CICS SEND                                               68040027
              MAP('DESC')                                               68050027
              MAPSET('RCBHELP')                                         68060027
              FREEKB                                                    68070027
              ERASE;                                                    68080027
         END;                                                           68090027
                                                                        68100027
         IF RCBM11HI.ADDR_TYPEF = CSR_HELP                              68110027
          | RCBM11HI.ADDR_TYPEF = CSR_EOF THEN                          68120027
         DO;                                                            68130027
           CSR_POS   = 4;                                               68140027
           HELP_FLAG = TRUE;                                            68150027
           EXEC CICS SEND                                               68160027
              MAP('ADDTYPE')                                            68170027
              MAPSET('RCBHELP')                                         68180027
              FREEKB                                                    68190027
              ERASE;                                                    68200027
         END;                                                           68210027
                                                                        68220027
         IF RCBM11HI.PARAMETER_EFF_DATEF = CSR_HELP                     68230027
          | RCBM11HI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 68240027
         DO;                                                            68250027
           CSR_POS   = 5;                                               68260027
           HELP_FLAG = TRUE;                                            68270027
           EXEC CICS SEND                                               68280027
              MAP('PEFFDAT')                                            68290027
              MAPSET('RCBHELP')                                         68300027
              FREEKB                                                    68310027
              ERASE;                                                    68320027
         END;                                                           68330027
                                                                        68340027
         IF RCBM11HI.COUNTRY_NUMBERF = CSR_HELP                         68350027
          | RCBM11HI.COUNTRY_NUMBERF = CSR_EOF THEN                     68360027
         DO;                                                            68370027
           CSR_POS   = 6;                                               68380027
           HELP_FLAG = TRUE;                                            68390027
           EXEC CICS SEND                                               68400027
              MAP('CTYNO')                                              68410027
              MAPSET('RCBHELP')                                         68420027
              FREEKB                                                    68430027
              ERASE;                                                    68440027
         END;                                                           68450027
       END;                                                             68460027
                                                                        68470027
       OTHERWISE                                                        68480027
       DO;                                                              68490027
         HEADER.NEXT = '00';                                            68500027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1126';              68510027
         CALL RCBC11M_SEND_MAP;                                         68520027
       END;                                                             68530027
     END;                                                               68540027
   END;                                                                 68550027
                                                                        68560027
   WHEN('36')                                                           68570027
   DO;                                                                  68580027
     SELECT(RESPONSE);                                                  68590027
       WHEN(DFHRESP(NORMAL))                                            68600027
       DO;                                                              68610027
         IF RCBM11II.ACTIONF = CSR_HELP                                 68620027
          | RCBM11II.ACTIONF = CSR_EOF THEN                             68630027
         DO;                                                            68640027
           CSR_POS   = 1;                                               68650027
           HELP_FLAG = TRUE;                                            68660027
           EXEC CICS SEND                                               68670027
              MAP('ACT12')                                              68680027
              MAPSET('RCBHELP')                                         68690027
              FREEKB                                                    68700027
              ERASE;                                                    68710027
         END;                                                           68720027
                                                                        68730027
         IF RCBM11II.DESCRIPTIONF = CSR_HELP                            68740027
          | RCBM11II.DESCRIPTIONF = CSR_EOF THEN                        68750027
         DO;                                                            68760027
           CSR_POS   = 2;                                               68770027
           HELP_FLAG = TRUE;                                            68780027
           EXEC CICS SEND                                               68790027
              MAP('DESC')                                               68800027
              MAPSET('RCBHELP')                                         68810027
              FREEKB                                                    68820027
              ERASE;                                                    68830027
         END;                                                           68840027
                                                                        68850027
         IF RCBM11II.PERF_SYSTEMF = CSR_HELP                            68860027
          | RCBM11II.PERF_SYSTEMF = CSR_EOF THEN                        68870027
         DO;                                                            68880027
           CSR_POS   = 3;                                               68890027
           HELP_FLAG = TRUE;                                            68900027
           EXEC CICS SEND                                               68910027
              MAP('PERFSYS')                                            68920027
              MAPSET('RCBHELP')                                         68930027
              FREEKB                                                    68940027
              ERASE;                                                    68950027
         END;                                                           68960027
                                                                        68970027
         IF RCBM11II.PARAMETER_EFF_DATEF = CSR_HELP                     68980027
          | RCBM11II.PARAMETER_EFF_DATEF = CSR_EOF THEN                 68990027
         DO;                                                            69000027
           CSR_POS   = 4;                                               69010027
           HELP_FLAG = TRUE;                                            69020027
           EXEC CICS SEND                                               69030027
              MAP('PEFFDAT')                                            69040027
              MAPSET('RCBHELP')                                         69050027
              FREEKB                                                    69060027
              ERASE;                                                    69070027
         END;                                                           69080027
                                                                        69090027
         IF RCBM11II.COUNTRY_NUMBERF = CSR_HELP                         69100027
          | RCBM11II.COUNTRY_NUMBERF = CSR_EOF THEN                     69110027
         DO;                                                            69120027
           CSR_POS   = 5;                                               69130027
           HELP_FLAG = TRUE;                                            69140027
           EXEC CICS SEND                                               69150027
              MAP('CTYNO')                                              69160027
              MAPSET('RCBHELP')                                         69170027
              FREEKB                                                    69180027
              ERASE;                                                    69190027
         END;                                                           69200027
       END;                                                             69210027
                                                                        69220027
       OTHERWISE                                                        69230027
       DO;                                                              69240027
         HEADER.NEXT = '00';                                            69250027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1136';              69260027
         CALL RCBC11M_SEND_MAP;                                         69270027
       END;                                                             69280027
     END;                                                               69290027
   END;                                                                 69300027
                                                                        69310027
   WHEN('40')                                                           69320027
   DO;                                                                  69330027
     SELECT(RESPONSE);                                                  69340027
       WHEN(DFHRESP(NORMAL))                                            69350027
       DO;                                                              69360027
         IF RCBM11JI.ACTIONF = CSR_HELP                                 69370027
          | RCBM11JI.ACTIONF = CSR_EOF THEN                             69380027
         DO;                                                            69390027
           CSR_POS   = 1;                                               69400027
           HELP_FLAG = TRUE;                                            69410027
           EXEC CICS SEND                                               69420027
              MAP('ACT12')                                              69430027
              MAPSET('RCBHELP')                                         69440027
              FREEKB                                                    69450027
              ERASE;                                                    69460027
         END;                                                           69470027
                                                                        69480027
         IF RCBM11JI.PROGRAM_RUN_TYPEF = CSR_HELP                       69490027
          | RCBM11JI.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   69500027
         DO;                                                            69510027
           CSR_POS   = 2;                                               69520027
           HELP_FLAG = TRUE;                                            69530027
           EXEC CICS SEND                                               69540027
              MAP('PROGRT')                                             69550027
              MAPSET('RCBHELP')                                         69560027
              FREEKB                                                    69570027
              ERASE;                                                    69580027
         END;                                                           69590027
                                                                        69600027
         IF RCBM11JI.DESCRIPTIONF = CSR_HELP                            69610027
          | RCBM11JI.DESCRIPTIONF = CSR_EOF THEN                        69620027
         DO;                                                            69630027
           CSR_POS   = 3;                                               69640027
           HELP_FLAG = TRUE;                                            69650027
           EXEC CICS SEND                                               69660027
              MAP('DESC')                                               69670027
              MAPSET('RCBHELP')                                         69680027
              FREEKB                                                    69690027
              ERASE;                                                    69700027
         END;                                                           69710027
                                                                        69720027
         IF RCBM11JI.RET_PER_GLOBALF = CSR_HELP                         69730027
          | RCBM11JI.RET_PER_GLOBALF = CSR_EOF THEN                     69740027
         DO;                                                            69750027
           CSR_POS   = 4;                                               69760027
           HELP_FLAG = TRUE;                                            69770027
           EXEC CICS SEND                                               69780027
              MAP('RETPER')                                             69790027
              MAPSET('RCBHELP')                                         69800027
              FREEKB                                                    69810027
              ERASE;                                                    69820027
         END;                                                           69830027
                                                                        69840027
         IF RCBM11JI.RET_PER_POF = CSR_HELP                             69850027
          | RCBM11JI.RET_PER_POF = CSR_EOF THEN                         69860027
         DO;                                                            69870027
           CSR_POS   = 5;                                               69880027
           HELP_FLAG = TRUE;                                            69890027
           EXEC CICS SEND                                               69900027
              MAP('PORET')                                              69910027
              MAPSET('RCBHELP')                                         69920027
              FREEKB                                                    69930027
              ERASE;                                                    69940027
         END;                                                           69950027
                                                                        69960027
         DO N = 1 TO 8;                                                 69970027
           CSR_ROW   = N;                                               69980027
           IF RCBM11JI.HK_SELF(N) = CSR_HELP                            69990027
            | RCBM11JI.HK_SELF(N) = CSR_EOF THEN                        70000027
           DO;                                                          70010027
             N = 9;                                                     70020027
             CSR_POS   = 6;                                             70030027
             HELP_FLAG = TRUE;                                          70040027
             EXEC CICS SEND                                             70050027
                MAP('HKGRP')                                            70060027
                MAPSET('RCBHELP')                                       70070027
                FREEKB                                                  70080027
                ERASE;                                                  70090027
           END;                                                         70100027
         END;                                                           70110027
                                                                        70120027
         IF RCBM11JI.PARAMETER_EFF_DATEF = CSR_HELP                     70130027
          | RCBM11JI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 70140027
         DO;                                                            70150027
           CSR_POS   = 7;                                               70160027
           HELP_FLAG = TRUE;                                            70170027
           EXEC CICS SEND                                               70180027
              MAP('PEFFDAT')                                            70190027
              MAPSET('RCBHELP')                                         70200027
              FREEKB                                                    70210027
              ERASE;                                                    70220027
         END;                                                           70230027
                                                                        70240027
         IF RCBM11JI.COUNTRY_NUMBERF = CSR_HELP                         70250027
          | RCBM11JI.COUNTRY_NUMBERF = CSR_EOF THEN                     70260027
         DO;                                                            70270027
           CSR_POS   = 8;                                               70280027
           HELP_FLAG = TRUE;                                            70290027
           EXEC CICS SEND                                               70300027
              MAP('CTYNO')                                              70310027
              MAPSET('RCBHELP')                                         70320027
              FREEKB                                                    70330027
              ERASE;                                                    70340027
         END;                                                           70350027
       END;                                                             70360027
                                                                        70370027
       OTHERWISE                                                        70380027
       DO;                                                              70390027
         HEADER.NEXT = '00';                                            70400027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1140';              70410027
         CALL RCBC11M_SEND_MAP;                                         70420027
       END;                                                             70430027
     END;                                                               70440027
   END;                                                                 70450027
                                                                        70460027
   WHEN('50')                                                           70470027
   DO;                                                                  70480027
     SELECT(RESPONSE);                                                  70490027
       WHEN(DFHRESP(NORMAL))                                            70500027
       DO;                                                              70510027
         IF RCBM11KI.ACTIONF = CSR_HELP                                 70520027
          | RCBM11KI.ACTIONF = CSR_EOF THEN                             70530027
         DO;                                                            70540027
           CSR_POS   = 1;                                               70550027
           HELP_FLAG = TRUE;                                            70560027
           EXEC CICS SEND                                               70570027
              MAP('ACT12')                                              70580027
              MAPSET('RCBHELP')                                         70590027
              FREEKB                                                    70600027
              ERASE;                                                    70610027
         END;                                                           70620027
                                                                        70630027
         IF RCBM11KI.DESCRIPTIONF = CSR_HELP                            70640027
          | RCBM11KI.DESCRIPTIONF = CSR_EOF THEN                        70650027
         DO;                                                            70660027
           CSR_POS   = 2;                                               70670027
           HELP_FLAG = TRUE;                                            70680027
           EXEC CICS SEND                                               70690027
              MAP('DESC')                                               70700027
              MAPSET('RCBHELP')                                         70710027
              FREEKB                                                    70720027
              ERASE;                                                    70730027
         END;                                                           70740027
                                                                        70750027
         IF RCBM11KI.NUMBER_OF_DAYSF = CSR_HELP                         70760027
          | RCBM11KI.NUMBER_OF_DAYSF = CSR_EOF THEN                     70770027
         DO;                                                            70780027
           CSR_POS   = 3;                                               70790027
           HELP_FLAG = TRUE;                                            70800027
           EXEC CICS SEND                                               70810027
              MAP('NUMDAYS')                                            70820027
              MAPSET('RCBHELP')                                         70830027
              FREEKB                                                    70840027
              ERASE;                                                    70850027
         END;                                                           70860027
                                                                        70870027
         IF RCBM11KI.PARAMETER_EFF_DATEF = CSR_HELP                     70880027
          | RCBM11KI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 70890027
         DO;                                                            70900027
           CSR_POS   = 4;                                               70910027
           HELP_FLAG = TRUE;                                            70920027
           EXEC CICS SEND                                               70930027
              MAP('PEFFDAT')                                            70940027
              MAPSET('RCBHELP')                                         70950027
              FREEKB                                                    70960027
              ERASE;                                                    70970027
         END;                                                           70980027
                                                                        70990027
         IF RCBM11KI.COUNTRY_NUMBERF = CSR_HELP                         71000027
          | RCBM11KI.COUNTRY_NUMBERF = CSR_EOF THEN                     71010027
         DO;                                                            71020027
           CSR_POS   = 5;                                               71030027
           HELP_FLAG = TRUE;                                            71040027
           EXEC CICS SEND                                               71050027
              MAP('CTYNO')                                              71060027
              MAPSET('RCBHELP')                                         71070027
              FREEKB                                                    71080027
              ERASE;                                                    71090027
         END;                                                           71100027
       END;                                                             71110027
                                                                        71120027
       OTHERWISE                                                        71130027
       DO;                                                              71140027
         HEADER.NEXT = '00';                                            71150027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1150';              71160027
         CALL RCBC11M_SEND_MAP;                                         71170027
       END;                                                             71180027
     END;                                                               71190027
   END;                                                                 71200027
   WHEN('69')                                                           71210027
   DO;                                                                  71220027
     SELECT(RESPONSE);                                                  71230027
       WHEN(DFHRESP(NORMAL))                                            71240027
       DO;                                                              71250027
         IF RCBM11LI.ACTIONF = CSR_HELP                                 71260027
          | RCBM11LI.ACTIONF = CSR_EOF THEN                             71270027
         DO;                                                            71280027
           CSR_POS   = 1;                                               71290027
           HELP_FLAG = TRUE;                                            71300027
           EXEC CICS SEND                                               71310027
              MAP('ACT12')                                              71320027
              MAPSET('RCBHELP')                                         71330027
              FREEKB                                                    71340027
              ERASE;                                                    71350027
         END;                                                           71360027
                                                                        71370027
         IF RCBM11LI.PROGRAM_RUN_TYPEF = CSR_HELP                       71380027
          | RCBM11LI.PROGRAM_RUN_TYPEF = CSR_EOF THEN                   71390027
         DO;                                                            71400027
           CSR_POS   = 2;                                               71410027
           HELP_FLAG = TRUE;                                            71420027
           EXEC CICS SEND                                               71430027
              MAP('PROGRT')                                             71440027
              MAPSET('RCBHELP')                                         71450027
              FREEKB                                                    71460027
              ERASE;                                                    71470027
         END;                                                           71480027
                                                                        71490027
         IF RCBM11LI.DESCRIPTIONF = CSR_HELP                            71500027
          | RCBM11LI.DESCRIPTIONF = CSR_EOF THEN                        71510027
         DO;                                                            71520027
           CSR_POS   = 3;                                               71530027
           HELP_FLAG = TRUE;                                            71540027
           EXEC CICS SEND                                               71550027
              MAP('DESC')                                               71560027
              MAPSET('RCBHELP')                                         71570027
              FREEKB                                                    71580027
              ERASE;                                                    71590027
         END;                                                           71600027
                                                                        71610027
         IF RCBM11LI.OU_CODEF = CSR_HELP                                71620027
          | RCBM11LI.OU_CODEF = CSR_EOF THEN                            71630027
         DO;                                                            71640027
           CSR_POS   = 4;                                               71650027
           HELP_FLAG = TRUE;                                            71660027
           EXEC CICS SEND                                               71670027
              MAP('OU69')                                               71680027
              MAPSET('RCBHELP')                                         71690027
              FREEKB                                                    71700027
              ERASE;                                                    71710027
         END;                                                           71720027
                                                                        71730027
         IF RCBM11LI.PARAMETER_EFF_DATEF = CSR_HELP                     71740027
          | RCBM11LI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 71750027
         DO;                                                            71760027
           CSR_POS   = 5;                                               71770027
           HELP_FLAG = TRUE;                                            71780027
           EXEC CICS SEND                                               71790027
              MAP('PEFFDAT')                                            71800027
              MAPSET('RCBHELP')                                         71810027
              FREEKB                                                    71820027
              ERASE;                                                    71830027
         END;                                                           71840027
                                                                        71850027
         IF RCBM11LI.COUNTRY_NUMBERF = CSR_HELP                         71860027
          | RCBM11LI.COUNTRY_NUMBERF = CSR_EOF THEN                     71870027
         DO;                                                            71880027
           CSR_POS   = 6;                                               71890027
           HELP_FLAG = TRUE;                                            71900027
           EXEC CICS SEND                                               71910027
              MAP('CTYNO')                                              71920027
              MAPSET('RCBHELP')                                         71930027
              FREEKB                                                    71940027
              ERASE;                                                    71950027
         END;                                                           71960027
       END;                                                             71970027
                                                                        71980027
       OTHERWISE                                                        71990027
       DO;                                                              72000027
         HEADER.NEXT = '00';                                            72010027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1169';              72020027
         CALL RCBC11M_SEND_MAP;                                         72030027
       END;                                                             72040027
     END;                                                               72050027
   END;                                                                 72060027
   WHEN('70')                                            /*SOC RB01290*/72070027
   DO;                                                                  72080027
     SELECT(RESPONSE);                                                  72090027
       WHEN(DFHRESP(NORMAL))                                            72100027
       DO;                                                              72110027
         IF RCBM11MI.ACTIONF = CSR_HELP                                 72120027
          | RCBM11MI.ACTIONF = CSR_EOF THEN                             72130027
         DO;                                                            72140027
           CSR_POS   = 1;                                               72150027
           HELP_FLAG = TRUE;                                            72160027
           EXEC CICS SEND                                               72170027
              MAP('ACT12')                                              72180027
              MAPSET('RCBHELP')                                         72190027
              FREEKB                                                    72200027
              ERASE;                                                    72210027
         END;                                                           72220027
                                                                        72230027
                                                                        72240027
         IF RCBM11MI.DESCRIPTIONF = CSR_HELP                            72250027
          | RCBM11MI.DESCRIPTIONF = CSR_EOF THEN                        72260027
         DO;                                                            72270027
           CSR_POS   = 2;                                               72280027
           HELP_FLAG = TRUE;                                            72290027
           EXEC CICS SEND                                               72300027
              MAP('DESC')                                               72310027
              MAPSET('RCBHELP')                                         72320027
              FREEKB                                                    72330027
              ERASE;                                                    72340027
         END;                                                           72350027
                                                                        72360027
         IF RCBM11MI.TYPE_OF_CONTRACTF = CSR_HELP                       72370027
          | RCBM11MI.TYPE_OF_CONTRACTF = CSR_EOF THEN                   72380027
         DO;                                                            72390027
           CSR_POS   = 3;                                               72400027
           HELP_FLAG = TRUE;                                            72410027
           EXEC CICS SEND                                               72420027
              MAP('TYPCONT')                                            72430027
              MAPSET('RCBHELP')                                         72440027
              FREEKB                                                    72450027
              ERASE;                                                    72460027
         END;                                                           72470027
                                                                        72480027
         IF RCBM11MI.TYPE_OF_MAINTF = CSR_HELP                          72490027
          | RCBM11MI.TYPE_OF_MAINTF = CSR_EOF THEN                      72500027
         DO;                                                            72510027
           CSR_POS   = 4;                                               72520027
           HELP_FLAG = TRUE;                                            72530027
           EXEC CICS SEND                                               72540027
              MAP('TOMINCM')                                            72550027
              MAPSET('RCBHELP')                                         72560027
              FREEKB                                                    72570027
              ERASE;                                                    72580027
         END;                                                           72590027
                                                                        72600027
         IF RCBM11MI.MACHINE_STATUSF = CSR_HELP                         72610027
          | RCBM11MI.MACHINE_STATUSF = CSR_EOF THEN                     72620027
         DO;                                                            72630027
           CSR_POS   = 5;                                               72640027
           HELP_FLAG = TRUE;                                            72650027
           EXEC CICS SEND                                               72660027
              MAP('MSTATUS')                                            72670027
              MAPSET('RCBHELP')                                         72680027
              FREEKB                                                    72690027
              ERASE;                                                    72700027
         END;                                                           72710027
                                                                        72720027
         IF RCBM11MI.PARAMETER_EFF_DATEF = CSR_HELP                     72730027
          | RCBM11MI.PARAMETER_EFF_DATEF = CSR_EOF THEN                 72740027
         DO;                                                            72750027
           CSR_POS   = 6;                                               72760027
           HELP_FLAG = TRUE;                                            72770027
           EXEC CICS SEND                                               72780027
              MAP('PEFFDAT')                                            72790027
              MAPSET('RCBHELP')                                         72800027
              FREEKB                                                    72810027
              ERASE;                                                    72820027
         END;                                                           72830027
                                                                        72840027
         IF RCBM11MI.COUNTRY_NUMBERF = CSR_HELP                         72850027
          | RCBM11MI.COUNTRY_NUMBERF = CSR_EOF THEN                     72860027
         DO;                                                            72870027
           CSR_POS   = 7;                                               72880027
           HELP_FLAG = TRUE;                                            72890027
           EXEC CICS SEND                                               72900027
              MAP('CTYNO')                                              72910027
              MAPSET('RCBHELP')                                         72920027
              FREEKB                                                    72930027
              ERASE;                                                    72940027
         END;                                                           72950027
       END;                                                             72960027
                                                                        72970027
       OTHERWISE                                                        72980027
       DO;                                                              72990027
         HEADER.NEXT = '00';                                            73000027
         RCBM110O.MSG_LINEO = ERR_MESSAGE3 || ' RCBM1170';              73010027
         CALL RCBC11M_SEND_MAP;                                         73020027
       END;                                                             73030027
     END;                                                               73040027
   END;                                                 /*EOC RB01290*/ 73050027
                                                                        73060027
 END;                                                                   73070027
                                                                        73080027
 IF HELP_FLAG = FALSE THEN                                              73090027
   CALL RCBC11M_SEND_MAP;                                               73100027
                                                                        73110027
0EXEC CICS RETURN                                                       73120027
    TRANSID('RC11')                                                     73130027
    COMMAREA(COMMAREA)                                                  73140027
    LENGTH(CSTG(COMMAREA))                                              73150027
    RESP(RESPONSE)                                                      73160027
    RESP2(CODE_EXPLAIN);                                                73170027
                                                                        73180027
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 73190027
   WHEN(DFHRESP(NORMAL));                                               73200027
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  73210027
   DO;                                                                  73220027
     COMMAREA_LENGTH = EIBCALEN;                                        73230027
     EXEC CICS RETURN                                                   73240027
        TRANSID('RC11')                                                 73250027
        COMMAREA(COMMAREA)                                              73260027
        LENGTH(COMMAREA_LENGTH);                                        73270027
   END;                                                                 73280027
   OTHERWISE                                                            73290027
   DO;                                                                  73300027
     RCBM110O.MSG_LINEO = ERR_MESSAGE30;                                73310027
     CALL RCBC11M_SEND_MAP;                                             73320027
   END;                                                                 73330027
 END;                                                                   73340027
                                                                        73350027
0END RCBC11M_HELP_MAP;                                                  73360027
1/********************************************************************/ 73370027
 /*      CLEAR WORK AREA FIELDS                                      */ 73380027
 /********************************************************************/ 73390027
 RCBC11M_CLEAR_WORK: PROC;                                              73400027
                                                                        73410027
 WRK_ACTION             = '';                                           73420027
 WRK_PARAMETER_NUMBER   = '';                                           73430027
 WRK_PROGRAM_RUN_TYPE   = '';                                           73440027
 WRK_PROCESS_ID         = '';                                           73450027
 WRK_COUNTRY_SET_ID     = '';                                           73460027
 WRK_DESCRIPTION        = '';                                           73470027
 WRK_PARAMETER_EFF_DATE = '';                                           73480027
 WRK_ADDR_LIN_IND       = '';                                           73490027
 WRK_MAX_REC_AGE_DIFF   = '';                                           73500027
 WRK_SW_EXTR_VOLUME     = '';                                           73510027
 WRK_CU_EXTR_VOLUME     = '';                                           73520027
 WRK_ADDRESS_RES        = '';                                           73530027
 WRK_RET_PERIOD_HIST    = '';                                           73540027
 WRK_HOR_DATE_FUT       = '';                                           73550027
 WRK_PI_TO_RCMS         = '';                                           73560027
 WRK_PI_TO_BMT          = '';                                           73570027
 WRK_PI_TO_CEREOLS      = '';                                           73580027
 WRK_FEATURE_STORE_IND  = '';                                           73590027
 WRK_FEAT_LINE          = '';                                           73600027
 WRK_RCMS_GROUP_ID      = '';                                           73610027
 WRK_EXTRACT_TYPE       = '';                                           73620027
 WRK_OU_CODE            = '';                                           73630027
 WRK_UPDATE_TYPE        = '';                                           73640027
 WRK_PROGRAM_NAME       = '';                                           73650027
 WRK_CHECKPOINT_LIMIT   = '';                                           73660027
 WRK_MAINT_SYSTEM_HW    = '';                                           73670027
 WRK_MAINT_SYSTEM_SW    = '';                                           73680027
 WRK_PEW_WED_IND        = '';                                           73690027
 WRK_OU_REPORT          = '';                                           73700027
 WRK_AREA_INDICATOR     = '';                                           73710027
 WRK_ZIP_CODE_ID        = '';                                           73720027
 WRK_CHIS_TABLE_IND     = '';                                           73730027
 WRK_HORIZON_PERIOD     = '';                                           73740027
 WRK_SOURCE_DC_DOC      = '';                                           73750027
 WRK_SOURCE_DK_DOC      = '';                                           73760027
 WRK_NUMBER_OF_DAYS     = '';                                           73770027
 WRK_ADDR_TYPE          = '';                                           73780027
 WRK_PERF_SYSTEM        = '';                                           73790027
 WRK_RET_PER_GLOBAL     = '';                                           73800027
 WRK_RET_PER_PO         = '';                                           73810027
 WRK_HK_LINE            = '';                                           73820027
 WRK_MSG                = '';                                           73830027
 WRK_TYPE_OF_CONTRACT   = '';                           /*SOC RB01290*/ 73840027
 WRK_TYPE_OF_MAINT      = '';                                           73850027
 WRK_MACHINE_STATUS     = '';                           /*EOC RB01290*/ 73860027
                                                                        73870027
 DO I = 1 TO 8;                                                         73880027
   WRK_HK_SEL(I) = '';                                                  73890027
 END;                                                                   73900027
                                                                        73910027
 DO I = 1 TO 40;                                                        73920027
   WRK_FEAT(I) = '';                                                    73930027
 END;                                                                   73940027
                                                                        73950027
 END RCBC11M_CLEAR_WORK;                                                73960027
1/*******************************************************************/  73970027
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  73980027
 /*******************************************************************/  73990027
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  74000027
  $DAIMOD (RCBC11M);                     /* MODULE TO BE COMPILED   */  74010027
0/*******************************************************************/  74020027
 /* END OF ABR BLOCK '                                              */  74030027
 /*******************************************************************/  74040027
0 END RCBC11M;                                                          74050027