 /* RCBCS1M - ROOT MODULE FOR ACM / CEDS QUERY BY SERIAL TRANSACTION */ 00010000
 /*                                                                  */ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /*                                                                  */ 00060000
 /********************************************************************/ 00070000
 /* PROGRAM          : RCBCS1M                                       */ 00080000
 /*                                                                  */ 00090000
 /* LANGUAGE         : PLICSQL                                       */ 00100000
 /*                                                                  */ 00110000
 /* TYPE             : LINKABLE MODULE                               */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION      :                                               */ 00140000
 /*                                                                  */ 00150000
 /* TRANSACTION RECEIVES CONTROL FROM REQUEST-TRANSACTION BY 'LINK'  */ 00160000
 /* CONTROL.                                                         */ 00170000
 /* CONTROL BACK TO THE REQUEST-TRANSACTION BY 'RETURN'.             */ 00180000
 /*                                                                  */ 00190000
 /* THE REQUEST CAN BE - 'LI' FOR LIST SEARCH                        */ 00200000
 /*                    - 'DE' FOR ITEM DETAIL                        */ 00210000
 /*                    - 'DL' FOR ITEM DETAIL, IF NOT FOUND THEN     */ 00220000
 /*                       LIST SEARCH                                */ 00230000
 /*                                                                  */ 00240000
 /* THE SEARCH CAN BE  - 'MC' FOR MULTI COUNTRY                      */ 00250000
 /*                    - 'SC' FOR SINGLE COUNTRY                     */ 00260000
 /*                                                                  */ 00270000
 /* ALL WARNINGS AND ERRORS WILL BE STORED IN AN EXTRA PARTITION     */ 00280000
 /* TRANSIENT DATASET.                                               */ 00290000
 /*                                                                  */ 00300000
 /* INPUT            : COMMPTR - COMMUNICATION AREA POINTER          */ 00310000
 /*                                                                  */ 00320000
 /* OUTPUT           : COMMPTR - COMMUNICATION AREA POINTER          */ 00330000
 /*                                                                  */ 00340000
 /*                                                                  */ 00350000
 /* EXTERNAL MODULES : RCBCS2M - LIST MODULE                         */ 00360000
 /*                    RCBCS3M - DETAIL MODULE                       */ 00370000
 /*                    RCBCQEM - ERROR LOGGING MODULE                */ 00380000
 /*                                                                  */ 00390000
 /* MESSAGES         :                                               */ 00400000
 /*                                                                  */ 00410000
 /* DEPENDENCIES     : NONE                                          */ 00420000
 /*                                                                  */ 00430000
 /* MAINTENANCE LOG  :                                               */ 00440000
 /* ---------------                                                  */ 00450000
 /*                                                                  */ 00460000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00470000
 /* --------------------------------------------------------------   */ 00480000
 /*  2002-07-24 | RA01233      | TACTICAL SERVICE REFERENCE          */ 00490000
 /*  2006-08-09 | RB01272      | LENOVO ENHANCEMENTS FOR CEDS 3.3    */ 00500000
 /*  2008-06-12 | RB01291      | PCR P08-0090 REMOVE LOGIC TO ACCEPTS*/ 00510000
 /*             |              | ANY DIV=44 /ORIGIN='L%' AS LENOVO   */ 00520000
 /*  2009-10-09 | RC01302      | PCEDSP-0021 QBS REDESIGN            */ 00530000
 /*  2011-04-11 | RB01312      | QBS CHANGE QUERY TO LOOK FOR ENTRY  */ 00540000
 /*             |              | WITH BEST WARRANTY EXPIRY DATE WHEN */ 00550000
 /*             |              | OUT-OF-COUNTRY CALL REGISTERED.     */ 00560000
 /*  2012-02-01 | RB01320      | CEDS 3.3 A17 LONG SERIAL REQ        */ 00570000
 /*  2013-07-19 | CEDS00000642 | REALIGMENT OF COMMAREA FOR OLD AND  */ 00580000
 /*             |              | NEW VERSION.                        */ 00590000
 /*  2014-04-04 | RC01339      | WHEN TYPE REQUEST IS 'DL' AND       */ 00600000
 /*             |              | CRMORET IS '0' THEN CHANGING THE    */ 00610000
 /*             |              | VALUES OF CRMOSUB FOR EXACT(TYPE,   */ 00620000
 /*             |              | SERIAL) AND NON EXACT MATCH(SERIAL) */ 00630000
 /*  2014-08-05 | RC01344      | PCEDSP-0490 - SHORT 5 SERIAL CHECK  */ 00640000
 /*             |              | FOR NON IBM MACHINES                */ 00650000
 /*  2014-10-10 | CEDS00000703 | FIX FOR REQUEST TYPE 'DL'           */ 00660000
 /*  2014-10-27 | CEDS00000704 | HANDLE EMPTY CONDITION FOR T125     */ 00670000
 /*             |              | AS PART OF TREC T10-2070            */ 00680000
 /*  2015-02-02 | CEDS00000727 | T10-2117 & T10-2118 -  QBS NOT      */ 00690000
 /*             |              | RETRIEVING PROPER RESULTS WHEN SHORT*/ 00700000
 /*             |              | AND LONG SERIAL ARE SAME. & QBS     */ 00710000
 /*             |              | PROVIDES BLANK ORIGIN AND SEQ NO    */ 00720000
 /*  2015-02-20 | RC01354      | REVERTING THE CHANGES OF PCR-490    */ 00730000
 /*  2015-03-09 | CEDS00000734 | T081563 - CHANGES DONE TO PREVENT   */ 00740000
 /*             |              | RCMS FROM ABENDING WHEN LOOKING FOR */ 00750000
 /*             |              | TOS WHICH DOES NOT EXIST IN CEDS.   */ 00760000
 /*  2015-06-24 | CEDS00000747 | T081577 - WITH OLD VERSION, TQBS WAS*/ 00770000
 /*             |              | THROWING -180 ERROR FOR "TOS NOT    */ 00780000
 /*             |              | FOUND" SCENARIO. CHANGES DONE TO    */ 00790000
 /*             |              | PASS CORRECT VALUES TO SQL QUERY.   */ 00800000
 /*  2015-07-14 | CEDS00000760 | T10-2157- TOS NOT FOUND FOR OLD     */ 00810000
 /*             |              | VERSION WHEN COUNTRY NUMBER ON      */ 00820000
 /*             |              | SCREEN IS DIFFERENT FROM COUNTRY    */ 00830000
 /*             |              | NUMBER IN TABLES                    */ 00840000
 /*  2015-07-15 | CEDS00000761 | TEMEA-T081589 : CODE CHANGES DONE   */ 00841000
 /*             |              | TO PREVENT RCMS FROM ABENDING.      */ 00842000
 /*  2015-10-26 | RC01367      | PCEDSP-0588 : CHANGE IN SEARCH      */ 00843006
 /*             |              | SEQUENCE FOR DE                     */ 00844006
 /********************************************************************/ 00850000
1RCBCS1M: PROC(COMMPTR)                                                 00860000
          OPTIONS (MAIN)                                                00870000
          REORDER;                                                      00880000
0/********************************************************************/ 00890000
 /*  EXTERNAL ENTRIES                                                */ 00900000
 /********************************************************************/ 00910000
 DCL RCBCQEM   ENTRY EXTERNAL;     /* ERROR LOGGING ROUTINE          */ 00920000
1/********************************************************************/ 00930000
 /*  COMMUNICATION AREA                                              */ 00940000
 /********************************************************************/ 00950000
 %INCLUDE (RCBCQ0S);                                                    00960000
1/********************************************************************/ 00970000
 /*  COMMUNICATION AREA - HEADER STRUCTURE                           */ 00980000
 /********************************************************************/ 00990000
                                                 /* SOC CEDS00000642 */ 01000000
0DCL 1 HEADER_OLD         BASED (COMMPTR),                              01010000
 %INCLUDE EDQBSHS;;                                                     01020000
                                                                        01030000
0DCL 1 HEADER_NEW         BASED (COMMPTR),                              01040000
 %INCLUDE EDQBSHS1;;                                                    01050000
                                                                        01060000
0DCL 1 HEADER,                                                          01070000
 %INCLUDE EDQBSHS;;                                                     01080000
                                                                        01090000
 DCL 1 DETAIL BASED(COMMPTR),                                           01100000
 %INCLUDE (EDQBSHS);,                                                   01110000
 %INCLUDE (EDQBSDS);;                                                   01120000
                                                                        01130000
 DCL 1 DETAIL1 BASED(COMMPTR),                                          01140000
 %INCLUDE (EDQBSHS1);,                                                  01150000
 %INCLUDE (EDQBSDS1);;                                                  01160000
                                                                        01170000
 DCL 1 LISTIT BASED(COMMPTR),                                           01180000
 %INCLUDE (EDQBSHS);,                                                   01190000
 %INCLUDE (EDQBSLS);;                                                   01200000
                                                                        01210000
 DCL 1 LISTIT1 BASED(COMMPTR),                                          01220000
 %INCLUDE (EDQBSHS1);,                                                  01230000
 %INCLUDE (EDQBSLS1);;                                                  01240000
 /*                                                                     01250000
0DCL 1 HEADER             BASED (COMMPTR),                              01260000
 %INCLUDE EDQBSHS;; */                                                  01270000
                                                      /* SOC RB01320 */ 01280000
 /*DCL 1 DETAIL BASED(COMMPTR),                                         01290000
       %INCLUDE (EDQBSHS);,                                             01300000
       2 FILLER CHAR(30),                                               01310000
       %INCLUDE (EDQBSDS);;                                             01320000
 DCL 1 HEADER1 BASED(COMMPTR),                                          01330000
       %INCLUDE (EDQBSHS1);;                                            01340000
 DCL 1 DETAIL1 BASED(COMMPTR),                                          01350000
       %INCLUDE (EDQBSHS1);,                                            01360000
       %INCLUDE (EDQBSDS1);;                                            01370000
                                                                        01380000
 DCL 1 NEW_VERSION_DUMMY,                                               01390000
       %INCLUDE EDQBSHS1;,                                              01400000
       %INCLUDE EDQBSDS1;; */                                           01410000
                                                 /* EOC CEDS00000642 */ 01420000
0/*DCL 1 DETAIL             BASED (COMMPTR),  */   /* SOC RC01302 */    01430000
 /*%INCLUDE EDQBSDS;;                         */   /* EOC RC01302 */    01440000
                                                   /* EOC RB01320 */    01450000
0/********************************************************************/ 01460000
 /*  RETURN CODES                                                    */ 01470000
 /********************************************************************/ 01480000
0DCL RESPONSE            FIXED BIN(31);   /* CICS RESPONSE           */ 01490000
 DCL CODE_EXPLAIN        FIXED BIN(31);   /* RETURN CODE EXPLANATION */ 01500000
0/********************************************************************/ 01510000
 /*  RCBCQEM PARAMETER DECLARATIONS                                  */ 01520000
 /********************************************************************/ 01530000
0DCL RCBCQES_PTR     PTR;              /* PTR TO INTERFACE STRUCTURE */ 01540000
 DCL 1 RCBCQES,                                                         01550000
      %INCLUDE RCBCQES;;                                                01560000
 DCL 1 RCBCQES_SQLCA                                                    01570000
      LIKE SQLCA;                                                       01580000
0RCBCQES_PTR       = ADDR(RCBCQES);                                     01590000
0RCBCQES.SQLCA_PTR = ADDR(RCBCQES_SQLCA);                               01600000
0/********************************************************************/ 01610000
 /*            S Q L    D E C L A R A T I O N S                      */ 01620000
 /********************************************************************/ 01630000
0EXEC SQL                                                               01640000
      INCLUDE SQLCA;                                                    01650000
0/********************************************************************/ 01660000
 /* DB2 TABLE STRUCTURES                          SOC RC01302        */ 01670000
 /********************************************************************/ 01680000
 DCL 1 TB_RCBV050,                                                      01690000
      %INCLUDE (RCB050S);;                                              01700000
 DCL 1 TB_RCBV050_I,                                                    01710000
      %INCLUDE (RCB050SI);;                                             01720000
 DCL 1 TB_RCBV051,                                                      01730000
      %INCLUDE (RCB051S);;                                              01740000
 DCL 1 TB_RCBV051_I,                                                    01750000
      %INCLUDE (RCB051SI);;                                             01760000
 DCL 1 TB_RCBV110,                                                      01770000
      %INCLUDE (RCB110S);;                                              01780000
 DCL 1 TB_RCB1101_I,                                                    01790000
      %INCLUDE (RCB110SI);;                                             01800000
 DCL 1 TB_RCBV241,                                                      01810000
      %INCLUDE (RCB241S);;                                              01820000
 DCL 1 TB_RCBV241_I,                                                    01830000
      %INCLUDE (RCB241SI);;                                             01840000
 DCL 1 TB_RCBV125,                                    /* SOC RB01320 */ 01850000
      %INCLUDE (RCB125S);;                                              01860000
 DCL 1 TB_RCBV125_I,                                                    01870000
      %INCLUDE (RCB125SI);;                           /* EOC RB01320 */ 01880000
-/********************************************************************/ 01890000
 /*        WORK FIELDS                                               */ 01900000
 /********************************************************************/ 01910000
 DCL REQTYPE     CHAR(04)      INIT('');    /* REQUEST MACH. TYPE    */ 01920000
 DCL REQORIG     CHAR(02)      INIT('');    /* REQUEST ORIGIN        */ 01930000
 DCL REQSEQN     CHAR(07)      INIT('');    /* REQUEST SERIAL NBR.   */ 01940000
 DCL REQLSEQ     CHAR(30)      INIT('');    /* LONG SER. NBR.RB01320 */ 01950000
                                                      /* SOC RC01354 */ 01960000
 /*DCL REQLSEQ1    CHAR(02)      INIT('');          *//* SOC RC01344 */ 01970000
 /*DCL REQLSEQ2    CHAR(05)      INIT('');                              01980000
 DCL LSEQLEN     FIXED BIN(15) INIT(0);                                 01990000
 DCL REQLSEQ3    CHAR(07)      INIT('');                                02000000
 DCL REQLSEQ4    CHAR(07)      INIT('');            *//* EOC RC01354 */ 02010000
 DCL REQLSEQ5    CHAR(30)      INIT('');             /* CEDS00000727 */ 02020000
 /*DCL REQORIG1    CHAR(02)      INIT('');          *//* SOC RC01354 */ 02030000
 /*DCL REQSEQN1    CHAR(07)      INIT('');          *//* EOC RC01344 */ 02040000
                                                      /* EOC RC01354 */ 02050000
 DCL DUMMY_ORIGIN CHAR(02)     INIT('');         /* SOC CEDS00000704 */ 02060000
 DCL DUMMY_SEQUENCE CHAR(07)   INIT('');         /* EOC CEDS00000704 */ 02070000
 DCL REFCTRY     CHAR(03)      INIT('');    /* REQUEST COUNTRY CODE  */ 02080000
 DCL DATE10      CHAR(10)      INIT('');    /*YYYY-MM-DD DATE FORMAT */ 02090000
 DCL WRK_SQLCODE FIXED BIN(31) INIT(0);                                 02100000
 DCL WRK_TABLE   CHAR(18)      INIT('');                                02110000
 DCL WRK_INDNULL FIXED BIN(15);                       /* EOC RC01302 */ 02120000
                                                      /* SOC RB01320 */ 02130000
 DCL TRUE         BIT(1) INIT('1'B);                                    02140000
 DCL FALSE        BIT(1) INIT('0'B);                                    02150000
 DCL SWITCH_0211  BIT(1) INIT('0'B);                                    02160000
 DCL SWITCH_3317  BIT(1) INIT('0'B);                                    02170000
                                                      /* SOC RC01354 */ 02180000
 /*DCL SWITCH_LONGSER  BIT(1)   INIT('0'B);         *//* RC01344     */ 02190000
                                                      /* EOC RC01354 */ 02200000
 DCL WRK_LONG_SERIAL CHAR(30) INIT('');     /* LONG SERL FROM T0125  */ 02210000
                                                      /* EOC RB01320 */ 02220000
0/********************************************************************/ 02230000
 /*                 BUILT IN FUNCTIONS                               */ 02240000
 /********************************************************************/ 02250000
0DCL (LENGTH,                                                           02260000
      CSTG,                                                             02270000
      STRING,                                                           02280000
      SUBSTR,                                                           02290000
      NULL,                                                             02300000
      ADDR)                                                             02310000
              BUILTIN;                                                  02320000
1/********************************************************************/ 02330000
 /*                 S T A R T   P R O C E S S I N G                  */ 02340000
 /********************************************************************/ 02350000
0CALL RCBCS1M_INITIALISATION;                                           02360000
0CALL RCBCS1M_MAIN_PROCESSING;                                          02370000
0CALL RCBCS1M_FINALISATION;                                             02380000
1/********************************************************************/ 02390000
 /*      I N I T I A L I S A T I O N   P R O C E S S I N G           */ 02400000
 /********************************************************************/ 02410000
0RCBCS1M_INITIALISATION : PROC;                                         02420000
                                                      /* SOC RB01320 */ 02430000
 IF EIBCALEN = 150 | EIBCALEN = 750 | EIBCALEN = 5460                   02440000
    |EIBCALEN = 6060 THEN                                               02450000
   DO;                                               /* CEDS00000642 */ 02460000
     SWITCH_0211 = '1'B;                                                02470000
     HEADER = '';                                /* SOC CEDS00000642 */ 02480000
     HEADER = HEADER_OLD;                                               02490000
   END;                                          /* EOC CEDS00000642 */ 02500000
 IF EIBCALEN = 180 | EIBCALEN = 780 | EIBCALEN = 8190                   02510000
    |EIBCALEN = 8790 THEN                                               02520000
   DO;                                                                  02530000
     SWITCH_3317 = '1'B;                                                02540000
     HEADER = '';                                /* SOC CEDS00000642 */ 02550000
     HEADER.EDQBSHS    = HEADER_NEW.EDQBSHS1, BY NAME;                  02560000
     REQLSEQ           = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;               02570000
                                                      /* SOC RC01354 */ 02580000
                                                      /* SOC RC01344 */ 02590000
  /* IF REQLSEQ        ¬= ' ' THEN                                      02600000
     DO;                                                                02610000
     SWITCH_LONGSER    = '1'B;                                          02620000
     LSEQLEN           = LENGTH(TRIM(REQLSEQ))-6;                       02630000
     REQLSEQ4          = SUBSTR(REQLSEQ, LSEQLEN, 7);                   02640000
     REQLSEQ1          = SUBSTR(REQLSEQ4,1,2);                          02650000
     REQLSEQ2          = SUBSTR(REQLSEQ4,3,5);                          02660000
     REQLSEQ3          = '00' || REQLSEQ2;                              02670000
     END;                                                               02680000
                                                    *//* EOC RC01344 */ 02690000
                                                      /* EOC RC01354 */ 02700000
  /* NEW_VERSION_DUMMY = DETAIL1;                                       02710000
     DETAIL1 = ' ';                                                     02720000
     HEADER.EDQBSHS    = NEW_VERSION_DUMMY.EDQBSHS1, BY NAME;           02730000
     REQLSEQ           = NEW_VERSION_DUMMY.EDQBSHS1.REQ.SEDQGSN;        02740000
     DETAIL.EDQBSDS    = NEW_VERSION_DUMMY.EDQBSDS1, BY NAME; */        02750000
                                                 /* EOC CEDS00000642 */ 02760000
   END;                                                                 02770000
                                                      /* EOC RB01320 */ 02780000
                                                                        02790000
 SELECT (EIBCALEN);                      /* CHECK LENGTH OF COMMAREA */ 02800000
    WHEN(0)                              /* COMMAREA EMPTY           */ 02810000
    DO;                                                                 02820000
 /*    EDQBSHS.CRMORET = '4';            */           /* SOC RB01320 */ 02830000
       HEADER.EDQBSHS.CRMORET = '4';                  /* EOC RB01320 */ 02840000
       RCBCQES.MESSAGE_NUMBER = 'C201';                                 02850000
       CALL RCBCS1M_LOG_ERROR;                                          02860000
    END;                                                                02870000
                                                      /* SOC RB01320 */ 02880000
 /* WHEN(150)                      */    /* HEADER RECORD            */ 02890000
    WHEN(150, 180)                       /* HEADER RECORD            */ 02900000
                                                      /* EOC RB01320 */ 02910000
    DO;                                                                 02920000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'LI' &     */           /* SOC RB01320 */ 02930000
 /*       EDQBSHS.REQ.TYPE ¬= 'DE' THEN                              */ 02940000
                                                                        02950000
       IF HEADER.EDQBSHS.REQ.TYPE ¬= 'LI' &                             02960000
          HEADER.EDQBSHS.REQ.TYPE ¬= 'DE' &                             02970000
          HEADER.EDQBSHS.REQ.TYPE ¬= 'DL' THEN       /* EOC RB01320 */  02980000
       DO;                                                              02990000
 /*       EDQBSHS.CRMORET = '4';         */           /* SOC RB01320 */ 03000000
          HEADER.EDQBSHS.CRMORET = '4';               /* EOC RB01320 */ 03010000
          RCBCQES.MESSAGE_NUMBER = 'C203';                              03020000
          CALL RCBCS1M_LOG_ERROR;                                       03030000
       END;                                                             03040000
    END;                                                                03050000
                                                      /* SOC RB01320 */ 03060000
 /* WHEN(750)                   */       /* HEADER & DETAIL ITEM     */ 03070000
    WHEN(750, 780)                       /* HEADER & DETAIL ITEM     */ 03080000
                                                      /* EOC RB01320 */ 03090000
    DO;                                                                 03100000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'DE' THEN       */      /* SOC RB01320 */ 03110000
       IF HEADER.EDQBSHS.REQ.TYPE ¬= 'DE'                               03120000
        & HEADER.EDQBSHS.REQ.TYPE ¬= 'DL' THEN   /* SOC CEDS00000642 */ 03130000
 /*     | HEADER.EDQBSHS.REQ.TYPE ¬= 'DL' THEN   */   /* EOC RB01320 */ 03140000
                                                 /* EOC CEDS00000642 */ 03150000
       DO;                                                              03160000
 /*       EDQBSHS.CRMORET = '4';              */    /* SOC RB01320 */   03170000
          HEADER.EDQBSHS.CRMORET = '4';             /* EOC RB01320 */   03180000
          RCBCQES.MESSAGE_NUMBER = 'C203';                              03190000
          CALL RCBCS1M_LOG_ERROR;                                       03200000
       END;                                                             03210000
    END;                                                                03220000
                                                      /* SOC RB01320 */ 03230000
 /* WHEN(5460)                    */     /* HEADER & LIST ITEMS      */ 03240000
    WHEN(5460, 8190)                     /* HEADER & LIST ITEMS      */ 03250000
                                                      /* EOC RB01320 */ 03260000
    DO;                                                                 03270000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'LI' THEN        */     /* SOC RB01320 */ 03280000
       IF HEADER.EDQBSHS.REQ.TYPE ¬= 'LI'                               03290000
        & HEADER.EDQBSHS.REQ.TYPE ¬= 'DL' THEN   /* SOC CEDS00000642 */ 03300000
 /*     | HEADER.EDQBSHS.REQ.TYPE ¬= 'DL' THEN   */   /* EOC RB01320 */ 03310000
                                                 /* EOC CEDS00000642 */ 03320000
       DO;                                                              03330000
 /*       EDQBSHS.CRMORET = '4';               */     /* SOC RB01320 */ 03340000
          HEADER.EDQBSHS.CRMORET = '4';               /* EOC RB01320 */ 03350000
          RCBCQES.MESSAGE_NUMBER = 'C203';                              03360000
          CALL RCBCS1M_LOG_ERROR;                                       03370000
       END;                                                             03380000
    END;                                                                03390000
                                                      /* SOC RB01320 */ 03400000
    WHEN(6060, 8790)                   /* HEADER,LIST & DETAIL ITEMS */ 03410000
    DO;                                                                 03420000
       IF HEADER.EDQBSHS.REQ.TYPE ¬= 'DL' THEN                          03430000
       DO;                                                              03440000
          HEADER.EDQBSHS.CRMORET = '4';                                 03450000
          RCBCQES.MESSAGE_NUMBER = 'C203'; /* NEW MESSAGE NUMBER */     03460000
          CALL RCBCS1M_LOG_ERROR;                                       03470000
       END;                                                             03480000
    END;                                                                03490000
                                                      /* EOC RB01320 */ 03500000
    OTHERWISE                            /* INVALID COMMAREA LENGTH  */ 03510000
    DO;                                                                 03520000
 /*    EDQBSHS.CRMORET = '4';              */         /* SOC RB01320 */ 03530000
       HEADER.EDQBSHS.CRMORET = '4';                  /* EOC RB01320 */ 03540000
       RCBCQES.MESSAGE_NUMBER = 'C202';                                 03550000
       CALL RCBCS1M_LOG_ERROR;                                          03560000
    END;                                                                03570000
 END;                                                                   03580000
0END RCBCS1M_INITIALISATION;                                            03590000
1/********************************************************************/ 03600000
 /*      M A I N   P R O C E S S I N G                               */ 03610000
 /********************************************************************/ 03620000
0RCBCS1M_MAIN_PROCESSING : PROC;                                        03630000
 /*IF EDQBSHS.SEARCH  = '' |       */                /* SOC RB01320 */  03640000
 /* EDQBSHS.IOLCPLM = '' |         */   /* CHECK MANDATORY FIELDS   */  03650000
 /* EDQBSHS.IHSINBR = '' |         */   /* FILLED BY ACM            */  03660000
 /* EDQBSHS.TARGCTY = '' |         */                                   03670000
 /* EDQBSHS.DFLTREF = '' THEN      */                                   03680000
 /*DO;                             */                                   03690000
0IF HEADER.EDQBSHS.SEARCH  = '' |                                       03700000
    HEADER.EDQBSHS.IOLCPLM = '' |   /* CHECK MANDATORY FIELDS   */      03710000
    HEADER.EDQBSHS.IHSINBR = '' |   /* FILLED BY ACM            */      03720000
    HEADER.EDQBSHS.TARGCTY = '' |                                       03730000
    HEADER.EDQBSHS.DFLTREF = '' THEN                                    03740000
 DO;                                                                    03750000
 /* EDQBSHS.CRMORET = '4';                                           */ 03760000
    HEADER.EDQBSHS.CRMORET = '4';                     /* EOC RB01320 */ 03770000
    RCBCQES.MESSAGE_NUMBER = 'C239';                                    03780000
    CALL RCBCS1M_LOG_ERROR;                                             03790000
 END;                                                                   03800000
                                                                        03810000
 /* SELECT (EDQBSHS.REQ.TYPE);     */                 /* SOC RB01320 */ 03820000
 SELECT (HEADER.EDQBSHS.REQ.TYPE);                    /* EOC RB01320 */ 03830000
   WHEN ('LI')                            /* ITEM LIST                */03840000
                                                       /* SOC RB01320 */03850000
   /* CODE FOR LIST PROCESSING HAS BEEN MOVED TO THE PROC             */03860000
   /* RCBCS1M_PROCESS_LI AS PART OF CEDS 3.3 A17 RELEASE              */03870000
   /*  WITH CHANGE IN HEADER STRUCTURE & EXEC CICS LINK               */03880000
   /*SELECT(EDQBSHS.REQ.SEARCH); */                                     03890000
   /*  WHEN ('SC')               */       /* SINGLE COUNTRY REQUEST   */03900000
   /*    DO;                                                            03910000
           IF EDQBSHS.REQ.REQKEY.IOPUCTY = '' THEN                      03920000
             DO;                                                        03930000
               EDQBSHS.CRMORET = '4';                                   03940000
               RCBCQES.MESSAGE_NUMBER = 'C239';                         03950000
               CALL RCBCS1M_LOG_ERROR;                                  03960000
             END;                                                       03970000
           EXEC CICS LINK                                               03980000
                PROGRAM('RCBCS2P')                                      03990000
                COMMAREA(HEADER)                                        04000000
                LENGTH(CSTG(HEADER))                                    04010000
                RESP(RESPONSE)                                          04020000
                RESP2(CODE_EXPLAIN);                                    04030000
         END;                                                           04040000
       WHEN ('MC')                                                      04050000
         DO;                                                            04060000
           IF EDQBSHS.REQ.REQKEY.IOPUCTY ¬= '' THEN                     04070000
             EDQBSHS.REQ.REQKEY.IOPUCTY = '';                           04080000
           EXEC CICS LINK                                               04090000
                PROGRAM('RCBCS2P')                                      04100000
                COMMAREA(HEADER)                                        04110000
                LENGTH(CSTG(HEADER))                                    04120000
                RESP(RESPONSE)                                          04130000
                RESP2(CODE_EXPLAIN);                                    04140000
         END;                                                           04150000
       OTHERWISE                 */       /* INVALID REQUEST          */04160000
       /*DO;                                                            04170000
           EDQBSHS.CRMORET = '4';                                       04180000
           RCBCQES.MESSAGE_NUMBER = 'C204';                             04190000
           CALL RCBCS1M_LOG_ERROR;                                      04200000
         END;                                                           04210000
     END;                                                            */ 04220000
     CALL RCBCS1M_PROCESS_LI;                                           04230000
                                                                        04240000
   /* CODE FOR DETAIL PROCESSING HAS BEEN MOVED TO THE PROC           */04250000
   /* RCBCS1M_PROCESS_DE AS PART OF CEDS 3.3 A17 RELEASE              */04260000
   /*  WITH CHANGE IN HEADER STRUCTURE & EXEC CICS LINK               */04270000
 /*WHEN ('DE')                */          /* DETAIL                   */04280000
 /*  DO;                                                                04290000
       IF EDQBSHS.REQ.REQKEY.CSLMTYP = '' THEN                          04300000
         DO;                                                            04310000
           EDQBSHS.CRMORET = '4';                                       04320000
           RCBCQES.MESSAGE_NUMBER = 'C239';                             04330000
           CALL RCBCS1M_LOG_ERROR;                                      04340000
         END;                                                           04350000
     SELECT(EDQBSHS.REQ.SEARCH);                                        04360000
       WHEN ('SC','MC')       */          /* SINGLE COUNTRY REQUEST   */04370000
 /*      DO;                                                            04380000
           IF EDQBSHS.REQ.REQKEY.IOPUCTY = '' THEN                      04390000
             DO;                                                        04400000
               EDQBSHS.CRMORET = '4';                                   04410000
               RCBCQES.MESSAGE_NUMBER = 'C239';                         04420000
               CALL RCBCS1M_LOG_ERROR;                                  04430000
             END;                                         EOC RB01320 */04440000
  /*       SELECT (EDQBSHS.REQ.REQKEY.SSRCIND);           SOC RC01302 */04450000
  /*         WHEN ('C', ' ', 'E')         /* BAU DATA REQUESTED       */04460000
  /*           EXEC CICS LINK                                         */04470000
  /*                PROGRAM('RCBCS3P')                                */04480000
  /*                COMMAREA(HEADER)                                  */04490000
  /*                LENGTH(CSTG(HEADER))                              */04500000
  /*                RESP(RESPONSE)                                    */04510000
  /*                RESP2(CODE_EXPLAIN);                              */04520000
  /*                                                  /* SOC  RB01272 */04530000
  /*         WHEN ('G','I','N','S','P','R','Y','Z')   /* PI DATA      */04540000
  /*                                                  /* EOC  RB01272 */04550000
  /*           EXEC CICS LINK                                         */04560000
  /*                PROGRAM('RCBCS4P')                                */04570000
  /*                COMMAREA(HEADER)                                  */04580000
  /*                LENGTH(CSTG(HEADER))                              */04590000
  /*                RESP(RESPONSE)                                    */04600000
  /*                RESP2(CODE_EXPLAIN);                              */04610000
  /*         WHEN ('X', 'O', 'L')         /* UNKNOWN DATA REQUESTED   */04620000
  /*           EXEC CICS LINK                                         */04630000
  /*                PROGRAM('RCBCS5P')                                */04640000
  /*                COMMAREA(HEADER)                                  */04650000
  /*                LENGTH(CSTG(HEADER))                              */04660000
  /*                RESP(RESPONSE)                                    */04670000
  /*                RESP2(CODE_EXPLAIN);                              */04680000
  /*         OTHERWISE                    /* INVALID REQUEST          */04690000
  /*           DO;                                                    */04700000
  /*             EDQBSHS.CRMORET = '4';                               */04710000
  /*             RCBCQES.MESSAGE_NUMBER = 'C205';                     */04720000
  /*             CALL RCBCS1M_LOG_ERROR;                              */04730000
  /*           END;                                                   */04740000
  /*         END;                                                     */04750000
  /*       EXEC CICS LINK                 */          /* SOC RB01320  */04760000
  /*            PROGRAM('RCBCS3P')                                      04770000
                COMMAREA(HEADER)                                        04780000
                LENGTH(CSTG(HEADER))                                    04790000
                RESP(RESPONSE)                                          04800000
                RESP2(CODE_EXPLAIN);                                    04810000
                                                                        04820000
           IF EDQBSHS.CRMORET = '9' & EDQBSHS.REQ.SEARCH = 'MC' THEN    04830000
             DO;                                                        04840000
               REFCTRY = EDQBSHS.REQ.REQKEY.IOPUCTY;                    04850000
               ACMCTRY = EDQBSHS.REQ.TARGCTY;                           04860000
               REQTYPE = EDQBSHS.REQ.REQKEY.CSLMTYP;                    04870000
               REQORIG = EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;            04880000
               REQSEQN = EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;            04890000
               DATE10  = $DTSEP(EDQBSHS.REQ.DFLTREF,'-');               04900000
                                                                        04910000
               EDQBSHS.REQ.CRMOSUB = 0;                              */ 04920000
                                         /* CROSS COUNTRY SEARCH */     04930000
 /*            CALL RCBCS1M_READ_PI_CTR;                                04940000
               IF EDQBSHS.CRMORET = '9' THEN                            04950000
                 DO;                                                    04960000
                   CALL RCBCS1M_READ_PI_HW_PR;                          04970000
                   IF EDQBSHS.CRMORET = '9' THEN                        04980000
                     CALL RCBCS1M_READ_HW_PR;                           04990000
                 END;                                                   05000000
             END;                    */               /* EOC RC01302 */ 05010000
 /*      END;                                                           05020000
       OTHERWISE                     */   /* INVALID REQUEST          */05030000
 /*      DO;                                                            05040000
           EDQBSHS.CRMORET = '4';                                       05050000
           RCBCQES.MESSAGE_NUMBER = 'C204';                             05060000
           CALL RCBCS1M_LOG_ERROR;                                      05070000
         END;                                                           05080000
     END;                                                               05090000
     END;                                                             */05100000
   WHEN ('DE','DL')                       /* DETAIL OR DETAIL-LIST    */05110000
     CALL RCBCS1M_PROCESS_DE;                                           05120000
                                          /* EOC RB01320              */05130000
   OTHERWISE                              /* INVALID REQUEST          */05140000
     DO;                                                                05150000
 /*    EDQBSHS.CRMORET = '4';                             SOC RB01320 */05160000
       HEADER.EDQBSHS.CRMORET = '4';                   /* EOC RB01320 */05170000
       RCBCQES.MESSAGE_NUMBER = 'C203';                                 05180000
       CALL RCBCS1M_LOG_ERROR;                                          05190000
     END;                                                               05200000
 END;                                                                   05210000
                                                                        05220000
                                                    /*  SOC RB01291 */  05230000
 /* IF EDQBSHS.CRMORET = '9'              /*     SOC RB01272          */05240000
 /* & SUBSTR(EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM,1,1) = 'L'              05250000
 /* THEN                                                                05260000
 /*     EXEC CICS LINK                                                  05270000
 /*          PROGRAM('RCBCS6P')                                         05280000
 /*          COMMAREA(HEADER)                                           05290000
 /*          LENGTH(CSTG(HEADER))                                       05300000
 /*          RESP(RESPONSE)                                             05310000
 /*          RESP2(CODE_EXPLAIN);         /*      EOC RB01272         */05320000
                                                    /*  EOC RB01291   */05330000
                                                                        05340000
0END RCBCS1M_MAIN_PROCESSING;                                           05350000
                                                                        05360000
1/*********************************************************************/05370000
 /*                                                  RB01320          */05380000
 /* MODULE NAME      : RCBCS1M_PROCESS_LI                             */05390000
 /*                                                                   */05400000
 /* DESCRIPTION      : PROCESS WHEN THE SEARCH TYPE IS LIST           */05410000
 /*                                                                   */05420000
 /*********************************************************************/05430000
0RCBCS1M_PROCESS_LI: PROC;                                              05440000
                                                                        05450000
     SELECT(HEADER.EDQBSHS.REQ.SEARCH);                                 05460000
       WHEN ('SC')                        /* SINGLE COUNTRY REQUEST   */05470000
         DO;                                                            05480000
           IF HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY = '' THEN               05490000
             DO;                                                        05500000
               HEADER.EDQBSHS.CRMORET = '4';                            05510000
               RCBCQES.MESSAGE_NUMBER = 'C239';                         05520000
               CALL RCBCS1M_LOG_ERROR;                                  05530000
             END;                                                       05540000
           CALL RCBCS1M_CALL_S2M;                                       05550000
         END;                                                           05560000
       WHEN ('MC')                                                      05570000
         DO;                                                            05580000
           IF HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY ¬= '' THEN              05590000
              HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY  = '';                  05600000
           CALL RCBCS1M_CALL_S2M;                                       05610000
         END;                                                           05620000
       OTHERWISE                          /* INVALID REQUEST          */05630000
         DO;                                                            05640000
           HEADER.EDQBSHS.CRMORET = '4';                                05650000
           RCBCQES.MESSAGE_NUMBER = 'C204';                             05660000
           CALL RCBCS1M_LOG_ERROR;                                      05670000
         END;                                                           05680000
     END;                                                               05690000
                                                      /* SOC RC01354 */ 05700000
                                                      /* SOC RC01344 */ 05710000
  /* IF HEADER.EDQBSHS.CRMORET = '9' &                                  05720000
                   SWITCH_3317 = TRUE &                                 05730000
                   SWITCH_LONGSER = TRUE THEN                           05740000
     DO;                                                                05750000
        REQORIG1 = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;           05760000
        REQSEQN1 = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;           05770000
        HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM = REQLSEQ1;           05780000
        HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR = REQLSEQ3;           05790000
        HEADER.EDQBSHS.REQ.CRMOSUB = 0;                                 05800000
        CALL RCBCS1M_CALL_S2M;                                          05810000
        HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM = REQORIG1;           05820000
        HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR = REQSEQN1;           05830000
     END;                                                               05840000
                                                    *//* EOC RC01344 */ 05850000
                                                      /* EOC RC01354 */ 05860000
 END RCBCS1M_PROCESS_LI;                                                05870000
                                                                        05880000
1/*********************************************************************/05890000
 /*                                                  RB01320          */05900000
 /* MODULE NAME      : RCBCS1M_PROCESS_DE                             */05910000
 /*                                                                   */05920000
 /* DESCRIPTION      : PROCESS WHEN THE SEARCH TYPE IS DETAIL         */05930000
 /*                                                                   */05940000
 /*                                                                   */05950000
 /*********************************************************************/05960000
0RCBCS1M_PROCESS_DE: PROC;                                              05970000
                                                                        05980000
       IF HEADER.EDQBSHS.REQ.REQKEY.CSLMTYP = '' THEN                   05990000
         DO;                                                            06000000
           HEADER.EDQBSHS.CRMORET = '4';                                06010000
           RCBCQES.MESSAGE_NUMBER = 'C239';                             06020000
           CALL RCBCS1M_LOG_ERROR;                                      06030000
         END;                                                           06040000
     SELECT(HEADER.EDQBSHS.REQ.SEARCH);                                 06050000
       WHEN ('SC','MC')                   /* SINGLE COUNTRY REQUEST   */06060000
         DO;                                                            06070000
           IF HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY = '' THEN               06080000
             DO;                                                        06090000
               HEADER.EDQBSHS.CRMORET = '4';                            06100000
               RCBCQES.MESSAGE_NUMBER = 'C239';                         06110000
               CALL RCBCS1M_LOG_ERROR;                                  06120000
             END;                                                       06130000
           CALL RCBCS1M_CALL_S3M;                                       06140000
                                                 /* SOC CEDS00000727 */ 06150000
                                                 /* SOC CEDS00000734 */ 06160000
   /*      IF HEADER.EDQBSHS.CRMORET = '9' THEN                      */ 06170000
   /*      IF HEADER.EDQBSHS.CRMORET = '9' &          /* SOC RC01367 */ 06180005
   /*         SWITCH_3317 = TRUE    THEN                                06190003
                                                 /* EOC CEDS00000734 */ 06200000
   /*        DO;                                                        06210002
               REQLSEQ5 = '';                                           06220000
               REQLSEQ  = '';                                           06230000
               REQLSEQ5 = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              06240000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = '';                    06250000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          06260000
               CALL RCBCS1M_CALL_S3M;                                   06270000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = REQLSEQ5;              06280000
               REQLSEQ  = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              06290000
             END;                                   *//* EOC RC01367 */ 06300005
                                                 /* EOC CEDS00000727 */ 06310000
                              /* STARTING OF RC01302 COMMENTED ABOVE */ 06320000
                                                      /* SOC RC01354 */ 06330000
                                                      /* SOC RC01344 */ 06340000
  /*       IF HEADER.EDQBSHS.CRMORET = '9' THEN                         06350000
             DO;                                                        06360000
               REQORIG1 = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;    06370000
               REQSEQN1 = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;    06380000
                                               *//* SOC CEDS00000727 */ 06390000
  /*           REQLSEQ5 = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              06400000
                                               *//* EOC CEDS00000727 */ 06410000
  /*           HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM = REQLSEQ1;    06420000
               HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR = REQLSEQ3;    06430000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          06440000
                                               *//* SOC CEDS00000727 */ 06450000
  /*           REQLSEQ='';                                              06460000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = '';                    06470000
                                               *//* EOC CEDS00000727 */ 06480000
  /*           CALL RCBCS1M_CALL_S3M;                                   06490000
               HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM=REQORIG1;      06500000
               HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR=REQSEQN1;      06510000
                                               *//* SOC CEDS00000727 */ 06520000
  /*           HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = REQLSEQ5;              06530000
               REQLSEQ  = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              06540000
                                               *//* EOC CEDS00000727 */ 06550000
  /*           END;                                 *//* CEDS00000703*/ 06560000
                                                      /* EOC RC01344 */ 06570000
                                                      /* EOC RC01354 */ 06580000
           IF HEADER.EDQBSHS.CRMORET = '9' &                            06590000
                   HEADER.EDQBSHS.REQ.SEARCH = 'MC' THEN                06600000
             DO;                                                        06610000
                                                 /* SOC CEDS00000747 */ 06620000
               REFCTRY = HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY;             06630000
               ACMCTRY = HEADER.EDQBSHS.REQ.TARGCTY;                    06640000
               REQTYPE = HEADER.EDQBSHS.REQ.REQKEY.CSLMTYP;             06650000
               REQORIG = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;     06660000
               REQSEQN = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;     06670000
               DATE10  = $DTSEP(HEADER.EDQBSHS.REQ.DFLTREF,'-');        06680000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          06690000
                                                 /* EOC CEDS00000747 */ 06700000
                                                 /* SOC CEDS00000734 */ 06710000
          /*   IF SWITCH_3317 = TRUE THEN        /* SOC CEDS00000760 */ 06720000
          /*      DO;                            /* EOC CEDS00000760 */ 06730000
          /*   REFCTRY = HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY;             06740000
               ACMCTRY = HEADER.EDQBSHS.REQ.TARGCTY;                    06750000
               REQTYPE = HEADER.EDQBSHS.REQ.REQKEY.CSLMTYP;             06760000
               REQORIG = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;     06770000
               REQSEQN = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;     06780000
               DATE10  = $DTSEP(HEADER.EDQBSHS.REQ.DFLTREF,'-');        06790000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          06800000
               CALL RCBCS1M_SELECT_T125;                                06810000
               CALL RCBCS1M_SELECT_T125_DUMMY;    */  /*CEDS00000704 */ 06820000
                                                 /* SOC CEDS00000747 */ 06830000
               /*   REFCTRY = HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY;        06840000
                    ACMCTRY = HEADER.EDQBSHS.REQ.TARGCTY;               06850000
                    REQTYPE = HEADER.EDQBSHS.REQ.REQKEY.CSLMTYP;        06860000
                    REQORIG = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;06870000
                    REQSEQN = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;06880000
                    DATE10  = $DTSEP(HEADER.EDQBSHS.REQ.DFLTREF,'-');   06890000
                    HEADER.EDQBSHS.REQ.CRMOSUB = 0;*/                   06900000
                                                 /* EOC CEDS00000747 */ 06910000
                    CALL RCBCS1M_SELECT_T125;                           06920000
                    CALL RCBCS1M_SELECT_T125_DUMMY;                     06930000
          /*      END;                               /* CEDS00000760 */ 06940000
                                                 /* EOC CEDS00000734 */ 06950000
                                             /* CROSS COUNTRY SEARCH */ 06960000
               CALL RCBCS1M_READ_PI_CTR;                                06970000
               IF HEADER.EDQBSHS.CRMORET = '9' THEN                     06980000
                 DO;                                                    06990000
                   CALL RCBCS1M_READ_PI_HW_PR;                          07000000
                   IF HEADER.EDQBSHS.CRMORET = '9' THEN                 07010000
                     CALL RCBCS1M_READ_HW_PR;                           07020000
                 END;                                                   07030000
             END;                                     /* EOC RC01302 */ 07040000
                                                      /* SOC RC01354 */ 07050000
                                                      /* SOC RC01344 */ 07060000
  /*         IF HEADER.EDQBSHS.CRMORET = '9' &                          07070000
                HEADER.EDQBSHS.REQ.SEARCH = 'MC' &                      07080000
                        SWITCH_3317 = TRUE &                            07090000
                        SWITCH_LONGSER = TRUE THEN                      07100000
             DO;                                                        07110000
               REQORIG1 = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;    07120000
               REQSEQN1 = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;    07130000
                                               *//* SOC CEDS00000727 */ 07140000
  /*           REQLSEQ5 = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              07150000
               REQLSEQ  = '';                                           07160000
                                               *//* EOC CEDS00000727 */ 07170000
  /*           HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM = REQLSEQ1;    07180000
               HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR = REQLSEQ3;    07190000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          07200000
               REQORIG = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;     07210000
               REQSEQN = HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;     07220000
               CALL RCBCS1M_SELECT_T125;                                07230000
               CALL RCBCS1M_READ_PI_CTR;                                07240000
                IF HEADER.EDQBSHS.CRMORET = '9' THEN                    07250000
                DO;                                                     07260000
                   CALL RCBCS1M_READ_PI_HW_PR;                          07270000
                   IF HEADER.EDQBSHS.CRMORET = '9' THEN                 07280000
                      CALL RCBCS1M_READ_HW_PR;                          07290000
                END;                                                    07300000
                HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM=REQORIG1;     07310000
                HEADER.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR=REQSEQN1;     07320000
                                               *//* SOC CEDS00000727 */ 07330000
  /*            HEADER_NEW.EDQBSHS1.REQ.SEDQGSN          =REQLSEQ5;     07340000
                REQLSEQ = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              07350000
                                               *//* EOC CEDS00000727 */ 07360000
  /*         END;                                                       07370000
                                                    *//* EOC RC01344 */ 07380000
                                                      /* EOC RC01354 */ 07390000
                                                      /* SOC RC01339 */ 07400000
           IF HEADER.EDQBSHS.REQ.TYPE = 'DL' &                          07410000
              HEADER.EDQBSHS.CRMORET  = '0' THEN                        07420000
  /*           HEADER.EDQBSHS.CRMOSUB  = '1';     /*SOC CEDS00000734 */ 07430000
               HEADER.EDQBSHS.CRMOSUB  =  1;      /*EOC CEDS00000734 */ 07440000
                                                      /* EOC RC01339 */ 07450000
           IF HEADER.EDQBSHS.CRMORET = '9' &                            07460000
                          HEADER.EDQBSHS.REQ.TYPE = 'DL' THEN           07470000
            DO;                                           /* RC01339 */ 07480000
               CALL RCBCS1M_PROCESS_LI;                                 07490000
               IF HEADER.EDQBSHS.CRMORET = '0' THEN   /* SOC RC01339 */ 07500000
  /*              HEADER.EDQBSHS.CRMOSUB = '0';   /*SOC CEDS00000734 */ 07510000
                  HEADER.EDQBSHS.CRMOSUB =  0 ;   /*EOC CEDS00000734 */ 07520000
            END;                                      /* EOC RC01339 */ 07530000
         END;                                                           07540000
                                                      /* CEDS00000703*/ 07550000
     /*  END;  */                                     /*     RC01344 */ 07560000
                                                      /* CEDS00000703*/ 07570000
       OTHERWISE                          /* INVALID REQUEST          */07580000
         DO;                                                            07590000
           HEADER.EDQBSHS.CRMORET = '4';                                07600000
           RCBCQES.MESSAGE_NUMBER = 'C204';                             07610000
           CALL RCBCS1M_LOG_ERROR;                                      07620000
         END;                                                           07630000
     END;                                                               07640000
 END RCBCS1M_PROCESS_DE;                                                07650000
                                                                        07660000
1/*********************************************************************/07670000
 /*                                                  RC01302          */07680000
 /* MODULE NAME      : RCBCS1M_READ_PI_CTR                            */07690000
 /*                                                                   */07700000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0241    */07710000
 /*                                                                   */07720000
 /*                                                                   */07730000
 /*********************************************************************/07740000
0RCBCS1M_READ_PI_CTR: PROC;                                             07750000
                                                      /* SOC RB01312 */ 07760000
 /*                                                                     07770000
 EXEC SQL                                                               07780000
      DECLARE CURSOR_PI_CTR CURSOR FOR                                  07790000
      SELECT PRODUCT_TYPE      ,                                        07800000
             ORIGIN            ,                                        07810000
             SEQUENCE_NUMBER   ,                                        07820000
             COUNTRY_NUMBER                                             07830000
       FROM  RCBV0241_PI_CTR                                            07840000
      WHERE  PRODUCT_TYPE    = :REQTYPE                                 07850000
        AND  ORIGIN          = :REQORIG                                 07860000
        AND  SEQUENCE_NUMBER = :REQSEQN                                 07870000
        AND  :DATE10   BETWEEN EFFECTIVE_DATE                           07880000
                           AND END_DATE                                 07890000
   ORDER BY COUNTRY_NUMBER                                              07900000
   FOR FETCH ONLY;                                                   */ 07910000
 /*                                                                     07920000
 EXEC SQL                              /* INIT CURSOR CURSOR_PI_CTR  */ 07930000
 /*   OPEN CURSOR_PI_CTR;                                               07940000
                                                                        07950000
 SELECT(SQLCA.SQLCODE);                                                 07960000
   WHEN (0);                                                            07970000
   OTHERWISE                                                            07980000
     DO;                                                                07990000
       RCBCQES.MESSAGE_NUMBER = 'C249';                                 08000000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     08010000
       WRK_TABLE = 'RCBT0241_PI_CTR1';                                  08020000
       CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                 08030000
     END;                                                               08040000
 END;                                                                   08050000
                                                                        08060000
 EXEC SQL                                                               08070000
      FETCH CURSOR_PI_CTR                                               08080000
       INTO :TB_RCBV241.PRODUCT_TYPE    :WRK_INDNULL                    08090000
           ,:TB_RCBV241.ORIGIN          :WRK_INDNULL                    08100000
           ,:TB_RCBV241.SEQUENCE_NUMBER :WRK_INDNULL                    08110000
           ,:TB_RCBV241.COUNTRY_NUMBER  :WRK_INDNULL;                   08120000
                                                                        08130000
 SELECT(SQLCA.SQLCODE);                                                 08140000
   WHEN(0)                                                              08150000
     DO;                                                                08160000
       EXEC SQL                                                         08170000
            CLOSE CURSOR_PI_CTR;                                        08180000
                                                                        08190000
       SELECT(SQLCA.SQLCODE);                                           08200000
         WHEN (0);                                                      08210000
         OTHERWISE                                                      08220000
           DO;                                                          08230000
             RCBCQES.MESSAGE_NUMBER = 'C251';                           08240000
             WRK_SQLCODE = SQLCA.SQLCODE;                               08250000
             WRK_TABLE = 'RCBT0241_PI_CTR2';                            08260000
             CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);           08270000
           END;                                                         08280000
       END;                                                             08290000
                                                                        08300000
       EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV241.COUNTRY_NUMBER;          08310000
                                                                        08320000
       EXEC CICS LINK                                                   08330000
            PROGRAM('RCBCS3P')                                          08340000
            COMMAREA(HEADER)                                            08350000
            LENGTH(CSTG(HEADER))                                        08360000
            RESP(RESPONSE)                                              08370000
            RESP2(CODE_EXPLAIN);                                        08380000
     END;                                                               08390000
   WHEN(100)                                                            08400000
     DO;                                                                08410000
       EXEC SQL                                                         08420000
            CLOSE CURSOR_PI_CTR;                                        08430000
                                                                        08440000
       SELECT(SQLCA.SQLCODE);                                           08450000
         WHEN (0);                                                      08460000
         OTHERWISE                                                      08470000
           DO;                                                          08480000
             RCBCQES.MESSAGE_NUMBER = 'C251';                           08490000
             WRK_SQLCODE = SQLCA.SQLCODE;                               08500000
             WRK_TABLE = 'RCBT0241_PI_CTR3';                            08510000
             CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);           08520000
           END;                                                         08530000
       END;                                                             08540000
     END;                                                               08550000
   OTHERWISE                                                            08560000
     DO;                                                                08570000
       RCBCQES.MESSAGE_NUMBER = 'C250';                                 08580000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     08590000
       WRK_TABLE = 'RCBT0241_PI_CTR4';                                  08600000
       CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                 08610000
     END;                                                               08620000
 END; */                                                                08630000
                                                                        08640000
 /*                                                      SOC RB01320 */ 08650000
 /*EXEC SQL                                                             08660000
    SELECT COUNTRY_NUMBER                                               08670000
    INTO : TB_RCBV241.COUNTRY_NUMBER  :WRK_INDNULL                      08680000
    FROM   RCBV0241_PI_CTR                                              08690000
    WHERE  PRODUCT_TYPE    = :REQTYPE                                   08700000
    AND    ORIGIN          = :REQORIG                                   08710000
    AND    SEQUENCE_NUMBER = :REQSEQN                                   08720000
    AND  :DATE10   BETWEEN EFFECTIVE_DATE                               08730000
                           AND END_DATE                                 08740000
    ORDER BY LAST_CHANGE_DATE DESC                                  */  08750000
   EXEC SQL                                                             08760000
    SELECT T241.COUNTRY_NUMBER                                          08770000
    INTO : TB_RCBV241.COUNTRY_NUMBER  :WRK_INDNULL                      08780000
                                                 /* SOC CEDS00000704 */ 08790000
    FROM   RCBV0241_PI_CTR  T241                                        08800000
 /* FROM   RCBV0241_PI_CTR  T241,RCBV0125_DMMY_REAL  T125 */            08810000
                                                 /* EOC CEDS00000704 */ 08820000
    WHERE  T241.PRODUCT_TYPE    = :REQTYPE                              08830000
    AND    (( T241.ORIGIN          = :REQORIG                           08840000
              AND T241.SEQUENCE_NUMBER = :REQSEQN)                      08850000
            OR ( T241.ORIGIN||T241.SEQUENCE_NUMBER = :REQLSEQ)          08860000
            OR ( T241.ORIGIN||T241.SEQUENCE_NUMBER = :WRK_LONG_SERIAL   08870000
                 )                               /* SOC CEDS00000704 */ 08880000
            OR ( T241.ORIGIN           = :DUMMY_ORIGIN                  08890000
                 AND  T241.SEQUENCE_NUMBER  = :DUMMY_SEQUENCE ))        08900000
  /*             AND T125.COUNTRY_NUMBER = T241.COUNTRY_NUMBER)         08910000
            OR ( T125.PRODUCT_TYPE = :REQTYPE                           08920000
                 AND T125.REAL_SERIAL_NUMBER = :REQLSEQ                 08930000
                 AND T125.COUNTRY_NUMBER = T241.COUNTRY_NUMBER          08940000
                 AND T125.PRODUCT_TYPE = T241.PRODUCT_TYPE              08950000
                 AND T125.DUMMY_ORIGIN = T241.ORIGIN                    08960000
                 AND T125.DUMMY_SEQUENCE_NUM = T241.SEQUENCE_NUMBER))   08970000
                                                 /* EOC CEDS00000704 */ 08980000
    AND  :DATE10   BETWEEN T241.EFFECTIVE_DATE                          08990000
                           AND T241.END_DATE                            09000000
    ORDER BY T241.LAST_CHANGE_DATE DESC                                 09010000
                                                      /* EOC RB01320 */ 09020000
    FETCH FIRST 1 ROW ONLY                                              09030000
   WITH UR;                                                             09040000
                                                                        09050000
 SELECT(SQLCA.SQLCODE);                                                 09060000
   WHEN(0)                                                              09070000
     DO;                                                                09080000
                                                                        09090000
                                                      /* SOC RB01320 */ 09100000
 /*    EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV241.COUNTRY_NUMBER;       */ 09110000
       HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV241.COUNTRY_NUMBER;   09120000
                                                                        09130000
 /*    EXEC CICS LINK                                                */ 09140000
 /*         PROGRAM('RCBCS3P')                                       */ 09150000
 /*         COMMAREA(HEADER)                                         */ 09160000
 /*         LENGTH(CSTG(HEADER))                                     */ 09170000
 /*         RESP(RESPONSE)                                           */ 09180000
 /*         RESP2(CODE_EXPLAIN);                                     */ 09190000
       CALL RCBCS1M_CALL_S3M;                                           09200000
                                                      /* EOC RB01320 */ 09210000
                                                 /* SOC CEDS00000727 */ 09220000
   /*      IF HEADER.EDQBSHS.CRMORET = '9' THEN * SOC CEDS00000761*/    09230000
           IF HEADER.EDQBSHS.CRMORET = '9' &                            09231000
              SWITCH_3317 = TRUE THEN          /* EOC CEDS00000761*/    09232000
             DO;                                                        09240000
               REQLSEQ5 = '';                                           09250000
               REQLSEQ  = '';                                           09260000
               REQLSEQ5 = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              09270000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = '';                    09280000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          09290000
               CALL RCBCS1M_CALL_S3M;                                   09300000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = REQLSEQ5;              09310000
               REQLSEQ  = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              09320000
             END;                                                       09330000
                                                 /* EOC CEDS00000727 */ 09340000
     END;                                                               09350000
   WHEN(100);                                                           09360000
   OTHERWISE                                                            09370000
     DO;                                                                09380000
       RCBCQES.MESSAGE_NUMBER = 'C250';                                 09390000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     09400000
       WRK_TABLE = 'RCBT0241_PI_CTR4';                                  09410000
       CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                 09420000
     END;                                                               09430000
 END;                                                  /* EOC RB01312 */09440000
                                                                        09450000
 END RCBCS1M_READ_PI_CTR;                                               09460000
1/*********************************************************************/09470000
 /*                                                  RC01302          */09480000
 /* MODULE NAME      : RCBCS1M_READ_PI_HW_PR                          */09490000
 /*                                                                   */09500000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0051    */09510000
 /*                                                                   */09520000
 /*                                                                   */09530000
 /*********************************************************************/09540000
0RCBCS1M_READ_PI_HW_PR: PROC;                                           09550000
                                                       /* SOC RB01312 */09560000
 /*EXEC SQL                                                             09570000
      DECLARE CURSOR_PI_HW CURSOR FOR                                   09580000
      SELECT PRODUCT_TYPE      ,                                        09590000
             ORIGIN            ,                                        09600000
             SEQUENCE_NUMBER   ,                                        09610000
             COUNTRY_NUMBER                                             09620000
       FROM  RCBV0051_PI_HW_PR                                          09630000
      WHERE  PRODUCT_TYPE    = :REQTYPE                                 09640000
        AND  ORIGIN          = :REQORIG                                 09650000
        AND  SEQUENCE_NUMBER = :REQSEQN                                 09660000
   ORDER BY COUNTRY_NUMBER                                              09670000
   FOR FETCH ONLY;                                                      09680000
                                                                        09690000
 EXEC SQL                              /* INIT CURSOR CURSOR_PI_HW   */ 09700000
 /*      OPEN CURSOR_PI_HW;                                             09710000
                                                                        09720000
  SELECT(SQLCA.SQLCODE);                                                09730000
   WHEN (0);                                                            09740000
   OTHERWISE                                                            09750000
     DO;                                                                09760000
       RCBCQES.MESSAGE_NUMBER = 'C252';                                 09770000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     09780000
       WRK_TABLE = 'RCBT0051_PI_HW_PR';                                 09790000
       CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                 09800000
     END;                                                               09810000
 END;                                                                   09820000
                                                                        09830000
 EXEC SQL                                                               09840000
      FETCH CURSOR_PI_HW                                                09850000
       INTO :TB_RCBV051.PRODUCT_TYPE    :WRK_INDNULL                    09860000
           ,:TB_RCBV051.ORIGIN          :WRK_INDNULL                    09870000
           ,:TB_RCBV051.SEQUENCE_NUMBER :WRK_INDNULL                    09880000
           ,:TB_RCBV051.COUNTRY_NUMBER  :WRK_INDNULL;                   09890000
                                                                        09900000
 SELECT(SQLCA.SQLCODE);                                                 09910000
   WHEN(0)                                                              09920000
     DO;                                                                09930000
       EXEC SQL                                                         09940000
            CLOSE CURSOR_PI_HW;                                         09950000
                                                                        09960000
       SELECT(SQLCA.SQLCODE);                                           09970000
         WHEN (0);                                                      09980000
         OTHERWISE                                                      09990000
           DO;                                                          10000000
             RCBCQES.MESSAGE_NUMBER = 'C254';                           10010000
             WRK_SQLCODE = SQLCA.SQLCODE;                               10020000
             WRK_TABLE = 'RCBT0051_PI_HW_PR2';                          10030000
             CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);           10040000
           END;                                                         10050000
       END;                                                             10060000
                                                                        10070000
       EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV051.COUNTRY_NUMBER;          10080000
                                                                        10090000
       EXEC CICS LINK                                                   10100000
            PROGRAM('RCBCS3P')                                          10110000
            COMMAREA(HEADER)                                            10120000
            LENGTH(CSTG(HEADER))                                        10130000
            RESP(RESPONSE)                                              10140000
            RESP2(CODE_EXPLAIN);                                        10150000
     END;                                                               10160000
   WHEN(100)                                                            10170000
     DO;                                                                10180000
       EXEC SQL                                                         10190000
            CLOSE CURSOR_PI_HW;                                         10200000
                                                                        10210000
       SELECT(SQLCA.SQLCODE);                                           10220000
         WHEN (0);                                                      10230000
         OTHERWISE                                                      10240000
           DO;                                                          10250000
             RCBCQES.MESSAGE_NUMBER = 'C254';                           10260000
             WRK_SQLCODE = SQLCA.SQLCODE;                               10270000
             WRK_TABLE = 'RCBT0051_PI_HW_PR3';                          10280000
             CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);           10290000
           END;                                                         10300000
       END;                                                             10310000
     END;                                                               10320000
   OTHERWISE                                                            10330000
     DO;                                                                10340000
       RCBCQES.MESSAGE_NUMBER = 'C253';                                 10350000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     10360000
       WRK_TABLE = 'RCBT0051_PI_HW_PR4';                                10370000
       CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                 10380000
     END;                                                               10390000
 END;  */                                                               10400000
                                                                        10410000
   EXEC SQL                                                             10420000
    SELECT T051.COUNTRY_NUMBER                                          10430000
    INTO :TB_RCBV051.COUNTRY_NUMBER  :WRK_INDNULL                       10440000
 /* FROM   RCBV0051_PI_HW_PR T051                         SOC RB01320 */10450000
                                                  /* SOC CEDS00000704 */10460000
    FROM   RCBV0051_PI_HW_PR T051                                       10470000
 /* FROM   RCBV0051_PI_HW_PR T051,RCBV0125_DMMY_REAL T125 */            10480000
                                                  /* EOC CEDS00000704 */10490000
 /*                                                       EOC RB01320 */10500000
    WHERE  T051.PRODUCT_TYPE    = :REQTYPE                              10510000
 /* AND    T051.ORIGIN          = :REQORIG                SOC RB01320 */10520000
 /* AND    T051.SEQUENCE_NUMBER = :REQSEQN                            */10530000
    AND    (( T051.ORIGIN          = :REQORIG                           10540000
              AND T051.SEQUENCE_NUMBER = :REQSEQN)                      10550000
            OR ( T051.ORIGIN||T051.SEQUENCE_NUMBER = :REQLSEQ)          10560000
            OR ( T051.ORIGIN||T051.SEQUENCE_NUMBER = :WRK_LONG_SERIAL   10570000
                         )                        /* SOC CEDS00000704 */10580000
            OR (      T051.ORIGIN           = :DUMMY_ORIGIN             10590000
                 AND  T051.SEQUENCE_NUMBER  = :DUMMY_SEQUENCE ))        10600000
 /*              AND T125.COUNTRY_NUMBER = T051.COUNTRY_NUMBER)         10610000
            OR ( T125.PRODUCT_TYPE = :REQTYPE                           10620000
                 AND T125.REAL_SERIAL_NUMBER = :REQLSEQ                 10630000
                 AND T125.COUNTRY_NUMBER = T051.COUNTRY_NUMBER          10640000
                 AND T125.PRODUCT_TYPE = T051.PRODUCT_TYPE              10650000
                 AND T125.DUMMY_ORIGIN = T051.ORIGIN                    10660000
                 AND T125.DUMMY_SEQUENCE_NUM = T051.SEQUENCE_NUMBER))   10670000
                                                  /* EOC CEDS00000704 */10680000
 /*                                                       EOC RB01320 */10690000
    ORDER BY T051.WARRANTY_EXP_DATE DESC                                10700000
            ,T051.LAST_CHANGE_DATE DESC                                 10710000
    FETCH FIRST 1 ROW ONLY                                              10720000
   WITH UR;                                                             10730000
                                                                        10740000
   SELECT(SQLCA.SQLCODE);                                               10750000
   WHEN(0)                                                              10760000
    DO;                                                                 10770000
 /*                                                       SOC RB01320 */10780000
 /*  EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV051.COUNTRY_NUMBER;          */10790000
     HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV051.COUNTRY_NUMBER;     10800000
                                                                        10810000
  /*   EXEC CICS LINK                                                */ 10820000
  /*        PROGRAM('RCBCS3P')                                       */ 10830000
  /*        COMMAREA(HEADER)                                         */ 10840000
  /*        LENGTH(CSTG(HEADER))                                     */ 10850000
  /*        RESP(RESPONSE)                                           */ 10860000
  /*        RESP2(CODE_EXPLAIN);                                     */ 10870000
       CALL RCBCS1M_CALL_S3M;                                           10880000
                                                      /* EOC RB01320 */ 10890000
                                                 /* SOC CEDS00000727 */ 10900000
       /*  IF HEADER.EDQBSHS.CRMORET = '9' THEN*//* SOC CEDS00000761 */ 10910000
           IF HEADER.EDQBSHS.CRMORET = '9' &                            10911000
              SWITCH_3317 = TRUE THEN            /* EOC CEDS00000761 */ 10912000
             DO;                                                        10920000
               REQLSEQ5 = '';                                           10930000
               REQLSEQ  = '';                                           10940000
               REQLSEQ5 = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              10950000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = '';                    10960000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          10970000
               CALL RCBCS1M_CALL_S3M;                                   10980000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = REQLSEQ5;              10990000
               REQLSEQ  = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              11000000
             END;                                                       11010000
                                                 /* EOC CEDS00000727 */ 11020000
   END;                                                                 11030000
   WHEN(100);                                                           11040000
   OTHERWISE                                                            11050000
    DO;                                                                 11060000
     RCBCQES.MESSAGE_NUMBER = 'C253';                                   11070000
     WRK_SQLCODE = SQLCA.SQLCODE;                                       11080000
     WRK_TABLE = 'RCBV0051_PI_HW_PR';                                   11090000
     CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                   11100000
    END;                                                                11110000
   END;                                                /* EOC RB01312 */11120000
                                                                        11130000
 END RCBCS1M_READ_PI_HW_PR;                                             11140000
1/*********************************************************************/11150000
 /*                                                RC01302            */11160000
 /* MODULE NAME      : RCBCS1M_READ_HW_PR                             */11170000
 /*                                                                   */11180000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0050    */11190000
 /*                                                                   */11200000
 /*                                                                   */11210000
 /*********************************************************************/11220000
0RCBCS1M_READ_HW_PR: PROC;                                              11230000
                                                       /* SOC RB01312 */11240000
 /*                                                                     11250000
 EXEC SQL                                                               11260000
      DECLARE CURSOR_HW CURSOR FOR                                      11270000
      SELECT T050.PRODUCT_TYPE      ,                                   11280000
             T050.ORIGIN            ,                                   11290000
             T050.SEQUENCE_NUMBER   ,                                   11300000
             T050.COUNTRY_NUMBER                                        11310000
       FROM  RCBV0050_HW_PR     T050                                    11320000
            ,RCBV0110_HW_STATUS T110                                    11330000
      WHERE  T050.PRODUCT_TYPE    = :REQTYPE                            11340000
        AND  T050.ORIGIN          = :REQORIG                            11350000
        AND  T050.SEQUENCE_NUMBER = :REQSEQN                            11360000
        AND  T110.PRODUCT_TYPE    = T050.PRODUCT_TYPE                   11370000
        AND  T110.ORIGIN          = T050.ORIGIN                         11380000
        AND  T110.SEQUENCE_NUMBER = T050.SEQUENCE_NUMBER                11390000
        AND  T110.COUNTRY_NUMBER  = T050.COUNTRY_NUMBER                 11400000
        AND  :DATE10        BETWEEN T110.EFFECTIVE_DATE                 11410000
                                AND T110.END_DATE                       11420000
   ORDER BY COUNTRY_NUMBER                                              11430000
   FOR FETCH ONLY;  */                                                  11440000
                                                                        11450000
  /* EXEC SQL                             /* INIT CURSOR CURSOR_PI_HW */11460000
  /*      OPEN CURSOR_HW;                                               11470000
                                                                        11480000
     SELECT(SQLCA.SQLCODE);                                             11490000
       WHEN (0);                                                        11500000
       OTHERWISE                                                        11510000
         DO;                                                            11520000
           RCBCQES.MESSAGE_NUMBER = 'C255';                             11530000
           WRK_SQLCODE = SQLCA.SQLCODE;                                 11540000
           WRK_TABLE = 'RCBT0050_HW_PR';                                11550000
           CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);             11560000
         END;                                                           11570000
     END;                                                               11580000
                                                                        11590000
     EXEC SQL                                                           11600000
          FETCH CURSOR_HW                                               11610000
           INTO :TB_RCBV050.PRODUCT_TYPE    :WRK_INDNULL                11620000
               ,:TB_RCBV050.ORIGIN          :WRK_INDNULL                11630000
               ,:TB_RCBV050.SEQUENCE_NUMBER :WRK_INDNULL                11640000
               ,:TB_RCBV050.COUNTRY_NUMBER  :WRK_INDNULL;               11650000
                                                                        11660000
     SELECT(SQLCA.SQLCODE);                                             11670000
       WHEN(0)                                                          11680000
         DO;                                                            11690000
           EXEC SQL                                                     11700000
                CLOSE CURSOR_HW;                                        11710000
                                                                        11720000
           SELECT(SQLCA.SQLCODE);                                       11730000
             WHEN (0);                                                  11740000
             OTHERWISE                                                  11750000
               DO;                                                      11760000
                 RCBCQES.MESSAGE_NUMBER = 'C257';                       11770000
                 WRK_SQLCODE = SQLCA.SQLCODE;                           11780000
                 WRK_TABLE = 'RCBT0050_HW_PR';                          11790000
                 CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);       11800000
               END;                                                     11810000
           END;                                                         11820000
                                                                        11830000
           EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV050.COUNTRY_NUMBER;      11840000
                                                                        11850000
           EXEC CICS LINK                                               11860000
                PROGRAM('RCBCS3P')                                      11870000
                COMMAREA(HEADER)                                        11880000
                LENGTH(CSTG(HEADER))                                    11890000
                RESP(RESPONSE)                                          11900000
                RESP2(CODE_EXPLAIN);                                    11910000
         END;                                                           11920000
       WHEN(100)                                                        11930000
         DO;                                                            11940000
           EXEC SQL                                                     11950000
                CLOSE CURSOR_HW;                                        11960000
                                                                        11970000
           SELECT(SQLCA.SQLCODE);                                       11980000
             WHEN (0);                                                  11990000
             OTHERWISE                                                  12000000
               DO;                                                      12010000
                 RCBCQES.MESSAGE_NUMBER = 'C257';                       12020000
                 WRK_SQLCODE = SQLCA.SQLCODE;                           12030000
                 WRK_TABLE = 'RCBT0050_HW_PR';                          12040000
                 CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);       12050000
               END;                                                     12060000
           END;                                                         12070000
         END;                                                           12080000
       OTHERWISE                                                        12090000
         DO;                                                            12100000
           RCBCQES.MESSAGE_NUMBER = 'C256';                             12110000
           WRK_SQLCODE = SQLCA.SQLCODE;                                 12120000
           WRK_TABLE = 'RCBT0050_HW_PR';                                12130000
           CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);             12140000
         END;                                                           12150000
     END; */                                                            12160000
                                                                        12170000
   EXEC SQL                                                             12180000
    SELECT T050.COUNTRY_NUMBER                                          12190000
    INTO : TB_RCBV050.COUNTRY_NUMBER  :WRK_INDNULL                      12200000
    FROM  RCBV0050_HW_PR     T050                                       12210000
         ,RCBV0110_HW_STATUS T110                                       12220000
                                                 /* SOC CEDS00000704 */ 12230000
 /*      ,RCBV0125_DMMY_REAL T125                */       /* RB01320 */ 12240000
                                                 /* EOC CEDS00000704 */ 12250000
    WHERE  T050.PRODUCT_TYPE    = :REQTYPE                              12260000
 /*   AND  T050.ORIGIN          = :REQORIG               SOC RB01320 */ 12270000
 /*   AND  T050.SEQUENCE_NUMBER = :REQSEQN                           */ 12280000
      AND (( T050.ORIGIN          = :REQORIG                            12290000
             AND T050.SEQUENCE_NUMBER = :REQSEQN)                       12300000
           OR ( T050.ORIGIN||T050.SEQUENCE_NUMBER = :REQLSEQ)           12310000
           OR ( T050.ORIGIN||T050.SEQUENCE_NUMBER = :WRK_LONG_SERIAL    12320000
                              ) )                /* SOC CEDS00000704 */ 12330000
 /*             AND T125.COUNTRY_NUMBER = T050.COUNTRY_NUMBER)) */      12340000
                                                 /* EOC CEDS00000704 */ 12350000
 /*                                                      EOC RB01320 */ 12360000
      AND  T110.PRODUCT_TYPE    = T050.PRODUCT_TYPE                     12370000
      AND  T110.ORIGIN          = T050.ORIGIN                           12380000
      AND  T110.SEQUENCE_NUMBER = T050.SEQUENCE_NUMBER                  12390000
      AND  T110.COUNTRY_NUMBER  = T050.COUNTRY_NUMBER                   12400000
      AND  :DATE10        BETWEEN T110.EFFECTIVE_DATE                   12410000
                              AND T110.END_DATE                         12420000
    ORDER BY T110.LAST_CHANGE_DATE DESC                                 12430000
    FETCH FIRST 1 ROW ONLY                                              12440000
   WITH UR;                                                             12450000
                                                                        12460000
     SELECT(SQLCA.SQLCODE);                                             12470000
       WHEN(0)                                                          12480000
         DO;                                                            12490000
                                                      /* SOC RB01320 */ 12500000
 /*        EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV050.COUNTRY_NUMBER;   */ 12510000
         HEADER.EDQBSHS.REQ.REQKEY.IOPUCTY = TB_RCBV050.COUNTRY_NUMBER; 12520000
                                                                        12530000
  /*       EXEC CICS LINK                                            */ 12540000
  /*            PROGRAM('RCBCS3P')                                   */ 12550000
  /*            COMMAREA(HEADER)                                     */ 12560000
  /*            LENGTH(CSTG(HEADER))                                 */ 12570000
  /*            RESP(RESPONSE)                                       */ 12580000
  /*            RESP2(CODE_EXPLAIN);                                 */ 12590000
           CALL RCBCS1M_CALL_S3M;                                       12600000
                                                      /* EOC RB01320 */ 12610000
                                                 /* SOC CEDS00000727 */ 12620000
      /*   IF HEADER.EDQBSHS.CRMORET = '9' THEN *//* SOC CEDS00000761 */12630000
           IF HEADER.EDQBSHS.CRMORET = '9' &                            12631000
              SWITCH_3317 = TRUE THEN             /* EOC CEDS00000761 */12632000
             DO;                                                        12640000
               REQLSEQ5 = '';                                           12650000
               REQLSEQ  = '';                                           12660000
               REQLSEQ5 = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              12670000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = '';                    12680000
               HEADER.EDQBSHS.REQ.CRMOSUB = 0;                          12690000
               CALL RCBCS1M_CALL_S3M;                                   12700000
               HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = REQLSEQ5;              12710000
               REQLSEQ  = HEADER_NEW.EDQBSHS1.REQ.SEDQGSN;              12720000
             END;                                                       12730000
                                                 /* EOC CEDS00000727 */ 12740000
         END;                                                           12750000
       WHEN(100);                                                       12760000
       OTHERWISE                                                        12770000
         DO;                                                            12780000
           RCBCQES.MESSAGE_NUMBER = 'C256';                             12790000
           WRK_SQLCODE = SQLCA.SQLCODE;                                 12800000
           WRK_TABLE = 'RCBT0050_HW_PR';                                12810000
           CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);             12820000
         END;                                                           12830000
     END;                                             /* EOC RB01312 */ 12840000
 END RCBCS1M_READ_HW_PR;                                                12850000
1/*********************************************************************/12860000
 /*                                                                   */12870000
 /* MODULE NAME      : RCBCS1M_SELECT_T125            RB01320         */12880000
 /*                                                                   */12890000
 /* DESCRIPTION      : SELECT APPROPRIATE LONG SERIAL FROM T125 FOR   */12900000
 /*                    CORRESPONDING DUMMY SERIAL NUMBER              */12910000
 /*                                                                   */12920000
 /*********************************************************************/12930000
0RCBCS1M_SELECT_T125: PROC;                                             12940000
                                                                        12950000
 EXEC SQL                                                               12960000
      SELECT REAL_SERIAL_NUMBER                                         12970000
        INTO :WRK_LONG_SERIAL                                           12980000
        FROM RCBV0125_DMMY_REAL T125                                    12990000
       WHERE T125.PRODUCT_TYPE       = :REQTYPE                         13000000
         AND T125.DUMMY_ORIGIN       = :REQORIG                         13010000
         AND T125.DUMMY_SEQUENCE_NUM = :REQSEQN                         13020000
         ORDER BY T125.LAST_CHANGE_DATE DESC           /* SOC RC01339 */13030000
         FETCH FIRST 1 ROW ONLY                                         13040000
         WITH UR                                       /* EOC RC01339 */13050000
 ;                                                                      13060000
                                                                        13070000
 SELECT(SQLCA.SQLCODE);                                                 13080000
   WHEN (0);                                                            13090000
   WHEN (100);                                                          13100000
   OTHERWISE                                                            13110000
     DO;                                                                13120000
       RCBCQES.MESSAGE_NUMBER = 'C264';                                 13130000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     13140000
       WRK_TABLE = 'RCBT0125_DMMY_REAL';                                13150000
       CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                 13160000
     END;                                                               13170000
 END;                                                                   13180000
0END RCBCS1M_SELECT_T125;                                               13190000
1/*********************************************************************/13200000
 /*                                                                   */13210000
 /* MODULE NAME      : RCBCS1M_SELECT_T125_DUMMY      CEDS00000704    */13220000
 /*                                                                   */13230000
 /* DESCRIPTION      : SELECT APPROPRIATE DUMMY SERIAL FROM T125 FOR  */13240000
 /*                    CORRESPONDING LONG SERIAL NUMBER               */13250000
 /*                                                                   */13260000
 /*********************************************************************/13270000
0RCBCS1M_SELECT_T125_DUMMY: PROC;                                       13280000
                                                                        13290000
 DUMMY_ORIGIN     = '';                                                 13300000
 DUMMY_SEQUENCE   = '';                                                 13310000
                                                                        13320000
 EXEC SQL                                                               13330000
      SELECT DUMMY_ORIGIN , DUMMY_SEQUENCE_NUM                          13340000
        INTO :DUMMY_ORIGIN , :DUMMY_SEQUENCE                            13350000
        FROM RCBV0125_DMMY_REAL T125                                    13360000
       WHERE T125.PRODUCT_TYPE       = :REQTYPE                         13370000
         AND (T125.REAL_SERIAL_NUMBER = :REQLSEQ                        13380000
               OR T125.REAL_SERIAL_NUMBER = :REQORIG || :REQSEQN )      13390000
         ORDER BY T125.LAST_CHANGE_DATE DESC                            13400000
         FETCH FIRST 1 ROW ONLY                                         13410000
         WITH UR                                                        13420000
 ;                                                                      13430000
                                                                        13440000
 SELECT(SQLCA.SQLCODE);                                                 13450000
   WHEN (0);                                                            13460000
   WHEN (100);                                                          13470000
   OTHERWISE                                                            13480000
     DO;                                                                13490000
       RCBCQES.MESSAGE_NUMBER = 'C264';                                 13500000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     13510000
       WRK_TABLE = 'RCBT0125_DMMY_REAL';                                13520000
       CALL RCBCS1M_ERROR_LOG (WRK_SQLCODE, WRK_TABLE);                 13530000
     END;                                                               13540000
 END;                                                                   13550000
0END RCBCS1M_SELECT_T125_DUMMY;                                         13560000
1/*********************************************************************/13570000
 /*                                              RB01320              */13580000
 /* MODULE NAME      : RCBCS1M_CALL_S2M                               */13590000
 /*                                                                   */13600000
 /* DESCRIPTION      : CALL RCBCS2M PROGRAM WITH THE CORRESPONDING    */13610000
 /*                    STRUCTURE                                      */13620000
 /*                                                                   */13630000
 /*********************************************************************/13640000
0RCBCS1M_CALL_S2M: PROC;                                                13650000
                                                                        13660000
  IF SWITCH_0211 THEN                                                   13670000
    DO;                                                                 13680000
                                                  /* SOC CEDS00000642 */13690000
  /*  EXEC CICS LINK                                                    13700000
           PROGRAM('RCBCS2P')                                           13710000
           COMMAREA(HEADER)                                             13720000
           LENGTH(CSTG(HEADER))                                         13730000
           RESP(RESPONSE)                                               13740000
           RESP2(CODE_EXPLAIN); */                                      13750000
      LISTIT.EDQBSLS='';                                   /* RC01339 */13760000
      HEADER_OLD = HEADER;                                              13770000
      EXEC CICS LINK                                                    13780000
           PROGRAM('RCBCS2P')                                           13790000
           COMMAREA(HEADER_OLD)                                         13800000
           LENGTH(CSTG(HEADER_OLD))                                     13810000
           RESP(RESPONSE)                                               13820000
           RESP2(CODE_EXPLAIN);                                         13830000
      HEADER = HEADER_OLD;                                              13840000
                                                  /* EOC CEDS00000642 */13850000
    END;                                                                13860000
  IF SWITCH_3317 THEN                                                   13870000
    DO;                                                                 13880000
                                                  /* SOC CEDS00000642 */13890000
  /*  HEADER1.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                       13900000
      HEADER1.EDQBSHS1.REQ.SEDQGSN = REQLSEQ;                           13910000
      EXEC CICS LINK                                                    13920000
           PROGRAM('RCBCS2P')                                           13930000
           COMMAREA(HEADER1)                                            13940000
           LENGTH(CSTG(HEADER1))                                        13950000
           RESP(RESPONSE)                                               13960000
           RESP2(CODE_EXPLAIN);                                         13970000
      HEADER.EDQBSHS = HEADER1.EDQBSHS1, BY NAME; */                    13980000
      HEADER_NEW.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                    13990000
      HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = REQLSEQ;                        14000000
      EXEC CICS LINK                                                    14010000
           PROGRAM('RCBCS2P')                                           14020000
           COMMAREA(HEADER_NEW)                                         14030000
           LENGTH(CSTG(HEADER_NEW))                                     14040000
           RESP(RESPONSE)                                               14050000
           RESP2(CODE_EXPLAIN);                                         14060000
      HEADER.EDQBSHS = HEADER_NEW.EDQBSHS1, BY NAME;                    14070000
                                                  /* EOC CEDS00000642 */14080000
    END;                                                                14090000
                                                                        14100000
 END RCBCS1M_CALL_S2M;                                                  14110000
1/*********************************************************************/14120000
 /*                                                RB01320            */14130000
 /* MODULE NAME      : RCBCS1M_CALL_S3M                               */14140000
 /*                                                                   */14150000
 /* DESCRIPTION      : CALL RCBCS3M PROGRAM WITH THE CORRESPONDING    */14160000
 /*                    STRUCTURE                                      */14170000
 /*                                                                   */14180000
 /*********************************************************************/14190000
0RCBCS1M_CALL_S3M: PROC;                                                14200000
                                                                        14210000
  IF SWITCH_0211 THEN                                                   14220000
    DO;                                                                 14230000
                                                  /* SOC CEDS00000642 */14240000
  /*  EXEC CICS LINK                                                    14250000
           PROGRAM('RCBCS3P')                                           14260000
           COMMAREA(HEADER)                                             14270000
           LENGTH(CSTG(HEADER))                                         14280000
           RESP(RESPONSE)                                               14290000
           RESP2(CODE_EXPLAIN);   */                                    14300000
      HEADER_OLD = HEADER;                                              14310000
      EXEC CICS LINK                                                    14320000
           PROGRAM('RCBCS3P')                                           14330000
           COMMAREA(HEADER_OLD)                                         14340000
           LENGTH(CSTG(HEADER_OLD))                                     14350000
           RESP(RESPONSE)                                               14360000
           RESP2(CODE_EXPLAIN);                                         14370000
      HEADER = HEADER_OLD;                                              14380000
                                                  /* EOC CEDS00000642 */14390000
    END;                                                                14400000
  IF SWITCH_3317 THEN                                                   14410000
    DO;                                                                 14420000
                                                  /* SOC CEDS00000642 */14430000
    /*HEADER1.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                       14440000
      HEADER1.EDQBSHS1.REQ.SEDQGSN = REQLSEQ;                           14450000
      EXEC CICS LINK                                                    14460000
           PROGRAM('RCBCS3P')                                           14470000
           COMMAREA(HEADER1)                                            14480000
           LENGTH(CSTG(HEADER1))                                        14490000
           RESP(RESPONSE)                                               14500000
           RESP2(CODE_EXPLAIN);                                         14510000
      HEADER.EDQBSHS = HEADER1.EDQBSHS1, BY NAME;   */                  14520000
      HEADER_NEW.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                    14530000
      HEADER_NEW.EDQBSHS1.REQ.SEDQGSN = REQLSEQ;                        14540000
      EXEC CICS LINK                                                    14550000
           PROGRAM('RCBCS3P')                                           14560000
           COMMAREA(HEADER_NEW)                                         14570000
           LENGTH(CSTG(HEADER_NEW))                                     14580000
           RESP(RESPONSE)                                               14590000
           RESP2(CODE_EXPLAIN);                                         14600000
      HEADER.EDQBSHS = HEADER_NEW.EDQBSHS1, BY NAME;                    14610000
                                                  /* EOC CEDS00000642 */14620000
    END;                                                                14630000
                                                                        14640000
 END RCBCS1M_CALL_S3M;                                                  14650000
1/********************************************************************/ 14660000
 /*      F I N A L    P R O C E S S I N G                            */ 14670000
 /********************************************************************/ 14680000
0RCBCS1M_FINALISATION : PROC;                                           14690000
0SELECT (RESPONSE);                                                     14700000
    WHEN (DFHRESP(NORMAL));                                             14710000
    WHEN (DFHRESP(INVREQ))                                              14720000
    DO;                                                                 14730000
 /*    EDQBSHS.CRMORET = '3';                                RB01320 */ 14740000
       HEADER.EDQBSHS.CRMORET = '3';                      /* RB01320 */ 14750000
       RCBCQES.MESSAGE_NUMBER = 'C206';                                 14760000
       CALL RCBCS1M_LOG_ERROR;                                          14770000
    END;                                                                14780000
    OTHERWISE                                                           14790000
    DO;                                                                 14800000
 /*    EDQBSHS.CRMORET = '3';                                RB01320 */ 14810000
       HEADER.EDQBSHS.CRMORET = '3';                      /* RB01320 */ 14820000
       RCBCQES.MESSAGE_NUMBER = 'C207';                                 14830000
       CALL RCBCS1M_LOG_ERROR;                                          14840000
    END;                                                                14850000
 END;                                                                   14860000
                                                 /* SOC CEDS00000642 */ 14870000
 IF SWITCH_0211 THEN                                                    14880000
   DO;                                                                  14890000
     HEADER_OLD = HEADER;                                               14900000
   END;                                                                 14910000
 ELSE                                                                   14920000
 IF SWITCH_3317 THEN                                                    14930000
   DO;                                                                  14940000
     HEADER_NEW.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                     14950000
   END;                                                                 14960000
                                                      /* SOC RB01320 */ 14970000
 /*IF SWITCH_3317 THEN                                                  14980000
   DO;                                                                  14990000
     NEW_VERSION_DUMMY.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;              15000000
     NEW_VERSION_DUMMY.EDQBSHS1.REQ.SEDQGSN = REQLSEQ;                  15010000
     NEW_VERSION_DUMMY.EDQBSDS1 = DETAIL.EDQBSDS, BY NAME;              15020000
     NEW_VERSION_DUMMY.EDQBSDS1.SEDQGSN = DETAIL1.EDQBSDS1.SEDQGSN;     15030000
     DETAIL1= ' ';                                                      15040000
     DETAIL1 = NEW_VERSION_DUMMY;                                       15050000
     NEW_VERSION_DUMMY = ' ';                                           15060000
   END; */                                            /* EOC RB01320 */ 15070000
                                                 /* EOC CEDS00000642 */ 15080000
0EXEC CICS RETURN                                                       15090000
    RESP(RESPONSE);                                                     15100000
0END RCBCS1M_FINALISATION;                                              15110000
1/********************************************************************/ 15120000
 /*      ERROR LOGGING PROCEDURE                                     */ 15130000
 /********************************************************************/ 15140000
0RCBCS1M_LOG_ERROR : PROC;                                              15150000
0RCBCQES_SQLCA         = '';                                            15160000
0RCBCQES.MESSAGE_TYPE  = 'IS';                                          15170000
 RCBCQES.LANGUAGE_CODE = 'EN';                                          15180000
 RCBCQES.PROGRAM_ID    = 'RCBCS1M';                                     15190000
 CALL RCBCQEM(RCBCQES_PTR);                                             15200000
                                                 /* SOC CEDS00000642 */ 15210000
 IF SWITCH_0211 THEN                                                    15220000
   DO;                                                                  15230000
    HEADER_OLD = HEADER;                                                15240000
   END;                                                                 15250000
 ELSE                                                                   15260000
 IF SWITCH_3317 THEN                                                    15270000
   DO;                                                                  15280000
     HEADER_NEW.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                     15290000
   END;                                                                 15300000
                                                      /* SOC RB01320 */ 15310000
 /*IF SWITCH_3317 THEN                                                  15320000
   DO;                                                                  15330000
     HEADER1.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                        15340000
   END;    */                                         /* EOC RB01320 */ 15350000
                                                 /* EOC CEDS00000642 */ 15360000
                                                                        15370000
 EXEC CICS RETURN;                                                      15380000
0END RCBCS1M_LOG_ERROR;                                                 15390000
                                                                        15400000
0RCBCS1M_ERROR_LOG : PROC(ERR_SQLCODE,ERR_TABLE);     /* SOC RC01302 */ 15410000
                                                                        15420000
 DCL ERR_TABLE   CHAR(18);                                              15430000
 DCL ERR_SQLCODE FIXED BIN(31);                                         15440000
                                                                        15450000
 SELECT(ERR_SQLCODE);                                                   15460000
    WHEN (0);                                                           15470000
 /* WHEN (100)                                            SOC RB01320 */15480000
 /*    EDQBSHS.REQ.CRMORET = '9';                                       15490000
    WHEN (-923)                                                         15500000
       EDQBSHS.REQ.CRMORET = '8';                                       15510000
    WHEN (9999)                                                         15520000
       EDQBSHS.REQ.CRMORET = '4';                                       15530000
    OTHERWISE                                                           15540000
       EDQBSHS.REQ.CRMORET = '7';                                       15550000
 END;                                                                   15560000
                                                                        15570000
0EDQBSHS.REQ.NTBLNME = ERR_TABLE;                                       15580000
 EDQBSHS.REQ.CRMOSUB = ERR_SQLCODE; */                                  15590000
    WHEN (100)                                                          15600000
       HEADER.EDQBSHS.REQ.CRMORET = '9';                                15610000
    WHEN (-923)                                                         15620000
       HEADER.EDQBSHS.REQ.CRMORET = '8';                                15630000
    WHEN (9999)                                                         15640000
       HEADER.EDQBSHS.REQ.CRMORET = '4';                                15650000
    OTHERWISE                                                           15660000
       HEADER.EDQBSHS.REQ.CRMORET = '7';                                15670000
 END;                                                                   15680000
                                                                        15690000
0HEADER.EDQBSHS.REQ.NTBLNME = ERR_TABLE;                                15700000
 HEADER.EDQBSHS.REQ.CRMOSUB = ERR_SQLCODE;            /* EOC RB01320 */ 15710000
                                                                        15720000
0RCBCQES.MESSAGE_TYPE  = 'IS';                                          15730000
 RCBCQES.LANGUAGE_CODE = 'EN';                                          15740000
 RCBCQES.PROGRAM_ID    = 'RCBCS1M';                                     15750000
 CALL RCBCQEM(RCBCQES_PTR);                                             15760000
                                                 /* SOC CEDS00000642 */ 15770000
 IF SWITCH_0211 THEN                                                    15780000
   DO;                                                                  15790000
    HEADER_OLD = HEADER;                                                15800000
   END;                                                                 15810000
 ELSE                                                                   15820000
 IF SWITCH_3317 THEN                                                    15830000
   DO;                                                                  15840000
     HEADER_NEW.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                     15850000
   END;                                                                 15860000
                                                      /* SOC RB01320 */ 15870000
 /*IF SWITCH_3317 THEN                                                  15880000
   DO;                                                                  15890000
     HEADER1.EDQBSHS1 = HEADER.EDQBSHS, BY NAME;                        15900000
   END;    */                                         /* EOC RB01320 */ 15910000
                                                 /* EOC CEDS00000642 */ 15920000
                                                                        15930000
 EXEC CICS RETURN;                                                      15940000
0END RCBCS1M_ERROR_LOG;                                                 15950000
-/*------------------------------------------------------------------*/ 15960000
 /* IDENTIFIER : $DTSEP                                    RC01302   */ 15970000
 /* FUNCTION   : ADD SEPARATORS TO DATE OR TIME STRINGS              */ 15980000
 /* DESCRIPTION: IF YEAR HAS 4 DIGITS, YYYYMMDD DATE FORMAT REQUIRED */ 15990000
 /*      OTHERWISE WHICHEVER 6-DIGITS DATE OR TIME FORMAT IS ALLOWED */ 16000000
 /*------------------------------------------------------------------*/ 16010000
 $DTSEP:  PROC(DATE_IN,SEP)                                             16020000
          RETURNS(CHAR(10)  VAR)  REORDER;                              16030000
    DCL DATE_IN    CHAR(*);                                             16040000
    DCL SEP        CHAR(01);                                            16050000
    DCL DATE_OUT   CHAR(10)  VAR  INIT('');                             16060000
    DCL LIN        FIXED BIN(15)  INIT(0);                              16070000
    LIN = LENGTH(DATE_IN);                                              16080000
    DATE_OUT = DATE_IN || (2)' ';                                       16090000
    SUBSTR(DATE_OUT,LIN-3,3) =                                          16100000
            SEP || SUBSTR(DATE_IN,LIN-3,2);                             16110000
    SUBSTR(DATE_OUT,LIN,3)   =                                          16120000
            SEP || SUBSTR(DATE_IN,LIN-1,2);                             16130000
    RETURN(DATE_OUT);                                                   16140000
  END  $DTSEP;                                       /* EOC RC01302 */  16150000
1/*******************************************************************/  16160000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  16170000
 /*******************************************************************/  16180000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  16190000
  $DAIMOD (RCBCS1M);                     /* MODULE TO BE COMPILED   */  16200000
0/*******************************************************************/  16210000
 /* END OF ABR BLOCK '                                              */  16220000
 /*******************************************************************/  16230000
0 END RCBCS1M;                                                          16240000