 /* RCBC53P - MAINTAIN PRIME INPUT CONTRACT                          */ 00010084
 /********************************************************************/ 00020084
 /*                                                                  */ 00030084
 /* TRANSACTION CODE    : RC53                                       */ 00040084
 /*                                                                  */ 00050084
 /* PROGRAM NAME        : RCBC53M                                    */ 00060084
 /*                                                                  */ 00070084
 /* TYPE                : CICS/VS                                    */ 00080084
 /*                                                                  */ 00090084
 /* USED MAPSET         : RCBM53                                     */ 00100084
 /*      MAP            : RCBM53                                     */ 00110084
 /*                     : RCBM53A                                    */ 00120084
 /*                     : RCBH53                                     */ 00130084
 /*                     : RCBH53A                                    */ 00140084
 /*                                                                  */ 00150084
 /*                                                                  */ 00160084
 /* DESCRIPTION         : MAINTAIN PRIME INPUT CONTRACT              */ 00170084
 /*                                                                  */ 00180084
 /* LINKED TRANSACTION  : RC53                                       */ 00190084
 /*                                                                  */ 00200084
 /* MESSAGES            :                                            */ 00210084
 /*                                                                  */ 00220084
 /*                                                                  */ 00230084
 /*  MAINTENANCE LOG :                                               */ 00240084
 /*  ---------------                                                 */ 00250084
 /*                                                                  */ 00260084
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00270084
 /*  --------------------------------------------------------------  */ 00280084
 /*  2001-10-17 | RC01230      | CSP TO PL1/CICS CONVERSION          */ 00290084
 /*  2003/12/08 | RB01261      | MAKE COUNTRY NUMBER CHANGEABLE      */ 00300084
 /*  2003/12/08 | RB01263      | MINOR CICS CHANGES                  */ 00310084
 /*  2007-12-28 | CEDS00000366 | SECURITY OPTIONS FIX                */ 00320084
 /*  2008/02/08 | CEDS00000361 | WORK_DATE HAS ASSIGNED              */ 00330084
 /*  2008/02/27 | RB01289      | PRIME INPUT CUSTOMER NUMBER         */ 00340084
 /*  2008/04/16 | CEDS00000385 | TYPO IN A MESSAGE                   */ 00350084
 /*  2008/10/07 | RC01296      | VALIDATION HAS BEEN CHANGED FOR     */ 00351086
 /*             |              | CONTRACT NUMBER                     */ 00352085
 /*  2010/07/07 | RB01308      | A14 RELEASE - TREC T08-738          */ 00353088
 /*             |              | UPDATED THE DESCIPTION OF ERROR     */ 00354088
 /*             |              | MESSAGE ERR_O133                    */ 00355088
 /********************************************************************/ 00370084
1RCBC53M: PROC(COMMPTR)                                                 00380084
          OPTIONS (MAIN)                                                00390084
          REORDER;                                                      00400084
0/********************************************************************/ 00410084
 /*  EXTERNAL ENTRIES                                                */ 00420084
 /********************************************************************/ 00430084
                                                                        00440084
0DCL PLIXOPT   VAR  CHAR (256)                                          00450084
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;            00460084
                                                                        00470084
 DCL RCB004N ENTRY EXTERNAL;                                            00480084
                                                                        00490084
0/********************************************************************/ 00500084
 /*  BMS RELATED CONSTANTS                                           */ 00510084
 /********************************************************************/ 00520084
 %INCLUDE DFHBMSCA;                                                     00530084
0/********************************************************************/ 00540084
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00550084
 /********************************************************************/ 00560084
 %INCLUDE DFHAID;                                                       00570084
1/********************************************************************/ 00580084
 /*  COMMUNICATION AREA                                              */ 00590084
 /********************************************************************/ 00600084
     %INCLUDE (RCBCP2S);                                                00610084
     %INCLUDE (RCBCHDS);,                                               00620084
     %INCLUDE (RCBC00S);,                                               00630084
     %INCLUDE (RCBC53S);;                                               00640084
0/********************************************************************/ 00650084
 /*  MAP STRUCTURES                                                  */ 00660084
 /********************************************************************/ 00670084
 %INCLUDE (RCBM53);                                                     00680084
0/********************************************************************/ 00690084
 /*  DB2 STRUCTURES                                                  */ 00700084
 /********************************************************************/ 00710084
 DCL 1 RCB241S,                                                         00720084
      %INCLUDE RCB241S;;                                                00730084
 DCL 1 RCB241SI,                                                        00740084
      %INCLUDE RCB241SI;;                                               00750084
 DCL 1 RCB560S,                                                         00760084
     %INCLUDE (RCB560S);;                                               00770084
 DCL 1 RCB560SI,                                                        00780084
     %INCLUDE (RCB560SI);;                                              00790084
0/********************************************************************/ 00800084
 /*  NULL INDICATORS                                                 */ 00810084
 /********************************************************************/ 00820084
 DCL 1 NULL241      BASED(ADDR(RCB241SI)),                              00830084
       3 NUL241A    FIXED BIN(15) INIT(0),                              00840084
       3 NUL241B    FIXED BIN(15) INIT(0),                              00850084
       3 NUL241C    FIXED BIN(15) INIT(0),                              00860084
       3 NUL241D    FIXED BIN(15) INIT(0),                              00870084
       3 NUL241E    FIXED BIN(15) INIT(0),                              00880084
       3 NUL241F    FIXED BIN(15) INIT(0),                              00890084
       3 NUL241G    FIXED BIN(15) INIT(0),                              00900084
       3 NUL241H    FIXED BIN(15) INIT(0),                              00910084
       3 NUL241I    FIXED BIN(15) INIT(0),                              00920084
       3 NUL241J    FIXED BIN(15) INIT(0),                              00930084
       3 NUL241K    FIXED BIN(15) INIT(0),                              00940084
       3 NUL241L    FIXED BIN(15) INIT(0),                              00950084
       3 NUL241M    FIXED BIN(15) INIT(0),                              00960084
       3 NUL241N    FIXED BIN(15) INIT(0),                              00970084
       3 NUL241O    FIXED BIN(15) INIT(0),                              00980084
       3 NUL241P    FIXED BIN(15) INIT(0),                              00990084
       3 NUL241Q    FIXED BIN(15) INIT(0),                              01000084
       3 NUL241R    FIXED BIN(15) INIT(0),                              01010084
       3 NUL241S    FIXED BIN(15) INIT(0),                              01020084
       3 NUL241T    FIXED BIN(15) INIT(0),                              01030084
       3 NUL241U    FIXED BIN(15) INIT(0),                              01040084
       3 NUL241V    FIXED BIN(15) INIT(0),                              01050084
       3 NUL241W    FIXED BIN(15) INIT(0),                              01060084
       3 NUL241X    FIXED BIN(15) INIT(0),                              01070084
       3 NUL241Y    FIXED BIN(15) INIT(0),                              01080084
       3 NUL241Z    FIXED BIN(15) INIT(0),                              01090084
       3 NUL2410    FIXED BIN(15) INIT(0),                              01100084
       3 NUL2411    FIXED BIN(15) INIT(0),                              01110084
       3 NUL2412    FIXED BIN(15) INIT(0),                              01120084
       3 NUL2413    FIXED BIN(15) INIT(0),                              01130084
       3 NUL2414    FIXED BIN(15) INIT(0),                              01140084
       3 NUL2415    FIXED BIN(15) INIT(0),                              01150084
       3 NUL2416    FIXED BIN(15) INIT(0);                /* RB01289 */ 01160084
0/********************************************************************/ 01170084
 /*  INTERFACE AREAS                                                 */ 01180084
 /********************************************************************/ 01190084
 DCL 1 DATE_AREA,                                                       01200084
     %INCLUDE (RCBZ03S);;                                               01210084
 DCL 1 RCBZ02S,                                                         01220084
      %INCLUDE RCBZ02S;;                                                01230084
 DCL 1 SQLCA_R      BASED(ADDR(RCBZ02S.RETURN_SQL))                     01240084
                    LIKE SQLCA;                                         01250084
 DCL 1 PARM_INT_AREA,                                                   01260084
      %INCLUDE RCBZ01S;;                                                01270084
0/********************************************************************/ 01280084
 /*  RETURN CODES                                                    */ 01290084
 /********************************************************************/ 01300084
 DCL RESPONSE     FIXED BIN(31) INIT(0);        /*RETURN CODE        */ 01310084
 DCL CODE_EXPLAIN FIXED BIN(31) INIT(0);        /*RETURN CODE EXPLAIN*/ 01320084
-/********************************************************************/ 01330084
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 01340084
 /********************************************************************/ 01350084
  EXEC SQL  WHENEVER NOT FOUND   CONTINUE;                              01360084
  EXEC SQL  WHENEVER SQLWARNING  CONTINUE;                              01370084
  EXEC SQL  WHENEVER SQLERROR    CONTINUE;                              01380084
0/********************************************************************/ 01390084
 /*  WORKING DECLARATIONS                                            */ 01400084
 /********************************************************************/ 01410084
 DCL PF5_FLAG                 BIT(1) INIT('0'B);                        01420084
 DCL T241_UPD_FLAG            BIT(1) INIT('0'B);                        01430084
 DCL T241_FIELD_FLAG          BIT(1) INIT('0'B);          /* RC01296 */ 01431085
 DCL ERR_FLAG                 BIT(1) INIT('0'B);                        01440084
 DCL QTY_FLAG                 BIT(1) INIT('0'B);                        01450084
 DCL CONTRACT_NUMBER_FLAG     BIT(1) INIT('0'B);          /* RC01296 */ 01451085
 DCL PIC_CNT                  PIC'ZZZZ9' INIT(0);                       01460084
 DCL PIC_EXPLAIN              PIC'ZZZZ9' INIT(0);                       01470084
 DCL COMMAREA_STRING          CHAR(5984) INIT('');                      01480084
 DCL WRK_REC_COUNT            FIXED BIN(31) INIT(0);                    01490084
 DCL WRK_HVP_QTY_FD           FIXED DEC(5) INIT(0);                     01500084
 DCL WRK_QTYA                 CHAR(5) INIT('');                         01510084
 DCL WRK_QTYC                 CHAR(5) INIT('');                         01520084
 DCL WRK_QTYP                 PIC'ZZZZ9' DEF WRK_QTYC;                  01530084
 DCL WRK_QTY                  PIC'99999' INIT(0);                       01540084
 DCL WRK_DATE1                CHAR(10) INIT('');                        01550084
 DCL NUMERIC                  CHAR(11) INIT(' 1234567890');             01560084
 DCL ALPHANUM                 CHAR(37)                                  01570084
                        INIT(' ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890');  01580084
 DCL WRK_SM1                  CHAR(2) INIT('');                         01590084
 DCL WRK_SM2                  CHAR(2) INIT('');                         01600084
 DCL WRK_SM3                  CHAR(2) INIT('');                         01610084
 DCL WRK_SM4                  CHAR(2) INIT('');                         01620084
 DCL WRK_SM5                  CHAR(2) INIT('');                         01630084
 DCL WRK_O                    CHAR(1) INIT('O');                        01640084
 DCL WRK_CS1                  CHAR(8) INIT('');                         01650084
 DCL WRK_CE1                  CHAR(8) INIT('');                         01660084
 DCL WRK_CS2                  CHAR(8) INIT('');                         01670084
 DCL WRK_CE2                  CHAR(8) INIT('');                         01680084
 DCL WRK_CS3                  CHAR(8) INIT('');                         01690084
 DCL WRK_CE3                  CHAR(8) INIT('');                         01700084
 DCL WRK_CS4                  CHAR(8) INIT('');                         01710084
 DCL WRK_CE4                  CHAR(8) INIT('');                         01720084
 DCL WRK_CS5                  CHAR(8) INIT('');                         01730084
 DCL WRK_CE5                  CHAR(8) INIT('');                         01740084
 DCL WRK_CS6                  CHAR(8) INIT('');                         01750084
 DCL WRK_CE6                  CHAR(8) INIT('');                         01760084
 DCL WRK_CS7                  CHAR(8) INIT('');                         01770084
 DCL WRK_CE7                  CHAR(8) INIT('');                         01780084
 DCL WRKMAP_DATA              CHAR(500) INIT('');                       01790084
 DCL 1 WRKMAP                 BASED(ADDR(WRKMAP_DATA)),                 01800084
     %INCLUDE RCBB567;;                                                 01810084
 DCL WRK_TIME_IN              CHAR(26) INIT(''); /* CEDS00000361      */01820084
 DCL WRK_CUSTOMER_NUMBER      CHAR (8) INIT(''); /*        RB01289    */01830084
0/********************************************************************/ 01840084
 /*  MESSAGES                                                        */ 01850084
 /********************************************************************/ 01860084
 DCL ERR_MESSAGE2 CHAR(30) INIT('ERROR IN SENDING MAP ');               01870084
 DCL ERR_MESSAGE3 CHAR(30) INIT('ERROR IN RECEIVING MAP ');             01880084
 DCL ERR_MESSAGE13 CHAR(33) INIT('OTHER ERRORS                     ');  01890084
 DCL ERR_MESSAGE30 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       01900084
 DCL ERR_O002 CHAR(15) INIT('Invalid date');                            01910084
 DCL ERR_O004 CHAR(30) INIT('Invalid use of function key');             01920084
 DCL ERR_O005 CHAR(45) INIT                                             01930084
  ('The highlighted fields have a syntax ERROR');                       01940084
 DCL ERR_O006 CHAR(15) INIT('Invalid time');                            01950084
 DCL ERR_O012 CHAR(40) INIT('End date earlier than effective date');    01960084
 DCL ERR_O022 CHAR(21) INIT('Press F5 to execute');                     01970084
 DCL ERR_O030 CHAR(24) INIT('Already on first page');                   01980084
 DCL ERR_O031 CHAR(23) INIT('Already on last page');                    01990084
 DCL ERR_O032 CHAR(17) INIT('No item selected');                        02000084
 DCL ERR_O053 CHAR(20) INIT('Nothing is updated');                      02010084
 DCL ERR_O057 CHAR(70) INIT                                             02020084
 ('You are not authorized to use the function for this Country Number');02030084
 DCL ERR_O060 CHAR(60) INIT                                             02040084
  ('When the TOS is changed, F5 will not execute any update');          02050084
 DCL ERR_O064 CHAR(40) INIT('Fill in the action you want to perform');  02060084
 DCL ERR_O072 CHAR(25) INIT('Country number is invalid');               02070084
 DCL ERR_O079 CHAR(70) INIT                                             02080084
 ('Not allowed to maintain P.I. contracts,no activity report created'); 02090084
 DCL ERR_O080 CHAR(68) INIT                                             02100084
  ('The TO time has to be filled in when the FROM time is filled in');  02110084
 DCL ERR_O081 CHAR(68) INIT                                             02120084
  ('The FROM time has to be filled in, when the TO time is filled in'); 02130084
 DCL ERR_O098 CHAR(25) INIT('Invalid command entered');                 02140084
 DCL ERR_O104 CHAR(68) INIT                                             02150084
  ('Unexpected system ERR_Or, please reenter or exit and try later');   02160084
 DCL ERR_O117 CHAR(25) INIT('Field must be filled in');                 02170084
 DCL ERR_O119 CHAR(65) INIT                                             02180084
  ('Row for insert already exists. Choose action = 2 or action = 3');   02190084
 DCL ERR_O120 CHAR(70) INIT                                             02200084
  ('Row for update not found. Choose action = 1 or fill in new values');02210084
 DCL ERR_O121 CHAR(70) INIT                                             02220084
  ('Row for delete not found. Choose action = 1 or fill in new values');02230084
 DCL ERR_O122 CHAR(45) INIT                                             02240084
  ('Delete successful. Enter new data or EXIT');                        02250084
 DCL ERR_O123 CHAR(45) INIT                                             02260084
  ('Insert successful. Enter new data or EXIT');                        02270084
 DCL ERR_O124 CHAR(45) INIT                                             02280084
  ('Update successful. Enter new data or EXIT');                        02290084
 DCL ERR_O127 CHAR(55) INIT                                             02300084
  ('Invalid action. Choose one of the displayed options');              02310084
 DCL ERR_O132 CHAR(35) INIT('Contract for TOS does not exist');         02320084
 DCL ERR_O133 CHAR(65) INIT                                             02330084
                                                      /* SOC RB01308 */ 02331088
 /* ('Delete enabled by setting contract end date to current date'); */ 02340087
  ('Delete enabled by setting contract end date to current date-1');    02341087
                                                      /* EOC RB01308 */ 02342088
 DCL ERR_O138 CHAR(50) INIT                                             02350084
  ('Not possible to delete an already expired record');                 02360084
 DCL ERR_O142 CHAR(35) INIT('Service_Level_Code does not exist');       02370084
0/********************************************************************/ 02380084
 /*  TS AREA                                                         */ 02390084
 /********************************************************************/ 02400084
 DCL 1 TS_REC,                                                          02410084
       3 TYPE      CHAR(04) INIT(''),                                   02420084
       3 ORIGIN    CHAR(02) INIT(''),                                   02430084
       3 SEQNO     CHAR(07) INIT(''),                                   02440084
       3 EFFDATE   CHAR(10) INIT(''),                                   02450084
       3 ENDDATE   CHAR(10) INIT(''),                                   02460084
       3 CONTNO    CHAR(15) INIT(''),                                   02470084
       3 CUSNUM    CHAR(8)  INIT('');                   /* RB01289   */ 02480084
0/********************************************************************/ 02490084
 /*                 BUILT IN FUNCTIONS                               */ 02500084
 /********************************************************************/ 02510084
0DCL (LENGTH,                                                           02520084
      STRING,                                                           02530084
      SUBSTR,                                                           02540084
      VERIFY,                                                           02550084
      DECIMAL,                                                          02560084
      DATETIME,                                                         02570084
      CHAR,                                                             02580084
      NULL,                                                             02590084
      CSTG,                                                             02600084
      STG,                                                              02610084
      ADDR)   BUILTIN;                                                  02620084
-/********************************************************************/ 02630084
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 02640084
 /********************************************************************/ 02650084
  EXEC SQL  INCLUDE  SQLCA                  ;/*                      */ 02660084
-/********************************************************************/ 02670084
 /****   DECLARATIONS OF DB2 CURSORS                              ****/ 02680084
 /********************************************************************/ 02690084
  EXEC SQL DECLARE C_241 CURSOR FOR                                     02700084
           SELECT PRODUCT_TYPE                                          02710084
                 ,ORIGIN                                                02720084
                 ,SEQUENCE_NUMBER                                       02730084
                 ,CONTRACT_NUMBER                                       02740084
                 ,EFFECTIVE_DATE                                        02750084
                 ,END_DATE                                              02760084
                 ,CUSTOMER_NUMBER                       /*  RB01289 */  02770084
           FROM RCBV0241_PI_CTR                                         02780084
           WHERE COUNTRY_NUMBER       = :WRK_COUNTRY_NUMBER             02790084
             AND ((PRODUCT_TYPE       = :TYPE_SEL                       02800084
              OR   :TYPE_ENT          = 'N')                            02810084
             AND  (ORIGIN             = :ORIGIN_SEL                     02820084
              OR   :ORIGIN_ENT        = 'N')                            02830084
             AND  (SEQUENCE_NUMBER    = :SEQ_SEL                        02840084
              OR   :SEQ_ENT           = 'N'))                           02850084
           ORDER BY PRODUCT_TYPE,ORIGIN,SEQUENCE_NUMBER,EFFECTIVE_DATE  02860084
           FOR FETCH ONLY                                               02870084
           WITH UR;                                                     02880084
                                                                        02890084
1/********************************************************************/ 02900084
 /*                   M A I N   P R O C E S S I N G                  */ 02910084
 /*                                                                  */ 02920084
 /********************************************************************/ 02930084
0RCBM53O.MSG_LINEO = '';                                                02940084
                                                                        02950084
 IF EIBCALEN = 0 THEN                                                   02960084
 DO;                                                                    02970084
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   02980084
 END;                                                                   02990084
                                                                        03000084
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP; /* CEDS00000361      */ 03010084
 WRK_DATE = SUBSTR(WRK_TIME_IN,1,10);           /* CEDS00000361      */ 03020084
                                                                        03030084
                                                                        03040084
 IF HEADER.NEXT = '99' THEN                                             03050084
 DO;                                                                    03060084
   HEADER.NEXT = '00';                                                  03070084
   CALL RCBC53M_CLEAR_SEL;                                              03080084
   CALL RCBC53M_CLEAR_WORK;                                             03090084
   CALL RCBC53M_CLEAR_MAPA;                                             03100084
   TMP_COUNTRY_NUMBER = WRK_COUNTRY_NUMBER;                             03110084
   CALL RCBC53M_SEND_MAPA;                                              03120084
 END;                                                                   03130084
                                                                        03140084
 IF HEADER.NEXT = '98' THEN                                             03150084
 DO;                                                                    03160084
   HEADER.NEXT = '00';                                                  03170084
   CALL RCBC53M_CLEAR_SEL;                                              03180084
   CALL RCBC53M_CLEAR_WORK;                                             03190084
   CALL RCBC53M_CLEAR_MAPA;                                             03200084
   CALL RCBC53M_SEND_MAPA;                                              03210084
 END;                                                                   03220084
                                                                        03230084
 IF HEADER.NEXT = 'H1' THEN                                             03240084
 DO;                                                                    03250084
   HEADER.NEXT = '00';                                                  03260084
   IF  HEADER.REQUEST_ID = 'A' THEN                                     03270084
   DO;                                                                  03280084
     IF TS_CNT = 0 THEN                                                 03290084
     DO;                                                                03300084
       CALL RCBC53M_CLEAR_MAPA;                                         03310084
       CALL RCBC53M_SEND_MAPA;                                          03320084
     END;                                                               03330084
     J = J - K;                                                         03340084
     CALL RCBC53M_FILL_MAPA;                                            03350084
     RCBM53AI.SELL(1) = -1;                                             03360084
     CALL RCBC53M_SEND_MAPA_CSR;                                        03370084
   END;                                                                 03380084
   CALL RCBC53M_RESTORE_MAP;                                            03390084
   CALL RCBC53M_GET_CSR_POS;                                            03400084
   CALL RCBC53M_SEND_MAP_CSR;                                           03410084
 END;                                                                   03420084
                                                                        03430084
 SELECT (EIBAID);                                                       03440084
   WHEN (DFHPF1,DFHPF13)                                                03450084
   DO;                                                                  03460084
      CALL RCBC53M_HELP_MAP;                                            03470084
   END;                                                                 03480084
                                                                        03490084
   WHEN (DFHPF2,DFHPF14)                                                03500084
   DO;                                                                  03510084
     IF  HEADER.REQUEST_ID = 'A' THEN                                   03520084
     DO;                                                                03530084
     CALL RCBC53M_CLEAR_SEL;                                            03540084
     CALL RCBC53M_CLEAR_WORK;                                           03550084
     CALL RCBC53M_CLEAR_MAPA;                                           03560084
     CALL RCBC53M_SEND_MAPA;                                            03570084
     END;                                                               03580084
     ELSE DO;                                                           03590084
       CALL RCBC53M_RECEIVE_MAP;                                        03600084
       RCBM53O.MSG_LINEO = ERR_O004;                                    03610084
       RCBM53I.ACTIONL   = -1;                                          03620084
       CALL RCBC53M_SEND_MAP_CSR;                                       03630084
     END;                                                               03640084
   END;                                                                 03650084
                                                                        03660084
   WHEN (DFHPF3,DFHPF15)                                                03670084
   DO;                                                                  03680084
     IF UPD_OK_FLAG = TRUE THEN                                         03690084
     DO;                                                                03700084
       UPD_OK_FLAG = FALSE;                                             03710084
       CALL RCBC53M_GET_SELECTION;                                      03720084
       CALL RCBC53M_FILL_MAPA;                                          03730084
       RCBM53AI.SELL(1) = -1;                                           03740084
       CALL RCBC53M_SEND_MAPA_CSR;                                      03750084
     END;                                                               03760084
                                                                        03770084
     IF  HEADER.REQUEST_ID = '' THEN                                    03780084
     DO;                                                                03790084
       IF TS_CNT = 0 THEN                                               03800084
       DO;                                                              03810084
         CALL RCBC53M_CLEAR_WORK;                                       03820084
         CALL RCBC53M_CLEAR_MAP;                                        03830084
         CALL RCBC53M_CLEAR_MAPA;                                       03840084
         CALL RCBC53M_SEND_MAPA;                                        03850084
       END;                                                             03860084
                                                                        03870084
       CALL RCBC53M_CLEAR_WORK;                                         03880084
       CALL RCBC53M_CLEAR_MAP;                                          03890084
       J = J - K;                                                       03900084
       CALL RCBC53M_FILL_MAPA;                                          03910084
       RCBM53AI.SELL(1) = -1;                                           03920084
       CALL RCBC53M_SEND_MAPA_CSR;                                      03930084
     END;                                                               03940084
                                                                        03950084
     HEADER.NEXT = 'H1';                                                03960084
     TS_Q = 'RC00' || EIBTRMID;                                         03970084
     EXEC CICS IGNORE CONDITION QIDERR;                                 03980084
     EXEC CICS DELETEQ TS QUEUE(TS_Q);                                  03990084
     EXEC CICS HANDLE CONDITION QIDERR;                                 04000084
                                                                        04010084
     EXEC CICS XCTL                                                     04020084
         PROGRAM('RCBC50P')                                             04030084
         COMMAREA(COMMAREA)                                             04040084
         LENGTH(CSTG(COMMAREA))                                         04050084
         RESP(RESPONSE)                                                 04060084
         RESP2(CODE_EXPLAIN);                                           04070084
   END;                                                                 04080084
                                                                        04090084
   WHEN (DFHPF4,DFHPF16)                                                04100084
   DO;                                                                  04110084
     IF  HEADER.REQUEST_ID = 'A' THEN                                   04120084
     DO;                                                                04130084
       CALL RCBC53M_CLEAR_MAP;                                          04140084
       RCBM53O.ACTIONO = '1';                                           04150084
       RCBM53I.ACTIONL = -1;                                            04160084
       CALL RCBC53M_SEND_MAP_CSR;                                       04170084
     END;                                                               04180084
     ELSE DO;                                                           04190084
       CALL RCBC53M_RECEIVE_MAP;                                        04200084
       RCBM53O.MSG_LINEO = ERR_O004;                                    04210084
       RCBM53I.ACTIONL   = -1;                                          04220084
       CALL RCBC53M_SEND_MAP_CSR;                                       04230084
     END;                                                               04240084
   END;                                                                 04250084
                                                                        04260084
   WHEN (DFHPF5,DFHPF17)                                                04270084
   DO;                                                                  04280084
     IF  HEADER.REQUEST_ID = 'A' THEN                                   04290084
     DO;                                                                04300084
       IF TS_CNT = 0 THEN                                               04310084
       DO;                                                              04320084
         CALL RCBC53M_CLEAR_MAPA;                                       04330084
         RCBM53AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                 04340084
         RCBM53AO.MSG_LINEO = ERR_O004;                                 04350084
         RCBM53AI.TYPE_SELL = -1;                                       04360084
         CALL RCBC53M_SEND_MAPA_CSR;                                    04370084
       END;                                                             04380084
       J = J - K;                                                       04390084
       CALL RCBC53M_FILL_MAPA;                                          04400084
       RCBM53AO.MSG_LINEO = ERR_O004;                                   04410084
       RCBM53AI.SELL(1)   = -1;                                         04420084
       CALL RCBC53M_SEND_MAPA_CSR;                                      04430084
     END;                                                               04440084
                                                                        04450084
     CALL RCBC53M_RECEIVE_MAP;                                          04460084
                                                                        04470084
     IF (RCBM53I.TYPEI   = WRK_PRODUCT_TYPE                             04480084
       & RCBM53I.ORIGINI = WRK_ORIGIN                                   04490084
       & RCBM53I.SEQNOI  = WRK_SEQUENCE_NUMBER)                         04500084
      | RCBM53I.ACTIONI  = '1' THEN                                     04510084
     DO;                                                                04520084
       PF5_FLAG = TRUE;                                                 04530084
       CALL RCBC53M_ACTION_PROCESS;                                     04540084
     END;                                                               04550084
     ELSE DO;                                                           04560084
       CALL RCBC53M_VALIDATE_MAP;                                       04570084
       CALL RCBC53M_GET_CONTRACT;                                       04580084
       CALL RCBC53M_SEND_MAP;                                           04590084
     END;                                                               04600084
   END;                                                                 04610084
                                                                        04620084
   WHEN (DFHPF7,DFHPF19)                                                04630084
   DO;                                                                  04640084
     IF  HEADER.REQUEST_ID = '' THEN                                    04650084
     DO;                                                                04660084
       CALL RCBC53M_RECEIVE_MAP;                                        04670084
       RCBM53O.MSG_LINEO = ERR_O004;                                    04680084
       RCBM53I.ACTIONL   = -1;                                          04690084
       CALL RCBC53M_SEND_MAP_CSR;                                       04700084
     END;                                                               04710084
                                                                        04720084
     IF TS_CNT = 0 THEN                                                 04730084
     DO;                                                                04740084
       CALL RCBC53M_CLEAR_MAPA;                                         04750084
       RCBM53AO.MSG_LINEO = ERR_O032;                                   04760084
       RCBM53AI.SELL(1) = -1;                                           04770084
       CALL RCBC53M_SEND_MAPA_CSR;                                      04780084
     END;                                                               04790084
                                                                        04800084
     IF L - 16 < 0 THEN                                                 04810084
     DO;                                                                04820084
       J = 0;                                                           04830084
       RCBM53AO.MSG_LINEO = ERR_O030;                                   04840084
       CALL RCBC53M_FILL_MAPA;                                          04850084
       RCBM53AI.SELL(1) = -1;                                           04860084
       CALL RCBC53M_SEND_MAPA_CSR;                                      04870084
     END;                                                               04880084
     ELSE DO;                                                           04890084
       J = L - 16;                                                      04900084
       CALL RCBC53M_FILL_MAPA;                                          04910084
       RCBM53AI.SELL(1) = -1;                                           04920084
       CALL RCBC53M_SEND_MAPA_CSR;                                      04930084
     END;                                                               04940084
   END;                                                                 04950084
                                                                        04960084
   WHEN (DFHPF8,DFHPF20)                                                04970084
   DO;                                                                  04980084
     IF  HEADER.REQUEST_ID = '' THEN                                    04990084
     DO;                                                                05000084
       CALL RCBC53M_RECEIVE_MAP;                                        05010084
       RCBM53O.MSG_LINEO = ERR_O004;                                    05020084
       RCBM53I.ACTIONL   = -1;                                          05030084
       CALL RCBC53M_SEND_MAP_CSR;                                       05040084
     END;                                                               05050084
                                                                        05060084
     IF TS_CNT = 0 THEN                                                 05070084
     DO;                                                                05080084
       CALL RCBC53M_CLEAR_MAPA;                                         05090084
       RCBM53AO.MSG_LINEO = ERR_O032;                                   05100084
       RCBM53AI.SELL(1) = -1;                                           05110084
       CALL RCBC53M_SEND_MAPA_CSR;                                      05120084
     END;                                                               05130084
                                                                        05140084
     IF J >= TS_CNT THEN                                                05150084
     DO;                                                                05160084
       J = J - K;                                                       05170084
       RCBM53AO.MSG_LINEO = ERR_O031;                                   05180084
       CALL RCBC53M_FILL_MAPA;                                          05190084
       RCBM53AI.SELL(1) = -1;                                           05200084
       CALL RCBC53M_SEND_MAPA_CSR;                                      05210084
     END;                                                               05220084
                                                                        05230084
     CALL RCBC53M_FILL_MAPA;                                            05240084
     RCBM53AI.SELL(1) = -1;                                             05250084
     CALL RCBC53M_SEND_MAPA_CSR;                                        05260084
   END;                                                                 05270084
                                                                        05280084
   WHEN (DFHPF9,DFHPF21)                                                05290084
   DO;                                                                  05300084
     IF  HEADER.REQUEST_ID = '' THEN                                    05310084
     DO;                                                                05320084
       CALL RCBC53M_RECEIVE_MAP;                                        05330084
       RCBM53O.MSG_LINEO = ERR_O004;                                    05340084
       RCBM53I.ACTIONL   = -1;                                          05350084
       CALL RCBC53M_SEND_MAP_CSR;                                       05360084
     END;                                                               05370084
                                                                        05380084
     IF  HEADER.REQUEST_ID = 'A' THEN                                   05390084
     DO;                                                                05400084
       IF O = 0                                                         05410084
        & TS_CNT > 15 THEN                                              05420084
       DO;                                                              05430084
         O = 1;                                                         05440084
         J = TS_CNT - 15;                                               05450084
         IF J < 1 THEN J = 1;                                           05460084
         CALL RCBC53M_FILL_MAPA;                                        05470084
         RCBM53AI.SELL(1) = -1;                                         05480084
         CALL RCBC53M_SEND_MAPA_CSR;                                    05490084
       END;                                                             05500084
                                                                        05510084
       O = 0;                                                           05520084
       J = 0;                                                           05530084
       CALL RCBC53M_FILL_MAPA;                                          05540084
       RCBM53AI.SELL(1) = -1;                                           05550084
       CALL RCBC53M_SEND_MAPA_CSR;                                      05560084
     END;                                                               05570084
   END;                                                                 05580084
                                                                        05590084
   WHEN (DFHENTER)                                                      05600084
   DO;                                                                  05610084
     IF  HEADER.REQUEST_ID = 'A' THEN                                   05620084
     DO;                                                                05630084
       CALL RCBC53M_RECEIVE_MAPA;                                       05640084
                                                                        05650084
       IF RCBM53AI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER                05660084
        | RCBM53AI.TYPE_SELI       ¬= TYPE_SEL                          05670084
        | RCBM53AI.ORIGIN_SELI     ¬= ORIGIN_SEL                        05680084
        | RCBM53AI.SEQ_SELI        ¬= SEQ_SEL THEN                      05690084
       DO;                                                              05700084
         T241_UPD_FLAG  = FALSE;                                        05710084
         CALL RCBC53M_VALIDATE_MAPA;                                    05720084
         CALL RCBC53M_GET_SELECTION;                                    05730084
         CALL RCBC53M_FILL_MAPA;                                        05740084
         RCBM53AI.SELL(1)   = -1;                                       05750084
         CALL RCBC53M_SEND_MAPA_CSR;                                    05760084
       END;                                                             05770084
       CALL RCBC53M_CHECK_MAPA;                                         05780084
       CALL RCBC53M_GET_CONTRACT;                                       05790084
       CALL RCBC53M_SEND_MAP;                                           05800084
     END;                                                               05810084
                                                                        05820084
     CALL RCBC53M_RECEIVE_MAP;                                          05830084
     IF (RCBM53I.TYPEI   = WRK_PRODUCT_TYPE                             05840084
       & RCBM53I.ORIGINI = WRK_ORIGIN                                   05850084
       & RCBM53I.SEQNOI  = WRK_SEQUENCE_NUMBER)                         05860084
      | RCBM53I.ACTIONI  = '1' THEN                                     05870084
     DO;                                                                05880084
       CALL RCBC53M_ACTION_PROCESS;                                     05890084
     END;                                                               05900084
                                                                        05910084
     CALL RCBC53M_VALIDATE_MAP;                                         05920084
     CALL RCBC53M_GET_CONTRACT;                                         05930084
     CALL RCBC53M_SEND_MAP;                                             05940084
   END;                                                                 05950084
                                                                        05960084
   WHEN (DFHCLEAR)                                                      05970084
     DO;                                                                05980084
       EXEC CICS SEND                                                   05990084
          CONTROL                                                       06000084
          ERASE                                                         06010084
          FREEKB;                                                       06020084
       EXEC CICS RETURN;                                                06030084
     END;                                                               06040084
                                                                        06050084
   OTHERWISE                        /* INVALID KEY ENTERED */           06060084
   DO;                                                                  06070084
     IF HEADER.REQUEST_ID = 'A' THEN                                    06080084
     DO;                                                                06090084
       IF TS_CNT = 0 THEN                                               06100084
       DO;                                                              06110084
         CALL RCBC53M_CLEAR_MAPA;                                       06120084
         RCBM53AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                 06130084
         RCBM53AO.MSG_LINEO = ERR_O004;                                 06140084
         RCBM53AI.TYPE_SELL = -1;                                       06150084
         CALL RCBC53M_SEND_MAPA_CSR;                                    06160084
       END;                                                             06170084
       J = J - K;                                                       06180084
       CALL RCBC53M_FILL_MAPA;                                          06190084
       RCBM53AO.MSG_LINEO = ERR_O004;                                   06200084
       RCBM53AI.SELL(1)   = -1;                                         06210084
       CALL RCBC53M_SEND_MAPA_CSR;                                      06220084
     END;                                                               06230084
                                                                        06240084
     CALL RCBC53M_RECEIVE_MAP;                                          06250084
     RCBM53O.MSG_LINEO = ERR_O004;                                      06260084
     RCBM53I.ACTIONL   = -1;                                            06270084
     CALL RCBC53M_SEND_MAP_CSR;                                         06280084
   END;                                                                 06290084
                                                                        06300084
 END;                                                                   06310084
1/********************************************************************/ 06320084
 /*      RECEIVE MAP RCBM53                                          */ 06330084
 /********************************************************************/ 06340084
0RCBC53M_RECEIVE_MAP: PROC;                                             06350084
                                                                        06360084
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      06370084
    MAP('RCBM53')                                                       06380084
    MAPSET('RCBM53')                                                    06390084
    RESP(RESPONSE)                                                      06400084
    RESP2(CODE_EXPLAIN);                                                06410084
                                                                        06420084
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      06430084
   WHEN(DFHRESP(NORMAL));                                               06440084
                                                                        06450084
   OTHERWISE                                                            06460084
   DO;                                                                  06470084
     RCBM53O.MSG_LINEO = ERR_MESSAGE3;                                  06480084
     CALL RCBC53M_SEND_MAP;                                             06490084
   END;                                                                 06500084
 END;                                                                   06510084
                                                                        06520084
0END RCBC53M_RECEIVE_MAP;                                               06530084
1/********************************************************************/ 06540084
 /*      RECEIVE MAP RCBM53A                                         */ 06550084
 /********************************************************************/ 06560084
0RCBC53M_RECEIVE_MAPA: PROC;                                            06570084
                                                                        06580084
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      06590084
    MAP('RCBM53A')                                                      06600084
    MAPSET('RCBM53')                                                    06610084
    RESP(RESPONSE)                                                      06620084
    RESP2(CODE_EXPLAIN);                                                06630084
                                                                        06640084
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      06650084
   WHEN(DFHRESP(NORMAL));                                               06660084
                                                                        06670084
   OTHERWISE                                                            06680084
   DO;                                                                  06690084
     RCBM53AO.MSG_LINEO = ERR_MESSAGE3;                                 06700084
     CALL RCBC53M_SEND_MAP;                                             06710084
   END;                                                                 06720084
 END;                                                                   06730084
                                                                        06740084
0END RCBC53M_RECEIVE_MAPA;                                              06750084
1/********************************************************************/ 06760084
 /*      FILL MAP FROM WORK FIELDS                                   */ 06770084
 /********************************************************************/ 06780084
0RCBC53M_FILL_MAP: PROC;                                                06790084
                                                                        06800084
 RCBM53O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                      06810084
 RCBM53O.ACTIONO             = WRK_ACTION;                              06820084
 RCBM53O.TYPEO               = WRK_PRODUCT_TYPE;                        06830084
 RCBM53O.ORIGINO             = WRK_ORIGIN;                              06840084
 RCBM53O.SEQNOO              = WRK_SEQUENCE_NUMBER;                     06850084
 RCBM53O.CONTRACT_NUMBERO    = WRK_CONTRACT_NUMBER;                     06860084
 RCBM53O.HVP_QUANTITYO       = WRK_HVP_QUANTITY;                        06870084
 RCBM53O.EFFECTIVE_DATEO     = WRK_EFFECTIVE_DATE;                      06880084
 RCBM53O.END_DATEO           = WRK_END_DATE;                            06890084
 RCBM53O.SERVICE_TYPEO       = WRK_SERVICE_TYPE;                        06900084
 RCBM53O.SERVICE_MODULEO     = WRK_SERVICE_MODULE;                      06910084
 RCBM53O.SERVICE_LVL_CODEO   = WRK_SERVICE_LVL_CODE;                    06920084
 RCBM53O.AUTHORISATION_CODEO = WRK_AUTHORISATION_CODE;                  06930084
 RCBM53O.COVERAGE_START_1O   = WRK_COVERAGE_START_1;                    06940084
 RCBM53O.COVERAGE_END_1O     = WRK_COVERAGE_END_1;                      06950084
 RCBM53O.COVERAGE_START_2O   = WRK_COVERAGE_START_2;                    06960084
 RCBM53O.COVERAGE_END_2O     = WRK_COVERAGE_END_2;                      06970084
 RCBM53O.COVERAGE_START_3O   = WRK_COVERAGE_START_3;                    06980084
 RCBM53O.COVERAGE_END_3O     = WRK_COVERAGE_END_3;                      06990084
 RCBM53O.COVERAGE_START_4O   = WRK_COVERAGE_START_4;                    07000084
 RCBM53O.COVERAGE_END_4O     = WRK_COVERAGE_END_4;                      07010084
 RCBM53O.COVERAGE_START_5O   = WRK_COVERAGE_START_5;                    07020084
 RCBM53O.COVERAGE_END_5O     = WRK_COVERAGE_END_5;                      07030084
 RCBM53O.COVERAGE_START_6O   = WRK_COVERAGE_START_6;                    07040084
 RCBM53O.COVERAGE_END_6O     = WRK_COVERAGE_END_6;                      07050084
 RCBM53O.COVERAGE_START_7O   = WRK_COVERAGE_START_7;                    07060084
 RCBM53O.COVERAGE_END_7O     = WRK_COVERAGE_END_7;                      07070084
                                                                        07080084
0END RCBC53M_FILL_MAP;                                                  07090084
1/********************************************************************/ 07100084
 /*      FILL MAP RCBM53A                                            */ 07110084
 /********************************************************************/ 07120084
0RCBC53M_FILL_MAPA: PROC;                                               07130084
                                                                        07140084
 CALL RCBC53M_CLEAR_MAPA;                                               07150084
                                                                        07160084
 K = 0;                                                                 07170084
 PIC_CNT          = J + 1;                                              07180084
 IF PIC_CNT = 0 THEN PIC_CNT = 1;                                       07190084
                                                                        07200084
 RCBM53AO.INCNTO  = PIC_CNT;                                            07210084
 L                = PIC_CNT;                                            07220084
 PIC_CNT          = TS_CNT;                                             07230084
 RCBM53AO.TOTCNTO = PIC_CNT;                                            07240084
                                                                        07250084
 DO I = 1 TO 15;                                                        07260084
   RCBM53AO.SELA(I) = DFHBMPRF;                                         07270084
 END;                                                                   07280084
                                                                        07290084
 TS_Q = 'RC00' || EIBTRMID;                                             07300084
                                                                        07310084
 DO I = 1 TO 15;                                                        07320084
                                                                        07330084
   IF J <= TS_CNT                                                       07340084
    & TS_CNT ¬= 0 THEN                                                  07350084
   DO;                                                                  07360084
     J = J + 1;     /* NUMBER OF LINES DISPLAYED */                     07370084
     K = K + 1;     /* NUMBER OF LINES DISPLAYED ON CURRENT SCREEN */   07380084
     EXEC CICS READQ TS QUEUE(TS_Q) INTO(TS_REC) ITEM(J);               07390084
     RCBM53AO.SELA(I)             = DFHBMUNP;                           07400084
     RCBM53AO.PRODUCT_TYPEO(I)    = TS_REC.TYPE;                        07410084
     RCBM53AO.ORIGINO(I)          = TS_REC.ORIGIN;                      07420084
     RCBM53AO.SEQUENCE_NUMBERO(I) = TS_REC.SEQNO;                       07430084
     RCBM53AO.EFFECTIVE_DATEO(I)  = TS_REC.EFFDATE;                     07440084
     RCBM53AO.END_DATEO(I)        = TS_REC.ENDDATE;                     07450084
     RCBM53AO.CONTRACT_NUMBERO(I) = TS_REC.CONTNO;                      07460084
     RCBM53AO.CUSTOMER_NUMBERO(I) = TS_REC.CUSNUM;        /* RB01289 */ 07470084
   END;                                                                 07480084
                                                                        07490084
   IF J >= TS_CNT THEN                                                  07500084
     I = 16;                                                            07510084
 END;                                                                   07520084
                                                                        07530084
 CALL RCBC53M_SET_MAPA;                                                 07540084
                                                                        07550084
0END RCBC53M_FILL_MAPA;                                                 07560084
1/********************************************************************/ 07570084
 /*      VALIDATE MAP RCBM53A                                        */ 07580084
 /********************************************************************/ 07590084
0RCBC53M_VALIDATE_MAPA: PROC;                                           07600084
                                                                        07610084
 TYPE_ENT   = 'N';                                                      07620084
 ORIGIN_ENT = 'N';                                                      07630084
 SEQ_ENT    = 'N';                                                      07640084
 TYPE_SEL   = '';                                                       07650084
 ORIGIN_SEL = '';                                                       07660084
 SEQ_SEL    = '';                                                       07670084
                                                                        07680084
 IF RCBM53AI.TYPE_SELL   = 0 THEN                                       07690084
   RCBM53AO.TYPE_SELO    = '';                                          07700084
 IF RCBM53AI.ORIGIN_SELL = 0 THEN                                       07710084
   RCBM53AO.ORIGIN_SELO  = '';                                          07720084
 IF RCBM53AI.SEQ_SELL    = 0 THEN                                       07730084
   RCBM53AO.SEQ_SELO     = '';                                          07740084
                                                                        07750084
 IF WRK_COUNTRY_NUMBER ¬= RCBM53AI.COUNTRY_NUMBERI THEN                 07760084
 DO;                                                                    07770084
 /*SEL_OPT = '10';                        /* SOC CEDS00000366 */        07780084
   SEL_OPT = '11';                        /* EOC CEDS00000366 */        07790084
   WRK_COUNTRY_NUMBER = RCBM53AI.COUNTRY_NUMBERI;                       07800084
                                                                        07810084
   EXEC CICS LINK                                                       07820084
      PROGRAM('RCBC99P')                                                07830084
      COMMAREA(COMMAREA)                                                07840084
      LENGTH(CSTG(COMMAREA));                                           07850084
                                                                        07860084
   IF CTY_OK_FLAG = FALSE THEN                                          07870084
   DO;                                                                  07880084
     RCBM53AO.MSG_LINEO      = ERR_O072;                                07890084
     RCBM53AI.COUNTRY_NUMBERL = -1;                                     07900084
     RCBM53AO.COUNTRY_NUMBERC = DFHRED;                                 07910084
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      07920084
     CALL RCBC53M_CLEAR_MAPA_2;                                         07930084
     CALL RCBC53M_SEND_MAPA_CSR;                                        07940084
   END;                                                                 07950084
                                                                        07960084
   IF OK_FLAG = FALSE THEN                                              07970084
   DO;                                                                  07980084
     RCBM53AO.MSG_LINEO       = ERR_O057;                               07990084
     RCBM53AI.COUNTRY_NUMBERL = -1;                                     08000084
     RCBM53AO.COUNTRY_NUMBERC = DFHRED;                                 08010084
     WRK_COUNTRY_NUMBER       = '001';                                  08020084
     CALL RCBC53M_CLEAR_MAPA_2;                                         08030084
     CALL RCBC53M_SEND_MAPA_CSR;                                        08040084
   END;                                                                 08050084
                                                                        08060084
   IF RCB025_FLAG = FALSE THEN                                          08070084
   DO;                                                                  08080084
     RCBM53AO.MSG_LINEO =                                               08090084
                     'Parameter RCB025 is missing for this country';    08100084
     RCBM53AO.COUNTRY_NUMBERC = DFHRED;                                 08110084
     RCBM53AI.COUNTRY_NUMBERL = -1;                                     08120084
     WRK_COUNTRY_NUMBER       = '001';                                  08130084
     CALL RCBC53M_CLEAR_MAPA_2;                                         08140084
     CALL RCBC53M_SEND_MAPA_CSR;                                        08150084
   END;                                                                 08160084
                                                                        08170084
   IF RCB098_FLAG = FALSE THEN                                          08180084
   DO;                                                                  08190084
     RCBM53AO.MSG_LINEO =                                               08200084
                     'Parameter RCB098 is missing for this country';    08210084
     RCBM53AO.COUNTRY_NUMBERC = DFHRED;                                 08220084
     RCBM53AI.COUNTRY_NUMBERL = -1;                                     08230084
     WRK_COUNTRY_NUMBER       = '001';                                  08240084
     CALL RCBC53M_CLEAR_MAPA_2;                                         08250084
     CALL RCBC53M_SEND_MAPA_CSR;                                        08260084
   END;                                                                 08270084
                                                                        08280084
   IF ASCA_STOP_FLAG = TRUE THEN                                        08290084
   DO;                                                                  08300084
     RCBM53AO.MSG_LINEO       = ERR_O079;                               08310084
     RCBM53AO.COUNTRY_NUMBERC = DFHRED;                                 08320084
     RCBM53AI.COUNTRY_NUMBERL = -1;                                     08330084
     WRK_COUNTRY_NUMBER       = '001';                                  08340084
     CALL RCBC53M_CLEAR_MAPA_2;                                         08350084
     CALL RCBC53M_SEND_MAPA_CSR;                                        08360084
   END;                                                                 08370084
                                                                        08380084
   WRK_COUNTRY_NUMBER = RCBM53AI.COUNTRY_NUMBERI;                       08390084
 END;                                                                   08400084
                                                                        08410084
 IF RCBM53AI.TYPE_SELI ¬= '' THEN                                       08420084
 DO;                                                                    08430084
   TYPE_SEL = RCBM53AI.TYPE_SELI;                                       08440084
   TYPE_ENT = 'Y';                                                      08450084
 END;                                                                   08460084
                                                                        08470084
 IF RCBM53AI.ORIGIN_SELI ¬= '' THEN                                     08480084
 DO;                                                                    08490084
   ORIGIN_SEL = RCBM53AI.ORIGIN_SELI;                                   08500084
   ORIGIN_ENT = 'Y';                                                    08510084
 END;                                                                   08520084
                                                                        08530084
 IF RCBM53AI.SEQ_SELI ¬= '' THEN                                        08540084
 DO;                                                                    08550084
   SEQ_SEL = RCBM53AI.SEQ_SELI;                                         08560084
   SEQ_ENT = 'Y';                                                       08570084
 END;                                                                   08580084
                                                                        08590084
0END RCBC53M_VALIDATE_MAPA;                                             08600084
1/********************************************************************/ 08610084
 /*      SET MAP RCBM53A                                             */ 08620084
 /********************************************************************/ 08630084
0RCBC53M_SET_MAPA: PROC;                                                08640084
                                                                        08650084
 RCBM53AO.TYPE_SELO   = TYPE_SEL;                                       08660084
 RCBM53AO.ORIGIN_SELO = ORIGIN_SEL;                                     08670084
 RCBM53AO.SEQ_SELO    = SEQ_SEL;                                        08680084
                                                                        08690084
0END RCBC53M_SET_MAPA;                                                  08700084
1/********************************************************************/ 08710084
 /*      CHECK MAP RCBM53A                                           */ 08720084
 /********************************************************************/ 08730084
0RCBC53M_CHECK_MAPA: PROC;                                              08740084
                                                                        08750084
 M = 0;                                                                 08760084
 DO I = 1 TO 15;                                                        08770084
   IF RCBM53AO.SELO(I) = 'S' THEN                                       08780084
   DO;                                                                  08790084
     WRK_PRODUCT_TYPE    = RCBM53AI.PRODUCT_TYPEI(I);                   08800084
     WRK_ORIGIN          = RCBM53AI.ORIGINI(I);                         08810084
     WRK_SEQUENCE_NUMBER = RCBM53AI.SEQUENCE_NUMBERI(I);                08820084
     ORI_EFFECTIVE_DATE  = RCBM53AI.EFFECTIVE_DATEI(I);                 08830084
     RCBM53AO.SELO(I)    = '';                                          08840084
     M = 1;                                                             08850084
   END;                                                                 08860084
 END;                                                                   08870084
                                                                        08880084
 IF M = 0 THEN                                                          08890084
 DO;                                                                    08900084
   RCBM53AI.SELL(1)   = -1;                                             08910084
   RCBM53AO.MSG_LINEO = ERR_O032;                                       08920084
   CALL RCBC53M_SEND_MAPA_CSR;                                          08930084
 END;                                                                   08940084
                                                                        08950084
0END RCBC53M_CHECK_MAPA;                                                08960084
1/********************************************************************/ 08970084
 /*      GET CONTRACT SELECTION                                      */ 08980084
 /********************************************************************/ 08990084
0RCBC53M_GET_SELECTION: PROC;                                           09000084
                                                                        09010084
 CALL RCBC53M_COUNT_T241;                                               09020084
 IF WRK_REC_COUNT > 32767 THEN                                          09030084
 DO;                                                                    09040084
   RCBM53AO.MSG_LINEO =                                                 09050084
   'Please refine search criteria, too many rows retrieved';            09060084
   CALL RCBC53M_SEND_MAPA;                                              09070084
 END;                                                                   09080084
                                                                        09090084
 TS_Q = 'RC00' || EIBTRMID;                                             09100084
                                                                        09110084
 EXEC CICS IGNORE CONDITION QIDERR;                                     09120084
                                                                        09130084
 EXEC CICS DELETEQ TS QUEUE(TS_Q);                                      09140084
                                                                        09150084
 EXEC CICS HANDLE CONDITION QIDERR;                                     09160084
                                                                        09170084
 OK_FLAG = TRUE;                                                        09180084
 TS_CNT  = 0;                                                           09190084
 J       = 0;                                                           09200084
 L       = 1;                                                           09210084
 RCBM53AO.INCNTO  = '';                                                 09220084
 RCBM53AO.TOTCNTO = '';                                                 09230084
                                                                        09240084
 EXEC SQL  OPEN C_241;                                                  09250084
                                                                        09260084
 SELECT(SQLCA.SQLCODE);                                                 09270084
   WHEN(0);                                                             09280084
   OTHERWISE                                                            09290084
   DO;                                                                  09300084
     RCBM53AO.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';  09310084
     CALL RCBC53M_SEND_MAPA;                                            09320084
   END;                                                                 09330084
 END;                                                                   09340084
                                                                        09350084
 DO WHILE (OK_FLAG = TRUE);                                             09360084
   TS_REC = '';                                                         09370084
   EXEC SQL  FETCH C_241                                                09380084
             INTO :TS_REC.TYPE                                          09390084
                 ,:TS_REC.ORIGIN                                        09400084
                 ,:TS_REC.SEQNO                                         09410084
                 ,:TS_REC.CONTNO   :NUL241F                             09420084
                 ,:TS_REC.EFFDATE                                       09430084
                 ,:TS_REC.ENDDATE                                       09440084
                 ,:TS_REC.CUSNUM   :NUL2416 ;           /* RB01289   */ 09450084
                                                                        09460084
     IF (SQLCA.SQLCODE = 0) THEN                                        09470084
     DO;                                                                09480084
       IF NUL241F = -1 THEN                                             09490084
         TS_REC.CONTNO = '';                                            09500084
       IF NUL2416 = -1 THEN                             /* RB01289   */ 09510084
         TS_REC.CUSNUM = '';                            /* RB01289   */ 09520084
       EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                    09530084
       TS_CNT = TS_CNT + 1;                                             09540084
     END;                                                               09550084
                                                                        09560084
     IF (SQLCA.SQLCODE ¬= 0) THEN                                       09570084
     DO;                                                                09580084
       OK_FLAG = FALSE;                                                 09590084
     END;                                                               09600084
   END;                                                                 09610084
                                                                        09620084
 IF TS_CNT = 0 THEN                                                     09630084
 DO;                                                                    09640084
   CALL RCBC53M_CLEAR_MAPA;                                             09650084
   CALL RCBC53M_SET_MAPA;                                               09660084
                                                                        09670084
   RCBM53AI.TYPE_SELL = -1;                                             09680084
                                                 /* SOC CEDS00000385 */ 09690084
 /*RCBM53AO.MSG_LINEO = 'No records found for this seqrch criteria'; */ 09700084
   RCBM53AO.MSG_LINEO = 'No records found for this search criteria';    09710084
                                                 /* EOC CEDS00000385 */ 09720084
   CALL RCBC53M_SEND_MAPA_CSR;                                          09730084
 END;                                                                   09740084
                                                                        09750084
0END RCBC53M_GET_SELECTION;                                             09760084
1/********************************************************************/ 09770084
 /*      VALIDATE MAP                                                */ 09780084
 /********************************************************************/ 09790084
0RCBC53M_VALIDATE_MAP: PROC;                                            09800084
                                                                        09810084
 PF5_FLAG = FALSE;                                                      09820084
                                                                        09830084
 IF WRK_ACTION = ''                                                     09840084
  & VERIFY(RCBM53I.ACTIONI,' 123') ¬= 0 THEN                            09850084
 DO;                                                                    09860084
   RCBM53O.MSG_LINEO = ERR_O127;                                        09870084
   RCBM53O.ACTIONC   = DFHRED;                                          09880084
   RCBM53I.ACTIONL   = -1;                                              09890084
   CALL RCBC53M_SEND_MAP_CSR;                                           09900084
 END;                                                                   09910084
                                                                        09920084
 WRK_ACTION = RCBM53I.ACTIONI;                                          09930084
                                                                        09940084
 IF WRK_PRODUCT_TYPE    = ''                                            09950084
  & WRK_ORIGIN          = ''                                            09960084
  & WRK_SEQUENCE_NUMBER = ''                                            09970084
  & RCBM53I.TYPEI       = ''                                            09980084
  & RCBM53I.ORIGINI     = ''                                            09990084
  & RCBM53I.SEQNOI      = '' THEN                                       10000084
 DO;                                                                    10010084
   WRK_PRODUCT_TYPE    = '';                                            10020084
   WRK_ORIGIN          = '';                                            10030084
   WRK_SEQUENCE_NUMBER = '';                                            10040084
   RCBM53O.MSG_LINEO   = ERR_O117;                                      10050084
   RCBM53O.TYPEC       = DFHRED;                                        10060084
   RCBM53O.ORIGINC     = DFHRED;                                        10070084
   RCBM53O.SEQNOC      = DFHRED;                                        10080084
   RCBM53I.TYPEL       = -1;                                            10090084
   CALL RCBC53M_SEND_MAP_CSR;                                           10100084
 END;                                                                   10110084
                                                                        10120084
 IF VERIFY(RCBM53I.TYPEI, ALPHANUM) ¬= 0 THEN                           10130084
 DO;                                                                    10140084
   RCBM53O.MSG_LINEO = ERR_O005;                                        10150084
   RCBM53O.TYPEC     = DFHRED;                                          10160084
   RCBM53I.TYPEL     = -1;                                              10170084
   CALL RCBC53M_SEND_MAP_CSR;                                           10180084
 END;                                                                   10190084
                                                                        10200084
 WRK_PRODUCT_TYPE = RCBM53I.TYPEI;                                      10210084
                                                                        10220084
 IF VERIFY(RCBM53I.ORIGINI, ALPHANUM) ¬= 0 THEN                         10230084
 DO;                                                                    10240084
   RCBM53O.MSG_LINEO = ERR_O005;                                        10250084
   RCBM53O.ORIGINC   = DFHRED;                                          10260084
   RCBM53I.ORIGINL   = -1;                                              10270084
   CALL RCBC53M_SEND_MAP_CSR;                                           10280084
 END;                                                                   10290084
                                                                        10300084
 WRK_ORIGIN = RCBM53I.ORIGINI;                                          10310084
                                                                        10320084
 IF VERIFY(RCBM53I.SEQNOI, ALPHANUM) ¬= 0 THEN                          10330084
 DO;                                                                    10340084
   RCBM53O.MSG_LINEO = ERR_O005;                                        10350084
   RCBM53O.SEQNOC    = DFHRED;                                          10360084
   RCBM53I.SEQNOL    = -1;                                              10370084
   CALL RCBC53M_SEND_MAP_CSR;                                           10380084
 END;                                                                   10390084
                                                                        10400084
 WRK_SEQUENCE_NUMBER = RCBM53I.SEQNOI;                                  10410084
                                                                        10420084
 IF WRK_EFFECTIVE_DATE      = ''                                        10430084
  & RCBM53I.EFFECTIVE_DATEI = '' THEN                                   10440084
 DO;                                                                    10450084
   RCBM53O.MSG_LINEO       = ERR_O117;                                  10460084
   RCBM53O.EFFECTIVE_DATEC = DFHRED;                                    10470084
   RCBM53I.EFFECTIVE_DATEL = -1;                                        10480084
   CALL RCBC53M_SEND_MAP_CSR;                                           10490084
 END;                                                                   10500084
                                                                        10510084
 WRK_EFFECTIVE_DATE  = RCBM53I.EFFECTIVE_DATEI;                         10520084
                                                                        10530084
0END RCBC53M_VALIDATE_MAP;                                              10540084
1/********************************************************************/ 10550084
 /*      GET CONTRACT DETAILS                                        */ 10560084
 /********************************************************************/ 10570084
0RCBC53M_GET_CONTRACT: PROC;                                            10580084
                                                                        10590084
 EXEC SQL                                                               10600084
   SELECT HVP_QUANTITY                                                  10610084
         ,CONTRACT_NUMBER                                               10620084
         ,SERVICE_MODULE_1                                              10630084
         ,SERVICE_MODULE_2                                              10640084
         ,SERVICE_MODULE_3                                              10650084
         ,SERVICE_MODULE_4                                              10660084
         ,SERVICE_MODULE_5                                              10670084
         ,COVERAGE_START_1                                              10680084
         ,COVERAGE_END_1                                                10690084
         ,COVERAGE_START_2                                              10700084
         ,COVERAGE_END_2                                                10710084
         ,COVERAGE_START_3                                              10720084
         ,COVERAGE_END_3                                                10730084
         ,COVERAGE_START_4                                              10740084
         ,COVERAGE_END_4                                                10750084
         ,COVERAGE_START_5                                              10760084
         ,COVERAGE_END_5                                                10770084
         ,COVERAGE_START_6                                              10780084
         ,COVERAGE_END_6                                                10790084
         ,COVERAGE_START_7                                              10800084
         ,COVERAGE_END_7                                                10810084
         ,SERVICE_TYPE                                                  10820084
         ,SERVICE_LVL_CODE                                              10830084
         ,AUTHORISATION_CODE                                            10840084
         ,SOURCE_INDICATOR                                              10850084
         ,EFFECTIVE_DATE                                                10860084
         ,END_DATE                                                      10870084
   INTO :WRK_HVP_QTY_FD          :NUL241E                               10880084
       ,:WRK_CONTRACT_NUMBER     :NUL241F                               10890084
       ,:WRK_SM1                 :NUL241G                               10900084
       ,:WRK_SM2                 :NUL241H                               10910084
       ,:WRK_SM3                 :NUL241I                               10920084
       ,:WRK_SM4                 :NUL241J                               10930084
       ,:WRK_SM5                 :NUL241K                               10940084
       ,:WRK_COVERAGE_START_1    :NUL241L                               10950084
       ,:WRK_COVERAGE_END_1      :NUL241M                               10960084
       ,:WRK_COVERAGE_START_2    :NUL241N                               10970084
       ,:WRK_COVERAGE_END_2      :NUL241O                               10980084
       ,:WRK_COVERAGE_START_3    :NUL241P                               10990084
       ,:WRK_COVERAGE_END_3      :NUL241Q                               11000084
       ,:WRK_COVERAGE_START_4    :NUL241R                               11010084
       ,:WRK_COVERAGE_END_4      :NUL241S                               11020084
       ,:WRK_COVERAGE_START_5    :NUL241T                               11030084
       ,:WRK_COVERAGE_END_5      :NUL241U                               11040084
       ,:WRK_COVERAGE_START_6    :NUL241V                               11050084
       ,:WRK_COVERAGE_END_6      :NUL241W                               11060084
       ,:WRK_COVERAGE_START_7    :NUL241X                               11070084
       ,:WRK_COVERAGE_END_7      :NUL241Y                               11080084
       ,:WRK_SERVICE_TYPE        :NUL241Z                               11090084
       ,:WRK_SERVICE_LVL_CODE    :NUL2410                               11100084
       ,:WRK_AUTHORISATION_CODE  :NUL2411                               11110084
       ,:WRK_SOURCE_INDICATOR    :NUL2412                               11120084
       ,:WRK_EFFECTIVE_DATE      :NUL2414                               11130084
       ,:WRK_END_DATE            :NUL2415                               11140084
   FROM RCBV0241_PI_CTR                                                 11150084
   WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                       11160084
     AND PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                         11170084
     AND ORIGIN             = :WRK_ORIGIN                               11180084
     AND SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER                      11190084
     AND EFFECTIVE_DATE     = :ORI_EFFECTIVE_DATE;                      11200084
                                                                        11210084
 SELECT(SQLCA.SQLCODE);                                                 11220084
   WHEN(0)                                                              11230084
   DO;                                                                  11240084
     IF WRK_ACTION = '1' THEN                                           11250084
     DO;                                                                11260084
       RCBM53O.MSG_LINEO = ERR_O119;                                    11270084
       RCBM53O.TYPEC     = DFHRED;                                      11280084
       RCBM53O.ORIGINC   = DFHRED;                                      11290084
       RCBM53O.SEQNOC    = DFHRED;                                      11300084
       RCBM53I.TYPEL     = -1;                                          11310084
       CALL RCBC53M_SEND_MAP_CSR;                                       11320084
     END;                                                               11330084
                                                                        11340084
     IF NUL241E ¬= -1 THEN                                              11350084
       WRK_HVP_QUANTITY      = WRK_HVP_QTY_FD;                          11360084
     ELSE DO;                                                           11370084
       RCBM53O.HVP_QUANTITYO = WRK_HVP_QUANTITY;                        11380084
       RCBM53O.HVP_QUANTITYO = '';                                      11390084
       WRK_HVP_QUANTITY      = '';                                      11400084
     END;                                                               11410084
                                                                        11420084
     IF NUL241F ¬= -1 THEN                                              11430084
       RCBM53O.CONTRACT_NUMBERO = WRK_CONTRACT_NUMBER;                  11440084
     ELSE DO;                                                           11450084
       RCBM53O.CONTRACT_NUMBERO = '';                                   11460084
       WRK_CONTRACT_NUMBER      = '';                                   11470084
     END;                                                               11480084
                                                                        11490084
     IF NUL241G = -1 THEN                                               11500084
     DO;                                                                11510084
       WRK_SM1 = '';                                                    11520084
     END;                                                               11530084
                                                                        11540084
     IF NUL241H = -1 THEN                                               11550084
     DO;                                                                11560084
       WRK_SM2 = '';                                                    11570084
     END;                                                               11580084
                                                                        11590084
     IF NUL241I = -1 THEN                                               11600084
     DO;                                                                11610084
       WRK_SM3 = '';                                                    11620084
     END;                                                               11630084
                                                                        11640084
     IF NUL241J = -1 THEN                                               11650084
     DO;                                                                11660084
       WRK_SM4 = '';                                                    11670084
     END;                                                               11680084
                                                                        11690084
     IF NUL241K = -1 THEN                                               11700084
     DO;                                                                11710084
       WRK_SM5 = '';                                                    11720084
     END;                                                               11730084
                                                                        11740084
     RCBM53O.SERVICE_MODULEO =                                          11750084
                WRK_SM1 || WRK_SM2 || WRK_SM3 || WRK_SM4 ||WRK_SM5;     11760084
     WRK_SERVICE_MODULE = RCBM53O.SERVICE_MODULEO;                      11770084
                                                                        11780084
     IF NUL241L ¬= -1 THEN                                              11790084
       RCBM53O.COVERAGE_START_1O = WRK_COVERAGE_START_1;                11800084
     ELSE DO;                                                           11810084
       RCBM53O.COVERAGE_START_1O = '';                                  11820084
       WRK_COVERAGE_START_1      = '';                                  11830084
     END;                                                               11840084
                                                                        11850084
     IF NUL241M ¬= -1 THEN                                              11860084
       RCBM53O.COVERAGE_END_1O = WRK_COVERAGE_END_1;                    11870084
     ELSE DO;                                                           11880084
       RCBM53O.COVERAGE_END_1O = '';                                    11890084
       WRK_COVERAGE_END_1      = '';                                    11900084
     END;                                                               11910084
                                                                        11920084
     IF NUL241N ¬= -1 THEN                                              11930084
       RCBM53O.COVERAGE_START_2O = WRK_COVERAGE_START_2;                11940084
     ELSE DO;                                                           11950084
       RCBM53O.COVERAGE_START_2O = '';                                  11960084
       WRK_COVERAGE_START_2      = '';                                  11970084
     END;                                                               11980084
                                                                        11990084
     IF NUL241O ¬= -1 THEN                                              12000084
       RCBM53O.COVERAGE_END_2O = WRK_COVERAGE_END_2;                    12010084
     ELSE DO;                                                           12020084
       RCBM53O.COVERAGE_END_2O = '';                                    12030084
       WRK_COVERAGE_END_2      = '';                                    12040084
     END;                                                               12050084
                                                                        12060084
     IF NUL241P ¬= -1 THEN                                              12070084
       RCBM53O.COVERAGE_START_3O = WRK_COVERAGE_START_3;                12080084
     ELSE DO;                                                           12090084
       RCBM53O.COVERAGE_START_3O = '';                                  12100084
       WRK_COVERAGE_START_3      = '';                                  12110084
     END;                                                               12120084
                                                                        12130084
     IF NUL241Q ¬= -1 THEN                                              12140084
       RCBM53O.COVERAGE_END_3O = WRK_COVERAGE_END_3;                    12150084
     ELSE DO;                                                           12160084
       RCBM53O.COVERAGE_END_3O = '';                                    12170084
       WRK_COVERAGE_END_3      = '';                                    12180084
     END;                                                               12190084
                                                                        12200084
     IF NUL241R ¬= -1 THEN                                              12210084
       RCBM53O.COVERAGE_START_4O = WRK_COVERAGE_START_4;                12220084
     ELSE DO;                                                           12230084
       RCBM53O.COVERAGE_START_4O = '';                                  12240084
       WRK_COVERAGE_START_4      = '';                                  12250084
     END;                                                               12260084
                                                                        12270084
     IF NUL241S ¬= -1 THEN                                              12280084
       RCBM53O.COVERAGE_END_4O = WRK_COVERAGE_END_4;                    12290084
     ELSE DO;                                                           12300084
       RCBM53O.COVERAGE_END_4O = '';                                    12310084
       WRK_COVERAGE_END_4      = '';                                    12320084
     END;                                                               12330084
                                                                        12340084
     IF NUL241T ¬= -1 THEN                                              12350084
       RCBM53O.COVERAGE_START_5O = WRK_COVERAGE_START_5;                12360084
     ELSE DO;                                                           12370084
       RCBM53O.COVERAGE_START_5O = '';                                  12380084
       WRK_COVERAGE_START_5      = '';                                  12390084
     END;                                                               12400084
                                                                        12410084
     IF NUL241U ¬= -1 THEN                                              12420084
       RCBM53O.COVERAGE_END_5O = WRK_COVERAGE_END_5;                    12430084
     ELSE DO;                                                           12440084
       RCBM53O.COVERAGE_END_5O = '';                                    12450084
       WRK_COVERAGE_END_5      = '';                                    12460084
     END;                                                               12470084
                                                                        12480084
     IF NUL241V ¬= -1 THEN                                              12490084
       RCBM53O.COVERAGE_START_6O = WRK_COVERAGE_START_6;                12500084
     ELSE DO;                                                           12510084
       RCBM53O.COVERAGE_START_6O = '';                                  12520084
       WRK_COVERAGE_START_6      = '';                                  12530084
     END;                                                               12540084
                                                                        12550084
     IF NUL241W ¬= -1 THEN                                              12560084
       RCBM53O.COVERAGE_END_6O = WRK_COVERAGE_END_6;                    12570084
     ELSE DO;                                                           12580084
       RCBM53O.COVERAGE_END_6O = '';                                    12590084
       WRK_COVERAGE_END_6      = '';                                    12600084
     END;                                                               12610084
                                                                        12620084
     IF NUL241X ¬= -1 THEN                                              12630084
       RCBM53O.COVERAGE_START_7O = WRK_COVERAGE_START_7;                12640084
     ELSE DO;                                                           12650084
       RCBM53O.COVERAGE_START_7O = '';                                  12660084
       WRK_COVERAGE_START_7      = '';                                  12670084
     END;                                                               12680084
                                                                        12690084
     IF NUL241Y ¬= -1 THEN                                              12700084
       RCBM53O.COVERAGE_END_7O = WRK_COVERAGE_END_7;                    12710084
     ELSE DO;                                                           12720084
       RCBM53O.COVERAGE_END_7O = '';                                    12730084
       WRK_COVERAGE_END_7      = '';                                    12740084
     END;                                                               12750084
                                                                        12760084
     IF NUL241Z ¬= -1 THEN                                              12770084
       RCBM53O.SERVICE_TYPEO = WRK_SERVICE_TYPE;                        12780084
     ELSE DO;                                                           12790084
       RCBM53O.SERVICE_TYPEO = '';                                      12800084
       WRK_SERVICE_TYPE      = '';                                      12810084
     END;                                                               12820084
                                                                        12830084
     IF NUL2410 ¬= -1 THEN                                              12840084
       RCBM53O.SERVICE_LVL_CODEO = WRK_SERVICE_LVL_CODE;                12850084
     ELSE DO;                                                           12860084
       RCBM53O.SERVICE_LVL_CODEO = '';                                  12870084
       WRK_SERVICE_LVL_CODE      = '';                                  12880084
     END;                                                               12890084
                                                                        12900084
     IF NUL2411 ¬= -1 THEN                                              12910084
       RCBM53O.AUTHORISATION_CODEO = WRK_AUTHORISATION_CODE;            12920084
     ELSE DO;                                                           12930084
       RCBM53O.AUTHORISATION_CODEO = '';                                12940084
       WRK_AUTHORISATION_CODE      = '';                                12950084
     END;                                                               12960084
                                                                        12970084
     IF NUL2412 = -1 THEN                                               12980084
       WRK_SOURCE_INDICATOR = '';                                       12990084
                                                                        13000084
     IF NUL2414 ¬= -1 THEN                                              13010084
       RCBM53O.EFFECTIVE_DATEO = WRK_EFFECTIVE_DATE;                    13020084
     ELSE DO;                                                           13030084
       RCBM53O.EFFECTIVE_DATEO = '';                                    13040084
       WRK_EFFECTIVE_DATE      = '';                                    13050084
     END;                                                               13060084
                                                                        13070084
     IF NUL2415 ¬= -1 THEN                                              13080084
       RCBM53O.END_DATEO = WRK_END_DATE;                                13090084
     ELSE DO;                                                           13100084
       RCBM53O.END_DATEO = '';                                          13110084
       WRK_END_DATE      = '';                                          13120084
     END;                                                               13130084
   CALL RCBC53M_FILL_MAP;                                               13140084
   END;                                                                 13150084
                                                                        13160084
   WHEN(100)                                                            13170084
   DO;                                                                  13180084
     IF WRK_ACTION = ' ' THEN                                           13190084
     DO;                                                                13200084
       RCBM53O.MSG_LINEO = ERR_O132;                                    13210084
       RCBM53O.TYPEC     = DFHRED;                                      13220084
       RCBM53O.ORIGINC   = DFHRED;                                      13230084
       RCBM53O.SEQNOC    = DFHRED;                                      13240084
       RCBM53I.TYPEL     = -1;                                          13250084
       CALL RCBC53M_SEND_MAP_CSR;                                       13260084
     END;                                                               13270084
                                                                        13280084
     IF WRK_ACTION = '2' THEN                                           13290084
     DO;                                                                13300084
       RCBM53O.MSG_LINEO = ERR_O120;                                    13310084
       RCBM53O.TYPEC     = DFHRED;                                      13320084
       RCBM53O.ORIGINC   = DFHRED;                                      13330084
       RCBM53O.SEQNOC    = DFHRED;                                      13340084
       RCBM53I.TYPEL     = -1;                                          13350084
       CALL RCBC53M_SEND_MAP_CSR;                                       13360084
     END;                                                               13370084
                                                                        13380084
     IF WRK_ACTION = '3' THEN                                           13390084
     DO;                                                                13400084
       RCBM53O.MSG_LINEO = ERR_O121;                                    13410084
       RCBM53O.TYPEC     = DFHRED;                                      13420084
       RCBM53O.ORIGINC   = DFHRED;                                      13430084
       RCBM53O.SEQNOC    = DFHRED;                                      13440084
       RCBM53I.TYPEL     = -1;                                          13450084
       CALL RCBC53M_SEND_MAP_CSR;                                       13460084
     END;                                                               13470084
   END;                                                                 13480084
                                                                        13490084
   OTHERWISE                                                            13500084
   DO;                                                                  13510084
     RCBM53O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE || ' OCCURED';   13520084
     CALL RCBC53M_SEND_MAP;                                             13530084
   END;                                                                 13540084
 END;                                                                   13550084
                                                                        13560084
0END RCBC53M_GET_CONTRACT;                                              13570084
1/********************************************************************/ 13580084
 /*      PROCESS ACTION REQUEST                                      */ 13590084
 /********************************************************************/ 13600084
0RCBC53M_ACTION_PROCESS: PROC;                                          13610084
                                                                        13620084
 SELECT (RCBM53I.ACTIONI);                                              13630084
   WHEN('1')                          /* DEFINE */                      13640084
   DO;                                                                  13650084
     CALL RCBC53M_UPDATE_CHECK;                                         13660084
     IF PF5_FLAG = TRUE THEN                                            13670084
     DO;                                                                13680084
       CALL RCBC53M_DEFINE_CONTRACT;                                    13690084
       CALL RCBC53M_UPD_T560;                                           13700084
       RCBM53O.MSG_LINEO = ERR_O123;                                    13710084
       CALL RCBC53M_CLEAR_WORK;                                         13720084
       UPD_OK_FLAG = TRUE;                                              13730084
       CALL RCBC53M_FILL_MAP;                                           13740084
       CALL RCBC53M_SEND_MAP;                                           13750084
     END;                                                               13760084
     ELSE DO;                                                           13770084
       RCBM53O.MSG_LINEO = ERR_O022;                                    13780084
       CALL RCBC53M_SEND_MAP;                                           13790084
     END;                                                               13800084
   END;                                                                 13810084
                                                                        13820084
   WHEN('2')                          /* UPDATE */                      13830084
   DO;                                                                  13840084
     CALL RCBC53M_UPDATE_CHECK;                                         13850084
     IF PF5_FLAG      = TRUE                                            13860084
      & T241_UPD_FLAG = TRUE THEN                                       13870084
     DO;                                                                13880084
       CALL RCBC53M_UPDATE_CONTRACT;                                    13890084
       CALL RCBC53M_UPD_T560;                                           13900084
       RCBM53O.MSG_LINEO = ERR_O124;                                    13910084
       CALL RCBC53M_CLEAR_WORK;                                         13920084
       UPD_OK_FLAG = TRUE;                                              13930084
       CALL RCBC53M_FILL_MAP;                                           13940084
       CALL RCBC53M_SEND_MAP;                                           13950084
     END;                                                               13960084
     IF PF5_FLAG = FALSE THEN                                           13970084
     DO;                                                                13980084
       RCBM53O.MSG_LINEO = ERR_O022;                                    13990084
       CALL RCBC53M_SEND_MAP;                                           14000084
     END;                                                               14010084
     IF T241_UPD_FLAG = FALSE THEN                                      14020084
     DO;                                                                14030084
       RCBM53O.MSG_LINEO = ERR_O053;                                    14040084
       CALL RCBC53M_SEND_MAP;                                           14050084
     END;                                                               14060084
   END;                                                                 14070084
                                                                        14080084
   WHEN('3')                          /* DELETE */                      14090084
   DO;                                                                  14100084
     IF PF5_FLAG = TRUE THEN                                            14110084
     DO;                                                                14120084
       CALL RCBC53M_DELETE_CONTRACT;                                    14130084
       CALL RCBC53M_UPD_T560;                                           14140084
       RCBM53O.MSG_LINEO = ERR_O133;                                    14150084
       CALL RCBC53M_CLEAR_WORK;                                         14160084
       UPD_OK_FLAG = TRUE;                                              14170084
       CALL RCBC53M_FILL_MAP;                                           14180084
       CALL RCBC53M_SEND_MAP;                                           14190084
     END;                                                               14200084
     ELSE DO;                                                           14210084
       RCBM53O.MSG_LINEO = ERR_O022;                                    14220084
       CALL RCBC53M_SEND_MAP;                                           14230084
     END;                                                               14240084
   END;                                                                 14250084
                                                                        14260084
   OTHERWISE                                                            14270084
   DO;                                                                  14280084
     RCBM53O.MSG_LINEO = ERR_O064;                                      14290084
     RCBM53O.ACTIONC   = DFHRED;                                        14300084
     RCBM53I.ACTIONL   = -1;                                            14310084
     CALL RCBC53M_SEND_MAP;                                             14320084
   END;                                                                 14330084
 END;                                                                   14340084
                                                                        14350084
0END RCBC53M_ACTION_PROCESS;                                            14360084
1/********************************************************************/ 14370084
 /*      UPDATE REQUESTED                                            */ 14380084
 /********************************************************************/ 14390084
0RCBC53M_UPDATE_CHECK: PROC;                                            14400084
                                                                        14410084
 T241_UPD_FLAG  = FALSE;                                                14420084
 ERR_FLAG = FALSE;                                                      14430084
 T241_FIELD_FLAG = FALSE;                                 /* RC01296 */ 14431085
                                                                        14440084
 IF RCBM53I.HVP_QUANTITYL       = 0                                     14450084
  | RCBM53I.HVP_QUANTITYI       = '' THEN                               14460084
   RCBM53O.HVP_QUANTITYO        = '    0';                              14470084
 IF RCBM53I.SERVICE_TYPEL       = 0 THEN                                14480084
   RCBM53O.SERVICE_TYPEO        = '';                                   14490084
 IF RCBM53I.SERVICE_MODULEL     = 0 THEN                                14500084
   RCBM53O.SERVICE_MODULEO      = '';                                   14510084
 IF RCBM53I.SERVICE_LVL_CODEL   = 0 THEN                                14520084
   RCBM53O.SERVICE_LVL_CODEO    = '';                                   14530084
 IF RCBM53I.AUTHORISATION_CODEL = 0 THEN                                14540084
   RCBM53O.AUTHORISATION_CODEO  = '';                                   14550084
 IF RCBM53I.COVERAGE_START_1L   = 0 THEN                                14560084
   RCBM53O.COVERAGE_START_1O    = '00.00';                              14570084
 IF RCBM53I.COVERAGE_START_1I   = '' THEN                               14580084
   RCBM53O.COVERAGE_START_1O    = '00.00';                              14590084
 IF RCBM53I.COVERAGE_START_2L   = 0 THEN                                14600084
   RCBM53O.COVERAGE_START_2O    = '00.00';                              14610084
 IF RCBM53I.COVERAGE_START_2I   = '' THEN                               14620084
   RCBM53O.COVERAGE_START_2O    = '00.00';                              14630084
 IF RCBM53I.COVERAGE_START_3L   = 0 THEN                                14640084
   RCBM53O.COVERAGE_START_3O    = '00.00';                              14650084
 IF RCBM53I.COVERAGE_START_3I   = '' THEN                               14660084
   RCBM53O.COVERAGE_START_3O    = '00.00';                              14670084
 IF RCBM53I.COVERAGE_START_4L   = 0 THEN                                14680084
   RCBM53O.COVERAGE_START_4O    = '00.00';                              14690084
 IF RCBM53I.COVERAGE_START_4I   = '' THEN                               14700084
   RCBM53O.COVERAGE_START_4O    = '00.00';                              14710084
 IF RCBM53I.COVERAGE_START_5L   = 0 THEN                                14720084
   RCBM53O.COVERAGE_START_5O    = '00.00';                              14730084
 IF RCBM53I.COVERAGE_START_5I   = '' THEN                               14740084
   RCBM53O.COVERAGE_START_5O    = '00.00';                              14750084
 IF RCBM53I.COVERAGE_START_6L   = 0 THEN                                14760084
   RCBM53O.COVERAGE_START_6O    = '00.00';                              14770084
 IF RCBM53I.COVERAGE_START_6I   = '' THEN                               14780084
   RCBM53O.COVERAGE_START_6O    = '00.00';                              14790084
 IF RCBM53I.COVERAGE_START_7L   = 0 THEN                                14800084
   RCBM53O.COVERAGE_START_7O    = '00.00';                              14810084
 IF RCBM53I.COVERAGE_START_7I   = '' THEN                               14820084
   RCBM53O.COVERAGE_START_7O    = '00.00';                              14830084
 IF RCBM53I.COVERAGE_END_1L     = 0 THEN                                14840084
   RCBM53O.COVERAGE_END_1O      = '00.00';                              14850084
 IF RCBM53I.COVERAGE_END_1I     = '' THEN                               14860084
   RCBM53O.COVERAGE_END_1O      = '00.00';                              14870084
 IF RCBM53I.COVERAGE_END_2L     = 0 THEN                                14880084
   RCBM53O.COVERAGE_END_2O      = '00.00';                              14890084
 IF RCBM53I.COVERAGE_END_2I     = '' THEN                               14900084
   RCBM53O.COVERAGE_END_2O      = '00.00';                              14910084
 IF RCBM53I.COVERAGE_END_3L     = 0 THEN                                14920084
   RCBM53O.COVERAGE_END_3O      = '00.00';                              14930084
 IF RCBM53I.COVERAGE_END_3I     = '' THEN                               14940084
   RCBM53O.COVERAGE_END_3O      = '00.00';                              14950084
 IF RCBM53I.COVERAGE_END_4L     = 0 THEN                                14960084
   RCBM53O.COVERAGE_END_4O      = '00.00';                              14970084
 IF RCBM53I.COVERAGE_END_4I     = '' THEN                               14980084
   RCBM53O.COVERAGE_END_4O      = '00.00';                              14990084
 IF RCBM53I.COVERAGE_END_5L     = 0 THEN                                15000084
   RCBM53O.COVERAGE_END_5O      = '00.00';                              15010084
 IF RCBM53I.COVERAGE_END_5I     = '' THEN                               15020084
   RCBM53O.COVERAGE_END_5O      = '00.00';                              15030084
 IF RCBM53I.COVERAGE_END_6L     = 0 THEN                                15040084
   RCBM53O.COVERAGE_END_6O      = '00.00';                              15050084
 IF RCBM53I.COVERAGE_END_6I     = '' THEN                               15060084
   RCBM53O.COVERAGE_END_6O      = '00.00';                              15070084
 IF RCBM53I.COVERAGE_END_7L     = 0 THEN                                15080084
   RCBM53O.COVERAGE_END_7O      = '00.00';                              15090084
 IF RCBM53I.COVERAGE_END_7I     = '' THEN                               15100084
   RCBM53O.COVERAGE_END_7O      = '00.00';                              15110084
 IF RCBM53I.EFFECTIVE_DATEL     = 0 THEN                                15120084
   RCBM53O.EFFECTIVE_DATEO      = '';                                   15130084
 IF RCBM53I.END_DATEL           = 0 THEN                                15140084
   RCBM53O.END_DATEO            = '';                                   15150084
                                                                        15160084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_END_7I)) THEN               15170084
 DO;                                                                    15180084
   RCBM53O.MSG_LINEO       = ERR_O006;                                  15190084
   RCBM53O.COVERAGE_END_7C = DFHRED;                                    15200084
   RCBM53I.COVERAGE_END_7L = -1;                                        15210084
   ERR_FLAG = TRUE;                                                     15220084
 END;                                                                   15230084
                                                                        15240084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_END_6I)) THEN               15250084
 DO;                                                                    15260084
   RCBM53O.MSG_LINEO       = ERR_O006;                                  15270084
   RCBM53O.COVERAGE_END_6C = DFHRED;                                    15280084
   RCBM53I.COVERAGE_END_6L = -1;                                        15290084
   ERR_FLAG = TRUE;                                                     15300084
 END;                                                                   15310084
                                                                        15320084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_END_5I)) THEN               15330084
 DO;                                                                    15340084
   RCBM53O.MSG_LINEO       = ERR_O006;                                  15350084
   RCBM53O.COVERAGE_END_5C = DFHRED;                                    15360084
   RCBM53I.COVERAGE_END_5L = -1;                                        15370084
   ERR_FLAG = TRUE;                                                     15380084
 END;                                                                   15390084
                                                                        15400084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_END_4I)) THEN               15410084
 DO;                                                                    15420084
   RCBM53O.MSG_LINEO       = ERR_O006;                                  15430084
   RCBM53O.COVERAGE_END_4C = DFHRED;                                    15440084
   RCBM53I.COVERAGE_END_4L = -1;                                        15450084
   ERR_FLAG = TRUE;                                                     15460084
 END;                                                                   15470084
                                                                        15480084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_END_3I)) THEN               15490084
 DO;                                                                    15500084
   RCBM53O.MSG_LINEO       = ERR_O006;                                  15510084
   RCBM53O.COVERAGE_END_3C = DFHRED;                                    15520084
   RCBM53I.COVERAGE_END_3L = -1;                                        15530084
   ERR_FLAG = TRUE;                                                     15540084
 END;                                                                   15550084
                                                                        15560084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_END_2I)) THEN               15570084
 DO;                                                                    15580084
   RCBM53O.MSG_LINEO       = ERR_O006;                                  15590084
   RCBM53O.COVERAGE_END_2C = DFHRED;                                    15600084
   RCBM53I.COVERAGE_END_2L = -1;                                        15610084
   ERR_FLAG = TRUE;                                                     15620084
 END;                                                                   15630084
                                                                        15640084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_END_1I)) THEN               15650084
 DO;                                                                    15660084
   RCBM53O.MSG_LINEO       = ERR_O006;                                  15670084
   RCBM53O.COVERAGE_END_1C = DFHRED;                                    15680084
   RCBM53I.COVERAGE_END_1L = -1;                                        15690084
   ERR_FLAG = TRUE;                                                     15700084
 END;                                                                   15710084
                                                                        15720084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_START_7I)) THEN             15730084
 DO;                                                                    15740084
   RCBM53O.MSG_LINEO         = ERR_O006;                                15750084
   RCBM53O.COVERAGE_START_7C = DFHRED;                                  15760084
   RCBM53I.COVERAGE_START_7L = -1;                                      15770084
   ERR_FLAG = TRUE;                                                     15780084
 END;                                                                   15790084
                                                                        15800084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_START_6I)) THEN             15810084
 DO;                                                                    15820084
   RCBM53O.MSG_LINEO         = ERR_O006;                                15830084
   RCBM53O.COVERAGE_START_6C = DFHRED;                                  15840084
   RCBM53I.COVERAGE_START_6L = -1;                                      15850084
   ERR_FLAG = TRUE;                                                     15860084
 END;                                                                   15870084
                                                                        15880084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_START_5I)) THEN             15890084
 DO;                                                                    15900084
   RCBM53O.MSG_LINEO         = ERR_O006;                                15910084
   RCBM53O.COVERAGE_START_5C = DFHRED;                                  15920084
   RCBM53I.COVERAGE_START_5L = -1;                                      15930084
   ERR_FLAG = TRUE;                                                     15940084
 END;                                                                   15950084
                                                                        15960084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_START_4I)) THEN             15970084
 DO;                                                                    15980084
   RCBM53O.MSG_LINEO         = ERR_O006;                                15990084
   RCBM53O.COVERAGE_START_4C = DFHRED;                                  16000084
   RCBM53I.COVERAGE_START_4L = -1;                                      16010084
   ERR_FLAG = TRUE;                                                     16020084
 END;                                                                   16030084
                                                                        16040084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_START_3I)) THEN             16050084
 DO;                                                                    16060084
   RCBM53O.MSG_LINEO         = ERR_O006;                                16070084
   RCBM53O.COVERAGE_START_3C = DFHRED;                                  16080084
   RCBM53I.COVERAGE_START_3L = -1;                                      16090084
   ERR_FLAG = TRUE;                                                     16100084
 END;                                                                   16110084
                                                                        16120084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_START_2I)) THEN             16130084
 DO;                                                                    16140084
   RCBM53O.MSG_LINEO         = ERR_O006;                                16150084
   RCBM53O.COVERAGE_START_2C = DFHRED;                                  16160084
   RCBM53I.COVERAGE_START_2L = -1;                                      16170084
   ERR_FLAG = TRUE;                                                     16180084
 END;                                                                   16190084
                                                                        16200084
 IF ( ¬ RCBC53M_VALID_TIME(RCBM53I.COVERAGE_START_1I)) THEN             16210084
 DO;                                                                    16220084
   RCBM53O.MSG_LINEO         = ERR_O006;                                16230084
   RCBM53O.COVERAGE_START_1C = DFHRED;                                  16240084
   RCBM53I.COVERAGE_START_1L = -1;                                      16250084
   ERR_FLAG = TRUE;                                                     16260084
 END;                                                                   16270084
                                                                        16280084
 IF ERR_FLAG = TRUE THEN                                                16290084
 DO;                                                                    16300084
   CALL RCBC53M_SEND_MAP_CSR;                                           16310084
 END;                                                                   16320084
                                                                        16330084
 IF RCBM53I.COVERAGE_START_7I ¬= WRK_COVERAGE_START_7                   16340084
  | RCBM53I.COVERAGE_END_7I   ¬= WRK_COVERAGE_END_7 THEN                16350084
 DO;                                                                    16360084
   IF RCBM53I.COVERAGE_START_7I = ''                                    16370084
    & RCBM53I.COVERAGE_END_7I  ¬= '' THEN                               16380084
   DO;                                                                  16390084
     RCBM53O.MSG_LINEO         = ERR_O081;                              16400084
     RCBM53O.COVERAGE_START_7C = DFHRED;                                16410084
     RCBM53I.COVERAGE_START_7L = -1;                                    16420084
     ERR_FLAG = TRUE;                                                   16430084
   END;                                                                 16440084
   IF RCBM53I.COVERAGE_START_7I ¬= ''                                   16450084
    & RCBM53I.COVERAGE_END_7I    = '' THEN                              16460084
   DO;                                                                  16470084
     RCBM53O.MSG_LINEO         = ERR_O080;                              16480084
     RCBM53O.COVERAGE_START_7C = DFHRED;                                16490084
     RCBM53I.COVERAGE_START_7L = -1;                                    16500084
     ERR_FLAG = TRUE;                                                   16510084
   END;                                                                 16520084
                                                                        16530084
   T241_UPD_FLAG = TRUE;                                                16540084
   T241_FIELD_FLAG = TRUE;                                /* RC01296 */ 16541085
 END;                                                                   16550084
                                                                        16560084
 IF RCBM53I.COVERAGE_START_6I ¬= WRK_COVERAGE_START_6                   16570084
  | RCBM53I.COVERAGE_END_6I   ¬= WRK_COVERAGE_END_6 THEN                16580084
 DO;                                                                    16590084
   IF RCBM53I.COVERAGE_START_6I = ''                                    16600084
    & RCBM53I.COVERAGE_END_6I  ¬= '' THEN                               16610084
   DO;                                                                  16620084
     RCBM53O.MSG_LINEO         = ERR_O081;                              16630084
     RCBM53O.COVERAGE_START_6C = DFHRED;                                16640084
     RCBM53I.COVERAGE_START_6L = -1;                                    16650084
     ERR_FLAG = TRUE;                                                   16660084
   END;                                                                 16670084
   IF RCBM53I.COVERAGE_START_6I ¬= ''                                   16680084
    & RCBM53I.COVERAGE_END_6I    = '' THEN                              16690084
   DO;                                                                  16700084
     RCBM53O.MSG_LINEO         = ERR_O080;                              16710084
     RCBM53O.COVERAGE_START_6C = DFHRED;                                16720084
     RCBM53I.COVERAGE_START_6L = -1;                                    16730084
     ERR_FLAG = TRUE;                                                   16740084
   END;                                                                 16750084
                                                                        16760084
   T241_UPD_FLAG = TRUE;                                                16770084
   T241_FIELD_FLAG = TRUE;                                /* RC01296 */ 16771085
 END;                                                                   16780084
                                                                        16790084
 IF RCBM53I.COVERAGE_START_5I ¬= WRK_COVERAGE_START_5                   16800084
  | RCBM53I.COVERAGE_END_5I   ¬= WRK_COVERAGE_END_5 THEN                16810084
 DO;                                                                    16820084
   IF RCBM53I.COVERAGE_START_5I = ''                                    16830084
    & RCBM53I.COVERAGE_END_5I  ¬= '' THEN                               16840084
   DO;                                                                  16850084
     RCBM53O.MSG_LINEO         = ERR_O081;                              16860084
     RCBM53O.COVERAGE_START_5C = DFHRED;                                16870084
     RCBM53I.COVERAGE_START_5L = -1;                                    16880084
     ERR_FLAG = TRUE;                                                   16890084
   END;                                                                 16900084
   IF RCBM53I.COVERAGE_START_5I ¬= ''                                   16910084
    & RCBM53I.COVERAGE_END_5I    = '' THEN                              16920084
   DO;                                                                  16930084
     RCBM53O.MSG_LINEO         = ERR_O080;                              16940084
     RCBM53O.COVERAGE_START_5C = DFHRED;                                16950084
     RCBM53I.COVERAGE_START_5L = -1;                                    16960084
     ERR_FLAG = TRUE;                                                   16970084
   END;                                                                 16980084
                                                                        16990084
   T241_UPD_FLAG = TRUE;                                                17000084
   T241_FIELD_FLAG = TRUE;                                /* RC01296 */ 17001085
 END;                                                                   17010084
                                                                        17020084
 IF RCBM53I.COVERAGE_START_4I ¬= WRK_COVERAGE_START_4                   17030084
  | RCBM53I.COVERAGE_END_4I   ¬= WRK_COVERAGE_END_4 THEN                17040084
 DO;                                                                    17050084
   IF RCBM53I.COVERAGE_START_4I = ''                                    17060084
    & RCBM53I.COVERAGE_END_4I  ¬= '' THEN                               17070084
   DO;                                                                  17080084
     RCBM53O.MSG_LINEO         = ERR_O081;                              17090084
     RCBM53O.COVERAGE_START_4C = DFHRED;                                17100084
     RCBM53I.COVERAGE_START_4L = -1;                                    17110084
     ERR_FLAG = TRUE;                                                   17120084
   END;                                                                 17130084
   IF RCBM53I.COVERAGE_START_4I ¬= ''                                   17140084
    & RCBM53I.COVERAGE_END_4I    = '' THEN                              17150084
   DO;                                                                  17160084
     RCBM53O.MSG_LINEO         = ERR_O080;                              17170084
     RCBM53O.COVERAGE_START_4C = DFHRED;                                17180084
     RCBM53I.COVERAGE_START_4L = -1;                                    17190084
     ERR_FLAG = TRUE;                                                   17200084
   END;                                                                 17210084
                                                                        17220084
   T241_UPD_FLAG = TRUE;                                                17230084
   T241_FIELD_FLAG = TRUE;                                /* RC01296 */ 17231085
 END;                                                                   17240084
                                                                        17250084
 IF RCBM53I.COVERAGE_START_3I ¬= WRK_COVERAGE_START_3                   17260084
  | RCBM53I.COVERAGE_END_3I   ¬= WRK_COVERAGE_END_3 THEN                17270084
 DO;                                                                    17280084
   IF RCBM53I.COVERAGE_START_3I = ''                                    17290084
    & RCBM53I.COVERAGE_END_3I  ¬= '' THEN                               17300084
   DO;                                                                  17310084
     RCBM53O.MSG_LINEO         = ERR_O081;                              17320084
     RCBM53O.COVERAGE_START_3C = DFHRED;                                17330084
     RCBM53I.COVERAGE_START_3L = -1;                                    17340084
     ERR_FLAG = TRUE;                                                   17350084
   END;                                                                 17360084
   IF RCBM53I.COVERAGE_START_3I ¬= ''                                   17370084
    & RCBM53I.COVERAGE_END_3I    = '' THEN                              17380084
   DO;                                                                  17390084
     RCBM53O.MSG_LINEO         = ERR_O080;                              17400084
     RCBM53O.COVERAGE_START_3C = DFHRED;                                17410084
     RCBM53I.COVERAGE_START_3L = -1;                                    17420084
     ERR_FLAG = TRUE;                                                   17430084
   END;                                                                 17440084
                                                                        17450084
   T241_UPD_FLAG = TRUE;                                                17460084
   T241_FIELD_FLAG = TRUE;                                /* RC01296 */ 17461085
 END;                                                                   17470084
                                                                        17480084
 IF RCBM53I.COVERAGE_START_2I ¬= WRK_COVERAGE_START_2                   17490084
  | RCBM53I.COVERAGE_END_2I   ¬= WRK_COVERAGE_END_2 THEN                17500084
 DO;                                                                    17510084
   IF RCBM53I.COVERAGE_START_2I = ''                                    17520084
    & RCBM53I.COVERAGE_END_2I  ¬= '' THEN                               17530084
   DO;                                                                  17540084
     RCBM53O.MSG_LINEO         = ERR_O081;                              17550084
     RCBM53O.COVERAGE_START_2C = DFHRED;                                17560084
     RCBM53I.COVERAGE_START_2L = -1;                                    17570084
     ERR_FLAG = TRUE;                                                   17580084
   END;                                                                 17590084
   IF RCBM53I.COVERAGE_START_2I ¬= ''                                   17600084
    & RCBM53I.COVERAGE_END_2I    = '' THEN                              17610084
   DO;                                                                  17620084
     RCBM53O.MSG_LINEO         = ERR_O080;                              17630084
     RCBM53O.COVERAGE_START_2C = DFHRED;                                17640084
     RCBM53I.COVERAGE_START_2L = -1;                                    17650084
     ERR_FLAG = TRUE;                                                   17660084
   END;                                                                 17670084
                                                                        17680084
   T241_UPD_FLAG = TRUE;                                                17690084
   T241_FIELD_FLAG = TRUE;                                /* RC01296 */ 17691085
 END;                                                                   17700084
                                                                        17710084
 IF RCBM53I.COVERAGE_START_1I ¬= WRK_COVERAGE_START_1                   17720084
  | RCBM53I.COVERAGE_END_1I   ¬= WRK_COVERAGE_END_1 THEN                17730084
 DO;                                                                    17740084
   IF RCBM53I.COVERAGE_START_1I = ''                                    17750084
    & RCBM53I.COVERAGE_END_1I  ¬= '' THEN                               17760084
   DO;                                                                  17770084
     RCBM53O.MSG_LINEO         = ERR_O081;                              17780084
     RCBM53O.COVERAGE_START_1C = DFHRED;                                17790084
     RCBM53I.COVERAGE_START_1L = -1;                                    17800084
     ERR_FLAG = TRUE;                                                   17810084
   END;                                                                 17820084
   IF RCBM53I.COVERAGE_START_1I ¬= ''                                   17830084
    & RCBM53I.COVERAGE_END_1I    = '' THEN                              17840084
   DO;                                                                  17850084
     RCBM53O.MSG_LINEO         = ERR_O080;                              17860084
     RCBM53O.COVERAGE_START_1C = DFHRED;                                17870084
     RCBM53I.COVERAGE_START_1L = -1;                                    17880084
     ERR_FLAG = TRUE;                                                   17890084
   END;                                                                 17900084
                                                                        17910084
   T241_UPD_FLAG = TRUE;                                                17920084
   T241_FIELD_FLAG = TRUE;                                /* RC01296 */ 17921085
 END;                                                                   17930084
                                                                        17940084
 IF RCBM53I.AUTHORISATION_CODEI ¬= WRK_AUTHORISATION_CODE THEN          17950084
 DO;                                                                    17960084
   IF VERIFY(RCBM53I.AUTHORISATION_CODEI, ALPHANUM) ¬= 0 THEN           17970084
   DO;                                                                  17980084
     RCBM53O.MSG_LINEO           = 'An invalid value has been entered'; 17990084
     RCBM53O.AUTHORISATION_CODEC = DFHRED;                              18000084
     RCBM53I.AUTHORISATION_CODEL = -1;                                  18010084
     ERR_FLAG = TRUE;                                                   18020084
   END;                                                                 18030084
                                                                        18040084
   ELSE                                                                 18050084
     T241_UPD_FLAG = TRUE;                                              18060084
     T241_FIELD_FLAG = TRUE;                              /* RC01296 */ 18061085
 END;                                                                   18070085
                                                                        18080084
 IF RCBM53I.SERVICE_LVL_CODEI ¬= WRK_SERVICE_LVL_CODE THEN              18090084
 DO;                                                                    18100084
   CALL RCBC53M_GET_T470;                                               18110084
   IF WRK_REC_COUNT = 0 THEN                                            18120084
   DO;                                                                  18130084
     RCBM53O.MSG_LINEO         = ERR_O142;                              18140084
     RCBM53O.SERVICE_LVL_CODEC = DFHRED;                                18150084
     RCBM53I.SERVICE_LVL_CODEL = -1;                                    18160084
     ERR_FLAG = TRUE;                                                   18170084
   END;                                                                 18180084
                                                                        18190084
   ELSE                                                                 18200084
     T241_UPD_FLAG = TRUE;                                              18210084
     T241_FIELD_FLAG = TRUE;                              /* RC01296 */ 18211085
 END;                                                                   18220084
                                                                        18230084
 IF RCBM53I.SERVICE_MODULEI ¬= WRK_SERVICE_MODULE THEN                  18240084
 DO;                                                                    18250084
   IF VERIFY(RCBM53I.SERVICE_MODULEI, ALPHANUM) ¬= 0 THEN               18260084
   DO;                                                                  18270084
     RCBM53O.MSG_LINEO           = 'An invalid value has been entered'; 18280084
     RCBM53O.SERVICE_MODULEC = DFHRED;                                  18290084
     RCBM53I.SERVICE_MODULEL = -1;                                      18300084
     ERR_FLAG = TRUE;                                                   18310084
   END;                                                                 18320084
                                                                        18330084
   ELSE                                                                 18340084
     T241_UPD_FLAG = TRUE;                                              18350084
     T241_FIELD_FLAG = TRUE;                              /* RC01296 */ 18351085
 END;                                                                   18360084
                                                                        18370084
 IF RCBM53I.SERVICE_TYPEI ¬= WRK_SERVICE_TYPE THEN                      18380084
 DO;                                                                    18390084
   CALL RCBC53M_GET_T640;                                               18400084
   IF WRK_REC_COUNT = 0 THEN                                            18410084
   DO;                                                                  18420084
     RCBM53O.MSG_LINEO     = 'Service Type does not exist';             18430084
     RCBM53O.SERVICE_TYPEC = DFHRED;                                    18440084
     RCBM53I.SERVICE_TYPEL = -1;                                        18450084
     ERR_FLAG = TRUE;                                                   18460084
   END;                                                                 18470084
                                                                        18480084
   ELSE                                                                 18490084
     T241_UPD_FLAG = TRUE;                                              18500084
     T241_FIELD_FLAG = TRUE;                              /* RC01296 */ 18501085
 END;                                                                   18510084
                                                                        18520084
 IF RCBM53I.END_DATEI = '' THEN                                         18530084
   RCBM53O.END_DATEO = '9999-12-31';                                    18540084
                                                                        18550084
 IF RCBM53I.END_DATEI ¬= WRK_END_DATE THEN                              18560084
 DO;                                                                    18570084
   IF ( ¬ RCBC53M_VALID_DATE(RCBM53I.END_DATEI)) THEN                   18580084
   DO;                                                                  18590084
     RCBM53O.MSG_LINEO = ERR_O002;                                      18600084
     RCBM53O.END_DATEC = DFHRED;                                        18610084
     RCBM53I.END_DATEL = -1;                                            18620084
     ERR_FLAG = TRUE;                                                   18630084
   END;                                                                 18640084
                                                                        18650084
   ELSE                                                                 18660084
     T241_UPD_FLAG = TRUE;                                              18670084
     T241_FIELD_FLAG = TRUE;                              /* RC01296 */ 18671085
 END;                                                                   18680084
                                                                        18690084
 IF RCBM53I.EFFECTIVE_DATEI = '' THEN                                   18700084
 DO;                                                                    18710084
   RCBM53O.MSG_LINEO       = ERR_O117;                                  18720084
   RCBM53O.EFFECTIVE_DATEC = DFHRED;                                    18730084
   RCBM53I.EFFECTIVE_DATEL = -1;                                        18740084
   ERR_FLAG = TRUE;                                                     18750084
 END;                                                                   18760084
                                                                        18770084
 IF RCBM53I.EFFECTIVE_DATEI ¬= WRK_EFFECTIVE_DATE THEN                  18780084
 DO;                                                                    18790084
   IF ( ¬ RCBC53M_VALID_DATE(RCBM53I.EFFECTIVE_DATEI)) THEN             18800084
   DO;                                                                  18810084
     RCBM53O.MSG_LINEO       = ERR_O002;                                18820084
     RCBM53O.EFFECTIVE_DATEC = DFHRED;                                  18830084
     RCBM53I.EFFECTIVE_DATEL = -1;                                      18840084
     ERR_FLAG = TRUE;                                                   18850084
   END;                                                                 18860084
                                                                        18870084
   ELSE                                                                 18880084
     T241_UPD_FLAG = TRUE;                                              18890084
     T241_FIELD_FLAG = TRUE;                              /* RC01296 */ 18891085
 END;                                                                   18900084
                                                                        18910084
 WRK_HVP_QTYC = WRK_HVP_QUANTITY;                                       18920084
 IF RCBM53I.HVP_QUANTITYI ¬= WRK_HVP_QTYC THEN                          18930084
 DO;                                                                    18940084
   WRK_QTYC = RCBM53I.HVP_QUANTITYI;                                    18950084
   QTY_FLAG = FALSE;                                                    18960084
   IF VERIFY(WRK_QTYC, NUMERIC) ¬= 0 THEN                               18970084
   DO;                                                                  18980084
     RCBM53O.MSG_LINEO     = 'An invalid value has been entered';       18990084
     RCBM53O.HVP_QUANTITYC = DFHRED;                                    19000084
     RCBM53I.HVP_QUANTITYL = -1;                                        19010084
     ERR_FLAG = TRUE;                                                   19020084
     QTY_FLAG = TRUE;                                                   19030084
   END;                                                                 19040084
                                                                        19050084
   J,K,L = 0;                                                           19060084
   DO I = 1 TO 5;                                                       19070084
     IF SUBSTR(WRK_QTYC,I,1) = '' THEN                                  19080084
     DO;                                                                19090084
       IF J = 1 THEN K = 1;                                             19100084
     END;                                                               19110084
     ELSE DO;                                                           19120084
       IF J = 1 & K = 1 THEN L = 1;                                     19130084
       J = 1;                                                           19140084
     END;                                                               19150084
   END;                                                                 19160084
                                                                        19170084
   IF L = 1 THEN                                                        19180084
   DO;                                                                  19190084
     RCBM53O.MSG_LINEO     = 'An invalid value has been entered';       19200084
     RCBM53O.HVP_QUANTITYC = DFHRED;                                    19210084
     RCBM53I.HVP_QUANTITYL = -1;                                        19220084
     ERR_FLAG = TRUE;                                                   19230084
     QTY_FLAG = TRUE;                                                   19240084
   END;                                                                 19250084
                                                                        19260084
   IF QTY_FLAG = FALSE THEN                                             19270084
   DO;                                                                  19280084
     J = 5;                                                             19290084
     WRK_QTYA = '';                                                     19300084
     DO I = 5 TO 1 BY -1;                                               19310084
       IF SUBSTR(WRK_QTYC,I,1) ¬= '' THEN                               19320084
       DO;                                                              19330084
         SUBSTR(WRK_QTYA,J,1) = SUBSTR(WRK_QTYC,I,1);                   19340084
         J = J - 1;                                                     19350084
       END;                                                             19360084
     END;                                                               19370084
                                                                        19380084
     RCBM53O.HVP_QUANTITYO = WRK_QTYA;                                  19390084
                                                                        19400084
     WRK_QTYC = RCBM53I.HVP_QUANTITYI;                                  19410084
                                                                        19420084
     IF WRK_QTYP = 0 THEN                                               19430084
     DO;                                                                19440084
       RCBM53O.HVP_QUANTITYO = '    1';                                 19450084
     END;                                                               19460084
                                                                        19470084
     T241_UPD_FLAG = TRUE;                                              19480084
     T241_FIELD_FLAG = TRUE;                              /* RC01296 */ 19481085
   END;                                                                 19490084
 END;                                                                   19500084
                                                      /* SOC RC01296 */ 19510085
 /*IF RCBM53I.CONTRACT_NUMBERI ¬= WRK_CONTRACT_NUMBER THEN           */ 19520085
 /*DO;                                                               */ 19530085
 /*  IF VERIFY(RCBM53I.CONTRACT_NUMBERI, ALPHANUM) ¬= 0 THEN         */ 19540085
 /*  DO;                                                             */ 19550085
                                                                        19551085
  IF (RCBM53I.CONTRACT_NUMBERI ¬= WRK_CONTRACT_NUMBER |                 19552085
      T241_FIELD_FLAG = TRUE)THEN                                       19553085
   DO;                                                                  19554085
    T241_UPD_FLAG = TRUE;                                               19555085
                                                                        19556085
    CONTRACT_NUMBER_FLAG = FALSE;                                       19557085
     DO Q = 15 TO 1 BY -1;                                              19558085
       IF SUBSTR(RCBM53I.CONTRACT_NUMBERI,Q,1) ¬= '' THEN               19559085
         DO;                                                            19559185
           CONTRACT_NUMBER_FLAG = TRUE;                                 19559285
         END;                                                           19559385
       ELSE DO;                                                         19559485
            IF CONTRACT_NUMBER_FLAG THEN                                19559585
             DO;                                                        19559685
              T241_UPD_FLAG = FALSE;                   /* EOC RC01296 */19559785
              RCBM53O.MSG_LINEO = 'An invalid value has been entered';  19560085
              RCBM53O.CONTRACT_NUMBERC = DFHRED;                        19570085
              RCBM53I.CONTRACT_NUMBERL = -1;                            19580085
              ERR_FLAG = TRUE;                                          19590085
             END;                                                       19600085
         END;                                          /* SOC RC01296 */19601085
      END;                                                              19610085
 /*   ELSE                                                            */19620085
 /*   T241_UPD_FLAG = TRUE;                            /* EOC RC01296 */19630085
 END;                                                                   19640084
                                                                        19650084
 IF RCBM53I.ACTIONI = '1' THEN                                          19660084
 DO;                                                                    19670084
   IF VERIFY(RCBM53I.SEQNOI, ALPHANUM) ¬= 0 THEN                        19680084
   DO;                                                                  19690084
     RCBM53O.MSG_LINEO = ERR_O005;                                      19700084
     RCBM53O.SEQNOC    = DFHRED;                                        19710084
     RCBM53I.SEQNOL    = -1;                                            19720084
     ERR_FLAG = TRUE;                                                   19730084
   END;                                                                 19740084
                                                                        19750084
   WRK_SEQUENCE_NUMBER = RCBM53I.SEQNOI;                                19760084
                                                                        19770084
   IF VERIFY(RCBM53I.ORIGINI, ALPHANUM) ¬= 0 THEN                       19780084
   DO;                                                                  19790084
     RCBM53O.MSG_LINEO = ERR_O005;                                      19800084
     RCBM53O.ORIGINC   = DFHRED;                                        19810084
     RCBM53I.ORIGINL   = -1;                                            19820084
     ERR_FLAG = TRUE;                                                   19830084
   END;                                                                 19840084
                                                                        19850084
   WRK_ORIGIN = RCBM53I.ORIGINI;                                        19860084
                                                                        19870084
   IF VERIFY(RCBM53I.TYPEI, ALPHANUM) ¬= 0 THEN                         19880084
   DO;                                                                  19890084
     RCBM53O.MSG_LINEO = ERR_O005;                                      19900084
     RCBM53O.TYPEC     = DFHRED;                                        19910084
     RCBM53I.TYPEL     = -1;                                            19920084
     ERR_FLAG = TRUE;                                                   19930084
   END;                                                                 19940084
                                                                        19950084
   WRK_PRODUCT_TYPE = RCBM53I.TYPEI;                                    19960084
                                                                        19970084
   CALL RCBC53M_GET_T051;                                               19980084
   IF WRK_REC_COUNT = 0 THEN                                            19990084
   DO;                                                                  20000084
     RCBM53O.MSG_LINEO = 'No inventory record exists for this TOS';     20010084
     RCBM53O.TYPEC     = DFHRED;                                        20020084
     RCBM53O.ORIGINC   = DFHRED;                                        20030084
     RCBM53O.SEQNOC    = DFHRED;                                        20040084
     RCBM53I.TYPEL     = -1;                                            20050084
     ERR_FLAG = TRUE;                                                   20060084
   END;                                                                 20070084
                                                                        20080084
   IF WRK_REC_COUNT ¬= 0 THEN                              /* RB01289 */20090084
   CALL RCBC53M_GET_CUSTOMER_NUMBER;                       /* RB01289 */20100084
                                                                        20110084
   CALL RCBC53M_GET_T241;                                               20120084
   IF WRK_REC_COUNT ¬= 0 THEN                                           20130084
   DO;                                                                  20140084
     RCBM53O.MSG_LINEO =                                                20150084
                 'A contract record already exists at this date';       20160084
     RCBM53O.TYPEC     = DFHRED;                                        20170084
     RCBM53O.ORIGINC   = DFHRED;                                        20180084
     RCBM53O.SEQNOC    = DFHRED;                                        20190084
     RCBM53I.TYPEL     = -1;                                            20200084
     ERR_FLAG = TRUE;                                                   20210084
   END;                                                                 20220084
 END;                                                                   20230084
                                                                        20240084
 IF ERR_FLAG = TRUE THEN                                                20250084
 DO;                                                                    20260084
   CALL RCBC53M_SEND_MAP_CSR;                                           20270084
 END;                                                                   20280084
                                                                        20290084
 IF RCBM53I.EFFECTIVE_DATEI > ORI_EFFECTIVE_DATE THEN                   20300084
 DO;                                                                    20310084
   CALL RCBC53M_GET_T241_1;                                             20320084
                                                                        20330084
   IF WRK_REC_COUNT ¬= 0 THEN                                           20340084
   DO;                                                                  20350084
     RCBM53O.MSG_LINEO =                                                20360084
                 'This date overlaps an existing contract';             20370084
     RCBM53O.EFFECTIVE_DATEC = DFHRED;                                  20380084
     RCBM53I.EFFECTIVE_DATEL = -1;                                      20390084
     ERR_FLAG = TRUE;                                                   20400084
   END;                                                                 20410084
 END;                                                                   20420084
                                                                        20430084
 IF RCBM53I.END_DATEI < RCBM53I.EFFECTIVE_DATEI THEN                    20440084
 DO;                                                                    20450084
   RCBM53O.MSG_LINEO = ERR_O012;                                        20460084
   RCBM53O.END_DATEC = DFHRED;                                          20470084
   RCBM53I.END_DATEL = -1;                                              20480084
   ERR_FLAG = TRUE;                                                     20490084
 END;                                                                   20500084
                                                                        20510084
 IF RCBM53I.END_DATEI > WRK_END_DATE THEN                               20520084
 DO;                                                                    20530084
   CALL RCBC53M_GET_T241_2;                                             20540084
                                                                        20550084
   IF WRK_REC_COUNT ¬= 0 THEN                                           20560084
   DO;                                                                  20570084
     RCBM53O.MSG_LINEO =                                                20580084
                 'A contract record already exists at this date';       20590084
     RCBM53O.END_DATEC = DFHRED;                                        20600084
     RCBM53I.END_DATEL = -1;                                            20610084
     ERR_FLAG = TRUE;                                                   20620084
   END;                                                                 20630084
 END;                                                                   20640084
                                                                        20650084
 IF ERR_FLAG = TRUE THEN                                                20660084
 DO;                                                                    20670084
   CALL RCBC53M_SEND_MAP_CSR;                                           20680084
 END;                                                                   20690084
                                                                        20700084
 IF PF5_FLAG = TRUE                                                     20710084
  & T241_UPD_FLAG = TRUE THEN                                           20720084
 DO;                                                                    20730084
   WRK_HVP_QUANTITY       = RCBM53I.HVP_QUANTITYI;                      20740084
   WRK_CONTRACT_NUMBER    = RCBM53I.CONTRACT_NUMBERI;                   20750084
   WRK_EFFECTIVE_DATE     = RCBM53I.EFFECTIVE_DATEI;                    20760084
   WRK_END_DATE           = RCBM53I.END_DATEI;                          20770084
   WRK_SERVICE_TYPE       = RCBM53I.SERVICE_TYPEI;                      20780084
   WRK_SERVICE_MODULE     = RCBM53I.SERVICE_MODULEI;                    20790084
   WRK_SERVICE_LVL_CODE   = RCBM53I.SERVICE_LVL_CODEI;                  20800084
   WRK_AUTHORISATION_CODE = RCBM53I.AUTHORISATION_CODEI;                20810084
   WRK_COVERAGE_START_1   = RCBM53I.COVERAGE_START_1I;                  20820084
   WRK_COVERAGE_END_1     = RCBM53I.COVERAGE_END_1I;                    20830084
   WRK_COVERAGE_START_2   = RCBM53I.COVERAGE_START_2I;                  20840084
   WRK_COVERAGE_END_2     = RCBM53I.COVERAGE_END_2I;                    20850084
   WRK_COVERAGE_START_3   = RCBM53I.COVERAGE_START_3I;                  20860084
   WRK_COVERAGE_END_3     = RCBM53I.COVERAGE_END_3I;                    20870084
   WRK_COVERAGE_START_4   = RCBM53I.COVERAGE_START_4I;                  20880084
   WRK_COVERAGE_END_4     = RCBM53I.COVERAGE_END_4I;                    20890084
   WRK_COVERAGE_START_5   = RCBM53I.COVERAGE_START_5I;                  20900084
   WRK_COVERAGE_END_5     = RCBM53I.COVERAGE_END_5I;                    20910084
   WRK_COVERAGE_START_6   = RCBM53I.COVERAGE_START_6I;                  20920084
   WRK_COVERAGE_END_6     = RCBM53I.COVERAGE_END_6I;                    20930084
   WRK_COVERAGE_START_7   = RCBM53I.COVERAGE_START_7I;                  20940084
   WRK_COVERAGE_END_7     = RCBM53I.COVERAGE_END_7I;                    20950084
 END;                                                                   20960084
                                                                        20970084
 IF PF5_FLAG = FALSE                                                    20980084
  & T241_UPD_FLAG = TRUE THEN                                           20990084
 DO;                                                                    21000084
   RCBM53O.MSG_LINEO = ERR_O022;                                        21010084
   CALL RCBC53M_SEND_MAP;                                               21020084
 END;                                                                   21030084
                                                                        21040084
 END RCBC53M_UPDATE_CHECK;                                              21050084
1/********************************************************************/ 21060084
 /*      UPDATE T241 RECORD                                          */ 21070084
 /********************************************************************/ 21080084
0RCBC53M_UPDATE_CONTRACT: PROC;                                         21090084
                                                                        21100084
 WRK_SM1             = SUBSTR(WRK_SERVICE_MODULE,1,2);                  21110084
 WRK_SM2             = SUBSTR(WRK_SERVICE_MODULE,3,2);                  21120084
 WRK_SM3             = SUBSTR(WRK_SERVICE_MODULE,5,2);                  21130084
 WRK_SM4             = SUBSTR(WRK_SERVICE_MODULE,7,2);                  21140084
 WRK_SM5             = SUBSTR(WRK_SERVICE_MODULE,9,2);                  21150084
 WRK_HVP_QTY_FD      = WRK_HVP_QUANTITY;                                21160084
                                                                        21170084
 IF WRK_SM1 = '' THEN NUL241G = -1;                                     21180084
 IF WRK_SM2 = '' THEN NUL241H = -1;                                     21190084
 IF WRK_SM3 = '' THEN NUL241I = -1;                                     21200084
 IF WRK_SM4 = '' THEN NUL241J = -1;                                     21210084
 IF WRK_SM5 = '' THEN NUL241K = -1;                                     21220084
                                                                        21230084
 IF WRK_SERVICE_LVL_CODE   = '' THEN NUL2410 = -1;                      21240084
 IF WRK_AUTHORISATION_CODE = '' THEN NUL2411 = -1;                      21250084
                                                                        21260084
 WRK_CS1 = WRK_COVERAGE_START_1 || '.00';                               21270084
 WRK_CE1 = WRK_COVERAGE_END_1   || '.00';                               21280084
 WRK_CS2 = WRK_COVERAGE_START_2 || '.00';                               21290084
 WRK_CE2 = WRK_COVERAGE_END_2   || '.00';                               21300084
 WRK_CS3 = WRK_COVERAGE_START_3 || '.00';                               21310084
 WRK_CE3 = WRK_COVERAGE_END_3   || '.00';                               21320084
 WRK_CS4 = WRK_COVERAGE_START_4 || '.00';                               21330084
 WRK_CE4 = WRK_COVERAGE_END_4   || '.00';                               21340084
 WRK_CS5 = WRK_COVERAGE_START_5 || '.00';                               21350084
 WRK_CE5 = WRK_COVERAGE_END_5   || '.00';                               21360084
 WRK_CS6 = WRK_COVERAGE_START_6 || '.00';                               21370084
 WRK_CE6 = WRK_COVERAGE_END_6   || '.00';                               21380084
 WRK_CS7 = WRK_COVERAGE_START_7 || '.00';                               21390084
 WRK_CE7 = WRK_COVERAGE_END_7   || '.00';                               21400084
                                                                        21410084
 EXEC SQL                                                               21420084
      UPDATE RCBV0241_PI_CTR                                            21430084
      SET    HVP_QUANTITY       = :WRK_HVP_QTY_FD                       21440084
                                  :NUL241E,                             21450084
             CONTRACT_NUMBER    = :WRK_CONTRACT_NUMBER                  21460084
                                  :NUL241F,                             21470084
             SERVICE_MODULE_1   = :WRK_SM1                              21480084
                                  :NUL241G,                             21490084
             SERVICE_MODULE_2   = :WRK_SM2                              21500084
                                  :NUL241H,                             21510084
             SERVICE_MODULE_3   = :WRK_SM3                              21520084
                                  :NUL241I,                             21530084
             SERVICE_MODULE_4   = :WRK_SM4                              21540084
                                  :NUL241J,                             21550084
             SERVICE_MODULE_5   = :WRK_SM5                              21560084
                                  :NUL241K,                             21570084
             COVERAGE_START_1   = :WRK_CS1                              21580084
                                  :NUL241L,                             21590084
             COVERAGE_END_1     = :WRK_CE1                              21600084
                                  :NUL241M,                             21610084
             COVERAGE_START_2   = :WRK_CS2                              21620084
                                  :NUL241N,                             21630084
             COVERAGE_END_2     = :WRK_CE2                              21640084
                                  :NUL241O,                             21650084
             COVERAGE_START_3   = :WRK_CS3                              21660084
                                  :NUL241P,                             21670084
             COVERAGE_END_3     = :WRK_CE3                              21680084
                                  :NUL241Q,                             21690084
             COVERAGE_START_4   = :WRK_CS4                              21700084
                                  :NUL241R,                             21710084
             COVERAGE_END_4     = :WRK_CE4                              21720084
                                  :NUL241S,                             21730084
             COVERAGE_START_5   = :WRK_CS5                              21740084
                                  :NUL241T,                             21750084
             COVERAGE_END_5     = :WRK_CE5                              21760084
                                  :NUL241U,                             21770084
             COVERAGE_START_6   = :WRK_CS6                              21780084
                                  :NUL241V,                             21790084
             COVERAGE_END_6     = :WRK_CE6                              21800084
                                  :NUL241W,                             21810084
             COVERAGE_START_7   = :WRK_CS7                              21820084
                                  :NUL241X,                             21830084
             COVERAGE_END_7     = :WRK_CE7                              21840084
                                  :NUL241Y,                             21850084
             SERVICE_TYPE       = :WRK_SERVICE_TYPE                     21860084
                                  :NUL241X,                             21870084
             SERVICE_LVL_CODE   = :WRK_SERVICE_LVL_CODE                 21880084
                                  :NUL2410,                             21890084
             AUTHORISATION_CODE = :WRK_AUTHORISATION_CODE               21900084
                                  :NUL2411,                             21910084
             SOURCE_INDICATOR   = :WRK_O                                21920084
                                  :NUL2412,                             21930084
             LAST_CHANGE_DATE   = :WRK_DATE                             21940084
                                  :NUL2413,                             21950084
             EFFECTIVE_DATE     = :WRK_EFFECTIVE_DATE                   21960084
                                  :NUL2414,                             21970084
             END_DATE           = :WRK_END_DATE                         21980084
                                  :NUL2415                              21990084
       WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                   22000084
         AND PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                     22010084
         AND ORIGIN             = :WRK_ORIGIN                           22020084
         AND SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER                  22030084
         AND EFFECTIVE_DATE     = :ORI_EFFECTIVE_DATE;                  22040084
                                                                        22050084
 SELECT (SQLCA.SQLCODE);                                                22060084
   WHEN (0);                                                            22070084
   OTHERWISE                                                            22080084
   DO;                                                                  22090084
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       22100084
     RCBM53O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0241 UPDATE = '       22110084
                       || PIC_EXPLAIN;                                  22120084
     RCBM53O.TYPEC     = DFHRED;                                        22130084
     RCBM53O.ORIGINC   = DFHRED;                                        22140084
     RCBM53O.SEQNOC    = DFHRED;                                        22150084
     RCBM53I.TYPEL     = -1;                                            22160084
     CALL RCBC53M_SEND_MAP_CSR;                                         22170084
   END;                                                                 22180084
 END;                                                                   22190084
                                                                        22200084
0END RCBC53M_UPDATE_CONTRACT;                                           22210084
1/********************************************************************/ 22220084
 /*      DELETE T241 RECORD BY SETTING WED TO TODAY                  */ 22230084
 /********************************************************************/ 22240084
0RCBC53M_DELETE_CONTRACT: PROC;                                         22250084
                                                                        22260084
 IF WRK_END_DATE < WRK_DATE THEN                                        22270084
 DO;                                                                    22280084
   RCBM53O.MSG_LINEO = ERR_O138;                                        22290084
   RCBM53O.TYPEC     = DFHRED;                                          22300084
   RCBM53O.ORIGINC   = DFHRED;                                          22310084
   RCBM53O.SEQNOC    = DFHRED;                                          22320084
   RCBM53I.TYPEL     = -1;                                              22330084
   CALL RCBC53M_SEND_MAP_CSR;                                           22340084
 END;                                                                   22350084
                                                                        22360084
 IF WRK_EFFECTIVE_DATE > WRK_DATE THEN                                  22370084
 DO;                                                                    22380084
   EXEC SQL                                                             22390084
        DELETE FROM RCBV0241_PI_CTR                                     22400084
        WHERE  COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                 22410084
          AND  PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                   22420084
          AND  ORIGIN             = :WRK_ORIGIN                         22430084
          AND  SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER                22440084
          AND  EFFECTIVE_DATE     = :WRK_EFFECTIVE_DATE;                22450084
                                                                        22460084
   SELECT (SQLCA.SQLCODE);                                              22470084
     WHEN (0)                                                           22480084
       RCBM53O.MSG_LINEO = ERR_O122;                                    22490084
                                                                        22500084
     OTHERWISE                                                          22510084
     DO;                                                                22520084
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     22530084
       RCBM53O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0241 DELETE = '     22540084
                         || PIC_EXPLAIN;                                22550084
       RCBM53O.TYPEC     = DFHRED;                                      22560084
       RCBM53O.ORIGINC   = DFHRED;                                      22570084
       RCBM53O.SEQNOC    = DFHRED;                                      22580084
       RCBM53I.TYPEL     = -1;                                          22590084
       CALL RCBC53M_SEND_MAP_CSR;                                       22600084
     END;                                                               22610084
   END;                                                                 22620084
 END;                                                                   22630084
                                                                        22640084
 ELSE DO;                                                               22650084
   CALL RCBC53M_ADD_DATE;                                               22660084
                                                                        22670084
   EXEC SQL                                                             22680084
        UPDATE RCBV0241_PI_CTR                                          22690084
        SET    END_DATE           = :WRK_DATE1                          22700084
                                    :NUL2415,                           22710084
               LAST_CHANGE_DATE   = :WRK_DATE                           22720084
                                    :NUL2413                            22730084
        WHERE  COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                 22740084
          AND  PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                   22750084
          AND  ORIGIN             = :WRK_ORIGIN                         22760084
          AND  SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER                22770084
          AND  EFFECTIVE_DATE     = :WRK_EFFECTIVE_DATE;                22780084
                                                                        22790084
   SELECT (SQLCA.SQLCODE);                                              22800084
     WHEN (0);                                                          22810084
     OTHERWISE                                                          22820084
     DO;                                                                22830084
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     22840084
       RCBM53O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0241 DELETE = '     22850084
                         || PIC_EXPLAIN;                                22860084
       RCBM53O.TYPEC     = DFHRED;                                      22870084
       RCBM53O.ORIGINC   = DFHRED;                                      22880084
       RCBM53O.SEQNOC    = DFHRED;                                      22890084
       RCBM53I.TYPEL     = -1;                                          22900084
       CALL RCBC53M_SEND_MAP_CSR;                                       22910084
     END;                                                               22920084
   END;                                                                 22930084
 END;                                                                   22940084
                                                                        22950084
0END RCBC53M_DELETE_CONTRACT;                                           22960084
1/********************************************************************/ 22970084
 /*      GET RCBT0051 RECORD                                         */ 22980084
 /********************************************************************/ 22990084
0RCBC53M_GET_T051: PROC;                                                23000084
                                                                        23010084
 WRK_REC_COUNT = 0;                                                     23020084
 EXEC SQL                                                               23030084
   SELECT COUNT(*)                                                      23040084
   INTO :WRK_REC_COUNT                                                  23050084
   FROM RCBV0051_PI_HW_PR                                               23060084
      WHERE  COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                   23070084
        AND  PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                     23080084
        AND  ORIGIN             = :WRK_ORIGIN                           23090084
        AND  SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER;                 23100084
                                                                        23110084
0END RCBC53M_GET_T051;                                                  23120084
1/********************************************************************/ 23130084
 /*      GET RCBT0241 RECORD                                         */ 23140084
 /********************************************************************/ 23150084
0RCBC53M_GET_T241: PROC;                                                23160084
                                                                        23170084
 WRK_REC_COUNT = 0;                                                     23180084
 EXEC SQL                                                               23190084
   SELECT COUNT(*)                                                      23200084
   INTO :WRK_REC_COUNT                                                  23210084
   FROM RCBV0241_PI_CTR                                                 23220084
      WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                      23230084
        AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                        23240084
        AND ORIGIN           = :WRK_ORIGIN                              23250084
        AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER                     23260084
        AND ((:RCBM53I.EFFECTIVE_DATEI BETWEEN                          23270084
                                EFFECTIVE_DATE AND END_DATE)            23280084
         OR (:RCBM53I.END_DATEI        BETWEEN                          23290084
                                EFFECTIVE_DATE AND END_DATE));          23300084
                                                                        23310084
0END RCBC53M_GET_T241;                                                  23320084
1/********************************************************************/ 23330084
 /*      GET RCBT0241 RECORD FOR EFFECTIVE DATE OVERLAPS             */ 23340084
 /********************************************************************/ 23350084
0RCBC53M_GET_T241_1: PROC;                                              23360084
                                                                        23370084
 WRK_REC_COUNT = 0;                                                     23380084
 EXEC SQL                                                               23390084
   SELECT COUNT(*)                                                      23400084
   INTO :WRK_REC_COUNT                                                  23410084
   FROM RCBV0241_PI_CTR                                                 23420084
      WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                      23430084
        AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                        23440084
        AND ORIGIN           = :WRK_ORIGIN                              23450084
        AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER                     23460084
        AND :RCBM53I.EFFECTIVE_DATEI BETWEEN                            23470084
                                EFFECTIVE_DATE AND END_DATE;            23480084
                                                                        23490084
0END RCBC53M_GET_T241_1;                                                23500084
1/********************************************************************/ 23510084
 /*      GET RCBT0241 RECORD FOR OVERLAPS                            */ 23520084
 /********************************************************************/ 23530084
0RCBC53M_GET_T241_2: PROC;                                              23540084
                                                                        23550084
 WRK_REC_COUNT = 0;                                                     23560084
 EXEC SQL                                                               23570084
   SELECT COUNT(*)                                                      23580084
   INTO :WRK_REC_COUNT                                                  23590084
   FROM RCBV0241_PI_CTR                                                 23600084
      WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                      23610084
        AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                        23620084
        AND ORIGIN           = :WRK_ORIGIN                              23630084
        AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER                     23640084
        AND (:RCBM53I.END_DATEI BETWEEN                                 23650084
                               EFFECTIVE_DATE AND END_DATE              23660084
          OR (:RCBM53I.EFFECTIVE_DATEI < EFFECTIVE_DATE                 23670084
            AND :RCBM53I.END_DATEI > END_DATE));                        23680084
                                                                        23690084
0END RCBC53M_GET_T241_2;                                                23700084
1/********************************************************************/ 23710084
 /*    COUNT RCBT0241 FOR SEARCH CRITERIA                            */ 23720084
 /********************************************************************/ 23730084
0RCBC53M_COUNT_T241: PROC;                                              23740084
                                                                        23750084
 WRK_REC_COUNT = 0;                                                     23760084
 EXEC SQL                                                               23770084
   SELECT COUNT(*)                                                      23780084
   INTO :WRK_REC_COUNT                                                  23790084
   FROM RCBV0241_PI_CTR                                                 23800084
   WHERE COUNTRY_NUMBER    = :WRK_COUNTRY_NUMBER                        23810084
     AND ((PRODUCT_TYPE    = :TYPE_SEL                                  23820084
      OR   :TYPE_ENT       = 'N')                                       23830084
     AND  (ORIGIN          = :ORIGIN_SEL                                23840084
      OR   :ORIGIN_ENT     = 'N')                                       23850084
     AND  (SEQUENCE_NUMBER = :SEQ_SEL                                   23860084
      OR   :SEQ_ENT        = 'N'));                                     23870084
                                                                        23880084
0END RCBC53M_COUNT_T241;                                                23890084
1/********************************************************************/ 23900084
 /*      GET RCBT0470 RECORD                                         */ 23910084
 /********************************************************************/ 23920084
0RCBC53M_GET_T470: PROC;                                                23930084
                                                                        23940084
 WRK_REC_COUNT = 0;                                                     23950084
 EXEC SQL                                                               23960084
   SELECT COUNT(*)                                                      23970084
   INTO :WRK_REC_COUNT                                                  23980084
   FROM RCBV0470_SERV_COND                                              23990084
   WHERE SERVICE_LVL_CODE = :RCBM53I.SERVICE_LVL_CODEI;                 24000084
                                                                        24010084
0END RCBC53M_GET_T470;                                                  24020084
1/********************************************************************/ 24030084
 /*      GET RCBT0640/645 RECORD                                     */ 24040084
 /********************************************************************/ 24050084
0RCBC53M_GET_T640: PROC;                                                24060084
                                                                        24070084
 WRK_REC_COUNT = 0;                                                     24080084
 EXEC SQL                                                               24090084
   SELECT COUNT(*)                                                      24100084
   INTO :WRK_REC_COUNT                                                  24110084
   FROM RCBV0645_CTRY_SVT                                               24120084
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           24130084
     AND SERVICE_TYPE   = :RCBM53I.SERVICE_TYPEI;                       24140084
                                                                        24150084
 IF WRK_REC_COUNT = 0 THEN                                              24160084
   EXEC SQL                                                             24170084
     SELECT COUNT(*)                                                    24180084
     INTO :WRK_REC_COUNT                                                24190084
     FROM RCBV0640_TRANS_SVT                                            24200084
     WHERE SERVICE_TYPE = :RCBM53I.SERVICE_TYPEI;                       24210084
                                                                        24220084
0END RCBC53M_GET_T640;                                                  24230084
1/********************************************************************/ 24240084
 /*      CREATE T241 RECORD                                          */ 24250084
 /********************************************************************/ 24260084
0RCBC53M_DEFINE_CONTRACT: PROC;                                         24270084
                                                                        24280084
 WRK_SM1             = SUBSTR(WRK_SERVICE_MODULE,1,2);                  24290084
 WRK_SM2             = SUBSTR(WRK_SERVICE_MODULE,3,2);                  24300084
 WRK_SM3             = SUBSTR(WRK_SERVICE_MODULE,5,2);                  24310084
 WRK_SM4             = SUBSTR(WRK_SERVICE_MODULE,7,2);                  24320084
 WRK_SM5             = SUBSTR(WRK_SERVICE_MODULE,9,2);                  24330084
                                                                        24340084
 RCB241S.COUNTRY_NUMBER      = WRK_COUNTRY_NUMBER;                      24350084
 RCB241S.PRODUCT_TYPE        = WRK_PRODUCT_TYPE;                        24360084
 RCB241S.ORIGIN              = WRK_ORIGIN;                              24370084
 RCB241S.SEQUENCE_NUMBER     = WRK_SEQUENCE_NUMBER;                     24380084
 RCB241S.HVP_QUANTITY        = WRK_HVP_QUANTITY;                        24390084
 RCB241S.CONTRACT_NUMBER     = WRK_CONTRACT_NUMBER;                     24400084
                                                                        24410084
 IF WRK_SM1 = '' THEN RCB241SI.INDNULL(7) = -1;                         24420084
 ELSE RCB241S.SERVICE_MODULE_1    = WRK_SM1;                            24430084
 IF WRK_SM2 = '' THEN RCB241SI.INDNULL(8) = -1;                         24440084
 ELSE RCB241S.SERVICE_MODULE_2    = WRK_SM2;                            24450084
 IF WRK_SM3 = '' THEN RCB241SI.INDNULL(9) = -1;                         24460084
 ELSE RCB241S.SERVICE_MODULE_3    = WRK_SM3;                            24470084
 IF WRK_SM4 = '' THEN RCB241SI.INDNULL(10) = -1;                        24480084
 ELSE RCB241S.SERVICE_MODULE_4    = WRK_SM4;                            24490084
 IF WRK_SM5 = '' THEN RCB241SI.INDNULL(11) = -1;                        24500084
 ELSE RCB241S.SERVICE_MODULE_5    = WRK_SM5;                            24510084
                                                                        24520084
 RCB241S.COVERAGE_START_1 = WRK_COVERAGE_START_1 || '.00';              24530084
 RCB241S.COVERAGE_END_1   = WRK_COVERAGE_END_1   || '.00';              24540084
 RCB241S.COVERAGE_START_2 = WRK_COVERAGE_START_2 || '.00';              24550084
 RCB241S.COVERAGE_END_2   = WRK_COVERAGE_END_2   || '.00';              24560084
 RCB241S.COVERAGE_START_3 = WRK_COVERAGE_START_3 || '.00';              24570084
 RCB241S.COVERAGE_END_3   = WRK_COVERAGE_END_3   || '.00';              24580084
 RCB241S.COVERAGE_START_4 = WRK_COVERAGE_START_4 || '.00';              24590084
 RCB241S.COVERAGE_END_4   = WRK_COVERAGE_END_4   || '.00';              24600084
 RCB241S.COVERAGE_START_5 = WRK_COVERAGE_START_5 || '.00';              24610084
 RCB241S.COVERAGE_END_5   = WRK_COVERAGE_END_5   || '.00';              24620084
 RCB241S.COVERAGE_START_6 = WRK_COVERAGE_START_6 || '.00';              24630084
 RCB241S.COVERAGE_END_6   = WRK_COVERAGE_END_6   || '.00';              24640084
 RCB241S.COVERAGE_START_7 = WRK_COVERAGE_START_7 || '.00';              24650084
 RCB241S.COVERAGE_END_7   = WRK_COVERAGE_END_7   || '.00';              24660084
                                                                        24670084
 IF WRK_SERVICE_LVL_CODE   = '' THEN RCB241SI.INDNULL(27) = -1;         24680084
 ELSE RCB241S.SERVICE_LVL_CODE    = WRK_SERVICE_LVL_CODE;               24690084
 IF WRK_AUTHORISATION_CODE = '' THEN RCB241SI.INDNULL(28) = -1;         24700084
 ELSE RCB241S.AUTHORISATION_CODE  = WRK_AUTHORISATION_CODE;             24710084
                                                                        24720084
 RCB241S.SERVICE_TYPE        = WRK_SERVICE_TYPE;                        24730084
 RCB241S.SOURCE_INDICATOR    = WRK_O;                                   24740084
 RCB241S.LAST_CHANGE_DATE    = WRK_DATE;                                24750084
 RCB241S.EFFECTIVE_DATE      = WRK_EFFECTIVE_DATE;                      24760084
 RCB241S.END_DATE            = WRK_END_DATE;                            24770084
 RCB241S.CUSTOMER_NUMBER     = WRK_CUSTOMER_NUMBER;      /* RB01289 */  24780084
                                                                        24790084
 EXEC SQL                                                               24800084
      INSERT INTO RCBV0241_PI_CTR                                       24810084
      (COUNTRY_NUMBER                                                   24820084
      ,PRODUCT_TYPE                                                     24830084
      ,ORIGIN                                                           24840084
      ,SEQUENCE_NUMBER                                                  24850084
      ,HVP_QUANTITY                                                     24860084
      ,CONTRACT_NUMBER                                                  24870084
      ,SERVICE_MODULE_1                                                 24880084
      ,SERVICE_MODULE_2                                                 24890084
      ,SERVICE_MODULE_3                                                 24900084
      ,SERVICE_MODULE_4                                                 24910084
      ,SERVICE_MODULE_5                                                 24920084
      ,COVERAGE_START_1                                                 24930084
      ,COVERAGE_END_1                                                   24940084
      ,COVERAGE_START_2                                                 24950084
      ,COVERAGE_END_2                                                   24960084
      ,COVERAGE_START_3                                                 24970084
      ,COVERAGE_END_3                                                   24980084
      ,COVERAGE_START_4                                                 24990084
      ,COVERAGE_END_4                                                   25000084
      ,COVERAGE_START_5                                                 25010084
      ,COVERAGE_END_5                                                   25020084
      ,COVERAGE_START_6                                                 25030084
      ,COVERAGE_END_6                                                   25040084
      ,COVERAGE_START_7                                                 25050084
      ,COVERAGE_END_7                                                   25060084
      ,SERVICE_TYPE                                                     25070084
      ,SERVICE_LVL_CODE                                                 25080084
      ,AUTHORISATION_CODE                                               25090084
      ,SOURCE_INDICATOR                                                 25100084
      ,LAST_CHANGE_DATE                                                 25110084
      ,EFFECTIVE_DATE                                                   25120084
      ,END_DATE                                                         25130084
      ,CUSTOMER_NUMBER)                                  /* RB01289 */  25140084
      VALUES (:RCB241S:RCB241SI.INDNULL);                               25150084
                                                                        25160084
 SELECT (SQLCA.SQLCODE);                                                25170084
   WHEN (0);                                                            25180084
                                                                        25190084
   WHEN (-803)                                                          25200084
   DO;                                                                  25210084
     RCBM53O.MSG_LINEO = 'This TOS already exists at these dates';      25220084
     RCBM53O.TYPEC     = DFHRED;                                        25230084
     RCBM53O.ORIGINC   = DFHRED;                                        25240084
     RCBM53O.SEQNOC    = DFHRED;                                        25250084
     RCBM53I.TYPEL     = -1;                                            25260084
     CALL RCBC53M_SEND_MAP_CSR;                                         25270084
   END;                                                                 25280084
                                                                        25290084
   OTHERWISE                                                            25300084
   DO;                                                                  25310084
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       25320084
     RCBM53O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0241 INSERT = '       25330084
                       || PIC_EXPLAIN;                                  25340084
     RCBM53O.TYPEC     = DFHRED;                                        25350084
     RCBM53O.ORIGINC   = DFHRED;                                        25360084
     RCBM53O.SEQNOC    = DFHRED;                                        25370084
     RCBM53I.TYPEL     = -1;                                            25380084
     CALL RCBC53M_SEND_MAP_CSR;                                         25390084
   END;                                                                 25400084
 END;                                                                   25410084
                                                                        25420084
0END RCBC53M_DEFINE_CONTRACT;                                           25430084
1/********************************************************************/ 25440084
 /*      CREATE T560 RECORD                                          */ 25450084
 /********************************************************************/ 25460084
0RCBC53M_UPD_T560: PROC;                                                25470084
                                                                        25480084
 /*DCL WRK_TIME_IN  CHAR(26) INIT('');           /* CEDS00000361      */25490084
                                                                        25500084
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         25510084
                                                                        25520084
 WRKMAP_DATA = ' ';                                                     25530084
 WRKMAP.PRODUCT_TYPE       = WRK_PRODUCT_TYPE;                          25540084
 WRKMAP.ORIGIN             = WRK_ORIGIN;                                25550084
 WRKMAP.SEQUENCE_NUMBER    = WRK_SEQUENCE_NUMBER;                       25560084
 WRKMAP.HVP_QUANTITY       = WRK_HVP_QUANTITY;                          25570084
 WRKMAP.CONTRACT_NUMBER    = WRK_CONTRACT_NUMBER;                       25580084
 WRKMAP.SERVICE_MODULE_1   = WRK_SM1;                                   25590084
 WRKMAP.SERVICE_MODULE_2   = WRK_SM2;                                   25600084
 WRKMAP.SERVICE_MODULE_3   = WRK_SM3;                                   25610084
 WRKMAP.SERVICE_MODULE_4   = WRK_SM4;                                   25620084
 WRKMAP.SERVICE_MODULE_5   = WRK_SM5;                                   25630084
 WRKMAP.COVERAGE_START_1   = WRK_COVERAGE_START_1;                      25640084
 WRKMAP.COVERAGE_END_1     = WRK_COVERAGE_END_1;                        25650084
 WRKMAP.COVERAGE_START_2   = WRK_COVERAGE_START_2;                      25660084
 WRKMAP.COVERAGE_END_2     = WRK_COVERAGE_END_2;                        25670084
 WRKMAP.COVERAGE_START_3   = WRK_COVERAGE_START_3;                      25680084
 WRKMAP.COVERAGE_END_3     = WRK_COVERAGE_END_3;                        25690084
 WRKMAP.COVERAGE_START_4   = WRK_COVERAGE_START_4;                      25700084
 WRKMAP.COVERAGE_END_4     = WRK_COVERAGE_END_4;                        25710084
 WRKMAP.COVERAGE_START_5   = WRK_COVERAGE_START_5;                      25720084
 WRKMAP.COVERAGE_END_5     = WRK_COVERAGE_END_5;                        25730084
 WRKMAP.COVERAGE_START_6   = WRK_COVERAGE_START_6;                      25740084
 WRKMAP.COVERAGE_END_6     = WRK_COVERAGE_END_6;                        25750084
 WRKMAP.COVERAGE_START_7   = WRK_COVERAGE_START_7;                      25760084
 WRKMAP.COVERAGE_END_7     = WRK_COVERAGE_END_7;                        25770084
 WRKMAP.SERVICE_TYPE       = WRK_SERVICE_TYPE;                          25780084
 WRKMAP.SERVICE_LVL_CODE   = WRK_SERVICE_LVL_CODE;                      25790084
 WRKMAP.AUTHORISATION_CODE = WRK_AUTHORISATION_CODE;                    25800084
 WRKMAP.SOURCE_INDICATOR   = WRK_O;                                     25810084
 WRKMAP.EFFECTIVE_DATE     = WRK_EFFECTIVE_DATE;                        25820084
 WRKMAP.END_DATE           = WRK_END_DATE;                              25830084
 WRKMAP.CUSTOMER_NUMBER    = WRK_CUSTOMER_NUMBER;                       25840084
                                                                        25850084
 RCB560S                 = ' ';                                         25860084
 RCB560S.COUNTRY_NUMBER  = WRK_COUNTRY_NUMBER;                          25870084
 RCB560S.TXN_CODE        = 'RCBTXN53';                                  25880084
 RCB560S.TIMESTAMP       = WRK_TIME_IN;                                 25890084
 RCB560S.USERID          = HEADER.USERID;                               25900084
 RCB560S.ACTION          = RCBM53I.ACTIONI;                             25910084
 RCB560S.DATA            = WRKMAP_DATA;                                 25920084
                                                                        25930084
 EXEC SQL                                                               25940084
      INSERT INTO RCBV0560_XACTION                                      25950084
      (COUNTRY_NUMBER,                                                  25960084
       TXN_CODE,                                                        25970084
       TIMESTAMP,                                                       25980084
       USERID,                                                          25990084
       ACTION,                                                          26000084
       DATA)                                                            26010084
        VALUES (:RCB560S:RCB560SI.INDNULL);                             26020084
                                                                        26030084
 SELECT(SQLCA.SQLCODE);                                                 26040084
   WHEN(0);                                                             26050084
   OTHERWISE                                                            26060084
   DO;                                                                  26070084
     RET_CODE = SQLCA.SQLCODE;                                          26080084
     SUB_CODE = SQLCA.SQLCABC;                                          26090084
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       26100084
     RCBM53O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0560 INSERT = '       26110084
                         || PIC_EXPLAIN;                                26120084
     CALL RCBC53M_SEND_MAP;                                             26130084
   END;                                                                 26140084
 END;                                                                   26150084
                                                                        26160084
0END RCBC53M_UPD_T560;                                                  26170084
1/********************************************************************/ 26180084
 /*      VALIDATE TIME PROCESSING                                    */ 26190084
 /********************************************************************/ 26200084
0RCBC53M_VALID_TIME: PROC(A_TIME ) RETURNS(BIT(1));                     26210084
 DCL L_RET          BIT(1) INIT(FALSE);                                 26220084
 DCL A_TIME         CHAR(5);                                            26230084
 DCL 1 S_TIME  BASED(ADDR(A_TIME)),                                     26240084
      3 HOURS    CHAR (2),                                              26250084
      3 DELIM    CHAR (1),                                              26260084
      3 MINUTES  CHAR (2);                                              26270084
                                                                        26280084
 IF VERIFY(S_TIME.HOURS,'0123456789') = 0                               26290084
  & VERIFY(S_TIME.DELIM,'.') = 0                                        26300084
  & VERIFY(S_TIME.MINUTES,'0123456789') = 0 THEN                        26310084
                                                                        26320084
 DO;                                                                    26330084
   IF (S_TIME.HOURS   >= '00' &                                         26340084
       S_TIME.HOURS   <= '23' &                                         26350084
       S_TIME.MINUTES >= '00' &                                         26360084
       S_TIME.MINUTES <= '59')                                          26370084
   |  (S_TIME.HOURS   = '24' &                                          26380084
       S_TIME.MINUTES = '00')                                           26390084
   THEN                                                                 26400084
     L_RET = TRUE;                                                      26410084
 END;                                                                   26420084
                                                                        26430084
 RETURN(L_RET);                                                         26440084
                                                                        26450084
0END RCBC53M_VALID_TIME;                                                26460084
1/********************************************************************/ 26470084
 /*      VALIDATE DATE PROCESSING                                    */ 26480084
 /********************************************************************/ 26490084
0RCBC53M_VALID_DATE: PROC(A_DATE ) RETURNS(BIT(1));                     26500084
 DCL A_DATE         CHAR(*);                                            26510084
 DCL L_RET          BIT(1) INIT(TRUE);                                  26520084
                                                                        26530084
 DATE_AREA               = '';                                          26540084
 DATE_AREA.WD_IN_FORMAT  = 'ISO';                                       26550084
 DATE_AREA.WD_OUT_FORMAT = 'ISO';                                       26560084
 DATE_AREA.WD_FUNCTION   = 'V';  /*VALIDATE*/                           26570084
 DATE_AREA.WD_IN_DATE    = A_DATE;                                      26580084
 CALL RCB004N (ADDR(DATE_AREA));                                        26590084
 /* TEST RESULT FROM RCB004N */                                         26600084
 IF (DATE_AREA.WD_STATUS ¬= ' ') THEN                                   26610084
 DO;                                                                    26620084
   L_RET = FALSE;                                                       26630084
 END;                                                                   26640084
                                                                        26650084
 RETURN(L_RET);                                                         26660084
                                                                        26670084
0END RCBC53M_VALID_DATE;                                                26680084
1/********************************************************************/ 26690084
 /*      VALIDATE DATE ADD                                           */ 26700084
 /********************************************************************/ 26710084
0RCBC53M_ADD_DATE: PROC;                                                26720084
                                                                        26730084
 DATE_AREA                = '';                                         26740084
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      26750084
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      26760084
 DATE_AREA.WD_FUNCTION    = 'C';                                        26770084
 DATE_AREA.WD_PERIOD_TYPE = 'D';                                        26780084
 DATE_AREA.WD_PERIOD      = -1;                                         26790084
 DATE_AREA.WD_IN_DATE     = WRK_DATE;                                   26800084
 CALL RCB004N (ADDR(DATE_AREA));                                        26810084
                                                                        26820084
 IF DATE_AREA.WD_STATUS = ' ' THEN                                      26830084
 DO;                                                                    26840084
   WRK_DATE1 = SUBSTR(DATE_AREA.WD_OUT_DATE,1,10);                      26850084
 END;                                                                   26860084
                                                                        26870084
0END RCBC53M_ADD_DATE;                                                  26880084
1/********************************************************************/ 26890084
 /*      CLEAR PROCESSING                                            */ 26900084
 /*         CLEAR OUT WORK FIELDS                                    */ 26910084
 /********************************************************************/ 26920084
0RCBC53M_CLEAR_WORK: PROC;                                              26930084
                                                                        26940084
 UPD_OK_FLAG              = FALSE;                                      26950084
 HEADER.NEXT              = '00';                                       26960084
 WRK_ACTION               = '';                                         26970084
 WRK_PRODUCT_TYPE         = '';                                         26980084
 WRK_ORIGIN               = '';                                         26990084
 WRK_SEQUENCE_NUMBER      = '';                                         27000084
 WRK_CONTRACT_NUMBER      = '';                                         27010084
 WRK_HVP_QUANTITY         = 0;                                          27020084
 WRK_EFFECTIVE_DATE       = '';                                         27030084
 WRK_END_DATE             = '';                                         27040084
 WRK_SERVICE_TYPE         = '';                                         27050084
 WRK_SERVICE_MODULE       = '';                                         27060084
 WRK_SERVICE_LVL_CODE     = '';                                         27070084
 WRK_AUTHORISATION_CODE   = '';                                         27080084
 WRK_COVERAGE_START_1     = '00.00';                                    27090084
 WRK_COVERAGE_END_1       = '00.00';                                    27100084
 WRK_COVERAGE_START_2     = '00.00';                                    27110084
 WRK_COVERAGE_END_2       = '00.00';                                    27120084
 WRK_COVERAGE_START_3     = '00.00';                                    27130084
 WRK_COVERAGE_END_3       = '00.00';                                    27140084
 WRK_COVERAGE_START_4     = '00.00';                                    27150084
 WRK_COVERAGE_END_4       = '00.00';                                    27160084
 WRK_COVERAGE_START_5     = '00.00';                                    27170084
 WRK_COVERAGE_END_5       = '00.00';                                    27180084
 WRK_COVERAGE_START_6     = '00.00';                                    27190084
 WRK_COVERAGE_END_6       = '00.00';                                    27200084
 WRK_COVERAGE_START_7     = '00.00';                                    27210084
 WRK_COVERAGE_END_7       = '00.00';                                    27220084
 PF5_FLAG                 = FALSE;                                      27230084
                                                                        27240084
0END RCBC53M_CLEAR_WORK;                                                27250084
1/********************************************************************/ 27260084
 /*      CLEAR MAP RCBM53A                                           */ 27270084
 /********************************************************************/ 27280084
0RCBC53M_CLEAR_SEL: PROC;                                               27290084
                                                                        27300084
 TYPE_SEL   = '****';                                                   27310084
 ORIGIN_SEL = '**';                                                     27320084
 SEQ_SEL    = '*******';                                                27330084
 TS_CNT     = 0;                                                        27340084
                                                                        27350084
0END RCBC53M_CLEAR_SEL;                                                 27360084
1/********************************************************************/ 27370084
 /*      GET CURSOR POSITION                                         */ 27380084
 /*         FOR RETURN FROM HELP SCREENS                             */ 27390084
 /********************************************************************/ 27400084
0RCBC53M_GET_CSR_POS: PROC;                                             27410084
                                                                        27420084
 SELECT(CSR_POS);                                                       27430084
   WHEN(1)  RCBM53I.ACTIONL             = -1;                           27440084
   WHEN(2)  RCBM53I.TYPEL               = -1;                           27450084
   WHEN(3)  RCBM53I.ORIGINL             = -1;                           27460084
   WHEN(4)  RCBM53I.SEQNOL              = -1;                           27470084
   WHEN(5)  RCBM53I.CONTRACT_NUMBERL    = -1;                           27480084
   WHEN(6)  RCBM53I.HVP_QUANTITYL       = -1;                           27490084
   WHEN(7)  RCBM53I.EFFECTIVE_DATEL     = -1;                           27500084
   WHEN(8)  RCBM53I.END_DATEL           = -1;                           27510084
   WHEN(9)  RCBM53I.SERVICE_TYPEL       = -1;                           27520084
   WHEN(10) RCBM53I.SERVICE_MODULEL     = -1;                           27530084
   WHEN(11) RCBM53I.SERVICE_LVL_CODEL   = -1;                           27540084
   WHEN(12) RCBM53I.AUTHORISATION_CODEL = -1;                           27550084
   WHEN(13) RCBM53I.COVERAGE_START_1L   = -1;                           27560084
   WHEN(14) RCBM53I.COVERAGE_START_2L   = -1;                           27570084
   WHEN(15) RCBM53I.COVERAGE_START_3L   = -1;                           27580084
   WHEN(16) RCBM53I.COVERAGE_START_4L   = -1;                           27590084
   WHEN(17) RCBM53I.COVERAGE_START_5L   = -1;                           27600084
   WHEN(18) RCBM53I.COVERAGE_START_6L   = -1;                           27610084
   WHEN(19) RCBM53I.COVERAGE_START_7L   = -1;                           27620084
   WHEN(20) RCBM53I.COVERAGE_END_1L     = -1;                           27630084
   WHEN(21) RCBM53I.COVERAGE_END_2L     = -1;                           27640084
   WHEN(22) RCBM53I.COVERAGE_END_3L     = -1;                           27650084
   WHEN(23) RCBM53I.COVERAGE_END_4L     = -1;                           27660084
   WHEN(24) RCBM53I.COVERAGE_END_5L     = -1;                           27670084
   WHEN(25) RCBM53I.COVERAGE_END_6L     = -1;                           27680084
   WHEN(26) RCBM53I.COVERAGE_END_7L     = -1;                           27690084
   OTHERWISE RCBM53I.ACTIONL            = -1;                           27700084
 END;                                                                   27710084
                                                                        27720084
0END RCBC53M_GET_CSR_POS;                                               27730084
1/********************************************************************/ 27740084
 /*      SAVE MAP FOR HELP                                           */ 27750084
 /********************************************************************/ 27760084
0RCBC53M_SAVE_MAP: PROC;                                                27770084
                                                                        27780084
 TMP_PRODUCT_TYPE       = RCBM53I.TYPEI;                                27790084
 TMP_ORIGIN             = RCBM53I.ORIGINI;                              27800084
 TMP_SEQUENCE_NUMBER    = RCBM53I.SEQNOI;                               27810084
 TMP_CONTRACT_NUMBER    = RCBM53I.CONTRACT_NUMBERI;                     27820084
 TMP_HVP_QUANTITY       = RCBM53I.HVP_QUANTITYI;                        27830084
 TMP_EFFECTIVE_DATE     = RCBM53I.EFFECTIVE_DATEI;                      27840084
 TMP_END_DATE           = RCBM53I.END_DATEI;                            27850084
 TMP_SERVICE_TYPE       = RCBM53I.SERVICE_TYPEI;                        27860084
 TMP_SERVICE_MODULE     = RCBM53I.SERVICE_MODULEI;                      27870084
 TMP_SERVICE_LVL_CODE   = RCBM53I.SERVICE_LVL_CODEI;                    27880084
 TMP_AUTHORISATION_CODE = RCBM53I.AUTHORISATION_CODEI;                  27890084
 TMP_COVERAGE_START_1   = RCBM53I.COVERAGE_START_1I;                    27900084
 TMP_COVERAGE_END_1     = RCBM53I.COVERAGE_END_1I;                      27910084
 TMP_COVERAGE_START_2   = RCBM53I.COVERAGE_START_2I;                    27920084
 TMP_COVERAGE_END_2     = RCBM53I.COVERAGE_END_2I;                      27930084
 TMP_COVERAGE_START_3   = RCBM53I.COVERAGE_START_3I;                    27940084
 TMP_COVERAGE_END_3     = RCBM53I.COVERAGE_END_3I;                      27950084
 TMP_COVERAGE_START_4   = RCBM53I.COVERAGE_START_4I;                    27960084
 TMP_COVERAGE_END_4     = RCBM53I.COVERAGE_END_4I;                      27970084
 TMP_COVERAGE_START_5   = RCBM53I.COVERAGE_START_5I;                    27980084
 TMP_COVERAGE_END_5     = RCBM53I.COVERAGE_END_5I;                      27990084
 TMP_COVERAGE_START_6   = RCBM53I.COVERAGE_START_6I;                    28000084
 TMP_COVERAGE_END_6     = RCBM53I.COVERAGE_END_6I;                      28010084
 TMP_COVERAGE_START_7   = RCBM53I.COVERAGE_START_7I;                    28020084
 TMP_COVERAGE_END_7     = RCBM53I.COVERAGE_END_7I;                      28030084
                                                                        28040084
0END RCBC53M_SAVE_MAP;                                                  28050084
1/********************************************************************/ 28060084
 /*      RESTORE MAP AFTER HELP                                      */ 28070084
 /********************************************************************/ 28080084
0RCBC53M_RESTORE_MAP: PROC;                                             28090084
                                                                        28100084
 RCBM53O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                      28110084
 RCBM53O.ACTIONO             = WRK_ACTION;                              28120084
 RCBM53O.TYPEO               = TMP_PRODUCT_TYPE;                        28130084
 RCBM53O.ORIGINO             = TMP_ORIGIN;                              28140084
 RCBM53O.SEQNOO              = TMP_SEQUENCE_NUMBER;                     28150084
 RCBM53O.CONTRACT_NUMBERO    = TMP_CONTRACT_NUMBER;                     28160084
 RCBM53O.HVP_QUANTITYO       = TMP_HVP_QUANTITY;                        28170084
 RCBM53O.EFFECTIVE_DATEO     = TMP_EFFECTIVE_DATE;                      28180084
 RCBM53O.END_DATEO           = TMP_END_DATE;                            28190084
 RCBM53O.SERVICE_TYPEO       = TMP_SERVICE_TYPE;                        28200084
 RCBM53O.SERVICE_MODULEO     = TMP_SERVICE_MODULE;                      28210084
 RCBM53O.SERVICE_LVL_CODEO   = TMP_SERVICE_LVL_CODE;                    28220084
 RCBM53O.AUTHORISATION_CODEO = TMP_AUTHORISATION_CODE;                  28230084
 RCBM53O.COVERAGE_START_1O   = TMP_COVERAGE_START_1;                    28240084
 RCBM53O.COVERAGE_END_1O     = TMP_COVERAGE_END_1;                      28250084
 RCBM53O.COVERAGE_START_2O   = TMP_COVERAGE_START_2;                    28260084
 RCBM53O.COVERAGE_END_2O     = TMP_COVERAGE_END_2;                      28270084
 RCBM53O.COVERAGE_START_3O   = TMP_COVERAGE_START_3;                    28280084
 RCBM53O.COVERAGE_END_3O     = TMP_COVERAGE_END_3;                      28290084
 RCBM53O.COVERAGE_START_4O   = TMP_COVERAGE_START_4;                    28300084
 RCBM53O.COVERAGE_END_4O     = TMP_COVERAGE_END_4;                      28310084
 RCBM53O.COVERAGE_START_5O   = TMP_COVERAGE_START_5;                    28320084
 RCBM53O.COVERAGE_END_5O     = TMP_COVERAGE_END_5;                      28330084
 RCBM53O.COVERAGE_START_6O   = TMP_COVERAGE_START_6;                    28340084
 RCBM53O.COVERAGE_END_6O     = TMP_COVERAGE_END_6;                      28350084
 RCBM53O.COVERAGE_START_7O   = TMP_COVERAGE_START_7;                    28360084
 RCBM53O.COVERAGE_END_7O     = TMP_COVERAGE_END_7;                      28370084
                                                                        28380084
0END RCBC53M_RESTORE_MAP;                                               28390084
1/********************************************************************/ 28400084
 /*      CLEAR MAP RCBM53                                            */ 28410084
 /********************************************************************/ 28420084
0RCBC53M_CLEAR_MAP: PROC;                                               28430084
                                                                        28440084
 RCBM53O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                      28450084
 RCBM53O.ACTIONO             = '';                                      28460084
 RCBM53O.TYPEO               = '';                                      28470084
 RCBM53O.ORIGINO             = '';                                      28480084
 RCBM53O.SEQNOO              = '';                                      28490084
 RCBM53O.CONTRACT_NUMBERO    = '';                                      28500084
 RCBM53O.HVP_QUANTITYO       = '0';                                     28510084
 RCBM53O.EFFECTIVE_DATEO     = '';                                      28520084
 RCBM53O.END_DATEO           = '';                                      28530084
 RCBM53O.SERVICE_TYPEO       = '';                                      28540084
 RCBM53O.SERVICE_MODULEO     = '';                                      28550084
 RCBM53O.SERVICE_LVL_CODEO   = '';                                      28560084
 RCBM53O.AUTHORISATION_CODEO = '';                                      28570084
 RCBM53O.COVERAGE_START_1O   = '00.00';                                 28580084
 RCBM53O.COVERAGE_END_1O     = '00.00';                                 28590084
 RCBM53O.COVERAGE_START_2O   = '00.00';                                 28600084
 RCBM53O.COVERAGE_END_2O     = '00.00';                                 28610084
 RCBM53O.COVERAGE_START_3O   = '00.00';                                 28620084
 RCBM53O.COVERAGE_END_3O     = '00.00';                                 28630084
 RCBM53O.COVERAGE_START_4O   = '00.00';                                 28640084
 RCBM53O.COVERAGE_END_4O     = '00.00';                                 28650084
 RCBM53O.COVERAGE_START_5O   = '00.00';                                 28660084
 RCBM53O.COVERAGE_END_5O     = '00.00';                                 28670084
 RCBM53O.COVERAGE_START_6O   = '00.00';                                 28680084
 RCBM53O.COVERAGE_END_6O     = '00.00';                                 28690084
 RCBM53O.COVERAGE_START_7O   = '00.00';                                 28700084
 RCBM53O.COVERAGE_END_7O     = '00.00';                                 28710084
                                                                        28720084
0END RCBC53M_CLEAR_MAP;                                                 28730084
1/********************************************************************/ 28740084
 /*      CLEAR MAP RCBM53A                                           */ 28750084
 /********************************************************************/ 28760084
0RCBC53M_CLEAR_MAPA: PROC;                                              28770084
                                                                        28780084
 M = 0;                                                                 28790084
 RCBM53AO.INCNTO    = '';                                               28800084
 RCBM53AO.TOTCNTO   = '';                                               28810084
 RCBM53AO.TYPE_SELO   = '';                                             28820084
 RCBM53AO.ORIGIN_SELO = '';                                             28830084
 RCBM53AO.SEQ_SELO    = '';                                             28840084
                                                                        28850084
 RCBM53AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         28860084
 DO I = 1 TO 15;                                                        28870084
   RCBM53AO.PRODUCT_TYPEO(I)    = '';                                   28880084
   RCBM53AO.ORIGINO(I)          = '';                                   28890084
   RCBM53AO.SEQUENCE_NUMBERO(I) = '';                                   28900084
   RCBM53AO.EFFECTIVE_DATEO(I)  = '';                                   28910084
   RCBM53AO.END_DATEO(I)        = '';                                   28920084
   RCBM53AO.CONTRACT_NUMBERO(I) = '';                                   28930084
   RCBM53AO.CUSTOMER_NUMBERO(I) = '';                  /* RB01289     */28940084
   RCBM53AO.SELO(I)             = '';                                   28950084
 END;                                                                   28960084
                                                                        28970084
0END RCBC53M_CLEAR_MAPA;                                                28980084
1/********************************************************************/ 28990084
 /*      CLEAR MAP RCBM53A 2                                         */ 29000084
 /********************************************************************/ 29010084
0RCBC53M_CLEAR_MAPA_2: PROC;                                            29020084
                                                                        29030084
 M = 0;                                                                 29040084
 RCBM53AO.INCNTO    = '';                                               29050084
 RCBM53AO.TOTCNTO   = '';                                               29060084
                                                                        29070084
 DO I = 1 TO 15;                                                        29080084
   RCBM53AO.PRODUCT_TYPEO(I)    = '';                                   29090084
   RCBM53AO.ORIGINO(I)          = '';                                   29100084
   RCBM53AO.SEQUENCE_NUMBERO(I) = '';                                   29110084
   RCBM53AO.EFFECTIVE_DATEO(I)  = '';                                   29120084
   RCBM53AO.END_DATEO(I)        = '';                                   29130084
   RCBM53AO.CONTRACT_NUMBERO(I) = '';                                   29140084
   RCBM53AO.SELO(I)             = '';                                   29150084
 END;                                                                   29160084
                                                                        29170084
0END RCBC53M_CLEAR_MAPA_2;                                              29180084
1/********************************************************************/ 29190084
 /*      SEND HELP MAP                                               */ 29200084
 /********************************************************************/ 29210084
0RCBC53M_HELP_MAP : PROC;                                               29220084
                                                                        29230084
 HEADER.NEXT = 'H1';                                                    29240084
 HELP_FLAG = FALSE;                                                     29250084
                                                                        29260084
 IF HEADER.REQUEST_ID = '' THEN                                         29270084
 DO;                                                                    29280084
   CSR_POS     = 1;                                                     29290084
   CALL RCBC53M_RECEIVE_MAP;                                            29300084
   CALL RCBC53M_SAVE_MAP;                                               29310084
                                                                        29320084
   IF RCBM53I.ACTIONF = CSR_HELP                                        29330084
    | RCBM53I.ACTIONF = CSR_EOF THEN                                    29340084
   DO;                                                                  29350084
     CSR_POS   = 1;                                                     29360084
     HELP_FLAG = TRUE;                                                  29370084
     EXEC CICS SEND                                                     29380084
        MAP('ACT123')                                                   29390084
        MAPSET('RCBHELP')                                               29400084
        FREEKB                                                          29410084
        ERASE;                                                          29420084
   END;                                                                 29430084
                                                                        29440084
   IF RCBM53I.TYPEF = CSR_HELP                                          29450084
    | RCBM53I.TYPEF = CSR_EOF THEN                                      29460084
   DO;                                                                  29470084
     CSR_POS   = 2;                                                     29480084
     HELP_FLAG = TRUE;                                                  29490084
     EXEC CICS SEND                                                     29500084
        MAP('TOS')                                                      29510084
        MAPSET('RCBHELP')                                               29520084
        FREEKB                                                          29530084
        ERASE;                                                          29540084
   END;                                                                 29550084
                                                                        29560084
   IF RCBM53I.ORIGINF = CSR_HELP                                        29570084
    | RCBM53I.ORIGINF = CSR_EOF THEN                                    29580084
   DO;                                                                  29590084
     CSR_POS   = 3;                                                     29600084
     HELP_FLAG = TRUE;                                                  29610084
     EXEC CICS SEND                                                     29620084
        MAP('TOS')                                                      29630084
        MAPSET('RCBHELP')                                               29640084
        FREEKB                                                          29650084
        ERASE;                                                          29660084
   END;                                                                 29670084
                                                                        29680084
   IF RCBM53I.SEQNOF = CSR_HELP                                         29690084
    | RCBM53I.SEQNOF = CSR_EOF THEN                                     29700084
   DO;                                                                  29710084
     CSR_POS   = 4;                                                     29720084
     HELP_FLAG = TRUE;                                                  29730084
     EXEC CICS SEND                                                     29740084
        MAP('TOS')                                                      29750084
        MAPSET('RCBHELP')                                               29760084
        FREEKB                                                          29770084
        ERASE;                                                          29780084
   END;                                                                 29790084
                                                                        29800084
   IF RCBM53I.CONTRACT_NUMBERF = CSR_HELP                               29810084
    | RCBM53I.CONTRACT_NUMBERF = CSR_EOF THEN                           29820084
   DO;                                                                  29830084
     CSR_POS   = 5;                                                     29840084
     HELP_FLAG = TRUE;                                                  29850084
     EXEC CICS SEND                                                     29860084
        MAP('CONTNO')                                                   29870084
        MAPSET('RCBHELP')                                               29880084
        FREEKB                                                          29890084
        ERASE;                                                          29900084
   END;                                                                 29910084
                                                                        29920084
   IF RCBM53I.HVP_QUANTITYF = CSR_HELP                                  29930084
    | RCBM53I.HVP_QUANTITYF = CSR_EOF THEN                              29940084
   DO;                                                                  29950084
     CSR_POS   = 6;                                                     29960084
     HELP_FLAG = TRUE;                                                  29970084
     EXEC CICS SEND                                                     29980084
        MAP('HVPQTY')                                                   29990084
        MAPSET('RCBHELP')                                               30000084
        FREEKB                                                          30010084
        ERASE;                                                          30020084
   END;                                                                 30030084
                                                                        30040084
   IF RCBM53I.EFFECTIVE_DATEF = CSR_HELP                                30050084
    | RCBM53I.EFFECTIVE_DATEF = CSR_EOF THEN                            30060084
   DO;                                                                  30070084
     CSR_POS   = 7;                                                     30080084
     HELP_FLAG = TRUE;                                                  30090084
     EXEC CICS SEND                                                     30100084
        MAP('EFFDATE')                                                  30110084
        MAPSET('RCBHELP')                                               30120084
        FREEKB                                                          30130084
        ERASE;                                                          30140084
   END;                                                                 30150084
                                                                        30160084
   IF RCBM53I.END_DATEF = CSR_HELP                                      30170084
    | RCBM53I.END_DATEF = CSR_EOF THEN                                  30180084
   DO;                                                                  30190084
     CSR_POS   = 8;                                                     30200084
     HELP_FLAG = TRUE;                                                  30210084
     EXEC CICS SEND                                                     30220084
        MAP('ENDDATE')                                                  30230084
        MAPSET('RCBHELP')                                               30240084
        FREEKB                                                          30250084
        ERASE;                                                          30260084
   END;                                                                 30270084
                                                                        30280084
   IF RCBM53I.SERVICE_TYPEF = CSR_HELP                                  30290084
    | RCBM53I.SERVICE_TYPEF = CSR_EOF THEN                              30300084
   DO;                                                                  30310084
     CSR_POS   = 9;                                                     30320084
     HELP_FLAG = TRUE;                                                  30330084
     EXEC CICS SEND                                                     30340084
        MAP('SERVTYP')                                                  30350084
        MAPSET('RCBHELP')                                               30360084
        FREEKB                                                          30370084
        ERASE;                                                          30380084
   END;                                                                 30390084
                                                                        30400084
   IF RCBM53I.SERVICE_MODULEF = CSR_HELP                                30410084
    | RCBM53I.SERVICE_MODULEF = CSR_EOF THEN                            30420084
   DO;                                                                  30430084
     CSR_POS   = 10;                                                    30440084
     HELP_FLAG = TRUE;                                                  30450084
     EXEC CICS SEND                                                     30460084
        MAP('SERVMOD')                                                  30470084
        MAPSET('RCBHELP')                                               30480084
        FREEKB                                                          30490084
        ERASE;                                                          30500084
   END;                                                                 30510084
                                                                        30520084
   IF RCBM53I.SERVICE_LVL_CODEF = CSR_HELP                              30530084
    | RCBM53I.SERVICE_LVL_CODEF = CSR_EOF THEN                          30540084
   DO;                                                                  30550084
     CSR_POS   = 11;                                                    30560084
     HELP_FLAG = TRUE;                                                  30570084
     EXEC CICS SEND                                                     30580084
        MAP('SLC')                                                      30590084
        MAPSET('RCBHELP')                                               30600084
        FREEKB                                                          30610084
        ERASE;                                                          30620084
   END;                                                                 30630084
                                                                        30640084
   IF RCBM53I.AUTHORISATION_CODEF = CSR_HELP                            30650084
    | RCBM53I.AUTHORISATION_CODEF = CSR_EOF THEN                        30660084
   DO;                                                                  30670084
     CSR_POS   = 12;                                                    30680084
     HELP_FLAG = TRUE;                                                  30690084
     EXEC CICS SEND                                                     30700084
        MAP('AUTHCOD')                                                  30710084
        MAPSET('RCBHELP')                                               30720084
        FREEKB                                                          30730084
        ERASE;                                                          30740084
   END;                                                                 30750084
                                                                        30760084
   IF RCBM53I.COVERAGE_START_1F = CSR_HELP                              30770084
    | RCBM53I.COVERAGE_START_1F = CSR_EOF THEN                          30780084
   DO;                                                                  30790084
     CSR_POS   = 13;                                                    30800084
     HELP_FLAG = TRUE;                                                  30810084
     EXEC CICS SEND                                                     30820084
        MAP('SRVHRSF')                                                  30830084
        MAPSET('RCBHELP')                                               30840084
        FREEKB                                                          30850084
        ERASE;                                                          30860084
   END;                                                                 30870084
                                                                        30880084
   IF RCBM53I.COVERAGE_START_2F = CSR_HELP                              30890084
    | RCBM53I.COVERAGE_START_2F = CSR_EOF THEN                          30900084
   DO;                                                                  30910084
     CSR_POS   = 14;                                                    30920084
     HELP_FLAG = TRUE;                                                  30930084
     EXEC CICS SEND                                                     30940084
        MAP('SRVHRSF')                                                  30950084
        MAPSET('RCBHELP')                                               30960084
        FREEKB                                                          30970084
        ERASE;                                                          30980084
   END;                                                                 30990084
                                                                        31000084
   IF RCBM53I.COVERAGE_START_3F = CSR_HELP                              31010084
    | RCBM53I.COVERAGE_START_3F = CSR_EOF THEN                          31020084
   DO;                                                                  31030084
     CSR_POS   = 15;                                                    31040084
     HELP_FLAG = TRUE;                                                  31050084
     EXEC CICS SEND                                                     31060084
        MAP('SRVHRSF')                                                  31070084
        MAPSET('RCBHELP')                                               31080084
        FREEKB                                                          31090084
        ERASE;                                                          31100084
   END;                                                                 31110084
                                                                        31120084
   IF RCBM53I.COVERAGE_START_4F = CSR_HELP                              31130084
    | RCBM53I.COVERAGE_START_4F = CSR_EOF THEN                          31140084
   DO;                                                                  31150084
     CSR_POS   = 16;                                                    31160084
     HELP_FLAG = TRUE;                                                  31170084
     EXEC CICS SEND                                                     31180084
        MAP('SRVHRSF')                                                  31190084
        MAPSET('RCBHELP')                                               31200084
        FREEKB                                                          31210084
        ERASE;                                                          31220084
   END;                                                                 31230084
                                                                        31240084
   IF RCBM53I.COVERAGE_START_5F = CSR_HELP                              31250084
    | RCBM53I.COVERAGE_START_5F = CSR_EOF THEN                          31260084
   DO;                                                                  31270084
     CSR_POS   = 17;                                                    31280084
     HELP_FLAG = TRUE;                                                  31290084
     EXEC CICS SEND                                                     31300084
        MAP('SRVHRSF')                                                  31310084
        MAPSET('RCBHELP')                                               31320084
        FREEKB                                                          31330084
        ERASE;                                                          31340084
   END;                                                                 31350084
                                                                        31360084
   IF RCBM53I.COVERAGE_START_6F = CSR_HELP                              31370084
    | RCBM53I.COVERAGE_START_6F = CSR_EOF THEN                          31380084
   DO;                                                                  31390084
     CSR_POS   = 18;                                                    31400084
     HELP_FLAG = TRUE;                                                  31410084
     EXEC CICS SEND                                                     31420084
        MAP('SRVHRSF')                                                  31430084
        MAPSET('RCBHELP')                                               31440084
        FREEKB                                                          31450084
        ERASE;                                                          31460084
   END;                                                                 31470084
                                                                        31480084
   IF RCBM53I.COVERAGE_START_7F = CSR_HELP                              31490084
    | RCBM53I.COVERAGE_START_7F = CSR_EOF THEN                          31500084
   DO;                                                                  31510084
     CSR_POS   = 19;                                                    31520084
     HELP_FLAG = TRUE;                                                  31530084
     EXEC CICS SEND                                                     31540084
        MAP('SRVHRSF')                                                  31550084
        MAPSET('RCBHELP')                                               31560084
        FREEKB                                                          31570084
        ERASE;                                                          31580084
   END;                                                                 31590084
                                                                        31600084
   IF RCBM53I.COVERAGE_END_1F = CSR_HELP                                31610084
    | RCBM53I.COVERAGE_END_1F = CSR_EOF THEN                            31620084
   DO;                                                                  31630084
     CSR_POS   = 20;                                                    31640084
     HELP_FLAG = TRUE;                                                  31650084
     EXEC CICS SEND                                                     31660084
        MAP('SRVHRST')                                                  31670084
        MAPSET('RCBHELP')                                               31680084
        FREEKB                                                          31690084
        ERASE;                                                          31700084
   END;                                                                 31710084
                                                                        31720084
   IF RCBM53I.COVERAGE_END_2F = CSR_HELP                                31730084
    | RCBM53I.COVERAGE_END_2F = CSR_EOF THEN                            31740084
   DO;                                                                  31750084
     CSR_POS   = 21;                                                    31760084
     HELP_FLAG = TRUE;                                                  31770084
     EXEC CICS SEND                                                     31780084
        MAP('SRVHRST')                                                  31790084
        MAPSET('RCBHELP')                                               31800084
        FREEKB                                                          31810084
        ERASE;                                                          31820084
   END;                                                                 31830084
                                                                        31840084
   IF RCBM53I.COVERAGE_END_3F = CSR_HELP                                31850084
    | RCBM53I.COVERAGE_END_3F = CSR_EOF THEN                            31860084
   DO;                                                                  31870084
     CSR_POS   = 22;                                                    31880084
     HELP_FLAG = TRUE;                                                  31890084
     EXEC CICS SEND                                                     31900084
        MAP('SRVHRST')                                                  31910084
        MAPSET('RCBHELP')                                               31920084
        FREEKB                                                          31930084
        ERASE;                                                          31940084
   END;                                                                 31950084
                                                                        31960084
   IF RCBM53I.COVERAGE_END_4F = CSR_HELP                                31970084
    | RCBM53I.COVERAGE_END_4F = CSR_EOF THEN                            31980084
   DO;                                                                  31990084
     CSR_POS   = 23;                                                    32000084
     HELP_FLAG = TRUE;                                                  32010084
     EXEC CICS SEND                                                     32020084
        MAP('SRVHRST')                                                  32030084
        MAPSET('RCBHELP')                                               32040084
        FREEKB                                                          32050084
        ERASE;                                                          32060084
   END;                                                                 32070084
                                                                        32080084
   IF RCBM53I.COVERAGE_END_5F = CSR_HELP                                32090084
    | RCBM53I.COVERAGE_END_5F = CSR_EOF THEN                            32100084
   DO;                                                                  32110084
     CSR_POS   = 24;                                                    32120084
     HELP_FLAG = TRUE;                                                  32130084
     EXEC CICS SEND                                                     32140084
        MAP('SRVHRST')                                                  32150084
        MAPSET('RCBHELP')                                               32160084
        FREEKB                                                          32170084
        ERASE;                                                          32180084
   END;                                                                 32190084
                                                                        32200084
   IF RCBM53I.COVERAGE_END_6F = CSR_HELP                                32210084
    | RCBM53I.COVERAGE_END_6F = CSR_EOF THEN                            32220084
   DO;                                                                  32230084
     CSR_POS   = 25;                                                    32240084
     HELP_FLAG = TRUE;                                                  32250084
     EXEC CICS SEND                                                     32260084
        MAP('SRVHRST')                                                  32270084
        MAPSET('RCBHELP')                                               32280084
        FREEKB                                                          32290084
        ERASE;                                                          32300084
   END;                                                                 32310084
                                                                        32320084
   IF RCBM53I.COVERAGE_END_7F = CSR_HELP                                32330084
    | RCBM53I.COVERAGE_END_7F = CSR_EOF THEN                            32340084
   DO;                                                                  32350084
     CSR_POS   = 26;                                                    32360084
     HELP_FLAG = TRUE;                                                  32370084
     EXEC CICS SEND                                                     32380084
        MAP('SRVHRST')                                                  32390084
        MAPSET('RCBHELP')                                               32400084
        FREEKB                                                          32410084
        ERASE;                                                          32420084
   END;                                                                 32430084
                                                                        32440084
   IF HELP_FLAG = FALSE THEN                                            32450084
     EXEC CICS SEND                                                     32460084
        MAP('RCBH53')                                                   32470084
        MAPSET('RCBM53')                                                32480084
        FREEKB                                                          32490084
        ERASE;                                                          32500084
                                                                        32510084
 END;                                                                   32520084
                                                                        32530084
 ELSE DO;                                                               32540084
   EXEC CICS SEND                                                       32550084
      MAP('RCBH53A')                                                    32560084
      MAPSET('RCBM53')                                                  32570084
      FREEKB                                                            32580084
      ERASE;                                                            32590084
 END;                                                                   32600084
                                                                        32610084
0EXEC CICS RETURN                                                       32620084
    TRANSID('RC53')                                                     32630084
    COMMAREA(COMMAREA)                                                  32640084
    LENGTH(CSTG(COMMAREA))                                              32650084
    RESP(RESPONSE)                                                      32660084
    RESP2(CODE_EXPLAIN);                                                32670084
                                                                        32680084
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 32690084
   WHEN(DFHRESP(NORMAL));                                               32700084
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  32710084
   DO;                                                                  32720084
     COMMAREA_LENGTH = EIBCALEN;                                        32730084
     EXEC CICS RETURN                                                   32740084
        TRANSID('RC53')                                                 32750084
        COMMAREA(COMMAREA)                                              32760084
        LENGTH(COMMAREA_LENGTH);                                        32770084
   END;                                                                 32780084
   OTHERWISE                                                            32790084
   DO;                                                                  32800084
     RCBM53O.MSG_LINEO = ERR_MESSAGE30;                                 32810084
     CALL RCBC53M_SEND_MAP;                                             32820084
   END;                                                                 32830084
 END;                                                                   32840084
                                                                        32850084
0END RCBC53M_HELP_MAP;                                                  32860084
1/********************************************************************/ 32870084
 /*      SEND MAP                                                    */ 32880084
 /********************************************************************/ 32890084
0RCBC53M_SEND_MAP: PROC;                                                32900084
                                                                        32910084
 HEADER.REQUEST_ID = '';                                                32920084
                                                                        32930084
0EXEC CICS SEND                                                         32940084
    MAP('RCBM53')                                                       32950084
    MAPSET('RCBM53')                                                    32960084
    FREEKB                                                              32970084
    ERASE                                                               32980084
    RESP(RESPONSE)                                                      32990084
    RESP2(CODE_EXPLAIN);                                                33000084
                                                                        33010084
0EXEC CICS RETURN                                                       33020084
    TRANSID('RC53')                                                     33030084
    COMMAREA(COMMAREA)                                                  33040084
    LENGTH(CSTG(COMMAREA))                                              33050084
    RESP(RESPONSE)                                                      33060084
    RESP2(CODE_EXPLAIN);                                                33070084
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 33080084
   WHEN(DFHRESP(NORMAL));                                               33090084
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  33100084
   DO;                                                                  33110084
     COMMAREA_LENGTH = EIBCALEN;                                        33120084
     EXEC CICS RETURN                                                   33130084
        TRANSID('RC53')                                                 33140084
        COMMAREA(COMMAREA)                                              33150084
        LENGTH(COMMAREA_LENGTH);                                        33160084
   END;                                                                 33170084
   OTHERWISE                                                            33180084
   DO;                                                                  33190084
     RCBM53O.MSG_LINEO = ERR_MESSAGE30;                                 33200084
     CALL RCBC53M_SEND_MAP;                                             33210084
   END;                                                                 33220084
 END;                                                                   33230084
                                                                        33240084
0END RCBC53M_SEND_MAP;                                                  33250084
1/********************************************************************/ 33260084
 /*      SEND MAP WITH CURSOR                                        */ 33270084
 /********************************************************************/ 33280084
0RCBC53M_SEND_MAP_CSR: PROC;                                            33290084
                                                                        33300084
 HEADER.REQUEST_ID = '';                                                33310084
                                                                        33320084
0EXEC CICS SEND                                                         33330084
    MAP('RCBM53')                                                       33340084
    MAPSET('RCBM53')                                                    33350084
    FREEKB                                                              33360084
    ERASE                                                               33370084
    CURSOR                                                              33380084
    RESP(RESPONSE)                                                      33390084
    RESP2(CODE_EXPLAIN);                                                33400084
                                                                        33410084
0EXEC CICS RETURN                                                       33420084
    TRANSID('RC53')                                                     33430084
    COMMAREA(COMMAREA)                                                  33440084
    LENGTH(CSTG(COMMAREA))                                              33450084
    RESP(RESPONSE)                                                      33460084
    RESP2(CODE_EXPLAIN);                                                33470084
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 33480084
   WHEN(DFHRESP(NORMAL));                                               33490084
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  33500084
   DO;                                                                  33510084
     COMMAREA_LENGTH = EIBCALEN;                                        33520084
     EXEC CICS RETURN                                                   33530084
        TRANSID('RC53')                                                 33540084
        COMMAREA(COMMAREA)                                              33550084
        LENGTH(COMMAREA_LENGTH);                                        33560084
   END;                                                                 33570084
   OTHERWISE                                                            33580084
   DO;                                                                  33590084
     RCBM53O.MSG_LINEO = ERR_MESSAGE30;                                 33600084
     CALL RCBC53M_SEND_MAP;                                             33610084
   END;                                                                 33620084
 END;                                                                   33630084
                                                                        33640084
0END RCBC53M_SEND_MAP_CSR;                                              33650084
1/********************************************************************/ 33660084
 /*      SEND MAP RCBM53A                                            */ 33670084
 /********************************************************************/ 33680084
0RCBC53M_SEND_MAPA: PROC;                                               33690084
                                                                        33700084
 HEADER.REQUEST_ID = 'A';                                               33710084
                                                                        33720084
0EXEC CICS SEND                                                         33730084
    MAP('RCBM53A')                                                      33740084
    MAPSET('RCBM53')                                                    33750084
    FREEKB                                                              33760084
    ERASE                                                               33770084
    RESP(RESPONSE)                                                      33780084
    RESP2(CODE_EXPLAIN);                                                33790084
                                                                        33800084
0SELECT(RESPONSE);                                                      33810084
    WHEN(DFHRESP(NORMAL))                                               33820084
    DO;                                                                 33830084
      EXEC CICS RETURN                                                  33840084
         TRANSID('RC53')                                                33850084
         COMMAREA(COMMAREA)                                             33860084
         LENGTH(CSTG(COMMAREA));                                        33870084
    END;                                                                33880084
    OTHERWISE                                                           33890084
    DO;                                                                 33900084
      RCBM53AO.MSG_LINEO = ERR_MESSAGE2 || 'RCBM53A';                   33910084
      CALL RCBC53M_SEND_MAPA;                                           33920084
    END;                                                                33930084
 END;                                                                   33940084
0END RCBC53M_SEND_MAPA;                                                 33950084
1/********************************************************************/ 33960084
 /*      SEND MAP RCBM53A WITH CURSOR                                */ 33970084
 /********************************************************************/ 33980084
0RCBC53M_SEND_MAPA_CSR: PROC;                                           33990084
                                                                        34000084
 HEADER.REQUEST_ID = 'A';                                               34010084
                                                                        34020084
0EXEC CICS SEND                                                         34030084
    MAP('RCBM53A')                                                      34040084
    MAPSET('RCBM53')                                                    34050084
    FREEKB                                                              34060084
    ERASE                                                               34070084
    CURSOR                                                              34080084
    RESP(RESPONSE)                                                      34090084
    RESP2(CODE_EXPLAIN);                                                34100084
                                                                        34110084
0SELECT(RESPONSE);                                                      34120084
    WHEN(DFHRESP(NORMAL))                                               34130084
    DO;                                                                 34140084
      EXEC CICS RETURN                                                  34150084
         TRANSID('RC53')                                                34160084
         COMMAREA(COMMAREA)                                             34170084
         LENGTH(CSTG(COMMAREA));                                        34180084
    END;                                                                34190084
    OTHERWISE                                                           34200084
    DO;                                                                 34210084
      RCBM53AO.MSG_LINEO = ERR_MESSAGE2 || 'RCBM53A';                   34220084
      CALL RCBC53M_SEND_MAPA;                                           34230084
    END;                                                                34240084
 END;                                                                   34250084
0END RCBC53M_SEND_MAPA_CSR;                                             34260084
1/*******************************************************************/  34270084
 /* GET CUSTOMER NUMBER FROM TABLE T051                             */  34280084
 /*******************************************************************/  34290084
 RCBC53M_GET_CUSTOMER_NUMBER: PROC;                    /* SOC RB01289 */34300084
                                                                        34310084
 WRK_CUSTOMER_NUMBER = '';                                              34320084
                                                                        34330084
 EXEC SQL                                                               34340084
   SELECT CUSTOMER_NUMBER                                               34350084
   INTO :WRK_CUSTOMER_NUMBER                                            34360084
   FROM RCBV0051_PI_HW_PR                                               34370084
      WHERE  COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                   34380084
        AND  PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                     34390084
        AND  ORIGIN             = :WRK_ORIGIN                           34400084
        AND  SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER;                 34410084
 SELECT(SQLCA.SQLCODE);                                                 34420084
    WHEN(0);                                                            34430084
    OTHERWISE                                                           34440084
    DO;                                                                 34450084
      RCBM53O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';  34460084
      CALL RCBC53M_SEND_MAP;                                            34470084
    END;                                                                34480084
  END;                                                                  34490084
                                                                        34500084
 END RCBC53M_GET_CUSTOMER_NUMBER;                      /* EOC RB01289 */34510084
1/*******************************************************************/  34520084
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  34530084
 /*******************************************************************/  34540084
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  34550084
  $DAIMOD (RCBC53M);                     /* MODULE TO BE COMPILED   */  34560084
0/*******************************************************************/  34570084
 /* END OF ABR BLOCK '                                              */  34580084
 /*******************************************************************/  34590084
0 END RCBC53M;                                                          34600084