 /* RCBC51P - MAINTAIN PRIME INPUT CUSTOMER                          */ 00011027
 /********************************************************************/ 00020025
 /*                                                                  */ 00030025
 /* TRANSACTION CODE    : RC51                                       */ 00040025
 /*                                                                  */ 00050025
 /* PROGRAM NAME        : RCBC51M                                    */ 00060025
 /*                                                                  */ 00070025
 /* TYPE                : CICS/VS                                    */ 00080025
 /*                                                                  */ 00090025
 /* USED MAPSET         : RCBM51                                     */ 00100025
 /*      MAP            : RCBM51                                     */ 00110025
 /*                     : RCBH51                                     */ 00120025
 /*                                                                  */ 00130025
 /*                                                                  */ 00140025
 /* DESCRIPTION         : MAINTAIN PRIME INPUT CUSTOMER              */ 00150025
 /*                                                                  */ 00160025
 /* LINKED TRANSACTION  : RC51                                       */ 00170025
 /*                                                                  */ 00180025
 /* MESSAGES            :                                            */ 00190025
 /*                                                                  */ 00200025
 /*                                                                  */ 00210025
 /*  MAINTENANCE LOG :                                               */ 00220025
 /*  ---------------                                                 */ 00230025
 /*                                                                  */ 00240025
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00250025
 /*  --------------------------------------------------------------  */ 00260025
 /*  2001-10-16 | RC01230      | CSP TO PL1/CICS CONVERSION          */ 00270025
 /*  2003/12/08 | RB01261      | MAKE COUNTRY NUMBER CHANGEABLE      */ 00280025
 /*  2003/12/08 | RB01263      | MINOR CICS CHANGES                  */ 00290025
 /*  2008/02/08 | CEDS00000361 | WORK_DATE HAS ASSIGNED              */ 00300025
 /*  2008/02/27 | RB01289      | PRIME INPUT CUSTOMER NUMBER         */ 00310025
 /*  2008/04/16 | CEDS00000385 | TYPO IN A MESSAGE                   */ 00320025
 /*                                                                  */ 00330025
 /********************************************************************/ 00340025
1RCBC51M: PROC(COMMPTR)                                                 00350025
          OPTIONS (MAIN)                                                00360025
          REORDER;                                                      00370025
0/********************************************************************/ 00380025
 /*  EXTERNAL ENTRIES                                                */ 00390025
 /********************************************************************/ 00400025
                                                                        00410025
0DCL PLIXOPT   VAR  CHAR (256)                                          00420025
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;            00430025
                                                                        00440025
0/********************************************************************/ 00450025
 /*  BMS RELATED CONSTANTS                                           */ 00460025
 /********************************************************************/ 00470025
 %INCLUDE DFHBMSCA;                                                     00480025
0/********************************************************************/ 00490025
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00500025
 /********************************************************************/ 00510025
 %INCLUDE DFHAID;                                                       00520025
1/********************************************************************/ 00530025
 /*  COMMUNICATION AREA                                              */ 00540025
 /********************************************************************/ 00550025
     %INCLUDE (RCBCP2S);                                                00560025
     %INCLUDE (RCBCHDS);,                                               00570025
     %INCLUDE (RCBC00S);,                                               00580025
     %INCLUDE (RCBC51S);;                                               00590025
0/********************************************************************/ 00600025
 /*  MAP STRUCTURES                                                  */ 00610025
 /********************************************************************/ 00620025
 %INCLUDE (RCBM51);                                                     00630025
0/********************************************************************/ 00640025
 /*  DB2 STRUCTURES                                                  */ 00650025
 /********************************************************************/ 00660025
 DCL 1 RCB011S,                                                         00670025
      %INCLUDE RCB011S;;                                                00680025
 DCL 1 RCB011SI,                                                        00690025
      %INCLUDE RCB011SI;;                                               00700025
 DCL 1 RCB560S,                                                         00710025
     %INCLUDE (RCB560S);;                                               00720025
 DCL 1 RCB560SI,                                                        00730025
     %INCLUDE (RCB560SI);;                                              00740025
0/********************************************************************/ 00750025
 /*  NULL INDICATORS                                                 */ 00760025
 /********************************************************************/ 00770025
 DCL 1 NULL011      BASED(ADDR(RCB011SI)),                              00780025
       3 NUL011A    FIXED BIN(15) INIT(0),                              00790025
       3 NUL011B    FIXED BIN(15) INIT(0),                              00800025
       3 NUL011C    FIXED BIN(15) INIT(0),                              00810025
       3 NUL011D    FIXED BIN(15) INIT(0),                              00820025
       3 NUL011E    FIXED BIN(15) INIT(0),                              00830025
       3 NUL011F    FIXED BIN(15) INIT(0),                              00840025
       3 NUL011G    FIXED BIN(15) INIT(0),                              00850025
       3 NUL011H    FIXED BIN(15) INIT(0),                              00860025
       3 NUL011I    FIXED BIN(15) INIT(0),                              00870025
       3 NUL011J    FIXED BIN(15) INIT(0),                              00880025
       3 NUL011K    FIXED BIN(15) INIT(0),                              00890025
       3 NUL011L    FIXED BIN(15) INIT(0);                              00900025
 DCL 1 WRK_INDNULL  FIXED BIN(15) INIT(0);                 /* RB01289 */00910025
0/********************************************************************/ 00920025
 /*  INTERFACE AREAS                                                 */ 00930025
 /********************************************************************/ 00940025
0/********************************************************************/ 00950025
 /*  RETURN CODES                                                    */ 00960025
 /********************************************************************/ 00970025
 DCL RESPONSE     FIXED BINARY(31) INIT(0);    /*RETURN CODE         */ 00980025
 DCL CODE_EXPLAIN FIXED BINARY(31) INIT(0);    /*RETURN CODE EXPLAIN */ 00990025
0/********************************************************************/ 01000025
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 01010025
 /********************************************************************/ 01020025
  EXEC SQL  WHENEVER NOT FOUND   CONTINUE;                              01030025
  EXEC SQL  WHENEVER SQLWARNING  CONTINUE;                              01040025
  EXEC SQL  WHENEVER SQLERROR    CONTINUE;                              01050025
0/********************************************************************/ 01060025
 /*  WORKING DECLARATIONS                                            */ 01070025
 /********************************************************************/ 01080025
 DCL PF5_FLAG                 BIT(1) INIT('0'B);                        01090025
 DCL T011_UPD_FLAG            BIT(1) INIT('0'B);                        01100025
 DCL ERROR_FLAG               BIT(1) INIT('0'B);                        01110025
 DCL HELP_FLAG                BIT(1) INIT('0'B);                        01120025
 DCL ALPHANUMERIC             CHAR(37) INIT                             01130025
                             ('ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890 '); 01140025
 DCL PIC_CNT                  PIC'ZZZZ9' INIT(0);                       01150025
 DCL COMMAREA_STRING          CHAR(5984) INIT('');                      01160025
 DCL WRK_REC_COUNT            FIXED BIN(15) INIT(0);                    01170025
 DCL WRK_TIME_IN              CHAR(26) INIT('');      /* CEDS00000361 */01180025
 DCL I1                       FIXED BIN(15) INIT(0);                    01190025
 DCL I2                       FIXED BIN(15) INIT(0);                    01200025
 DCL I3                       FIXED BIN(15) INIT(0);                    01210025
 DCL TMP_CUST                 CHAR(10) INIT('');                        01220025
 DCL TMP_CUSTB                CHAR(10) INIT('%%%%%%%%%%');              01230025
 DCL TMP_NAME                 CHAR(32) INIT('');                        01240025
 DCL TMP_NAMEB                CHAR(32)                                  01250025
                              INIT('%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'); 01260025
 DCL WRK_CUST                 CHAR(8) INIT('');                         01270025
 DCL WRK_CUST_EXT             CHAR(3) INIT('');                         01280025
 DCL WRK_CUST_PREFIX          CHAR(02) INIT('');       /*SOC RB01289 */ 01290025
 DCL WRK_CUST_NO              PIC '999999'                              01300025
 DCL CUSTOMER_NUMBER_DU_FLAG  BIT(1) INIT('0'B);                        01310025
 DCL CUSTOMER_NUMBER_GEN_FLAG BIT(1) INIT('0'B);                        01320025
 DCL CUSTOMER_NUMBER_REAL_FLAG BIT(1) INIT('0'B);                       01330025
 DCL ALPHANUMERIC1            CHAR(36) INIT                             01340025
                              ('ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890'); 01350025
                                                       /*EOC RB01289 */ 01360025
 DCL WRK_O                    CHAR(1) INIT('O');                        01370025
 DCL WRKMAP_DATA              CHAR(500) INIT('');                       01380025
 DCL 1 WRKMAP                 BASED(ADDR(WRKMAP_DATA)),                 01390025
     %INCLUDE RCBB568;;                                                 01400025
0/********************************************************************/ 01410025
 /*  MESSAGES                                                        */ 01420025
 /********************************************************************/ 01430025
 DCL ERR_MESSAGE3 CHAR(30) INIT('ERROR IN RECEIVING MAP ');             01440025
 DCL ERR_MESSAGE13 CHAR(33) INIT('OTHER ERRORS                     ');  01450025
 DCL ERR_MESSAGE30 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       01460025
 DCL ERR_O004 CHAR(27) INIT('Invalid use of function key');             01470025
 DCL ERR_O005 CHAR(42) INIT                                             01480025
  ('The highlighted fields have a syntax ERROR');                       01490025
 DCL ERR_O022 CHAR(19) INIT('Press F5 to execute');                     01500025
 DCL ERR_O030 CHAR(24) INIT('Already on first page');                   01510025
 DCL ERR_O031 CHAR(23) INIT('Already on last page');                    01520025
 DCL ERR_O032 CHAR(17) INIT('No item selected');                        01530025
 DCL ERR_O053 CHAR(18) INIT('Nothing is updated');                      01540025
 DCL ERR_O057 CHAR(70) INIT                                             01550025
 ('You are not authorized to use the function for this Country number');01560025
 DCL ERR_O064 CHAR(37) INIT('Fill in the action you want to perform');  01570025
 DCL ERR_O072 CHAR(25) INIT('Country number is invalid');               01580025
 DCL ERR_O079 CHAR(70) INIT                                             01590025
 ('Not allowed to maintain P.I. customers, no activity report created');01600025
 DCL ERR_O095 CHAR(48) INIT                                             01610025
 ('Return to primary selection panel by pressing F3');                  01620025
 DCL ERR_O098 CHAR(23) INIT('Invalid command entered');                 01630025
 DCL ERR_O101 CHAR(33) INIT('Field must be filled in correctly');       01640025
 DCL ERR_O104 CHAR(62) INIT                                             01650025
  ('Unexpected system ERR_Or, please reenter or exit and try later');   01660025
 DCL ERR_O117 CHAR(23) INIT('Field must be filled in');                 01670025
 DCL ERR_O120 CHAR(65) INIT                                             01680025
  ('Row for update not found. Choose action = 1 or fill in new values');01690025
 DCL ERR_O123 CHAR(41) INIT                                             01700025
  ('Insert successful. Enter new data or EXIT');                        01710025
 DCL ERR_O124 CHAR(41) INIT                                             01720025
  ('Update successful. Enter new data or EXIT');                        01730025
 DCL ERR_O125 CHAR(60) INIT                                             01740025
  ('Customer may not be deleted. Choose action = 1 or action = 2');     01750025
 DCL ERR_O126 CHAR(37) INIT                                             01760025
  ('Customer_Number_Prime does not exist.');                            01770025
 DCL ERR_O128 CHAR(37) INIT('Customer_Number_Prime already exists');    01780025
                                                      /* SOC RB01289 */ 01790025
 DCL ERR_O202 CHAR(77) INIT                                             01800025
   ('Select required dummy customer number category (eServicePac or CISC01810025
 O or PEW)');                                                           01820025
 DCL ERR_O203 CHAR(75) INIT                                             01830025
  ('Select only one dummy customer number category(eServicePac or CISCO 01840025
 or PEW)');                                                             01850025
 DCL ERR_O204 CHAR(50) INIT                                             01860025
  ('Please mark  X  before required Dummy prefix');                     01870025
 DCL ERR_O205 CHAR(77) INIT                                             01880025
   ('If Dummy category selected, Do not enter Cust_Number,Press F5 to ge01890025
 t it');                                                                01900025
 DCL ERR_O206 CHAR(77) INIT                                             01910025
  ('Do not enter Dummy Cust_Number,Select one Dummy prefix & Press F5 to01920025
  get it');                                                             01930025
                                                      /* EOC RB01289 */ 01940025
0/********************************************************************/ 01950025
 /*  TS AREA                                                         */ 01960025
 /********************************************************************/ 01970025
 DCL 1 TS_REC,                                                          01980025
       3 CUST      CHAR(08) INIT(''),                                   01990025
       3 CEXT      CHAR(03) INIT(''),                                   02000025
       3 NAME      CHAR(30) INIT('');                                   02010025
0/********************************************************************/ 02020025
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 02030025
 /********************************************************************/ 02040025
  EXEC SQL  INCLUDE  SQLCA;                                             02050025
-/********************************************************************/ 02060025
 /****   DECLARATIONS OF DB2 CURSORS                              ****/ 02070025
 /********************************************************************/ 02080025
  EXEC SQL DECLARE C_011 CURSOR FOR                                     02090025
           SELECT CUSTOMER_NUMBER                                       02100025
                 ,CUSTOMER_NR_EXTEND                                    02110025
                 ,CUSTOMER_NAME                                         02120025
           FROM RCBV0011_PI_CUST                                        02130025
           WHERE COUNTRY_NUMBER       = :WRK_COUNTRY_NUMBER             02140025
             AND ((CUSTOMER_NUMBER LIKE :TMP_CUST                       02150025
              OR   :CUST_ENT          = 'N')                            02160025
             AND  (CUSTOMER_NAME   LIKE :TMP_NAME                       02170025
              OR   :NAME_ENT          = 'N'))                           02180025
           ORDER BY CUSTOMER_NUMBER                                     02190025
           FOR FETCH ONLY                                               02200025
           WITH UR;                                                     02210025
                                                                        02220025
0/********************************************************************/ 02230025
 /*                 BUILD IN FUNCTIONS                               */ 02240025
 /********************************************************************/ 02250025
0DCL (LENGTH,                                                           02260025
      STRING,                                                           02270025
      SUBSTR,                                                           02280025
      VERIFY,                                                           02290025
      DECIMAL,                                                          02300025
      DATETIME,                                                         02310025
      CHAR,                                                             02320025
      NULL,                                                             02330025
      CSTG,                                                             02340025
      STG,                                                              02350025
      ADDR)   BUILTIN;                                                  02360025
1/********************************************************************/ 02370025
 /*                   M A I N   P R O C E S S I N G                  */ 02380025
 /*                                                                  */ 02390025
 /********************************************************************/ 02400025
0RCBM51O.MSG_LINEO = '';                                                02410025
                                                                        02420025
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP; /* SOC CEDS00000361 */  02430025
 WRK_DATE    = SUBSTR(WRK_TIME_IN,1,10);        /* EOC CEDS00000361 */  02440025
                                                                        02450025
 IF EIBCALEN = 0 THEN                                                   02460025
 DO;                                                                    02470025
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   02480025
 END;                                                                   02490025
                                                                        02500025
 IF HEADER.NEXT = '98'                                                  02510025
  | HEADER.NEXT = '99' THEN                                             02520025
 DO;                                                                    02530025
   HEADER.NEXT = '00';                                                  02540025
   CALL RCBC51M_CLEAR_SEL;                                              02550025
   CALL RCBC51M_CLEAR_WORK;                                             02560025
   CALL RCBC51M_CLEAR_MAPA;                                             02570025
   TMP_COUNTRY_NUMBER = WRK_COUNTRY_NUMBER;                             02580025
   CALL RCBC51M_SEND_MAPA;                                              02590025
 END;                                                                   02600025
                                                                        02610025
 IF HEADER.NEXT = 'H1' THEN                                             02620025
 DO;                                                                    02630025
   HEADER.NEXT = '00';                                                  02640025
   IF  HEADER.REQUEST_ID = 'A' THEN                                     02650025
   DO;                                                                  02660025
     IF TS_CNT = 0 THEN                                                 02670025
     DO;                                                                02680025
       CALL RCBC51M_CLEAR_MAPA;                                         02690025
       CALL RCBC51M_SEND_MAPA;                                          02700025
     END;                                                               02710025
     J = J - K;                                                         02720025
     CALL RCBC51M_FILL_MAPA;                                            02730025
     RCBM51AI.SELL(1) = -1;                                             02740025
     CALL RCBC51M_SEND_MAPA_CSR;                                        02750025
   END;                                                                 02760025
   CALL RCBC51M_RESTORE_MAP;                                            02770025
   CALL RCBC51M_GET_CSR_POS;                                            02780025
   CALL RCBC51M_SEND_MAP_CSR;                                           02790025
 END;                                                                   02800025
                                                                        02810025
 SELECT (EIBAID);                                                       02820025
   WHEN (DFHPF1,DFHPF13)                                                02830025
   DO;                                                                  02840025
      CALL RCBC51M_HELP_MAP;                                            02850025
   END;                                                                 02860025
                                                                        02870025
   WHEN (DFHPF2,DFHPF14)                                                02880025
   DO;                                                                  02890025
     IF  HEADER.REQUEST_ID = 'A' THEN                                   02900025
     DO;                                                                02910025
     CALL RCBC51M_CLEAR_SEL;                                            02920025
     CALL RCBC51M_CLEAR_WORK;                                           02930025
     CALL RCBC51M_CLEAR_MAPA;                                           02940025
     CALL RCBC51M_SEND_MAPA;                                            02950025
     END;                                                               02960025
     ELSE DO;                                                           02970025
       CALL RCBC51M_RECEIVE_MAP;                                        02980025
       RCBM51O.MSG_LINEO = ERR_O004;                                    02990025
       RCBM51I.ACTIONL   = -1;                                          03000025
       CALL RCBC51M_SEND_MAP_CSR;                                       03010025
     END;                                                               03020025
   END;                                                                 03030025
                                                                        03040025
   WHEN (DFHPF3,DFHPF15)                                                03050025
   DO;                                                                  03060025
     IF UPD_OK_FLAG = TRUE THEN                                         03070025
     DO;                                                                03080025
       UPD_OK_FLAG = FALSE;                                             03090025
       CALL RCBC51M_GET_SELECTION;                                      03100025
       CALL RCBC51M_FILL_MAPA;                                          03110025
       RCBM51AI.SELL(1) = -1;                                           03120025
       CALL RCBC51M_SEND_MAPA_CSR;                                      03130025
     END;                                                               03140025
                                                                        03150025
     IF  HEADER.REQUEST_ID = '' THEN                                    03160025
     DO;                                                                03170025
       IF TS_CNT = 0 THEN                                               03180025
       DO;                                                              03190025
         CALL RCBC51M_CLEAR_WORK;                                       03200025
         CALL RCBC51M_CLEAR_MAP;                                        03210025
         CALL RCBC51M_CLEAR_MAPA;                                       03220025
         CALL RCBC51M_SEND_MAPA;                                        03230025
       END;                                                             03240025
                                                                        03250025
       CALL RCBC51M_CLEAR_WORK;                                         03260025
       CALL RCBC51M_CLEAR_MAP;                                          03270025
       J = J - K;                                                       03280025
       CALL RCBC51M_FILL_MAPA;                                          03290025
       RCBM51AI.SELL(1) = -1;                                           03300025
       CALL RCBC51M_SEND_MAPA_CSR;                                      03310025
     END;                                                               03320025
                                                                        03330025
     HEADER.NEXT = 'H1';                                                03340025
     TS_Q = 'RC00' || EIBTRMID;                                         03350025
     EXEC CICS IGNORE CONDITION QIDERR;                                 03360025
     EXEC CICS DELETEQ TS QUEUE(TS_Q);                                  03370025
     EXEC CICS HANDLE CONDITION QIDERR;                                 03380025
                                                                        03390025
     EXEC CICS XCTL                                                     03400025
         PROGRAM('RCBC50P')                                             03410025
         COMMAREA(COMMAREA)                                             03420025
         LENGTH(CSTG(COMMAREA))                                         03430025
         RESP(RESPONSE)                                                 03440025
         RESP2(CODE_EXPLAIN);                                           03450025
   END;                                                                 03460025
                                                                        03470025
   WHEN (DFHPF4,DFHPF16)                                                03480025
   DO;                                                                  03490025
     IF  HEADER.REQUEST_ID = 'A' THEN                                   03500025
     DO;                                                                03510025
       CALL RCBC51M_CLEAR_MAP;                                          03520025
       RCBM51O.ACTIONO = '1';                                           03530025
       RCBM51I.ACTIONL = -1;                                            03540025
       UPDATE_FLAG     = FALSE;                                         03550025
       CALL RCBC51M_SEND_MAP_CSR;                                       03560025
     END;                                                               03570025
     ELSE DO;                                                           03580025
       CALL RCBC51M_RECEIVE_MAP;                                        03590025
       RCBM51O.MSG_LINEO = ERR_O004;                                    03600025
       RCBM51I.ACTIONL   = -1;                                          03610025
       CALL RCBC51M_SEND_MAP_CSR;                                       03620025
     END;                                                               03630025
   END;                                                                 03640025
                                                                        03650025
   WHEN (DFHPF5,DFHPF17)                                                03660025
   DO;                                                                  03670025
     IF  HEADER.REQUEST_ID = 'A' THEN                                   03680025
     DO;                                                                03690025
       IF TS_CNT = 0 THEN                                               03700025
       DO;                                                              03710025
         RCBM51AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                 03720025
         RCBM51AI.CUST_SELL = -1;                                       03730025
         RCBM51AO.MSG_LINEO = ERR_O004;                                 03740025
         CALL RCBC51M_SEND_MAPA_CSR;                                    03750025
       END;                                                             03760025
       J = J - K;                                                       03770025
       CALL RCBC51M_FILL_MAPA;                                          03780025
       RCBM51AI.SELL(1) = -1;                                           03790025
       RCBM51AO.MSG_LINEO = ERR_O004;                                   03800025
       CALL RCBC51M_SEND_MAPA_CSR;                                      03810025
     END;                                                               03820025
                                                                        03830025
     CALL RCBC51M_RECEIVE_MAP;                                          03840025
                                                                        03850025
     IF WRK_CUSTOMER_NUMBER_PI = '' THEN                  /* RB01289 */ 03860025
        WRK_CUSTOMER_NUMBER_PI = '0';                                   03870025
                                                                        03880025
     IF RCBM51I.CUSTOMER_NUMBER_PII = WRK_CUSTOMER_NUMBER_PI            03890025
     & ¬ CUSTOMER_NUMBER_DU_FLAG THEN                     /* RB01289 */ 03900025
     DO;                                                                03910025
       PF5_FLAG = TRUE;                                                 03920025
       CALL RCBC51M_ACTION_PROCESS;                                     03930025
     END;                                                               03940025
     ELSE DO;                                                           03950025
       CALL RCBC51M_VALIDATE_MAP;                                       03960025
       CALL RCBC51M_GET_CUSTOMER;                                       03970025
       IF CUSTOMER_NUMBER_DU_FLAG                      /*SOC RB01289 */ 03980025
       & ¬ CUSTOMER_NUMBER_GEN_FLAG THEN                                03990025
          DO;                                                           04000025
          RCBM51O.CUSTOMER_NUMBER_PIO = WRK_CUSTOMER_NUMBER_PI;         04010025
          RCBM51O.MSG_LINEO = 'Customer Number Dummy :'                 04020025
                      || WRK_CUSTOMER_NUMBER_PI||' Generated.'          04030025
          CUSTOMER_NUMBER_DU_FLAG = FALSE;                              04040025
          CUSTOMER_NUMBER_GEN_FLAG = TRUE;                              04050025
          UPDATE_FLAG    = TRUE;                                        04060025
          RCBM51O.ESERVO = '';                                          04070025
          RCBM51O.CISCOO = '';                                          04080025
          RCBM51O.PEWO   = '';                                          04090025
          RCBM51O.CUSTOMER_NUMBER_PIA = DFHBMPRF;                       04100025
          CALL RCBC51M_SEND_MAP;                                        04110025
          END;                                                          04120025
        PF5_FLAG = TRUE;                                                04130025
        CALL RCBC51M_ACTION_PROCESS;                  /*EOC RB01289 */  04140025
     END;                                                               04150025
   END;                                                                 04160025
                                                                        04170025
   WHEN (DFHPF7,DFHPF19)                                                04180025
   DO;                                                                  04190025
     IF  HEADER.REQUEST_ID = '' THEN                                    04200025
     DO;                                                                04210025
       CALL RCBC51M_RECEIVE_MAP;                                        04220025
       RCBM51O.MSG_LINEO = ERR_O004;                                    04230025
       RCBM51I.ACTIONL   = -1;                                          04240025
       CALL RCBC51M_SEND_MAP_CSR;                                       04250025
     END;                                                               04260025
                                                                        04270025
     IF TS_CNT = 0 THEN                                                 04280025
     DO;                                                                04290025
       CALL RCBC51M_CLEAR_MAPA;                                         04300025
       RCBM51AO.MSG_LINEO = ERR_O032;                                   04310025
       RCBM51AI.SELL(1) = -1;                                           04320025
       CALL RCBC51M_SEND_MAPA_CSR;                                      04330025
     END;                                                               04340025
                                                                        04350025
     IF L - 16 < 0 THEN                                                 04360025
     DO;                                                                04370025
       J = 0;                                                           04380025
       RCBM51AO.MSG_LINEO = ERR_O030;                                   04390025
       CALL RCBC51M_FILL_MAPA;                                          04400025
       CALL RCBC51M_SEND_MAPA;                                          04410025
     END;                                                               04420025
     ELSE DO;                                                           04430025
       J = L - 16;                                                      04440025
       CALL RCBC51M_FILL_MAPA;                                          04450025
       RCBM51AI.SELL(1) = -1;                                           04460025
       CALL RCBC51M_SEND_MAPA_CSR;                                      04470025
     END;                                                               04480025
   END;                                                                 04490025
                                                                        04500025
   WHEN (DFHPF8,DFHPF20)                                                04510025
   DO;                                                                  04520025
     IF  HEADER.REQUEST_ID = '' THEN                                    04530025
     DO;                                                                04540025
       CALL RCBC51M_RECEIVE_MAP;                                        04550025
       RCBM51O.MSG_LINEO = ERR_O004;                                    04560025
       RCBM51I.ACTIONL   = -1;                                          04570025
       CALL RCBC51M_SEND_MAP_CSR;                                       04580025
     END;                                                               04590025
                                                                        04600025
     IF TS_CNT = 0 THEN                                                 04610025
     DO;                                                                04620025
       CALL RCBC51M_CLEAR_MAPA;                                         04630025
       RCBM51AO.MSG_LINEO = ERR_O032;                                   04640025
       RCBM51AI.SELL(1) = -1;                                           04650025
       CALL RCBC51M_SEND_MAPA_CSR;                                      04660025
     END;                                                               04670025
                                                                        04680025
     IF J >= TS_CNT THEN                                                04690025
     DO;                                                                04700025
       J = J - K;                                                       04710025
       RCBM51AO.MSG_LINEO = ERR_O031;                                   04720025
       CALL RCBC51M_FILL_MAPA;                                          04730025
       RCBM51AI.SELL(1) = -1;                                           04740025
       CALL RCBC51M_SEND_MAPA_CSR;                                      04750025
     END;                                                               04760025
                                                                        04770025
     CALL RCBC51M_FILL_MAPA;                                            04780025
     RCBM51AI.SELL(1) = -1;                                             04790025
     CALL RCBC51M_SEND_MAPA_CSR;                                        04800025
   END;                                                                 04810025
                                                                        04820025
   WHEN (DFHPF9,DFHPF21)                                                04830025
   DO;                                                                  04840025
     IF  HEADER.REQUEST_ID = '' THEN                                    04850025
     DO;                                                                04860025
       CALL RCBC51M_RECEIVE_MAP;                                        04870025
       RCBM51O.MSG_LINEO = ERR_O004;                                    04880025
       RCBM51I.ACTIONL   = -1;                                          04890025
       CALL RCBC51M_SEND_MAP_CSR;                                       04900025
     END;                                                               04910025
                                                                        04920025
     IF  HEADER.REQUEST_ID = 'A' THEN                                   04930025
     DO;                                                                04940025
       IF O = 0                                                         04950025
        & TS_CNT > 15 THEN                                              04960025
       DO;                                                              04970025
         O = 1;                                                         04980025
         J = TS_CNT - 15;                                               04990025
         IF J < 1 THEN J = 1;                                           05000025
         CALL RCBC51M_FILL_MAPA;                                        05010025
         RCBM51AI.SELL(1) = -1;                                         05020025
         CALL RCBC51M_SEND_MAPA_CSR;                                    05030025
       END;                                                             05040025
                                                                        05050025
       O = 0;                                                           05060025
       J = 0;                                                           05070025
       CALL RCBC51M_FILL_MAPA;                                          05080025
       RCBM51AI.SELL(1) = -1;                                           05090025
       CALL RCBC51M_SEND_MAPA_CSR;                                      05100025
     END;                                                               05110025
   END;                                                                 05120025
                                                                        05130025
   WHEN (DFHENTER)                                                      05140025
   DO;                                                                  05150025
     IF  HEADER.REQUEST_ID = 'A' THEN                                   05160025
     DO;                                                                05170025
     CALL RCBC51M_RECEIVE_MAPA;                                         05180025
                                                                        05190025
       IF RCBM51AI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER                05200025
        | RCBM51AI.CUST_SELI ¬= CUST_SEL                                05210025
        | RCBM51AI.NAME_SELI ¬= NAME_SEL THEN                           05220025
       DO;                                                              05230025
         T011_UPD_FLAG  = FALSE;                                        05240025
         CALL RCBC51M_VALIDATE_MAPA;                                    05250025
         CALL RCBC51M_GET_SELECTION;                                    05260025
         CALL RCBC51M_FILL_MAPA;                                        05270025
         RCBM51AI.SELL(1) = -1;                                         05280025
         CALL RCBC51M_SEND_MAPA_CSR;                                    05290025
       END;                                                             05300025
       CALL RCBC51M_CHECK_MAPA;                                         05310025
       CALL RCBC51M_GET_CUSTOMER;                                       05320025
       CALL RCBC51M_SEND_MAP;                                           05330025
     END;                                                               05340025
                                                                        05350025
     CALL RCBC51M_RECEIVE_MAP;                                          05360025
     IF WRK_CUSTOMER_NUMBER_PI = '' THEN                  /* RB01289 */ 05370025
        WRK_CUSTOMER_NUMBER_PI = '0';                                   05380025
     IF RCBM51I.CUSTOMER_NUMBER_PII = WRK_CUSTOMER_NUMBER_PI            05390025
     & RCBM51I.CUSTOMER_NUMBER_PII ¬= '0'                 /* RB01289 */ 05400025
     & ¬ CUSTOMER_NUMBER_DU_FLAG THEN                     /* RB01289 */ 05410025
     DO;                                                                05420025
       CALL RCBC51M_ACTION_PROCESS;                                     05430025
     END;                                                               05440025
     ELSE DO;                                                           05450025
       CALL RCBC51M_VALIDATE_MAP;                                       05460025
       CALL RCBC51M_GET_CUSTOMER;                                       05470025
 /*    CALL RCBC51M_SEND_MAP; */                        /*SOC RB01289 */05480025
       IF CUSTOMER_NUMBER_DU_FLAG                                       05490025
       & ¬ CUSTOMER_NUMBER_GEN_FLAG THEN                                05500025
          DO;                                                           05510025
          RCBM51O.CUSTOMER_NUMBER_PIO = WRK_CUSTOMER_NUMBER_PI;         05520025
          RCBM51O.MSG_LINEO = 'Customer Number Dummy :'                 05530025
                      || WRK_CUSTOMER_NUMBER_PI||' Generated.'          05540025
          CUSTOMER_NUMBER_DU_FLAG = FALSE;                              05550025
          CUSTOMER_NUMBER_GEN_FLAG = TRUE;                              05560025
          UPDATE_FLAG    = TRUE;                                        05570025
          RCBM51O.ESERVO = '';                                          05580025
          RCBM51O.CISCOO = '';                                          05590025
          RCBM51O.PEWO   = '';                                          05600025
          RCBM51O.CUSTOMER_NUMBER_PIA = DFHBMPRF;                       05610025
          CALL RCBC51M_SEND_MAP;                                        05620025
          END;                                                          05630025
       CALL RCBC51M_ACTION_PROCESS;                  /*EOC RB01289 */   05640025
                                                                        05650025
     END;                                                               05660025
   END;                                                                 05670025
                                                                        05680025
   WHEN (DFHCLEAR)                                                      05690025
   DO;                                                                  05700025
     EXEC CICS SEND                                                     05710025
        CONTROL                                                         05720025
        ERASE                                                           05730025
        FREEKB;                                                         05740025
     EXEC CICS RETURN;                                                  05750025
   END;                                                                 05760025
                                                                        05770025
   OTHERWISE                        /* INVALID KEY ENTERED */           05780025
   DO;                                                                  05790025
     IF HEADER.REQUEST_ID = 'A' THEN                                    05800025
     DO;                                                                05810025
       IF TS_CNT = 0 THEN                                               05820025
       DO;                                                              05830025
         RCBM51AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                 05840025
         RCBM51AI.CUST_SELL = -1;                                       05850025
         RCBM51AO.MSG_LINEO = ERR_O004;                                 05860025
         CALL RCBC51M_SEND_MAPA_CSR;                                    05870025
       END;                                                             05880025
       J = J - K;                                                       05890025
       CALL RCBC51M_FILL_MAPA;                                          05900025
       RCBM51AI.SELL(1) = -1;                                           05910025
       RCBM51AO.MSG_LINEO = ERR_O004;                                   05920025
       CALL RCBC51M_SEND_MAPA_CSR;                                      05930025
     END;                                                               05940025
                                                                        05950025
     CALL RCBC51M_RECEIVE_MAP;                                          05960025
     RCBM51O.MSG_LINEO = ERR_O004;                                      05970025
     RCBM51I.ACTIONL   = -1;                                            05980025
     CALL RCBC51M_SEND_MAP_CSR;                                         05990025
   END;                                                                 06000025
                                                                        06010025
 END;                                                                   06020025
1/********************************************************************/ 06030025
 /*      RECEIVE MAP RCBM51                                          */ 06040025
 /********************************************************************/ 06050025
0RCBC51M_RECEIVE_MAP : PROC;                                            06060025
                                                                        06070025
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      06080025
    MAP('RCBM51')                                                       06090025
    MAPSET('RCBM51')                                                    06100025
    RESP(RESPONSE)                                                      06110025
    RESP2(CODE_EXPLAIN);                                                06120025
                                                                        06130025
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      06140025
   WHEN(DFHRESP(NORMAL));                                               06150025
                                                                        06160025
   OTHERWISE                                                            06170025
   DO;                                                                  06180025
     RCBM51O.MSG_LINEO = ERR_MESSAGE3;                                  06190025
     CALL RCBC51M_SEND_MAP;                                             06200025
   END;                                                                 06210025
 END;                                                                   06220025
                                                                        06230025
0END RCBC51M_RECEIVE_MAP;                                               06240025
1/********************************************************************/ 06250025
 /*      RECEIVE MAP RCBM51A                                         */ 06260025
 /********************************************************************/ 06270025
0RCBC51M_RECEIVE_MAPA: PROC;                                            06280025
                                                                        06290025
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      06300025
    MAP('RCBM51A')                                                      06310025
    MAPSET('RCBM51')                                                    06320025
    RESP(RESPONSE)                                                      06330025
    RESP2(CODE_EXPLAIN);                                                06340025
                                                                        06350025
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      06360025
   WHEN(DFHRESP(NORMAL));                                               06370025
                                                                        06380025
   OTHERWISE                                                            06390025
   DO;                                                                  06400025
     RCBM51O.MSG_LINEO = ERR_MESSAGE3;                                  06410025
     CALL RCBC51M_SEND_MAP;                                             06420025
   END;                                                                 06430025
 END;                                                                   06440025
                                                                        06450025
0END RCBC51M_RECEIVE_MAPA;                                              06460025
1/********************************************************************/ 06470025
 /*      FILL MAP FROM WORK FIELDS                                   */ 06480025
 /********************************************************************/ 06490025
0RCBC51M_FILL_MAP: PROC;                                                06500025
                                                                        06510025
 RCBM51O.COUNTRY_NUMBERO       = WRK_COUNTRY_NUMBER;                    06520025
 RCBM51O.ACTIONO               = WRK_ACTION;                            06530025
 RCBM51O.ESERVO                = '';                   /* SOC RB01289 */06540025
 RCBM51O.CISCOO                = '';                                    06550025
 RCBM51O.PEWO                  = '';                   /* EOC RB01289 */06560025
 RCBM51O.CUSTOMER_NUMBER_PIO   = WRK_CUSTOMER_NUMBER_PI;                06570025
 RCBM51O.CUSTOMER_NAMEO        = WRK_CUSTOMER_NAME;                     06580025
 RCBM51O.TYPE_OF_CUSTOMERO     = WRK_TYPE_OF_CUSTOMER;                  06590025
 RCBM51O.ADDRESS_LINE_1O       = WRK_ADDRESS_LINE_1;                    06600025
 RCBM51O.ADDRESS_LINE_2O       = WRK_ADDRESS_LINE_2;                    06610025
 RCBM51O.ADDRESS_LINE_3O       = WRK_ADDRESS_LINE_3;                    06620025
 RCBM51O.ZIP_CODEO             = WRK_ZIP_CODE;                          06630025
 RCBM51O.EMBARGO_CODEO         = WRK_EMBARGO_CODE;                      06640025
                                                                        06650025
0END RCBC51M_FILL_MAP;                                                  06660025
1/********************************************************************/ 06670025
 /*      FILL MAP RCBM51A                                            */ 06680025
 /********************************************************************/ 06690025
0RCBC51M_FILL_MAPA: PROC;                                               06700025
                                                                        06710025
 CALL RCBC51M_CLEAR_MAPA;                                               06720025
                                                                        06730025
 K = 0;                                                                 06740025
 PIC_CNT          = J + 1;                                              06750025
 IF PIC_CNT = 0 THEN PIC_CNT = 1;                                       06760025
                                                                        06770025
 RCBM51AO.INCNTO  = PIC_CNT;                                            06780025
 L                = PIC_CNT;                                            06790025
 PIC_CNT          = TS_CNT;                                             06800025
 RCBM51AO.TOTCNTO = PIC_CNT;                                            06810025
                                                                        06820025
 DO I = 1 TO 15;                                                        06830025
   RCBM51AO.SELA(I) = DFHBMPRF;                                         06840025
 END;                                                                   06850025
                                                                        06860025
 TS_Q = 'RC00' || EIBTRMID;                                             06870025
                                                                        06880025
 DO I = 1 TO 15;                                                        06890025
                                                                        06900025
   IF J <= TS_CNT                                                       06910025
    & TS_CNT ¬= 0 THEN                                                  06920025
   DO;                                                                  06930025
     J = J + 1;     /* NUMBER OF LINES DISPLAYED */                     06940025
     K = K + 1;     /* NUMBER OF LINES DISPLAYED ON CURRENT SCREEN */   06950025
     EXEC CICS READQ TS QUEUE(TS_Q) INTO(TS_REC) ITEM(J);               06960025
     RCBM51AO.SELA(I)                = DFHBMUNP;                        06970025
     RCBM51AO.CUSTOMER_NUMBERO(I)    = TS_REC.CUST;                     06980025
     RCBM51AO.CUSTOMER_NR_EXTENDO(I) = TS_REC.CEXT;                     06990025
     RCBM51AO.CUSTOMER_NAMEO(I)      = TS_REC.NAME;                     07000025
   END;                                                                 07010025
                                                                        07020025
   IF J >= TS_CNT THEN                                                  07030025
     I = 16;                                                            07040025
 END;                                                                   07050025
                                                                        07060025
 CALL RCBC51M_SET_MAPA;                                                 07070025
                                                                        07080025
0END RCBC51M_FILL_MAPA;                                                 07090025
1/********************************************************************/ 07100025
 /*      VALIDATE MAP RCBM51A                                        */ 07110025
 /********************************************************************/ 07120025
0RCBC51M_VALIDATE_MAPA: PROC;                                           07130025
                                                                        07140025
 CUST_ENT = 'N';                                                        07150025
 NAME_ENT = 'N';                                                        07160025
 CUST_SEL = '';                                                         07170025
 NAME_SEL = '';                                                         07180025
                                                                        07190025
 IF RCBM51AI.CUST_SELL = 0 THEN                                         07200025
   RCBM51AO.CUST_SELO  = '';                                            07210025
 IF RCBM51AI.NAME_SELL = 0 THEN                                         07220025
   RCBM51AO.NAME_SELO  = '';                                            07230025
                                                                        07240025
 IF WRK_COUNTRY_NUMBER ¬= RCBM51AI.COUNTRY_NUMBERI THEN                 07250025
 DO;                                                                    07260025
   SEL_OPT = '8';                                                       07270025
   WRK_COUNTRY_NUMBER = RCBM51AI.COUNTRY_NUMBERI;                       07280025
                                                                        07290025
   EXEC CICS LINK                                                       07300025
      PROGRAM('RCBC99P')                                                07310025
      COMMAREA(COMMAREA)                                                07320025
      LENGTH(CSTG(COMMAREA));                                           07330025
                                                                        07340025
   IF CTY_OK_FLAG = FALSE THEN                                          07350025
   DO;                                                                  07360025
     RCBM51AO.MSG_LINEO       = ERR_O072;                               07370025
     RCBM51AI.COUNTRY_NUMBERL = -1;                                     07380025
     RCBM51AO.COUNTRY_NUMBERC = DFHRED;                                 07390025
     WRK_COUNTRY_NUMBER       = '001';                                  07400025
     CALL RCBC51M_CLEAR_MAPA_2;                                         07410025
     CALL RCBC51M_SEND_MAPA_CSR;                                        07420025
   END;                                                                 07430025
                                                                        07440025
   IF OK_FLAG = FALSE THEN                                              07450025
   DO;                                                                  07460025
     RCBM51AO.MSG_LINEO       = ERR_O057;                               07470025
     RCBM51AI.COUNTRY_NUMBERL = -1;                                     07480025
     RCBM51AO.COUNTRY_NUMBERC = DFHRED;                                 07490025
     WRK_COUNTRY_NUMBER       = '001';                                  07500025
     CALL RCBC51M_CLEAR_MAPA_2;                                         07510025
     CALL RCBC51M_SEND_MAPA_CSR;                                        07520025
   END;                                                                 07530025
                                                                        07540025
   IF RCB025_FLAG = FALSE THEN                                          07550025
   DO;                                                                  07560025
     RCBM51AO.MSG_LINEO =                                               07570025
                     'Parameter RCB025 is missing for this country';    07580025
     RCBM51AO.COUNTRY_NUMBERC = DFHRED;                                 07590025
     RCBM51AI.COUNTRY_NUMBERL = -1;                                     07600025
     WRK_COUNTRY_NUMBER       = '001';                                  07610025
     CALL RCBC51M_CLEAR_MAPA_2;                                         07620025
     CALL RCBC51M_SEND_MAPA_CSR;                                        07630025
   END;                                                                 07640025
                                                                        07650025
   IF RCB098_FLAG = FALSE THEN                                          07660025
   DO;                                                                  07670025
     RCBM51AO.MSG_LINEO =                                               07680025
                     'Parameter RCB098 is missing for this country';    07690025
     RCBM51AO.COUNTRY_NUMBERC = DFHRED;                                 07700025
     RCBM51AI.COUNTRY_NUMBERL = -1;                                     07710025
     WRK_COUNTRY_NUMBER       = '001';                                  07720025
     CALL RCBC51M_CLEAR_MAPA_2;                                         07730025
     CALL RCBC51M_SEND_MAPA_CSR;                                        07740025
   END;                                                                 07750025
                                                                        07760025
   IF ASCA_STOP_FLAG = TRUE THEN                                        07770025
   DO;                                                                  07780025
     RCBM51AO.MSG_LINEO       = ERR_O079;                               07790025
     RCBM51AO.COUNTRY_NUMBERC = DFHRED;                                 07800025
     RCBM51AI.COUNTRY_NUMBERL = -1;                                     07810025
     WRK_COUNTRY_NUMBER       = '001';                                  07820025
     CALL RCBC51M_CLEAR_MAPA_2;                                         07830025
     CALL RCBC51M_SEND_MAPA_CSR;                                        07840025
   END;                                                                 07850025
                                                                        07860025
   WRK_COUNTRY_NUMBER = RCBM51AI.COUNTRY_NUMBERI;                       07870025
 END;                                                                   07880025
                                                                        07890025
 IF RCBM51AI.CUST_SELI ¬= '' THEN                                       07900025
 DO;                                                                    07910025
   CUST_SEL = RCBM51AI.CUST_SELI;                                       07920025
   CUST_ENT = 'Y';                                                      07930025
 END;                                                                   07940025
                                                                        07950025
 IF RCBM51AI.NAME_SELI ¬= '' THEN                                       07960025
 DO;                                                                    07970025
   NAME_SEL = RCBM51AI.NAME_SELI;                                       07980025
   NAME_ENT = 'Y';                                                      07990025
 END;                                                                   08000025
                                                                        08010025
0END RCBC51M_VALIDATE_MAPA;                                             08020025
1/********************************************************************/ 08030025
 /*      SET MAP RCBM51A                                             */ 08040025
 /********************************************************************/ 08050025
0RCBC51M_SET_MAPA: PROC;                                                08060025
                                                                        08070025
 RCBM51AO.CUST_SELO = CUST_SEL;                                         08080025
 RCBM51AO.NAME_SELO = NAME_SEL;                                         08090025
                                                                        08100025
0END RCBC51M_SET_MAPA;                                                  08110025
1/********************************************************************/ 08120025
 /*      CHECK MAP RCBM51A                                           */ 08130025
 /********************************************************************/ 08140025
0RCBC51M_CHECK_MAPA: PROC;                                              08150025
                                                                        08160025
 UPDATE_FLAG = FALSE;                                      /* RB01289 */08170025
                                                                        08180025
 M = 0;                                                                 08190025
 DO I = 1 TO 15;                                                        08200025
   IF RCBM51AO.SELO(I) = 'S' THEN                                       08210025
   DO;                                                                  08220025
     SUBSTR(WRK_CUSTOMER_NUMBER_PI,1,8) = RCBM51AI.CUSTOMER_NUMBERI(I); 08230025
     SUBSTR(WRK_CUSTOMER_NUMBER_PI,9,3) =                               08240025
                                       RCBM51AI.CUSTOMER_NR_EXTENDI(I); 08250025
     RCBM51AO.SELO(I)  = '';                                            08260025
     M = 1;                                                             08270025
     UPDATE_FLAG                 = TRUE;                  /* RB01289 */ 08280025
   END;                                                                 08290025
 END;                                                                   08300025
                                                                        08310025
 IF M = 0 THEN                                                          08320025
 DO;                                                                    08330025
   RCBM51AI.SELL(1)   = -1;                                             08340025
   RCBM51AO.MSG_LINEO = ERR_O032;                                       08350025
   CALL RCBC51M_SEND_MAPA_CSR;                                          08360025
 END;                                                                   08370025
                                                                        08380025
0END RCBC51M_CHECK_MAPA;                                                08390025
1/********************************************************************/ 08400025
 /*      GET CONTRACT SELECTION                                      */ 08410025
 /********************************************************************/ 08420025
0RCBC51M_GET_SELECTION: PROC;                                           08430025
                                                                        08440025
 TS_Q = 'RC00' || EIBTRMID;                                             08450025
                                                                        08460025
 EXEC CICS IGNORE CONDITION QIDERR;                                     08470025
                                                                        08480025
 EXEC CICS DELETEQ TS QUEUE(TS_Q);                                      08490025
                                                                        08500025
 EXEC CICS HANDLE CONDITION QIDERR;                                     08510025
                                                                        08520025
 OK_FLAG = TRUE;                                                        08530025
 TS_CNT  = 0;                                                           08540025
 J       = 0;                                                           08550025
 L       = 1;                                                           08560025
 RCBM51AO.INCNTO  = '';                                                 08570025
 RCBM51AO.TOTCNTO = '';                                                 08580025
                                                                        08590025
 IF CUST_SEL ¬= '' THEN                                                 08600025
 DO;                                                                    08610025
   TMP_CUST = TMP_CUSTB;                                                08620025
   DO I1 = 1 TO 8;                                                      08630025
     IF SUBSTR(CUST_SEL,I1,1) ¬= '' THEN                                08640025
     DO;                                                                08650025
       DO I2 = 8 TO 1 BY -1;                                            08660025
         IF SUBSTR(CUST_SEL,I2,1) ¬= '' THEN                            08670025
         DO;                                                            08680025
           I3 = I2 - I1 + 1;                                            08690025
           SUBSTR(TMP_CUST,2,I3) = SUBSTR(CUST_SEL,I1,I3);              08700025
           I1 = 9;                                                      08710025
           I2 = 0;                                                      08720025
         END;                                                           08730025
       END;                                                             08740025
     END;                                                               08750025
   END;                                                                 08760025
 END;                                                                   08770025
                                                                        08780025
 IF NAME_SEL ¬= '' THEN                                                 08790025
 DO;                                                                    08800025
   TMP_NAME = TMP_NAMEB;                                                08810025
   DO I1 = 1 TO 30;                                                     08820025
     IF SUBSTR(NAME_SEL,I1,1) ¬= '' THEN                                08830025
     DO;                                                                08840025
       DO I2 = 30 TO 1 BY -1;                                           08850025
         IF SUBSTR(NAME_SEL,I2,1) ¬= '' THEN                            08860025
         DO;                                                            08870025
           I3 = I2 - I1 + 1;                                            08880025
           SUBSTR(TMP_NAME,2,I3) = SUBSTR(NAME_SEL,I1,I3);              08890025
           I1 = 31;                                                     08900025
           I2 = 0;                                                      08910025
         END;                                                           08920025
       END;                                                             08930025
     END;                                                               08940025
   END;                                                                 08950025
 END;                                                                   08960025
                                                                        08970025
 EXEC SQL  OPEN C_011;                                                  08980025
                                                                        08990025
 SELECT(SQLCA.SQLCODE);                                                 09000025
   WHEN(0);                                                             09010025
   OTHERWISE                                                            09020025
   DO;                                                                  09030025
     RCBM51AO.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';  09040025
     CALL RCBC51M_SEND_MAPA_CSR;                                        09050025
   END;                                                                 09060025
 END;                                                                   09070025
                                                                        09080025
 DO WHILE (OK_FLAG = TRUE);                                             09090025
   TS_REC = '';                                                         09100025
   EXEC SQL  FETCH C_011                                                09110025
             INTO :TS_REC.CUST                                          09120025
                 ,:TS_REC.CEXT                                          09130025
                 ,:TS_REC.NAME   :NUL011D;                              09140025
                                                                        09150025
     IF (SQLCA.SQLCODE = 0) THEN                                        09160025
     DO;                                                                09170025
       IF NUL011D = -1 THEN                                             09180025
         TS_REC.NAME = '';                                              09190025
       EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                    09200025
       TS_CNT = TS_CNT + 1;                                             09210025
     END;                                                               09220025
                                                                        09230025
     IF (SQLCA.SQLCODE ¬= 0) THEN                                       09240025
     DO;                                                                09250025
       OK_FLAG = FALSE;                                                 09260025
     END;                                                               09270025
   END;                                                                 09280025
                                                                        09290025
 IF TS_CNT = 0 THEN                                                     09300025
 DO;                                                                    09310025
   CALL RCBC51M_CLEAR_MAPA;                                             09320025
   CALL RCBC51M_SET_MAPA;                                               09330025
                                                                        09340025
   RCBM51AI.CUST_SELL = -1;                                             09350025
                                                /* SOC CEDS00000385 */  09360025
 /*RCBM51AO.MSG_LINEO = 'No records found for this seqrch criteria';*/  09370025
   RCBM51AO.MSG_LINEO = 'No records found for this search criteria';    09380025
                                                /* EOC CEDS00000385 */  09390025
   CALL RCBC51M_SEND_MAPA_CSR;                                          09400025
 END;                                                                   09410025
                                                                        09420025
0END RCBC51M_GET_SELECTION;                                             09430025
1/********************************************************************/ 09440025
 /*      VALIDATE MAP                                                */ 09450025
 /********************************************************************/ 09460025
0RCBC51M_VALIDATE_MAP: PROC;                                            09470025
                                                                        09480025
 PF5_FLAG = FALSE;                                                      09490025
                                                                        09500025
 CUSTOMER_NUMBER_REAL_FLAG = TRUE;                   /* SOC RB01289  */ 09510025
 CUSTOMER_NUMBER_DU_FLAG   = FALSE;                                     09520025
                                                                        09530025
 IF (RCBM51I.ESERVI ¬= '' &  RCBM51I.CISCOI ¬= '' &                     09540025
       RCBM51I.PEWI ¬= '' ) |                                           09550025
    (RCBM51I.ESERVI ¬= '' &  RCBM51I.CISCOI ¬= '' ) |                   09560025
    (RCBM51I.ESERVI ¬= '' &    RCBM51I.PEWI ¬= '' ) |                   09570025
    (RCBM51I.CISCOI ¬= '' &    RCBM51I.PEWI ¬= '' ) THEN                09580025
 DO;                                                                    09590025
   RCBM51O.MSG_LINEO = ERR_O203;                                        09600025
   RCBM51O.ESERVC    = DFHRED;                                          09610025
   RCBM51O. CISCOC   = DFHRED;                                          09620025
   RCBM51O. PEWC     = DFHRED;                                          09630025
   RCBM51I.ESERVL    = -1;                                              09640025
   CALL RCBC51M_SEND_MAP_CSR;                                           09650025
 END;                                                                   09660025
                                                                        09670025
 IF VERIFY(RCBM51I.ESERVI,'  X') ¬= 0 THEN                              09680025
 DO;                                                                    09690025
   RCBM51O.MSG_LINEO = ERR_O204;                                        09700025
   RCBM51O.ESERVC    = DFHRED;                                          09710025
   RCBM51I.ESERVL    = -1;                                              09720025
   CALL RCBC51M_SEND_MAP_CSR;                                           09730025
 END;                                                                   09740025
                                                                        09750025
 IF VERIFY(RCBM51I.CISCOI,'  X') ¬= 0 THEN                              09760025
 DO;                                                                    09770025
   RCBM51O.MSG_LINEO = ERR_O204;                                        09780025
   RCBM51O. CISCOC   = DFHRED;                                          09790025
   RCBM51I. CISCOL   = -1;                                              09800025
   CALL RCBC51M_SEND_MAP_CSR;                                           09810025
 END;                                                                   09820025
                                                                        09830025
 IF VERIFY(RCBM51I.PEWI,'  X') ¬= 0 THEN                                09840025
 DO;                                                                    09850025
   RCBM51O.MSG_LINEO = ERR_O204;                                        09860025
   RCBM51O. PEWC     = DFHRED;                                          09870025
   RCBM51I. PEWL     = -1;                                              09880025
   CALL RCBC51M_SEND_MAP_CSR;                                           09890025
 END;                                                                   09900025
                                                                        09910025
 IF RCBM51I.ESERVI         = 'X' THEN                                   09920025
 DO;                                                                    09930025
 CUSTOMER_NUMBER_DU_FLAG   = TRUE                                       09940025
 CUSTOMER_NUMBER_REAL_FLAG = FALSE;                                     09950025
 WRK_CUST_PREFIX           = "EP";                                      09960025
 CALL RCBC51M_GET_MAX_NUMBER;                                           09970025
 CALL RCBC51M_GET_DUMMY_NUMBER;                                         09980025
 WRK_CUSTOMER_NUMBER_PI    = WRK_CUST_PREFIX || WRK_CUST_NO || '000';   09990025
 END;                                                                   10000025
                                                                        10010025
 IF RCBM51I.CISCOI         = 'X' THEN                                   10020025
 DO;                                                                    10030025
 CUSTOMER_NUMBER_DU_FLAG   = TRUE                                       10040025
 CUSTOMER_NUMBER_REAL_FLAG = FALSE                                      10050025
 WRK_CUST_PREFIX           = "CI";                                      10060025
 CALL RCBC51M_GET_MAX_NUMBER;                                           10070025
 CALL RCBC51M_GET_DUMMY_NUMBER;                                         10080025
 WRK_CUSTOMER_NUMBER_PI    = WRK_CUST_PREFIX || WRK_CUST_NO || '000';   10090025
 END;                                                                   10100025
                                                                        10110025
 IF RCBM51I.PEWI           = 'X' THEN                                   10120025
 DO;                                                                    10130025
 CUSTOMER_NUMBER_DU_FLAG   = TRUE                                       10140025
 CUSTOMER_NUMBER_REAL_FLAG = FALSE                                      10150025
 WRK_CUST_PREFIX           = "PW";                                      10160025
 CALL RCBC51M_GET_MAX_NUMBER;                                           10170025
 CALL RCBC51M_GET_DUMMY_NUMBER;                                         10180025
 WRK_CUSTOMER_NUMBER_PI    = WRK_CUST_PREFIX || WRK_CUST_NO || '000';   10190025
 END;                                                                   10200025
                                                                        10210025
 IF CUSTOMER_NUMBER_DU_FLAG THEN                                        10220025
 DO;                                                                    10230025
 IF RCBM51I.CUSTOMER_NUMBER_PII ¬= '' THEN                              10240025
 DO;                                                                    10250025
   WRK_CUSTOMER_NUMBER_PI        = '';                                  10260025
   RCBM51O.MSG_LINEO             = ERR_O205;                            10270025
   RCBM51O.CUSTOMER_NUMBER_PIC   = DFHRED;                              10280025
   RCBM51I.CUSTOMER_NUMBER_PIL   = -1;                                  10290025
   CALL RCBC51M_SEND_MAP_CSR;                                           10300025
 END;                                                                   10310025
 END;                                                                   10320025
                                                                        10330025
 IF CUSTOMER_NUMBER_REAL_FLAG THEN                                      10340025
 DO;                                                 /* EOC RB01289  */ 10350025
 IF WRK_CUSTOMER_NUMBER_PI      = ''                                    10360025
  | WRK_CUSTOMER_NUMBER_PI  = '0'                        /* RB01289 */  10370025
  & RCBM51I.CUSTOMER_NUMBER_PII = '' THEN                               10380025
 DO;                                                                    10390025
   WRK_CUSTOMER_NUMBER_PI       = '';                                   10400025
   RCBM51O.MSG_LINEO = ERR_O117;                                        10410025
   RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                                10420025
   RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                    10430025
   CALL RCBC51M_SEND_MAP_CSR;                                           10440025
 END;                                                                   10450025
                                                      /* SOC RB01289  */10460025
 IF VERIFY(RCBM51I.CUSTOMER_NUMBER_PII, ALPHANUMERIC1) ¬= 0 THEN        10470025
 DO;                                                                    10480025
   RCBM51O.MSG_LINEO           = ERR_O101;                              10490025
   RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                                10500025
   RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                    10510025
   CALL RCBC51M_SEND_MAP_CSR;                                           10520025
 END;                                                                   10530025
                                                                        10540025
                                                                        10550025
 IF  CUSTOMER_NUMBER_REAL_FLAG THEN                                     10560025
 DO;                                                                    10570025
 WRK_CUST_PREFIX = ''                                                   10580025
 WRK_CUST_PREFIX = SUBSTR(RCBM51I.CUSTOMER_NUMBER_PII,1,2);             10590025
                                                                        10600025
 IF (WRK_CUST_PREFIX = 'EP'| WRK_CUST_PREFIX='ES'| WRK_CUST_PREFIX='CC' 10610025
 |   WRK_CUST_PREFIX ='CI' | WRK_CUST_PREFIX='PW'| WRK_CUST_PREFIX='PE')10620025
 THEN  DO;                                                              10630025
   RCBM51O.MSG_LINEO           = ERR_O206;                              10640025
   RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                                10650025
   RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                    10660025
   CALL RCBC51M_SEND_MAP_CSR;                                           10670025
 END;                                                                   10680025
 END;                                                  /* EOC RB01289 */10690025
                                                                        10700025
   WRK_CUSTOMER_NUMBER_PI = RCBM51I.CUSTOMER_NUMBER_PII;                10710025
                                                                        10720025
 END;                                                                   10730025
                                                                        10740025
0END RCBC51M_VALIDATE_MAP;                                              10750025
1/********************************************************************/ 10760025
 /*      GET CUSTOMER DETAILS                                        */ 10770025
 /********************************************************************/ 10780025
0RCBC51M_GET_CUSTOMER: PROC;                                            10790025
                                                                        10800025
 WRK_CUST     = SUBSTR(WRK_CUSTOMER_NUMBER_PI,1,8);                     10810025
 WRK_CUST_EXT = SUBSTR(WRK_CUSTOMER_NUMBER_PI,9,3);                     10820025
                                                                        10830025
 EXEC SQL                                                               10840025
   SELECT CUSTOMER_NAME                                                 10850025
         ,TYPE_OF_CUSTOMER                                              10860025
         ,ADDRESS_LINE_1                                                10870025
         ,ADDRESS_LINE_2                                                10880025
         ,ADDRESS_LINE_3                                                10890025
         ,ZIP_CODE                                                      10900025
         ,EMBARGO_CODE                                                  10910025
   INTO :WRK_CUSTOMER_NAME     :NUL011D                                 10920025
       ,:WRK_TYPE_OF_CUSTOMER  :NUL011E                                 10930025
       ,:WRK_ADDRESS_LINE_1    :NUL011F                                 10940025
       ,:WRK_ADDRESS_LINE_2    :NUL011G                                 10950025
       ,:WRK_ADDRESS_LINE_3    :NUL011H                                 10960025
       ,:WRK_ZIP_CODE          :NUL011I                                 10970025
       ,:WRK_EMBARGO_CODE      :NUL011J                                 10980025
   FROM RCBV0011_PI_CUST                                                10990025
   WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                       11000025
     AND CUSTOMER_NUMBER    = :WRK_CUST                                 11010025
     AND CUSTOMER_NR_EXTEND = :WRK_CUST_EXT;                            11020025
                                                                        11030025
 SELECT(SQLCA.SQLCODE);                                                 11040025
   WHEN(0)                                                              11050025
     IF RCBM51I.ACTIONI = '1' THEN                                      11060025
     DO;                                                                11070025
       RCBM51O.MSG_LINEO           = ERR_O128;                          11080025
       RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                            11090025
       RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                11100025
       CALL RCBC51M_SEND_MAP_CSR;                                       11110025
     END;                                                               11120025
     ELSE DO;                                                           11130025
       IF NUL011D ¬= -1 THEN                                            11140025
         RCBM51O.CUSTOMER_NAMEO = WRK_CUSTOMER_NAME;                    11150025
       ELSE DO;                                                         11160025
         RCBM51O.CUSTOMER_NAMEO = '';                                   11170025
         WRK_CUSTOMER_NAME      = '';                                   11180025
       END;                                                             11190025
                                                                        11200025
       IF NUL011E ¬= -1 THEN                                            11210025
         RCBM51O.TYPE_OF_CUSTOMERO = WRK_TYPE_OF_CUSTOMER;              11220025
       ELSE DO;                                                         11230025
         RCBM51O.TYPE_OF_CUSTOMERO = '';                                11240025
         WRK_TYPE_OF_CUSTOMER      = '';                                11250025
       END;                                                             11260025
                                                                        11270025
       IF NUL011F ¬= -1 THEN                                            11280025
         RCBM51O.ADDRESS_LINE_1O = WRK_ADDRESS_LINE_1;                  11290025
       ELSE DO;                                                         11300025
         RCBM51O.ADDRESS_LINE_1O = '';                                  11310025
         WRK_ADDRESS_LINE_1      = '';                                  11320025
       END;                                                             11330025
                                                                        11340025
       IF NUL011G ¬= -1 THEN                                            11350025
         RCBM51O.ADDRESS_LINE_2O = WRK_ADDRESS_LINE_2;                  11360025
       ELSE DO;                                                         11370025
         RCBM51O.ADDRESS_LINE_2O = '';                                  11380025
         WRK_ADDRESS_LINE_2      = '';                                  11390025
       END;                                                             11400025
                                                                        11410025
       IF NUL011H ¬= -1 THEN                                            11420025
         RCBM51O.ADDRESS_LINE_3O = WRK_ADDRESS_LINE_3;                  11430025
       ELSE DO;                                                         11440025
         RCBM51O.ADDRESS_LINE_3O = '';                                  11450025
         WRK_ADDRESS_LINE_3      = '';                                  11460025
       END;                                                             11470025
                                                                        11480025
       IF NUL011I ¬= -1 THEN                                            11490025
         RCBM51O.ZIP_CODEO = WRK_ZIP_CODE;                              11500025
       ELSE DO;                                                         11510025
         RCBM51O.ZIP_CODEO = '';                                        11520025
         WRK_ZIP_CODE      = '';                                        11530025
       END;                                                             11540025
                                                                        11550025
       IF NUL011J ¬= -1 THEN                                            11560025
         RCBM51O.EMBARGO_CODEO = WRK_EMBARGO_CODE;                      11570025
       ELSE DO;                                                         11580025
         RCBM51O.EMBARGO_CODEO = '';                                    11590025
         WRK_EMBARGO_CODE      = '';                                    11600025
       END;                                                             11610025
   CALL RCBC51M_FILL_MAP;                                               11620025
   END;                                                                 11630025
                                                                        11640025
   WHEN(100)                                                            11650025
   DO;                                                                  11660025
     IF RCBM51I.ACTIONI ¬= '1' THEN                                     11670025
     DO;                                                                11680025
       RCBM51O.MSG_LINEO           = ERR_O126;                          11690025
       RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                            11700025
       RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                11710025
       CALL RCBC51M_SEND_MAP_CSR;                                       11720025
     END;                                                               11730025
     IF RCBM51I.ACTIONI = '2' THEN                                      11740025
     DO;                                                                11750025
       RCBM51O.MSG_LINEO           = ERR_O120;                          11760025
       RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                            11770025
       RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                11780025
       CALL RCBC51M_SEND_MAP_CSR;                                       11790025
     END;                                                               11800025
   END;                                                                 11810025
                                                                        11820025
   OTHERWISE                                                            11830025
   DO;                                                                  11840025
     RCBM51O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE || ' OCCURED';   11850025
     CALL RCBC51M_SEND_MAP;                                             11860025
   END;                                                                 11870025
 END;                                                                   11880025
                                                                        11890025
0END RCBC51M_GET_CUSTOMER;                                              11900025
1/********************************************************************/ 11910025
 /*      PROCESS ACTION REQUEST                                      */ 11920025
 /********************************************************************/ 11930025
0RCBC51M_ACTION_PROCESS: PROC;                                          11940025
                                                                        11950025
 SELECT(RCBM51I.ACTIONI);                                               11960025
   WHEN('1')                          /* DEFINE */                      11970025
   DO;                                                                  11980025
     CALL RCBC51M_UPDATE_CHECK;                                         11990025
     IF PF5_FLAG = TRUE THEN                                            12000025
     DO;                                                                12010025
       CALL RCBC51M_DEFINE_CUSTOMER;                                    12020025
       CALL RCBC51M_UPD_T560;                                           12030025
       RCBM51O.MSG_LINEO = ERR_O123;                                    12040025
       CALL RCBC51M_CLEAR_WORK;                                         12050025
       UPD_OK_FLAG = TRUE;                                              12060025
       CALL RCBC51M_FILL_MAP;                                           12070025
       CALL RCBC51M_SEND_MAP;                                           12080025
     END;                                                               12090025
     ELSE DO;                                                           12100025
       RCBM51O.MSG_LINEO = ERR_O022;                                    12110025
       CALL RCBC51M_SEND_MAP;                                           12120025
     END;                                                               12130025
   END;                                                                 12140025
                                                                        12150025
   WHEN('2')                          /* UPDATE */                      12160025
   DO;                                                                  12170025
     CALL RCBC51M_UPDATE_CHECK;                                         12180025
     IF PF5_FLAG      = TRUE                                            12190025
      & T011_UPD_FLAG = TRUE THEN                                       12200025
     DO;                                                                12210025
       CALL RCBC51M_UPDATE_CUSTOMER;                                    12220025
       CALL RCBC51M_UPD_T560;                                           12230025
       RCBM51O.MSG_LINEO = ERR_O124;                                    12240025
       CALL RCBC51M_CLEAR_WORK;                                         12250025
       UPD_OK_FLAG = TRUE;                                              12260025
       CALL RCBC51M_FILL_MAP;                                           12270025
       CALL RCBC51M_SEND_MAP;                                           12280025
     END;                                                               12290025
     IF PF5_FLAG = FALSE THEN                                           12300025
     DO;                                                                12310025
       RCBM51O.MSG_LINEO = ERR_O022;                                    12320025
       CALL RCBC51M_SEND_MAP;                                           12330025
     END;                                                               12340025
     IF T011_UPD_FLAG = FALSE THEN                                      12350025
     DO;                                                                12360025
       RCBM51O.MSG_LINEO = ERR_O053;                                    12370025
       CALL RCBC51M_SEND_MAP;                                           12380025
     END;                                                               12390025
   END;                                                                 12400025
                                                                        12410025
   OTHERWISE                                                            12420025
   DO;                                                                  12430025
     RCBM51O.MSG_LINEO = ERR_O064;                                      12440025
     RCBM51O.ACTIONC   = DFHRED;                                        12450025
     RCBM51I.ACTIONL   = -1;                                            12460025
     CALL RCBC51M_SEND_MAP_CSR;                                         12470025
   END;                                                                 12480025
 END;                                                                   12490025
                                                                        12500025
0END RCBC51M_ACTION_PROCESS;                                            12510025
1/********************************************************************/ 12520025
 /*      UPDATE REQUESTED                                            */ 12530025
 /********************************************************************/ 12540025
0RCBC51M_UPDATE_CHECK: PROC;                                            12550025
                                                                        12560025
 T011_UPD_FLAG = FALSE;                                                 12570025
                                                                        12580025
 IF RCBM51I.CUSTOMER_NAMEF    = ERASE_EOF THEN                          12590025
   RCBM51O.CUSTOMER_NAMEO     = '';                                     12600025
 IF RCBM51I.TYPE_OF_CUSTOMERF = ERASE_EOF THEN                          12610025
   RCBM51O.TYPE_OF_CUSTOMERO  = '';                                     12620025
 IF RCBM51I.ADDRESS_LINE_1F   = ERASE_EOF THEN                          12630025
   RCBM51O.ADDRESS_LINE_1O    = '';                                     12640025
 IF RCBM51I.ADDRESS_LINE_2F   = ERASE_EOF THEN                          12650025
   RCBM51O.ADDRESS_LINE_2O    = '';                                     12660025
 IF RCBM51I.ADDRESS_LINE_2F   = ERASE_EOF THEN                          12670025
   RCBM51O.ADDRESS_LINE_2O    = '';                                     12680025
 IF RCBM51I.ZIP_CODEF         = ERASE_EOF THEN                          12690025
   RCBM51O.ZIP_CODEO          = '';                                     12700025
 IF RCBM51I.EMBARGO_CODEF     = ERASE_EOF THEN                          12710025
   RCBM51O.EMBARGO_CODEO      = '';                                     12720025
                                                                        12730025
 IF RCBM51I.CUSTOMER_NAMEI ¬= WRK_CUSTOMER_NAME THEN                    12740025
 DO;                                                                    12750025
   T011_UPD_FLAG = TRUE;                                                12760025
 END;                                                                   12770025
                                                                        12780025
 IF RCBM51I.TYPE_OF_CUSTOMERI ¬= WRK_TYPE_OF_CUSTOMER THEN              12790025
 DO;                                                                    12800025
   T011_UPD_FLAG = TRUE;                                                12810025
 END;                                                                   12820025
                                                                        12830025
 IF RCBM51I.ADDRESS_LINE_1I ¬= WRK_ADDRESS_LINE_1 THEN                  12840025
 DO;                                                                    12850025
   T011_UPD_FLAG = TRUE;                                                12860025
 END;                                                                   12870025
                                                                        12880025
 IF RCBM51I.ADDRESS_LINE_2I ¬= WRK_ADDRESS_LINE_2 THEN                  12890025
 DO;                                                                    12900025
   T011_UPD_FLAG = TRUE;                                                12910025
 END;                                                                   12920025
                                                                        12930025
 IF RCBM51I.ADDRESS_LINE_3I ¬= WRK_ADDRESS_LINE_3 THEN                  12940025
 DO;                                                                    12950025
   T011_UPD_FLAG = TRUE;                                                12960025
 END;                                                                   12970025
                                                                        12980025
 IF RCBM51I.ZIP_CODEI ¬= WRK_ZIP_CODE THEN                              12990025
 DO;                                                                    13000025
   IF VERIFY(RCBM51I.ZIP_CODEI, ALPHANUMERIC) ¬= 0 THEN                 13010025
   DO;                                                                  13020025
     RCBM51O.MSG_LINEO = ERR_O101;                                      13030025
     RCBM51O.ZIP_CODEC = DFHRED;                                        13040025
     RCBM51I.ZIP_CODEL = -1;                                            13050025
     CALL RCBC51M_SEND_MAP_CSR;                                         13060025
   END;                                                                 13070025
                                                                        13080025
   T011_UPD_FLAG = TRUE;                                                13090025
 END;                                                                   13100025
                                                                        13110025
 IF RCBM51I.EMBARGO_CODEI ¬= WRK_EMBARGO_CODE THEN                      13120025
 DO;                                                                    13130025
   T011_UPD_FLAG = TRUE;                                                13140025
 END;                                                                   13150025
                                                                        13160025
 IF PF5_FLAG = TRUE                                                     13170025
  & T011_UPD_FLAG = TRUE THEN                                           13180025
 DO;                                                                    13190025
     WRK_CUSTOMER_NAME     = RCBM51I.CUSTOMER_NAMEI;                    13200025
     WRK_TYPE_OF_CUSTOMER  = RCBM51I.TYPE_OF_CUSTOMERI;                 13210025
     WRK_ADDRESS_LINE_1    = RCBM51I.ADDRESS_LINE_1I;                   13220025
     WRK_ADDRESS_LINE_2    = RCBM51I.ADDRESS_LINE_2I;                   13230025
     WRK_ADDRESS_LINE_3    = RCBM51I.ADDRESS_LINE_3I;                   13240025
     WRK_ZIP_CODE          = RCBM51I.ZIP_CODEI;                         13250025
     WRK_EMBARGO_CODE      = RCBM51I.EMBARGO_CODEI;                     13260025
 END;                                                                   13270025
                                                                        13280025
 IF PF5_FLAG = FALSE                                                    13290025
  & T011_UPD_FLAG = TRUE THEN                                           13300025
 DO;                                                                    13310025
   RCBM51O.MSG_LINEO = ERR_O022;                                        13320025
   CALL RCBC51M_SEND_MAP;                                               13330025
 END;                                                                   13340025
                                                                        13350025
 END RCBC51M_UPDATE_CHECK;                                              13360025
1/********************************************************************/ 13370025
 /*      UPDATE T011 RECORD                                          */ 13380025
 /********************************************************************/ 13390025
0RCBC51M_UPDATE_CUSTOMER: PROC;                                         13400025
                                                                        13410025
 IF T011_UPD_FLAG = FALSE THEN                                          13420025
 DO;                                                                    13430025
   RCBM51O.MSG_LINEO = ERR_O053;                                        13440025
   RCBM51O.CUSTOMER_NUMBER_PIC  = DFHRED;                               13450025
   RCBM51I.CUSTOMER_NUMBER_PIL  = -1;                                   13460025
   CALL RCBC51M_SEND_MAP_CSR;                                           13470025
 END;                                                                   13480025
                                                                        13490025
 WRK_CUST     = SUBSTR(WRK_CUSTOMER_NUMBER_PI,1,8);                     13500025
 WRK_CUST_EXT = SUBSTR(WRK_CUSTOMER_NUMBER_PI,9,3);                     13510025
                                                                        13520025
 IF WRK_TYPE_OF_CUSTOMER = '' THEN NUL011E = -1;                        13530025
 IF WRK_EMBARGO_CODE     = '' THEN NUL011J = -1;                        13540025
                                                                        13550025
 EXEC SQL                                                               13560025
      UPDATE RCBV0011_PI_CUST                                           13570025
      SET    CUSTOMER_NAME      = :WRK_CUSTOMER_NAME                    13580025
                                  :NUL011D,                             13590025
             TYPE_OF_CUSTOMER   = :WRK_TYPE_OF_CUSTOMER                 13600025
                                  :NUL011E,                             13610025
             ADDRESS_LINE_1     = :WRK_ADDRESS_LINE_1                   13620025
                                  :NUL011F,                             13630025
             ADDRESS_LINE_2     = :WRK_ADDRESS_LINE_2                   13640025
                                  :NUL011G,                             13650025
             ADDRESS_LINE_3     = :WRK_ADDRESS_LINE_3                   13660025
                                  :NUL011H,                             13670025
             ZIP_CODE           = :WRK_ZIP_CODE                         13680025
                                  :NUL011I,                             13690025
             EMBARGO_CODE       = :WRK_EMBARGO_CODE                     13700025
                                  :NUL011J,                             13710025
             SOURCE_INDICATOR   = :WRK_O                                13720025
                                  :NUL011K,                             13730025
             LAST_CHANGE_DATE   = :WRK_DATE                             13740025
                                  :NUL011L                              13750025
      WHERE  COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                   13760025
        AND  CUSTOMER_NUMBER    = :WRK_CUST                             13770025
        AND  CUSTOMER_NR_EXTEND = :WRK_CUST_EXT;                        13780025
                                                                        13790025
 SELECT (SQLCA.SQLCODE);                                                13800025
   WHEN (0);                                                            13810025
   OTHERWISE                                                            13820025
   DO;                                                                  13830025
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       13840025
     RCBM51O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0011 UPDATE = '       13850025
                       || PIC_EXPLAIN;                                  13860025
     RCBM51O.CUSTOMER_NUMBER_PIC  = DFHRED;                             13870025
     RCBM51I.CUSTOMER_NUMBER_PIL  = -1;                                 13880025
     CALL RCBC51M_SEND_MAP_CSR;                                         13890025
   END;                                                                 13900025
 END;                                                                   13910025
                                                                        13920025
0END RCBC51M_UPDATE_CUSTOMER;                                           13930025
1/********************************************************************/ 13940025
 /*      CREATE T011 RECORD                                          */ 13950025
 /********************************************************************/ 13960025
0RCBC51M_DEFINE_CUSTOMER: PROC;                                         13970025
                                                                        13980025
 IF VERIFY(RCBM51I.CUSTOMER_NUMBER_PII, ALPHANUMERIC) ¬= 0 THEN         13990025
 DO;                                                                    14000025
   RCBM51O.MSG_LINEO           = ERR_O101;                              14010025
   RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                                14020025
   RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                    14030025
   CALL RCBC51M_SEND_MAP_CSR;                                           14040025
 END;                                                                   14050025
                                                      /* SOC RB01289  */14060025
 IF VERIFY(RCBM51I.CUSTOMER_NUMBER_PII, ALPHANUMERIC1) ¬= 0 THEN        14070025
 DO;                                                                    14080025
   RCBM51O.MSG_LINEO           = ERR_O101;                              14090025
   RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                                14100025
   RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                    14110025
   CALL RCBC51M_SEND_MAP_CSR;                                           14120025
 END;                                                                   14130025
                                                      /* E0C RB01289 */ 14140025
                                                                        14150025
                                                                        14160025
 WRK_CUST     = SUBSTR(WRK_CUSTOMER_NUMBER_PI,1,8);                     14170025
 WRK_CUST_EXT = SUBSTR(WRK_CUSTOMER_NUMBER_PI,9,3);                     14180025
                                                                        14190025
 RCB011S.COUNTRY_NUMBER     = WRK_COUNTRY_NUMBER;                       14200025
 RCB011S.CUSTOMER_NUMBER    = WRK_CUST;                                 14210025
 RCB011S.CUSTOMER_NR_EXTEND = WRK_CUST_EXT;                             14220025
 RCB011S.CUSTOMER_NAME      = WRK_CUSTOMER_NAME;                        14230025
                                                                        14240025
 IF WRK_TYPE_OF_CUSTOMER       = '' THEN RCB011SI.INDNULL(5) = -1;      14250025
 ELSE RCB011S.TYPE_OF_CUSTOMER = WRK_TYPE_OF_CUSTOMER;                  14260025
                                                                        14270025
 RCB011S.ADDRESS_LINE_1     = WRK_ADDRESS_LINE_1;                       14280025
 RCB011S.ADDRESS_LINE_2     = WRK_ADDRESS_LINE_2;                       14290025
 RCB011S.ADDRESS_LINE_3     = WRK_ADDRESS_LINE_3;                       14300025
 RCB011S.ZIP_CODE           = WRK_ZIP_CODE;                             14310025
                                                                        14320025
 IF WRK_EMBARGO_CODE        = '' THEN RCB011SI.INDNULL(10) = -1;        14330025
 ELSE RCB011S.EMBARGO_CODE  = WRK_EMBARGO_CODE;                         14340025
                                                                        14350025
 RCB011S.SOURCE_INDICATOR   = WRK_O;                                    14360025
 RCB011S.LAST_CHANGE_DATE   = WRK_DATE;                                 14370025
                                                                        14380025
 EXEC SQL                                                               14390025
      INSERT INTO RCBV0011_PI_CUST                                      14400025
      (COUNTRY_NUMBER                                                   14410025
      ,CUSTOMER_NUMBER                                                  14420025
      ,CUSTOMER_NR_EXTEND                                               14430025
      ,CUSTOMER_NAME                                                    14440025
      ,TYPE_OF_CUSTOMER                                                 14450025
      ,ADDRESS_LINE_1                                                   14460025
      ,ADDRESS_LINE_2                                                   14470025
      ,ADDRESS_LINE_3                                                   14480025
      ,ZIP_CODE                                                         14490025
      ,EMBARGO_CODE                                                     14500025
      ,SOURCE_INDICATOR                                                 14510025
      ,LAST_CHANGE_DATE)                                                14520025
      VALUES (:RCB011S:RCB011SI.INDNULL);                               14530025
                                                                        14540025
 SELECT (SQLCA.SQLCODE);                                                14550025
   WHEN (0);                                                            14560025
   WHEN (-803)                                         /* SOC RB01289 */14570025
   DO;                                                                  14580025
     RCBM51O.MSG_LINEO           = ERR_O128;                            14590025
     RCBM51O.CUSTOMER_NUMBER_PIC = DFHRED;                              14600025
     RCBM51I.CUSTOMER_NUMBER_PIL = -1;                                  14610025
     CALL RCBC51M_SEND_MAP_CSR;                                         14620025
   END;                                                /* EOC RB01289 */14630025
   OTHERWISE                                                            14640025
   DO;                                                                  14650025
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       14660025
     RCBM51O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0011 INSERT = '       14670025
                       || PIC_EXPLAIN;                                  14680025
     RCBM51O.CUSTOMER_NUMBER_PIC  = DFHRED;                             14690025
     RCBM51I.CUSTOMER_NUMBER_PIL  = -1;                                 14700025
     CALL RCBC51M_SEND_MAP_CSR;                                         14710025
   END;                                                                 14720025
 END;                                                                   14730025
                                                                        14740025
0END RCBC51M_DEFINE_CUSTOMER;                                           14750025
1/********************************************************************/ 14760025
 /*      CREATE T560 RECORD                                          */ 14770025
 /********************************************************************/ 14780025
0RCBC51M_UPD_T560: PROC;                                                14790025
                                                                        14800025
 /*DCL WRK_TIME_IN  CHAR(26) INIT('');          /* CEDS00000361 */      14810025
                                                                        14820025
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         14830025
                                                                        14840025
 WRKMAP_DATA = ' ';                                                     14850025
 WRKMAP.CUSTOMER_NUMBER    = WRK_CUST;                                  14860025
 WRKMAP.CUSTOMER_NR_EXTEND = WRK_CUST_EXT;                              14870025
 WRKMAP.CUSTOMER_NAME      = WRK_CUSTOMER_NAME;                         14880025
 WRKMAP.TYPE_OF_CUSTOMER   = WRK_TYPE_OF_CUSTOMER;                      14890025
 WRKMAP.ADDRESS_LINE_1     = WRK_ADDRESS_LINE_1;                        14900025
 WRKMAP.ADDRESS_LINE_2     = WRK_ADDRESS_LINE_2;                        14910025
 WRKMAP.ADDRESS_LINE_3     = WRK_ADDRESS_LINE_3;                        14920025
 WRKMAP.ZIP_CODE           = WRK_ZIP_CODE;                              14930025
 WRKMAP.EMBARGO_CODE       = WRK_EMBARGO_CODE;                          14940025
 WRKMAP.SOURCE_INDICATOR   = WRK_O;                                     14950025
 WRKMAP.LAST_CHANGE_DATE   = WRK_DATE;                                  14960025
                                                                        14970025
 RCB560S                 = ' ';                                         14980025
 RCB560S.COUNTRY_NUMBER  = WRK_COUNTRY_NUMBER;                          14990025
 RCB560S.TXN_CODE        = 'RCBTXN51';                                  15000025
 RCB560S.TIMESTAMP       = WRK_TIME_IN;                                 15010025
 RCB560S.USERID          = HEADER.USERID;                               15020025
 RCB560S.ACTION          = RCBM51I.ACTIONI;                             15030025
 RCB560S.DATA            = WRKMAP_DATA;                                 15040025
                                                                        15050025
 EXEC SQL                                                               15060025
      INSERT INTO RCBV0560_XACTION                                      15070025
      (COUNTRY_NUMBER,                                                  15080025
       TXN_CODE,                                                        15090025
       TIMESTAMP,                                                       15100025
       USERID,                                                          15110025
       ACTION,                                                          15120025
       DATA)                                                            15130025
        VALUES (:RCB560S:RCB560SI.INDNULL);                             15140025
                                                                        15150025
 SELECT(SQLCA.SQLCODE);                                                 15160025
   WHEN(0);                                                             15170025
   OTHERWISE                                                            15180025
   DO;                                                                  15190025
     RET_CODE = SQLCA.SQLCODE;                                          15200025
     SUB_CODE = SQLCA.SQLCABC;                                          15210025
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       15220025
     RCBM51O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0560 INSERT = '       15230025
                         || PIC_EXPLAIN;                                15240025
     CALL RCBC51M_SEND_MAP;                                             15250025
   END;                                                                 15260025
 END;                                                                   15270025
                                                                        15280025
0END RCBC51M_UPD_T560;                                                  15290025
1/********************************************************************/ 15300025
 /*      GET CURSOR POSITION                                         */ 15310025
 /*         FOR RETURN FROM HELP SCREENS                             */ 15320025
 /********************************************************************/ 15330025
0RCBC51M_GET_CSR_POS: PROC;                                             15340025
                                                                        15350025
 SELECT(CSR_POS);                                                       15360025
   WHEN(1)  RCBM51I.ACTIONL             = -1;                           15370025
   WHEN(2)  RCBM51I.CUSTOMER_NUMBER_PIL = -1;                           15380025
   WHEN(3)  RCBM51I.CUSTOMER_NAMEL      = -1;                           15390025
   WHEN(4)  RCBM51I.TYPE_OF_CUSTOMERL   = -1;                           15400025
   WHEN(5)  RCBM51I.ADDRESS_LINE_1L     = -1;                           15410025
   WHEN(6)  RCBM51I.ADDRESS_LINE_2L     = -1;                           15420025
   WHEN(7)  RCBM51I.ADDRESS_LINE_3L     = -1;                           15430025
   WHEN(8)  RCBM51I.ZIP_CODEL           = -1;                           15440025
   WHEN(9)  RCBM51I.EMBARGO_CODEL       = -1;                           15450025
   WHEN(10) RCBM51I.ESERVL              = -1;          /* SOC RB01289 */15460025
   WHEN(11) RCBM51I.CISCOL              = -1;                           15470025
   WHEN(12) RCBM51I.PEWL                = -1;          /* EOC RB01289 */15480025
 END;                                                                   15490025
                                                                        15500025
0END RCBC51M_GET_CSR_POS;                                               15510025
1/********************************************************************/ 15520025
 /*      SAVE MAP                                                    */ 15530025
 /********************************************************************/ 15540025
0RCBC51M_SAVE_MAP: PROC;                                                15550025
                                                                        15560025
 TMP_ESERV              = RCBM51I.ESERVI              /* SOC RB01289 */ 15570025
 TMP_CISCO              = RCBM51I.CISCOI                                15580025
 TMP_PEW                = RCBM51I.PEWI                /* EOC RB01289 */ 15590025
 TMP_CUSTOMER_NUMBER_PI = RCBM51I.CUSTOMER_NUMBER_PII;                  15600025
 TMP_CUSTOMER_NAME      = RCBM51I.CUSTOMER_NAMEI;                       15610025
 TMP_TYPE_OF_CUSTOMER   = RCBM51I.TYPE_OF_CUSTOMERI;                    15620025
 TMP_ADDRESS_LINE_1     = RCBM51I.ADDRESS_LINE_1I;                      15630025
 TMP_ADDRESS_LINE_2     = RCBM51I.ADDRESS_LINE_2I;                      15640025
 TMP_ADDRESS_LINE_3     = RCBM51I.ADDRESS_LINE_3I;                      15650025
 TMP_ZIP_CODE           = RCBM51I.ZIP_CODEI;                            15660025
 TMP_EMBARGO_CODE       = RCBM51I.EMBARGO_CODEI;                        15670025
                                                                        15680025
0END RCBC51M_SAVE_MAP;                                                  15690025
1/********************************************************************/ 15700025
 /*      SAVE MAP                                                    */ 15710025
 /********************************************************************/ 15720025
0RCBC51M_RESTORE_MAP: PROC;                                             15730025
                                                                        15740025
 RCBM51O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                      15750025
 RCBM51O.ACTIONO             = WRK_ACTION;                              15760025
 RCBM51O.ESERVO              = TMP_ESERV;             /* SOC RB01289 */ 15770025
 RCBM51O.CISCOO              = TMP_CISCO;                               15780025
 RCBM51O.PEWO                = TMP_PEW;               /* EOC RB01289 */ 15790025
 RCBM51O.CUSTOMER_NUMBER_PIO = TMP_CUSTOMER_NUMBER_PI;                  15800025
 RCBM51O.CUSTOMER_NAMEO      = TMP_CUSTOMER_NAME;                       15810025
 RCBM51O.TYPE_OF_CUSTOMERO   = TMP_TYPE_OF_CUSTOMER;                    15820025
 RCBM51O.ADDRESS_LINE_1O     = TMP_ADDRESS_LINE_1;                      15830025
 RCBM51O.ADDRESS_LINE_2O     = TMP_ADDRESS_LINE_2;                      15840025
 RCBM51O.ADDRESS_LINE_3O     = TMP_ADDRESS_LINE_3;                      15850025
 RCBM51O.ZIP_CODEO           = TMP_ZIP_CODE;                            15860025
 RCBM51O.EMBARGO_CODEO       = TMP_EMBARGO_CODE;                        15870025
                                                                        15880025
0END RCBC51M_RESTORE_MAP;                                               15890025
1/********************************************************************/ 15900025
 /*      CLEAR PROCESSING                                            */ 15910025
 /*         CLEAR OUT WORK FIELDS                                    */ 15920025
 /********************************************************************/ 15930025
0RCBC51M_CLEAR_WORK: PROC;                                              15940025
                                                                        15950025
 HEADER.NEXT              = '00';                                       15960025
 WRK_ACTION               = '';                                         15970025
 WRK_ESERV                = '';                       /* SOC RB01289 */ 15980025
 WRK_CISCO                = '';                                         15990025
 WRK_PEW                  = '';                       /* EOC RB01289 */ 16000025
 WRK_CUSTOMER_NUMBER_PI   = '';                                         16010025
 WRK_CUSTOMER_NAME        = '';                                         16020025
 WRK_TYPE_OF_CUSTOMER     = '';                                         16030025
 WRK_ADDRESS_LINE_1       = '';                                         16040025
 WRK_ADDRESS_LINE_2       = '';                                         16050025
 WRK_ADDRESS_LINE_3       = '';                                         16060025
 WRK_ZIP_CODE             = '';                                         16070025
 WRK_EMBARGO_CODE         = '';                                         16080025
 PF5_FLAG                 = FALSE;                                      16090025
                                                                        16100025
0END RCBC51M_CLEAR_WORK;                                                16110025
1/********************************************************************/ 16120025
 /*      CLEAR MAP RCBM51                                            */ 16130025
 /********************************************************************/ 16140025
0RCBC51M_CLEAR_MAP: PROC;                                               16150025
                                                                        16160025
 RCBM51O.COUNTRY_NUMBERO     = WRK_COUNTRY_NUMBER;                      16170025
 RCBM51O.ACTIONO             = '';                                      16180025
 RCBM51O.ESERVO              = '';                    /* SOC RB01289 */ 16190025
 RCBM51O.CISCOO              = '';                                      16200025
 RCBM51O.PEWO                = '';                    /* EOC RB01289 */ 16210025
 RCBM51O.CUSTOMER_NUMBER_PIO = '';                                      16220025
 RCBM51O.CUSTOMER_NAMEO      = '';                                      16230025
 RCBM51O.TYPE_OF_CUSTOMERO   = '';                                      16240025
 RCBM51O.ADDRESS_LINE_1O     = '';                                      16250025
 RCBM51O.ADDRESS_LINE_2O     = '';                                      16260025
 RCBM51O.ADDRESS_LINE_3O     = '';                                      16270025
 RCBM51O.ZIP_CODEO           = '';                                      16280025
 RCBM51O.EMBARGO_CODEO       = '';                                      16290025
 PF5_FLAG                    = FALSE;                                   16300025
                                                                        16310025
0END RCBC51M_CLEAR_MAP;                                                 16320025
1/********************************************************************/ 16330025
 /*      CLEAR MAP RCBM51A                                           */ 16340025
 /********************************************************************/ 16350025
0RCBC51M_CLEAR_MAPA: PROC;                                              16360025
                                                                        16370025
 M = 0;                                                                 16380025
 RCBM51AO.INCNTO    = '';                                               16390025
 RCBM51AO.TOTCNTO   = '';                                               16400025
 RCBM51AO.CUST_SELO = '';                                               16410025
 RCBM51AO.NAME_SELO = '';                                               16420025
                                                                        16430025
 RCBM51AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         16440025
 DO I = 1 TO 15;                                                        16450025
   RCBM51AO.CUSTOMER_NUMBERO(I)    = '';                                16460025
   RCBM51AO.CUSTOMER_NR_EXTENDO(I) = '';                                16470025
   RCBM51AO.CUSTOMER_NAMEO(I)      = '';                                16480025
   RCBM51AO.SELO(I)                = '';                                16490025
 END;                                                                   16500025
                                                                        16510025
0END RCBC51M_CLEAR_MAPA;                                                16520025
1/********************************************************************/ 16530025
 /*      CLEAR MAP RCBM51A 2                                         */ 16540025
 /********************************************************************/ 16550025
0RCBC51M_CLEAR_MAPA_2: PROC;                                            16560025
                                                                        16570025
 M = 0;                                                                 16580025
 RCBM51AO.INCNTO    = '';                                               16590025
 RCBM51AO.TOTCNTO   = '';                                               16600025
                                                                        16610025
 DO I = 1 TO 15;                                                        16620025
   RCBM51AO.CUSTOMER_NUMBERO(I)    = '';                                16630025
   RCBM51AO.CUSTOMER_NR_EXTENDO(I) = '';                                16640025
   RCBM51AO.CUSTOMER_NAMEO(I)      = '';                                16650025
   RCBM51AO.SELO(I)                = '';                                16660025
 END;                                                                   16670025
                                                                        16680025
0END RCBC51M_CLEAR_MAPA_2;                                              16690025
1/********************************************************************/ 16700025
 /*      CLEAR MAP RCBM51A SELECTION                                 */ 16710025
 /********************************************************************/ 16720025
0RCBC51M_CLEAR_SEL: PROC;                                               16730025
                                                                        16740025
 CUST_SEL = '********';                                                 16750025
 NAME_SEL = '******************************';                           16760025
 TS_CNT     = 0;                                                        16770025
                                                                        16780025
0END RCBC51M_CLEAR_SEL;                                                 16790025
1/********************************************************************/ 16800025
 /*      SEND MAP                                                    */ 16810025
 /********************************************************************/ 16820025
0RCBC51M_SEND_MAP : PROC;                                               16830025
                                                                        16840025
 HEADER.REQUEST_ID = '';                                                16850025
                                                                        16860025
                                                                        16870025
 IF UPDATE_FLAG                                       /* SOC RB01289 */ 16880025
 & ¬ UPD_OK_FLAG THEN                                                   16890025
 DO;                                                                    16900025
   RCBM51O.ESERVA              = DFHBMPRF;                              16910025
   RCBM51O.CISCOA              = DFHBMPRF;                              16920025
   RCBM51O.PEWA                = DFHBMPRF;                              16930025
   RCBM51O.CUSTOMER_NUMBER_PIA = DFHBMPRF;                              16940025
 END;                                                 /* EOC RB01289 */ 16950025
                                                                        16960025
0EXEC CICS SEND                                                         16970025
    MAP('RCBM51')                                                       16980025
    MAPSET('RCBM51')                                                    16990025
    FREEKB                                                              17000025
    ERASE                                                               17010025
    RESP(RESPONSE)                                                      17020025
    RESP2(CODE_EXPLAIN);                                                17030025
                                                                        17040025
0EXEC CICS RETURN                                                       17050025
    TRANSID('RC51')                                                     17060025
    COMMAREA(COMMAREA)                                                  17070025
    LENGTH(CSTG(COMMAREA))                                              17080025
    RESP(RESPONSE)                                                      17090025
    RESP2(CODE_EXPLAIN);                                                17100025
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 17110025
   WHEN(DFHRESP(NORMAL));                                               17120025
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  17130025
   DO;                                                                  17140025
     COMMAREA_LENGTH = EIBCALEN;                                        17150025
     EXEC CICS RETURN                                                   17160025
        TRANSID('RC51')                                                 17170025
        COMMAREA(COMMAREA)                                              17180025
        LENGTH(COMMAREA_LENGTH);                                        17190025
   END;                                                                 17200025
   OTHERWISE                                                            17210025
   DO;                                                                  17220025
     RCBM51O.MSG_LINEO = ERR_MESSAGE30;                                 17230025
     CALL RCBC51M_SEND_MAP_CSR;                                         17240025
   END;                                                                 17250025
 END;                                                                   17260025
                                                                        17270025
0END RCBC51M_SEND_MAP;                                                  17280025
1/********************************************************************/ 17290025
 /*      SEND MAPA                                                   */ 17300025
 /********************************************************************/ 17310025
0RCBC51M_SEND_MAPA: PROC;                                               17320025
                                                                        17330025
 HEADER.REQUEST_ID = 'A';                                               17340025
                                                                        17350025
0EXEC CICS SEND                                                         17360025
    MAP('RCBM51A')                                                      17370025
    MAPSET('RCBM51')                                                    17380025
    FREEKB                                                              17390025
    ERASE                                                               17400025
    RESP(RESPONSE)                                                      17410025
    RESP2(CODE_EXPLAIN);                                                17420025
                                                                        17430025
0EXEC CICS RETURN                                                       17440025
    TRANSID('RC51')                                                     17450025
    COMMAREA(COMMAREA)                                                  17460025
    LENGTH(CSTG(COMMAREA))                                              17470025
    RESP(RESPONSE)                                                      17480025
    RESP2(CODE_EXPLAIN);                                                17490025
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 17500025
   WHEN(DFHRESP(NORMAL));                                               17510025
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  17520025
   DO;                                                                  17530025
     COMMAREA_LENGTH = EIBCALEN;                                        17540025
     EXEC CICS RETURN                                                   17550025
        TRANSID('RC51')                                                 17560025
        COMMAREA(COMMAREA)                                              17570025
        LENGTH(COMMAREA_LENGTH);                                        17580025
   END;                                                                 17590025
   OTHERWISE                                                            17600025
   DO;                                                                  17610025
     RCBM51AO.MSG_LINEO = ERR_MESSAGE30;                                17620025
     CALL RCBC51M_SEND_MAPA_CSR;                                        17630025
   END;                                                                 17640025
 END;                                                                   17650025
                                                                        17660025
0END RCBC51M_SEND_MAPA;                                                 17670025
1/********************************************************************/ 17680025
 /*      SEND HELP MAP                                               */ 17690025
 /********************************************************************/ 17700025
0RCBC51M_HELP_MAP : PROC;                                               17710025
                                                                        17720025
 HEADER.NEXT = 'H1';                                                    17730025
 HELP_FLAG   = FALSE;                                                   17740025
                                                                        17750025
 IF HEADER.REQUEST_ID = '' THEN                                         17760025
 DO;                                                                    17770025
   CSR_POS     = 1;                                                     17780025
   CALL RCBC51M_RECEIVE_MAP;                                            17790025
   CALL RCBC51M_SAVE_MAP;                                               17800025
                                                                        17810025
   IF RCBM51I.ACTIONF = CSR_HELP                                        17820025
    | RCBM51I.ACTIONF = CSR_EOF THEN                                    17830025
   DO;                                                                  17840025
     CSR_POS   = 1;                                                     17850025
     HELP_FLAG = TRUE;                                                  17860025
     EXEC CICS SEND                                                     17870025
        MAP('ACT12A')                                                   17880025
        MAPSET('RCBHELP')                                               17890025
        FREEKB                                                          17900025
        ERASE;                                                          17910025
   END;                                                                 17920025
                                                                        17930025
   IF RCBM51I.CUSTOMER_NUMBER_PIF = CSR_HELP                            17940025
    | RCBM51I.CUSTOMER_NUMBER_PIF = CSR_EOF THEN                        17950025
   DO;                                                                  17960025
     CSR_POS   = 2;                                                     17970025
     HELP_FLAG = TRUE;                                                  17980025
     EXEC CICS SEND                                                     17990025
        MAP('CUSTNOP')                                                  18000025
        MAPSET('RCBHELP')                                               18010025
        FREEKB                                                          18020025
        ERASE;                                                          18030025
   END;                                                                 18040025
                                                                        18050025
   IF RCBM51I.CUSTOMER_NAMEF = CSR_HELP                                 18060025
    | RCBM51I.CUSTOMER_NAMEF = CSR_EOF THEN                             18070025
   DO;                                                                  18080025
     CSR_POS   = 3;                                                     18090025
     HELP_FLAG = TRUE;                                                  18100025
     EXEC CICS SEND                                                     18110025
        MAP('CUSTNAM')                                                  18120025
        MAPSET('RCBHELP')                                               18130025
        FREEKB                                                          18140025
        ERASE;                                                          18150025
   END;                                                                 18160025
                                                                        18170025
   IF RCBM51I.TYPE_OF_CUSTOMERF = CSR_HELP                              18180025
    | RCBM51I.TYPE_OF_CUSTOMERF = CSR_EOF THEN                          18190025
   DO;                                                                  18200025
     CSR_POS   = 4;                                                     18210025
     HELP_FLAG = TRUE;                                                  18220025
     EXEC CICS SEND                                                     18230025
        MAP('CUSTTYP')                                                  18240025
        MAPSET('RCBHELP')                                               18250025
        FREEKB                                                          18260025
        ERASE;                                                          18270025
   END;                                                                 18280025
                                                                        18290025
   IF RCBM51I.ADDRESS_LINE_1F = CSR_HELP                                18300025
    | RCBM51I.ADDRESS_LINE_1F = CSR_EOF THEN                            18310025
   DO;                                                                  18320025
     CSR_POS   = 5;                                                     18330025
     HELP_FLAG = TRUE;                                                  18340025
     EXEC CICS SEND                                                     18350025
        MAP('ADDLIN')                                                   18360025
        MAPSET('RCBHELP')                                               18370025
        FREEKB                                                          18380025
        ERASE;                                                          18390025
   END;                                                                 18400025
                                                                        18410025
   IF RCBM51I.ADDRESS_LINE_2F = CSR_HELP                                18420025
    | RCBM51I.ADDRESS_LINE_2F = CSR_EOF THEN                            18430025
   DO;                                                                  18440025
     CSR_POS   = 6;                                                     18450025
     HELP_FLAG = TRUE;                                                  18460025
     EXEC CICS SEND                                                     18470025
        MAP('ADDLIN')                                                   18480025
        MAPSET('RCBHELP')                                               18490025
        FREEKB                                                          18500025
        ERASE;                                                          18510025
   END;                                                                 18520025
                                                                        18530025
   IF RCBM51I.ADDRESS_LINE_3F = CSR_HELP                                18540025
    | RCBM51I.ADDRESS_LINE_3F = CSR_EOF THEN                            18550025
   DO;                                                                  18560025
     CSR_POS   = 7;                                                     18570025
     HELP_FLAG = TRUE;                                                  18580025
     EXEC CICS SEND                                                     18590025
        MAP('ADDLIN')                                                   18600025
        MAPSET('RCBHELP')                                               18610025
        FREEKB                                                          18620025
        ERASE;                                                          18630025
   END;                                                                 18640025
                                                                        18650025
   IF RCBM51I.ZIP_CODEF = CSR_HELP                                      18660025
    | RCBM51I.ZIP_CODEF = CSR_EOF THEN                                  18670025
   DO;                                                                  18680025
     CSR_POS   = 8;                                                     18690025
     HELP_FLAG = TRUE;                                                  18700025
     EXEC CICS SEND                                                     18710025
        MAP('ZIPCODE')                                                  18720025
        MAPSET('RCBHELP')                                               18730025
        FREEKB                                                          18740025
        ERASE;                                                          18750025
   END;                                                                 18760025
                                                                        18770025
   IF RCBM51I.EMBARGO_CODEF = CSR_HELP                                  18780025
    | RCBM51I.EMBARGO_CODEF = CSR_EOF THEN                              18790025
   DO;                                                                  18800025
     CSR_POS   = 9;                                                     18810025
     HELP_FLAG = TRUE;                                                  18820025
     EXEC CICS SEND                                                     18830025
        MAP('EMBCODE')                                                  18840025
        MAPSET('RCBHELP')                                               18850025
        FREEKB                                                          18860025
        ERASE;                                                          18870025
   END;                                                                 18880025
   IF RCBM51I.ESERVF = CSR_HELP                        /* SOC RB01289 */18890025
    | RCBM51I.ESERVF = CSR_EOF THEN                                     18900025
   DO;                                                                  18910025
     CSR_POS   = 10;                                                    18920025
     HELP_FLAG = TRUE;                                                  18930025
     EXEC CICS SEND                                                     18940025
        MAP('CUSDUM')                                                   18950025
        MAPSET('RCBHELP')                                               18960025
        FREEKB                                                          18970025
        ERASE;                                                          18980025
   END;                                                                 18990025
   IF RCBM51I.CISCOF = CSR_HELP                                         19000025
    | RCBM51I.CISCOF = CSR_EOF THEN                                     19010025
   DO;                                                                  19020025
     CSR_POS   = 11;                                                    19030025
     HELP_FLAG = TRUE;                                                  19040025
     EXEC CICS SEND                                                     19050025
        MAP('CUSDUM')                                                   19060025
        MAPSET('RCBHELP')                                               19070025
        FREEKB                                                          19080025
        ERASE;                                                          19090025
   END;                                                                 19100025
                                                                        19110025
   IF RCBM51I.PEWF = CSR_HELP                                           19120025
    | RCBM51I.PEWF = CSR_EOF THEN                                       19130025
   DO;                                                                  19140025
     CSR_POS   = 12;                                                    19150025
     HELP_FLAG = TRUE;                                                  19160025
     EXEC CICS SEND                                                     19170025
        MAP('CUSDUM')                                                   19180025
        MAPSET('RCBHELP')                                               19190025
        FREEKB                                                          19200025
        ERASE;                                                          19210025
   END;                                                                 19220025
                                                      /* EOC RB01289 */ 19230025
   IF HELP_FLAG = FALSE THEN                                            19240025
     EXEC CICS SEND                                                     19250025
        MAP('RCBH51')                                                   19260025
        MAPSET('RCBM51')                                                19270025
        FREEKB                                                          19280025
        ERASE;                                                          19290025
                                                                        19300025
 END;                                                                   19310025
                                                                        19320025
 ELSE DO;                                                               19330025
   CALL RCBC51M_SAVE_MAP;                                               19340025
   EXEC CICS SEND                                                       19350025
      MAP('RCBH51A')                                                    19360025
      MAPSET('RCBM51')                                                  19370025
      FREEKB                                                            19380025
      ERASE;                                                            19390025
 END;                                                                   19400025
                                                                        19410025
                                                                        19420025
0EXEC CICS RETURN                                                       19430025
    TRANSID('RC51')                                                     19440025
    COMMAREA(COMMAREA)                                                  19450025
    LENGTH(CSTG(COMMAREA))                                              19460025
    RESP(RESPONSE)                                                      19470025
    RESP2(CODE_EXPLAIN);                                                19480025
                                                                        19490025
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 19500025
   WHEN(DFHRESP(NORMAL));                                               19510025
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  19520025
   DO;                                                                  19530025
     COMMAREA_LENGTH = EIBCALEN;                                        19540025
     EXEC CICS RETURN                                                   19550025
        TRANSID('RC51')                                                 19560025
        COMMAREA(COMMAREA)                                              19570025
        LENGTH(COMMAREA_LENGTH);                                        19580025
   END;                                                                 19590025
   OTHERWISE                                                            19600025
   DO;                                                                  19610025
     RCBM51O.MSG_LINEO = ERR_MESSAGE30;                                 19620025
     CALL RCBC51M_SEND_MAP_CSR;                                         19630025
   END;                                                                 19640025
 END;                                                                   19650025
                                                                        19660025
0END RCBC51M_HELP_MAP;                                                  19670025
1/********************************************************************/ 19680025
 /*      SEND ERROR MAP - NO ERASE RCBM51                            */ 19690025
 /********************************************************************/ 19700025
 RCBC51M_SEND_MAP_CSR : PROC;                                           19710025
                                                                        19720025
 IF UPDATE_FLAG                                        /* SOC RB01289 */19730025
 &  RCBM51I.ACTIONI ¬='1' THEN                                          19740025
 DO;                                                                    19750025
   RCBM51O.ESERVA              = DFHBMPRF;                              19760025
   RCBM51O.CISCOA              = DFHBMPRF;                              19770025
   RCBM51O.PEWA                = DFHBMPRF;                              19780025
   RCBM51O.CUSTOMER_NUMBER_PIA = DFHBMPRF;                              19790025
 END;                                                  /* EOC RB01289 */19800025
                                                                        19810025
 HEADER.REQUEST_ID = '';                                                19820025
                                                                        19830025
 EXEC CICS SEND                                                         19840025
    MAP('RCBM51')                                                       19850025
    MAPSET('RCBM51')                                                    19860025
    CURSOR                                                              19870025
    ERASE                                                               19880025
    FREEKB;                                                             19890025
                                                                        19900025
 EXEC CICS RETURN                                                       19910025
    TRANSID('RC51')                                                     19920025
    COMMAREA(COMMAREA)                                                  19930025
    LENGTH(CSTG(COMMAREA));                                             19940025
                                                                        19950025
 END RCBC51M_SEND_MAP_CSR;                                              19960025
1/********************************************************************/ 19970025
 /*      SEND ERROR MAP - NO ERASE RCBM51A                           */ 19980025
 /********************************************************************/ 19990025
 RCBC51M_SEND_MAPA_CSR: PROC;                                           20000025
                                                                        20010025
 HEADER.REQUEST_ID = 'A';                                               20020025
                                                                        20030025
 EXEC CICS SEND                                                         20040025
    MAP('RCBM51A')                                                      20050025
    MAPSET('RCBM51')                                                    20060025
    CURSOR                                                              20070025
    ERASE                                                               20080025
    FREEKB;                                                             20090025
                                                                        20100025
 EXEC CICS RETURN                                                       20110025
    TRANSID('RC51')                                                     20120025
    COMMAREA(COMMAREA)                                                  20130025
    LENGTH(CSTG(COMMAREA));                                             20140025
                                                                        20150025
 END RCBC51M_SEND_MAPA_CSR;                                             20160025
 /********************************************************************/ 20170025
 /*      GET DUMMY CUSTOMER NUMBER                SOC RB01289        */ 20180025
 /********************************************************************/ 20190025
 RCBC51M_GET_DUMMY_NUMBER: PROC;                                        20200025
                                                                        20210025
  WRK_CUST_NO        = 0;                                               20220025
 /*GENEREATING DUMMY CUSTOMER NUMBER FOR eSERVICE PAC*/                 20230025
 IF WRK_CUST_PREFIX  = "EP" THEN                                        20240025
 DO;                                                                    20250025
  SELECT (SQLCA.SQLCODE);                                               20260025
   WHEN (0)                                                             20270025
    DO;                                                                 20280025
     IF WRK_INDNULL  = 0 THEN                                           20290025
     DO;                                                                20300025
      WRK_CUST_NO    = SUBSTR(RCB011S.CUSTOMER_NUMBER,3,6);             20310025
      IF WRK_CUST_NO = 999999 THEN                                      20320025
      DO;                                                               20330025
       WRK_CUST_PREFIX    = "ES"                                        20340025
       CALL RCBC51M_GET_MAX_NUMBER;                                     20350025
       IF WRK_CUST_PREFIX = "ES" THEN                                   20360025
       DO;                                                              20370025
         SELECT (SQLCA.SQLCODE);                                        20380025
           WHEN (0)                                                     20390025
            DO;                                                         20400025
             IF WRK_INDNULL   = 0 THEN                                  20410025
             DO;                                                        20420025
               WRK_CUST_NO    = SUBSTR(RCB011S.CUSTOMER_NUMBER,3,6);    20430025
               IF WRK_CUST_NO = 999999 THEN                             20440025
               DO;                                                      20450025
                 WRK_CUST_PREFIX = "EP"                                 20460025
                 WRK_CUST_NO     = 0;                                   20470025
               END;                                                     20480025
               ELSE                                                     20490025
                WRK_CUST_NO = WRK_CUST_NO + 1;                          20500025
             END;                                                       20510025
            END;                                                        20520025
           WHEN (+100)                                                  20530025
            DO;                                                         20540025
             WRK_CUST_CNT = 0;                                          20550025
            END;                                                        20560025
           OTHERWISE                                                    20570025
            DO;                                                         20580025
             RCBM51O.MSG_LINEO = 'Error occurred while accessing table';20590025
             CALL  RCBC51M_SEND_MAP_CSR;                                20600025
            END;                                                        20610025
        END;                                                            20620025
       END;                                                             20630025
      END;                                                              20640025
      ELSE                                                              20650025
       WRK_CUST_NO  = WRK_CUST_NO + 1;                                  20660025
     END;                                                               20670025
    END;                                                                20680025
  WHEN (+100)                                                           20690025
     DO;                                                                20700025
       WRK_CUST_CNT = 0;                                                20710025
     END;                                                               20720025
  OTHERWISE                                                             20730025
     DO;                                                                20740025
       RCBM51O.MSG_LINEO = 'Error occurred while accessing table';      20750025
       CALL  RCBC51M_SEND_MAP_CSR;                                      20760025
     END;                                                               20770025
    END;                                                                20780025
  END;                                                                  20790025
                                                                        20800025
                                                                        20810025
 /*GENEREATING DUMMY CUSTOMER NUMBER FOR CISCO*/                        20820025
 IF WRK_CUST_PREFIX    = "CI" THEN                                      20830025
 DO;                                                                    20840025
  SELECT (SQLCA.SQLCODE);                                               20850025
   WHEN (0)                                                             20860025
    DO;                                                                 20870025
     IF WRK_INDNULL    = 0 THEN                                         20880025
     DO;                                                                20890025
      WRK_CUST_NO      = SUBSTR(RCB011S.CUSTOMER_NUMBER,3,6);           20900025
      IF WRK_CUST_NO   = 999999 THEN                                    20910025
      DO;                                                               20920025
       WRK_CUST_PREFIX = "CC"                                           20930025
       CALL RCBC51M_GET_MAX_NUMBER;                                     20940025
       IF WRK_CUST_PREFIX   = "CC" THEN                                 20950025
       DO;                                                              20960025
         SELECT (SQLCA.SQLCODE);                                        20970025
           WHEN (0)                                                     20980025
            DO;                                                         20990025
             IF WRK_INDNULL = 0 THEN                                    21000025
             DO;                                                        21010025
               WRK_CUST_NO  = SUBSTR(RCB011S.CUSTOMER_NUMBER,3,6);      21020025
               IF WRK_CUST_NO = 999999 THEN                             21030025
               DO;                                                      21040025
                 WRK_CUST_PREFIX  = "CI"                                21050025
                 WRK_CUST_NO      = 0;                                  21060025
               END;                                                     21070025
               ELSE                                                     21080025
                WRK_CUST_NO = WRK_CUST_NO + 1;                          21090025
             END;                                                       21100025
            END;                                                        21110025
           WHEN (+100)                                                  21120025
            DO;                                                         21130025
             WRK_CUST_CNT = 0;                                          21140025
            END;                                                        21150025
           OTHERWISE                                                    21160025
            DO;                                                         21170025
             RCBM51O.MSG_LINEO = 'Error occurred while accessing table';21180025
             CALL  RCBC51M_SEND_MAP_CSR;                                21190025
            END;                                                        21200025
        END;                                                            21210025
       END;                                                             21220025
      END;                                                              21230025
      ELSE                                                              21240025
       WRK_CUST_NO = WRK_CUST_NO + 1;                                   21250025
     END;                                                               21260025
    END;                                                                21270025
  WHEN (+100)                                                           21280025
     DO;                                                                21290025
       WRK_CUST_CNT = 0;                                                21300025
     END;                                                               21310025
  OTHERWISE                                                             21320025
     DO;                                                                21330025
       RCBM51O.MSG_LINEO = 'Error occurred while accessing table';      21340025
       CALL  RCBC51M_SEND_MAP_CSR;                                      21350025
     END;                                                               21360025
    END;                                                                21370025
  END;                                                                  21380025
                                                                        21390025
                                                                        21400025
 /*GENEREATING DUMMY CUSTOMER NUMBER FOR PEW  */                        21410025
 IF WRK_CUST_PREFIX  = "PW" THEN                                        21420025
 DO;                                                                    21430025
  SELECT (SQLCA.SQLCODE);                                               21440025
   WHEN (0)                                                             21450025
    DO;                                                                 21460025
     IF WRK_INDNULL  = 0 THEN                                           21470025
     DO;                                                                21480025
      WRK_CUST_NO    = SUBSTR(RCB011S.CUSTOMER_NUMBER,3,6);             21490025
      IF WRK_CUST_NO = 999999 THEN                                      21500025
      DO;                                                               21510025
       WRK_CUST_PREFIX    = "PE"                                        21520025
       CALL RCBC51M_GET_MAX_NUMBER;                                     21530025
       IF WRK_CUST_PREFIX = "PE" THEN                                   21540025
       DO;                                                              21550025
         SELECT (SQLCA.SQLCODE);                                        21560025
           WHEN (0)                                                     21570025
            DO;                                                         21580025
             IF WRK_INDNULL   = 0 THEN                                  21590025
             DO;                                                        21600025
               WRK_CUST_NO    = SUBSTR(RCB011S.CUSTOMER_NUMBER,3,6);    21610025
               IF WRK_CUST_NO = 999999 THEN                             21620025
               DO;                                                      21630025
                 WRK_CUST_PREFIX  = "PW"                                21640025
                 WRK_CUST_NO      = 0;                                  21650025
               END;                                                     21660025
               ELSE                                                     21670025
                WRK_CUST_NO = WRK_CUST_NO + 1;                          21680025
             END;                                                       21690025
            END;                                                        21700025
           WHEN (+100)                                                  21710025
            DO;                                                         21720025
             WRK_CUST_CNT = 0;                                          21730025
            END;                                                        21740025
           OTHERWISE                                                    21750025
            DO;                                                         21760025
             RCBM51O.MSG_LINEO = 'Error occurred while accessing table';21770025
             CALL  RCBC51M_SEND_MAP_CSR;                                21780025
            END;                                                        21790025
        END;                                                            21800025
       END;                                                             21810025
      END;                                                              21820025
      ELSE                                                              21830025
       WRK_CUST_NO = WRK_CUST_NO + 1;                                   21840025
     END;                                                               21850025
    END;                                                                21860025
  WHEN (+100)                                                           21870025
     DO;                                                                21880025
       WRK_CUST_CNT = 0;                                                21890025
     END;                                                               21900025
  OTHERWISE                                                             21910025
     DO;                                                                21920025
       RCBM51O.MSG_LINEO = 'Error occurred while accessing table';      21930025
       CALL  RCBC51M_SEND_MAP_CSR;                                      21940025
     END;                                                               21950025
    END;                                                                21960025
  END;                                                                  21970025
                                                                        21980025
                                                                        21990025
 END RCBC51M_GET_DUMMY_NUMBER;                                          22000025
 /********************************************************************/ 22010025
 /*      GET MAX CUSTOMER NUMBER                                     */ 22020025
 /********************************************************************/ 22030025
 RCBC51M_GET_MAX_NUMBER: PROC;                                          22040025
                                                                        22050025
 IF WRK_CUST_PREFIX     = 'EP' THEN                                     22060025
 EXEC SQL                                                               22070025
  SELECT MAX(CUSTOMER_NUMBER)                                           22080025
    INTO :RCB011S.CUSTOMER_NUMBER :WRK_INDNULL                          22090025
    FROM RCBV0011_PI_CUST                                               22100025
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           22110025
     AND CUSTOMER_NUMBER LIKE  'EP%';                                   22120025
                                                                        22130025
 IF WRK_CUST_PREFIX     = 'ES' THEN                                     22140025
 EXEC SQL                                                               22150025
  SELECT MAX(CUSTOMER_NUMBER)                                           22160025
    INTO :RCB011S.CUSTOMER_NUMBER :WRK_INDNULL                          22170025
    FROM RCBV0011_PI_CUST                                               22180025
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           22190025
     AND CUSTOMER_NUMBER LIKE  'ES%';                                   22200025
                                                                        22210025
 IF WRK_CUST_PREFIX     = 'CI' THEN                                     22220025
 EXEC SQL                                                               22230025
  SELECT MAX(CUSTOMER_NUMBER)                                           22240025
    INTO :RCB011S.CUSTOMER_NUMBER :WRK_INDNULL                          22250025
    FROM RCBV0011_PI_CUST                                               22260025
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           22270025
     AND CUSTOMER_NUMBER LIKE  'CI%';                                   22280025
                                                                        22290025
 IF WRK_CUST_PREFIX     = 'CC' THEN                                     22300025
 EXEC SQL                                                               22310025
  SELECT MAX(CUSTOMER_NUMBER)                                           22320025
    INTO :RCB011S.CUSTOMER_NUMBER :WRK_INDNULL                          22330025
    FROM RCBV0011_PI_CUST                                               22340025
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           22350025
     AND CUSTOMER_NUMBER LIKE  'CC%';                                   22360025
                                                                        22370025
 IF WRK_CUST_PREFIX     = 'PW' THEN                                     22380025
 EXEC SQL                                                               22390025
  SELECT MAX(CUSTOMER_NUMBER)                                           22400025
    INTO :RCB011S.CUSTOMER_NUMBER :WRK_INDNULL                          22410025
    FROM RCBV0011_PI_CUST                                               22420025
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           22430025
     AND CUSTOMER_NUMBER LIKE  'PW%';                                   22440025
                                                                        22450025
 IF WRK_CUST_PREFIX     = 'PE' THEN                                     22460025
 EXEC SQL                                                               22470025
  SELECT MAX(CUSTOMER_NUMBER)                                           22480025
    INTO :RCB011S.CUSTOMER_NUMBER :WRK_INDNULL                          22490025
    FROM RCBV0011_PI_CUST                                               22500025
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           22510025
     AND CUSTOMER_NUMBER LIKE  'PE%';                                   22520025
                                                                        22530025
 END RCBC51M_GET_MAX_NUMBER;                                            22540025
                                                    /* EOC RB01289   */ 22550025
                                                                        22560025
1/*******************************************************************/  22570025
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  22580025
 /*******************************************************************/  22590025
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  22600025
  $DAIMOD (RCBC51M);                     /* MODULE TO BE COMPILED   */  22610025
0/*******************************************************************/  22620025
 /* END OF ABR BLOCK '                                              */  22630025
 /*******************************************************************/  22640025
0 END RCBC51M;                                                          22650025