 /* RCBCS3M - DETAIL MODULE  / CEDS QUERY BY SERIAL TRANSACTION      */ 00010000
 /*                                                                  */ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /*                                                                  */ 00060000
 /********************************************************************/ 00070000
 /* PROGRAM          : RCBCS3M                                       */ 00080000
 /*                                                                  */ 00090000
 /* LANGUAGE         : PLICSQL                                       */ 00100000
 /*                                                                  */ 00110000
 /* TYPE             : LINKABLE MODULE                               */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION      : RCMS REQUEST "DE" LIST ITEMS.                 */ 00140000
 /*                  : THIS PROGRAM IS CALLED BY THE ROOT MODULE     */ 00150000
 /*                    RCBCS1M.                                      */ 00160000
 /*                                                                  */ 00170000
 /* ALL WARNINGS AND ERRORS WILL BE STORED IN AN EXTRA PARTITION     */ 00180000
 /* TRANSIENT DATASET.                                               */ 00190000
 /*                                                                  */ 00200000
 /* INPUT            : COMMPTR - COMMUNICATION AREA POINTER          */ 00210000
 /*                                                                  */ 00220000
 /* OUTPUT           : COMMPTR - COMMUNICATION AREA POINTER          */ 00230000
 /*                                                                  */ 00240000
 /*                                                                  */ 00250000
 /* EXTERNAL MODULES : RCBISRN - RETRIEVE RCBT0470_SERV_COND         */ 00260000
 /*                                       RCBT0475_CTRY_COND         */ 00270000
 /*                  : RCBCQEM - ERROR LOGGING MODULE                */ 00280000
 /*                  : RCBDRAU - USER EXIT FOR HW INFORMATION        */ 00290000
 /*                  : RCBDR4U - USER EXIT FOR CUSTOMER INFORMATION  */ 00300000
 /*                                                                  */ 00310000
 /* MESSAGES         :                                               */ 00320000
 /*                                                                  */ 00330000
 /* DEPENDENCIES     : NONE                                          */ 00340000
 /*                                                                  */ 00350000
 /* MAINTENANCE LOG  :                                               */ 00360000
 /* ---------------                                                  */ 00370000
 /*                                                                  */ 00380000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00390000
 /* --------------------------------------------------------------   */ 00400000
 /* 2009-10-23  | RB01301      | CEDS ALIGNMENT TO CHIS810 - BAU     */ 00410000
 /*             |              | SERVICE EXTENSIONS                  */ 00420000
 /* 2009-10-23  | RC01302      | PCEDSP-0021  QBS RREDESIGN          */ 00430000
 /* 2010-03-12  | CEDS00000508 | TOM FOR HV INTERNAL CONTRACT        */ 00440000
 /*             |              | HANDLED                             */ 00450000
 /* 2010-03-18  | CEDS00000510 | CHANGED CHAR LENGTHS OF ORIGIN AND  */ 00460000
 /*             |              | SEQUENCE NUMBER                     */ 00470000
 /* 2010-03-29  | CEDS00000516 | SQL CODE +100 captured correctly    */ 00480000
 /*             |              | in RCB151 SELECT SQL                */ 00490000
 /* 2010-04-16  | CEDS00000518 | HANDLING NULL INDICATOR IN T350 SQL */ 00500000
 /* 2010-05-14  | CEDS00000521 | TOM WRONGLY POPULATED FOR OUT OF    */ 00510000
 /*             |              | CTRY CONTRACT MACHINES              */ 00520000
 /* 2010-05-18  | CEDS00000522 | CORRECTION OF DEFECTS FOUND BY      */ 00530000
 /*             |              | CEDS LAB                            */ 00540000
 /* 2010-05-27  | CEDS00000525 | PARM_INT_AREA FIELDS ARE PASSED     */ 00550000
 /*             |              | TO USER EXIT                        */ 00560000
 /* 2010-06-15  | CEDS00000527 | PASSED FEW MORE FIELDS TO/FROM      */ 00570000
 /*             |              | USER EXIT RCBDRAU                   */ 00580000
 /* 2010-06-15  | CEDS00000528 | CHSIISC NOT POPULATED FOR PI DETAILS*/ 00590000
 /* 2010-07-06  | CEDS00000530 | HANDLED SERVICE EXTENSION LOGIC     */ 00600000
 /*             |              | PROPERLY                            */ 00610000
 /* 2010-09-10  | CEDS00000538 | SEPERATE DATA_ORIGIN2 CODED FOR     */ 00620000
 /*             |              | USER-EXIT RCBDR4U                   */ 00630000
 /* 2011-02-11  | CEDS00000551 | FOR HARDBUNDLE PERIOD-2 OVERLAP WITH*/ 00640000
 /*             |              | CONTRACT BASE WARR SLC IS NOT FILLED*/ 00650000
 /* 2011-03-07  | CEDS00000557 | CORRECTING LOGICAL COND TO SET      */ 00660000
 /*             |              | SWITCH_PI_WARR FLAG                 */ 00670000
 /* 2011-05-06  | RC01313      | PCEDSP-0064, TO GET THE CORRECT     */ 00680000
 /*             |              | CUSTOMER_NUMBER AND OU_CODE         */ 00690000
 /* 2012-02-01  | RB01320      | CEDS 3.3 A17 LONG SERIAL REQ        */ 00700000
 /* 2012-09-27  | CEDS00000596 | CHIS ME/SE NOT REPORTED FOR PI      */ 00710000
 /*             |              | WARR MACHINE                        */ 00720000
 /* 2012-12-05  | CEDS00000616 | TO GET THE CORRECT                  */ 00730000
 /*             |              | COVERAGE HOURS FROM T470 AND T475   */ 00740000
 /* 2013-01-01  | RC01326      | PCR P10-0421:HANDLING SERVICE LEVEL */ 00750000
 /*             |              | EXTENSIONS FOR BAU & PI SERVICE PAC */ 00760000
 /* 2013-03-11  | CEDS00000627 | CORRECTED OUT OF COUNTRY LOGIC.     */ 00770000
 /* 2013-04-18  | CEDS00000630 | WRONG TPMNT FOR CASES OUT OF        */ 00780000
 /*             |              | POST WARR/CONTRACT                  */ 00790000
 /* 2013-04-26  | CEDS00000632 | INCLUDED LOGIC FOR SEARCHING THE    */ 00800000
 /*             |              | INTERNAL MACHINES IF MACHINE IS     */ 00810000
 /*             |              | OUT OF COUNTRY                      */ 00820000
 /* 2013-04-29  | RB01327      | SWG REQUIREMENT -                   */ 00830000
 /*             |              | CEDS 3.3 A18 RELEASE                */ 00840000
 /* 2013-07-08  | RC01330      | SET DEFAULT SLC VALUE WHEN NO SLC IS*/ 00850000
 /*             |              | FOUND FOR OUT OF COUNTRY.           */ 00860000
 /* 2013-07-19  | CEDS00000642 | REALIGMENT OF COMMAREA FOR OLD AND  */ 00870000
 /*             |              | NEW VERSION.                        */ 00880000
 /* 2013-09-17  | CEDS00000650 | TO RETRIEVE CORRECT ADDRESS_NUMBER  */ 00890000
 /*             |              | FROM TABLE RCBV0150_CUST_ADDR       */ 00900000
 /*             |              |                                     */ 00910000
 /* 2014-12-18  | CEDS00000718 | T10-2111:TQBS IS NOT DISPLAYING     */ 00920000
 /*             |              | MESE FROM CHIS FOR PI MACHINE       */ 00930000
 /* 2015-01-05  | RC01349      | PCEDSP-0522 LONG SERIAL FIELD       */ 00940000
 /*             |              | PROCESSING FOR IBM & NON IBM        */ 00950000
 /*             |              | MACHINES.                           */ 00960000
 /*  2015-02-02 | CEDS00000727 | T10-2117 & T10-2118 -  QBS NOT      */ 00970000
 /*             |              | RETRIEVING PROPER RESULTS WHEN SHORT*/ 00980000
 /*             |              | AND LONG SERIAL ARE SAME. & QBS     */ 00990000
 /*             |              | PROVIDES BLANK ORIGIN AND SEQ NO    */ 01000000
 /* 2015-02-19  | CEDS00000730 | T10-2127 : CHANGES DONE TO SQL QUERY*/ 01010000
 /*             |              | FOR SERVICEPAC SERVICE EXTENSIONS,  */ 01020000
 /*             |              | TO ENSURE THAT ONLY ONE RECORD IS   */ 01030000
 /*             |              | RETRIEVED.                          */ 01040000
 /* 2015-03-04  | RC01353      | P10-0612: ESTABLISH A SPECIAL       */ 01050000
 /*             |              | SOURCE INDICATOR FOR SERVICE        */ 01060000
 /*             |              | INTEGRATOR CONTRACTS.               */ 01070000
 /* 2015-03-10  | CEDS00000735 | RUN DATE IS PASSED TO THE USER EXIT */ 01080000
 /*             |              | RCBDRAU - TREC 2131                 */ 01090000
 /* 2015-04-30  | CEDS00000739 | TEMEA-T081566 : CHANGES DONE TO     */ 01100000
 /*             |              | POPULATE CITY FOR PI ENTITLEMENT    */ 01110000
 /*             |              |                                     */ 01120000
 /* 2015-06-05  | RC01359      | P10-0559 REMOVED PADDED ZEROS       */ 01130000
 /*             |              | FROM LONG SERIAL FIELD FOR IBM      */ 01140000
 /*             |              | MACHINES.                           */ 01150000
 /*             |              |                                     */ 01160000
 /* 2015-07-10  | CEDS00000758 | T10-2154 : CODE CHANGES DONE TO     */ 01170000
 /*             |              | PREVENT STORAGE VIOLATION ERROR.    */ 01180000
 /* 2015-08-04  | RC01362      | PCR 0472 - TO REMOVE ASSIGNING OF   */ 01190000
 /*             |              | TOM TO G WHEN RCB103 PARAMETER IS   */ 01200000
 /*             |              | SET TO Y FOR LENOVO MACHINES        */ 01210000
 /* 2015-09-18  | CEDS00000773 | CHANGES DONE TO DISPLAY THE CORRECT */ 01211002
 /*             |              | LSN FOR IBM MACHINES.               */ 01212000
 /* 2015-10-26  | RC01367      | PCEDSP-0588 : CHANGE IN SEARCH      */ 01213019
 /*             |              | SEQUENCE FOR DE                     */ 01220019
 /* 2017-09-15  | S1316962     | ADDED MISSING 'END' STATEMENT IN    */ 01221020
 /*             |              | RCBCS3M_MOVE_PI_SERV_EXTN PROC      */ 01222020
 /********************************************************************/ 01230000
1RCBCS3M: PROC(COMMPTR)                                                 01240000
          OPTIONS (MAIN)                                                01250000
          REORDER;                                                      01260000
0/********************************************************************/ 01270000
 /*  EXTERNAL ENTRIES                                                */ 01280000
 /********************************************************************/ 01290000
 DCL RCBISRN   ENTRY EXTERNAL;     /* RETRIEVE T470/475              */ 01300000
 DCL RCBCQEM   ENTRY EXTERNAL;     /* ERROR LOGGING ROUTINE          */ 01310000
 DCL RCBDR4U   ENTRY EXTERNAL;     /* USER EXIT - CUSTOMER DETAILS   */ 01320000
 DCL RCB004N   ENTRY EXTERNAL;     /* DATE CALC ROUTINE              */ 01330000
 DCL RCBDRAU   ENTRY EXTERNAL;     /* USER EXIT - HW                 */ 01340000
0/********************************************************************/ 01350000
 /*  COMMUNICATION AREA                                              */ 01360000
 /********************************************************************/ 01370000
 DCL    COMMPTR   PTR;             /*ADDRESS OF COMMUNICATION AREA   */ 01380000
 /********************************************************************/ 01390000
0/********************************************************************/ 01400000
                                                 /* SOC CEDS00000642 */ 01410000
0DCL 1 COMMAREA,                                                        01420000
  %INCLUDE EDQBSHS;,                                                    01430000
  %INCLUDE EDQBSDS;;                                                    01440000
0DCL 1 COMMAREA_OLD       BASED (COMMPTR),                              01450000
  %INCLUDE EDQBSHS;,                                                    01460000
  %INCLUDE EDQBSDS;;                                                    01470000
0DCL 1 COMMAREA_NEW       BASED (COMMPTR),                              01480000
  %INCLUDE EDQBSHS1;,                                                   01490000
  %INCLUDE EDQBSDS1;;                                                   01500000
 /*                                                                     01510000
0DCL 1 COMMAREA           BASED (COMMPTR),                              01520000
  %INCLUDE EDQBSHS;,                                                    01530000
    2 FILLER CHAR(30),    */                          /*   RB01320   */ 01540000
 /*%INCLUDE EDQBSDS;;                                                   01550000
0DCL 1 COMMAREA1          BASED (COMMPTR), */        /* SOC RB01320 */  01560000
 /*%INCLUDE EDQBSHS1;,                                                  01570000
  %INCLUDE EDQBSDS1;;                                                   01580000
 DCL 1 NEW_VERSION_DUMMY,                                               01590000
       %INCLUDE EDQBSHS1;,                                              01600000
       %INCLUDE EDQBSDS1;; */                         /* EOC RB01320 */ 01610000
                                                 /* EOC CEDS00000642 */ 01620000
0/********************************************************************/ 01630000
 /*  RETURN CODES                                                    */ 01640000
 /********************************************************************/ 01650000
0DCL RESPONSE             FIXED BIN(31) INIT ('0'B);/* CICS RESPONSE */ 01660000
0/********************************************************************/ 01670000
 /*  RCBISRN PARAMETER DECLARATIONS                                  */ 01680000
 /********************************************************************/ 01690000
 DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 01700000
       %INCLUDE (RCBZ02S);;                                             01710000
 DCL 1 SQLCA_R            BASED(ADDR(RETURN_AREA_BB.RETURN_SQL))        01720000
                          LIKE SQLCA;                                   01730000
0/********************************************************************/ 01740000
 /*  USER EXIT RCBDRAU AND RCBDR4U PARAMETER DECLARATIONS            */ 01750000
 /********************************************************************/ 01760000
 DCL SWITCH_USER_EXIT1         BIT (1)      INIT ('0'B);                01770000
 DCL SWITCH_USER_EXIT2         BIT (1)      INIT ('0'B);                01780000
 DCL DATA_ORIGIN               CHAR(1)      INIT ('');                  01790000
 DCL DATA_ORIGIN2              CHAR(1)      INIT ('');/* CEDS00000538 */01800000
 DCL 1 USER_FILE_RCBDRF1,                                               01810000
       2 DATA,                                                          01820000
      %INCLUDE (RCBDRFS);;                                              01830000
 DCL 1 USER_FILE_PI_CU,                                                 01840000
       2 DATA,                                                          01850000
      %INCLUDE (RCBDRFS);;                                              01860000
 DCL 1 USER_EXTRA_INFO,                                                 01870000
      %INCLUDE (RCBDRFSU);;                                             01880000
 DCL 1 USER_EXTRA_INFO_BAU,                                             01890000
      %INCLUDE (RCBDRFSU);;                                             01900000
 DCL 1 USER_EXTRA_INFO_PI,                                              01910000
      %INCLUDE (RCBDRFSU);;                                             01920000
 DCL 1 USER_FILE_RCBDRI1,                                               01930000
       2 DATA,                                                          01940000
      %INCLUDE (RCBDRIS);;                                              01950000
 DCL 1 USER_FILE_PI,                                                    01960000
       2 DATA,                                                          01970000
      %INCLUDE (RCBDRIS);;                                              01980000
 DCL 1 USER_FILE_BAU,                                                   01990000
       2 DATA,                                                          02000000
      %INCLUDE (RCBDRIS);;                                              02010000
 DCL PTR_INT_AREA        PTR;          /* PTR TO INTERFACE STRUCTURE */ 02020000
 DCL 1 PARM_INT_AREA,                                                   02030000
       %INCLUDE (RCBZ01S);;                                             02040000
 PTR_INT_AREA = ADDR(PARM_INT_AREA);                                    02050000
0/********************************************************************/ 02060000
 /*  RCBCQEM PARAMETER DECLARATIONS                                  */ 02070000
 /********************************************************************/ 02080000
0DCL RCBCQES_PTR     PTR;              /* PTR TO INTERFACE STRUCTURE */ 02090000
 DCL 1 RCBCQES,                                                         02100000
      %INCLUDE RCBCQES;;                                                02110000
 DCL 1 DATE_AREA,                                                       02120000
     %INCLUDE (RCBZ03S);;                                               02130000
 DCL 1 RCBCQES_SQLCA                                                    02140000
      LIKE SQLCA;                                                       02150000
0RCBCQES_PTR       = ADDR(RCBCQES);                                     02160000
0RCBCQES.SQLCA_PTR = ADDR(RCBCQES_SQLCA);                               02170000
0/********************************************************************/ 02180000
 /*            S Q L    D E C L A R A T I O N S                      */ 02190000
 /********************************************************************/ 02200000
0EXEC SQL INCLUDE SQLCA;                                                02210000
0/********************************************************************/ 02220000
 /* DB2 TABLE STRUCTURES                                             */ 02230000
 /********************************************************************/ 02240000
 DCL 1 TB_RCBV010,                                                      02250000
      %INCLUDE (RCB010S);;                                              02260000
 DCL 1 TB_RCBV010_I,                                                    02270000
      %INCLUDE (RCB010SI);;                                             02280000
 DCL 1 TB_RCBV011,                                                      02290000
      %INCLUDE (RCB011S);;                                              02300000
 DCL 1 TB_RCBV011_I,                                                    02310000
      %INCLUDE (RCB011SI);;                                             02320000
 DCL 1 TB_RCBV051,                                                      02330000
      %INCLUDE (RCB051S);;                                              02340000
 DCL 1 TB_RCBV051_I,                                                    02350000
      %INCLUDE (RCB051SI);;                                             02360000
 DCL 1 TB_RCBV125,                                    /* SOC RB01320 */ 02370000
      %INCLUDE (RCB125S);;                            /* EOC RB01320 */ 02380000
 DCL 1 TB_RCBV150,                                                      02390000
      %INCLUDE (RCB150S);;                                              02400000
 DCL 1 TB_RCBV150_I,                                                    02410000
      %INCLUDE (RCB150SI);;                                             02420000
 DCL 1 TB_RCBV211,                                                      02430000
      %INCLUDE (RCB211S);;                                              02440000
 DCL 1 TB_RCBV211_I,                                                    02450000
      %INCLUDE (RCB211SI);;                                             02460000
 DCL 1 TB_RCBV241,                                                      02470000
      %INCLUDE (RCB241S);;                                              02480000
 DCL 1 TB_RCBV241_I,                                                    02490000
      %INCLUDE (RCB241SI);;                                             02500000
 DCL 1 TB_RCBV280,                                                      02510000
      %INCLUDE (RCB280S);;                                              02520000
 DCL 1 TB_RCBV280_I,                                                    02530000
      %INCLUDE (RCB280SI);;                                             02540000
 DCL 1 TB_RCBV340,                                                      02550000
      %INCLUDE (RCB340S);;                                              02560000
 DCL 1 TB_RCBV340_I,                                                    02570000
      %INCLUDE (RCB340SI);;                                             02580000
 DCL 1 TB_RCBV350,                                                      02590000
      %INCLUDE (RCB350S);;                                              02600000
 DCL 1 TB_RCBV350_I,                                                    02610000
      %INCLUDE (RCB350SI);;                                             02620000
 DCL 1 TB_RCBV400,                                                      02630000
      %INCLUDE (RCB400S);;                                              02640000
 DCL 1 TB_RCBV400_I,                                                    02650000
      %INCLUDE (RCB400SI);;                                             02660000
 DCL 1 TB_RCBV470,                                                      02670000
      %INCLUDE (RCB470S);;                                              02680000
 DCL 1 TB_RCBV470_I,                                                    02690000
      %INCLUDE (RCB470SI);;                                             02700000
 DCL 1 TB_RCBV500,                                                      02710000
      %INCLUDE (RCB500S);;                                              02720000
 DCL 1 TB_RCBV500_I,                                                    02730000
      %INCLUDE (RCB500SI);;                                             02740000
 DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  02750000
      %INCLUDE (RCBP05S);;                                              02760000
 DCL 1 TB_RCBP70S            BASED (ADDR(TB_RCBV500)),                  02770000
      %INCLUDE (RCBP70S);;                                              02780000
 DCL 1 TB_RCBP63S            BASED (ADDR(TB_RCBV500)),                  02790000
      %INCLUDE (RCBP63S);;                                              02800000
 DCL 1 TB_RCBP64S            BASED (ADDR(TB_RCBV500)),                  02810000
      %INCLUDE (RCBP64S);;                                              02820000
 DCL 1 TB_RCBP151S            BASED (ADDR(TB_RCBV500)),                 02830000
      %INCLUDE (RCBP151S);;                                             02840000
 DCL 1 TB_RCBV680,                                                      02850000
      %INCLUDE (RCB680S);;                                              02860000
 DCL 1 TB_RCBV680_I,                                                    02870000
      %INCLUDE (RCB680SI);;                                             02880000
 DCL 1 TB_RCBV650,                                                      02890000
      %INCLUDE (RCB650S);;                                              02900000
 DCL 1 TB_RCBV650_I,                                                    02910000
      %INCLUDE (RCB650SI);;                                             02920000
 DCL 1 TB_RCBV030,                                                      02930000
      %INCLUDE (RCB030S);;                                              02940000
 DCL 1 TB_RCBV030_I,                                                    02950000
      %INCLUDE (RCB030SI);;                                             02960000
 DCL 1 TB_RCBV110,                                                      02970000
      %INCLUDE (RCB110S);;                                              02980000
 DCL 1 TB_RCBV110_I,                                                    02990000
      %INCLUDE (RCB110SI);;                                             03000000
 DCL 1 TB_RCBV170,                                                      03010000
      %INCLUDE (RCB170S);;                                              03020000
 DCL 1 TB_RCBV170_I,                                                    03030000
      %INCLUDE (RCB170SI);;                                             03040000
 DCL 1 TB_RCBV190,                                                      03050000
      %INCLUDE (RCB190S);;                                              03060000
 DCL 1 TB_RCBV190_I,                                                    03070000
      %INCLUDE (RCB190SI);;                                             03080000
 DCL 1 TB_RCBV220,                                                      03090000
      %INCLUDE (RCB220S);;                                              03100000
 DCL 1 TB_RCBV220_I,                                                    03110000
      %INCLUDE (RCB220SI);;                                             03120000
 DCL 1 TB_RCBV240,                                                      03130000
      %INCLUDE (RCB240S);;                                              03140000
 DCL 1 TB_RCBV240_I,                                                    03150000
      %INCLUDE (RCB240SI);;                                             03160000
 DCL 1 TB_RCBV260,                                                      03170000
      %INCLUDE (RCB260S);;                                              03180000
 DCL 1 TB_RCBV260_I,                                                    03190000
      %INCLUDE (RCB260SI);;                                             03200000
 DCL 1 TB_RCBV300,                                                      03210000
      %INCLUDE (RCB300S);;                                              03220000
 DCL 1 TB_RCBV300_I,                                                    03230000
      %INCLUDE (RCB300SI);;                                             03240000
 DCL 1 TB_RCBV380,                                                      03250000
      %INCLUDE (RCB380S);;                                              03260000
 DCL 1 TB_RCBV380_I,                                                    03270000
      %INCLUDE (RCB380SI);;                                             03280000
 DCL 1 TB_RCBV630,                                     /* SOC RC01326 */03290000
      %INCLUDE (RCB630S);;                                              03300000
 DCL 1 TB_RCBV630_I,                                                    03310000
      %INCLUDE (RCB630SI);;                                             03320000
 DCL 1 TB_RCBV635,                                                      03330000
      %INCLUDE (RCB635S);;                                              03340000
 DCL 1 TB_RCBV635_I,                                                    03350000
      %INCLUDE (RCB635SI);;                            /* EOC RC01326 */03360000
 DCL 1 TB_RCBV645,                                                      03370000
      %INCLUDE (RCB645S);;                                              03380000
 DCL 1 TB_RCBV645_I,                                                    03390000
      %INCLUDE (RCB645SI);;                                             03400000
 DCL 1 TB_RCBV690,                                                      03410000
      %INCLUDE (RCB690S);;                                              03420000
 DCL 1 TB_RCBV690_I,                                                    03430000
      %INCLUDE (RCB690SI);;                                             03440000
 DCL 1 TB_RCBV691,                                                      03450000
      %INCLUDE (RCB691S);;                                              03460000
 DCL 1 TB_RCBV691_I,                                                    03470000
      %INCLUDE (RCB691SI);;                                             03480000
-/********************************************************************/ 03490000
 /*        WORK FIELDS                                               */ 03500000
 /********************************************************************/ 03510000
 DCL REQTYPE     CHAR(04)      INIT('');    /* REQUEST MACH. TYPE    */ 03520000
 DCL REQORIG     CHAR(02)      INIT('');    /* REQUEST ORIGIN        */ 03530000
 DCL REQSEQN     CHAR(07)      INIT('');    /* REQUEST SERIAL NBR.   */ 03540000
 DCL REQLSEQ     CHAR(30)      INIT('');    /* LONG SER. NBR. RB01320*/ 03550000
 DCL CHECKSEQ    CHAR(30)      INIT('');    /* LONG SER. NBR. RC01359*/ 03560000
 DCL REFCTRY     CHAR(03)      INIT('');    /* REQUEST COUNTRY CODE  */ 03570000
 DCL ACMCTRY     CHAR(03)      INIT('');    /* ACM CALL COUNTRY CODE */ 03580000
 DCL DATE10      CHAR(10)      INIT('');    /*YYYY-MM-DD DATE FORMAT */ 03590000
 DCL WRK_LONG_SERIAL           CHAR(30)      INIT('');     /* RB01320*/ 03600000
 DCL WRK_QTYD                  PIC'99999'    INIT(0);                   03610000
 DCL WRK_QTYH                  PIC'999V99'   BASED(ADDR(WRK_QTYD));     03620000
 DCL WRK_SQLCODE               FIXED BIN(31) INIT(0);                   03630000
 DCL WRK_TABLE                 CHAR(18)      INIT('');                  03640000
 DCL WRK_SET_HRS               CHAR(1);                                 03650000
 DCL WRK_PARMKEY               CHAR(06)      INIT('');                  03660000
                                                      /* SOC RC01326 */ 03670000
 /*DCL CNT_BAU_SE              FIXED BIN(31) INIT(0);                   03680000
 DCL CNT_PI_SE                 FIXED BIN(31) INIT(0);                   03690000
 DCL I                         FIXED BIN(31) INIT(0);*/                 03700000
                                                      /* EOC RC01326 */ 03710000
 DCL WRK_INDNULL               FIXED BIN(15) INIT(0);                   03720000
 DCL WRK_LENOVO_TI             CHAR(01)      INIT('');                  03730000
 DCL WRK_ADDRESS_RES           CHAR(01)      INIT('');                  03740000
 DCL 1 WRK_TPMNT_VAL,                                                   03750000
       %INCLUDE (RCBZ99S);;                                             03760000
 DCL WRK051_WARRANTY_EXP_DATE  CHAR(10)     INIT('');                   03770000
 DCL WRK051_PRCL_STRT_DATE     CHAR(10)     INIT('');                   03780000
 DCL WRK_1PERD_END_DATE        CHAR(10)     INIT('');                   03790000
 DCL WRK_BAUWARR_EFFDATE       CHAR(08)     INIT('');                   03800000
 DCL WRK_BAUWARR_ENDDATE       CHAR(08)     INIT('');                   03810000
 DCL WRK_PIWARR_EFFDATE        CHAR(08)     INIT('');                   03820000
 DCL WRK_PIWARR_ENDDATE        CHAR(08)     INIT('');                   03830000
 DCL WRK_CUSTOMER_NUMBER       CHAR(08)     INIT('');                   03840000
 DCL WRK_CUSTNO_ADDR           CHAR(08)     INIT('');                   03850000
 DCL WRK_MODEL_NUMBER          CHAR(03)     INIT('');                   03860000
 DCL WRK_SEQUENCE_NUMBER       CHAR(28)     INIT('');                   03870000
 DCL WRK_T190_CUST_NUM         CHAR(08)     INIT('');                   03880000
 DCL WRK_T010_CUST_NUM         CHAR(08)     INIT('');                   03890000
 DCL WRK_T011_CUST_NUM         CHAR(08)     INIT('');                   03900000
 DCL WRK_T010_CUST_NAME        CHAR(30)     INIT('');                   03910000
 DCL WRK_T010_TYPE_OF_CUST     CHAR(02)     INIT('');                   03920000
 DCL WRK_FWTOW                 CHAR(01)     INIT('');                   03930000
 DCL WRK_HBTOM                 CHAR(01)     INIT('');                   03940000
 DCL WRK_TYPE_OF_MAINT         CHAR(01)     INIT('');                   03950000
 DCL WRK_SRC_IND               CHAR(01)     INIT('');                   03960000
 DCL WRK_ADDRESS_NUMBER        CHAR(05)     INIT('');                   03970000
 DCL WRK_ADDRESS_NUMBER_BAU    CHAR(05)     INIT('');                   03980000
 DCL WRK_ADDRESS_NUMBER_PI     CHAR(05)     INIT('');                   03990000
 DCL WRK_AAS_ADD               CHAR(05)     INIT('');                   04000000
 DCL WRK_SLC1                  CHAR(03)     INIT('');                   04010000
 DCL WRK_SLC2                  CHAR(03)     INIT('');                   04020000
 DCL WRK_SLCC                  CHAR(03)     INIT('');                   04030000
                                                /* SOC CEDS00000525 */  04040000
 DCL WRK_MOD_NAME                CHAR (08)  INIT ('RCBCS3M');           04050000
 DCL WRK_PRG_NAME                CHAR (08)  INIT ('RCBCS3P');           04060000
                                                /* EOC CEDS00000525 */  04070000
 DCL WRK_COUNT                 FIXED BIN(31) INIT(0);     /* RB01320 */ 04080000
 DCL WRK_ORIGIN                CHAR (02)     INIT('');    /* RB01320 */ 04090000
 DCL WRK_SEQ_NO                CHAR (07)     INIT('');    /* RB01320 */ 04100000
                                                                        04110000
                                                      /* SOC RB01320 */ 04120000
 DCL WRK_PARAMETER_KEY        CHAR(6)  INIT('');                        04130000
                                                      /* EOC RB01320 */ 04140000
 DCL SNAME                     CHAR(03)     INIT('');                   04150000
 DCL 1 EDQBSDS_BAU,                                                     04160000
 %INCLUDE (EDQBSDS);;                                                   04170000
 DCL 1 EDQBSDS_PI,                                                      04180000
 %INCLUDE (EDQBSDS);;                                                   04190000
 DCL WRK_ADDRESS_LINES(9)      CHAR(30);                                04200000
                                                       /* SOC RC01326 */04210000
 DCL BAU_SERV_EXTENSION_CTR(5) CHAR(3)       INIT('');                  04220000
 DCL PI_SERV_EXTENSION_CTR(5)  CHAR(3)       INIT('');                  04230000
 DCL TEMP_SERV_EXTENSION(5)    CHAR(3)       INIT('');                  04240000
 DCL WRK_TYPE_CONTRACT         CHAR(10)      INIT('');                  04250000
 DCL WRK_TOC_V30_IND           FIXED BIN(15) INIT(0);                   04260000
 DCL WRK_SERV_EXTN_BAU         CHAR(19)      INIT('');                  04270000
 DCL WRK_SE                    FIXED BIN(31) INIT(1);                   04280000
 DCL WRK_SP                    FIXED BIN(31) INIT(1);                   04290000
 DCL WRK_SERV_EXTN_PI          CHAR(19)      INIT('');                  04300000
 DCL J                         FIXED BIN(31) INIT(1);                   04310000
 DCL I                         FIXED BIN(31) INIT(1);                   04320000
                                                       /* EOC RC01326 */04330000
0/********************************************************************/ 04340000
 /* SWITCHES                                                         */ 04350000
 /********************************************************************/ 04360000
 DCL TRUE                      BIT(01)      INIT('1'B);                 04370000
 DCL FALSE                     BIT(01)      INIT('0'B);                 04380000
 DCL OUT_OF_COUNTRY            BIT(01)      INIT('0'B);                 04390000
 DCL SWITCH_BAU_WARR           BIT(01)      INIT('0'B);                 04400000
 DCL SWITCH_OOC_HB             BIT(01)      INIT('0'B);                 04410000
 DCL SWITCH_PI_WARR            BIT(01)      INIT('0'B);                 04420000
 DCL SWITCH_LEASE_RENTAL       BIT(01)      INIT('0'B);                 04430000
 DCL SWITCH_INTERNAL           BIT(01)      INIT('0'B);                 04440000
 DCL SWITCH_BAU_CTR            BIT(01)      INIT('0'B);                 04450000
 DCL SWITCH_PI_CTR             BIT(01)      INIT('0'B);                 04460000
 DCL SWITCH_SUPPL_CTR          BIT(01)      INIT('0'B);                 04470000
 DCL SWITCH_BAU_PERCALL        BIT(01)      INIT('0'B);                 04480000
 DCL SWITCH_PI_PERCALL         BIT(01)      INIT('0'B);                 04490000
 DCL SWITCH_HV_CTR             BIT(01)      INIT('0'B);                 04500000
 DCL SWITCH_INTERNAL_CTR       BIT(01)      INIT('0'B);                 04510000
 DCL SWITCH_EOF_OFFSNAME       BIT(01)      INIT('0'B);                 04520000
 DCL SWITCH_EOC_ADDR           BIT(01)      INIT('0'B);                 04530000
 DCL SWITCH_PI_OCC             BIT(01)      INIT('0'B);                 04540000
 DCL T010_CUSTOMER_FLAG        BIT(01)      INIT('0'B);                 04550000
 DCL T011_CUSTOMER_FLAG        BIT(01)      INIT('0'B);                 04560000
 DCL T190_CUSTOMER_FLAG        BIT(01)      INIT('0'B);                 04570000
 DCL T170_OU_CODE_FLAG         BIT(01)      INIT('0'B);/*RC01313*/      04580000
 DCL SWITCH_READ_T690          BIT(01)      INIT('0'B);                 04590000
 DCL SWITCH_READ_T400          BIT(01)      INIT('0'B);                 04600000
 DCL SWITCH_BAU_MTS_CTR        BIT(01)      INIT('0'B);/*CEDS00000551*/ 04610000
 DCL SWITCH_PI_MTS_CTR         BIT(01)      INIT('0'B);/*CEDS00000551*/ 04620000
 DCL SWITCH_0211_S3            BIT(01)      INIT('0'B);/*RB01320     */ 04630000
 DCL SWITCH_3317_S3            BIT(01)      INIT('0'B);/*RB01320     */ 04640000
 DCL SW_BAU_CTR_SE             BIT(01)      INIT('0'B);/* RC01326    */ 04650000
 DCL SW_PI_CTR_SE              BIT(01)      INIT('0'B);/* RC01326    */ 04660000
0/********************************************************************/ 04670000
 /*         D E F I N E    C U R S O R S                             */ 04680000
 /********************************************************************/ 04690000
 EXEC SQL                                                               04700000
   DECLARE ADDR_CURSOR CURSOR FOR                                       04710000
     SELECT  T280.LINE_NUMBER    ,                                      04720000
             T280.TEXT                                                  04730000
       FROM  RCBV0280_ADDR_LINE  T280                                   04740000
      WHERE  T280.COUNTRY_NUMBER  = :TB_RCBV280.COUNTRY_NUMBER          04750000
        AND  T280.CUSTOMER_NUMBER = :TB_RCBV280.CUSTOMER_NUMBER         04760000
        AND  T280.ADDRESS_NUMBER  = :TB_RCBV280.ADDRESS_NUMBER          04770000
      ORDER BY 1                                                        04780000
      FOR FETCH ONLY;                                                   04790000
                                                                        04800000
 EXEC SQL                                                               04810000
   DECLARE OFFSNAME_CURSOR CURSOR FOR                                   04820000
   SELECT T691.OFFERING_SNAME                                           04830000
    FROM       RCBV0120_MESE_HW T120,                                   04840000
               RCBV0691_TRANS_OFF T691                                  04850000
    WHERE T120.COUNTRY_NUMBER   = :REFCTRY                              04860000
    AND   T120.PRODUCT_TYPE     = :REQTYPE                              04870000
 /* AND   T120.ORIGIN           = :REQORIG               SOC RB01320 */ 04880000
 /* AND   T120.SEQUENCE_NUMBER  = :REQSEQN                           */ 04890000
 /* AND ((T120.ORIGIN          = :REQORIG           SOC CEDS00000727 */ 04900000
 /*        AND  T120.SEQUENCE_NUMBER = :REQSEQN)                        04910000
          OR (T120.ORIGIN||T120.SEQUENCE_NUMBER = :REQLSEQ)             04920000
          OR (T120.ORIGIN||T120.SEQUENCE_NUMBER = :WRK_LONG_SERIAL))    04930000
                                                 */   /* EOC RB01320 */ 04940000
    AND  T120.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)            04950000
    AND  T120.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)              04960000
                                                 /* EOC CEDS00000727 */ 04970000
    AND   (:DATE10 BETWEEN T120.SERVICE_START_DATE AND                  04980000
          T120.SERVICE_END_DATE)                                        04990000
    AND   T691.COUNTRY_NUMBER    = T120.COUNTRY_NUMBER                  05000000
    AND   T691.OFFERING_ID       = T120.OFFERING_NICK_NAME              05010000
    AND   T691.TYPE_OF_OFFERING  = 'MESE'                               05020000
    ORDER BY T691.RANK_NUMBER DESC                                      05030000
    FETCH FIRST 6 ROWS ONLY;                                            05040000
0/********************************************************************/ 05050000
 /*                 BUILT IN FUNCTIONS                               */ 05060000
 /********************************************************************/ 05070000
0DCL (LENGTH,                                                           05080000
      CSTG,                                                             05090000
      STRING,                                                           05100000
      SUBSTR,                                                           05110000
      NULL,                                                             05120000
      ROUND,                                                            05130000
      VERIFY,                                                           05140000
      ADDR)                                                             05150000
              BUILTIN;                                                  05160000
1/********************************************************************/ 05170000
 /*                 S T A R T   P R O C E S S I N G                  */ 05180000
 /********************************************************************/ 05190000
0CALL RCBCS3M_INITIALISATION;                                           05200000
0CALL RCBCS3M_MAIN_PROCESSING;                                          05210000
0CALL RCBCS3M_FINALISATION;                                             05220000
1/********************************************************************/ 05230000
 /*      I N I T I A L I S A T I O N   P R O C E S S I N G           */ 05240000
 /********************************************************************/ 05250000
0RCBCS3M_INITIALISATION : PROC;                                         05260000
                                                      /* SOC RB01320 */ 05270000
                                        /* CHECK VERSION 0211 OR 3317*/ 05280000
 SELECT (EIBCALEN);                                                     05290000
   WHEN (150, 750)                                                      05300000
     DO;                                                                05310000
       SWITCH_0211_S3 = '1'B;                                           05320000
       COMMAREA = '';                            /* SOC CEDS00000642 */ 05330000
       COMMAREA = COMMAREA_OLD;                                         05340000
       COMMAREA_OLD = '';                        /* EOC CEDS00000642 */ 05350000
     END;                                                               05360000
   WHEN (180, 780)                                                      05370000
     DO;                                                                05380000
       SWITCH_3317_S3 = '1'B;                                           05390000
       COMMAREA = '';                            /* SOC CEDS00000642 */ 05400000
       COMMAREA.EDQBSHS    = COMMAREA_NEW.EDQBSHS1, BY NAME;            05410000
       COMMAREA.EDQBSDS    = COMMAREA_NEW.EDQBSDS1, BY NAME;            05420000
       EDQBSDS_BAU.EDQBSDS = COMMAREA_NEW.EDQBSDS1, BY NAME;            05430000
       EDQBSDS_PI.EDQBSDS  = COMMAREA_NEW.EDQBSDS1, BY NAME;            05440000
       REQLSEQ             = COMMAREA_NEW.EDQBSHS1.REQ.SEDQGSN;         05450000
       COMMAREA_NEW = '';                                               05460000
     /*NEW_VERSION_DUMMY = COMMAREA1;                                   05470000
       COMMAREA1 = ' ';                                                 05480000
       COMMAREA.EDQBSHS    = NEW_VERSION_DUMMY.EDQBSHS1, BY NAME;       05490000
       EDQBSDS_BAU.EDQBSDS = NEW_VERSION_DUMMY.EDQBSDS1, BY NAME;       05500000
       EDQBSDS_PI.EDQBSDS  = NEW_VERSION_DUMMY.EDQBSDS1, BY NAME;       05510000
       REQLSEQ             = NEW_VERSION_DUMMY.EDQBSHS1.REQ.SEDQGSN;    05520000
       EDQBSHS.FILLER      = SUBSTR(REQLSEQ,1,8);*/                     05530000
                                                 /* EOC CEDS00000642 */ 05540000
     END;                                                               05550000
   OTHERWISE;                                                           05560000
 END;                                                 /* EOC RB01320 */ 05570000
                                                                        05580000
 SELECT (EIBCALEN);                      /* CHECK LENGTH OF COMMAREA */ 05590000
    WHEN(0)                              /* COMMAREA EMPTY           */ 05600000
    DO;                                                                 05610000
     /*EDQBSHS.CRMORET = '4';                       SOC CEDS00000642 */ 05620000
       COMMAREA.EDQBSHS.CRMORET = '4';           /* EOC CEDS00000642 */ 05630000
       RCBCQES.MESSAGE_NUMBER = 'C201';                                 05640000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 05650000
    END;                                                                05660000
                                                      /* SOC RB01320 */ 05670000
  /*WHEN(150)                            /* HEADER RECORD            */ 05680000
    WHEN(150, 180)                                    /* EOC RB01320 */ 05690000
    DO;                                                                 05700000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'DE' THEN                  SOC RB01320 */ 05710000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'DE'                  SOC CEDS00000642 */ 05720000
 /*     & EDQBSHS.REQ.TYPE ¬= 'DL' THEN  */           /* EOC RB01320 */ 05730000
 /*    DO;                               */                             05740000
       IF COMMAREA.EDQBSHS.REQ.TYPE ¬= 'DE'                             05750000
        & COMMAREA.EDQBSHS.REQ.TYPE ¬= 'DL' THEN                        05760000
       DO;                                                              05770000
 /*       EDQBSHS.CRMORET = '4';         */                             05780000
          COMMAREA.EDQBSHS.CRMORET = '4';        /* EOC CEDS00000642 */ 05790000
          RCBCQES.MESSAGE_NUMBER = 'C203';                              05800000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              05810000
       END;                                                             05820000
    END;                                                                05830000
                                                      /* SOC RB01320 */ 05840000
  /*WHEN(750)                                HEADER & DETAIL ITEM    */ 05850000
    WHEN(750, 780)                                    /* EOC RB01320 */ 05860000
    DO;                                                                 05870000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'DE' THEN                  SOC RB01320 */ 05880000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'DE'                  SOC CEDS00000642 */ 05890000
       IF COMMAREA.EDQBSHS.REQ.TYPE ¬= 'DE'      /* EOC CEDS00000642 */ 05900000
                                                      /* SOC RC01326 */ 05910000
 /*     | EDQBSHS.REQ.TYPE ¬= 'DL' THEN                              */ 05920000
                                                 /* SOC CEDS00000642 */ 05930000
 /*     & EDQBSHS.REQ.TYPE ¬= 'DL' THEN          */   /* EOC RC01326 */ 05940000
        & COMMAREA.EDQBSHS.REQ.TYPE ¬= 'DL' THEN /* EOC CEDS00000642 */ 05950000
       DO;                                                              05960000
 /*       EDQBSHS.CRMORET = '4';                 /* SOC CEDS00000642 */ 05970000
          COMMAREA.EDQBSHS.CRMORET = '4';        /* EOC CEDS00000642 */ 05980000
          RCBCQES.MESSAGE_NUMBER = 'C203';                              05990000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              06000000
       END;                                                             06010000
    END;                                                                06020000
                                                      /* SOC RB01320 */ 06030000
    WHEN(6060, 8790)                   /* HEADER,LIST & DETAIL ITEMS */ 06040000
    DO;                                                                 06050000
 /*                                                 SOC CEDS00000642 */ 06060000
 /*    IF EDQBSHS.REQ.TYPE ¬= 'DL' THEN                                 06070000
       DO;                                                              06080000
          EDQBSHS.CRMORET = '4';       */                               06090000
       IF COMMAREA.EDQBSHS.REQ.TYPE ¬= 'DL' THEN                        06100000
       DO;                                                              06110000
          COMMAREA.EDQBSHS.CRMORET = '4';        /* EOC CEDS00000642 */ 06120000
          RCBCQES.MESSAGE_NUMBER = 'C203'; /* NEW MESSAGE NUMBER */     06130000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              06140000
       END;                                                             06150000
    END;                                             /* EOC RB01320 */  06160000
    OTHERWISE                            /* INVALID COMMAREA LENGTH  */ 06170000
    DO;                                                                 06180000
    /* EDQBSHS.CRMORET = '4';                    /* SOC CEDS00000642 */ 06190000
       COMMAREA.EDQBSHS.CRMORET = '4';           /* EOC CEDS00000642 */ 06200000
       RCBCQES.MESSAGE_NUMBER = 'C202';                                 06210000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 06220000
    END;                                                                06230000
 END;                                                                   06240000
                                                                        06250000
 TB_RCBV010 = '';                                                       06260000
 TB_RCBV011 = '';                                                       06270000
 TB_RCBV030 = '';                                                       06280000
 TB_RCBV051 = '';                                                       06290000
 TB_RCBV110 = '';                                                       06300000
 TB_RCBV125 = '';                                     /*   RB01320   */ 06310000
 TB_RCBV150 = '';                                                       06320000
 TB_RCBV170 = '';                                                       06330000
 TB_RCBV190 = '';                                                       06340000
 TB_RCBV220 = '';                                                       06350000
 TB_RCBV240 = '';                                                       06360000
 TB_RCBV241 = '';                                                       06370000
 TB_RCBV260 = '';                                                       06380000
 TB_RCBV280 = '';                                                       06390000
 TB_RCBV300 = '';                                                       06400000
 TB_RCBV340 = '';                                                       06410000
 TB_RCBV350 = '';                                                       06420000
 TB_RCBV380 = '';                                                       06430000
 TB_RCBV400 = '';                                                       06440000
 TB_RCBV470 = '';                                                       06450000
 TB_RCBV500 = '';                                                       06460000
 TB_RCBV635 = '';                                      /* SOC RC01326 */06470000
 TB_RCBV630 = '';                                      /* EOC RC01326 */06480000
 TB_RCBV650 = '';                                                       06490000
 TB_RCBV680 = '';                                                       06500000
 TB_RCBV691 = '';                                                       06510000
                                                                        06520000
 TB_RCBV241.HVP_QUANTITY = 0;                                           06530000
                                                                        06540000
 PARM_INT_AREA.MSG_AREA = '';                                           06550000
 PARM_INT_AREA.ERR_AREA = '';                                           06560000
 /*                                                  SOC CEDS00000642 */06570000
 /*REFCTRY = EDQBSHS.REQ.REQKEY.IOPUCTY;                                06580000
 ACMCTRY = EDQBSHS.REQ.TARGCTY;                                         06590000
 REQTYPE = EDQBSHS.REQ.REQKEY.CSLMTYP;                                  06600000
 REQORIG = EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;                          06610000
 REQSEQN = EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;                          06620000
 DATE10  = $DTSEP(EDQBSHS.REQ.DFLTREF,'-'); */                          06630000
 REFCTRY = COMMAREA.EDQBSHS.REQ.REQKEY.IOPUCTY;                         06640000
 ACMCTRY = COMMAREA.EDQBSHS.REQ.TARGCTY;                                06650000
 REQTYPE = COMMAREA.EDQBSHS.REQ.REQKEY.CSLMTYP;                         06660000
 REQORIG = COMMAREA.EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;                 06670000
 REQSEQN = COMMAREA.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;                 06680000
 DATE10  = $DTSEP(COMMAREA.EDQBSHS.REQ.DFLTREF,'-');                    06690000
                                                 /* EOC CEDS00000642 */ 06700000
 PARM_INT_AREA.RUN_DATE       = DATE10;              /* CEDS00000735 */ 06710000
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';           /* SOC CEDS00000525 */ 06720000
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                           06730000
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           06740000
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      06750000
 PARM_INT_AREA.COUNTRY_NUMBER = REFCTRY;                                06760000
 PARM_INT_AREA.TXN_CODE       = '';                                     06770000
 PARM_INT_AREA.VERSION        = '';                                     06780000
 PARM_INT_AREA.PTR_PCB_IO     = NULL;                                   06790000
 PARM_INT_AREA.PTR_PCB_ALT    = NULL;            /* EOC CEDS00000525 */ 06800000
                                                 /* SOC CEDS00000642 */ 06810000
 /*EDQBSHS.REQ.CRMORET = '';                                            06820000
 EDQBSHS.REQ.CRMOSUB = 0;                                               06830000
 EDQBSHS.REQ.NTBLNME = '';                                              06840000
                                                                        06850000
 COMMAREA.EDQBSDS = '';                                                 06860000
 COMMAREA1.EDQBSDS1 = '';     */                        /*  RB01320  */ 06870000
                                                                        06880000
 COMMAREA.EDQBSHS.REQ.CRMORET = '';                                     06890000
 COMMAREA.EDQBSHS.REQ.CRMOSUB = 0;                                      06900000
 COMMAREA.EDQBSHS.REQ.NTBLNME = '';                                     06910000
                                                                        06920000
 COMMAREA.EDQBSDS = '';                                                 06930000
 IF SWITCH_0211_S3 = '1'B THEN                       /*  CEDS00000758 */06940000
 COMMAREA_OLD.EDQBSDS = '';                                             06950000
 IF SWITCH_3317_S3 = '1'B THEN                       /*  CEDS00000758 */06960000
 COMMAREA_NEW.EDQBSDS1 = '';                                            06970000
 EDQBSDS_BAU = '';                                                      06980000
 EDQBSDS_PI = '';                                                       06990000
 USER_FILE_RCBDRI1 = '';                                                07000000
 USER_FILE_PI  = '';                                                    07010000
 USER_FILE_BAU = '';                                                    07020000
 USER_FILE_RCBDRF1  = '';                                               07030000
 USER_EXTRA_INFO  = '';                                                 07040000
 USER_EXTRA_INFO_PI  = '';                                              07050000
 USER_EXTRA_INFO_BAU  = '';                                             07060000
                                                                        07070000
 TB_RCBP64S   = '';                                                     07080000
 TB_RCBP63S   = '';                                                     07090000
                                                                        07100000
 EXEC SQL                                                               07110000
  SELECT T500.PARAMETER_VALUE                                           07120000
  INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                        07130000
  FROM   RCBV0500_PARM  T500                                            07140000
  WHERE  T500.PARAMETER_NUMBER = 'RCB064'                               07150000
  AND    T500.PARAMETER_KEY    = :REFCTRY                               07160000
  WITH UR;                                                              07170000
                                                                        07180000
 SELECT(SQLCA.SQLCODE);                                                 07190000
 WHEN(0)                                                                07200000
  DO;                                                                   07210000
   WRK_FWTOW =   TB_RCBP64S.F_WARRANTY_MACHINE;                         07220000
   WRK_HBTOM =   TB_RCBP64S.HARDBUNDLE;                                 07230000
  END;                                                                  07240000
 WHEN(100)                                                              07250000
  DO;                                                                   07260000
   EXEC SQL                                                             07270000
    SELECT T500.PARAMETER_VALUE                                         07280000
    INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                      07290000
    FROM   RCBV0500_PARM  T500                                          07300000
    WHERE  T500.PARAMETER_NUMBER = 'RCB063'                             07310000
   WITH UR;                                                             07320000
   SELECT(SQLCA.SQLCODE);                                               07330000
   WHEN(0)                                                              07340000
    DO;                                                                 07350000
     WRK_FWTOW =   TB_RCBP63S.F_WARRANTY_MACHINE;                       07360000
     WRK_HBTOM =   TB_RCBP63S.HARDBUNDLE;                               07370000
    END;                                                                07380000
   WHEN(100);                                                           07390000
   OTHERWISE                                                            07400000
    DO;                                                                 07410000
     RCBCQES.MESSAGE_NUMBER = 'C216';                                   07420000
     WRK_SQLCODE = SQLCA.SQLCODE;                                       07430000
     WRK_TABLE = 'RCBV0500_PARM';                                       07440000
     CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                   07450000
    END;                                                                07460000
   END;                                                                 07470000
  END;                                                                  07480000
 OTHERWISE                                                              07490000
  DO;                                                                   07500000
   RCBCQES.MESSAGE_NUMBER = 'C217';                                     07510000
   WRK_SQLCODE = SQLCA.SQLCODE;                                         07520000
   WRK_TABLE = 'RCBV0500_PARM';                                         07530000
   CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE,WRK_TABLE);                      07540000
  END;                                                                  07550000
 END;                                                                   07560000
                                                                        07570000
 TB_RCBV500 = '';                                                       07580000
 WRK_PARMKEY = REFCTRY || 'A01';                                        07590000
                                                                        07600000
 EXEC SQL                                                               07610000
      SELECT T500.PARAMETER_VALUE                                       07620000
       INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                   07630000
      FROM   RCBV0500_PARM  T500                                        07640000
      WHERE  T500.PARAMETER_NUMBER = 'RCB005'                           07650000
        AND  T500.PARAMETER_KEY    = :WRK_PARMKEY                       07660000
      WITH UR;                                                          07670000
                                                                        07680000
 SELECT(SQLCA.SQLCODE);                                                 07690000
   WHEN(0) WRK_ADDRESS_RES = TB_RCBP05S.ADDRESS_RES;                    07700000
   WHEN(100);                                                           07710000
   OTHERWISE                                                            07720000
     DO;                                                                07730000
       RCBCQES.MESSAGE_NUMBER = 'C218';                                 07740000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     07750000
       WRK_TABLE = 'RCBV0500_PARM';                                     07760000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 07770000
     END;                                                               07780000
 END;                                                                   07790000
                                                                        07800000
  TB_RCBP151S             = '';                                         07810000
  TB_RCBV500              = '';                                         07820000
  TB_RCBV500_I            = '';                                         07830000
                                                                        07840000
  EXEC SQL                                                              07850000
    SELECT T500.PARAMETER_VALUE                                         07860000
    INTO  :TB_RCBV500.PARAMETER_VALUE :WRK_INDNULL                      07870000
    FROM RCBV0500_PARM T500                                             07880000
    WHERE T500.PARAMETER_NUMBER = 'RCB151'                              07890000
    AND T500.PARAMETER_KEY = : ACMCTRY                                  07900000
    WITH UR;                                                            07910000
   SELECT(SQLCA.SQLCODE);                                               07920000
    WHEN(0);                                                            07930000
 /* WHEN(4) DO;                                       /* CEDS00000516 */07940000
    WHEN(100) DO;                                     /* CEDS00000516 */07950000
        TB_RCBV500              = '';                                   07960000
        TB_RCBV500_I            = '';                                   07970000
        EXEC SQL                                                        07980000
          SELECT T500.PARAMETER_VALUE                                   07990000
          INTO  :TB_RCBV500.PARAMETER_VALUE :WRK_INDNULL                08000000
          FROM RCBV0500_PARM T500                                       08010000
          WHERE T500.PARAMETER_NUMBER = 'RCB151'                        08020000
          AND T500.PARAMETER_KEY = '***'                                08030000
          WITH UR;                                                      08040000
       SELECT(SQLCA.SQLCODE);                                           08050000
        WHEN(0);                                                        08060000
    /*  WHEN(4);                                      /* CEDS00000516 */08070000
        WHEN(100);                                    /* CEDS00000516 */08080000
        OTHERWISE                                                       08090000
        DO;                                                             08100000
          RCBCQES.MESSAGE_NUMBER = 'C258';                              08110000
          WRK_SQLCODE = SQLCA.SQLCODE;                                  08120000
          WRK_TABLE = 'RCBV0500_PARM';                                  08130000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              08140000
        END;                                                            08150000
       END;                                                             08160000
      END;                                                              08170000
      OTHERWISE                                                         08180000
      DO;                                                               08190000
        RCBCQES.MESSAGE_NUMBER = 'C258';                                08200000
        WRK_SQLCODE = SQLCA.SQLCODE;                                    08210000
        WRK_TABLE = 'RCBV0500_PARM';                                    08220000
        CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                08230000
    END;                                                                08240000
  END;                                                                  08250000
                                                                        08260000
0END RCBCS3M_INITIALISATION;                                            08270000
1/********************************************************************/ 08280000
 /*      M A I N   P R O C E S S I N G                               */ 08290000
 /********************************************************************/ 08300000
0RCBCS3M_MAIN_PROCESSING : PROC;                                        08310000
                                                                        08320000
 /*CHECKSEQ   = REQLSEQ;               *//* CEDS00000773 *//* RC01359*/ 08330003
 IF REQLSEQ ¬= ' ' THEN                             /* SOC RB01320 */   08340000
 /*   CALL RCBCS3M_CHK_LONG_EXIST;                  SOC CEDS00000727 */ 08350000
 /*                                                                     08360000
 IF WRK_COUNT > 0 THEN                              EOC CEDS00000727 */ 08370000
   DO;                                                                  08380000
      WRK_LONG_SERIAL = REQLSEQ;                     /* CEDS00000727 */ 08390000
      CALL RCBCS3M_FETCH_T125_DMMY;                                     08400000
   /* WRK_LONG_SERIAL = REQLSEQ;                   *//* CEDS00000727 */ 08410000
   END;                                                                 08420000
 /* ELSE                                            *//* SOC RC01367 */ 08430018
   IF REQLSEQ = ' ' | CHECKSEQ = ' ' THEN             /* EOC RC01367 */ 08431018
    DO;                                                                 08440017
      WRK_ORIGIN = REQORIG;                      /* SOC CEDS00000727 */ 08450000
      WRK_SEQ_NO = REQSEQN;                      /* EOC CEDS00000727 */ 08460017
      CALL RCBCS3M_FETCH_T125_REAL;                                     08470017
  /*  WRK_ORIGIN = REQORIG;                    *//* SOC CEDS00000727 */ 08480000
  /*  WRK_SEQ_NO = REQSEQN;                    *//* EOC CEDS00000727 */ 08490000
  /*END;                                                *//* RC01367 */ 08500018
                                                    /* EOC RB01320 */   08510017
 CALL RCBCS3M_READ_BAU_WARR;                                            08520016
                                                                        08530000
 CALL RCBCS3M_READ_BAU_CTR;                                             08540000
                                                                        08550000
 CALL RCBCS3M_READ_PI_WARR;                                             08560000
                                                                        08570000
 CALL RCBCS3M_READ_PI_CTR;                                              08580009
      END;                                                /* RC01367 */ 08581018
                                                                        08590000
 IF ¬SWITCH_BAU_CTR & ¬SWITCH_PI_CTR & ¬OUT_OF_COUNTRY THEN             08600000
    CALL RCBCS3M_READ_HV_CTR;                                           08610000
                                                                        08620000
 IF TB_RCBV051.WARRANTY_LIABILITY = 'LEN'                               08630000
 THEN DO;                                                               08640000
    IF OUT_OF_COUNTRY THEN DO;                                          08650000
      TB_RCBV241.AUTHORISATION_CODE = '';                               08660000
      TB_RCBV241.EFFECTIVE_DATE = '';                                   08670000
      TB_RCBV241.END_DATE = '';                                         08680000
    END;                                                                08690000
    CALL RCBCS3M_CHECK_LENOVO;                                          08700000
 END;                                                                   08710000
                                                                        08720000
 CALL RCBCS3M_CHECK_PRIORITY;                                           08730000
                                                       /* SOC RC01326 */08740000
 IF SWITCH_BAU_CTR  | SWITCH_PI_CTR THEN                                08750000
 CALL RCBCS3M_SPAC_SERV_EXTN;                                           08760000
                                                       /* EOC RC01326 */08770000
                                                                        08780000
 IF SWITCH_BAU_WARR | SWITCH_BAU_CTR |                /* CEDS00000596 */08790000
    SWITCH_PI_WARR  | SWITCH_PI_CTR THEN              /* CEDS00000596 */08800000
                                                                        08810000
 CALL RCBCS3M_SERV_EXTN;                                                08820000
                                                                        08830000
 CALL RCBCS3M_USER_EXIT;                                                08840000
                                                                        08850000
 END RCBCS3M_MAIN_PROCESSING;                                           08860000
                                                  /* SOC CEDS00000727 */08870000
 /* THIS PROC IS COMMENTED AS PART OF TREC T10-2117 AND T10-2118      */08880000
1/*********************************************************************/08890000
 /*                                                                   */08900000
 /* MODULE NAME      : RCBCS3M_CHK_LONG_EXIST              RB01320    */08910000
 /*                                                                   */08920000
 /* DESCRIPTION      : CHECK WHETHER THE LONG SERIAL EXIST IN BASE    */08930000
 /*                       TABLES                                      */08940000
 /*********************************************************************/08950000
 /*RCBCS3M_CHK_LONG_EXIST: PROC;                                        08960000
 EXEC SQL                                                               08970000
      SELECT COUNT(*)                                                   08980000
      INTO :WRK_COUNT                                                   08990000
      FROM  RCBV0220_SUPPL_CTR  T220                                    09000000
      WHERE  T220.COUNTRY_NUMBER  = :REFCTRY                            09010000
        AND  T220.PRODUCT_TYPE    = :REQTYPE                            09020000
        AND  T220.ORIGIN||T220.SEQUENCE_NUMBER = :REQLSEQ               09030000
        AND :DATE10         BETWEEN T220.EFFECTIVE_DATE                 09040000
                                AND T220.END_DATE                       09050000
      WITH UR;                                                          09060000
                                                                        09070000
 SELECT(SQLCA.SQLCODE);                                                 09080000
   WHEN(0);                                                             09090000
   WHEN(100)                                                            09100000
     DO;                                                                09110000
      EXEC SQL                                                          09120000
           SELECT COUNT(*)                                              09130000
           INTO :WRK_COUNT                                              09140000
           FROM  RCBV0240_SERV_CTR   T240                               09150000
           WHERE  T240.COUNTRY_NUMBER  = :REFCTRY                       09160000
             AND  T240.PRODUCT_TYPE    = :REQTYPE                       09170000
             AND  T240.ORIGIN||T240.SEQUENCE_NUMBER = :REQLSEQ          09180000
             AND :DATE10         BETWEEN T240.EFFECTIVE_DATE            09190000
                                     AND T240.END_DATE                  09200000
           WITH UR;                                                     09210000
                                                                        09220000
      SELECT(SQLCA.SQLCODE);                                            09230000
        WHEN(0);                                                        09240000
        WHEN(100);                                                      09250000
        OTHERWISE                                                       09260000
          DO;                                                           09270000
            RCBCQES.MESSAGE_NUMBER = 'C234';                            09280000
            WRK_SQLCODE = SQLCA.SQLCODE;                                09290000
            WRK_TABLE = 'RCBT0240_PI_CTR';                              09300000
            CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);            09310000
          END;                                                          09320000
      END;                                                              09330000
     END;                                                               09340000
   OTHERWISE                                                            09350000
     DO;                                                                09360000
       RCBCQES.MESSAGE_NUMBER = 'C219';                                 09370000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     09380000
       WRK_TABLE = 'RCBT0220_SUPPL_CTR';                                09390000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 09400000
     END;                                                               09410000
 END;                                                                   09420000
                                                                        09430000
 IF WRK_COUNT = 0 THEN                                                  09440000
  DO;                                                                   09450000
     EXEC SQL                                                           09460000
          SELECT COUNT(*)                                               09470000
          INTO :WRK_COUNT                                               09480000
          FROM  RCBV0051_PI_HW_PR  T051                                 09490000
          WHERE  T051.COUNTRY_NUMBER  = :REFCTRY                        09500000
            AND  T051.PRODUCT_TYPE    = :REQTYPE                        09510000
            AND  T051.ORIGIN||T051.SEQUENCE_NUMBER = :REQLSEQ           09520000
            AND  T051.INSTALL_DATE   <= :DATE10                         09530000
          WITH UR;                                                      09540000
                                                                        09550000
     SELECT(SQLCA.SQLCODE);                                             09560000
       WHEN(0);                                                         09570000
       WHEN(100)                                                        09580000
         DO;                                                            09590000
          EXEC SQL                                                      09600000
               SELECT COUNT(*)                                          09610000
               INTO :WRK_COUNT                                          09620000
               FROM  RCBV0241_PI_CTR  T241                              09630000
               WHERE  T241.COUNTRY_NUMBER  = :REFCTRY                   09640000
                 AND  T241.PRODUCT_TYPE    = :REQTYPE                   09650000
                 AND  T241.ORIGIN||T241.SEQUENCE_NUMBER = :REQLSEQ      09660000
                 AND :DATE10         BETWEEN T241.EFFECTIVE_DATE        09670000
                                         AND T241.END_DATE              09680000
               WITH UR;                                                 09690000
                                                                        09700000
          SELECT(SQLCA.SQLCODE);                                        09710000
            WHEN(0);                                                    09720000
            WHEN(100);                                                  09730000
            OTHERWISE                                                   09740000
              DO;                                                       09750000
                RCBCQES.MESSAGE_NUMBER = 'C234';                        09760000
                WRK_SQLCODE = SQLCA.SQLCODE;                            09770000
                WRK_TABLE = 'RCBT0241_PI_CTR';                          09780000
                CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);        09790000
              END;                                                      09800000
          END;                                                          09810000
         END;                                                           09820000
       OTHERWISE                                                        09830000
         DO;                                                            09840000
           RCBCQES.MESSAGE_NUMBER = 'C219';                             09850000
           WRK_SQLCODE = SQLCA.SQLCODE;                                 09860000
           WRK_TABLE = 'RCBT0051_PI_HW_PR';                             09870000
           CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);             09880000
         END;                                                           09890000
     END;                                                               09900000
   END;                                                                 09910000
 END RCBCS3M_CHK_LONG_EXIST;                    *//* EOC CEDS00000727 */09920000
1/*********************************************************************/09930000
 /*                                                                   */09940000
 /* MODULE NAME      : RCBCS3M_FETCH_T125_REAL           RB01320      */09950000
 /*                                                                   */09960000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0125    */09970000
 /*                                                                   */09980000
 /*********************************************************************/09990000
 RCBCS3M_FETCH_T125_REAL: PROC;                                         10000000
                                                                        10010000
 EXEC SQL                                                               10020000
      SELECT REAL_SERIAL_NUMBER                                         10030000
       INTO :WRK_LONG_SERIAL                                            10040000
       FROM  RCBV0125_DMMY_REAL  T125                                   10050000
      WHERE  T125.COUNTRY_NUMBER     = :REFCTRY                         10060000
        AND  T125.PRODUCT_TYPE       = :REQTYPE                         10070000
        AND  T125.DUMMY_ORIGIN       = :REQORIG                         10080000
        AND  T125.DUMMY_SEQUENCE_NUM = :REQSEQN                         10090000
        WITH UR;                                                        10100000
                                                                        10110000
     SELECT(SQLCA.SQLCODE);                                             10120000
                                                      /* SOC RC01359 */ 10130000
    /* WHEN(0);                                                      */ 10140000
       WHEN(0)                                                          10150000
         CHECKSEQ = WRK_LONG_SERIAL;                  /* EOC RC01359 */ 10160000
   /*  WHEN(100);                              *//* SOC CEDS00000727 */ 10170000
       WHEN(100)                                                        10180000
       DO;                                                              10190000
         WRK_LONG_SERIAL   = REQORIG||REQSEQN;                          10200000
       /*REQLSEQ           = WRK_LONG_SERIAL;       *//* SOC RC01367 */ 10210018
       /*CALL RCBCS3M_FETCH_T125_DMMY;                                  10220009
         REQLSEQ           = '';                                        10230000
         IF WRK_ORIGIN = '' THEN                                        10240000
         DO;                                                            10250000
           WRK_ORIGIN = REQORIG;                                        10260000
           WRK_SEQ_NO = REQSEQN;                                        10270000
         END;                                       *//* EOC RC01367 */ 10280018
       END;                                      /* EOC CEDS00000727 */ 10290000
       OTHERWISE                                                        10300000
        DO;                                                             10310000
          RCBCQES.MESSAGE_NUMBER = 'C267';                              10320000
          WRK_SQLCODE = SQLCA.SQLCODE;                                  10330000
          WRK_TABLE = 'RCBT0125_DMMY_REAL';                             10340000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              10350000
        END;                                                            10360000
     END;                                                               10370000
 END RCBCS3M_FETCH_T125_REAL;                                           10380000
1/*********************************************************************/10390000
 /*                                                                   */10400000
 /* MODULE NAME      : RCBCS3M_FETCH_T125_DMMY           RB01320      */10410000
 /*                                                                   */10420000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0125    */10430000
 /*                                                                   */10440000
 /*********************************************************************/10450000
 RCBCS3M_FETCH_T125_DMMY: PROC;                                         10460000
                                                                        10470000
 EXEC SQL                                                               10480000
      SELECT DUMMY_ORIGIN       ,                                       10490000
             DUMMY_SEQUENCE_NUM                                         10500000
       INTO :WRK_ORIGIN,:WRK_SEQ_NO                                     10510000
       FROM  RCBV0125_DMMY_REAL  T125                                   10520000
      WHERE  T125.COUNTRY_NUMBER     = :REFCTRY                         10530000
        AND  T125.PRODUCT_TYPE       = :REQTYPE                         10540000
        AND  T125.REAL_SERIAL_NUMBER = :REQLSEQ                         10550000
        WITH UR;                                                        10560000
                                                                        10570000
     SELECT(SQLCA.SQLCODE);                                             10580000
                                                      /* SOC RC01359 */ 10590000
  /*   WHEN(0);                                                     */  10600000
       WHEN (0)                                                         10610000
       DO;                                                /* RC01367 */ 10611018
       CHECKSEQ = REQLSEQ;                            /* EOC RC01359 */ 10620000
       CALL RCBCS3M_READ_BAU_WARR;                    /* SOC RC01367 */ 10621018
       CALL RCBCS3M_READ_BAU_CTR;                                       10623004
       CALL RCBCS3M_READ_PI_WARR;                                       10625004
       CALL RCBCS3M_READ_PI_CTR;                                        10627004
       END;                                                             10628009
       WHEN(100);                                                       10630016
  /*   WHEN(100); */                                   /* SOC RC01349 */10631017
  /*   WHEN(100)                                                        10640009
       DO;                                                              10650000
     /*  WRK_ORIGIN  = REQORIG;                     SOC CEDS00000727 */ 10660000
     /*  WRK_SEQ_NO  = REQSEQN;                                      */ 10670000
     /*  WRK_ORIGIN  = '';                                              10680005
         WRK_SEQ_NO  = '';                                              10690000
 EXEC SQL                                                               10700000
      SELECT REAL_SERIAL_NUMBER                                         10710000
       INTO :WRK_LONG_SERIAL                                            10720000
       FROM  RCBV0125_DMMY_REAL  T125                                   10730000
      WHERE  T125.COUNTRY_NUMBER     = :REFCTRY                         10740000
        AND  T125.PRODUCT_TYPE       = :REQTYPE                         10750000
        AND  T125.DUMMY_ORIGIN       = SUBSTR(:REQLSEQ,1,2)             10760000
        AND  T125.DUMMY_SEQUENCE_NUM = SUBSTR(:REQLSEQ,3)               10770000
        WITH UR;                                                        10780000
                                                                        10790000
     SELECT(SQLCA.SQLCODE);                                             10800000
       WHEN(0)                                                          10810000
        DO;                                                             10820000
         WRK_ORIGIN  = SUBSTR(REQLSEQ,1,2);                             10830000
         WRK_SEQ_NO  = SUBSTR(REQLSEQ,3);                               10840000
        END;                                                            10850000
       WHEN(100);                                                       10860000
       OTHERWISE                                                        10870000
       DO;                                                              10880000
         RCBCQES.MESSAGE_NUMBER = 'C267';                               10890000
         WRK_SQLCODE = SQLCA.SQLCODE;                                   10900000
         WRK_TABLE = 'RCBT0125_DMMY_REAL';                              10910000
         CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);               10920000
       END;                                                             10930000
      END;                                       /* EOC CEDS00000727 */ 10940000
     /*END;                                            /* EOC RC01349 */10950011
                                                       /* EOC RC01367 */10951018
       OTHERWISE                                                        10960000
        DO;                                                             10970000
          RCBCQES.MESSAGE_NUMBER = 'C266';                              10980000
          WRK_SQLCODE = SQLCA.SQLCODE;                                  10990000
          WRK_TABLE = 'RCBT0125_DMMY_REAL';                             11000000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              11010000
        END;                                                            11020000
     END;                                                               11030000
 END RCBCS3M_FETCH_T125_DMMY;                                           11040000
1/*********************************************************************/11050000
 /*                                                                   */11060000
 /* MODULE NAME      : RCBCS3M_READ_BAU_WARR                          */11070000
 /*                                                                   */11080000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0220    */11090000
 /*                                                                   */11100000
 /*********************************************************************/11110000
0RCBCS3M_READ_BAU_WARR: PROC;                                           11120000
                                                                        11130000
 EXEC SQL                                                               11140000
      SELECT PRODUCT_TYPE       ,                                       11150000
             ORIGIN             ,                                       11160000
             SEQUENCE_NUMBER    ,                                       11170000
             COUNTRY_NUMBER     ,                                       11180000
             TYPE_OF_MAINT      ,                                       11190000
             TYPE_OF_WARRANTY   ,                                       11200000
             SERVICE_LVL_CODE   ,                                       11210000
             WARRANTY_EXP_DATE  ,                                       11220000
             SOURCE_INDICATOR   ,                                       11230000
             LAST_CHANGE_DATE   ,                                       11240000
             EFFECTIVE_DATE     ,                                       11250000
             END_DATE           ,                                       11260000
             F_TYPE_OF_WARRANTY ,                                       11270000
             F_SPLT_DATE        ,                                       11280000
             SERVICE_LVL_CODE_2                                         11290000
       INTO :TB_RCBV220                                                 11300000
            :TB_RCBV220_I.INDNULL                                       11310000
       FROM  RCBV0220_SUPPL_CTR  T220                                   11320000
      WHERE  T220.COUNTRY_NUMBER  = :REFCTRY                            11330000
        AND  T220.PRODUCT_TYPE    = :REQTYPE                            11340000
   /*   AND  T220.ORIGIN          = :REQORIG            SOC RB01320 */  11350000
   /*   AND  T220.SEQUENCE_NUMBER = :REQSEQN                         */ 11360000
                                                 /* SOC CEDS00000727 */ 11370000
   /*   AND  ((T220.ORIGIN          = :WRK_ORIGIN                       11380000
               AND  T220.SEQUENCE_NUMBER = :WRK_SEQ_NO)                 11390000
             OR (T220.ORIGIN||T220.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))11400000
                                                     */                 11410000
        AND  T220.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)        11420000
        AND  T220.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)          11430000
                                                 /* EOC CEDS00000727 */ 11440000
                                                     /* EOC RB01320 */  11450000
        AND :DATE10         BETWEEN T220.EFFECTIVE_DATE                 11460000
                                AND T220.END_DATE                       11470000
      WITH UR;                                                          11480000
                                                                        11490000
 SELECT(SQLCA.SQLCODE);                                                 11500000
   WHEN(0)                                                              11510000
     DO;                                                                11520000
        CALL RCBCS3M_READ_HW_REAL;                                      11530000
                                                /* SOC CEDS00000642 */  11540000
      /*IF EDQBSHS.REQ.REQKEY.IOPUCTY ¬= EDQBSHS.REQ.TARGCTY THEN */    11550000
        IF COMMAREA.EDQBSHS.REQ.REQKEY.IOPUCTY ¬=                       11560000
                                  COMMAREA.EDQBSHS.REQ.TARGCTY THEN     11570000
                                                /* EOC CEDS00000642 */  11580000
          CALL RCBCS3M_READ_OUT_OF_CTRY(TB_RCBV300.MODEL_NUMBER,'BAU'); 11590000
                                                                        11600000
        CALL RCBCS3M_MOVE_SUPPL_CTR;                                    11610000
        CALL RCBCS3M_READ_HW_STATUS;                                    11620000
        CALL RCBCS3M_READ_HW_PR_MOD;                                    11630000
        CALL RCBCS3M_READ_HW_IN_ORD;                                    11640000
        CALL RCBCS3M_READ_OU_HW;                                        11650000
        CALL RCBCS3M_BAU_CUST;                                          11660000
   /*   IF ¬OUT_OF_COUNTRY THEN                         CEDS00000596 */ 11670000
   /*     CALL RCBCS3M_READ_BAU_SERV_EXTN;              CEDS00000596 */ 11680000
                                                                        11690000
     END;                                                               11700000
   WHEN(100);                                                           11710000
   OTHERWISE                                                            11720000
     DO;                                                                11730000
       RCBCQES.MESSAGE_NUMBER = 'C219';                                 11740000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     11750000
       WRK_TABLE = 'RCBT0220_SUPPL_CTR';                                11760000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 11770000
     END;                                                               11780000
 END;                                                                   11790000
 END RCBCS3M_READ_BAU_WARR;                                             11800000
1/*********************************************************************/11810000
 /*                                                                   */11820000
 /* MODULE NAME      : RCBCS3M_CHECK_INTERNAL                         */11830000
 /*                                                                   */11840000
 /* DESCRIPTION      : RETRIEVE INTERNAL CONTRACT TOM FROM PARAMETER  */11850000
 /*                    RCB070 OF TABLE RCBT0500                       */11860000
 /*********************************************************************/11870000
 /* RCBCS3M_CHECK_INTERNAL: PROC;                        CEDS00000508 */11880000
 RCBCS3M_CHECK_INTERNAL: PROC(ORIGIN,SEQ_NO);         /* CEDS00000508 */11890000
                                                                        11900000
 SWITCH_INTERNAL_CTR = FALSE;                                           11910000
                                                   /*SOC CEDS00000510 */11920000
 /*DCL ORIGIN CHAR(3);                                   CEDS00000508 */11930000
 /*DCL SEQ_NO CHAR(7);                                   CEDS00000508 */11940000
 DCL ORIGIN CHAR(2);                                                    11950000
 DCL SEQ_NO CHAR(28);                                                   11960000
                                                   /*EOC CEDS00000510 */11970000
 EXEC SQL                                                               11980000
   SELECT  C.PARAMETER_VALUE                                            11990000
   INTO    :TB_RCBV500.PARAMETER_VALUE                                  12000000
   FROM    RCBV0240_SERV_CTR A                                          12010000
          ,RCBV0030_CONTRACT B                                          12020000
          ,RCBV0500_PARM     C                                          12030000
   WHERE   A.COUNTRY_NUMBER             = :REFCTRY                      12040000
   AND     A.PRODUCT_TYPE               = :REQTYPE                      12050000
   AND     A.ORIGIN                     = :ORIGIN /* SOC CEDS00000508 */12060000
   AND     A.SEQUENCE_NUMBER            = :SEQ_NO                       12070000
 /* AND     A.ORIGIN                     = :REQORIG                     12080000
   AND     A.SEQUENCE_NUMBER            = :REQSEQN  */                  12090000
                                                  /* EOC CEDS00000508 */12100000
   AND     :DATE10  BETWEEN A.EFFECTIVE_DATE AND A.END_DATE             12110000
   AND     B.COUNTRY_NUMBER             = A.COUNTRY_NUMBER              12120000
   AND     B.CONTRACT_NUMBER            = A.CONTRACT_NUMBER             12130000
   AND     C.PARAMETER_NUMBER           = 'RCB070'                      12140000
   AND     SUBSTR(C.PARAMETER_KEY,1,3)  = A.COUNTRY_NUMBER              12150000
   AND     SUBSTR(C.PARAMETER_KEY,4,10) = B.TYPE_OF_CONTRACT            12160000
   WITH UR;                                                             12170000
     SELECT(SQLCA.SQLCODE);                                             12180000
     WHEN(0)                                                            12190000
     DO;                                                                12200000
      EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBP70S.TOM_INTERNAL_CONTRACT;   12210000
      SWITCH_INTERNAL_CTR = TRUE;                                       12220000
     END;                                                               12230000
     WHEN(100) SWITCH_INTERNAL_CTR = FALSE;                             12240000
     OTHERWISE                                                          12250000
      DO;                                                               12260000
        RCBCQES.MESSAGE_NUMBER = 'C220';                                12270000
        WRK_SQLCODE = SQLCA.SQLCODE;                                    12280000
        WRK_TABLE = 'T500_PARM_RCB070';                                 12290000
        CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                12300000
      END;                                                              12310000
     END;                                                               12320000
  END RCBCS3M_CHECK_INTERNAL;                                           12330000
1/*********************************************************************/12340000
 /*                                                                   */12350000
 /* MODULE NAME      : RCBCS3M_READ_PI_HW_PR                          */12360000
 /*                                                                   */12370000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0051    */12380000
 /*                                                                   */12390000
 /*********************************************************************/12400000
0RCBCS3M_READ_PI_WARR: PROC;                                            12410000
                                                                        12420000
 EXEC SQL                                                               12430000
      SELECT PRODUCT_TYPE       ,                                       12440000
             ORIGIN             ,                                       12450000
             SEQUENCE_NUMBER    ,                                       12460000
             COUNTRY_NUMBER     ,                                       12470000
             MODEL_NUMBER       ,                                       12480000
             BUILT_TO_MODEL_NR  ,                                       12490000
             INSTALL_DATE       ,                                       12500000
             TYPE_OF_MAINT      ,                                       12510000
             TYPE_OF_WARRANTY   ,                                       12520000
             SERVICE_DELIV_FLAG ,                                       12530000
             SERVICE_LVL_CODE_1 ,                                       12540000
             WARRANTY_SPLT_DATE ,                                       12550000
             SERVICE_LVL_CODE_2 ,                                       12560000
             WARRANTY_EXP_DATE  ,                                       12570000
             CUSTOMER_NUMBER    ,                                       12580000
             CUSTOMER_NR_EXTEND ,                                       12590000
             OU_CODE            ,                                       12600000
             DEALER_NUMBER      ,                                       12610000
             SERVICE_LVL_CODE_C ,                                       12620000
             SOURCE_INDICATOR   ,                                       12630000
             LAST_CHANGE_DATE   ,                                       12640000
             F_TYPE_OF_WARRANTY ,                                       12650000
             WARRANTY_LIABILITY                                         12660000
       INTO :TB_RCBV051                                                 12670000
            :TB_RCBV051_I.INDNULL                                       12680000
       FROM  RCBV0051_PI_HW_PR  T051                                    12690000
      WHERE  T051.COUNTRY_NUMBER  = :REFCTRY                            12700000
        AND  T051.PRODUCT_TYPE    = :REQTYPE                            12710000
  /*    AND  T051.ORIGIN          = :REQORIG            SOC RB01320 */  12720000
  /*    AND  T051.SEQUENCE_NUMBER = :REQSEQN                         */ 12730000
                                                 /* SOC CEDS00000727 */ 12740000
  /*    AND ((T051.ORIGIN          = :WRK_ORIGIN                        12750000
              AND  T051.SEQUENCE_NUMBER = :WRK_SEQ_NO)                  12760000
             OR (T051.ORIGIN||T051.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))12770000
                                                   *//* EOC RB01320 */  12780000
        AND (( T051.ORIGIN        = SUBSTR(:WRK_LONG_SERIAL,1,2)        12790000
        AND  T051.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3))         12800000
        OR ( T051.ORIGIN         = :WRK_ORIGIN                          12810000
        AND  T051.SEQUENCE_NUMBER = :WRK_SEQ_NO))                       12820000
                                                 /* EOC CEDS00000727 */ 12830000
        AND  T051.INSTALL_DATE   <= :DATE10                             12840000
                                                                        12850000
      WITH UR;                                                          12860000
                                                                        12870000
 SELECT(SQLCA.SQLCODE);                                                 12880000
   WHEN(0)                                                              12890000
     DO;                                                                12900000
       SWITCH_PI_OCC = TRUE;                                            12910000
                                                 /* SOC CEDS00000642 */ 12920000
     /*IF EDQBSHS.REQ.REQKEY.IOPUCTY ¬= EDQBSHS.REQ.TARGCTY THEN */     12930000
       IF COMMAREA.EDQBSHS.REQ.REQKEY.IOPUCTY ¬=                        12940000
                                COMMAREA.EDQBSHS.REQ.TARGCTY THEN       12950000
                                                 /* EOC CEDS00000642 */ 12960000
          CALL RCBCS3M_READ_OUT_OF_CTRY(TB_RCBV051.MODEL_NUMBER,'PRI'); 12970000
                                                                        12980000
       IF (DATE10 <= TB_RCBV051.WARRANTY_EXP_DATE) &                    12990000
         (                                             /*CEDS00000557*/ 13000000
          VERIFY(TB_RCBV051.TYPE_OF_WARRANTY,                           13010000
                        WRK_TPMNT_VAL.TPMNT_WAR) = 0                    13020000
          |VERIFY (TB_RCBV051.F_TYPE_OF_WARRANTY,WRK_FWTOW) = 0         13030000
          |VERIFY (TB_RCBV051.F_TYPE_OF_WARRANTY,WRK_HBTOM) = 0         13040000
         )                                             /*CEDS00000557*/ 13050000
       THEN                                                             13060000
       DO;                                                              13070000
          SWITCH_PI_WARR = TRUE;    /* PI SERV EXT TAKEN IN CASE     */ 13080000
        /*IF ¬OUT_OF_COUNTRY THEN   /* OF PI WARRANTY*//*CEDS00000522*/ 13090000
   /*       CALL RCBCS3M_READ_PI_SERV_EXTN;             CEDS00000596 */ 13100000
       END;                                                             13110000
                                                                        13120000
       IF DATE10 > TB_RCBV051.WARRANTY_EXP_DATE THEN                    13130000
          SWITCH_PI_PERCALL = TRUE;                                     13140000
                                                                        13150000
       CALL RCBCS3M_MOVE_PI_WARR;                                       13160000
       CALL RCBCS3M_PI_CUST;                                            13170000
     END;                                                               13180000
   WHEN(100);                                                           13190000
   OTHERWISE                                                            13200000
     DO;                                                                13210000
       RCBCQES.MESSAGE_NUMBER = 'C214';                                 13220000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     13230000
       WRK_TABLE = 'RCBT0051_PI_HW_PR';                                 13240000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 13250000
     END;                                                               13260000
 END;                                                                   13270000
 END RCBCS3M_READ_PI_WARR;                                              13280000
 /*********************************************************************/13290000
 /*                                                                   */13300000
 /* MODULE NAME      : RCBCS3M_READ_BAU_SERV_EXTN                     */13310000
 /*                                                                   */13320000
 /* DESCRIPTION      : RETRIEVE BAU SERVICE EXTENSIONS SHORTNAMES     */13330000
 /*                                                                   */13340000
 /*********************************************************************/13350000
 RCBCS3M_READ_BAU_SERV_EXTN: PROC;                                      13360000
                                                                        13370000
 /* I = 1; */                                          /* SOC RC01326 */13380000
  IF TEMP_SERV_EXTENSION(1) = '  '  THEN                                13390000
   DO;                                                                  13400000
    I     = 1;                                                          13410000
   END;                                                                 13420000
  IF EDQBSDS_BAU.SERV_EXTENSION(1) = '  '  THEN                         13430000
   DO;                                                                  13440000
    WRK_SE = 1;                                                         13450000
   END;                                                /* EOC RC01326 */13460000
  SWITCH_EOF_OFFSNAME = FALSE;                                          13470000
  IF TEMP_SERV_EXTENSION(5) ¬='ME>' THEN               /* SOC RC01326 */13480000
  DO;                                                  /* EOC RC01326 */13490000
  EXEC SQL                                                              13500000
      OPEN OFFSNAME_CURSOR;                                             13510000
  SELECT(SQLCA.SQLCODE);                                                13520000
   WHEN (0);                                                            13530000
   OTHERWISE                                                            13540000
     DO;                                                                13550000
       RCBCQES.MESSAGE_NUMBER = 'C221';                                 13560000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     13570000
       WRK_TABLE = 'OFFSNAME_CURSOR1';                                  13580000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 13590000
     END;                                                               13600000
  END;                                                                  13610000
  DO WHILE (¬SWITCH_EOF_OFFSNAME);                                      13620000
   EXEC SQL                                                             13630000
     FETCH OFFSNAME_CURSOR INTO :SNAME;                                 13640000
   SELECT(SQLCA.SQLCODE);                                               13650000
     WHEN(0)                                                            13660000
      DO;                                                               13670000
       SWITCH_EOF_OFFSNAME = FALSE;                                     13680000
    /*  IF I <= 5 THEN */                              /* SOC RC01326 */13690000
    /*   EDQBSDS_BAU.SERV_EXTENSION(I) = SNAME;                         13700000
       ELSE                                                             13710000
        EDQBSDS_BAU.SERV_EXTENSION(5) = 'ME>';                          13720000
       I= I + 1;                                                        13730000
      END*/                                                             13740000
     IF I <= 5 & SNAME ¬= '  ' THEN                                     13750000
      DO;                                                               13760000
       TEMP_SERV_EXTENSION(I) = SNAME;                                  13770000
       I= I + 1;                                                        13780000
       IF WRK_SE <= 5 THEN                                              13790000
         DO;                                                            13800000
           EDQBSDS_BAU.SERV_EXTENSION(WRK_SE) = SNAME;                  13810000
         END;                                                           13820000
       ELSE IF WRK_SE >=6 THEN                                          13830000
        EDQBSDS_BAU.SERV_EXTENSION(5) = 'ME>';                          13840000
                                                                        13850000
        WRK_SE = WRK_SE + 1;                                            13860000
      END;                                                              13870000
      ELSE                                                              13880000
      DO;                                                               13890000
        TEMP_SERV_EXTENSION(5) = 'ME>';                                 13900000
      END;                                                              13910000
      END;                                             /* EOC RC01326 */13920000
     WHEN(100)                                                          13930000
      DO;                                                               13940000
       SWITCH_EOF_OFFSNAME = TRUE;                                      13950000
      END;                                                              13960000
     OTHERWISE                                                          13970000
       DO;                                                              13980000
         RCBCQES.MESSAGE_NUMBER = 'C222';                               13990000
         WRK_SQLCODE = SQLCA.SQLCODE;                                   14000000
         WRK_TABLE = 'T120_SNAME_CURSOR2';                              14010000
               CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);         14020000
       END;                                                             14030000
   END;                                                                 14040000
  END;                                                                  14050000
                                                                        14060000
 /* CNT_BAU_SE = I - 1;*/                                  /* RC01326 */14070000
                                                                        14080000
  EXEC SQL                                                              14090000
     CLOSE OFFSNAME_CURSOR;                                             14100000
   SELECT(SQLCA.SQLCODE);                                               14110000
    WHEN (0);                                                           14120000
    OTHERWISE                                                           14130000
     DO;                                                                14140000
       RCBCQES.MESSAGE_NUMBER = 'C223';                                 14150000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     14160000
       WRK_TABLE = 'OFFSNAME_CURSOR';                                   14170000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 14180000
     END;                                                               14190000
   END;                                                                 14200000
  END;                                                     /* RC01326 */14210000
                                                                        14220000
 END RCBCS3M_READ_BAU_SERV_EXTN;                                        14230000
 /*********************************************************************/14240000
 /*                                                                   */14250000
 /* MODULE NAME      : RCBCS3M_READ_PI_SERV_EXTN                      */14260000
 /*                                                                   */14270000
 /* DESCRIPTION      : READ PI SERVICE EXTENSIONS FROM RCBT0650       */14280000
 /*                                                                   */14290000
 /*********************************************************************/14300000
 RCBCS3M_READ_PI_SERV_EXTN: PROC;                                       14310000
                                                                        14320000
 /*EDQBSDS_PI.SERV_EXTENSION(*) = '';*/                /* SOC RC01326 */14330000
 IF TEMP_SERV_EXTENSION(5) ¬='ME>' THEN                                 14340000
 DO;                                                   /* EOC RC01326 */14350000
 EXEC SQL                                                               14360000
      SELECT *                                                          14370000
   INTO :TB_RCBV650                                                     14380000
        :TB_RCBV650_I.INDNULL                                           14390000
   FROM RCBV0650_TRANS_SDF T650                                         14400000
  WHERE T650.SERVICE_DELIV_FLAG = :TB_RCBV051.SERVICE_DELIV_FLAG        14410000
    AND T650.COUNTRY_NUMBER     = :TB_RCBV051.COUNTRY_NUMBER            14420000
   WITH UR;                                                             14430000
   SELECT(SQLCA.SQLCODE);                                               14440000
     WHEN(0) DO;                                                        14450000
       CALL RCBCS3M_MOVE_PI_SERV_EXTN;                                  14460000
     END;                                                               14470000
     WHEN(100);                                                         14480000
     OTHERWISE                                                          14490000
       DO;                                                              14500000
         RCBCQES.MESSAGE_NUMBER = 'C224';                               14510000
         WRK_SQLCODE            = SQLCA.SQLCODE;                        14520000
         WRK_TABLE              = 'RCBV0650_TRANS_SDF';                 14530000
         CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);               14540000
       END;                                                             14550000
   END;                                                                 14560000
 END;                                                      /* RC01326 */14570000
                                                                        14580000
   END RCBCS3M_READ_PI_SERV_EXTN;                                       14590000
 /*********************************************************************/14600000
 /*                                                         RC01326   */14610000
 /* MODULE NAME      : RCBCS3M_SPAC_SERV_EXTN                         */14620000
 /*                                                                   */14630000
 /* DESCRIPTION      : RETRIEVE SPAC SERVICE EXTENSIONS               */14640000
 /*                                                                   */14650000
 /*********************************************************************/14660000
 RCBCS3M_SPAC_SERV_EXTN: PROC;                                          14670000
                                                                        14680000
 TB_RCBV635_I.INDNULL(*) = 0;                                           14690000
 TB_RCBV630_I.INDNULL(*) = 0;                                           14700000
                                                                        14710000
                                                                        14720000
 IF SWITCH_BAU_CTR = TRUE THEN                                          14730000
  DO;                                                                   14740000
  IF TB_RCBV240.SOURCE_INDICATOR = 'L' THEN                             14750000
  DO;                                                                   14760000
    EXEC SQL                                                            14770000
     SELECT T030.TYPE_OF_CONTRACT                                       14780000
      INTO    :WRK_TYPE_CONTRACT :WRK_TOC_V30_IND                       14790000
      FROM    RCBV0030_CONTRACT T030,                                   14800000
              RCBV0240_SERV_CTR T240                                    14810000
      WHERE T240.PRODUCT_TYPE   = :REQTYPE                              14820000
      AND   T240.COUNTRY_NUMBER = :REFCTRY                              14830000
      AND   T240.COUNTRY_NUMBER = T030.COUNTRY_NUMBER                   14840000
                                                 /* SOC CEDS00000727 */ 14850000
  /*  AND ((T240.ORIGIN         = :REQORIG                              14860000
           AND  T240.SEQUENCE_NUMBER = :REQSEQN)                        14870000
          OR (T240.ORIGIN||T240.SEQUENCE_NUMBER = :REQLSEQ)             14880000
          OR (T240.ORIGIN||T240.SEQUENCE_NUMBER = :WRK_LONG_SERIAL)) */ 14890000
      AND T240.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)           14900000
      AND T240.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)             14910000
                                                 /* EOC CEDS00000727 */ 14920000
      AND T240.CONTRACT_NUMBER  = T030.CONTRACT_NUMBER                  14930000
      AND T240.SOURCE_INDICATOR = 'L'                                   14940000
      AND :DATE10 BETWEEN T240.EFFECTIVE_DATE AND T240.END_DATE         14950000
      ;                                                                 14960000
                                                                        14970000
     SELECT(SQLCA.SQLCODE);                                             14980000
      WHEN(0)                                                           14990000
       DO;                                                              15000000
        IF WRK_TOC_V30_IND ¬= -1 THEN                                   15010000
        DO;                                                             15020000
         EXEC SQL                                                       15030000
          SELECT SERVICE_EXTENSION                                      15040000
          INTO :TB_RCBV635.SERVICE_EXTENSION                            15050000
               :TB_RCBV635_I.INDNULL                                    15060000
          FROM RCBV0635_CTRY_HVC                                        15070000
          WHERE HVP_CONTRACT_NUMBR = :WRK_TYPE_CONTRACT                 15080000
          AND   COUNTRY_NUMBER     = :REFCTRY;                          15090000
                                                                        15100000
          SELECT(SQLCA.SQLCODE);                                        15110000
          WHEN(0)                                                       15120000
           DO;                                                          15130000
            SW_BAU_CTR_SE = TRUE;                                       15140000
            WRK_SERV_EXTN_BAU = TB_RCBV635.SERVICE_EXTENSION;           15150000
            CALL RCBCS3M_PROCESS_BAU_CTR_SE;                            15160000
            TEMP_SERV_EXTENSION(*) = BAU_SERV_EXTENSION_CTR(*);         15170000
           END;                                                         15180000
          WHEN(100)                                                     15190000
           DO;                                                          15200000
            IF WRK_TOC_V30_IND ¬= -1 THEN                               15210000
             DO;                                                        15220000
              EXEC SQL                                                  15230000
               SELECT SERVICE_EXTENSION                                 15240000
               INTO :TB_RCBV630.SERVICE_EXTENSION                       15250000
                    :TB_RCBV630_I.INDNULL                               15260000
               FROM RCBV0630_TRANS_HVC                                  15270000
               WHERE HVP_CONTRACT_NUMBR = :WRK_TYPE_CONTRACT;           15280000
                                                                        15290000
               SELECT(SQLCA.SQLCODE);                                   15300000
               WHEN(0)                                                  15310000
                DO;                                                     15320000
                 SW_BAU_CTR_SE = TRUE;                                  15330000
                 WRK_SERV_EXTN_BAU = TB_RCBV630.SERVICE_EXTENSION;      15340000
                 CALL RCBCS3M_PROCESS_BAU_CTR_SE;                       15350000
                 TEMP_SERV_EXTENSION(*) = BAU_SERV_EXTENSION_CTR(*);    15360000
                END;                                                    15370000
               WHEN(100)                                                15380000
                DO;                                                     15390000
                 SW_BAU_CTR_SE = FALSE;                                 15400000
                END;                                                    15410000
               OTHERWISE                                                15420000
                DO;                                                     15430000
                 RCBCQES.MESSAGE_NUMBER = 'C268';                       15440000
                 WRK_SQLCODE            = SQLCA.SQLCODE;                15450000
                 WRK_TABLE              = 'RCBT0630_TRANS_HVC';         15460000
                 CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);       15470000
                END;                                                    15480000
               END;                                                     15490000
             END;                                                       15500000
           END;                                                         15510000
          OTHERWISE                                                     15520000
           DO;                                                          15530000
             RCBCQES.MESSAGE_NUMBER = 'C269';                           15540000
             WRK_SQLCODE            = SQLCA.SQLCODE;                    15550000
             WRK_TABLE              = 'RCBT0635_CTRY_HVC';              15560000
             CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);           15570000
           END;                                                         15580000
          END;                                                          15590000
        END;                                                            15600000
       END;                                                             15610000
      WHEN(100)                                                         15620000
       DO;                                                              15630000
        SW_BAU_CTR_SE = FALSE;                                          15640000
       END;                                                             15650000
      OTHERWISE                                                         15660000
       DO;                                                              15670000
        RCBCQES.MESSAGE_NUMBER = 'C241';                                15680000
        WRK_SQLCODE            = SQLCA.SQLCODE;                         15690000
        WRK_TABLE              = 'RCBT0030_CONTRACT';                   15700000
        CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                15710000
       END;                                                             15720000
      END;                                                              15730000
     END;                                                               15740000
  END;                                                                  15750000
                                                                        15760000
 ELSE IF SWITCH_PI_CTR = TRUE  THEN                                     15770000
  DO;                                                                   15780000
                                                                        15790000
    EXEC SQL                                                            15800000
     SELECT T635.SERVICE_EXTENSION                                      15810000
     INTO :TB_RCBV635.SERVICE_EXTENSION                                 15820000
          :TB_RCBV635_I.INDNULL                                         15830000
     FROM RCBV0635_CTRY_HVC  T635                                       15840000
     LEFT OUTER JOIN RCBT0241_PI_CTR T241                               15850000
                                                                        15860000
                                                   /* SOC CEDS00000730*/15870000
  /* ON  T635.HVP_CONTRACT_NUMBR = T241.CONTRACT_NUMBER  */             15880000
     ON  T635.COUNTRY_NUMBER     = T241.COUNTRY_NUMBER                  15890000
     AND T635.HVP_CONTRACT_NUMBR = T241.CONTRACT_NUMBER                 15900000
                                                   /* EOC CEDS00000730*/15910000
     WHERE T241.PRODUCT_TYPE     = :REQTYPE                             15920000
     AND T241.COUNTRY_NUMBER     = :REFCTRY                             15930000
                                                 /* SOC CEDS00000727 */ 15940000
  /* AND T241.COUNTRY_NUMBER     = T635.COUNTRY_NUMBER                  15950000
     AND ((T241.ORIGIN           = :REQORIG                             15960000
           AND  T241.SEQUENCE_NUMBER = :REQSEQN)                        15970000
          OR (T241.ORIGIN||T241.SEQUENCE_NUMBER = :REQLSEQ)             15980000
          OR (T241.ORIGIN||T241.SEQUENCE_NUMBER = :WRK_LONG_SERIAL)) */ 15990000
     AND (( T241.ORIGIN        = SUBSTR(:WRK_LONG_SERIAL,1,2)           16000000
     AND  T241.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3))            16010000
     OR ( T241.ORIGIN         = :WRK_ORIGIN                             16020000
     AND  T241.SEQUENCE_NUMBER = :WRK_SEQ_NO))                          16030000
                                                 /* EOC CEDS00000727 */ 16040000
      AND :DATE10 BETWEEN T241.EFFECTIVE_DATE AND T241.END_DATE         16050000
      ;                                                                 16060000
                                                                        16070000
      SELECT(SQLCA.SQLCODE);                                            16080000
       WHEN(0)                                                          16090000
        DO;                                                             16100000
         SW_PI_CTR_SE = TRUE;                                           16110000
         WRK_SERV_EXTN_PI = TB_RCBV635.SERVICE_EXTENSION;               16120000
         CALL RCBCS3M_PROCESS_PI_CTR_SE;                                16130000
         TEMP_SERV_EXTENSION(*) = PI_SERV_EXTENSION_CTR(*);             16140000
        END;                                                            16150000
       WHEN(100)                                                        16160000
        DO;                                                             16170000
          EXEC SQL                                                      16180000
           SELECT T630.SERVICE_EXTENSION                                16190000
           INTO :TB_RCBV630.SERVICE_EXTENSION                           16200000
                :TB_RCBV630_I.INDNULL                                   16210000
           FROM RCBV0630_TRANS_HVC  T630                                16220000
           LEFT OUTER JOIN RCBT0241_PI_CTR T241                         16230000
           ON    T630.HVP_CONTRACT_NUMBR = T241.CONTRACT_NUMBER         16240000
           WHERE T241.PRODUCT_TYPE = :REQTYPE                           16250000
           AND T241.COUNTRY_NUMBER = :REFCTRY                           16260000
                                                 /* SOC CEDS00000727 */ 16270000
     /*    AND ((T241.ORIGIN       = :REQORIG                           16280000
           AND  T241.SEQUENCE_NUMBER = :REQSEQN)                        16290000
           OR (T241.ORIGIN||T241.SEQUENCE_NUMBER = :REQLSEQ)            16300000
           OR (T241.ORIGIN||T241.SEQUENCE_NUMBER = :WRK_LONG_SERIAL))*/ 16310000
           AND (( T241.ORIGIN        = SUBSTR(:WRK_LONG_SERIAL,1,2)     16320000
           AND  T241.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3))      16330000
           OR ( T241.ORIGIN         = :WRK_ORIGIN                       16340000
           AND  T241.SEQUENCE_NUMBER = :WRK_SEQ_NO))                    16350000
                                                 /* EOC CEDS00000727 */ 16360000
           AND  :DATE10 BETWEEN T241.EFFECTIVE_DATE AND T241.END_DATE   16370000
           ;                                                            16380000
                                                                        16390000
          SELECT(SQLCA.SQLCODE);                                        16400000
           WHEN(0)                                                      16410000
            DO;                                                         16420000
             SW_PI_CTR_SE = TRUE;                                       16430000
             WRK_SERV_EXTN_PI = TB_RCBV630.SERVICE_EXTENSION;           16440000
             CALL RCBCS3M_PROCESS_PI_CTR_SE;                            16450000
             TEMP_SERV_EXTENSION(*) = PI_SERV_EXTENSION_CTR(*);         16460000
            END;                                                        16470000
           WHEN(100)                                                    16480000
            DO;                                                         16490000
             SW_PI_CTR_SE = FALSE;                                      16500000
            END;                                                        16510000
           OTHERWISE                                                    16520000
            DO;                                                         16530000
             RCBCQES.MESSAGE_NUMBER = 'C268';                           16540000
             WRK_SQLCODE            = SQLCA.SQLCODE;                    16550000
             WRK_TABLE              = 'RCBT0630_TRANS_HVC';             16560000
             CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);           16570000
            END;                                                        16580000
          END;                                                          16590000
         END;                                                           16600000
       OTHERWISE                                                        16610000
        DO;                                                             16620000
          RCBCQES.MESSAGE_NUMBER = 'C269';                              16630000
          WRK_SQLCODE            = SQLCA.SQLCODE;                       16640000
          WRK_TABLE              = 'RCBT0635_CTRY_HVC';                 16650000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              16660000
        END;                                                            16670000
      END;                                                              16680000
  END;                                                                  16690000
                                                                        16700000
 IF TEMP_SERV_EXTENSION(5) ¬= 'ME>'  THEN                               16710000
  DO;                                                                   16720000
   IF SW_BAU_CTR_SE THEN                                                16730000
     I = WRK_SE;                                                        16740000
   ELSE                                                                 16750000
   IF SW_PI_CTR_SE THEN                                                 16760000
     I = WRK_SP;                                                        16770000
  END;                                                                  16780000
                                                                        16790000
 END RCBCS3M_SPAC_SERV_EXTN;                                            16800000
 /*********************************************************************/16810000
 /*                                                         RC01326   */16820000
 /* MODULE NAME      : RCBCS3M_PROCESS_BAU_CTR_SE                     */16830000
 /*                                                                   */16840000
 /* DESCRIPTION      : RETRIEVE SPAC SERVICE EXTENSIONS-BAU           */16850000
 /*                                                                   */16860000
 /*********************************************************************/16870000
 RCBCS3M_PROCESS_BAU_CTR_SE: PROC;                                      16880000
                                                                        16890000
  WRK_SE = 1;                                                           16900000
  DCL Y FIXED BIN(31) INIT(1);                                          16910000
                                                                        16920000
  IF (TB_RCBV635_I.INDNULL(4) = 0) | (TB_RCBV630_I.INDNULL(3) = 0)      16930000
   THEN                                                                 16940000
      DO WHILE (WRK_SE <= 5 & (SUBSTR(WRK_SERV_EXTN_BAU,Y,3) ¬=' '));   16950000
        IF (WRK_SE <= 5 ) THEN                                          16960000
         DO;                                                            16970000
           BAU_SERV_EXTENSION_CTR(WRK_SE)=                              16980000
                             SUBSTR(WRK_SERV_EXTN_BAU,Y,3);             16990000
         END;                                                           17000000
         Y = Y + 4;                                                     17010000
         WRK_SE  = WRK_SE +  1;                                         17020000
      END;                                                              17030000
                                                                        17040000
   EDQBSDS_BAU.SERV_EXTENSION(*)= BAU_SERV_EXTENSION_CTR(*);            17050000
                                                                        17060000
 END RCBCS3M_PROCESS_BAU_CTR_SE;                                        17070000
 /*********************************************************************/17080000
 /*                                                         RC01326   */17090000
 /* MODULE NAME      : RCBCS3M_PROCESS_PI_CTR_SE                      */17100000
 /*                                                                   */17110000
 /* DESCRIPTION      : RETRIEVE SPAC SERVICE EXTENSIONS               */17120000
 /*                                                                   */17130000
 /*********************************************************************/17140000
 RCBCS3M_PROCESS_PI_CTR_SE: PROC;                                       17150000
                                                                        17160000
  WRK_SP = 1;                                                           17170000
  DCL Z FIXED BIN(31) INIT(1);                                          17180000
                                                                        17190000
  IF (TB_RCBV635_I.INDNULL(4) = 0) | (TB_RCBV630_I.INDNULL(3) = 0)      17200000
    THEN                                                                17210000
      DO WHILE ( WRK_SP <= 6 & (SUBSTR(WRK_SERV_EXTN_PI,Z,3) ¬=' '));   17220000
        IF (WRK_SP <= 5 ) THEN                                          17230000
          DO;                                                           17240000
           PI_SERV_EXTENSION_CTR(WRK_SP)=                               17250000
                          SUBSTR(WRK_SERV_EXTN_PI,Z,3);                 17260000
          END;                                                          17270000
         Z = Z + 4;                                                     17280000
         WRK_SP = WRK_SP + 1;                                           17290000
      END;                                                              17300000
                                                                        17310000
  EDQBSDS_PI.SERV_EXTENSION(*)= PI_SERV_EXTENSION_CTR(*);               17320000
                                                                        17330000
 END RCBCS3M_PROCESS_PI_CTR_SE;                                         17340000
1/*********************************************************************/17350000
 /*                                                                   */17360000
 /* MODULE NAME      : RCBCS3M_READ_OUT_OF_CTRY                       */17370000
 /*                                                                   */17380000
 /* DESCRIPTION      : READ T690/T650/T400 FOR OUT OF CTRY            */17390000
 /*                                                                   */17400000
 /*********************************************************************/17410000
0RCBCS3M_READ_OUT_OF_CTRY: PROC(WRK_OOC_MODEL_NUMBER,FLOW);             17420000
                                                                        17430000
 DCL WRK_OOC_MODEL_NUMBER CHAR(3);                                      17440000
 DCL FLOW CHAR(3);                                                      17450000
 WRK_SLC1 = '';                                                         17460000
 WRK_SLC2 = '';                                                         17470000
 WRK_SLCC = '';                                                         17480000
 TB_RCBV690 = '';                                                       17490000
 TB_RCBV650 = '';                                                       17500000
 TB_RCBV400 = '';                                                       17510000
 SWITCH_READ_T690 = FALSE;                                              17520000
 SWITCH_READ_T400 = FALSE;                                              17530000
 OUT_OF_COUNTRY   = TRUE ;                        /* CEDS00000627 */    17540000
                                                                        17550000
 TB_RCBV690.COUNTRY_NUMBER = ACMCTRY;                                   17560000
 TB_RCBV690.MODEL_NUMBER = WRK_OOC_MODEL_NUMBER;                        17570000
 CALL RCBCS3M_SELECT_RCBV690;                                           17580000
 IF SWITCH_READ_T690 = FALSE THEN DO;                                   17590000
    TB_RCBV690.COUNTRY_NUMBER = ACMCTRY;                                17600000
    TB_RCBV690.MODEL_NUMBER = '***';                                    17610000
    CALL RCBCS3M_SELECT_RCBV690;                                        17620000
 END;                                                                   17630000
 IF SWITCH_READ_T690 = FALSE THEN DO;                                   17640000
    TB_RCBV690.COUNTRY_NUMBER = '***';                                  17650000
    TB_RCBV690.MODEL_NUMBER = WRK_OOC_MODEL_NUMBER;                     17660000
    CALL RCBCS3M_SELECT_RCBV690;                                        17670000
 END;                                                                   17680000
 IF SWITCH_READ_T690 = FALSE THEN DO;                                   17690000
    TB_RCBV690.COUNTRY_NUMBER = '***';                                  17700000
    TB_RCBV690.MODEL_NUMBER = '***';                                    17710000
    CALL RCBCS3M_SELECT_RCBV690;                                        17720000
 END;                                                                   17730000
 IF FLOW = 'PRI' THEN DO;                                               17740000
   IF ((TB_RCBP151S.PEW_AUTH_SOURCE = 'L') |                            17750000
       (TB_RCBP151S.PEW_AUTH_SOURCE = 'Y') &                            17760000
       (TB_RCBV051.WARRANTY_LIABILITY = 'LEN')) THEN DO;                17770000
       TB_RCBV650.SERVICE_DELIV_FLAG = TB_RCBV051.SERVICE_DELIV_FLAG;   17780000
       CALL RCBCS3M_SELECT_RCBV650;                                     17790000
   END;                                                                 17800000
 END;                                                                   17810000
                                                                        17820000
 TB_RCBV400.MODEL_NUMBER =  WRK_OOC_MODEL_NUMBER;                       17830000
 CALL RCBCS3M_SELECT_RCBV400;                                           17840000
 IF SWITCH_READ_T400 = FALSE THEN DO;                                   17850000
   TB_RCBV400.MODEL_NUMBER = '';                                        17860000
   CALL RCBCS3M_SELECT_RCBV400;                                         17870000
 END;                                                                   17880000
                                                      /* SOC RC01330  */17890000
 /* FOR OUT OF COUNTRY, IF SLC VALUE IS STILL BLANK THEN DEFAULT SLC  */17900000
 /* VALUE IS ASSIGNED.                                                */17910000
                                                                        17920000
 IF (SWITCH_READ_T400 = FALSE  &                                        17930000
     WRK_SLC1         = ''     &                                        17940000
     WRK_SLC2         = ''     &                                        17950000
     WRK_SLCC         = ''     ) THEN                                   17960000
   DO;                                                                  17970000
 /* FOR WARRANTY WRK_SLC1 & WRK_SLC2 IS ASSIGNED FROM  - RCB152 SLC   */17980000
        EXEC SQL                                                        17990000
         SELECT T500.PARAMETER_VALUE                                    18000000
         INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                 18010000
         FROM   RCBV0500_PARM  T500                                     18020000
         WHERE  T500.PARAMETER_NUMBER = 'RCB152'                        18030000
           AND  T500.PARAMETER_KEY    = :ACMCTRY                        18040000
        WITH UR;                                                        18050000
                                                                        18060000
        SELECT(SQLCA.SQLCODE);                                          18070000
        WHEN(0)                                                         18080000
         DO;                                                            18090000
          WRK_SLC1,WRK_SLC2 = TB_RCBV500.PARAMETER_VALUE ;              18100000
         END;                                                           18110000
        WHEN(100);                                                      18120000
        OTHERWISE                                                       18130000
         DO;                                                            18140000
          RCBCQES.MESSAGE_NUMBER = 'C271';                              18150000
          WRK_SQLCODE = SQLCA.SQLCODE;                                  18160000
          WRK_TABLE = 'RCBV0500_PARM';                                  18170000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              18180000
         END;                                                           18190000
        END;                                                            18200000
                                                                        18210000
 /* FOR NON WARRANTY,PER CALL WRK_SLCC IS ASSIGNED FROM - RCB154 SLC  */18220000
        EXEC SQL                                                        18230000
         SELECT T500.PARAMETER_VALUE                                    18240000
         INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                 18250000
         FROM   RCBV0500_PARM  T500                                     18260000
         WHERE  T500.PARAMETER_NUMBER = 'RCB154'                        18270000
           AND  T500.PARAMETER_KEY    = :ACMCTRY                        18280000
        WITH UR;                                                        18290000
                                                                        18300000
        SELECT(SQLCA.SQLCODE);                                          18310000
        WHEN(0)                                                         18320000
         DO;                                                            18330000
          WRK_SLCC = TB_RCBV500.PARAMETER_VALUE ;                       18340000
         END;                                                           18350000
        WHEN(100);                                                      18360000
        OTHERWISE                                                       18370000
         DO;                                                            18380000
          RCBCQES.MESSAGE_NUMBER = 'C272';                              18390000
          WRK_SQLCODE = SQLCA.SQLCODE;                                  18400000
          WRK_TABLE = 'RCBV0500_PARM';                                  18410000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              18420000
         END;                                                           18430000
        END;                                                            18440000
                                                                        18450000
   END;                                                                 18460000
                                                      /* EOC RC01330  */18470000
 END RCBCS3M_READ_OUT_OF_CTRY;                                          18480000
1/*********************************************************************/18490000
 /*                                                                   */18500000
 /* MODULE NAME      : RCBCS3M_SELECT_RCBV690                         */18510000
 /*                                                                   */18520000
 /* DESCRIPTION      : EXTRACT THE RECORD FROM T690                   */18530000
 /*                                                                   */18540000
 /*********************************************************************/18550000
 RCBCS3M_SELECT_RCBV690: PROC;                                          18560000
 EXEC SQL                                                               18570000
   SELECT *                                                             18580000
   INTO :TB_RCBV690                                                     18590000
        :TB_RCBV690_I.INDNULL                                           18600000
   FROM RCBV0690_FLEX_WARR T690                                         18610000
  WHERE  T690.COUNTRY_NUMBER  = :TB_RCBV690.COUNTRY_NUMBER              18620000
   AND  T690.PRODUCT_TYPE    = :REQTYPE                                 18630000
   AND  T690.MODEL_NUMBER    = :TB_RCBV690.MODEL_NUMBER                 18640000
   AND :DATE10  BETWEEN T690.EFFECTIVE_DATE AND T690.END_DATE           18650000
 WITH UR;                                                               18660000
 SELECT(SQLCA.SQLCODE);                                                 18670000
 WHEN(0) DO;                                                            18680000
  OUT_OF_COUNTRY = TRUE;                                                18690000
  SWITCH_READ_T690 = TRUE;                                              18700000
  IF (TB_RCBV690_I.INDNULL(5) = 0) &                                    18710000
     (TB_RCBV690.SERVICE_LVL_CODE ¬= '') THEN                           18720000
      WRK_SLC1 = TB_RCBV690.SERVICE_LVL_CODE;                           18730000
  IF (TB_RCBV690_I.INDNULL(9) = 0) &                                    18740000
     (TB_RCBV690.SERVICE_LVL_CODE_2 ¬= '') THEN                         18750000
      WRK_SLC2 = TB_RCBV690.SERVICE_LVL_CODE_2;                         18760000
  IF TB_RCBV690.RULE  = 'FW' THEN WRK_SLC2 = WRK_SLC1;                  18770000
 END;                                                                   18780000
 WHEN(100) SWITCH_READ_T690 = FALSE;                                    18790000
 OTHERWISE DO;                                                          18800000
  RCBCQES.MESSAGE_NUMBER = 'C259';                                      18810000
  WRK_SQLCODE = SQLCA.SQLCODE;                                          18820000
  WRK_TABLE = 'RCBT0690_FLEX_WARR';                                     18830000
  CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                      18840000
 END;                                                                   18850000
 END;                                                                   18860000
                                                                        18870000
 END RCBCS3M_SELECT_RCBV690;                                            18880000
1/*********************************************************************/18890000
 /*                                                                   */18900000
 /* MODULE NAME      : RCBCS3M_SELECT_RCBV650                         */18910000
 /*                                                                   */18920000
 /* DESCRIPTION      : EXTRACT THE RECORD FROM T650                   */18930000
 /*                                                                   */18940000
 /*********************************************************************/18950000
 RCBCS3M_SELECT_RCBV650: PROC;                                          18960000
 EXEC SQL                                                               18970000
   SELECT *                                                             18980000
   INTO :TB_RCBV650                                                     18990000
        :TB_RCBV650_I.INDNULL                                           19000000
   FROM RCBV0650_TRANS_SDF T650                                         19010000
 WHERE T650.COUNTRY_NUMBER     = :ACMCTRY                               19020000
 AND T650.SERVICE_DELIV_FLAG = :TB_RCBV650.SERVICE_DELIV_FLAG           19030000
 WITH UR;                                                               19040000
 SELECT(SQLCA.SQLCODE);                                                 19050000
 WHEN(0) DO;                                                            19060000
  OUT_OF_COUNTRY = TRUE;                                                19070000
  /*CALL RCBCS3M_MOVE_PI_SERV_EXTN;                     CEDS00000522 */ 19080000
  IF WRK_SLC1 = '' THEN DO;                                             19090000
    WRK_SLC1 = TB_RCBV650.SERVICE_LVL_CODE_1;                           19100000
    IF TB_RCBV650_I.INDNULL(8) = 0 THEN                                 19110000
     WRK_SLC2 = TB_RCBV650.SERVICE_LVL_CODE_2;                          19120000
    ELSE WRK_SLC2 = '';                                                 19130000
  END;                                                                  19140000
 END;                                                                   19150000
 WHEN(100);                                                             19160000
 OTHERWISE DO;                                                          19170000
      RCBCQES.MESSAGE_NUMBER = 'C260';                                  19180000
      WRK_SQLCODE            = SQLCA.SQLCODE;                           19190000
      WRK_TABLE              = 'RCBV0650_TRANS_SDF';                    19200000
      CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                  19210000
 END;                                                                   19220000
 END;                                                                   19230000
 END RCBCS3M_SELECT_RCBV650;                                            19240000
1/*********************************************************************/19250000
 /*                                                                   */19260000
 /* MODULE NAME      : RCBCS3M_SELECT_RCBV400                         */19270000
 /*                                                                   */19280000
 /* DESCRIPTION      : EXTRACT THE RECORD FROM T400                   */19290000
 /*                                                                   */19300000
 /*********************************************************************/19310000
 RCBCS3M_SELECT_RCBV400: PROC;                                          19320000
  EXEC SQL                                                              19330000
   SELECT *                                                             19340000
   INTO :TB_RCBV400                                                     19350000
        :TB_RCBV400_I.INDNULL                                           19360000
   FROM RCBV0400_PO_MOD1 T400                                           19370000
   WHERE  T400.COUNTRY_NUMBER  = :ACMCTRY                               19380000
   AND  T400.PRODUCT_TYPE    = :REQTYPE                                 19390000
   AND  T400.MODEL_NUMBER    = :TB_RCBV400.MODEL_NUMBER                 19400000
   AND :DATE10 BETWEEN T400.EFFECTIVE_DATE AND T400.END_DATE            19410000
  WITH UR;                                                              19420000
  SELECT(SQLCA.SQLCODE);                                                19430000
  WHEN(0) DO;                                                           19440000
   OUT_OF_COUNTRY = TRUE;                                               19450000
   SWITCH_READ_T400 = TRUE;                                             19460000
   IF WRK_SLC1 = ''  THEN DO;                                           19470000
    IF TB_RCBV400_I.INDNULL(14) = 0 THEN                                19480000
      WRK_SLC1 = TB_RCBV400.SERVICE_LVL_CODE_1;                         19490000
    IF TB_RCBV400_I.INDNULL(16) = 0 THEN                                19500000
      WRK_SLC2 = TB_RCBV400.SERVICE_LVL_CODE_2;                         19510000
   END;                                                                 19520000
   /* IF TB_RCBV400_I.INDNULL(21) = 0 THEN              CEDS00000521 */ 19530000
   IF TB_RCBV400_I.INDNULL(18) = 0 THEN              /* CEDS00000521 */ 19540000
     WRK_SLCC = TB_RCBV400.SERVICE_LVL_CODE_C;                          19550000
   ELSE WRK_SLCC = '';                                                  19560000
  END;                                                                  19570000
  WHEN(100) SWITCH_READ_T400 = FALSE;                                   19580000
  OTHERWISE DO;                                                         19590000
   RCBCQES.MESSAGE_NUMBER = 'C261';                                     19600000
   WRK_SQLCODE = SQLCA.SQLCODE;                                         19610000
   WRK_TABLE = 'RCBT0400_PO_MOD1';                                      19620000
   CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                     19630000
  END;                                                                  19640000
  END;                                                                  19650000
 END RCBCS3M_SELECT_RCBV400;                                            19660000
1/*********************************************************************/19670000
 /*                                                                   */19680000
 /* MODULE NAME      : RCBCS3M_MOVE_PI_WARR                           */19690000
 /*                                                                   */19700000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0051    */19710000
 /*                    TO THE COMMAREA FIELDS.                        */19720000
 /*                                                                   */19730000
 /*********************************************************************/19740000
 RCBCS3M_MOVE_PI_WARR: PROC;                                            19750000
                                                                        19760000
 EDQBSDS_PI.IHSITOS.CSLMTYP         = TB_RCBV051.PRODUCT_TYPE;          19770000
                                                      /* SOC RB01320 */ 19780000
 /* EDQBSDS_PI.IHSITOS.IHSIMID.IOLCPLM = TB_RCBV051.ORIGIN;          */ 19790000
 /* EDQBSDS_PI.IHSITOS.IHSIMID.IHSINBR = TB_RCBV051.SEQUENCE_NUMBER; */ 19800000
                                                 /* SOC CEDS00000727 */ 19810000
   IF WRK_ORIGIN ¬= '' THEN                                             19820000
   DO;                                           /* EOC CEDS00000727 */ 19830000
   EDQBSDS_PI.IHSITOS.IHSIMID.IOLCPLM = WRK_ORIGIN;                     19840000
   EDQBSDS_PI.IHSITOS.IHSIMID.IHSINBR = WRK_SEQ_NO;                     19850000
   END;                                          /* SOC CEDS00000727 */ 19860000
   ELSE                                                                 19870000
   DO;                                                                  19880000
     EDQBSDS_PI.IHSITOS.IHSIMID.IOLCPLM = SUBSTR(WRK_LONG_SERIAL,1,2);  19890000
     EDQBSDS_PI.IHSITOS.IHSIMID.IHSINBR = SUBSTR(WRK_LONG_SERIAL,3);    19900000
   END;                                          /* EOC CEDS00000727 */ 19910000
 IF SWITCH_3317_S3 THEN                                                 19920000
   DO;                                                                  19930000
     IF WRK_LONG_SERIAL ¬= '' THEN                                      19940000
       DO;                                                              19950000
                                                 /* SOC CEDS00000642 */ 19960000
      /* COMMAREA1.EDQBSDS1.SEDQGSN  = WRK_LONG_SERIAL; */              19970000
         COMMAREA_NEW.EDQBSDS1.SEDQGSN  = WRK_LONG_SERIAL;              19980000
                                                 /* EOC CEDS00000642 */ 19990000
       END;                                                             20000000
                                                      /* SOC RC01349 */ 20010000
       ELSE                                                             20020000
         COMMAREA_NEW.EDQBSDS1.SEDQGSN  = WRK_ORIGIN||WRK_SEQ_NO;       20030000
                                                      /* EOC RC01349 */ 20040000
                                                      /* SOC RC01359 */ 20050000
       IF CHECKSEQ = '' THEN                                            20060000
       DO;                                                              20070000
            IF (LENGTH(TRIM(WRK_SEQ_NO)) = 7 &                          20080000
              SUBSTR(WRK_SEQ_NO,1,2) = '00') THEN                       20090000
            COMMAREA_NEW.EDQBSDS1.SEDQGSN=WRK_ORIGIN||                  20100000
                      SUBSTR(WRK_SEQ_NO,3,5);                           20110000
       END;                                           /* EOC RC01359 */ 20120000
   END;                                                                 20130000
                                                      /* EOC RB01320 */ 20140000
 EDQBSDS_PI.IOPUCTY                 = TB_RCBV051.COUNTRY_NUMBER;        20150000
                                                                        20160000
 EDQBSDS_PI.CHSIISC  = '3';                           /* CEDS00000528 */20170000
 IF TB_RCBV051_I.INDNULL(05) = 0 THEN                                   20180000
   EDQBSDS_PI.CSLMMOD = TB_RCBV051.MODEL_NUMBER;                        20190000
                                                                        20200000
 IF TB_RCBV051_I.INDNULL(06) = 0 THEN                                   20210000
   EDQBSDS_PI.BUILT_TO_MODEL_NR = TB_RCBV051.BUILT_TO_MODEL_NR;         20220000
                                                                        20230000
 EDQBSDS_PI.DHSIINS = SUBSTR(TB_RCBV051.INSTALL_DATE,1,4) ||            20240000
                   SUBSTR(TB_RCBV051.INSTALL_DATE,6,2) ||               20250000
                   SUBSTR(TB_RCBV051.INSTALL_DATE,9,2);                 20260000
                                                                        20270000
                                                                        20280000
 IF TB_RCBV051_I.INDNULL(09) = 0 THEN                                   20290000
   EDQBSDS_PI.SRCCCMD.CHSISTM = TB_RCBV051.TYPE_OF_WARRANTY;            20300000
                                                                        20310000
 /*IN CASE OF FW/HB MACHINE & REF DATE IN SECOND PERIOD OF SPLIT WARR*/ 20320000
 IF (TB_RCBV051.F_TYPE_OF_WARRANTY ¬= '' &                              20330000
     TB_RCBV051.WARRANTY_SPLT_DATE ¬= '' &                              20340000
     TB_RCBV051.TYPE_OF_WARRANTY   ¬= TB_RCBV051.F_TYPE_OF_WARRANTY) &  20350000
     (DATE10  >  TB_RCBV051.WARRANTY_SPLT_DATE &                        20360000
     DATE10  <= TB_RCBV051.WARRANTY_EXP_DATE)                           20370000
   THEN                                                                 20380000
        EDQBSDS_PI.SRCCCMD.CHSISTM = TB_RCBV051.F_TYPE_OF_WARRANTY;     20390000
                                                                        20400000
 IF TB_RCBV051_I.INDNULL(10) = 0 THEN                                   20410000
   EDQBSDS_PI.SRCCCMD.SERVICE_DELIV_FLAG =                              20420000
                         TB_RCBV051.SERVICE_DELIV_FLAG;                 20430000
 /* IN CASE OF HB MACHINE, WARR EXP DATE = F_SPLIT_DATE - 1           */20440000
 IF VERIFY (TB_RCBV051.F_TYPE_OF_WARRANTY,WRK_HBTOM) = 0 THEN           20450000
 DO;                                                                    20460000
   SWITCH_PI_MTS_CTR = TRUE;                          /* CEDS00000551 */20470000
   WRK051_WARRANTY_EXP_DATE =                                           20480000
             RCBCS3M_DATE_CALC(TB_RCBV051.WARRANTY_SPLT_DATE,-1);       20490000
   EDQBSDS_PI.DAGREWP = SUBSTR(WRK051_WARRANTY_EXP_DATE,1,4) ||         20500000
                     SUBSTR(WRK051_WARRANTY_EXP_DATE,6,2) ||            20510000
                     SUBSTR(WRK051_WARRANTY_EXP_DATE,9,2);              20520000
 END;                                                                   20530000
 ELSE                                                                   20540000
   EDQBSDS_PI.DAGREWP = SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,1,4) ||     20550000
                     SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,6,2) ||        20560000
                     SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,9,2);          20570000
                                                                        20580000
 EDQBSDS_PI.CUSCODE.ICUSHWU = TB_RCBV051.CUSTOMER_NUMBER;               20590000
 EDQBSDS_PI.CUSCODE.SEDQCSX = '2' || TB_RCBV051.OU_CODE;                20600000
 EDQBSDS_PI.CUSCODE.ICUSANO = TB_RCBV051.CUSTOMER_NR_EXTEND;            20610000
                                                      /* SOC RB01320 */ 20620000
 DATA_ORIGIN2 = '1';                                                    20630000
                                                      /* EOC RB01320 */ 20640000
                                                                        20650000
 EDQBSDS_PI.SRCCCMD.TAKE_CEDS = 'N';                                    20660000
                                                                        20670000
 EDQBSDS_PI.SRCCCMD.IODPDBU.CODPDIV = '2';                              20680000
 EDQBSDS_PI.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV051.OU_CODE;               20690000
                                                                        20700000
 IF TB_RCBV051_I.INDNULL(18) = 0 THEN                                   20710000
   EDQBSDS_PI.DEALER =  TB_RCBV051.DEALER_NUMBER;                       20720000
                                                                        20730000
 EDQBSDS_PI.SRCCCMD.SSRCIND = TB_RCBV051.SOURCE_INDICATOR;              20740000
                                                                        20750000
 CALL RCBCS3M_CALC_SLC;                                                 20760000
 IF ¬SWITCH_PI_MTS_CTR THEN                           /* CEDS00000551 */20770000
 EDQBSDS_PI.BASE_WARRANTY_SLC = EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE;    20780000
                                                                        20790000
 WRK_PIWARR_EFFDATE = EDQBSDS_PI.DDBSEFF;                               20800000
 WRK_PIWARR_ENDDATE = EDQBSDS_PI.DDBSMED;                               20810000
                                                                        20820000
 END RCBCS3M_MOVE_PI_WARR;                                              20830000
1/*********************************************************************/20840000
 /*                                                                   */20850000
 /* MODULE NAME      : RCBCS3M_READ_PI_CTR                            */20860000
 /*                                                                   */20870000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0241    */20880000
 /*                                                                   */20890000
 /*********************************************************************/20900000
0RCBCS3M_READ_PI_CTR : PROC;                                            20910000
                                                                        20920000
0EXEC SQL                                                               20930000
      SELECT COUNTRY_NUMBER  ,                                          20940000
             PRODUCT_TYPE    ,                                          20950000
             ORIGIN          ,                                          20960000
             SEQUENCE_NUMBER ,                                          20970000
             HVP_QUANTITY    ,                                          20980000
             CONTRACT_NUMBER ,                                          20990000
             SERVICE_MODULE_1,                                          21000000
             SERVICE_MODULE_2,                                          21010000
             SERVICE_MODULE_3,                                          21020000
             SERVICE_MODULE_4,                                          21030000
             SERVICE_MODULE_5,                                          21040000
             COVERAGE_START_1,                                          21050000
             COVERAGE_END_1  ,                                          21060000
             COVERAGE_START_2,                                          21070000
             COVERAGE_END_2  ,                                          21080000
             COVERAGE_START_3,                                          21090000
             COVERAGE_END_3  ,                                          21100000
             COVERAGE_START_4,                                          21110000
             COVERAGE_END_4  ,                                          21120000
             COVERAGE_START_5,                                          21130000
             COVERAGE_END_5    ,                                        21140000
             COVERAGE_START_6  ,                                        21150000
             COVERAGE_END_6    ,                                        21160000
             COVERAGE_START_7  ,                                        21170000
             COVERAGE_END_7    ,                                        21180000
             SERVICE_TYPE      ,                                        21190000
             SERVICE_LVL_CODE  ,                                        21200000
             AUTHORISATION_CODE,                                        21210000
             SOURCE_INDICATOR  ,                                        21220000
             LAST_CHANGE_DATE  ,                                        21230000
             EFFECTIVE_DATE    ,                                        21240000
             END_DATE,                                                  21250000
             CUSTOMER_NUMBER                                            21260000
       INTO :TB_RCBV241                                                 21270000
            :TB_RCBV241_I.INDNULL                                       21280000
      FROM   RCBV0241_PI_CTR  T241                                      21290000
      WHERE  T241.COUNTRY_NUMBER  = :REFCTRY                            21300000
        AND  T241.PRODUCT_TYPE    = :REQTYPE                            21310000
  /*    AND  T241.ORIGIN          = :REQORIG            SOC RB01320 */  21320000
  /*    AND  T241.SEQUENCE_NUMBER = :REQSEQN   */                       21330000
                                                 /* SOC CEDS00000727 */ 21340000
  /*    AND  ((T241.ORIGIN          = :WRK_ORIGIN                       21350000
               AND  T241.SEQUENCE_NUMBER = :WRK_SEQ_NO)                 21360000
              OR (T241.ORIGIN||T241.SEQUENCE_NUMBER = :WRK_LONG_SERIAL))21370000
                                                   *//* EOC RB01320 */  21380000
        AND (( T241.ORIGIN        = SUBSTR(:WRK_LONG_SERIAL,1,2)        21390000
        AND  T241.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3))         21400000
        OR ( T241.ORIGIN         = :WRK_ORIGIN                          21410000
        AND  T241.SEQUENCE_NUMBER = :WRK_SEQ_NO))                       21420000
                                                 /* EOC CEDS00000727 */ 21430000
        AND  :DATE10        BETWEEN T241.EFFECTIVE_DATE                 21440000
                                AND T241.END_DATE                       21450000
      WITH UR;                                                          21460000
                                                                        21470000
 SELECT(SQLCA.SQLCODE);                                                 21480000
   WHEN(0) DO;                                                          21490000
     SWITCH_PI_CTR = TRUE;                                              21500000
     IF ¬SWITCH_PI_OCC THEN DO;                                         21510000
      TB_RCBV051.SOURCE_INDICATOR = TB_RCBV241.SOURCE_INDICATOR;        21520000
      TB_RCBV051.CUSTOMER_NUMBER = TB_RCBV241.CUSTOMER_NUMBER;          21530000
      TB_RCBV051.CUSTOMER_NR_EXTEND = '000';                            21540000
      CALL RCBCS3M_PI_CUST;                                             21550000
                                                 /* SOC CEDS00000642 */ 21560000
    /*IF EDQBSHS.REQ.REQKEY.IOPUCTY ¬= EDQBSHS.REQ.TARGCTY THEN */      21570000
      IF COMMAREA.EDQBSHS.REQ.REQKEY.IOPUCTY ¬=                         21580000
                               COMMAREA.EDQBSHS.REQ.TARGCTY THEN        21590000
                                                 /* EOC CEDS00000642 */ 21600000
       CALL RCBCS3M_READ_OUT_OF_CTRY('','');                            21610000
     END;                                                               21620000
     IF OUT_OF_COUNTRY THEN DO;                                         21630000
      WRK_SET_HRS = 'Y';                                                21640000
      IF ¬SWITCH_PI_WARR & (WRK_SLCC ¬= '') THEN DO;                    21650000
        EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;                 21660000
        CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'PRI');                    21670000
        EDQBSDS_PI.SRCCCMD.DDBSEFF =                                    21680000
                           SUBSTR(TB_RCBV241.EFFECTIVE_DATE,1,4) ||     21690000
                           SUBSTR(TB_RCBV241.EFFECTIVE_DATE,6,2) ||     21700000
                           SUBSTR(TB_RCBV241.EFFECTIVE_DATE,9,2);       21710000
                                                                        21720000
        EDQBSDS_PI.SRCCCMD.DDBSMED =                                    21730000
                           SUBSTR(TB_RCBV241.END_DATE,1,4) ||           21740000
                           SUBSTR(TB_RCBV241.END_DATE,6,2) ||           21750000
                           SUBSTR(TB_RCBV241.END_DATE,9,2);             21760000
                                                                        21770000
      END;                                                              21780000
     END;                                                               21790000
     ELSE                                                               21800000
     CALL RCBCS3M_MOVE_PI_CTR;                                          21810000
                                                     /* SOC RB01327 */  21820000
       IF TB_RCBV241.AUTHORISATION_CODE  = 'PA' &                       21830000
          TB_RCBV051.WARRANTY_LIABILITY ¬= 'LEN' THEN                   21840000
            EDQBSDS_PI.SRCCCMD.SSRCIND = 'D' ;       /* DSW SOURCE  */  21850000
                                                     /* EOC RB01327 */  21860000
   END;                                                                 21870000
   WHEN(100)                                                            21880000
    SWITCH_PI_CTR=FALSE;                                                21890000
   OTHERWISE                                                            21900000
     DO;                                                                21910000
       RCBCQES.MESSAGE_NUMBER = 'C225';                                 21920000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     21930000
       WRK_TABLE = 'RCBT0241_PI_CTR';                                   21940000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 21950000
     END;                                                               21960000
 END;                                                                   21970000
                                                /* SOC CEDS00000630 */  21980000
 IF (SWITCH_PI_CTR = TRUE & (¬SWITCH_PI_WARR |¬SWITCH_PI_OCC )) THEN    21990000
 DO;                                                                    22000000
   EDQBSDS_PI.SRCCCMD.CHSISTM = '2';                     /* RC01362 */  22010000
                                                /* EOC CEDS00000630 */  22020000
                                                     /* SOC RB01320 */  22030000
 /* TOM WILL BE ASSIGNED TO 'G' FOR BELOW CONDITIONS                */  22040000
 /* TB_RCBV500              = '';                    /* SOC RC01362 */  22050000
 /* TB_RCBV500_I            = '';                                       22060000
    WRK_PARAMETER_KEY = REFCTRY||'A01';                                 22070000
                                                                        22080000
  EXEC SQL                                                              22090000
   SELECT PARAMETER_VALUE                                               22100000
   INTO :TB_RCBV500.PARAMETER_VALUE :WRK_INDNULL                        22110000
   FROM RCBV0500_PARM  T500                                             22120000
   WHERE T500.PARAMETER_NUMBER = 'RCB103'                               22130000
   AND T500.PARAMETER_KEY = :WRK_PARAMETER_KEY;                         22140000
  SELECT (SQLCA.SQLCODE);                                               22150000
     WHEN(0)                                                            22160000
        DO;                                                             22170000
            CALL  CHECK_LEN_AUTH_CODE;                                  22180000
        END;                                                            22190000
     WHEN(100);                                                         22200000
      OTHERWISE                                                         22210000
          DO;                                                           22220000
             RCBCQES.MESSAGE_NUMBER = 'C263';                           22230000
             WRK_SQLCODE = SQLCA.SQLCODE;                               22240000
             WRK_TABLE = 'RCBV0500_PARM';                               22250000
            CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);            22260000
           END;                                                         22270000
  END; */                                              /* EOC RC01362 */22280000
                                                       /* EOC RB01320 */22290000
 END;                                                 /* CEDS00000630 */22300000
 END RCBCS3M_READ_PI_CTR;                                               22310000
                                                       /* SOC RB01320 */22320000
1/*********************************************************************/22330000
 /*                                                                   */22340000
 /* MODULE NAME      : CHECK_LEN_AUTH_CODE                            */22350000
 /*                                                                   */22360000
 /* DESCRIPTION      : IF RCB103 IS SET, CHECK FOR LENOVO M/C AND     */22370000
 /*                    ACTIVE CONTRACT OR ACTIVE CONTRACT POST WARR   */22380000
 /*                    TOM WILL BE ASSIGNED G OR ELSE 2.              */22390000
 /*                                                                   */22400000
 /*********************************************************************/22410000
 /*0CHECK_LEN_AUTH_CODE : PROC;                        /* SOC RC01362 */22420000
                                                                        22430000
 /*IF TB_RCBV500.PARAMETER_VALUE = 'Y' THEN                             22440000
       DO;                                                              22450000
           IF (SUBSTR(TB_RCBV241.AUTHORISATION_CODE,1,3) = 'LEN' &      22460000
                     (¬SWITCH_PI_WARR)) THEN                            22470000
                DO;                                                     22480000
                      EDQBSDS_PI.SRCCCMD.CHSISTM = 'G';                 22490000
                END;                                                    22500000
           ELSE                                                         22510000
                  EDQBSDS_PI.SRCCCMD.CHSISTM = '2';                     22520000
        END;                                                            22530000
  ELSE                                                                  22540000
      EDQBSDS_PI.SRCCCMD.CHSISTM = '2';                                 22550000
                                                                        22560000
 END  CHECK_LEN_AUTH_CODE;                           *//* EOC RC01362 */22570000
                                                       /* EOC RB01320 */22580000
1/*********************************************************************/22590000
 /*                                                                   */22600000
 /* MODULE NAME      : RCBCS3M_CALC_SLC                               */22610000
 /*                                                                   */22620000
 /* DESCRIPTION      : DETERMINE WHICH SLC TO USE FOR WARRANTY OR     */22630000
 /*                    PER CALL.                                      */22640000
 /*                                                                   */22650000
 /*********************************************************************/22660000
0RCBCS3M_CALC_SLC : PROC;                                               22670000
                                                                        22680000
 WRK_1PERD_END_DATE = '';                                               22690000
                                                                        22700000
 IF DATE10 <= TB_RCBV051.WARRANTY_EXP_DATE THEN                         22710000
  DO;                                                                   22720000
   EDQBSDS_PI.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV051.INSTALL_DATE,1,4) ||  22730000
                                SUBSTR(TB_RCBV051.INSTALL_DATE,6,2) ||  22740000
                                SUBSTR(TB_RCBV051.INSTALL_DATE,9,2);    22750000
                                                                        22760000
   EDQBSDS_PI.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,1,4)22770000
                            || SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,6,2) 22780000
                            || SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,9,2);22790000
                                                                        22800000
    IF OUT_OF_COUNTRY THEN DO;                                          22810000
      WRK_SET_HRS = 'Y';                                                22820000
      IF WRK_SLC1 ¬= '' THEN DO;                                        22830000
        EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = WRK_SLC1;                 22840000
        CALL RCBCS3M_READ_SERV_COND(WRK_SLC1,'PRI');                    22850000
      END;                                                              22860000
    END;                                                                22870000
    ELSE DO;                                                            22880000
    IF TB_RCBV051_I.INDNULL(11) = 0 THEN                                22890000
     DO;                                                                22900000
      WRK_SET_HRS = 'Y';                                                22910000
      EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE =                             22920000
                           TB_RCBV051.SERVICE_LVL_CODE_1;               22930000
      CALL RCBCS3M_READ_SERV_COND(TB_RCBV051.SERVICE_LVL_CODE_1,'PRI'); 22940000
     END;                                                               22950000
    END;                                                                22960000
                                                                        22970000
    IF TB_RCBV051_I.INDNULL(12) = 0 THEN                                22980000
     DO;                                                                22990000
      IF DATE10 >= TB_RCBV051.WARRANTY_SPLT_DATE THEN                   23000000
       DO;                                                              23010000
         EDQBSDS_PI.SRCCCMD.DDBSEFF =                                   23020000
                         SUBSTR(TB_RCBV051.WARRANTY_SPLT_DATE,1,4)      23030000
                      || SUBSTR(TB_RCBV051.WARRANTY_SPLT_DATE,6,2)      23040000
                      || SUBSTR(TB_RCBV051.WARRANTY_SPLT_DATE,9,2);     23050000
         IF OUT_OF_COUNTRY THEN DO                                      23060000
           WRK_SET_HRS = 'Y';                                           23070000
           IF VERIFY (TB_RCBV051.F_TYPE_OF_WARRANTY,WRK_HBTOM) = 0      23080000
           THEN DO;                                                     23090000
            EDQBSDS_PI.SRCCCMD.CHSISTM = '3';       /* CEDS00000521 */  23100000
            IF WRK_SLCC ¬= '' THEN DO;                                  23110000
             EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;            23120000
             CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'PRI');               23130000
            END;                                                        23140000
           END;                                                         23150000
           ELSE DO;                                                     23160000
            IF WRK_SLC2 ¬= '' THEN DO;                                  23170000
             EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = WRK_SLC2;            23180000
             CALL RCBCS3M_READ_SERV_COND(WRK_SLC2,'PRI');               23190000
            END;                                                        23200000
           END;                                                         23210000
         END;                                                           23220000
         ELSE DO;                                                       23230000
         IF TB_RCBV051_I.INDNULL(13) = 0 THEN                           23240000
          DO;                                                           23250000
           WRK_SET_HRS = 'Y';                                           23260000
           EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE =                        23270000
                                     TB_RCBV051.SERVICE_LVL_CODE_2;     23280000
           CALL RCBCS3M_READ_SERV_COND(TB_RCBV051.SERVICE_LVL_CODE_2,   23290000
                                       'PRI');                          23300000
          END;                                                          23310000
         END;                                                           23320000
       END;                                                             23330000
      ELSE                                                              23340000
       DO;                                                              23350000
        WRK_1PERD_END_DATE =                                            23360000
               RCBCS3M_DATE_CALC(TB_RCBV051.WARRANTY_SPLT_DATE,-1);     23370000
        EDQBSDS_PI.SRCCCMD.DDBSMED = SUBSTR(WRK_1PERD_END_DATE,1,4)     23380000
                                  || SUBSTR(WRK_1PERD_END_DATE,6,2)     23390000
                                  || SUBSTR(WRK_1PERD_END_DATE,9,2);    23400000
       END;                                                             23410000
     END;                                                               23420000
                                                                        23430000
  END;                                                                  23440000
 ELSE                                                                   23450000
  DO;                                                                   23460000
   EDQBSDS_PI.SRCCCMD.CHSISTM = '3';                                    23470000
                                                                        23480000
   WRK051_PRCL_STRT_DATE  =                                             23490000
                    RCBCS3M_DATE_CALC(TB_RCBV051.WARRANTY_EXP_DATE,1);  23500000
   EDQBSDS_PI.SRCCCMD.DDBSEFF = SUBSTR(WRK051_PRCL_STRT_DATE,1,4)       23510000
                          || SUBSTR(WRK051_PRCL_STRT_DATE,6,2)          23520000
                          || SUBSTR(WRK051_PRCL_STRT_DATE,9,2);         23530000
                                                                        23540000
   EDQBSDS_PI.SRCCCMD.DDBSMED = '99991231';                             23550000
                                                                        23560000
   IF OUT_OF_COUNTRY THEN DO;                                           23570000
     WRK_SET_HRS = 'Y';                                                 23580000
     IF WRK_SLCC ¬= '' THEN DO;                                         23590000
       EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;                  23600000
       CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'PRI');                     23610000
     END;                                                               23620000
   END;                                                                 23630000
   ELSE DO;                                                             23640000
   IF TB_RCBV051_I.INDNULL(19) = 0 THEN                                 23650000
   DO;                                                                  23660000
    WRK_SET_HRS = 'Y';                                                  23670000
    EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE =                               23680000
                              TB_RCBV051.SERVICE_LVL_CODE_C;            23690000
    CALL RCBCS3M_READ_SERV_COND(TB_RCBV051.SERVICE_LVL_CODE_C,'PRI');   23700000
   END;                                                                 23710000
   END;                                                                 23720000
  END;                                                                  23730000
                                                                        23740000
 END RCBCS3M_CALC_SLC;                                                  23750000
1/*********************************************************************/23760000
 /*                                                                   */23770000
 /* MODULE NAME      : RCBCS3M_MOVE_PI_CTR                            */23780000
 /*                                                                   */23790000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0241    */23800000
 /*                    TO THE COMMAREA FIELDS.                        */23810000
 /*                                                                   */23820000
 /*********************************************************************/23830000
0RCBCS3M_MOVE_PI_CTR: PROC;                                             23840000
                                                                        23850000
 EDQBSDS_PI.CALLBACK(*) ='';                                            23860000
 EDQBSDS_PI.ARRIVAL(*) ='';                                             23870000
 EDQBSDS_PI.FIX(*) ='';                                                 23880000
 EDQBSDS_PI.CTY(*) ='';                                                 23890000
 EDQBSDS_PI.ONSITE(*) ='';                                              23900000
 EDQBSDS_PI.SRCCCMD.DESCRIPTION = '';                                   23910000
 EDQBSDS_PI.SRCCCMD.SERVICE_DLVR_METHD = '';                            23920000
 EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = '';                              23930000
 EDQBSDS_PI.SRCCCMD.DESCRIPTION = '';                                   23940000
 EDQBSDS_PI.SRCCCMD.TIMEZERO = '';                                      23950000
 EDQBSDS_PI.SRCCCMD.RAGRWCP(*) = '';                                    23960000
 EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'N';                              23970000
                                                                        23980000
 EDQBSDS_PI.IHSITOS.CSLMTYP         = TB_RCBV241.PRODUCT_TYPE;          23990000
                                                      /* SOC RB01320 */ 24000000
 /*EDQBSDS_PI.IHSITOS.IHSIMID.IOLCPLM = TB_RCBV241.ORIGIN; */           24010000
 /*EDQBSDS_PI.IHSITOS.IHSIMID.IHSINBR = TB_RCBV241.SEQUENCE_NUMBER;  */ 24020000
                                                 /* SOC CEDS00000727 */ 24030000
   IF WRK_ORIGIN ¬= '' THEN                                             24040000
   DO;                                           /* EOC CEDS00000727 */ 24050000
   EDQBSDS_PI.IHSITOS.IHSIMID.IOLCPLM = WRK_ORIGIN;                     24060000
   EDQBSDS_PI.IHSITOS.IHSIMID.IHSINBR = WRK_SEQ_NO;                     24070000
   END;                                          /* SOC CEDS00000727 */ 24080000
   ELSE                                                                 24090000
   DO;                                                                  24100000
   EDQBSDS_PI.IHSITOS.IHSIMID.IOLCPLM = SUBSTR(WRK_LONG_SERIAL,1,2);    24110000
   EDQBSDS_PI.IHSITOS.IHSIMID.IHSINBR = SUBSTR(WRK_LONG_SERIAL,3);      24120000
   END;                                          /* EOC CEDS00000727 */ 24130000
 IF SWITCH_3317_S3 THEN                                                 24140000
   DO;                                                                  24150000
     IF WRK_LONG_SERIAL ¬= '' THEN                                      24160000
       DO;                                                              24170000
                                                 /* SOC CEDS00000642 */ 24180000
       /*COMMAREA1.EDQBSDS1.SEDQGSN  = WRK_LONG_SERIAL;*/               24190000
         COMMAREA_NEW.EDQBSDS1.SEDQGSN  = WRK_LONG_SERIAL;              24200000
                                                 /* EOC CEDS00000642 */ 24210000
       END;                                                             24220000
                                                      /* SOC RC01349 */ 24230000
        ELSE                                                            24240000
         COMMAREA_NEW.EDQBSDS1.SEDQGSN  = WRK_ORIGIN||WRK_SEQ_NO;       24250000
                                                      /* EOC RC01349 */ 24260000
                                                      /* SOC RC01359 */ 24270000
        IF CHECKSEQ = '' THEN                                           24280000
         DO;                                                            24290000
            IF (LENGTH(TRIM(WRK_SEQ_NO)) = 7 &                          24300000
                 SUBSTR(WRK_SEQ_NO,1,2) = '00') THEN                    24310000
                COMMAREA_NEW.EDQBSDS1.SEDQGSN=WRK_ORIGIN||              24320000
                     SUBSTR(WRK_SEQ_NO,3,5);                            24330000
         END;                                        /* EOC RC01359 */  24340000
   END;                                                                 24350000
                                                      /* EOC RB01320 */ 24360000
 EDQBSDS_PI.IOPUCTY                 = TB_RCBV241.COUNTRY_NUMBER;        24370000
                                                                        24380000
 EDQBSDS_PI.QCUOHVP = TB_RCBV241.HVP_QUANTITY;                          24390000
                                                                        24400000
 EDQBSDS_PI.SRCCCMD.TAKE_CEDS = 'Y';                                    24410000
                                                                        24420000
 IF ((TB_RCBV241_I.INDNULL(12)                                          24430000
    + TB_RCBV241_I.INDNULL(13)                                          24440000
    + TB_RCBV241_I.INDNULL(14)                                          24450000
    + TB_RCBV241_I.INDNULL(15)                                          24460000
    + TB_RCBV241_I.INDNULL(16)                                          24470000
    + TB_RCBV241_I.INDNULL(17)                                          24480000
    + TB_RCBV241_I.INDNULL(18)                                          24490000
    + TB_RCBV241_I.INDNULL(19)                                          24500000
    + TB_RCBV241_I.INDNULL(20)                                          24510000
    + TB_RCBV241_I.INDNULL(21)                                          24520000
    + TB_RCBV241_I.INDNULL(22)                                          24530000
    + TB_RCBV241_I.INDNULL(23)                                          24540000
    + TB_RCBV241_I.INDNULL(24)                                          24550000
    + TB_RCBV241_I.INDNULL(25)                                          24560000
    = -14)                                                              24570000
    | (TB_RCBV241.COVERAGE_START_1 = '00.00.00'                         24580000
    &  TB_RCBV241.COVERAGE_START_2 = '00.00.00'                         24590000
    &  TB_RCBV241.COVERAGE_START_3 = '00.00.00'                         24600000
    &  TB_RCBV241.COVERAGE_START_4 = '00.00.00'                         24610000
    &  TB_RCBV241.COVERAGE_START_5 = '00.00.00'                         24620000
    &  TB_RCBV241.COVERAGE_START_6 = '00.00.00'                         24630000
    &  TB_RCBV241.COVERAGE_START_7 = '00.00.00'                         24640000
    &  TB_RCBV241.COVERAGE_END_1   = '00.00.00'                         24650000
    &  TB_RCBV241.COVERAGE_END_2   = '00.00.00'                         24660000
    &  TB_RCBV241.COVERAGE_END_3   = '00.00.00'                         24670000
    &  TB_RCBV241.COVERAGE_END_4   = '00.00.00'                         24680000
    &  TB_RCBV241.COVERAGE_END_5   = '00.00.00'                         24690000
    &  TB_RCBV241.COVERAGE_END_6   = '00.00.00'                         24700000
    &  TB_RCBV241.COVERAGE_END_7   = '00.00.00'))                       24710000
   THEN                                                                 24720000
       WRK_SET_HRS = 'Y';       /* SET HOURS FROM SLC */                24730000
   ELSE                                                                 24740000
       WRK_SET_HRS = 'N';                                               24750000
                                                                        24760000
 IF TB_RCBV051.WARRANTY_EXP_DATE ¬= '' THEN                             24770000
   DO;                                                                  24780000
      IF DATE10 > TB_RCBV051.WARRANTY_EXP_DATE                          24790000
       | SUBSTR(TB_RCBV051.CUSTOMER_NUMBER,1,2) = 'CI' THEN             24800000
       DO;                                                              24810000
         IF TB_RCBV051.TYPE_OF_MAINT = 'G' THEN                         24820000
            EDQBSDS_PI.SRCCCMD.CHSISTM  = TB_RCBV051.TYPE_OF_MAINT;     24830000
         ELSE                                                           24840000
            EDQBSDS_PI.SRCCCMD.CHSISTM  = '2';                          24850000
       END;                                                             24860000
   END;                                                                 24870000
 ELSE                                                                   24880000
     EDQBSDS_PI.SRCCCMD.CHSISTM  = '2';                                 24890000
                                                                        24900000
 IF TB_RCBV241_I.INDNULL(06) = 0 THEN                                   24910000
   EDQBSDS_PI.SRCCCMD.IAGRNBR = TB_RCBV241.CONTRACT_NUMBER;             24920000
                                                                        24930000
 IF TB_RCBV241_I.INDNULL(07) = 0 THEN                                   24940000
   EDQBSDS_PI.SRCCCMD.RHSIESA(1).IHSIESA = TB_RCBV241.SERVICE_MODULE_1; 24950000
                                                                        24960000
 IF TB_RCBV241_I.INDNULL(08) = 0 THEN                                   24970000
   EDQBSDS_PI.SRCCCMD.RHSIESA(2).IHSIESA = TB_RCBV241.SERVICE_MODULE_2; 24980000
                                                                        24990000
 IF TB_RCBV241_I.INDNULL(09) = 0 THEN                                   25000000
   EDQBSDS_PI.SRCCCMD.RHSIESA(3).IHSIESA = TB_RCBV241.SERVICE_MODULE_3; 25010000
                                                                        25020000
 IF TB_RCBV241_I.INDNULL(10) = 0 THEN                                   25030000
   EDQBSDS_PI.SRCCCMD.RHSIESA(4).IHSIESA = TB_RCBV241.SERVICE_MODULE_4; 25040000
                                                                        25050000
 IF TB_RCBV241_I.INDNULL(11) = 0 THEN                                   25060000
   EDQBSDS_PI.SRCCCMD.RHSIESA(5).IHSIESA = TB_RCBV241.SERVICE_MODULE_5; 25070000
                                                                        25080000
 IF WRK_SET_HRS = 'N' THEN                                              25090000
 DO;                                                                    25100000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(1).DAGRMFR =                              25110000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_1);25120000
                                                                        25130000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(1).DAGRMTO =                              25140000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_1);  25150000
                                                                        25160000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(2).DAGRMFR =                              25170000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_2);25180000
                                                                        25190000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(2).DAGRMTO =                              25200000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_2);  25210000
                                                                        25220000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(3).DAGRMFR =                              25230000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_3);25240000
                                                                        25250000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(3).DAGRMTO =                              25260000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_3);  25270000
                                                                        25280000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(4).DAGRMFR =                              25290000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_4);25300000
                                                                        25310000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(4).DAGRMTO =                              25320000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_4);  25330000
                                                                        25340000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(5).DAGRMFR =                              25350000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_5);25360000
                                                                        25370000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(5).DAGRMTO =                              25380000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_5);  25390000
                                                                        25400000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(6).DAGRMFR =                              25410000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_6);25420000
                                                                        25430000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(6).DAGRMTO =                              25440000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_6);  25450000
                                                                        25460000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(7).DAGRMFR =                              25470000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_7);25480000
                                                                        25490000
   EDQBSDS_PI.SRCCCMD.RAGRWCP(7).DAGRMTO =                              25500000
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_7);  25510000
 END;                                                                   25520000
                                                                        25530000
 IF TB_RCBV241_I.INDNULL(28) = 0 THEN                                   25540000
   EDQBSDS_PI.SRCCCMD.IAGRTCN = TB_RCBV241.AUTHORISATION_CODE;          25550000
                                                                        25560000
 EDQBSDS_PI.SRCCCMD.SSRCIND = TB_RCBV241.SOURCE_INDICATOR;              25570000
                                                                        25580000
 EDQBSDS_PI.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV241.EFFECTIVE_DATE,1,4) ||  25590000
                           SUBSTR(TB_RCBV241.EFFECTIVE_DATE,6,2) ||     25600000
                           SUBSTR(TB_RCBV241.EFFECTIVE_DATE,9,2);       25610000
                                                                        25620000
 EDQBSDS_PI.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV241.END_DATE,1,4) ||        25630000
                           SUBSTR(TB_RCBV241.END_DATE,6,2) ||           25640000
                           SUBSTR(TB_RCBV241.END_DATE,9,2);             25650000
                                                                        25660000
 IF TB_RCBV241_I.INDNULL(27) = 0 THEN DO;                               25670000
  EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV241.SERVICE_LVL_CODE;    25680000
  CALL RCBCS3M_READ_SERV_COND(TB_RCBV241.SERVICE_LVL_CODE,'PRI');       25690000
 END;                                                                   25700000
 ELSE                                                                   25710000
 IF EDQBSDS_PI.SRCCCMD.SSRCIND = 'P' THEN                               25720000
   CALL RCBCS3M_READ_TRANS_PEW;                                         25730000
                                                                        25740000
 IF TB_RCBV241.CONTRACT_NUMBER = '61P7319'                              25750000
 |  TB_RCBV241.CONTRACT_NUMBER = '61P7320'                              25760000
 |  TB_RCBV241.CONTRACT_NUMBER = '61P7323'                              25770000
 |  TB_RCBV241.CONTRACT_NUMBER = '61P7324' THEN                         25780000
   CALL RCBCS3M_READ_PI_SERV;                                           25790000
                                                                        25800000
 IF EDQBSDS_PI.SRCCCMD.SERVICE_DLVR_METHD = '' THEN                     25810000
   DO;                                                                  25820000
     EDQBSDS_PI.SRCCCMD.SERVICE_DLVR_METHD =  TB_RCBV241.SERVICE_TYPE;  25830000
   END;                                                                 25840000
  /*EDQBSDS_PI.SERV_EXTENSION(*) = '';                  CEDS00000530 */ 25850000
                                                                        25860000
 END RCBCS3M_MOVE_PI_CTR;                                               25870000
1/********************************************************************/ 25880000
 /*                                                                  */ 25890000
 /* MODULE NAME      : RCBCS3M_MOVE_PI_SERV_EXTN                     */ 25900000
 /*                                                                  */ 25910000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0650   */ 25920000
 /*                    TO THE COMMAREA FIELDS.                       */ 25930000
 /*                                                                  */ 25940000
 /********************************************************************/ 25950000
0RCBCS3M_MOVE_PI_SERV_EXTN: PROC;                                       25960000
                                                                        25970000
 DCL X FIXED BIN(31) INIT(1);                                           25980000
 /*DCL J FIXED BIN(31) INIT(1);*/                         /* RC01326 */ 25990000
                                                                        26000000
                                                      /* SOC RC01326 */ 26010000
  IF TEMP_SERV_EXTENSION(1)= '  '  THEN                                 26020000
   DO;                                                                  26030000
    J      = 1;                                                         26040000
   END;                                                                 26050000
  IF EDQBSDS_PI.SERV_EXTENSION(1) = '  '  THEN                          26060000
   DO;                                                                  26070000
    WRK_SP = 1;                                                         26080000
   END;                                                                 26090000
                                                                        26100000
  IF J ¬= 1 THEN                                                        26110000
  DO;                                                 /* EOC RC01326 */ 26120000
  IF TB_RCBV650_I.INDNULL(13)  = 0    THEN                              26130000
                                                      /* SOC RC01326 */ 26140000
 /*DO WHILE (J <= 5 & (SUBSTR(TB_RCBV650.SERVICE_EXTENSION,X,3) ¬=' '));26150000
     EDQBSDS_PI.SERV_EXTENSION(J) =                                     26160000
                       SUBSTR(TB_RCBV650.SERVICE_EXTENSION,X,3); */     26170000
   DO WHILE (J <= 6 & (SUBSTR(TB_RCBV650.SERVICE_EXTENSION,X,3) ¬=' '));26180000
                                                                        26190000
    IF J <= 5 THEN                                                      26200000
     DO;                                                                26210000
      TEMP_SERV_EXTENSION(J) = SUBSTR(TB_RCBV650.SERVICE_EXTENSION,X,3);26220000
     END;                                                               26230000
    ELSE                                                                26240000
     DO;                                                                26250000
      EDQBSDS_PI.SERV_EXTENSION(5) = 'ME>';                             26260000
      TEMP_SERV_EXTENSION(5) = 'ME>';                                   26270000
     END;                                                               26280000
                                                       /* EOC RC01326 */26290000
     X = X + 4;                                                         26300000
     J = J + 1;                                                         26310000
   END;                                                                 26320000
   END;                                                    /* RC01326 */26330000
  ELSE                                                                  26340000
                                                       /* SOC RC01326 */26350000
  /*EDQBSDS_PI.SERV_EXTENSION(*) = '';*/                                26360000
   DO WHILE (J <= 5 & (SUBSTR(TB_RCBV650.SERVICE_EXTENSION,X,3)¬= ' '));26370000
     TEMP_SERV_EXTENSION(J) =                                           26380000
               SUBSTR(TB_RCBV650.SERVICE_EXTENSION,X,3);                26390000
                                                                        26400000
                                                                        26410000
 /* CNT_PI_SE = J - 1;*/                                                26420000
     J = J + 1;                                                         26430000
     X = X + 4;                                                         26440000
   END;                                                                 26450000
  DCL M FIXED BIN(31) INIT(1);                                          26460000
  DO WHILE( WRK_SP <= 5 & (SUBSTR(TB_RCBV650.SERVICE_EXTENSION,M,3)     26470000
           ¬= ' '));                                                    26480000
   IF WRK_SP <= 5 THEN                                                  26490000
   DO;                                                                  26500000
    EDQBSDS_PI.SERV_EXTENSION(WRK_SP) =                                 26510000
                        SUBSTR(TB_RCBV650.SERVICE_EXTENSION,M,3);       26520000
   END;                                                                 26530000
   ELSE IF WRK_SP >=6 THEN                                              26540000
      EDQBSDS_PI.SERV_EXTENSION(WRK_SP) = 'ME>';                        26550000
    WRK_SP = WRK_SP + 1;                                                26560000
    M      = M      + 4;                                                26570000
                                                       /* EOC RC01326 */26580000
  END;                                                    /* S1316962 */26581020
 END RCBCS3M_MOVE_PI_SERV_EXTN;                                         26590000
1/*********************************************************************/26600000
 /*                                                                   */26610000
 /* MODULE NAME      : RCBCS3M_READ_PI_SERV                           */26620000
 /*                                                                   */26630000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0211    */26640000
 /*                                                                   */26650000
 /*********************************************************************/26660000
0RCBCS3M_READ_PI_SERV : PROC;                                           26670000
                                                                        26680000
0EXEC SQL                                                               26690000
      SELECT QTY_MU_CONTRACTED                                          26700000
       INTO :TB_RCBV211.QTY_MU_CONTRACTED                               26710000
            :WRK_INDNULL                                                26720000
      FROM   RCBV0211_PI_SERV T211                                      26730000
      WHERE  T211.COUNTRY_NUMBER  = :REFCTRY                            26740000
        AND  T211.CONTRACT_NUMBER = :TB_RCBV241.CONTRACT_NUMBER         26750000
        AND  T211.CUSTOMER_NUMBER = :TB_RCBV051.CUSTOMER_NUMBER         26760000
        AND  :DATE10        BETWEEN T211.EFFECTIVE_DATE                 26770000
                                AND T211.END_DATE                       26780000
      WITH UR;                                                          26790000
                                                                        26800000
 SELECT(SQLCA.SQLCODE);                                                 26810000
   WHEN(0)                                                              26820000
     SELECT (TB_RCBV211.QTY_MU_CONTRACTED);                             26830000
      WHEN(0);                                                          26840000
      WHEN(1)                                                           26850000
      EDQBSDS_PI.SRCCCMD.DESCRIPTION = '1 ACCIDENTAL DAMAGE CLAIM USED '26860000
                                     || EDQBSDS_PI.SRCCCMD.DESCRIPTION; 26870000
      WHEN(2)                                                           26880000
       EDQBSDS_PI.SRCCCMD.DESCRIPTION =                                 26890000
         'BOTH ACCIDENTAL DAMAGE CLAIMS USED-CHARGEABLE CALL';          26900000
       OTHERWISE;                                                       26910000
     END;                                                               26920000
   WHEN(100);                                                           26930000
   OTHERWISE                                                            26940000
     DO;                                                                26950000
       RCBCQES.MESSAGE_NUMBER = 'C226';                                 26960000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     26970000
       WRK_TABLE = 'RCBT0211_PI_SERV';                                  26980000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 26990000
     END;                                                               27000000
 END;                                                                   27010000
                                                                        27020000
 END RCBCS3M_READ_PI_SERV;                                              27030000
1/*********************************************************************/27040000
 /*                                                                   */27050000
 /* MODULE NAME      : RCBCS3M_READ_SERV_COND                         */27060000
 /*                                                                   */27070000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0470    */27080000
 /*                                                                   */27090000
 /*********************************************************************/27100000
0RCBCS3M_READ_SERV_COND: PROC (SLC,FLOW);                               27110000
                                                                        27120000
 DCL SLC      CHAR(03);                                                 27130000
 DCL FLOW     CHAR(03);                                                 27140000
                                                                        27150000
 TB_RCBV470               = '';                                         27160000
 TB_RCBV470_I.INDNULL(*)  = 0;                                          27170000
 TB_RCBV470.SERVICE_LVL_CODE = SLC;                                     27180000
                                                                        27190000
 IF OUT_OF_COUNTRY THEN                         /* SOC CEDS00000616 */  27200000
 DO;                                                                    27210000
 CALL RCBISRN (ADDR(TB_RCBV470),                                        27220000
               ADDR(TB_RCBV470_I),                                      27230000
               ADDR(RETURN_AREA_BB),                                    27240000
               ACMCTRY);                                                27250000
 END;                                                                   27260000
 ELSE                                                                   27270000
 DO;                                            /* EOC CEDS00000616 */  27280000
 CALL RCBISRN (ADDR(TB_RCBV470),                                        27290000
               ADDR(TB_RCBV470_I),                                      27300000
               ADDR(RETURN_AREA_BB),                                    27310000
               REFCTRY);                                                27320000
 END;                                           /*  CEDS00000616 */     27330000
                                                                        27340000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   27350000
 WHEN (0)                                                               27360000
   DO;                                                                  27370000
    SELECT(FLOW);                                                       27380000
     WHEN('PRI') CALL RCBCS3M_MOVE_SERV_COND_PI;                        27390000
     WHEN('BAU') CALL RCBCS3M_MOVE_SERV_COND_BAU;                       27400000
     OTHERWISE;                                                         27410000
    END;                                                                27420000
   END;                                                                 27430000
 OTHERWISE                                                              27440000
   DO;                                                                  27450000
     RCBCQES.MESSAGE_NUMBER = 'C227';                                   27460000
     WRK_SQLCODE = SQLCA_R.SQLCODE;                                     27470000
     WRK_TABLE = 'RCBV0470_SERV_COND';                                  27480000
     CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                   27490000
   END;                                                                 27500000
 END;                                                                   27510000
                                                                        27520000
 END RCBCS3M_READ_SERV_COND;                                            27530000
1/*********************************************************************/27540000
 /*                                                                   */27550000
 /* MODULE NAME      : RCBCS3M_MOVE_SERV_COND_BAU                     */27560000
 /*                                                                   */27570000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0470    */27580000
 /*                    TO THE BAU STUCTURE FIELDS.                    */27590000
 /*                                                                   */27600000
 /*********************************************************************/27610000
0RCBCS3M_MOVE_SERV_COND_BAU : PROC;                                     27620000
                                                                        27630000
 IF WRK_SET_HRS = 'Y' THEN                                              27640000
   DO;                                                                  27650000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(1).DAGRMFR =                         27660000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_1);27670000
                                                                        27680000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(1).DAGRMTO =                         27690000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_1);  27700000
                                                                        27710000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(2).DAGRMFR =                         27720000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_2);27730000
                                                                        27740000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(2).DAGRMTO =                         27750000
                            R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_2); 27760000
                                                                        27770000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(3).DAGRMFR =                         27780000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_3);27790000
                                                                        27800000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(3).DAGRMTO =                         27810000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_3);  27820000
                                                                        27830000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(4).DAGRMFR =                         27840000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_4);27850000
                                                                        27860000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(4).DAGRMTO =                         27870000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_4);  27880000
                                                                        27890000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(5).DAGRMFR =                         27900000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_5);27910000
                                                                        27920000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(5).DAGRMTO =                         27930000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_5);  27940000
                                                                        27950000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(6).DAGRMFR =                         27960000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_6);27970000
                                                                        27980000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(6).DAGRMTO =                         27990000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_6);  28000000
                                                                        28010000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(7).DAGRMFR =                         28020000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_7);28030000
                                                                        28040000
       EDQBSDS_BAU.SRCCCMD.RAGRWCP(7).DAGRMTO =                         28050000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_7);  28060000
 END;                                                                   28070000
                                                                        28080000
 EDQBSDS_BAU.SRCCCMD.SERVICE_DLVR_METHD = TB_RCBV470.SERVICE_DLVR_METHD;28090000
                                                                        28100000
 IF TB_RCBV470_I.INDNULL(17) = 0 THEN                                   28110000
   EDQBSDS_BAU.SRCCCMD.TIMEZERO = TB_RCBV470.TIME_ZERO_IND;             28120000
                                                                        28130000
 EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'N';                             28140000
                                                                        28150000
 IF TB_RCBV470_I.INDNULL(18) = 0                                        28160000
 THEN DO;                                                               28170000
   EDQBSDS_BAU.CBK_TIMESPAN_QTY(1)  = TB_RCBV470.CONTACT_TIME_QTY_1;    28180000
   EDQBSDS_BAU.CBK_TIMESPAN_UNIT(1) = TB_RCBV470.CONTACT_TIME_UNT_1;    28190000
   EDQBSDS_BAU.CBK_TIMESPAN_COM(1)  = TB_RCBV470.CONTACT_TIME_COM_1;    28200000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28210000
 END;                                                                   28220000
 IF TB_RCBV470_I.INDNULL(21) = 0                                        28230000
 THEN DO;                                                               28240000
   EDQBSDS_BAU.CBK_TIMESPAN_QTY(2)  = TB_RCBV470.CONTACT_TIME_QTY_2;    28250000
   EDQBSDS_BAU.CBK_TIMESPAN_UNIT(2) = TB_RCBV470.CONTACT_TIME_UNT_2;    28260000
   EDQBSDS_BAU.CBK_TIMESPAN_COM(2)  = TB_RCBV470.CONTACT_TIME_COM_2;    28270000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28280000
 END;                                                                   28290000
 IF TB_RCBV470_I.INDNULL(24) = 0                                        28300000
 THEN DO;                                                               28310000
   EDQBSDS_BAU.CBK_TIMESPAN_QTY(3)  = TB_RCBV470.CONTACT_TIME_QTY_3;    28320000
   EDQBSDS_BAU.CBK_TIMESPAN_UNIT(3) = TB_RCBV470.CONTACT_TIME_UNT_3;    28330000
   EDQBSDS_BAU.CBK_TIMESPAN_COM(3)  = TB_RCBV470.CONTACT_TIME_COM_3;    28340000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28350000
 END;                                                                   28360000
 IF TB_RCBV470_I.INDNULL(27) = 0                                        28370000
 THEN DO;                                                               28380000
   EDQBSDS_BAU.TAT_TIMESPAN_QTY(1)  = TB_RCBV470.ONSITE_RESP_QTY_1;     28390000
   EDQBSDS_BAU.TAT_TIMESPAN_UNIT(1) = TB_RCBV470.ONSITE_RESP_UNT_1;     28400000
   EDQBSDS_BAU.TAT_TIMESPAN_COM(1)  = TB_RCBV470.ONSITE_RESP_COM_1;     28410000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28420000
 END;                                                                   28430000
 IF TB_RCBV470_I.INDNULL(30) = 0                                        28440000
 THEN DO;                                                               28450000
   EDQBSDS_BAU.TAT_TIMESPAN_QTY(2)  = TB_RCBV470.ONSITE_RESP_QTY_2;     28460000
   EDQBSDS_BAU.TAT_TIMESPAN_UNIT(2) = TB_RCBV470.ONSITE_RESP_UNT_2;     28470000
   EDQBSDS_BAU.TAT_TIMESPAN_COM(2)  = TB_RCBV470.ONSITE_RESP_COM_2;     28480000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28490000
 END;                                                                   28500000
 IF TB_RCBV470_I.INDNULL(33) = 0                                        28510000
 THEN DO;                                                               28520000
   EDQBSDS_BAU.TAT_TIMESPAN_QTY(3)  = TB_RCBV470.ONSITE_RESP_QTY_3;     28530000
   EDQBSDS_BAU.TAT_TIMESPAN_UNIT(3) = TB_RCBV470.ONSITE_RESP_UNT_3;     28540000
   EDQBSDS_BAU.TAT_TIMESPAN_COM(3)  = TB_RCBV470.ONSITE_RESP_COM_3;     28550000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28560000
 END;                                                                   28570000
 IF TB_RCBV470_I.INDNULL(36) = 0                                        28580000
 THEN DO;                                                               28590000
   EDQBSDS_BAU.FIX_TIMESPAN_QTY(1)  = TB_RCBV470.FIX_TIME_QTY_1;        28600000
   EDQBSDS_BAU.FIX_TIMESPAN_UNIT(1) = TB_RCBV470.FIX_TIME_UNT_1;        28610000
   EDQBSDS_BAU.FIX_TIMESPAN_COM(1)  = TB_RCBV470.FIX_TIME_COM_1;        28620000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28630000
 END;                                                                   28640000
 IF TB_RCBV470_I.INDNULL(39) = 0                                        28650000
 THEN DO;                                                               28660000
   EDQBSDS_BAU.FIX_TIMESPAN_QTY(2)  = TB_RCBV470.FIX_TIME_QTY_2;        28670000
   EDQBSDS_BAU.FIX_TIMESPAN_UNIT(2) = TB_RCBV470.FIX_TIME_UNT_2;        28680000
   EDQBSDS_BAU.FIX_TIMESPAN_COM(2)  = TB_RCBV470.FIX_TIME_COM_2;        28690000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28700000
 END;                                                                   28710000
 IF TB_RCBV470_I.INDNULL(42) = 0                                        28720000
 THEN DO;                                                               28730000
   EDQBSDS_BAU.FIX_TIMESPAN_QTY(3)  = TB_RCBV470.FIX_TIME_QTY_3;        28740000
   EDQBSDS_BAU.FIX_TIMESPAN_UNIT(3) = TB_RCBV470.FIX_TIME_UNT_3;        28750000
   EDQBSDS_BAU.FIX_TIMESPAN_COM(3)  = TB_RCBV470.FIX_TIME_COM_3;        28760000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28770000
 END;                                                                   28780000
 IF TB_RCBV470_I.INDNULL(45) = 0                                        28790000
 THEN DO;                                                               28800000
   EDQBSDS_BAU.CTY_TIMESPAN_QTY(1)  = TB_RCBV470.TURN_AROUND_QTY_1;     28810000
   EDQBSDS_BAU.CTY_TIMESPAN_UNIT(1) = TB_RCBV470.TURN_AROUND_UNT_1;     28820000
   EDQBSDS_BAU.CTY_TIMESPAN_COM(1)  = TB_RCBV470.TURN_AROUND_COM_1;     28830000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28840000
 END;                                                                   28850000
 IF TB_RCBV470_I.INDNULL(48) = 0                                        28860000
 THEN DO;                                                               28870000
   EDQBSDS_BAU.CTY_TIMESPAN_QTY(2)  = TB_RCBV470.TURN_AROUND_QTY_2;     28880000
   EDQBSDS_BAU.CTY_TIMESPAN_UNIT(2) = TB_RCBV470.TURN_AROUND_UNT_2;     28890000
   EDQBSDS_BAU.CTY_TIMESPAN_COM(2)  = TB_RCBV470.TURN_AROUND_COM_2;     28900000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28910000
 END;                                                                   28920000
 IF TB_RCBV470_I.INDNULL(51) = 0                                        28930000
 THEN DO;                                                               28940000
   EDQBSDS_BAU.CTY_TIMESPAN_QTY(3)  = TB_RCBV470.TURN_AROUND_QTY_3;     28950000
   EDQBSDS_BAU.CTY_TIMESPAN_UNIT(3) = TB_RCBV470.TURN_AROUND_UNT_3;     28960000
   EDQBSDS_BAU.CTY_TIMESPAN_COM(3)  = TB_RCBV470.TURN_AROUND_COM_3;     28970000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           28980000
 END;                                                                   28990000
 IF TB_RCBV470_I.INDNULL(54) = 0                                        29000000
 THEN DO;                                                               29010000
   EDQBSDS_BAU.ONS_TIMESPAN_QTY(1)  = TB_RCBV470.PRT_ONS_TIME_QTY_1;    29020000
   EDQBSDS_BAU.ONS_TIMESPAN_UNIT(1) = TB_RCBV470.PRT_ONS_TIME_UNT_1;    29030000
   EDQBSDS_BAU.ONS_TIMESPAN_COM(1)  = TB_RCBV470.PRT_ONS_TIME_COM_1;    29040000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           29050000
 END;                                                                   29060000
 IF TB_RCBV470_I.INDNULL(57) = 0                                        29070000
 THEN DO;                                                               29080000
   EDQBSDS_BAU.ONS_TIMESPAN_QTY(2)  = TB_RCBV470.PRT_ONS_TIME_QTY_2;    29090000
   EDQBSDS_BAU.ONS_TIMESPAN_UNIT(2) = TB_RCBV470.PRT_ONS_TIME_UNT_2;    29100000
   EDQBSDS_BAU.ONS_TIMESPAN_COM(2)  = TB_RCBV470.PRT_ONS_TIME_COM_2;    29110000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           29120000
 END;                                                                   29130000
 IF TB_RCBV470_I.INDNULL(60) = 0                                        29140000
 THEN DO;                                                               29150000
   EDQBSDS_BAU.ONS_TIMESPAN_QTY(3)  = TB_RCBV470.PRT_ONS_TIME_QTY_3;    29160000
   EDQBSDS_BAU.ONS_TIMESPAN_UNIT(3) = TB_RCBV470.PRT_ONS_TIME_UNT_3;    29170000
   EDQBSDS_BAU.ONS_TIMESPAN_COM(3)  = TB_RCBV470.PRT_ONS_TIME_COM_3;    29180000
   EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'Y';                           29190000
 END;                                                                   29200000
                                                                        29210000
 IF TB_RCBV470_I.INDNULL(63) = 0 THEN                                   29220000
   EDQBSDS_BAU.SRCCCMD.DESCRIPTION = TB_RCBV470.COMMENT_TEXT;           29230000
                                                                        29240000
 EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV470.SERVICE_LVL_CODE;    29250000
                                                                        29260000
 END RCBCS3M_MOVE_SERV_COND_BAU;                                        29270000
1/*********************************************************************/29280000
 /*                                                                   */29290000
 /* MODULE NAME      : RCBCS3M_MOVE_SERV_COND_PI                      */29300000
 /*                                                                   */29310000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0470/475*/29320000
 /*                    TO THE PI STRUCTURE FIELDS.                    */29330000
 /*                                                                   */29340000
 /*********************************************************************/29350000
0RCBCS3M_MOVE_SERV_COND_PI : PROC;                                      29360000
                                                                        29370000
 IF WRK_SET_HRS = 'Y' THEN                                              29380000
   DO;                                                                  29390000
     IF TB_RCBV470_I.INDNULL(02) = 0 THEN                               29400000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(1).DAGRMFR =                          29410000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_1);29420000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(1).DAGRMFR = '';                   29430000
                                                                        29440000
     IF TB_RCBV470_I.INDNULL(03) = 0 THEN                               29450000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(1).DAGRMTO =                          29460000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_1);  29470000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(1).DAGRMTO = '';                   29480000
                                                                        29490000
     IF TB_RCBV470_I.INDNULL(04) = 0 THEN                               29500000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(2).DAGRMFR =                          29510000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_2);29520000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(2).DAGRMFR = '';                   29530000
                                                                        29540000
     IF TB_RCBV470_I.INDNULL(05) = 0 THEN                               29550000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(2).DAGRMTO =                          29560000
                            R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_2); 29570000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(2).DAGRMTO = '';                   29580000
                                                                        29590000
     IF TB_RCBV470_I.INDNULL(06) = 0 THEN                               29600000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(3).DAGRMFR =                          29610000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_3);29620000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(3).DAGRMFR = '';                   29630000
                                                                        29640000
     IF TB_RCBV470_I.INDNULL(07) = 0 THEN                               29650000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(3).DAGRMTO =                          29660000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_3);  29670000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(3).DAGRMTO = '';                   29680000
                                                                        29690000
     IF TB_RCBV470_I.INDNULL(08) = 0 THEN                               29700000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(4).DAGRMFR =                          29710000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_4);29720000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(4).DAGRMFR = '';                   29730000
                                                                        29740000
     IF TB_RCBV470_I.INDNULL(09) = 0 THEN                               29750000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(4).DAGRMTO =                          29760000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_4);  29770000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(4).DAGRMTO = '';                   29780000
                                                                        29790000
     IF TB_RCBV470_I.INDNULL(10) = 0 THEN                               29800000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(5).DAGRMFR =                          29810000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_5);29820000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(5).DAGRMFR = '';                   29830000
                                                                        29840000
     IF TB_RCBV470_I.INDNULL(11) = 0 THEN                               29850000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(5).DAGRMTO =                          29860000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_5);  29870000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(5).DAGRMTO = '';                   29880000
                                                                        29890000
     IF TB_RCBV470_I.INDNULL(12) = 0 THEN                               29900000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(6).DAGRMFR =                          29910000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_6);29920000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(6).DAGRMFR = '';                   29930000
                                                                        29940000
     IF TB_RCBV470_I.INDNULL(13) = 0 THEN                               29950000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(6).DAGRMTO =                          29960000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_6);  29970000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(6).DAGRMTO = '';                   29980000
                                                                        29990000
     IF TB_RCBV470_I.INDNULL(14) = 0 THEN                               30000000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(7).DAGRMFR =                          30010000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_7);30020000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(7).DAGRMFR = '';                   30030000
                                                                        30040000
     IF TB_RCBV470_I.INDNULL(15) = 0 THEN                               30050000
       EDQBSDS_PI.SRCCCMD.RAGRWCP(7).DAGRMTO =                          30060000
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_7);  30070000
     ELSE EDQBSDS_PI.SRCCCMD.RAGRWCP(7).DAGRMTO = '';                   30080000
   END;                                                                 30090000
                                                                        30100000
  EDQBSDS_PI.SRCCCMD.SERVICE_DLVR_METHD = TB_RCBV470.SERVICE_DLVR_METHD;30110000
                                                                        30120000
 IF TB_RCBV470_I.INDNULL(17) = 0 THEN                                   30130000
   EDQBSDS_PI.SRCCCMD.TIMEZERO = TB_RCBV470.TIME_ZERO_IND;              30140000
                                                                        30150000
 EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'N';                              30160000
                                                                        30170000
 IF TB_RCBV470_I.INDNULL(18) = 0                                        30180000
 THEN DO;                                                               30190000
   EDQBSDS_PI.CBK_TIMESPAN_QTY(1)  = TB_RCBV470.CONTACT_TIME_QTY_1;     30200000
   EDQBSDS_PI.CBK_TIMESPAN_UNIT(1) = TB_RCBV470.CONTACT_TIME_UNT_1;     30210000
   EDQBSDS_PI.CBK_TIMESPAN_COM(1)  = TB_RCBV470.CONTACT_TIME_COM_1;     30220000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30230000
 END;                                                                   30240000
 IF TB_RCBV470_I.INDNULL(21) = 0                                        30250000
 THEN DO;                                                               30260000
   EDQBSDS_PI.CBK_TIMESPAN_QTY(2)  = TB_RCBV470.CONTACT_TIME_QTY_2;     30270000
   EDQBSDS_PI.CBK_TIMESPAN_UNIT(2) = TB_RCBV470.CONTACT_TIME_UNT_2;     30280000
   EDQBSDS_PI.CBK_TIMESPAN_COM(2)  = TB_RCBV470.CONTACT_TIME_COM_2;     30290000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30300000
 END;                                                                   30310000
 IF TB_RCBV470_I.INDNULL(24) = 0                                        30320000
 THEN DO;                                                               30330000
   EDQBSDS_PI.CBK_TIMESPAN_QTY(3)  = TB_RCBV470.CONTACT_TIME_QTY_3;     30340000
   EDQBSDS_PI.CBK_TIMESPAN_UNIT(3) = TB_RCBV470.CONTACT_TIME_UNT_3;     30350000
   EDQBSDS_PI.CBK_TIMESPAN_COM(3)  = TB_RCBV470.CONTACT_TIME_COM_3;     30360000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30370000
 END;                                                                   30380000
 IF TB_RCBV470_I.INDNULL(27) = 0                                        30390000
 THEN DO;                                                               30400000
   EDQBSDS_PI.TAT_TIMESPAN_QTY(1)  = TB_RCBV470.ONSITE_RESP_QTY_1;      30410000
   EDQBSDS_PI.TAT_TIMESPAN_UNIT(1) = TB_RCBV470.ONSITE_RESP_UNT_1;      30420000
   EDQBSDS_PI.TAT_TIMESPAN_COM(1)  = TB_RCBV470.ONSITE_RESP_COM_1;      30430000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30440000
 END;                                                                   30450000
 IF TB_RCBV470_I.INDNULL(30) = 0                                        30460000
 THEN DO;                                                               30470000
   EDQBSDS_PI.TAT_TIMESPAN_QTY(2)  = TB_RCBV470.ONSITE_RESP_QTY_2;      30480000
   EDQBSDS_PI.TAT_TIMESPAN_UNIT(2) = TB_RCBV470.ONSITE_RESP_UNT_2;      30490000
   EDQBSDS_PI.TAT_TIMESPAN_COM(2)  = TB_RCBV470.ONSITE_RESP_COM_2;      30500000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30510000
 END;                                                                   30520000
 IF TB_RCBV470_I.INDNULL(33) = 0                                        30530000
 THEN DO;                                                               30540000
   EDQBSDS_PI.TAT_TIMESPAN_QTY(3)  = TB_RCBV470.ONSITE_RESP_QTY_3;      30550000
   EDQBSDS_PI.TAT_TIMESPAN_UNIT(3) = TB_RCBV470.ONSITE_RESP_UNT_3;      30560000
   EDQBSDS_PI.TAT_TIMESPAN_COM(3)  = TB_RCBV470.ONSITE_RESP_COM_3;      30570000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30580000
 END;                                                                   30590000
 IF TB_RCBV470_I.INDNULL(36) = 0                                        30600000
 THEN DO;                                                               30610000
   EDQBSDS_PI.FIX_TIMESPAN_QTY(1)  = TB_RCBV470.FIX_TIME_QTY_1;         30620000
   EDQBSDS_PI.FIX_TIMESPAN_UNIT(1) = TB_RCBV470.FIX_TIME_UNT_1;         30630000
   EDQBSDS_PI.FIX_TIMESPAN_COM(1)  = TB_RCBV470.FIX_TIME_COM_1;         30640000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30650000
 END;                                                                   30660000
 IF TB_RCBV470_I.INDNULL(39) = 0                                        30670000
 THEN DO;                                                               30680000
   EDQBSDS_PI.FIX_TIMESPAN_QTY(2)  = TB_RCBV470.FIX_TIME_QTY_2;         30690000
   EDQBSDS_PI.FIX_TIMESPAN_UNIT(2) = TB_RCBV470.FIX_TIME_UNT_2;         30700000
   EDQBSDS_PI.FIX_TIMESPAN_COM(2)  = TB_RCBV470.FIX_TIME_COM_2;         30710000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30720000
 END;                                                                   30730000
 IF TB_RCBV470_I.INDNULL(42) = 0                                        30740000
 THEN DO;                                                               30750000
   EDQBSDS_PI.FIX_TIMESPAN_QTY(3)  = TB_RCBV470.FIX_TIME_QTY_3;         30760000
   EDQBSDS_PI.FIX_TIMESPAN_UNIT(3) = TB_RCBV470.FIX_TIME_UNT_3;         30770000
   EDQBSDS_PI.FIX_TIMESPAN_COM(3)  = TB_RCBV470.FIX_TIME_COM_3;         30780000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30790000
 END;                                                                   30800000
 IF TB_RCBV470_I.INDNULL(45) = 0                                        30810000
 THEN DO;                                                               30820000
   EDQBSDS_PI.CTY_TIMESPAN_QTY(1)  = TB_RCBV470.TURN_AROUND_QTY_1;      30830000
   EDQBSDS_PI.CTY_TIMESPAN_UNIT(1) = TB_RCBV470.TURN_AROUND_UNT_1;      30840000
   EDQBSDS_PI.CTY_TIMESPAN_COM(1)  = TB_RCBV470.TURN_AROUND_COM_1;      30850000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30860000
 END;                                                                   30870000
 IF TB_RCBV470_I.INDNULL(48) = 0                                        30880000
 THEN DO;                                                               30890000
   EDQBSDS_PI.CTY_TIMESPAN_QTY(2)  = TB_RCBV470.TURN_AROUND_QTY_2;      30900000
   EDQBSDS_PI.CTY_TIMESPAN_UNIT(2) = TB_RCBV470.TURN_AROUND_UNT_2;      30910000
   EDQBSDS_PI.CTY_TIMESPAN_COM(2)  = TB_RCBV470.TURN_AROUND_COM_2;      30920000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            30930000
 END;                                                                   30940000
 IF TB_RCBV470_I.INDNULL(51) = 0                                        30950000
 THEN DO;                                                               30960000
   EDQBSDS_PI.CTY_TIMESPAN_QTY(3)  = TB_RCBV470.TURN_AROUND_QTY_3;      30970000
   EDQBSDS_PI.CTY_TIMESPAN_UNIT(3) = TB_RCBV470.TURN_AROUND_UNT_3;      30980000
   EDQBSDS_PI.CTY_TIMESPAN_COM(3)  = TB_RCBV470.TURN_AROUND_COM_3;      30990000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            31000000
 END;                                                                   31010000
 IF TB_RCBV470_I.INDNULL(54) = 0                                        31020000
 THEN DO;                                                               31030000
   EDQBSDS_PI.ONS_TIMESPAN_QTY(1)  = TB_RCBV470.PRT_ONS_TIME_QTY_1;     31040000
   EDQBSDS_PI.ONS_TIMESPAN_UNIT(1) = TB_RCBV470.PRT_ONS_TIME_UNT_1;     31050000
   EDQBSDS_PI.ONS_TIMESPAN_COM(1)  = TB_RCBV470.PRT_ONS_TIME_COM_1;     31060000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            31070000
 END;                                                                   31080000
 IF TB_RCBV470_I.INDNULL(57) = 0                                        31090000
 THEN DO;                                                               31100000
   EDQBSDS_PI.ONS_TIMESPAN_QTY(2)  = TB_RCBV470.PRT_ONS_TIME_QTY_2;     31110000
   EDQBSDS_PI.ONS_TIMESPAN_UNIT(2) = TB_RCBV470.PRT_ONS_TIME_UNT_2;     31120000
   EDQBSDS_PI.ONS_TIMESPAN_COM(2)  = TB_RCBV470.PRT_ONS_TIME_COM_2;     31130000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            31140000
 END;                                                                   31150000
 IF TB_RCBV470_I.INDNULL(60) = 0                                        31160000
 THEN DO;                                                               31170000
   EDQBSDS_PI.ONS_TIMESPAN_QTY(3)  = TB_RCBV470.PRT_ONS_TIME_QTY_3;     31180000
   EDQBSDS_PI.ONS_TIMESPAN_UNIT(3) = TB_RCBV470.PRT_ONS_TIME_UNT_3;     31190000
   EDQBSDS_PI.ONS_TIMESPAN_COM(3)  = TB_RCBV470.PRT_ONS_TIME_COM_3;     31200000
   EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                            31210000
 END;                                                                   31220000
                                                                        31230000
 IF TB_RCBV470_I.INDNULL(63) = 0 THEN                                   31240000
   EDQBSDS_PI.SRCCCMD.DESCRIPTION = TB_RCBV470.COMMENT_TEXT;            31250000
                                                                        31260000
 EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV470.SERVICE_LVL_CODE;     31270000
                                                                        31280000
 END RCBCS3M_MOVE_SERV_COND_PI;                                         31290000
1/*********************************************************************/31300000
 /*                                                                   */31310000
 /* MODULE NAME      : RCBCS3M_READ_TRANS_PEW                         */31320000
 /*                                                                   */31330000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0680    */31340000
 /*                                                                   */31350000
 /*********************************************************************/31360000
0RCBCS3M_READ_TRANS_PEW: PROC;                                          31370000
                                                                        31380000
 EXEC SQL                                                               31390000
      SELECT SDF ,                                                      31400000
             TOT_MONTHS ,                                               31410000
             PHASE ,                                                    31420000
             PHASE_DURATION ,                                           31430000
             SERVICE_DELIV ,                                            31440000
             WARR_MAINT_UPG ,                                           31450000
             LABOR_FLAG ,                                               31460000
             TRAVEL_FLAG ,                                              31470000
             PARTS_FLAG ,                                               31480000
             HC_MONTHS ,                                                31490000
             COVERAGE_HOURS ,                                           31500000
             COVERAGE_DAYS ,                                            31510000
             COVERAGE_MONTHS,                                           31520000
             RESPONSE_TIME ,                                            31530000
             RESPONSE_IND ,                                             31540000
             SDF_DESC ,                                                 31550000
             MON_START,                                                 31560000
             MON_STOP ,                                                 31570000
             TUE_START,                                                 31580000
             TUE_STOP ,                                                 31590000
             WED_START,                                                 31600000
             WED_STOP ,                                                 31610000
             THU_START,                                                 31620000
             THU_STOP ,                                                 31630000
             FRI_START,                                                 31640000
             FRI_STOP ,                                                 31650000
             SAT_START,                                                 31660000
             SAT_STOP ,                                                 31670000
             SUN_START,                                                 31680000
             SUN_STOP                                                   31690000
        INTO :TB_RCBV680                                                31700000
             :TB_RCBV680_I.INDNULL                                      31710000
        FROM RCBV0680_TRANS_PEW  T680                                   31720000
       WHERE T680.SDF = :TB_RCBV051.SERVICE_DELIV_FLAG                  31730000
         AND T680.PHASE = '1'                                           31740000
        WITH UR;                                                        31750000
                                                                        31760000
 SELECT(SQLCA.SQLCODE);                                                 31770000
   WHEN(0)                                                              31780000
     CALL RCBCS3M_MOVE_TRANS_PEW;                                       31790000
   WHEN(100);                                                           31800000
   OTHERWISE                                                            31810000
     DO;                                                                31820000
       RCBCQES.MESSAGE_NUMBER = 'C228';                                 31830000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     31840000
       WRK_TABLE = 'RCBV0680_TRANS_PEW';                                31850000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 31860000
     END;                                                               31870000
 END;                                                                   31880000
                                                                        31890000
 END RCBCS3M_READ_TRANS_PEW;                                            31900000
1/*********************************************************************/31910000
 /*                                                                   */31920000
 /* MODULE NAME      : RCBCS3M_MOVE_TRANS_PEW                         */31930000
 /*                                                                   */31940000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0680    */31950000
 /*                    TO THE COMMAREA FIELDS.                        */31960000
 /*                                                                   */31970000
 /*********************************************************************/31980000
0RCBCS3M_MOVE_TRANS_PEW : PROC;                                         31990000
                                                                        32000000
 EDQBSDS_PI.SRCCCMD.SERVICE_DLVR_METHD = TB_RCBV680.SERVICE_DELIV;      32010000
                                                                        32020000
 WRK_QTYD = TB_RCBV680.RESPONSE_TIME;                                   32030000
                                                                        32040000
 IF WRK_SET_HRS = 'Y' THEN                                              32050000
 DO;                                                                    32060000
 EDQBSDS_PI.RAGRWCP.DAGRMFR(1) = R012_TRANS_TIME(TB_RCBV680.MON_START); 32070000
 EDQBSDS_PI.RAGRWCP.DAGRMTO(1) = R012_TRANS_TIME(TB_RCBV680.MON_STOP);  32080000
 EDQBSDS_PI.RAGRWCP.DAGRMFR(2) = R012_TRANS_TIME(TB_RCBV680.TUE_START); 32090000
 EDQBSDS_PI.RAGRWCP.DAGRMTO(2) = R012_TRANS_TIME(TB_RCBV680.TUE_STOP);  32100000
 EDQBSDS_PI.RAGRWCP.DAGRMFR(3) = R012_TRANS_TIME(TB_RCBV680.WED_START); 32110000
 EDQBSDS_PI.RAGRWCP.DAGRMTO(3) = R012_TRANS_TIME(TB_RCBV680.WED_STOP);  32120000
 EDQBSDS_PI.RAGRWCP.DAGRMFR(4) = R012_TRANS_TIME(TB_RCBV680.THU_START); 32130000
 EDQBSDS_PI.RAGRWCP.DAGRMTO(4) = R012_TRANS_TIME(TB_RCBV680.THU_STOP);  32140000
 EDQBSDS_PI.RAGRWCP.DAGRMFR(5) = R012_TRANS_TIME(TB_RCBV680.FRI_START); 32150000
 EDQBSDS_PI.RAGRWCP.DAGRMTO(5) = R012_TRANS_TIME(TB_RCBV680.FRI_STOP);  32160000
 EDQBSDS_PI.RAGRWCP.DAGRMFR(6) = R012_TRANS_TIME(TB_RCBV680.SAT_START); 32170000
 EDQBSDS_PI.RAGRWCP.DAGRMTO(6) = R012_TRANS_TIME(TB_RCBV680.SAT_STOP);  32180000
 EDQBSDS_PI.RAGRWCP.DAGRMFR(7) = R012_TRANS_TIME(TB_RCBV680.SUN_START); 32190000
 EDQBSDS_PI.RAGRWCP.DAGRMTO(7) = R012_TRANS_TIME(TB_RCBV680.SUN_STOP);  32200000
 END;                                                                   32210000
                                                                        32220000
 IF TB_RCBV680.RESPONSE_IND = 'H' THEN                                  32230000
   EDQBSDS_PI.TAT_TIMESPAN_QTY(1) = WRK_QTYH;                           32240000
 ELSE                                                                   32250000
   EDQBSDS_PI.TAT_TIMESPAN_QTY(1) = WRK_QTYD;                           32260000
                                                                        32270000
 EDQBSDS_PI.TAT_TIMESPAN_UNIT(1)  = TB_RCBV680.RESPONSE_IND;            32280000
 EDQBSDS_PI.TAT_TIMESPAN_COM(1)   = '';                                 32290000
                                                                        32300000
 EDQBSDS_PI.SRCCCMD.PRES_VALID_FLAG = 'Y';                              32310000
                                                                        32320000
 EDQBSDS_PI.SRCCCMD.DESCRIPTION = TB_RCBV680.SDF_DESC;                  32330000
                                                                        32340000
 EDQBSDS_PI.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV680.SDF;                  32350000
                                                                        32360000
 END RCBCS3M_MOVE_TRANS_PEW;                                            32370000
1/*********************************************************************/32380000
 /*                                                                   */32390000
 /* MODULE NAME      : RCBCS3M_USER_EXIT                              */32400000
 /*                                                                   */32410000
 /* DESCRIPTION      : USER EXIT RCBDRAU & RCBDR4U                    */32420000
 /*                                                                   */32430000
 /*********************************************************************/32440000
 RCBCS3M_USER_EXIT :PROC;                                               32450000
                                                                        32460000
 SELECT;                                                                32470000
   WHEN((EDQBSDS_BAU.CSLMTYP ¬= '') & (EDQBSDS_PI.CSLMTYP ¬= ''))       32480000
     DATA_ORIGIN='2';                        /*DATA FROM BOTH BAU & PI*/32490000
   WHEN(EDQBSDS_BAU.CSLMTYP ¬= '')                                      32500000
     DATA_ORIGIN='0';                             /*DATA FROM BAU ONLY*/32510000
   WHEN(EDQBSDS_PI.CSLMTYP  ¬= '')                                      32520000
     DATA_ORIGIN='1';                              /*DATA FROM PI ONLY*/32530000
   OTHERWISE;                                                           32540000
 END;                                                                   32550000
                                                                        32560000
    /*RCBDRAU*/                                                         32570000
 CALL RCBCS3M_BAU_TO_USERFILE;                                          32580000
                                                                        32590000
 CALL RCBCS3M_PI_TO_USERFILE;                                           32600000
                                                                        32610000
 CALL RCBCS3M_COMM_TO_USERFILE;                                         32620000
                                                                        32630000
 CALL RCBDRAU (ADDR(SWITCH_USER_EXIT1)                                  32640000
              ,ADDR(DATA_ORIGIN)                                        32650000
              ,ADDR(USER_FILE_RCBDRI1)                                  32660000
              ,ADDR(USER_FILE_PI)                                       32670000
              ,ADDR(USER_FILE_BAU)                                      32680000
              ,PTR_INT_AREA);                                           32690000
                                                                        32700000
  IF SWITCH_USER_EXIT1 = TRUE THEN                                      32710000
     CALL RCBCS3M_USERFILE_TO_COMM;                                     32720000
                                                                        32730000
     /*RCBDR4U*/                                                        32740000
                                                      /* SOC RB01320 */ 32750000
 /*USER_FILE_RCBDRF1.CUNOUSE = COMMAREA.CUSCODE.ICUSHWU;                32760000
 USER_FILE_RCBDRF1.IODPDBU = COMMAREA.SRCCCMD.IODPDBU;                  32770000
 USER_FILE_RCBDRF1.ICUSANO = COMMAREA.CUSCODE.ICUSANO;                  32780000
 USER_FILE_RCBDRF1.CUNAME  = COMMAREA.NCUSABB;                          32790000
 USER_FILE_RCBDRF1.NCUSSTR = COMMAREA.NCUSSTR;                          32800000
 USER_FILE_RCBDRF1.ICUSCTY = COMMAREA.ICUSCTY;                          32810000
 USER_FILE_RCBDRF1.ICUS3AD = COMMAREA.SEDQTEL;                          32820000
 USER_FILE_RCBDRF1.ICUSGZC = COMMAREA.ICUSGZC;                          32830000
 USER_FILE_RCBDRF1.UDTEUEX = COMMAREA.UDTEUEX;                          32840000
 USER_FILE_RCBDRF1.UDTECUF = COMMAREA.UDTECUF;                       */ 32850000
 USER_FILE_RCBDRF1.CUNOUSE = COMMAREA.EDQBSDS.CUSCODE.ICUSHWU;          32860000
 USER_FILE_RCBDRF1.IODPDBU = COMMAREA.EDQBSDS.SRCCCMD.IODPDBU;          32870000
 USER_FILE_RCBDRF1.ICUSANO = COMMAREA.EDQBSDS.CUSCODE.ICUSANO;          32880000
 USER_FILE_RCBDRF1.CUNAME  = COMMAREA.EDQBSDS.NCUSABB;                  32890000
 USER_FILE_RCBDRF1.NCUSSTR = COMMAREA.EDQBSDS.NCUSSTR;                  32900000
 USER_FILE_RCBDRF1.ICUSCTY = COMMAREA.EDQBSDS.ICUSCTY;                  32910000
 USER_FILE_RCBDRF1.ICUS3AD = COMMAREA.EDQBSDS.SEDQTEL;                  32920000
 USER_FILE_RCBDRF1.ICUSGZC = COMMAREA.EDQBSDS.ICUSGZC;                  32930000
 USER_FILE_RCBDRF1.UDTEUEX = COMMAREA.EDQBSDS.UDTEUEX;                  32940000
 USER_FILE_RCBDRF1.UDTECUF = COMMAREA.EDQBSDS.UDTECUF;/* EOC RB01320 */ 32950000
 USER_FILE_RCBDRF1.AAS_ADD = WRK_AAS_ADD;                               32960000
 /*USER_FILE_RCBDRF1.FCUSEMB = COMMAREA.FCUSEMB;  */  /* SOC RB01320 */ 32970000
 /*USER_FILE_RCBDRF1.CCUSTOC = COMMAREA.CCUSTOC;  */                    32980000
 USER_FILE_RCBDRF1.FCUSEMB = COMMAREA.EDQBSDS.FCUSEMB;                  32990000
 USER_FILE_RCBDRF1.CCUSTOC = COMMAREA.EDQBSDS.CCUSTOC;/* EOC RB01320 */ 33000000
                                                                        33010000
 USER_FILE_PI_CU.CUNOUSE = EDQBSDS_PI.SRCCCMD.ICUSHWU;                  33020000
 USER_FILE_PI_CU.IODPDBU = EDQBSDS_PI.SRCCCMD.IODPDBU;                  33030000
 USER_FILE_PI_CU.ICUSANO = EDQBSDS_PI.CUSCODE.ICUSANO;                  33040000
 USER_FILE_PI_CU.CUNAME  = EDQBSDS_PI.NCUSABB;                          33050000
 USER_FILE_PI_CU.NCUSSTR = EDQBSDS_PI.NCUSSTR;                          33060000
 USER_FILE_PI_CU.ICUSCTY = EDQBSDS_PI.ICUSCTY;                          33070000
 USER_FILE_PI_CU.ICUS3AD = EDQBSDS_PI.SEDQTEL;                          33080000
 USER_FILE_PI_CU.ICUSGZC = EDQBSDS_PI.ICUSGZC;                          33090000
 USER_FILE_PI_CU.UDTEUEX = EDQBSDS_PI.UDTEUEX;                          33100000
 USER_FILE_PI_CU.UDTECUF = EDQBSDS_PI.UDTECUF;                          33110000
 USER_FILE_PI_CU.AAS_ADD = WRK_ADDRESS_NUMBER_PI;                       33120000
 USER_FILE_PI_CU.FCUSEMB = EDQBSDS_PI.FCUSEMB;                          33130000
 USER_FILE_PI_CU.CCUSTOC = EDQBSDS_PI.CCUSTOC;                          33140000
                                                                        33150000
 CALL RCBDR4U (ADDR(SWITCH_USER_EXIT2),                                 33160000
 /*            ADDR(DATA_ORIGIN),                       CEDS00000538 */ 33170000
               ADDR(DATA_ORIGIN2),                   /* CEDS00000538 */ 33180000
               ADDR(USER_FILE_RCBDRF1),                                 33190000
               ADDR(USER_FILE_PI_CU),                                   33200000
               ADDR(USER_EXTRA_INFO),                                   33210000
               PTR_INT_AREA);                                           33220000
                                                                        33230000
 IF SWITCH_USER_EXIT2 = TRUE THEN                                       33240000
   DO;                                                                  33250000
                                                       /* SOC RB01320 */33260000
 /* COMMAREA.SRCCCMD.IODPDBU   = USER_FILE_RCBDRF1.IODPDBU;             33270000
    COMMAREA.CUSCODE.ICUSANO   = USER_FILE_RCBDRF1.ICUSANO;             33280000
    COMMAREA.NCUSSTR           = USER_FILE_RCBDRF1.NCUSSTR;             33290000
    COMMAREA.ICUSCTY           = USER_FILE_RCBDRF1.ICUSCTY;             33300000
    COMMAREA.SEDQTEL           = USER_FILE_RCBDRF1.ICUS3AD;             33310000
    COMMAREA.ICUSGZC           = USER_FILE_RCBDRF1.ICUSGZC;             33320000
    COMMAREA.UDTEUEX           = USER_FILE_RCBDRF1.UDTEUEX;             33330000
    COMMAREA.UDTECUF           = USER_FILE_RCBDRF1.UDTECUF;             33340000
    COMMAREA.FCUSEMB           = USER_FILE_RCBDRF1.FCUSEMB;             33350000
    COMMAREA.CCUSTOC           = USER_FILE_RCBDRF1.CCUSTOC;        */   33360000
    COMMAREA.EDQBSDS.SRCCCMD.IODPDBU   = USER_FILE_RCBDRF1.IODPDBU;     33370000
    COMMAREA.EDQBSDS.CUSCODE.ICUSANO   = USER_FILE_RCBDRF1.ICUSANO;     33380000
    COMMAREA.EDQBSDS.NCUSSTR           = USER_FILE_RCBDRF1.NCUSSTR;     33390000
    COMMAREA.EDQBSDS.ICUSCTY           = USER_FILE_RCBDRF1.ICUSCTY;     33400000
    COMMAREA.EDQBSDS.SEDQTEL           = USER_FILE_RCBDRF1.ICUS3AD;     33410000
    COMMAREA.EDQBSDS.ICUSGZC           = USER_FILE_RCBDRF1.ICUSGZC;     33420000
    COMMAREA.EDQBSDS.UDTEUEX           = USER_FILE_RCBDRF1.UDTEUEX;     33430000
    COMMAREA.EDQBSDS.UDTECUF           = USER_FILE_RCBDRF1.UDTECUF;     33440000
    COMMAREA.EDQBSDS.FCUSEMB           = USER_FILE_RCBDRF1.FCUSEMB;     33450000
    COMMAREA.EDQBSDS.CCUSTOC           = USER_FILE_RCBDRF1.CCUSTOC;     33460000
                                                       /* EOC RB01320 */33470000
   END;                                                                 33480000
 ELSE                                                                   33490000
   DO;                                                                  33500000
 /* COMMAREA.NCUSSTR = USER_EXTRA_INFO.ADDR_LINES(1);     SOC RB01320 */33510000
 /* COMMAREA.ICUSCTY = USER_EXTRA_INFO.ADDR_LINES(2);                   33520000
    COMMAREA.SEDQTEL = USER_EXTRA_INFO.ADDR_LINES(3);                 */33530000
    COMMAREA.EDQBSDS.NCUSSTR = USER_EXTRA_INFO.ADDR_LINES(1);           33540000
    COMMAREA.EDQBSDS.ICUSCTY = USER_EXTRA_INFO.ADDR_LINES(2);           33550000
    COMMAREA.EDQBSDS.SEDQTEL = USER_EXTRA_INFO.ADDR_LINES(3);           33560000
                                                       /* EOC RB01320 */33570000
   END;                                                                 33580000
                                                                        33590000
 END RCBCS3M_USER_EXIT;                                                 33600000
1/*********************************************************************/33610000
 /*                                                                   */33620000
 /* MODULE NAME      : RCBCS3M_BAU_TO_USERFILE                        */33630000
 /*                                                                   */33640000
 /* DESCRIPTION      : MOVE BAU DATA TO USER-EXIT'S BAU STRUCTURE     */33650000
 /*                                                                   */33660000
 /*********************************************************************/33670000
 RCBCS3M_BAU_TO_USERFILE: PROC;                                         33680000
                                                                        33690000
 USER_FILE_BAU.SERNO              = EDQBSDS_BAU.IHSIMID.IOLCPLM||       33700000
                                    EDQBSDS_BAU.IHSIMID.IHSINBR;        33710000
 USER_FILE_BAU.MKBINA             = EDQBSDS_BAU.GMKTMBO;                33720000
                                                                        33730000
 /* USER_FILE_BAU.SRCC0MD = EDQBSDS_BAU.SRCCCMD */                      33740000
                                                                        33750000
 USER_FILE_BAU.SRCC0MD.TAKE_CEDS   = EDQBSDS_BAU.TAKE_CEDS;             33760000
 USER_FILE_BAU.SRCC0MD.EFFDATE     = EDQBSDS_BAU.DDBSEFF;               33770000
 USER_FILE_BAU.SRCC0MD.ENDDATE     = EDQBSDS_BAU.DDBSMED;               33780000
 USER_FILE_BAU.SRCC0MD.SSRCIND     = EDQBSDS_BAU.SSRCIND;               33790000
 USER_FILE_BAU.SRCC0MD.CUNOUSE     = EDQBSDS_BAU.SRCCCMD.ICUSHWU;       33800000
 USER_FILE_BAU.SRCC0MD.IODPDBU     = EDQBSDS_BAU.IODPDBU;               33810000
 USER_FILE_BAU.SRCC0MD.IAGRNBR     = EDQBSDS_BAU.IAGRNBR;               33820000
 USER_FILE_BAU.SRCC0MD.IAGRTCN     = EDQBSDS_BAU.IAGRTCN;               33830000
 USER_FILE_BAU.SRCC0MD.IHSIESA(1)  = EDQBSDS_BAU.RHSIESA.IHSIESA(1);    33840000
 USER_FILE_BAU.SRCC0MD.IHSIESA(2)  = EDQBSDS_BAU.RHSIESA.IHSIESA(2);    33850000
 USER_FILE_BAU.SRCC0MD.IHSIESA(3)  = EDQBSDS_BAU.RHSIESA.IHSIESA(3);    33860000
 USER_FILE_BAU.SRCC0MD.IHSIESA(4)  = EDQBSDS_BAU.RHSIESA.IHSIESA(4);    33870000
 USER_FILE_BAU.SRCC0MD.IHSIESA(5)  = EDQBSDS_BAU.RHSIESA.IHSIESA(5);    33880000
 USER_FILE_BAU.SRCC0MD.DAGRMFR(1)  = EDQBSDS_BAU.RAGRWCP.DAGRMFR(1);    33890000
 USER_FILE_BAU.SRCC0MD.DAGRMTO(1)  = EDQBSDS_BAU.RAGRWCP.DAGRMTO(1);    33900000
 USER_FILE_BAU.SRCC0MD.DAGRMFR(2)  = EDQBSDS_BAU.RAGRWCP.DAGRMFR(2);    33910000
 USER_FILE_BAU.SRCC0MD.DAGRMTO(2)  = EDQBSDS_BAU.RAGRWCP.DAGRMTO(2);    33920000
 USER_FILE_BAU.SRCC0MD.DAGRMFR(3)  = EDQBSDS_BAU.RAGRWCP.DAGRMFR(3);    33930000
 USER_FILE_BAU.SRCC0MD.DAGRMTO(3)  = EDQBSDS_BAU.RAGRWCP.DAGRMTO(3);    33940000
 USER_FILE_BAU.SRCC0MD.DAGRMFR(4)  = EDQBSDS_BAU.RAGRWCP.DAGRMFR(4);    33950000
 USER_FILE_BAU.SRCC0MD.DAGRMTO(4)  = EDQBSDS_BAU.RAGRWCP.DAGRMTO(4);    33960000
 USER_FILE_BAU.SRCC0MD.DAGRMFR(5)  = EDQBSDS_BAU.RAGRWCP.DAGRMFR(5);    33970000
 USER_FILE_BAU.SRCC0MD.DAGRMTO(5)  = EDQBSDS_BAU.RAGRWCP.DAGRMTO(5);    33980000
 USER_FILE_BAU.SRCC0MD.DAGRMFR(6)  = EDQBSDS_BAU.RAGRWCP.DAGRMFR(6);    33990000
 USER_FILE_BAU.SRCC0MD.DAGRMTO(6)  = EDQBSDS_BAU.RAGRWCP.DAGRMTO(6);    34000000
 USER_FILE_BAU.SRCC0MD.DAGRMFR(7)  = EDQBSDS_BAU.RAGRWCP.DAGRMFR(7);    34010000
 USER_FILE_BAU.SRCC0MD.DAGRMTO(7)  = EDQBSDS_BAU.RAGRWCP.DAGRMTO(7);    34020000
 USER_FILE_BAU.SRCC0MD.TPMNT       = EDQBSDS_BAU.CHSISTM;               34030000
 USER_FILE_BAU.SRCC0MD.SERV_DEL_M  = EDQBSDS_BAU.SERVICE_DLVR_METHD;    34040000
 USER_FILE_BAU.SRCC0MD.SDF         = EDQBSDS_BAU.SERVICE_DELIV_FLAG;    34050000
 USER_FILE_BAU.SRCC0MD.SLC         = EDQBSDS_BAU.SERVICE_LVL_CODE;      34060000
 USER_FILE_BAU.SRCC0MD.PRES_VALID  = EDQBSDS_BAU.PRES_VALID_FLAG;       34070000
 USER_FILE_BAU.SRCC0MD.TIMEZERO    = EDQBSDS_BAU.TIMEZERO;              34080000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_QTY_1 =                             34090000
                                     EDQBSDS_BAU.CBK_TIMESPAN_QTY(1);   34100000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_UNT_1  =                            34110000
                                     EDQBSDS_BAU.CBK_TIMESPAN_UNIT(1);  34120000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_COM_1  =                            34130000
                                     EDQBSDS_BAU.CBK_TIMESPAN_COM(1);   34140000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_QTY_2  =                            34150000
                                     EDQBSDS_BAU.CBK_TIMESPAN_QTY(2);   34160000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_UNT_2  =                            34170000
                                     EDQBSDS_BAU.CBK_TIMESPAN_UNIT(2);  34180000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_COM_2  =                            34190000
                                     EDQBSDS_BAU.CBK_TIMESPAN_COM(2);   34200000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_QTY_3  =                            34210000
                                     EDQBSDS_BAU.CBK_TIMESPAN_QTY(3);   34220000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_UNT_3  =                            34230000
                                     EDQBSDS_BAU.CBK_TIMESPAN_UNIT(3);  34240000
 USER_FILE_BAU.SRCC0MD.CONTACT_TIME_COM_3  =                            34250000
                                     EDQBSDS_BAU.CBK_TIMESPAN_COM(3);   34260000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_QTY_1   =                            34270000
                                     EDQBSDS_BAU.TAT_TIMESPAN_QTY(1);   34280000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_UNT_1   =                            34290000
                                     EDQBSDS_BAU.TAT_TIMESPAN_UNIT(1);  34300000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_COM_1   =                            34310000
                                     EDQBSDS_BAU.TAT_TIMESPAN_COM(1);   34320000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_QTY_2   =                            34330000
                                     EDQBSDS_BAU.TAT_TIMESPAN_QTY(2);   34340000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_UNT_2   =                            34350000
                                     EDQBSDS_BAU.TAT_TIMESPAN_UNIT(2);  34360000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_COM_2   =                            34370000
                                     EDQBSDS_BAU.TAT_TIMESPAN_COM(2);   34380000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_QTY_3   =                            34390000
                                     EDQBSDS_BAU.TAT_TIMESPAN_QTY(3);   34400000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_UNT_3   =                            34410000
                                     EDQBSDS_BAU.TAT_TIMESPAN_UNIT(3);  34420000
 USER_FILE_BAU.SRCC0MD.ONSITE_RESP_COM_3   =                            34430000
                                     EDQBSDS_BAU.TAT_TIMESPAN_COM(3);   34440000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_QTY_1      =                            34450000
                                     EDQBSDS_BAU.FIX_TIMESPAN_QTY(1);   34460000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_UNT_1      =                            34470000
                                     EDQBSDS_BAU.FIX_TIMESPAN_UNIT(1);  34480000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_COM_1      =                            34490000
                                     EDQBSDS_BAU.FIX_TIMESPAN_COM(1);   34500000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_QTY_2      =                            34510000
                                     EDQBSDS_BAU.FIX_TIMESPAN_QTY(2);   34520000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_UNT_2      =                            34530000
                                     EDQBSDS_BAU.FIX_TIMESPAN_UNIT(2);  34540000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_COM_2      =                            34550000
                                     EDQBSDS_BAU.FIX_TIMESPAN_COM(2);   34560000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_QTY_3      =                            34570000
                                     EDQBSDS_BAU.FIX_TIMESPAN_QTY(3);   34580000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_UNT_3      =                            34590000
                                     EDQBSDS_BAU.FIX_TIMESPAN_UNIT(3);  34600000
 USER_FILE_BAU.SRCC0MD.FIX_TIME_COM_3      =                            34610000
                                     EDQBSDS_BAU.FIX_TIMESPAN_COM(3);   34620000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_QTY_1   =                            34630000
                                     EDQBSDS_BAU.CTY_TIMESPAN_QTY(1);   34640000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_UNT_1   =                            34650000
                                     EDQBSDS_BAU.CTY_TIMESPAN_UNIT(1);  34660000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_COM_1   =                            34670000
                                     EDQBSDS_BAU.CTY_TIMESPAN_COM(1);   34680000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_QTY_2   =                            34690000
                                     EDQBSDS_BAU.CTY_TIMESPAN_QTY(2);   34700000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_UNT_2   =                            34710000
                                     EDQBSDS_BAU.CTY_TIMESPAN_UNIT(2);  34720000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_COM_2   =                            34730000
                                     EDQBSDS_BAU.CTY_TIMESPAN_COM(2);   34740000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_QTY_3   =                            34750000
                                     EDQBSDS_BAU.CTY_TIMESPAN_QTY(3);   34760000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_UNT_3   =                            34770000
                                     EDQBSDS_BAU.CTY_TIMESPAN_UNIT(3);  34780000
 USER_FILE_BAU.SRCC0MD.TURN_AROUND_COM_3   =                            34790000
                                     EDQBSDS_BAU.CTY_TIMESPAN_COM(3);   34800000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_QTY_1  =                            34810000
                                     EDQBSDS_BAU.ONS_TIMESPAN_QTY(1);   34820000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_UNT_1  =                            34830000
                                     EDQBSDS_BAU.ONS_TIMESPAN_UNIT(1);  34840000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_COM_1  =                            34850000
                                     EDQBSDS_BAU.ONS_TIMESPAN_COM(1);   34860000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_QTY_2  =                            34870000
                                     EDQBSDS_BAU.ONS_TIMESPAN_QTY(2);   34880000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_UNT_2  =                            34890000
                                     EDQBSDS_BAU.ONS_TIMESPAN_UNIT(2);  34900000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_COM_2  =                            34910000
                                     EDQBSDS_BAU.ONS_TIMESPAN_COM(2);   34920000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_QTY_3  =                            34930000
                                     EDQBSDS_BAU.ONS_TIMESPAN_QTY(3);   34940000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_UNT_3  =                            34950000
                                     EDQBSDS_BAU.ONS_TIMESPAN_UNIT(3);  34960000
 USER_FILE_BAU.SRCC0MD.PRT_ONS_TIME_COM_3  =                            34970000
                                     EDQBSDS_BAU.ONS_TIMESPAN_COM(3);   34980000
 USER_FILE_BAU.SRCC0MD.COMMENT_TEXT= EDQBSDS_BAU.DESCRIPTION;           34990000
 USER_FILE_BAU.SRCC0MD.CAGRFOR     = EDQBSDS_BAU.CAGRFOR;               35000000
 USER_FILE_BAU.SRCC0MD.CAGROPT     = EDQBSDS_BAU.CAGROPT;               35010000
 USER_FILE_BAU.SRCC0MD.CSLMRPQ     = EDQBSDS_BAU.CAGRMSO;               35020000
 USER_FILE_BAU.SRCC0MD.IAGRIAH     = EDQBSDS_BAU.CAGRIAH;               35030000
   /* OTHERS FIELDS*/                                                   35040000
 USER_FILE_BAU.QCUOHVP             = EDQBSDS_BAU.QCUOHVP;               35050000
 USER_FILE_BAU.TYPE                = EDQBSDS_BAU.IHSITOS.CSLMTYP;       35060000
 USER_FILE_BAU.MOD                 = EDQBSDS_BAU.CSLMMOD;               35070000
 USER_FILE_BAU.BUILT_TO_MOD        = EDQBSDS_BAU.BUILT_TO_MODEL_NR;     35080000
 USER_FILE_BAU.CPUTYPE             = EDQBSDS_BAU.ISLMCPU;               35090000
 USER_FILE_BAU.ICUSANO             = EDQBSDS_BAU.CUSCODE.ICUSANO;       35100000
 USER_FILE_BAU.ORDREF              = EDQBSDS_BAU.ICUOORN;               35110000
 USER_FILE_BAU.TPAGR               = EDQBSDS_BAU.CAGRTYP;               35120000
 USER_FILE_BAU.DPSYSNO             = EDQBSDS_BAU.ICUOSYN;               35130000
 USER_FILE_BAU.WED                 = EDQBSDS_BAU.DAGREWP;               35140000
 USER_FILE_BAU.DPIS                = EDQBSDS_BAU.CHSIISC;               35150000
 USER_FILE_BAU.MKINSDAT            = EDQBSDS_BAU.DHSIINS;               35160000
 USER_FILE_BAU.MKSCREMD            = EDQBSDS_BAU.DRMOSMR;               35170000
                                                  /* SOC CEDS00000527 */35180000
 USER_FILE_BAU.DEALER_NUMBER       = EDQBSDS_BAU.DEALER;                35190000
 USER_FILE_BAU.UDTEUEX             = EDQBSDS_BAU.UDTEUEX;               35200000
 USER_FILE_BAU.UDTECUF             = EDQBSDS_BAU.UDTECUF;               35210000
 USER_FILE_BAU.SERV_EXTENSION(1)   = EDQBSDS_BAU.SERV_EXTENSION(1);     35220000
 USER_FILE_BAU.SERV_EXTENSION(2)   = EDQBSDS_BAU.SERV_EXTENSION(2);     35230000
 USER_FILE_BAU.SERV_EXTENSION(3)   = EDQBSDS_BAU.SERV_EXTENSION(3);     35240000
 USER_FILE_BAU.SERV_EXTENSION(4)   = EDQBSDS_BAU.SERV_EXTENSION(4);     35250000
 USER_FILE_BAU.SERV_EXTENSION(5)   = EDQBSDS_BAU.SERV_EXTENSION(5);     35260000
 USER_FILE_BAU.BASE_WARRANTY_SLC   = EDQBSDS_BAU.BASE_WARRANTY_SLC;     35270000
                                                  /* EOC CEDS00000527 */35280000
                                                                        35290000
 END RCBCS3M_BAU_TO_USERFILE;                                           35300000
1/*********************************************************************/35310000
 /*                                                                   */35320000
 /* MODULE NAME      : RCBCS3M_PI_TO_USERFILE                         */35330000
 /*                                                                   */35340000
 /* DESCRIPTION      : MOVE PI DATA TO USER-EXIT'S PI STRUCTURE       */35350000
 /*                                                                   */35360000
 /*********************************************************************/35370000
 RCBCS3M_PI_TO_USERFILE: PROC;                                          35380000
                                                                        35390000
 USER_FILE_PI.SERNO               = EDQBSDS_PI.IHSIMID.IOLCPLM||        35400000
                                    EDQBSDS_PI.IHSIMID.IHSINBR;         35410000
 USER_FILE_PI.MKBINA              = EDQBSDS_PI.GMKTMBO;                 35420000
                                                                        35430000
 /* USER_FILE_PI.SRCC0MD = EDQBSDS_PI.SRCCCMD */                        35440000
                                                                        35450000
 USER_FILE_PI.SRCC0MD.TAKE_CEDS    = EDQBSDS_PI.TAKE_CEDS;              35460000
 USER_FILE_PI.SRCC0MD.EFFDATE      = EDQBSDS_PI.DDBSEFF;                35470000
 USER_FILE_PI.SRCC0MD.ENDDATE      = EDQBSDS_PI.DDBSMED;                35480000
 USER_FILE_PI.SRCC0MD.SSRCIND      = EDQBSDS_PI.SSRCIND;                35490000
 USER_FILE_PI.SRCC0MD.CUNOUSE      = EDQBSDS_PI.SRCCCMD.ICUSHWU;        35500000
 USER_FILE_PI.SRCC0MD.IODPDBU      = EDQBSDS_PI.IODPDBU;                35510000
 USER_FILE_PI.SRCC0MD.IAGRNBR      = EDQBSDS_PI.IAGRNBR;                35520000
 USER_FILE_PI.SRCC0MD.IAGRTCN      = EDQBSDS_PI.IAGRTCN;                35530000
 USER_FILE_PI.SRCC0MD.IHSIESA(1)   = EDQBSDS_PI.RHSIESA.IHSIESA(1);     35540000
 USER_FILE_PI.SRCC0MD.IHSIESA(2)   = EDQBSDS_PI.RHSIESA.IHSIESA(2);     35550000
 USER_FILE_PI.SRCC0MD.IHSIESA(3)   = EDQBSDS_PI.RHSIESA.IHSIESA(3);     35560000
 USER_FILE_PI.SRCC0MD.IHSIESA(4)   = EDQBSDS_PI.RHSIESA.IHSIESA(4);     35570000
 USER_FILE_PI.SRCC0MD.IHSIESA(5)   = EDQBSDS_PI.RHSIESA.IHSIESA(5);     35580000
 USER_FILE_PI.SRCC0MD.DAGRMFR(1)   = EDQBSDS_PI.RAGRWCP.DAGRMFR(1);     35590000
 USER_FILE_PI.SRCC0MD.DAGRMTO(1)   = EDQBSDS_PI.RAGRWCP.DAGRMTO(1);     35600000
 USER_FILE_PI.SRCC0MD.DAGRMFR(2)   = EDQBSDS_PI.RAGRWCP.DAGRMFR(2);     35610000
 USER_FILE_PI.SRCC0MD.DAGRMTO(2)   = EDQBSDS_PI.RAGRWCP.DAGRMTO(2);     35620000
 USER_FILE_PI.SRCC0MD.DAGRMFR(3)   = EDQBSDS_PI.RAGRWCP.DAGRMFR(3);     35630000
 USER_FILE_PI.SRCC0MD.DAGRMTO(3)   = EDQBSDS_PI.RAGRWCP.DAGRMTO(3);     35640000
 USER_FILE_PI.SRCC0MD.DAGRMFR(4)   = EDQBSDS_PI.RAGRWCP.DAGRMFR(4);     35650000
 USER_FILE_PI.SRCC0MD.DAGRMTO(4)   = EDQBSDS_PI.RAGRWCP.DAGRMTO(4);     35660000
 USER_FILE_PI.SRCC0MD.DAGRMFR(5)   = EDQBSDS_PI.RAGRWCP.DAGRMFR(5);     35670000
 USER_FILE_PI.SRCC0MD.DAGRMTO(5)   = EDQBSDS_PI.RAGRWCP.DAGRMTO(5);     35680000
 USER_FILE_PI.SRCC0MD.DAGRMFR(6)   = EDQBSDS_PI.RAGRWCP.DAGRMFR(6);     35690000
 USER_FILE_PI.SRCC0MD.DAGRMTO(6)   = EDQBSDS_PI.RAGRWCP.DAGRMTO(6);     35700000
 USER_FILE_PI.SRCC0MD.DAGRMFR(7)   = EDQBSDS_PI.RAGRWCP.DAGRMFR(7);     35710000
 USER_FILE_PI.SRCC0MD.DAGRMTO(7)   = EDQBSDS_PI.RAGRWCP.DAGRMTO(7);     35720000
 USER_FILE_PI.SRCC0MD.TPMNT        = EDQBSDS_PI.CHSISTM;                35730000
 USER_FILE_PI.SRCC0MD.SERV_DEL_M   = EDQBSDS_PI.SERVICE_DLVR_METHD;     35740000
 USER_FILE_PI.SRCC0MD.SDF          = EDQBSDS_PI.SERVICE_DELIV_FLAG;     35750000
 USER_FILE_PI.SRCC0MD.SLC          = EDQBSDS_PI.SERVICE_LVL_CODE;       35760000
 USER_FILE_PI.SRCC0MD.PRES_VALID   = EDQBSDS_PI.PRES_VALID_FLAG;        35770000
 USER_FILE_PI.SRCC0MD.TIMEZERO     = EDQBSDS_PI.TIMEZERO;               35780000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_QTY_1 =                              35790000
                                     EDQBSDS_PI.CBK_TIMESPAN_QTY(1);    35800000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_UNT_1   =                            35810000
                                     EDQBSDS_PI.CBK_TIMESPAN_UNIT(1);   35820000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_COM_1   =                            35830000
                                     EDQBSDS_PI.CBK_TIMESPAN_COM(1);    35840000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_QTY_2   =                            35850000
                                     EDQBSDS_PI.CBK_TIMESPAN_QTY(2);    35860000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_UNT_2   =                            35870000
                                     EDQBSDS_PI.CBK_TIMESPAN_UNIT(2);   35880000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_COM_2   =                            35890000
                                     EDQBSDS_PI.CBK_TIMESPAN_COM(2);    35900000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_QTY_3   =                            35910000
                                     EDQBSDS_PI.CBK_TIMESPAN_QTY(3);    35920000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_UNT_3   =                            35930000
                                     EDQBSDS_PI.CBK_TIMESPAN_UNIT(3);   35940000
 USER_FILE_PI.SRCC0MD.CONTACT_TIME_COM_3   =                            35950000
                                     EDQBSDS_PI.CBK_TIMESPAN_COM(3);    35960000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_QTY_1    =                            35970000
                                     EDQBSDS_PI.TAT_TIMESPAN_QTY(1);    35980000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_UNT_1    =                            35990000
                                     EDQBSDS_PI.TAT_TIMESPAN_UNIT(1);   36000000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_COM_1    =                            36010000
                                     EDQBSDS_PI.TAT_TIMESPAN_COM(1);    36020000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_QTY_2    =                            36030000
                                     EDQBSDS_PI.TAT_TIMESPAN_QTY(2);    36040000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_UNT_2    =                            36050000
                                     EDQBSDS_PI.TAT_TIMESPAN_UNIT(2);   36060000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_COM_2    =                            36070000
                                     EDQBSDS_PI.TAT_TIMESPAN_COM(2);    36080000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_QTY_3    =                            36090000
                                     EDQBSDS_PI.TAT_TIMESPAN_QTY(3);    36100000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_UNT_3    =                            36110000
                                     EDQBSDS_PI.TAT_TIMESPAN_UNIT(3);   36120000
 USER_FILE_PI.SRCC0MD.ONSITE_RESP_COM_3    =                            36130000
                                     EDQBSDS_PI.TAT_TIMESPAN_COM(3);    36140000
 USER_FILE_PI.SRCC0MD.FIX_TIME_QTY_1       =                            36150000
                                     EDQBSDS_PI.FIX_TIMESPAN_QTY(1);    36160000
 USER_FILE_PI.SRCC0MD.FIX_TIME_UNT_1       =                            36170000
                                     EDQBSDS_PI.FIX_TIMESPAN_UNIT(1);   36180000
 USER_FILE_PI.SRCC0MD.FIX_TIME_COM_1       =                            36190000
                                     EDQBSDS_PI.FIX_TIMESPAN_COM(1);    36200000
 USER_FILE_PI.SRCC0MD.FIX_TIME_QTY_2       =                            36210000
                                     EDQBSDS_PI.FIX_TIMESPAN_QTY(2);    36220000
 USER_FILE_PI.SRCC0MD.FIX_TIME_UNT_2       =                            36230000
                                     EDQBSDS_PI.FIX_TIMESPAN_UNIT(2);   36240000
 USER_FILE_PI.SRCC0MD.FIX_TIME_COM_2       =                            36250000
                                     EDQBSDS_PI.FIX_TIMESPAN_COM(2);    36260000
 USER_FILE_PI.SRCC0MD.FIX_TIME_QTY_3       =                            36270000
                                     EDQBSDS_PI.FIX_TIMESPAN_QTY(3);    36280000
 USER_FILE_PI.SRCC0MD.FIX_TIME_UNT_3       =                            36290000
                                     EDQBSDS_PI.FIX_TIMESPAN_UNIT(3);   36300000
 USER_FILE_PI.SRCC0MD.FIX_TIME_COM_3       =                            36310000
                                     EDQBSDS_PI.FIX_TIMESPAN_COM(3);    36320000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_QTY_1    =                            36330000
                                     EDQBSDS_PI.CTY_TIMESPAN_QTY(1);    36340000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_UNT_1    =                            36350000
                                     EDQBSDS_PI.CTY_TIMESPAN_UNIT(1);   36360000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_COM_1    =                            36370000
                                     EDQBSDS_PI.CTY_TIMESPAN_COM(1);    36380000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_QTY_2    =                            36390000
                                     EDQBSDS_PI.CTY_TIMESPAN_QTY(2);    36400000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_UNT_2    =                            36410000
                                     EDQBSDS_PI.CTY_TIMESPAN_UNIT(2);   36420000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_COM_2    =                            36430000
                                     EDQBSDS_PI.CTY_TIMESPAN_COM(2);    36440000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_QTY_3    =                            36450000
                                     EDQBSDS_PI.CTY_TIMESPAN_QTY(3);    36460000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_UNT_3    =                            36470000
                                     EDQBSDS_PI.CTY_TIMESPAN_UNIT(3);   36480000
 USER_FILE_PI.SRCC0MD.TURN_AROUND_COM_3    =                            36490000
                                     EDQBSDS_PI.CTY_TIMESPAN_COM(3);    36500000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_QTY_1   =                            36510000
                                     EDQBSDS_PI.ONS_TIMESPAN_QTY(1);    36520000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_UNT_1   =                            36530000
                                     EDQBSDS_PI.ONS_TIMESPAN_UNIT(1);   36540000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_COM_1   =                            36550000
                                     EDQBSDS_PI.ONS_TIMESPAN_COM(1);    36560000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_QTY_2   =                            36570000
                                     EDQBSDS_PI.ONS_TIMESPAN_QTY(2);    36580000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_UNT_2   =                            36590000
                                     EDQBSDS_PI.ONS_TIMESPAN_UNIT(2);   36600000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_COM_2   =                            36610000
                                     EDQBSDS_PI.ONS_TIMESPAN_COM(2);    36620000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_QTY_3   =                            36630000
                                     EDQBSDS_PI.ONS_TIMESPAN_QTY(3);    36640000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_UNT_3   =                            36650000
                                     EDQBSDS_PI.ONS_TIMESPAN_UNIT(3);   36660000
 USER_FILE_PI.SRCC0MD.PRT_ONS_TIME_COM_3   =                            36670000
                                     EDQBSDS_PI.ONS_TIMESPAN_COM(3);    36680000
 USER_FILE_PI.SRCC0MD.COMMENT_TEXT = EDQBSDS_PI.DESCRIPTION;            36690000
 USER_FILE_PI.SRCC0MD.CAGRFOR      = EDQBSDS_PI.CAGRFOR;                36700000
 USER_FILE_PI.SRCC0MD.CAGROPT      = EDQBSDS_PI.CAGROPT;                36710000
 USER_FILE_PI.SRCC0MD.CSLMRPQ      = EDQBSDS_PI.CAGRMSO;                36720000
 USER_FILE_PI.SRCC0MD.IAGRIAH      = EDQBSDS_PI.CAGRIAH;                36730000
   /* OTHERS FIELDS */                                                  36740000
 USER_FILE_PI.QCUOHVP              = EDQBSDS_PI.QCUOHVP;                36750000
 USER_FILE_PI.TYPE                 = EDQBSDS_PI.IHSITOS.CSLMTYP;        36760000
 USER_FILE_PI.MOD                  = EDQBSDS_PI.CSLMMOD;                36770000
 USER_FILE_PI.BUILT_TO_MOD         = EDQBSDS_PI.BUILT_TO_MODEL_NR;      36780000
 USER_FILE_PI.CPUTYPE              = EDQBSDS_PI.ISLMCPU;                36790000
 USER_FILE_PI.ICUSANO              = EDQBSDS_PI.CUSCODE.ICUSANO;        36800000
 USER_FILE_PI.ORDREF               = EDQBSDS_PI.ICUOORN;                36810000
 USER_FILE_PI.TPAGR                = EDQBSDS_PI.CAGRTYP;                36820000
 USER_FILE_PI.DPSYSNO              = EDQBSDS_PI.ICUOSYN;                36830000
 USER_FILE_PI.WED                  = EDQBSDS_PI.DAGREWP;                36840000
 USER_FILE_PI.DPIS                 = EDQBSDS_PI.CHSIISC;                36850000
 USER_FILE_PI.MKINSDAT             = EDQBSDS_PI.DHSIINS;                36860000
 USER_FILE_PI.MKSCREMD             = EDQBSDS_PI.DRMOSMR;                36870000
                                                  /* SOC CEDS00000527 */36880000
 USER_FILE_PI.DEALER_NUMBER       = EDQBSDS_PI.DEALER;                  36890000
 USER_FILE_PI.UDTEUEX             = EDQBSDS_PI.UDTEUEX;                 36900000
 USER_FILE_PI.UDTECUF             = EDQBSDS_PI.UDTECUF;                 36910000
 USER_FILE_PI.SERV_EXTENSION(1)   = EDQBSDS_PI.SERV_EXTENSION(1);       36920000
 USER_FILE_PI.SERV_EXTENSION(2)   = EDQBSDS_PI.SERV_EXTENSION(2);       36930000
 USER_FILE_PI.SERV_EXTENSION(3)   = EDQBSDS_PI.SERV_EXTENSION(3);       36940000
 USER_FILE_PI.SERV_EXTENSION(4)   = EDQBSDS_PI.SERV_EXTENSION(4);       36950000
 USER_FILE_PI.SERV_EXTENSION(5)   = EDQBSDS_PI.SERV_EXTENSION(5);       36960000
 USER_FILE_PI.BASE_WARRANTY_SLC   = EDQBSDS_PI.BASE_WARRANTY_SLC;       36970000
                                                  /* EOC CEDS00000527 */36980000
                                                                        36990000
 END RCBCS3M_PI_TO_USERFILE;                                            37000000
1/*********************************************************************/37010000
 /*                                                                   */37020000
 /* MODULE NAME      : RCBCS3M_COMM_TO_USERFILE                       */37030000
 /*                                                                   */37040000
 /* DESCRIPTION      : MOVE DATA(ACCORDING TO PRIORITY RULES) FROM    */37050000
 /*                    COMMAREA TO USER-EXIT                          */37060000
 /*                                                                   */37070000
 /*********************************************************************/37080000
 RCBCS3M_COMM_TO_USERFILE: PROC;                                        37090000
                                                       /* SOC RB01320 */37100000
 /* USER_FILE_RCBDRI1.SERNO         = COMMAREA.IHSITOS.IHSIMID.IOLCPLM||37110000
                                      COMMAREA.IHSITOS.IHSIMID.IHSINBR; 37120000
 USER_FILE_RCBDRI1.MKBINA             = COMMAREA.GMKTMBO;             */37130000
                                                                        37140000
        /*USER_FILE_RCBDRI1.SRCC0MD = COMMAREA.SRCCCMD*/                37150000
 /*                                                                     37160000
 USER_FILE_RCBDRI1.SRCC0MD.TAKE_CEDS  = COMMAREA.TAKE_CEDS;             37170000
 USER_FILE_RCBDRI1.SRCC0MD.EFFDATE    = COMMAREA.DDBSEFF;               37180000
 USER_FILE_RCBDRI1.SRCC0MD.ENDDATE    = COMMAREA.EDQBSDS.DDBSMED;       37190000
 USER_FILE_RCBDRI1.SRCC0MD.SSRCIND    = COMMAREA.SRCCCMD.SSRCIND;       37200000
 USER_FILE_RCBDRI1.SRCC0MD.CUNOUSE    = COMMAREA.SRCCCMD.ICUSHWU;       37210000
 USER_FILE_RCBDRI1.SRCC0MD.IODPDBU    = COMMAREA.IODPDBU;               37220000
 USER_FILE_RCBDRI1.SRCC0MD.IAGRNBR    = COMMAREA.IAGRNBR;               37230000
 USER_FILE_RCBDRI1.SRCC0MD.IAGRTCN    = COMMAREA.IAGRTCN;               37240000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(1) = COMMAREA.RHSIESA.IHSIESA(1);    37250000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(2) = COMMAREA.RHSIESA.IHSIESA(2);    37260000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(3) = COMMAREA.RHSIESA.IHSIESA(3);    37270000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(4) = COMMAREA.RHSIESA.IHSIESA(4);    37280000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(5) = COMMAREA.RHSIESA.IHSIESA(5);    37290000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(1) = COMMAREA.RAGRWCP.DAGRMFR(1);    37300000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(1) = COMMAREA.RAGRWCP.DAGRMTO(1);    37310000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(2) = COMMAREA.RAGRWCP.DAGRMFR(2);    37320000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(2) = COMMAREA.RAGRWCP.DAGRMTO(2);    37330000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(3) = COMMAREA.RAGRWCP.DAGRMFR(3);    37340000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(3) = COMMAREA.RAGRWCP.DAGRMTO(3);    37350000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(4) = COMMAREA.RAGRWCP.DAGRMFR(4);    37360000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(4) = COMMAREA.RAGRWCP.DAGRMTO(4);    37370000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(5) = COMMAREA.RAGRWCP.DAGRMFR(5);    37380000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(5) = COMMAREA.RAGRWCP.DAGRMTO(5);    37390000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(6) = COMMAREA.RAGRWCP.DAGRMFR(6);    37400000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(6) = COMMAREA.RAGRWCP.DAGRMTO(6);    37410000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(7) = COMMAREA.RAGRWCP.DAGRMFR(7);    37420000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(7) = COMMAREA.RAGRWCP.DAGRMTO(7);    37430000
 USER_FILE_RCBDRI1.SRCC0MD.TPMNT      = COMMAREA.CHSISTM;               37440000
 USER_FILE_RCBDRI1.SRCC0MD.SERV_DEL_M = COMMAREA.SERVICE_DLVR_METHD;    37450000
 USER_FILE_RCBDRI1.SRCC0MD.SDF        = COMMAREA.SERVICE_DELIV_FLAG;    37460000
 USER_FILE_RCBDRI1.SRCC0MD.SLC        = COMMAREA.SERVICE_LVL_CODE;      37470000
 USER_FILE_RCBDRI1.SRCC0MD.PRES_VALID = COMMAREA.PRES_VALID_FLAG;       37480000
 USER_FILE_RCBDRI1.SRCC0MD.TIMEZERO   = COMMAREA.TIMEZERO;              37490000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_1 =                         37500000
                                     COMMAREA.CBK_TIMESPAN_QTY(1);      37510000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_1 =                         37520000
                                     COMMAREA.CBK_TIMESPAN_UNIT(1);     37530000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_1 =                         37540000
                                     COMMAREA.CBK_TIMESPAN_COM(1);      37550000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_2 =                         37560000
                                     COMMAREA.CBK_TIMESPAN_QTY(2);      37570000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_2 =                         37580000
                                     COMMAREA.CBK_TIMESPAN_UNIT(2);     37590000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_2 =                         37600000
                                     COMMAREA.CBK_TIMESPAN_COM(2);      37610000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_3 =                         37620000
                                     COMMAREA.CBK_TIMESPAN_QTY(3);      37630000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_3 =                         37640000
                                     COMMAREA.CBK_TIMESPAN_UNIT(3);     37650000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_3 =                         37660000
                                     COMMAREA.CBK_TIMESPAN_COM(3);      37670000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_1 =                          37680000
                                     COMMAREA.TAT_TIMESPAN_QTY(1);      37690000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_1 =                          37700000
                                     COMMAREA.TAT_TIMESPAN_UNIT(1);     37710000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_1 =                          37720000
                                     COMMAREA.TAT_TIMESPAN_COM(1);      37730000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_2 =                          37740000
                                     COMMAREA.TAT_TIMESPAN_QTY(2);      37750000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_2 =                          37760000
                                     COMMAREA.TAT_TIMESPAN_UNIT(2);     37770000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_2 =                          37780000
                                     COMMAREA.TAT_TIMESPAN_COM(2);      37790000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_3 =                          37800000
                                     COMMAREA.TAT_TIMESPAN_QTY(3);      37810000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_3 =                          37820000
                                     COMMAREA.TAT_TIMESPAN_UNIT(3);     37830000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_3 =                          37840000
                                     COMMAREA.TAT_TIMESPAN_COM(3);      37850000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_1  =                            37860000
                                     COMMAREA.FIX_TIMESPAN_QTY(1);      37870000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_1  =                            37880000
                                     COMMAREA.FIX_TIMESPAN_UNIT(1);     37890000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_1  =                            37900000
                                     COMMAREA.FIX_TIMESPAN_COM(1);      37910000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_2  =                            37920000
                                     COMMAREA.FIX_TIMESPAN_QTY(2);      37930000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_2  =                            37940000
                                     COMMAREA.FIX_TIMESPAN_UNIT(2);     37950000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_2  =                            37960000
                                     COMMAREA.FIX_TIMESPAN_COM(2);      37970000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_3  =                            37980000
                                     COMMAREA.FIX_TIMESPAN_QTY(3);      37990000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_3  =                            38000000
                                     COMMAREA.FIX_TIMESPAN_UNIT(3);     38010000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_3  =                            38020000
                                     COMMAREA.FIX_TIMESPAN_COM(3);      38030000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_1 =                          38040000
                                     COMMAREA.CTY_TIMESPAN_QTY(1);      38050000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_1 =                          38060000
                                     COMMAREA.CTY_TIMESPAN_UNIT(1);     38070000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_1 =                          38080000
                                     COMMAREA.CTY_TIMESPAN_COM(1);      38090000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_2 =                          38100000
                                     COMMAREA.CTY_TIMESPAN_QTY(2);      38110000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_2 =                          38120000
                                     COMMAREA.CTY_TIMESPAN_UNIT(2);     38130000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_2 =                          38140000
                                     COMMAREA.CTY_TIMESPAN_COM(2);      38150000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_3 =                          38160000
                                     COMMAREA.CTY_TIMESPAN_QTY(3);      38170000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_3 =                          38180000
                                     COMMAREA.CTY_TIMESPAN_UNIT(3);     38190000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_3 =                          38200000
                                     COMMAREA.CTY_TIMESPAN_COM(3);      38210000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_1 =                         38220000
                                     COMMAREA.ONS_TIMESPAN_QTY(1);      38230000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_1 =                         38240000
                                     COMMAREA.ONS_TIMESPAN_UNIT(1);     38250000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_1 =                         38260000
                                     COMMAREA.ONS_TIMESPAN_COM(1);      38270000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_2 =                         38280000
                                     COMMAREA.ONS_TIMESPAN_QTY(2);      38290000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_2 =                         38300000
                                     COMMAREA.ONS_TIMESPAN_UNIT(2);     38310000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_2 =                         38320000
                                     COMMAREA.ONS_TIMESPAN_COM(2);      38330000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_3 =                         38340000
                                     COMMAREA.ONS_TIMESPAN_QTY(3);      38350000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_3 =                         38360000
                                     COMMAREA.ONS_TIMESPAN_UNIT(3);     38370000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_3 =                         38380000
                                     COMMAREA.ONS_TIMESPAN_COM(3);      38390000
 USER_FILE_RCBDRI1.SRCC0MD.COMMENT_TEXT = COMMAREA.DESCRIPTION;         38400000
 USER_FILE_RCBDRI1.SRCC0MD.CAGRFOR      = COMMAREA.CAGRFOR;             38410000
 USER_FILE_RCBDRI1.SRCC0MD.CAGROPT      = COMMAREA.CAGROPT;             38420000
 USER_FILE_RCBDRI1.SRCC0MD.CSLMRPQ      = COMMAREA.CAGRMSO;             38430000
 USER_FILE_RCBDRI1.SRCC0MD.IAGRIAH      = COMMAREA.CAGRIAH;           */38440000
   /* OTHERS FIELDS */                                                  38450000
 /* USER_FILE_RCBDRI1.QCUOHVP              = COMMAREA.QCUOHVP;          38460000
 USER_FILE_RCBDRI1.TYPE                 = COMMAREA.IHSITOS.CSLMTYP;     38470000
 USER_FILE_RCBDRI1.MOD                  = COMMAREA.CSLMMOD;             38480000
 USER_FILE_RCBDRI1.BUILT_TO_MOD         = COMMAREA.BUILT_TO_MODEL_NR;   38490000
 USER_FILE_RCBDRI1.CPUTYPE              = COMMAREA.ISLMCPU;             38500000
 USER_FILE_RCBDRI1.ICUSANO =         COMMAREA.ICUSANO;                  38510000
 USER_FILE_RCBDRI1.ORDREF               = COMMAREA.ICUOORN;             38520000
 USER_FILE_RCBDRI1.TPAGR                = COMMAREA.CAGRTYP;             38530000
 USER_FILE_RCBDRI1.DPSYSNO              = COMMAREA.ICUOSYN;             38540000
 USER_FILE_RCBDRI1.WED                  = COMMAREA.DAGREWP;             38550000
 USER_FILE_RCBDRI1.DPIS                 = COMMAREA.CHSIISC;             38560000
 USER_FILE_RCBDRI1.MKINSDAT             = COMMAREA.DHSIINS;             38570000
 USER_FILE_RCBDRI1.MKSCREMD             = COMMAREA.DRMOSMR;             38580000
 USER_FILE_RCBDRF1.CUNOUSE              = COMMAREA.SRCCCMD.ICUSHWU;     38590000
 USER_FILE_RCBDRF1.IODPDBU              = COMMAREA.SRCCCMD.IODPDBU;     38600000
 USER_FILE_RCBDRF1.ICUSANO              = COMMAREA.CUSCODE.ICUSANO;   */38610000
                                                  /* SOC CEDS00000527 */38620000
 /*USER_FILE_RCBDRI1.DEALER_NUMBER     = COMMAREA.DEALER;               38630000
 USER_FILE_RCBDRI1.UDTEUEX           = COMMAREA.UDTEUEX;                38640000
 USER_FILE_RCBDRI1.UDTECUF           = COMMAREA.UDTECUF;                38650000
 USER_FILE_RCBDRI1.SERV_EXTENSION(1) = COMMAREA.SERV_EXTENSION(1);      38660000
 USER_FILE_RCBDRI1.SERV_EXTENSION(2) = COMMAREA.SERV_EXTENSION(2);      38670000
 USER_FILE_RCBDRI1.SERV_EXTENSION(3) = COMMAREA.SERV_EXTENSION(3);      38680000
 USER_FILE_RCBDRI1.SERV_EXTENSION(4) = COMMAREA.SERV_EXTENSION(4);      38690000
 USER_FILE_RCBDRI1.SERV_EXTENSION(5) = COMMAREA.SERV_EXTENSION(5);      38700000
 USER_FILE_RCBDRI1.BASE_WARRANTY_SLC = COMMAREA.BASE_WARRANTY_SLC;    */38710000
                                                  /* EOC CEDS00000527 */38720000
                                                                        38730000
                                                                        38740000
 USER_FILE_RCBDRI1.SERNO            =                                   38750000
                            COMMAREA.EDQBSDS.IHSITOS.IHSIMID.IOLCPLM  ||38760000
                            COMMAREA.EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;38770000
 USER_FILE_RCBDRI1.MKBINA             = COMMAREA.EDQBSDS.GMKTMBO;       38780000
 USER_FILE_RCBDRI1.SRCC0MD.TAKE_CEDS  = COMMAREA.EDQBSDS.TAKE_CEDS;     38790000
 USER_FILE_RCBDRI1.SRCC0MD.EFFDATE    = COMMAREA.EDQBSDS.DDBSEFF;       38800000
 USER_FILE_RCBDRI1.SRCC0MD.ENDDATE    = COMMAREA.EDQBSDS.DDBSMED;       38810000
 USER_FILE_RCBDRI1.SRCC0MD.SSRCIND    =                                 38820000
                                  COMMAREA.EDQBSDS.SRCCCMD.SSRCIND;     38830000
 USER_FILE_RCBDRI1.SRCC0MD.CUNOUSE    =                                 38840000
                                  COMMAREA.EDQBSDS.SRCCCMD.ICUSHWU;     38850000
 USER_FILE_RCBDRI1.SRCC0MD.IODPDBU    = COMMAREA.EDQBSDS.IODPDBU;       38860000
 USER_FILE_RCBDRI1.SRCC0MD.IAGRNBR    = COMMAREA.EDQBSDS.IAGRNBR;       38870000
 USER_FILE_RCBDRI1.SRCC0MD.IAGRTCN    = COMMAREA.EDQBSDS.IAGRTCN;       38880000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(1) =                                 38890000
                               COMMAREA.EDQBSDS.RHSIESA.IHSIESA(1);     38900000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(2) =                                 38910000
                               COMMAREA.EDQBSDS.RHSIESA.IHSIESA(2);     38920000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(3) =                                 38930000
                               COMMAREA.EDQBSDS.RHSIESA.IHSIESA(3);     38940000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(4) =                                 38950000
                               COMMAREA.EDQBSDS.RHSIESA.IHSIESA(4);     38960000
 USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(5) =                                 38970000
                               COMMAREA.EDQBSDS.RHSIESA.IHSIESA(5);     38980000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(1) =                                 38990000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(1);     39000000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(1) =                                 39010000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(1);     39020000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(2) =                                 39030000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(2);     39040000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(2) =                                 39050000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(2);     39060000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(3) =                                 39070000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(3);     39080000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(3) =                                 39090000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(3);     39100000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(4) =                                 39110000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(4);     39120000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(4) =                                 39130000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(4);     39140000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(5) =                                 39150000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(5);     39160000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(5) =                                 39170000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(5);     39180000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(6) =                                 39190000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(6);     39200000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(6) =                                 39210000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(6);     39220000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(7) =                                 39230000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(7);     39240000
 USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(7) =                                 39250000
                               COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(7);     39260000
 USER_FILE_RCBDRI1.SRCC0MD.TPMNT      = COMMAREA.EDQBSDS.CHSISTM;       39270000
 USER_FILE_RCBDRI1.SRCC0MD.SERV_DEL_M =                                 39280000
                               COMMAREA.EDQBSDS.SERVICE_DLVR_METHD;     39290000
 USER_FILE_RCBDRI1.SRCC0MD.SDF        =                                 39300000
                               COMMAREA.EDQBSDS.SERVICE_DELIV_FLAG;     39310000
 USER_FILE_RCBDRI1.SRCC0MD.SLC        =                                 39320000
                               COMMAREA.EDQBSDS.SERVICE_LVL_CODE;       39330000
 USER_FILE_RCBDRI1.SRCC0MD.PRES_VALID =                                 39340000
                               COMMAREA.EDQBSDS.PRES_VALID_FLAG;        39350000
 USER_FILE_RCBDRI1.SRCC0MD.TIMEZERO   =                                 39360000
                               COMMAREA.EDQBSDS.TIMEZERO;               39370000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_1 =                         39380000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_QTY(1);    39390000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_1 =                         39400000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_UNIT(1);   39410000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_1 =                         39420000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_COM(1);    39430000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_2 =                         39440000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_QTY(2);    39450000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_2 =                         39460000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_UNIT(2);   39470000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_2 =                         39480000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_COM(2);    39490000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_3 =                         39500000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_QTY(3);    39510000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_3 =                         39520000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_UNIT(3);   39530000
 USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_3 =                         39540000
                               COMMAREA.EDQBSDS.CBK_TIMESPAN_COM(3);    39550000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_1 =                          39560000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_QTY(1);    39570000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_1 =                          39580000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_UNIT(1);   39590000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_1 =                          39600000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_COM(1);    39610000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_2 =                          39620000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_QTY(2);    39630000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_2 =                          39640000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_UNIT(2);   39650000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_2 =                          39660000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_COM(2);    39670000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_3 =                          39680000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_QTY(3);    39690000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_3 =                          39700000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_UNIT(3);   39710000
 USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_3 =                          39720000
                               COMMAREA.EDQBSDS.TAT_TIMESPAN_COM(3);    39730000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_1  =                            39740000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_QTY(1);    39750000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_1  =                            39760000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_UNIT(1);   39770000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_1  =                            39780000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_COM(1);    39790000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_2  =                            39800000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_QTY(2);    39810000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_2  =                            39820000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_UNIT(2);   39830000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_2  =                            39840000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_COM(2);    39850000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_3  =                            39860000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_QTY(3);    39870000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_3  =                            39880000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_UNIT(3);   39890000
 USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_3  =                            39900000
                               COMMAREA.EDQBSDS.FIX_TIMESPAN_COM(3);    39910000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_1 =                          39920000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_QTY(1);    39930000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_1 =                          39940000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_UNIT(1);   39950000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_1 =                          39960000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_COM(1);    39970000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_2 =                          39980000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_QTY(2);    39990000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_2 =                          40000000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_UNIT(2);   40010000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_2 =                          40020000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_COM(2);    40030000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_3 =                          40040000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_QTY(3);    40050000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_3 =                          40060000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_UNIT(3);   40070000
 USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_3 =                          40080000
                               COMMAREA.EDQBSDS.CTY_TIMESPAN_COM(3);    40090000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_1 =                         40100000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_QTY(1);    40110000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_1 =                         40120000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_UNIT(1);   40130000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_1 =                         40140000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_COM(1);    40150000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_2 =                         40160000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_QTY(2);    40170000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_2 =                         40180000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_UNIT(2);   40190000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_2 =                         40200000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_COM(2);    40210000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_3 =                         40220000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_QTY(3);    40230000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_3 =                         40240000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_UNIT(3);   40250000
 USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_3 =                         40260000
                               COMMAREA.EDQBSDS.ONS_TIMESPAN_COM(3);    40270000
 USER_FILE_RCBDRI1.SRCC0MD.COMMENT_TEXT = COMMAREA.EDQBSDS.DESCRIPTION; 40280000
 USER_FILE_RCBDRI1.SRCC0MD.CAGRFOR      = COMMAREA.EDQBSDS.CAGRFOR;     40290000
 USER_FILE_RCBDRI1.SRCC0MD.CAGROPT      = COMMAREA.EDQBSDS.CAGROPT;     40300000
 USER_FILE_RCBDRI1.SRCC0MD.CSLMRPQ      = COMMAREA.EDQBSDS.CAGRMSO;     40310000
 USER_FILE_RCBDRI1.SRCC0MD.IAGRIAH      = COMMAREA.EDQBSDS.CAGRIAH;     40320000
   /* OTHERS FIELDS */                                                  40330000
 USER_FILE_RCBDRI1.QCUOHVP              = COMMAREA.EDQBSDS.QCUOHVP;     40340000
 USER_FILE_RCBDRI1.TYPE                 =                               40350000
                                  COMMAREA.EDQBSDS.IHSITOS.CSLMTYP;     40360000
 USER_FILE_RCBDRI1.MOD                  = COMMAREA.EDQBSDS.CSLMMOD;     40370000
 USER_FILE_RCBDRI1.BUILT_TO_MOD         =                               40380000
                                  COMMAREA.EDQBSDS.BUILT_TO_MODEL_NR;   40390000
 USER_FILE_RCBDRI1.CPUTYPE              = COMMAREA.EDQBSDS.ISLMCPU;     40400000
 /*USER_FILE_RCBDRI1.ICUSANO =         COMMAREA.ICUSANO; */             40410000
 USER_FILE_RCBDRI1.ORDREF               = COMMAREA.EDQBSDS.ICUOORN;     40420000
 USER_FILE_RCBDRI1.TPAGR                = COMMAREA.EDQBSDS.CAGRTYP;     40430000
 USER_FILE_RCBDRI1.DPSYSNO              = COMMAREA.EDQBSDS.ICUOSYN;     40440000
 USER_FILE_RCBDRI1.WED                  = COMMAREA.EDQBSDS.DAGREWP;     40450000
 USER_FILE_RCBDRI1.DPIS                 = COMMAREA.EDQBSDS.CHSIISC;     40460000
 USER_FILE_RCBDRI1.MKINSDAT             = COMMAREA.EDQBSDS.DHSIINS;     40470000
 USER_FILE_RCBDRI1.MKSCREMD             = COMMAREA.EDQBSDS.DRMOSMR;     40480000
 USER_FILE_RCBDRF1.CUNOUSE              =                               40490000
                                  COMMAREA.EDQBSDS.SRCCCMD.ICUSHWU;     40500000
 USER_FILE_RCBDRF1.IODPDBU              =                               40510000
                                  COMMAREA.EDQBSDS.SRCCCMD.IODPDBU;     40520000
 USER_FILE_RCBDRF1.ICUSANO              =                               40530000
                                  COMMAREA.EDQBSDS.CUSCODE.ICUSANO;     40540000
 USER_FILE_RCBDRI1.DEALER_NUMBER     = COMMAREA.EDQBSDS.DEALER;         40550000
 USER_FILE_RCBDRI1.UDTEUEX           = COMMAREA.EDQBSDS.UDTEUEX;        40560000
 USER_FILE_RCBDRI1.UDTECUF           = COMMAREA.EDQBSDS.UDTECUF;        40570000
 USER_FILE_RCBDRI1.SERV_EXTENSION(1) =                                  40580000
                                  COMMAREA.EDQBSDS.SERV_EXTENSION(1);   40590000
 USER_FILE_RCBDRI1.SERV_EXTENSION(2) =                                  40600000
                                  COMMAREA.EDQBSDS.SERV_EXTENSION(2);   40610000
 USER_FILE_RCBDRI1.SERV_EXTENSION(3) =                                  40620000
                                  COMMAREA.EDQBSDS.SERV_EXTENSION(3);   40630000
 USER_FILE_RCBDRI1.SERV_EXTENSION(4) =                                  40640000
                                  COMMAREA.EDQBSDS.SERV_EXTENSION(4);   40650000
 USER_FILE_RCBDRI1.SERV_EXTENSION(5) =                                  40660000
                                  COMMAREA.EDQBSDS.SERV_EXTENSION(5);   40670000
 USER_FILE_RCBDRI1.BASE_WARRANTY_SLC =                                  40680000
                                  COMMAREA.EDQBSDS.BASE_WARRANTY_SLC;   40690000
                                                       /* EOC RB01320 */40700000
 END RCBCS3M_COMM_TO_USERFILE;                                          40710000
1/*********************************************************************/40720000
 /*                                                                   */40730000
 /* MODULE NAME      : RCBCS3M_USERFILE_TO_COMM                       */40740000
 /*                                                                   */40750000
 /* DESCRIPTION      : MOVE DATA FROM USER-EXIT STRUCTURE TO COMMAREA */40760000
 /*                                                                   */40770000
 /*********************************************************************/40780000
 RCBCS3M_USERFILE_TO_COMM: PROC;                                        40790000
                                                       /* SOC RB01320 */40800000
 /*COMMAREA.GMKTMBO          = USER_FILE_RCBDRI1.MKBINA;              */40810000
                                                                        40820000
    /*COMMAREA.SRCCCMD = USER_FILE_RCBDRI1.SRCC0MD*/                    40830000
 /*                                                                     40840000
 COMMAREA.TAKE_CEDS         = USER_FILE_RCBDRI1.SRCC0MD.TAKE_CEDS;      40850000
 COMMAREA.DDBSEFF           = USER_FILE_RCBDRI1.SRCC0MD.EFFDATE;        40860000
 COMMAREA.EDQBSDS.DDBSMED   = USER_FILE_RCBDRI1.SRCC0MD.ENDDATE;        40870000
 COMMAREA.SRCCCMD.SSRCIND   = USER_FILE_RCBDRI1.SRCC0MD.SSRCIND;        40880000
 COMMAREA.SRCCCMD.ICUSHWU   = USER_FILE_RCBDRI1.SRCC0MD.CUNOUSE;        40890000
 COMMAREA.IODPDBU           = USER_FILE_RCBDRI1.SRCC0MD.IODPDBU;        40900000
 COMMAREA.IAGRNBR           = USER_FILE_RCBDRI1.SRCC0MD.IAGRNBR;        40910000
 COMMAREA.IAGRTCN           = USER_FILE_RCBDRI1.SRCC0MD.IAGRTCN;        40920000
 COMMAREA.RHSIESA.IHSIESA(1) = USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(1);    40930000
 COMMAREA.RHSIESA.IHSIESA(2) = USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(2);    40940000
 COMMAREA.RHSIESA.IHSIESA(3) = USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(3);    40950000
 COMMAREA.RHSIESA.IHSIESA(4) = USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(4);    40960000
 COMMAREA.RHSIESA.IHSIESA(5) = USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(5);    40970000
 COMMAREA.RAGRWCP.DAGRMFR(1) = USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(1);    40980000
 COMMAREA.RAGRWCP.DAGRMTO(1) = USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(1);    40990000
 COMMAREA.RAGRWCP.DAGRMFR(2) = USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(2);    41000000
 COMMAREA.RAGRWCP.DAGRMTO(2) = USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(2);    41010000
 COMMAREA.RAGRWCP.DAGRMFR(3) = USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(3);    41020000
 COMMAREA.RAGRWCP.DAGRMTO(3) = USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(3);    41030000
 COMMAREA.RAGRWCP.DAGRMFR(4)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(4);   41040000
 COMMAREA.RAGRWCP.DAGRMTO(4)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(4);   41050000
 COMMAREA.RAGRWCP.DAGRMFR(5)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(5);   41060000
 COMMAREA.RAGRWCP.DAGRMTO(5)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(5);   41070000
 COMMAREA.RAGRWCP.DAGRMFR(6)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(6);   41080000
 COMMAREA.RAGRWCP.DAGRMTO(6)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(6);   41090000
 COMMAREA.RAGRWCP.DAGRMFR(7)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(7);   41100000
 COMMAREA.RAGRWCP.DAGRMTO(7)  = USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(7);   41110000
 COMMAREA.CHSISTM             = USER_FILE_RCBDRI1.SRCC0MD.TPMNT;        41120000
 COMMAREA.SERVICE_DLVR_METHD  = USER_FILE_RCBDRI1.SRCC0MD.SERV_DEL_M;   41130000
 COMMAREA.SERVICE_DELIV_FLAG  = USER_FILE_RCBDRI1.SRCC0MD.SDF;          41140000
 COMMAREA.SERVICE_LVL_CODE    = USER_FILE_RCBDRI1.SRCC0MD.SLC;          41150000
 COMMAREA.PRES_VALID_FLAG     = USER_FILE_RCBDRI1.SRCC0MD.PRES_VALID;   41160000
 COMMAREA.TIMEZERO            = USER_FILE_RCBDRI1.SRCC0MD.TIMEZERO;     41170000
 COMMAREA.CBK_TIMESPAN_QTY(1) =                                         41180000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_1;   41190000
 COMMAREA.CBK_TIMESPAN_UNIT(1) =                                        41200000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_1;   41210000
 COMMAREA.CBK_TIMESPAN_COM(1) =                                         41220000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_1;   41230000
 COMMAREA.CBK_TIMESPAN_QTY(2) =                                         41240000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_2;   41250000
 COMMAREA.CBK_TIMESPAN_UNIT(2) =                                        41260000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_2;   41270000
 COMMAREA.CBK_TIMESPAN_COM(2) =                                         41280000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_2;   41290000
 COMMAREA.CBK_TIMESPAN_QTY(3) =                                         41300000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_3;   41310000
 COMMAREA.CBK_TIMESPAN_UNIT(3) =                                        41320000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_3;   41330000
 COMMAREA.CBK_TIMESPAN_COM(3) =                                         41340000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_3;   41350000
 COMMAREA.TAT_TIMESPAN_QTY(1) =                                         41360000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_1;    41370000
 COMMAREA.TAT_TIMESPAN_UNIT(1) =                                        41380000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_1;    41390000
 COMMAREA.TAT_TIMESPAN_COM(1) =                                         41400000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_1;    41410000
 COMMAREA.TAT_TIMESPAN_QTY(2) =                                         41420000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_2;    41430000
 COMMAREA.TAT_TIMESPAN_UNIT(2) =                                        41440000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_2;    41450000
 COMMAREA.TAT_TIMESPAN_COM(2) =                                         41460000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_2;    41470000
 COMMAREA.TAT_TIMESPAN_QTY(3) =                                         41480000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_3;    41490000
 COMMAREA.TAT_TIMESPAN_UNIT(3) =                                        41500000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_3;    41510000
 COMMAREA.TAT_TIMESPAN_COM(3) =                                         41520000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_3;    41530000
 COMMAREA.FIX_TIMESPAN_QTY(1) =                                         41540000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_1;       41550000
 COMMAREA.FIX_TIMESPAN_UNIT(1) =                                        41560000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_1;       41570000
 COMMAREA.FIX_TIMESPAN_COM(1) =                                         41580000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_1;       41590000
 COMMAREA.FIX_TIMESPAN_QTY(2) =                                         41600000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_2;       41610000
 COMMAREA.FIX_TIMESPAN_UNIT(2) =                                        41620000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_2;       41630000
 COMMAREA.FIX_TIMESPAN_COM(2) =                                         41640000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_2;       41650000
 COMMAREA.FIX_TIMESPAN_QTY(3) =                                         41660000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_3;       41670000
 COMMAREA.FIX_TIMESPAN_UNIT(3) =                                        41680000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_3;       41690000
 COMMAREA.FIX_TIMESPAN_COM(3) =                                         41700000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_3;       41710000
 COMMAREA.CTY_TIMESPAN_QTY(1) =                                         41720000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_1;    41730000
 COMMAREA.CTY_TIMESPAN_UNIT(1) =                                        41740000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_1;    41750000
 COMMAREA.CTY_TIMESPAN_COM(1) =                                         41760000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_1;    41770000
 COMMAREA.CTY_TIMESPAN_QTY(2) =                                         41780000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_2;    41790000
 COMMAREA.CTY_TIMESPAN_UNIT(2) =                                        41800000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_2;    41810000
 COMMAREA.CTY_TIMESPAN_COM(2) =                                         41820000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_2;    41830000
 COMMAREA.CTY_TIMESPAN_QTY(3) =                                         41840000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_3;    41850000
 COMMAREA.CTY_TIMESPAN_UNIT(3) =                                        41860000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_3;    41870000
 COMMAREA.CTY_TIMESPAN_COM(3) =                                         41880000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_3;    41890000
 COMMAREA.ONS_TIMESPAN_QTY(1) =                                         41900000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_1;   41910000
 COMMAREA.ONS_TIMESPAN_UNIT(1) =                                        41920000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_1;   41930000
 COMMAREA.ONS_TIMESPAN_COM(1) =                                         41940000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_1;   41950000
 COMMAREA.ONS_TIMESPAN_QTY(2) =                                         41960000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_2;   41970000
 COMMAREA.ONS_TIMESPAN_UNIT(2) =                                        41980000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_2;   41990000
 COMMAREA.ONS_TIMESPAN_COM(2) =                                         42000000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_2;   42010000
 COMMAREA.ONS_TIMESPAN_QTY(3) =                                         42020000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_3;   42030000
 COMMAREA.ONS_TIMESPAN_UNIT(3) =                                        42040000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_3;   42050000
 COMMAREA.ONS_TIMESPAN_COM(3) =                                         42060000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_3;   42070000
 COMMAREA.DESCRIPTION         = USER_FILE_RCBDRI1.SRCC0MD.COMMENT_TEXT; 42080000
 COMMAREA.CAGRFOR             = USER_FILE_RCBDRI1.SRCC0MD.CAGRFOR;      42090000
 COMMAREA.CAGROPT             = USER_FILE_RCBDRI1.SRCC0MD.CAGROPT;      42100000
 COMMAREA.CAGRMSO             = USER_FILE_RCBDRI1.SRCC0MD.CSLMRPQ;      42110000
 COMMAREA.CAGRIAH             = USER_FILE_RCBDRI1.SRCC0MD.IAGRIAH;   */ 42120000
   /* OTHERS FIELDS */                                                  42130000
 /*COMMAREA.QCUOHVP               = USER_FILE_RCBDRI1.QCUOHVP;          42140000
 COMMAREA.CSLMMOD               = USER_FILE_RCBDRI1.MOD;                42150000
 COMMAREA.BUILT_TO_MODEL_NR     = USER_FILE_RCBDRI1.BUILT_TO_MOD;       42160000
 COMMAREA.ISLMCPU               = USER_FILE_RCBDRI1.CPUTYPE;            42170000
 COMMAREA.ICUOORN               = USER_FILE_RCBDRI1.ORDREF;             42180000
 COMMAREA.CAGRTYP               = USER_FILE_RCBDRI1.TPAGR;              42190000
 COMMAREA.ICUOSYN               = USER_FILE_RCBDRI1.DPSYSNO;            42200000
 COMMAREA.DAGREWP               = USER_FILE_RCBDRI1.WED;                42210000
 COMMAREA.CHSIISC               = USER_FILE_RCBDRI1.DPIS;               42220000
 COMMAREA.DHSIINS               = USER_FILE_RCBDRI1.MKINSDAT;           42230000
 COMMAREA.DRMOSMR               = USER_FILE_RCBDRI1.MKSCREMD;         */42240000
                                                  /* SOC CEDS00000527 */42250000
 /*COMMAREA.DEALER              = USER_FILE_RCBDRI1.DEALER_NUMBER;      42260000
 COMMAREA.UDTEUEX             = USER_FILE_RCBDRI1.UDTEUEX;              42270000
 COMMAREA.UDTECUF             = USER_FILE_RCBDRI1.UDTECUF;              42280000
 COMMAREA.SERV_EXTENSION(1)   = USER_FILE_RCBDRI1.SERV_EXTENSION(1);    42290000
 COMMAREA.SERV_EXTENSION(2)   = USER_FILE_RCBDRI1.SERV_EXTENSION(2);    42300000
 COMMAREA.SERV_EXTENSION(3)   = USER_FILE_RCBDRI1.SERV_EXTENSION(3);    42310000
 COMMAREA.SERV_EXTENSION(4)   = USER_FILE_RCBDRI1.SERV_EXTENSION(4);    42320000
 COMMAREA.SERV_EXTENSION(5)   = USER_FILE_RCBDRI1.SERV_EXTENSION(5);    42330000
 COMMAREA.BASE_WARRANTY_SLC   = USER_FILE_RCBDRI1.BASE_WARRANTY_SLC;  */42340000
                                                  /* EOC CEDS00000527 */42350000
                                                                        42360000
 COMMAREA.EDQBSDS.GMKTMBO          = USER_FILE_RCBDRI1.MKBINA;          42370000
 COMMAREA.EDQBSDS.TAKE_CEDS       = USER_FILE_RCBDRI1.SRCC0MD.TAKE_CEDS;42380000
 COMMAREA.EDQBSDS.DDBSEFF         = USER_FILE_RCBDRI1.SRCC0MD.EFFDATE;  42390000
 COMMAREA.EDQBSDS.DDBSMED         = USER_FILE_RCBDRI1.SRCC0MD.ENDDATE;  42400000
 COMMAREA.EDQBSDS.SRCCCMD.SSRCIND = USER_FILE_RCBDRI1.SRCC0MD.SSRCIND;  42410000
 COMMAREA.EDQBSDS.SRCCCMD.ICUSHWU = USER_FILE_RCBDRI1.SRCC0MD.CUNOUSE;  42420000
 COMMAREA.EDQBSDS.IODPDBU         = USER_FILE_RCBDRI1.SRCC0MD.IODPDBU;  42430000
 COMMAREA.EDQBSDS.IAGRNBR         = USER_FILE_RCBDRI1.SRCC0MD.IAGRNBR;  42440000
 COMMAREA.EDQBSDS.IAGRTCN         = USER_FILE_RCBDRI1.SRCC0MD.IAGRTCN;  42450000
 COMMAREA.EDQBSDS.RHSIESA.IHSIESA(1) =                                  42460000
                                   USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(1);42470000
 COMMAREA.EDQBSDS.RHSIESA.IHSIESA(2) =                                  42480000
                                   USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(2);42490000
 COMMAREA.EDQBSDS.RHSIESA.IHSIESA(3) =                                  42500000
                                   USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(3);42510000
 COMMAREA.EDQBSDS.RHSIESA.IHSIESA(4) =                                  42520000
                                   USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(4);42530000
 COMMAREA.EDQBSDS.RHSIESA.IHSIESA(5) =                                  42540000
                                   USER_FILE_RCBDRI1.SRCC0MD.IHSIESA(5);42550000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(1) =                                  42560000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(1);42570000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(1) =                                  42580000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(1);42590000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(2) =                                  42600000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(2);42610000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(2) =                                  42620000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(2);42630000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(3) =                                  42640000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(3);42650000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(3) =                                  42660000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(3);42670000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(4)  =                                 42680000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(4);42690000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(4)  =                                 42700000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(4);42710000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(5)  =                                 42720000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(5);42730000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(5)  =                                 42740000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(5);42750000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(6)  =                                 42760000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(6);42770000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(6)  =                                 42780000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(6);42790000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMFR(7)  =                                 42800000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMFR(7);42810000
 COMMAREA.EDQBSDS.RAGRWCP.DAGRMTO(7)  =                                 42820000
                                   USER_FILE_RCBDRI1.SRCC0MD.DAGRMTO(7);42830000
 COMMAREA.EDQBSDS.CHSISTM             = USER_FILE_RCBDRI1.SRCC0MD.TPMNT;42840000
 COMMAREA.EDQBSDS.SERVICE_DLVR_METHD  =                                 42850000
                                   USER_FILE_RCBDRI1.SRCC0MD.SERV_DEL_M;42860000
 COMMAREA.EDQBSDS.SERVICE_DELIV_FLAG  =                                 42870000
                                   USER_FILE_RCBDRI1.SRCC0MD.SDF;       42880000
 COMMAREA.EDQBSDS.SERVICE_LVL_CODE    =                                 42890000
                                   USER_FILE_RCBDRI1.SRCC0MD.SLC;       42900000
 COMMAREA.EDQBSDS.PRES_VALID_FLAG     =                                 42910000
                                   USER_FILE_RCBDRI1.SRCC0MD.PRES_VALID;42920000
 COMMAREA.EDQBSDS.TIMEZERO   = USER_FILE_RCBDRI1.SRCC0MD.TIMEZERO;      42930000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_QTY(1) =                                 42940000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_1;   42950000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_UNIT(1) =                                42960000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_1;   42970000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_COM(1) =                                 42980000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_1;   42990000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_QTY(2) =                                 43000000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_2;   43010000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_UNIT(2) =                                43020000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_2;   43030000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_COM(2) =                                 43040000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_2;   43050000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_QTY(3) =                                 43060000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_QTY_3;   43070000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_UNIT(3) =                                43080000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_UNT_3;   43090000
 COMMAREA.EDQBSDS.CBK_TIMESPAN_COM(3) =                                 43100000
                        USER_FILE_RCBDRI1.SRCC0MD.CONTACT_TIME_COM_3;   43110000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_QTY(1) =                                 43120000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_1;    43130000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_UNIT(1) =                                43140000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_1;    43150000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_COM(1) =                                 43160000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_1;    43170000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_QTY(2) =                                 43180000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_2;    43190000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_UNIT(2) =                                43200000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_2;    43210000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_COM(2) =                                 43220000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_2;    43230000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_QTY(3) =                                 43240000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_QTY_3;    43250000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_UNIT(3) =                                43260000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_UNT_3;    43270000
 COMMAREA.EDQBSDS.TAT_TIMESPAN_COM(3) =                                 43280000
                        USER_FILE_RCBDRI1.SRCC0MD.ONSITE_RESP_COM_3;    43290000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_QTY(1) =                                 43300000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_1;       43310000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_UNIT(1) =                                43320000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_1;       43330000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_COM(1) =                                 43340000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_1;       43350000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_QTY(2) =                                 43360000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_2;       43370000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_UNIT(2) =                                43380000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_2;       43390000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_COM(2) =                                 43400000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_2;       43410000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_QTY(3) =                                 43420000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_QTY_3;       43430000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_UNIT(3) =                                43440000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_UNT_3;       43450000
 COMMAREA.EDQBSDS.FIX_TIMESPAN_COM(3) =                                 43460000
                        USER_FILE_RCBDRI1.SRCC0MD.FIX_TIME_COM_3;       43470000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_QTY(1) =                                 43480000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_1;    43490000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_UNIT(1) =                                43500000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_1;    43510000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_COM(1) =                                 43520000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_1;    43530000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_QTY(2) =                                 43540000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_2;    43550000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_UNIT(2) =                                43560000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_2;    43570000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_COM(2) =                                 43580000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_2;    43590000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_QTY(3) =                                 43600000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_QTY_3;    43610000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_UNIT(3) =                                43620000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_UNT_3;    43630000
 COMMAREA.EDQBSDS.CTY_TIMESPAN_COM(3) =                                 43640000
                        USER_FILE_RCBDRI1.SRCC0MD.TURN_AROUND_COM_3;    43650000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_QTY(1) =                                 43660000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_1;   43670000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_UNIT(1) =                                43680000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_1;   43690000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_COM(1) =                                 43700000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_1;   43710000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_QTY(2) =                                 43720000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_2;   43730000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_UNIT(2) =                                43740000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_2;   43750000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_COM(2) =                                 43760000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_2;   43770000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_QTY(3) =                                 43780000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_QTY_3;   43790000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_UNIT(3) =                                43800000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_UNT_3;   43810000
 COMMAREA.EDQBSDS.ONS_TIMESPAN_COM(3) =                                 43820000
                        USER_FILE_RCBDRI1.SRCC0MD.PRT_ONS_TIME_COM_3;   43830000
 COMMAREA.EDQBSDS.DESCRIPTION = USER_FILE_RCBDRI1.SRCC0MD.COMMENT_TEXT; 43840000
 COMMAREA.EDQBSDS.CAGRFOR     = USER_FILE_RCBDRI1.SRCC0MD.CAGRFOR;      43850000
 COMMAREA.EDQBSDS.CAGROPT     = USER_FILE_RCBDRI1.SRCC0MD.CAGROPT;      43860000
 COMMAREA.EDQBSDS.CAGRMSO     = USER_FILE_RCBDRI1.SRCC0MD.CSLMRPQ;      43870000
 COMMAREA.EDQBSDS.CAGRIAH     = USER_FILE_RCBDRI1.SRCC0MD.IAGRIAH;      43880000
   /* OTHERS FIELDS */                                                  43890000
 COMMAREA.EDQBSDS.QCUOHVP     = USER_FILE_RCBDRI1.QCUOHVP;              43900000
 COMMAREA.EDQBSDS.CSLMMOD     = USER_FILE_RCBDRI1.MOD;                  43910000
 COMMAREA.EDQBSDS.BUILT_TO_MODEL_NR  = USER_FILE_RCBDRI1.BUILT_TO_MOD;  43920000
 COMMAREA.EDQBSDS.ISLMCPU     = USER_FILE_RCBDRI1.CPUTYPE;              43930000
 COMMAREA.EDQBSDS.ICUOORN     = USER_FILE_RCBDRI1.ORDREF;               43940000
 COMMAREA.EDQBSDS.CAGRTYP     = USER_FILE_RCBDRI1.TPAGR;                43950000
 COMMAREA.EDQBSDS.ICUOSYN     = USER_FILE_RCBDRI1.DPSYSNO;              43960000
 COMMAREA.EDQBSDS.DAGREWP     = USER_FILE_RCBDRI1.WED;                  43970000
 COMMAREA.EDQBSDS.CHSIISC     = USER_FILE_RCBDRI1.DPIS;                 43980000
 COMMAREA.EDQBSDS.DHSIINS     = USER_FILE_RCBDRI1.MKINSDAT;             43990000
 COMMAREA.EDQBSDS.DRMOSMR     = USER_FILE_RCBDRI1.MKSCREMD;             44000000
 COMMAREA.EDQBSDS.DEALER      = USER_FILE_RCBDRI1.DEALER_NUMBER;        44010000
 COMMAREA.EDQBSDS.UDTEUEX     = USER_FILE_RCBDRI1.UDTEUEX;              44020000
 COMMAREA.EDQBSDS.UDTECUF     = USER_FILE_RCBDRI1.UDTECUF;              44030000
 COMMAREA.EDQBSDS.SERV_EXTENSION(1)   =                                 44040000
                                USER_FILE_RCBDRI1.SERV_EXTENSION(1);    44050000
 COMMAREA.EDQBSDS.SERV_EXTENSION(2)   =                                 44060000
                                USER_FILE_RCBDRI1.SERV_EXTENSION(2);    44070000
 COMMAREA.EDQBSDS.SERV_EXTENSION(3)   =                                 44080000
                                USER_FILE_RCBDRI1.SERV_EXTENSION(3);    44090000
 COMMAREA.EDQBSDS.SERV_EXTENSION(4)   =                                 44100000
                                USER_FILE_RCBDRI1.SERV_EXTENSION(4);    44110000
 COMMAREA.EDQBSDS.SERV_EXTENSION(5)   =                                 44120000
                                USER_FILE_RCBDRI1.SERV_EXTENSION(5);    44130000
 COMMAREA.EDQBSDS.BASE_WARRANTY_SLC   =                                 44140000
                                USER_FILE_RCBDRI1.BASE_WARRANTY_SLC;    44150000
                                                       /* EOC RB01320 */44160000
 END RCBCS3M_USERFILE_TO_COMM;                                          44170000
 /*********************************************************************/44180000
 /*                                                                   */44190000
 /* MODULE NAME      : RCBCS3M_READ_HW_STATUS                         */44200000
 /*                                                                   */44210000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0110    */44220000
 /*                                                                   */44230000
 /*********************************************************************/44240000
0RCBCS3M_READ_HW_STATUS : PROC;                                         44250000
                                                                        44260000
 EXEC SQL                                                               44270000
      SELECT T110.STATUS                                                44280000
       INTO :TB_RCBV110.STATUS  :WRK_INDNULL                            44290000
      FROM   RCBV0110_HW_STATUS  T110                                   44300000
      WHERE  T110.PRODUCT_TYPE     = :REQTYPE                           44310000
  /*    AND  T110.ORIGIN          = :REQORIG            SOC RB01320 */  44320000
  /*    AND  T110.SEQUENCE_NUMBER = :REQSEQN    */                      44330000
                                                 /* SOC CEDS00000727 */ 44340000
  /*    AND  ((T110.ORIGIN          = :WRK_ORIGIN                       44350000
               AND  T110.SEQUENCE_NUMBER = :WRK_SEQ_NO)                 44360000
             OR (T110.ORIGIN||T110.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))44370000
                                                   *//* EOC RB01320 */  44380000
        AND  T110.ORIGIN        = SUBSTR(:WRK_LONG_SERIAL,1,2)          44390000
        AND  T110.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)          44400000
                                                 /* EOC CEDS00000727 */ 44410000
        AND  T110.COUNTRY_NUMBER   = :REFCTRY                           44420000
        AND (T110.STATUS           = '3'                                44430000
         OR  T110.STATUS           = '4')                               44440000
        AND :DATE10          BETWEEN T110.EFFECTIVE_DATE                44450000
                                 AND T110.END_DATE                      44460000
      WITH UR;                                                          44470000
                                                                        44480000
 SELECT(SQLCA.SQLCODE);                                                 44490000
   WHEN(0)                                                              44500000
     EDQBSDS_BAU.CHSIISC = TB_RCBV110.STATUS;                           44510000
   WHEN(100);                                                           44520000
   OTHERWISE                                                            44530000
     DO;                                                                44540000
       RCBCQES.MESSAGE_NUMBER = 'C229';                                 44550000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     44560000
       WRK_TABLE = 'RCBV0110_HW_STATUS';                                44570000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 44580000
     END;                                                               44590000
 END;                                                                   44600000
                                                                        44610000
 END RCBCS3M_READ_HW_STATUS;                                            44620000
1/*********************************************************************/44630000
 /*                                                                   */44640000
 /* MODULE NAME      : RCBCS3M_READ_HW_REAL                           */44650000
 /*                                                                   */44660000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0300    */44670000
 /*                                                                   */44680000
 /*                                                                   */44690000
 /*********************************************************************/44700000
0RCBCS3M_READ_HW_REAL : PROC;                                           44710000
                                                                        44720000
 EXEC SQL                                                               44730000
      SELECT T300.MODEL_NUMBER                                          44740000
       INTO :TB_RCBV300.MODEL_NUMBER    :WRK_INDNULL                    44750000
      FROM   RCBV0300_HW_REAL  T300                                     44760000
      WHERE  T300.COUNTRY_NUMBER   = :REFCTRY                           44770000
        AND  T300.PRODUCT_TYPE     = :REQTYPE                           44780000
    /*   AND T300.ORIGIN          = :REQORIG           SOC RB01320 */   44790000
    /*   AND T300.SEQUENCE_NUMBER = :REQSEQN                        */  44800000
                                                 /* SOC CEDS00000727 */ 44810000
    /*   AND ((T300.ORIGIN          = :WRK_ORIGIN                       44820000
               AND  T300.SEQUENCE_NUMBER = :WRK_SEQ_NO)                 44830000
              OR (T300.ORIGIN||T300.SEQUENCE_NUMBER = :WRK_LONG_SERIAL))44840000
                                                  *//* EOC RB01320 */   44850000
         AND  T300.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)       44860000
         AND  T300.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)         44870000
                                                 /* EOC CEDS00000727 */ 44880000
        AND :DATE10          BETWEEN T300.EFFECTIVE_DATE                44890000
                                 AND T300.END_DATE                      44900000
      WITH UR;                                                          44910000
                                                                        44920000
 SELECT(SQLCA.SQLCODE);                                                 44930000
   WHEN(0)                                                              44940000
     EDQBSDS_BAU.CSLMMOD,                                               44950000
     WRK_MODEL_NUMBER,                                                  44960000
     EDQBSDS_BAU.BUILT_TO_MODEL_NR = TB_RCBV300.MODEL_NUMBER;           44970000
   WHEN(100)                                                            44980000
     DO;                                                                44990000
                                                  /* SOC CEDS00000642 */45000000
        COMMAREA.EDQBSHS.REQ.CRMORET = '9';                             45010000
        COMMAREA.EDQBSHS.REQ.NTBLNME = 'TOS NOT IN T300';               45020000
     /* EDQBSHS.REQ.CRMORET = '9';                                      45030000
        EDQBSHS.REQ.NTBLNME = 'TOS NOT IN T300'; */                     45040000
                                                      /* SOC RB01320  */45050000
                                                                        45060000
        IF SWITCH_0211_S3 THEN                                          45070000
         DO;                                                            45080000
           COMMAREA_OLD = COMMAREA;                                     45090000
         /*COMMAREA     = ''; */                                        45100000
         END;                                                           45110000
        ELSE                                      /* EOC CEDS00000642 */45120000
        IF SWITCH_3317_S3 THEN                                          45130000
          DO;                                                           45140000
                                                  /* SOC CEDS00000642 */45150000
           COMMAREA_NEW = '';                                           45160000
           COMMAREA_NEW.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;           45170000
           COMMAREA_NEW.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;           45180000
           COMMAREA_NEW.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;             45190000
        IF WRK_LONG_SERIAL ¬= '' THEN                    /* RC01349 */  45200000
           COMMAREA_NEW.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;             45210000
        ELSE                                         /* SOC RC01349 */  45220000
           COMMAREA_NEW.EDQBSDS1.SEDQGSN =                              45230000
                COMMAREA_NEW.EDQBSDS1.IOLCPLM ||                        45240000
                COMMAREA_NEW.EDQBSDS1.IHSINBR ;      /* EOC RC01349 */  45250000
                                                      /* SOC RC01359 */ 45260000
        IF CHECKSEQ = '' THEN                                           45270000
           DO;                                                          45280000
             IF (LENGTH(TRIM(COMMAREA_NEW.EDQBSDS1.IHSINBR)) = 7 &      45290000
                  SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,1,2) = '00') THEN45300000
          COMMAREA_NEW.EDQBSDS1.SEDQGSN=COMMAREA_NEW.EDQBSDS1.IOLCPLM ||45310000
                     SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,3,5);         45320000
           END;                                       /* EOC RC01359 */ 45330000
        /* COMMAREA     = ''; */                                        45340000
        /*  NEW_VERSION_DUMMY.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;     45350000
            NEW_VERSION_DUMMY.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;       45360000
            NEW_VERSION_DUMMY.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;     45370000
            NEW_VERSION_DUMMY.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;       45380000
            COMMAREA1.EDQBSHS1 = ' ';                                   45390000
            COMMAREA1.EDQBSHS1 = NEW_VERSION_DUMMY.EDQBSHS1;            45400000
            COMMAREA1.EDQBSDS1 = NEW_VERSION_DUMMY.EDQBSDS1; */         45410000
                                                /* EOC CEDS00000642 */  45420000
          END;                                                          45430000
                                                     /* EOC RB01320 */  45440000
        EXEC CICS RETURN;                                               45450000
                                                                        45460000
     END;                                                               45470000
   OTHERWISE                                                            45480000
     DO;                                                                45490000
       RCBCQES.MESSAGE_NUMBER = 'C230';                                 45500000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     45510000
       WRK_TABLE = 'RCBV0300_HW_REAL';                                  45520000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 45530000
     END;                                                               45540000
 END;                                                                   45550000
                                                                        45560000
 END RCBCS3M_READ_HW_REAL;                                              45570000
1/*********************************************************************/45580000
 /*                                                                   */45590000
 /* MODULE NAME      : RCBCS3M_READ_HW_PR_MOD                         */45600000
 /*                                                                   */45610000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0380    */45620000
 /*                                                                   */45630000
 /*********************************************************************/45640000
0RCBCS3M_READ_HW_PR_MOD : PROC;                                         45650000
                                                                        45660000
 EXEC SQL                                                               45670000
      SELECT T380.CPU_TYPE         ,                                    45680000
             T380.DP_SYSTEM_NUMBER ,                                    45690000
             T380.INSTALLING_OU    ,                                    45700000
             T380.TYPE_OF_AGREEMENT                                     45710000
       INTO :TB_RCBV380.CPU_TYPE          :WRK_INDNULL,                 45720000
            :TB_RCBV380.DP_SYSTEM_NUMBER  :WRK_INDNULL,                 45730000
            :TB_RCBV380.INSTALLING_OU     :WRK_INDNULL,                 45740000
            :TB_RCBV380.TYPE_OF_AGREEMENT :WRK_INDNULL                  45750000
      FROM   RCBV0380_HW_PR_MOD  T380                                   45760000
      WHERE  T380.COUNTRY_NUMBER   = :REFCTRY                           45770000
        AND  T380.PRODUCT_TYPE     = :REQTYPE                           45780000
  /*    AND  T380.ORIGIN           = :REQORIG          SOC RB01320 */   45790000
  /*    AND  T380.SEQUENCE_NUMBER  = :REQSEQN */                        45800000
                                                 /* SOC CEDS00000727 */ 45810000
  /*    AND ((T380.ORIGIN           = :WRK_ORIGIN                       45820000
               AND  T380.SEQUENCE_NUMBER  = :WRK_SEQ_NO )               45830000
           OR (T380.ORIGIN||T380.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))  45840000
                                                  *//* EOC RB01320 */   45850000
         AND  T380.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)       45860000
         AND  T380.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)         45870000
                                                 /* EOC CEDS00000727 */ 45880000
        AND :DATE10          BETWEEN T380.EFFECTIVE_DATE                45890000
                                 AND T380.END_DATE                      45900000
      WITH UR;                                                          45910000
                                                                        45920000
 SELECT(SQLCA.SQLCODE);                                                 45930000
   WHEN(0)                                                              45940000
     DO;                                                                45950000
       EDQBSDS_BAU.ISLMCPU         = TB_RCBV380.CPU_TYPE;               45960000
       EDQBSDS_BAU.ICUOSYN         = TB_RCBV380.DP_SYSTEM_NUMBER;       45970000
       STRING(EDQBSDS_BAU.GMKTMBO) = TB_RCBV380.INSTALLING_OU;          45980000
       EDQBSDS_BAU.CAGRTYP         = TB_RCBV380.TYPE_OF_AGREEMENT;      45990000
     END;                                                               46000000
   WHEN(100);                                                           46010000
   OTHERWISE                                                            46020000
     DO;                                                                46030000
       RCBCQES.MESSAGE_NUMBER = 'C231';                                 46040000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     46050000
       WRK_TABLE = 'RCBV0380_HW_PR_MOD';                                46060000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 46070000
     END;                                                               46080000
 END;                                                                   46090000
                                                                        46100000
 END RCBCS3M_READ_HW_PR_MOD;                                            46110000
1/*********************************************************************/46120000
 /*                                                                   */46130000
 /* MODULE NAME      : RCBCS3M_READ_HW_IN_ORD                         */46140000
 /*                                                                   */46150000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0260    */46160000
 /*                                                                   */46170000
 /*                                                                   */46180000
 /*********************************************************************/46190000
0RCBCS3M_READ_HW_IN_ORD : PROC;                                         46200000
                                                                        46210000
 EXEC SQL                                                               46220000
      SELECT ORDER_REF_NUMBER                                           46230000
        INTO :TB_RCBV260.ORDER_REF_NUMBER                               46240000
        FROM RCBV0260_HW_IN_ORD                                         46250000
       WHERE COUNTRY_NUMBER  = :REFCTRY                                 46260000
         AND PRODUCT_TYPE    = :REQTYPE                                 46270000
         AND MODEL_NUMBER    = :TB_RCBV300.MODEL_NUMBER                 46280000
   /*    AND ORIGIN          = :REQORIG                 SOC RB01320 */  46290000
   /*    AND SEQUENCE_NUMBER = :REQSEQN */                              46300000
                                                 /* SOC CEDS00000727 */ 46310000
   /*    AND ((ORIGIN          = :WRK_ORIGIN                            46320000
               AND SEQUENCE_NUMBER = :WRK_SEQ_NO )                      46330000
            OR (ORIGIN||SEQUENCE_NUMBER = : WRK_LONG_SERIAL)) */        46340000
         AND  ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)            46350000
         AND  SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)              46360000
                                                 /* EOC CEDS00000727 */ 46370000
                                                     /* EOC RB01320 */  46380000
         AND ORDER_DATE      =                                          46390000
            (                                                           46400000
             SELECT MAX(ORDER_DATE)                                     46410000
               FROM RCBV0260_HW_IN_ORD                                  46420000
              WHERE COUNTRY_NUMBER  = :REFCTRY                          46430000
                AND PRODUCT_TYPE    = :REQTYPE                          46440000
                AND MODEL_NUMBER    = :TB_RCBV300.MODEL_NUMBER          46450000
          /*    AND ORIGIN          = :REQORIG          SOC RB01320 */  46460000
          /*    AND SEQUENCE_NUMBER = :REQSEQN    */                    46470000
                                                 /* SOC CEDS00000727 */ 46480000
          /*    AND ((ORIGIN          = :WRK_ORIGIN                     46490000
                      AND SEQUENCE_NUMBER = :WRK_SEQ_NO)                46500000
                OR (ORIGIN||SEQUENCE_NUMBER = : WRK_LONG_SERIAL))       46510000
                                                   *//* EOC RB01320 */  46520000
                AND  ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)     46530000
                AND  SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)       46540000
                                                 /* EOC CEDS00000727 */ 46550000
                AND ORDER_DATE      < :DATE10                           46560000
            )                                                           46570000
      WITH UR;                                                          46580000
                                                                        46590000
 SELECT(SQLCA.SQLCODE);                                                 46600000
   WHEN(0)                                                              46610000
     EDQBSDS_BAU.ICUOORN = TB_RCBV260.ORDER_REF_NUMBER;                 46620000
   WHEN(100 ,-811);                                                     46630000
   OTHERWISE                                                            46640000
     DO;                                                                46650000
       RCBCQES.MESSAGE_NUMBER = 'C232';                                 46660000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     46670000
       WRK_TABLE = 'RCBV0260_HW_IN_ORD';                                46680000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 46690000
     END;                                                               46700000
 END;                                                                   46710000
                                                                        46720000
 END RCBCS3M_READ_HW_IN_ORD;                                            46730000
1/*********************************************************************/46740000
 /*                                                                   */46750000
 /* MODULE NAME      : RCBCS3M_MOVE_SUPPL_CTR                         */46760000
 /*                                                                   */46770000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0220    */46780000
 /*                    TO THE BAU STRUCTURE FIELDS                    */46790000
 /*                                                                   */46800000
 /*********************************************************************/46810000
0RCBCS3M_MOVE_SUPPL_CTR: PROC;                                          46820000
                                                                        46830000
 EDQBSDS_BAU.IHSITOS.CSLMTYP         = TB_RCBV220.PRODUCT_TYPE;         46840000
                                                     /* SOC RB01320 */  46850000
 /*EDQBSDS_BAU.IHSITOS.IHSIMID.IOLCPLM = TB_RCBV220.ORIGIN; */          46860000
 /*EDQBSDS_BAU.IHSITOS.IHSIMID.IHSINBR = TB_RCBV220.SEQUENCE_NUMBER; */ 46870000
                                                 /* SOC CEDS00000727 */ 46880000
   IF WRK_ORIGIN ¬= '' THEN                                             46890000
   DO;                                           /* EOC CEDS00000727 */ 46900000
   EDQBSDS_BAU.IHSITOS.IHSIMID.IOLCPLM = WRK_ORIGIN;                    46910000
   EDQBSDS_BAU.IHSITOS.IHSIMID.IHSINBR = WRK_SEQ_NO;                    46920000
   END;                                          /* SOC CEDS00000727 */ 46930000
   ELSE                                                                 46940000
   DO;                                                                  46950000
   EDQBSDS_BAU.IHSITOS.IHSIMID.IOLCPLM = SUBSTR(WRK_LONG_SERIAL,1,2);   46960000
   EDQBSDS_BAU.IHSITOS.IHSIMID.IHSINBR = SUBSTR(WRK_LONG_SERIAL,3);     46970000
   END;                                                                 46980000
                                                 /* EOC CEDS00000727 */ 46990000
 IF SWITCH_3317_S3 THEN                                                 47000000
   DO;                                                                  47010000
     IF WRK_LONG_SERIAL ¬= '' THEN                                      47020000
       DO;                                                              47030000
                                                 /* SOC CEDS00000642 */ 47040000
       /*COMMAREA1.EDQBSDS1.SEDQGSN  = WRK_LONG_SERIAL;*/               47050000
         COMMAREA_NEW.EDQBSDS1.SEDQGSN  = WRK_LONG_SERIAL;              47060000
                                                 /* EOC CEDS00000642 */ 47070000
       END;                                                             47080000
                                                     /* SOC RC01349 */  47090000
       ELSE                                                             47100000
         COMMAREA_NEW.EDQBSDS1.SEDQGSN  = WRK_ORIGIN||WRK_SEQ_NO;       47110000
                                                     /* EOC RC01349 */  47120000
                                                      /* SOC RC01359 */ 47130000
       IF CHECKSEQ = '' THEN                                            47140000
       DO;                                                              47150000
             IF (LENGTH(TRIM(WRK_SEQ_NO)) = 7 &                         47160000
             SUBSTR(WRK_SEQ_NO,1,2) = '00') THEN                        47170000
               COMMAREA_NEW.EDQBSDS1.SEDQGSN=WRK_ORIGIN||               47180000
                     SUBSTR(WRK_SEQ_NO,3,5);                            47190000
       END;                                           /* EOC RC01359 */ 47200000
   END;                                                                 47210000
                                                     /* EOC RB01320 */  47220000
 EDQBSDS_BAU.IOPUCTY                 = TB_RCBV220.COUNTRY_NUMBER;       47230000
                                                 /* SOC CEDS00000522 */ 47240000
 EDQBSDS_BAU.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV220.EFFECTIVE_DATE,1,4)    47250000
                            || SUBSTR(TB_RCBV220.EFFECTIVE_DATE,6,2)    47260000
                            || SUBSTR(TB_RCBV220.EFFECTIVE_DATE,9,2);   47270000
                                                                        47280000
 EDQBSDS_BAU.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV220.END_DATE,1,4)          47290000
                            || SUBSTR(TB_RCBV220.END_DATE,6,2)          47300000
                            || SUBSTR(TB_RCBV220.END_DATE,9,2);         47310000
                                                 /* EOC CEDS00000522 */ 47320000
 SELECT;                                                                47330000
  /* ANY WARRANTY IN BAU */                                             47340000
 WHEN (VERIFY(TB_RCBV220.TYPE_OF_WARRANTY,WRK_TPMNT_VAL.TPMNT_WAR) = 0  47350000
       |VERIFY (TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_FWTOW) = 0            47360000
       |VERIFY (TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_HBTOM) = 0  )         47370000
 DO;                                                                    47380000
  SWITCH_BAU_WARR = TRUE;                                               47390000
  EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBV220.TYPE_OF_WARRANTY;            47400000
                                                 /* SOC CEDS00000522 */ 47410000
 /* EDQBSDS_BAU.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV220.EFFECTIVE_DATE,1,4) 47420000
                             || SUBSTR(TB_RCBV220.EFFECTIVE_DATE,6,2)   47430000
                             || SUBSTR(TB_RCBV220.EFFECTIVE_DATE,9,2);  47440000
                                                                        47450000
  EDQBSDS_BAU.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV220.END_DATE,1,4)         47460000
                             || SUBSTR(TB_RCBV220.END_DATE,6,2)         47470000
                             || SUBSTR(TB_RCBV220.END_DATE,9,2); */     47480000
                                                /* EOC CEDS00000522 */  47490000
  IF OUT_OF_COUNTRY THEN DO;                                            47500000
     WRK_SET_HRS = 'Y';                                                 47510000
     IF WRK_SLC1 ¬= '' THEN DO;                                         47520000
       EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLC1;                 47530000
       CALL RCBCS3M_READ_SERV_COND(WRK_SLC1,'BAU');                     47540000
     END;                                                               47550000
  END;                                                                  47560000
  ELSE DO;                                                              47570000
  IF TB_RCBV220_I.INDNULL(07) = 0 THEN                                  47580000
    DO;                                                                 47590000
      WRK_SET_HRS = 'Y';                                                47600000
      EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE =                            47610000
                                 TB_RCBV220.SERVICE_LVL_CODE;           47620000
      CALL RCBCS3M_READ_SERV_COND(TB_RCBV220.SERVICE_LVL_CODE,'BAU');   47630000
    END;                                                                47640000
  END;                                                                  47650000
                                                                        47660000
  /* FOR FW/HB RECORD FROM T220 */                                      47670000
  IF (TB_RCBV220_I.INDNULL(13) = 0) & (TB_RCBV220_I.INDNULL(14) = 0)    47680000
  THEN DO;                                                              47690000
   IF (TB_RCBV220.EFFECTIVE_DATE <= TB_RCBV220.F_SPLT_DATE) &           47700000
      (TB_RCBV220.F_SPLT_DATE    <= TB_RCBV220.END_DATE) THEN           47710000
   DO;                                                                  47720000
    /* REF DATE FALLS IN FIRST PERIOD OF SPLIT WARRANTY */              47730000
    IF (TB_RCBV220.EFFECTIVE_DATE <= DATE10) &                          47740000
       (DATE10 < TB_RCBV220.F_SPLT_DATE) THEN                           47750000
     DO;                                                                47760000
       WRK_1PERD_END_DATE =                                             47770000
                 RCBCS3M_DATE_CALC(TB_RCBV220.F_SPLT_DATE,-1);          47780000
       EDQBSDS_BAU.SRCCCMD.DDBSMED = SUBSTR(WRK_1PERD_END_DATE,1,4)||   47790000
                                     SUBSTR(WRK_1PERD_END_DATE,6,2)||   47800000
                                     SUBSTR(WRK_1PERD_END_DATE,9,2);    47810000
     END;                                                               47820000
    /* REF DATE FALLS IN SECOND PERIOD OF SPLIT WARRANTY */             47830000
    IF (TB_RCBV220.F_SPLT_DATE <= DATE10) &                             47840000
       (DATE10 <= TB_RCBV220.END_DATE) THEN                             47850000
    DO;                                                                 47860000
     EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBV220.F_TYPE_OF_WARRANTY;       47870000
     EDQBSDS_BAU.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV220.F_SPLT_DATE,1,4)|| 47880000
                                   SUBSTR(TB_RCBV220.F_SPLT_DATE,6,2)|| 47890000
                                   SUBSTR(TB_RCBV220.F_SPLT_DATE,9,2);  47900000
                                                                        47910000
     /* FOR A HB MACHINE */                                             47920000
      IF OUT_OF_COUNTRY THEN DO;                                        47930000
        WRK_SET_HRS = 'Y';                                              47940000
        IF (VERIFY(TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_HBTOM)=0) THEN DO; 47950000
         SWITCH_OOC_HB = TRUE;                       /* CEDS00000521 */ 47960000
         IF WRK_SLCC ¬= '' THEN DO;                                     47970000
       /*  SWITCH_OOC_HB = TRUE;                     /* CEDS00000521 */ 47980000
           EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;             47990000
           CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'BAU');                 48000000
         END;                                                           48010000
        END;                                                            48020000
        ELSE DO;                                                        48030000
         IF WRK_SLC2 ¬= '' THEN DO;                                     48040000
           EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLC2;             48050000
           CALL RCBCS3M_READ_SERV_COND(WRK_SLC2,'BAU');                 48060000
         END;                                                           48070000
        END;                                                            48080000
      END;                                                              48090000
      ELSE DO;                                                          48100000
       IF (VERIFY(TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_HBTOM)=0) THEN      48110000
         IF TB_RCBV220_I.INDNULL(15) = 0 THEN                           48120000
         DO;                                                            48130000
           WRK_SET_HRS = 'Y';                                           48140000
           SWITCH_BAU_MTS_CTR = TRUE;                 /* CEDS00000551 */48150000
           EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE =                       48160000
                                  TB_RCBV220.SERVICE_LVL_CODE_2;        48170000
           CALL RCBCS3M_READ_SERV_COND(TB_RCBV220.SERVICE_LVL_CODE_2,   48180000
                                       'BAU');                          48190000
         END;                                                           48200000
      END;                                                              48210000
    END;                                                                48220000
   END;                                                                 48230000
                                                                        48240000
   /* FOR A FW/HB RECORD INTIALLY IN T220, IF T220 RECORD IS SPLIT IN */48250000
   /* SECOND PERIOD                                                   */48260000
   /* <-------|-------------> INITIAL RECORD IN T220                  */48270000
   /*         |...<---------> T220 RECORD AFTER SPLIT IN SECOND PERIOD*/48280000
   /* AND REF DATE FALLS WITHIN EFF PERIOD OF 2ND RECORD SHOWN HERE   */48290000
   IF (TB_RCBV220.F_SPLT_DATE < TB_RCBV220.EFFECTIVE_DATE)              48300000
    & (TB_RCBV220.EFFECTIVE_DATE < TB_RCBV220.END_DATE)                 48310000
    & (TB_RCBV220.EFFECTIVE_DATE <= DATE10)                             48320000
    & (DATE10 <= TB_RCBV220.END_DATE) THEN                              48330000
   DO;                                                                  48340000
      EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBV220.F_TYPE_OF_WARRANTY;      48350000
      /* FOR HB MACHINE */                                              48360000
      IF OUT_OF_COUNTRY THEN DO;                                        48370000
        WRK_SET_HRS = 'Y';                                              48380000
        IF (VERIFY(TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_HBTOM)=0) THEN DO; 48390000
           SWITCH_OOC_HB = TRUE;                      /* CEDS00000521 */48400000
         IF WRK_SLCC ¬= '' THEN DO;                                     48410000
        /* SWITCH_OOC_HB = TRUE;                      /* CEDS00000521 */48420000
           EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;             48430000
           CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'BAU');                 48440000
         END;                                                           48450000
        END;                                                            48460000
        ELSE DO;                                                        48470000
         IF WRK_SLC2 ¬= '' THEN DO;                                     48480000
           EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLC2;             48490000
           CALL RCBCS3M_READ_SERV_COND(WRK_SLC2,'BAU');                 48500000
         END;                                                           48510000
        END;                                                            48520000
      END;                                                              48530000
      ELSE DO;                                                          48540000
      IF (VERIFY(TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_HBTOM)=0) THEN       48550000
         IF TB_RCBV220_I.INDNULL(15) = 0 THEN                           48560000
         DO;                                                            48570000
           WRK_SET_HRS = 'Y';                                           48580000
           SWITCH_BAU_MTS_CTR = TRUE;                 /* CEDS00000551 */48590000
           EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE =                       48600000
                                  TB_RCBV220.SERVICE_LVL_CODE_2;        48610000
           CALL RCBCS3M_READ_SERV_COND(TB_RCBV220.SERVICE_LVL_CODE_2,   48620000
                                       'BAU');                          48630000
         END;                                                           48640000
      END;                                                              48650000
   END;                                                                 48660000
  END;                                                                  48670000
 END;                                                                   48680000
 /* INTERNAL MACHINE */                                                 48690000
 WHEN ((TB_RCBV220.TYPE_OF_MAINT = 'A' |                                48700000
        TB_RCBV220.TYPE_OF_MAINT = 'B' |                                48710000
        TB_RCBV220.TYPE_OF_MAINT = 'E' )&                               48720000
        TB_RCBV220.SOURCE_INDICATOR =' ' )                              48730000
  DO;                                                                   48740000
    SWITCH_INTERNAL = TRUE;                                             48750000
                                                                        48760000
    EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBV220.TYPE_OF_MAINT;             48770000
    IF OUT_OF_COUNTRY THEN DO;                                          48780000
      WRK_SET_HRS = 'Y';                                                48790000
      IF WRK_SLCC ¬= '' THEN DO;                                        48800000
        EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;                48810000
        CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'BAU');                    48820000
      END;                                                              48830000
    END;                                                                48840000
    ELSE DO;                                                            48850000
    IF TB_RCBV220_I.INDNULL(07) = 0 THEN                                48860000
      DO;                                                               48870000
        WRK_SET_HRS = 'Y';                                              48880000
        EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE =                          48890000
                                   TB_RCBV220.SERVICE_LVL_CODE;         48900000
        CALL RCBCS3M_READ_SERV_COND(TB_RCBV220.SERVICE_LVL_CODE,'BAU'); 48910000
      END;                                                              48920000
    END;                                                                48930000
  END;                                                                  48940000
                                                                        48950000
  /* LEASE-RENTAL MACHINE */                                            48960000
  WHEN ((TB_RCBV220.TYPE_OF_MAINT = '1' |                               48970000
         TB_RCBV220.TYPE_OF_MAINT = 'F' ) &                             48980000
         TB_RCBV220.SOURCE_INDICATOR =' ')                              48990000
  DO;                                                                   49000000
   SWITCH_LEASE_RENTAL = TRUE;                                          49010000
   EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBV220.TYPE_OF_MAINT;              49020000
   IF OUT_OF_COUNTRY THEN DO;                                           49030000
     WRK_SET_HRS = 'Y';                                                 49040000
     IF WRK_SLCC ¬= '' THEN DO;                                         49050000
       EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;                 49060000
       CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'BAU');                     49070000
     END;                                                               49080000
   END;                                                                 49090000
   ELSE DO;                                                             49100000
   IF TB_RCBV220_I.INDNULL(07) = 0 THEN                                 49110000
    DO;                                                                 49120000
     WRK_SET_HRS = 'Y';                                                 49130000
     EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV220.SERVICE_LVL_CODE;49140000
     CALL RCBCS3M_READ_SERV_COND(TB_RCBV220.SERVICE_LVL_CODE,'BAU');    49150000
    END;                                                                49160000
   END;                                                                 49170000
  END;                                                                  49180000
                                                                        49190000
  /* INTERNAL OR SUPPLY CONTRACT MACHINE */                             49200000
  WHEN ((TB_RCBV220.TYPE_OF_MAINT = '2' |                               49210000
         TB_RCBV220.TYPE_OF_MAINT = 'A' |                               49220000
         TB_RCBV220.TYPE_OF_MAINT = 'B' |                               49230000
         TB_RCBV220.TYPE_OF_MAINT = 'E' ) &                             49240000
         TB_RCBV220.SOURCE_INDICATOR='C')                               49250000
  DO;                                                                   49260000
     IF TB_RCBV220.TYPE_OF_MAINT = '2' THEN                             49270000
       SWITCH_SUPPL_CTR = TRUE;                                         49280000
     ELSE                                                               49290000
       SWITCH_INTERNAL = TRUE;                                          49300000
                                                                        49310000
   /*CALL RCBCS3M_CHECK_INTERNAL;                     /* CEDS00000508 */49320000
                                                      /* SOC RB01320  */49330000
   /*CALL RCBCS3M_CHECK_INTERNAL(REQORIG,REQSEQN);    /* CEDS00000508 */49340000
     CALL RCBCS3M_CHECK_INTERNAL(TB_RCBV220.ORIGIN,                     49350000
                                 TB_RCBV220.SEQUENCE_NUMBER);           49360000
                                                      /* EOC RB01320  */49370000
     IF SWITCH_INTERNAL_CTR = FALSE THEN                                49380000
       EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBV220.TYPE_OF_MAINT;          49390000
  END;                                                                  49400000
                                                                        49410000
  /* BAU PER CALL */                                                    49420000
  OTHERWISE DO;                                                         49430000
    EDQBSDS_BAU.SRCCCMD.CHSISTM = TB_RCBV220.TYPE_OF_MAINT;             49440000
    IF TB_RCBV220.TYPE_OF_MAINT = '2' THEN                              49450000
       SWITCH_SUPPL_CTR = TRUE;                                         49460000
    ELSE DO;                                                            49470000
     SWITCH_BAU_PERCALL = TRUE;                                         49480000
     IF OUT_OF_COUNTRY THEN DO;                                         49490000
      WRK_SET_HRS = 'Y';                                                49500000
      IF WRK_SLCC ¬= '' THEN DO;                                        49510000
        EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;                49520000
        CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'BAU');                    49530000
      END;                                                              49540000
     END;                                                               49550000
     ELSE DO;                                                           49560000
      IF TB_RCBV220_I.INDNULL(07) = 0 THEN DO;                          49570000
        WRK_SET_HRS = 'Y';                                              49580000
        EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE =                          49590000
                                     TB_RCBV220.SERVICE_LVL_CODE;       49600000
        CALL RCBCS3M_READ_SERV_COND(TB_RCBV220.SERVICE_LVL_CODE,'BAU'); 49610000
     END;                                                               49620000
    END;                                                                49630000
    END;                                                                49640000
  END;                                                                  49650000
 END;                                                                   49660000
                                                                        49670000
 IF TB_RCBV220_I.INDNULL(08) = 0 THEN                                   49680000
   EDQBSDS_BAU.DAGREWP = SUBSTR(TB_RCBV220.WARRANTY_EXP_DATE,1,4) ||    49690000
                     SUBSTR(TB_RCBV220.WARRANTY_EXP_DATE,6,2) ||        49700000
                     SUBSTR(TB_RCBV220.WARRANTY_EXP_DATE,9,2);          49710000
                                                                        49720000
 EDQBSDS_BAU.SRCCCMD.TAKE_CEDS = 'N';                                   49730000
                                                                        49740000
 EDQBSDS_BAU.SRCCCMD.SSRCIND = TB_RCBV220.SOURCE_INDICATOR;             49750000
 IF ¬SWITCH_BAU_MTS_CTR THEN                          /* CEDS00000551 */49760000
 EDQBSDS_BAU.BASE_WARRANTY_SLC = EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE;  49770000
 WRK_BAUWARR_EFFDATE = EDQBSDS_BAU.DDBSEFF;                             49780000
 WRK_BAUWARR_ENDDATE = EDQBSDS_BAU.DDBSMED;                             49790000
                                                                        49800000
 END RCBCS3M_MOVE_SUPPL_CTR;                                            49810000
1/*********************************************************************/49820000
 /*                                                                   */49830000
 /* MODULE NAME      : RCBCS3M_READ_OU_HW                             */49840000
 /*                                                                   */49850000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0170    */49860000
 /*                                                                   */49870000
 /*********************************************************************/49880000
0RCBCS3M_READ_OU_HW : PROC;                                             49890000
                                                                        49900000
 EXEC SQL                                                               49910000
      SELECT T170.OU_CODE                                               49920000
       INTO :TB_RCBV170.OU_CODE      :WRK_INDNULL                       49930000
      FROM   RCBV0170_OU_HW  T170                                       49940000
      WHERE  T170.COUNTRY_NUMBER   = :REFCTRY                           49950000
        AND  T170.PRODUCT_TYPE     = :REQTYPE                           49960000
  /*    AND  T170.ORIGIN          = :REQORIG            SOC RB01320 */  49970000
  /*    AND  T170.SEQUENCE_NUMBER = :REQSEQN   */                       49980000
                                                 /* SOC CEDS00000727 */ 49990000
  /*    AND ((T170.ORIGIN          = :WRK_ORIGIN                        50000000
               AND  T170.SEQUENCE_NUMBER = :WRK_SEQ_NO)                 50010000
             OR (T170.ORIGIN||T170.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))50020000
                                                   *//* EOC RC01320 */  50030000
        AND  T170.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)        50040000
        AND  T170.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)          50050000
                                                 /* EOC CEDS00000727 */ 50060000
        AND :DATE10          BETWEEN T170.EFFECTIVE_DATE                50070000
                                 AND T170.END_DATE                      50080000
      WITH UR;                                                          50090000
                                                                        50100000
 SELECT(SQLCA.SQLCODE);                                                 50110000
   WHEN(0)                                                              50120000
     DO;                                                                50130000
       T170_OU_CODE_FLAG = TRUE;                      /* RC01313*/      50140000
       EDQBSDS_BAU.CUSCODE.SEDQCSX = '2' || TB_RCBV170.OU_CODE;         50150000
       EDQBSDS_BAU.SRCCCMD.IODPDBU.CODPDIV = '2';                       50160000
       EDQBSDS_BAU.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV170.OU_CODE;        50170000
     END;                                                               50180000
   WHEN(100);                                                           50190000
   OTHERWISE                                                            50200000
     DO;                                                                50210000
       RCBCQES.MESSAGE_NUMBER = 'C233';                                 50220000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     50230000
       WRK_TABLE = 'RCBV0170_OU_HW';                                    50240000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 50250000
     END;                                                               50260000
 END;                                                                   50270000
                                                                        50280000
 END RCBCS3M_READ_OU_HW;                                                50290000
1/*********************************************************************/50300000
 /*                                                                   */50310000
 /* MODULE NAME      : RCBCS3M_READ_BAU_CTR                           */50320000
 /*                                                                   */50330000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0240    */50340000
 /*                                                                   */50350000
 /*                                                                   */50360000
 /*********************************************************************/50370000
0RCBCS3M_READ_BAU_CTR : PROC;                                           50380000
                                                                        50390000
                                                                        50400000
0EXEC SQL                                                               50410000
      SELECT T240.COUNTRY_NUMBER    ,                                   50420000
             T240.PRODUCT_TYPE      ,                                   50430000
             T240.ORIGIN            ,                                   50440000
             T240.SEQUENCE_NUMBER   ,                                   50450000
             T240.HVP_QUANTITY      ,                                   50460000
             T240.CONTRACT_NUMBER   ,                                   50470000
             T240.SERVICE_START_DATE,                                   50480000
             T240.SERVICE_STOP_DATE ,                                   50490000
             T240.SUPPL_CTR_NUMBER  ,                                   50500000
             T240.SERVICE_MODULE_1  ,                                   50510000
             T240.SERVICE_MODULE_2  ,                                   50520000
             T240.SERVICE_MODULE_3  ,                                   50530000
             T240.SERVICE_MODULE_4  ,                                   50540000
             T240.SERVICE_MODULE_5  ,                                   50550000
             T240.AGREEMENT_TYPE    ,                                   50560000
             T240.AGREEMENT_OPTION  ,                                   50570000
             T240.SPECIAL_OPTION    ,                                   50580000
             T240.AMENDM_COMB_CODE  ,                                   50590000
             T240.COVERAGE_START_1  ,                                   50600000
             T240.COVERAGE_END_1    ,                                   50610000
             T240.COVERAGE_START_2  ,                                   50620000
             T240.COVERAGE_END_2    ,                                   50630000
             T240.COVERAGE_START_3  ,                                   50640000
             T240.COVERAGE_END_3    ,                                   50650000
             T240.COVERAGE_START_4  ,                                   50660000
             T240.COVERAGE_END_4    ,                                   50670000
             T240.COVERAGE_START_5  ,                                   50680000
             T240.COVERAGE_END_5    ,                                   50690000
             T240.COVERAGE_START_6  ,                                   50700000
             T240.COVERAGE_END_6    ,                                   50710000
             T240.COVERAGE_START_7  ,                                   50720000
             T240.COVERAGE_END_7    ,                                   50730000
             T240.SERVICE_TYPE      ,                                   50740000
             T240.SERVICE_LVL_CODE  ,                                   50750000
             T240.SOURCE_INDICATOR  ,                                   50760000
             T240.LAST_CHANGE_DATE  ,                                   50770000
             T240.EFFECTIVE_DATE    ,                                   50780000
             T240.END_DATE                                              50790000
       INTO :TB_RCBV240                                                 50800000
            :TB_RCBV240_I.INDNULL                                       50810000
      FROM   RCBV0240_SERV_CTR   T240                                   50820000
      WHERE  T240.COUNTRY_NUMBER  = :REFCTRY                            50830000
        AND  T240.PRODUCT_TYPE    = :REQTYPE                            50840000
  /*    AND  T240.ORIGIN          = :REQORIG            SOC RB01320 */  50850000
  /*    AND  T240.SEQUENCE_NUMBER = :REQSEQN   */                       50860000
                                                 /* SOC CEDS00000727 */ 50870000
  /*    AND ((     T240.ORIGIN          = :WRK_ORIGIN                   50880000
              AND  T240.SEQUENCE_NUMBER = :WRK_SEQ_NO)                  50890000
             OR (T240.ORIGIN||T240.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))50900000
                                                   *//* EOC RB01320 */  50910000
        AND  T240.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)        50920000
        AND  T240.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)          50930000
                                                 /* EOC CEDS00000727 */ 50940000
        AND :DATE10         BETWEEN T240.EFFECTIVE_DATE                 50950000
                                AND T240.END_DATE                       50960000
      WITH UR;                                                          50970000
                                                                        50980000
 SELECT(SQLCA.SQLCODE);                                                 50990000
  WHEN(0)                                                               51000000
    DO;                                                                 51010000
      SWITCH_BAU_CTR = TRUE;                                            51020000
      IF OUT_OF_COUNTRY THEN DO;                                        51030000
        IF ¬SWITCH_BAU_WARR & (WRK_SLCC ¬= '') THEN DO;                 51040000
         WRK_SET_HRS = 'Y';                                             51050000
         EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = WRK_SLCC;               51060000
         CALL RCBCS3M_READ_SERV_COND(WRK_SLCC,'BAU');                   51070000
         EDQBSDS_BAU.SRCCCMD.DDBSEFF =                                  51080000
                           SUBSTR(TB_RCBV240.EFFECTIVE_DATE,1,4) ||     51090000
                           SUBSTR(TB_RCBV240.EFFECTIVE_DATE,6,2) ||     51100000
                           SUBSTR(TB_RCBV240.EFFECTIVE_DATE,9,2);       51110000
                                                                        51120000
         EDQBSDS_BAU.SRCCCMD.DDBSMED =                                  51130000
                           SUBSTR(TB_RCBV240.END_DATE,1,4) ||           51140000
                           SUBSTR(TB_RCBV240.END_DATE,6,2) ||           51150000
                           SUBSTR(TB_RCBV240.END_DATE,9,2);             51160000
                                                                        51170000
        END;                                                            51180000
      END;                                                              51190000
      ELSE                                                              51200000
      CALL RCBCS3M_MOVE_SERV_CTR;                                       51210000
    END;                                                                51220000
  WHEN(100);                                                            51230000
  OTHERWISE                                                             51240000
    DO;                                                                 51250000
      RCBCQES.MESSAGE_NUMBER = 'C234';                                  51260000
      WRK_SQLCODE = SQLCA.SQLCODE;                                      51270000
      WRK_TABLE = 'RCBT0240_PI_CTR';                                    51280000
      CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                  51290000
    END;                                                                51300000
 END;                                                                   51310000
                                                                        51320000
 END RCBCS3M_READ_BAU_CTR;                                              51330000
1/*********************************************************************/51340000
 /*                                                                   */51350000
 /* MODULE NAME      : RCBCS3M_MOVE_SERV_CTR                          */51360000
 /*                                                                   */51370000
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0240    */51380000
 /*                    TO THE BAU STRUCTURE FIELDS.                   */51390000
 /*                                                                   */51400000
 /*********************************************************************/51410000
0RCBCS3M_MOVE_SERV_CTR: PROC;                                           51420000
                                                                        51430000
 EDQBSDS_BAU.CALLBACK(*) ='';                                           51440000
 EDQBSDS_BAU.ARRIVAL(*) ='';                                            51450000
 EDQBSDS_BAU.FIX(*) ='';                                                51460000
 EDQBSDS_BAU.CTY(*) ='';                                                51470000
 EDQBSDS_BAU.ONSITE(*) ='';                                             51480000
 EDQBSDS_BAU.SRCCCMD.DESCRIPTION = '';                                  51490000
 EDQBSDS_BAU.SRCCCMD.SERVICE_DLVR_METHD = '';                           51500000
 EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = '';                             51510000
 EDQBSDS_BAU.SRCCCMD.DESCRIPTION = '';                                  51520000
 EDQBSDS_BAU.SRCCCMD.TIMEZERO = '';                                     51530000
 EDQBSDS_BAU.SRCCCMD.RAGRWCP(*) = '';                                   51540000
 EDQBSDS_BAU.SRCCCMD.PRES_VALID_FLAG = 'N';                             51550000
                                                                        51560000
 EDQBSDS_BAU.QCUOHVP = TB_RCBV240.HVP_QUANTITY;                         51570000
                                                                        51580000
 EDQBSDS_BAU.SRCCCMD.TAKE_CEDS = 'Y';                                   51590000
                                                                        51600000
 IF ((TB_RCBV240_I.INDNULL(19)                                          51610000
    + TB_RCBV240_I.INDNULL(20)                                          51620000
    + TB_RCBV240_I.INDNULL(21)                                          51630000
    + TB_RCBV240_I.INDNULL(22)                                          51640000
    + TB_RCBV240_I.INDNULL(23)                                          51650000
    + TB_RCBV240_I.INDNULL(24)                                          51660000
    + TB_RCBV240_I.INDNULL(25)                                          51670000
    + TB_RCBV240_I.INDNULL(26)                                          51680000
    + TB_RCBV240_I.INDNULL(27)                                          51690000
    + TB_RCBV240_I.INDNULL(28)                                          51700000
    + TB_RCBV240_I.INDNULL(29)                                          51710000
    + TB_RCBV240_I.INDNULL(30)                                          51720000
    + TB_RCBV240_I.INDNULL(31)                                          51730000
    + TB_RCBV240_I.INDNULL(32)                                          51740000
    = -14)                                                              51750000
    | (TB_RCBV240.COVERAGE_START_1 = '00.00.00'                         51760000
    &  TB_RCBV240.COVERAGE_START_2 = '00.00.00'                         51770000
    &  TB_RCBV240.COVERAGE_START_3 = '00.00.00'                         51780000
    &  TB_RCBV240.COVERAGE_START_4 = '00.00.00'                         51790000
    &  TB_RCBV240.COVERAGE_START_5 = '00.00.00'                         51800000
    &  TB_RCBV240.COVERAGE_START_6 = '00.00.00'                         51810000
    &  TB_RCBV240.COVERAGE_START_7 = '00.00.00'                         51820000
    &  TB_RCBV240.COVERAGE_END_1   = '00.00.00'                         51830000
    &  TB_RCBV240.COVERAGE_END_2   = '00.00.00'                         51840000
    &  TB_RCBV240.COVERAGE_END_3   = '00.00.00'                         51850000
    &  TB_RCBV240.COVERAGE_END_4   = '00.00.00'                         51860000
    &  TB_RCBV240.COVERAGE_END_5   = '00.00.00'                         51870000
    &  TB_RCBV240.COVERAGE_END_6   = '00.00.00'                         51880000
    &  TB_RCBV240.COVERAGE_END_7   = '00.00.00'))                       51890000
 THEN                                                                   51900000
   WRK_SET_HRS = 'Y';                                                   51910000
 ELSE                                                                   51920000
   WRK_SET_HRS = 'N';                                                   51930000
                                                                        51940000
 IF TB_RCBV240_I.INDNULL(06) = 0 THEN                                   51950000
   EDQBSDS_BAU.SRCCCMD.IAGRNBR = TB_RCBV240.CONTRACT_NUMBER;            51960000
                                                                        51970000
 IF TB_RCBV240_I.INDNULL(10) = 0 THEN                                   51980000
   EDQBSDS_BAU.SRCCCMD.RHSIESA(1).IHSIESA = TB_RCBV240.SERVICE_MODULE_1;51990000
                                                                        52000000
 IF TB_RCBV240_I.INDNULL(11) = 0 THEN                                   52010000
   EDQBSDS_BAU.SRCCCMD.RHSIESA(2).IHSIESA = TB_RCBV240.SERVICE_MODULE_2;52020000
                                                                        52030000
 IF TB_RCBV240_I.INDNULL(12) = 0 THEN                                   52040000
   EDQBSDS_BAU.SRCCCMD.RHSIESA(3).IHSIESA = TB_RCBV240.SERVICE_MODULE_3;52050000
                                                                        52060000
 IF TB_RCBV240_I.INDNULL(13) = 0 THEN                                   52070000
   EDQBSDS_BAU.SRCCCMD.RHSIESA(4).IHSIESA = TB_RCBV240.SERVICE_MODULE_4;52080000
                                                                        52090000
 IF TB_RCBV240_I.INDNULL(14) = 0 THEN                                   52100000
   EDQBSDS_BAU.SRCCCMD.RHSIESA(5).IHSIESA = TB_RCBV240.SERVICE_MODULE_5;52110000
                                                                        52120000
 IF TB_RCBV240_I.INDNULL(15) = 0 THEN                                   52130000
   EDQBSDS_BAU.CAGRFOR = TB_RCBV240.AGREEMENT_TYPE;                     52140000
                                                                        52150000
 IF TB_RCBV240_I.INDNULL(16) = 0 THEN                                   52160000
   EDQBSDS_BAU.CAGROPT = TB_RCBV240.AGREEMENT_OPTION;                   52170000
                                                                        52180000
 IF TB_RCBV240_I.INDNULL(17) = 0 THEN                                   52190000
   EDQBSDS_BAU.CAGRMSO = TB_RCBV240.SPECIAL_OPTION;                     52200000
                                                                        52210000
 IF TB_RCBV240_I.INDNULL(18) = 0 THEN                                   52220000
   EDQBSDS_BAU.CAGRIAH = TB_RCBV240.AMENDM_COMB_CODE;                   52230000
                                                                        52240000
 IF WRK_SET_HRS = 'N' THEN                                              52250000
 DO;                                                                    52260000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(1).DAGRMFR =                             52270000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_1);52280000
                                                                        52290000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(1).DAGRMTO =                             52300000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_1);  52310000
                                                                        52320000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(2).DAGRMFR =                             52330000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_2);52340000
                                                                        52350000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(2).DAGRMTO =                             52360000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_2);  52370000
                                                                        52380000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(3).DAGRMFR =                             52390000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_3);52400000
                                                                        52410000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(3).DAGRMTO =                             52420000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_3);  52430000
                                                                        52440000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(4).DAGRMFR =                             52450000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_4);52460000
                                                                        52470000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(4).DAGRMTO =                             52480000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_4);  52490000
                                                                        52500000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(5).DAGRMFR =                             52510000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_5);52520000
                                                                        52530000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(5).DAGRMTO =                             52540000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_5);  52550000
                                                                        52560000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(6).DAGRMFR =                             52570000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_6);52580000
                                                                        52590000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(6).DAGRMTO =                             52600000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_6);  52610000
                                                                        52620000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(7).DAGRMFR =                             52630000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_7);52640000
                                                                        52650000
   EDQBSDS_BAU.SRCCCMD.RAGRWCP(7).DAGRMTO =                             52660000
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_7);  52670000
 END;                                                                   52680000
                                                                        52690000
 EDQBSDS_BAU.SRCCCMD.SSRCIND = TB_RCBV240.SOURCE_INDICATOR;             52700000
                                                                        52710000
 EDQBSDS_BAU.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV240.EFFECTIVE_DATE,1,4) || 52720000
                           SUBSTR(TB_RCBV240.EFFECTIVE_DATE,6,2) ||     52730000
                           SUBSTR(TB_RCBV240.EFFECTIVE_DATE,9,2);       52740000
                                                                        52750000
 EDQBSDS_BAU.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV240.END_DATE,1,4) ||       52760000
                           SUBSTR(TB_RCBV240.END_DATE,6,2) ||           52770000
                           SUBSTR(TB_RCBV240.END_DATE,9,2);             52780000
                                                                        52790000
 IF TB_RCBV240_I.INDNULL(34) = 0 THEN                                   52800000
  DO;                                                                   52810000
    EDQBSDS_BAU.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV240.SERVICE_LVL_CODE; 52820000
    CALL RCBCS3M_READ_SERV_COND(TB_RCBV240.SERVICE_LVL_CODE,'BAU');     52830000
  END;                                                                  52840000
                                                                        52850000
 IF TB_RCBV240.SERVICE_LVL_CODE = '' THEN                               52860000
    DO;                                                                 52870000
       CALL RCBCS3M_RTREV_SRVICE_DLVRY_CONS;                            52880000
    END;                                                                52890000
                                                                        52900000
 CALL RCBCS3M_READ_CONTRACT;                                            52910000
                                                                        52920000
 END RCBCS3M_MOVE_SERV_CTR;                                             52930000
                                                                        52940000
1/*********************************************************************/52950000
 /*                                                                   */52960000
 /* MODULE NAME      : RCBCS3M_BAU_CUST                               */52970000
 /*                                                                   */52980000
 /* DESCRIPTION      : RETRIEVE CUSTOMER DETAILS FROM BAU             */52990000
 /*                                                                   */53000000
 /*********************************************************************/53010000
 RCBCS3M_BAU_CUST: PROC;                                                53020000
                                                                        53030000
 TB_RCBV190 = ' ';                                                      53040000
 TB_RCBV010 = ' ';                                                      53050000
                                                                        53060000
 EXEC SQL                                                               53070000
  SELECT T190.CUSTOMER_NUMBER,                                          53080000
         T190.MARKETING_INSTDAT,                                        53090000
         T190.SCHED_REMOVAL_DATE,                                       53100000
         T010.CUSTOMER_NAME,                                            53110000
         T010.TYPE_OF_CUSTOMER                                          53120000
    INTO :TB_RCBV190.CUSTOMER_NUMBER    :WRK_INDNULL,                   53130000
         :TB_RCBV190.MARKETING_INSTDAT  :WRK_INDNULL,                   53140000
         :TB_RCBV190.SCHED_REMOVAL_DATE :WRK_INDNULL,                   53150000
         :TB_RCBV010.CUSTOMER_NAME      :WRK_INDNULL,                   53160000
         :TB_RCBV010.TYPE_OF_CUSTOMER   :WRK_INDNULL                    53170000
  FROM RCBV0190_HW_CUST  T190,                                          53180000
       RCBV0010_CUSTOMER T010                                           53190000
  WHERE T190.COUNTRY_NUMBER   = :REFCTRY                                53200000
    AND T190.PRODUCT_TYPE     = :REQTYPE                                53210000
 /* AND T190.ORIGIN          = :REQORIG                 SOC RB01320 */  53220000
 /* AND  T190.SEQUENCE_NUMBER = :REQSEQN  */                            53230000
                                                 /* SOC CEDS00000727 */ 53240000
 /* AND ((     T190.ORIGIN          = :WRK_ORIGIN                       53250000
          AND  T190.SEQUENCE_NUMBER = :WRK_SEQ_NO)                      53260000
         OR (T190.ORIGIN||T190.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))    53270000
                                                   *//* EOC RB01320 */  53280000
    AND  T190.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)            53290000
    AND  T190.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)              53300000
                                                 /* EOC CEDS00000727 */ 53310000
    AND T190.TYPE_OF_RELATION = 'U'                                     53320000
    AND :DATE10 BETWEEN T190.EFFECTIVE_DATE AND T190.END_DATE           53330000
    AND T010.COUNTRY_NUMBER   = T190.COUNTRY_NUMBER                     53340000
    AND T010.CUSTOMER_NUMBER  = T190.CUSTOMER_NUMBER                    53350000
    AND :DATE10 BETWEEN T010.EFFECTIVE_DATE AND T010.END_DATE           53360000
  WITH UR;                                                              53370000
                                                                        53380000
  SELECT(SQLCA.SQLCODE);                                                53390000
  WHEN(0)                                                               53400000
   DO;                                                                  53410000
    DATA_ORIGIN2 = '0';                              /* CEDS00000538 */ 53420000
    T190_CUSTOMER_FLAG = TRUE;                                          53430000
    WRK_T190_CUST_NUM = TB_RCBV190.CUSTOMER_NUMBER;                     53440000
    EDQBSDS_BAU.CUSCODE.ICUSHWU,                                        53450000
    EDQBSDS_BAU.SRCCCMD.ICUSHWU = TB_RCBV190.CUSTOMER_NUMBER;           53460000
    EDQBSDS_BAU.CUSCODE.ICUSANO = '000';                                53470000
    EDQBSDS_BAU.DHSIINS = SUBSTR(TB_RCBV190.MARKETING_INSTDAT,1,4)      53480000
                       || SUBSTR(TB_RCBV190.MARKETING_INSTDAT,6,2)      53490000
                       || SUBSTR(TB_RCBV190.MARKETING_INSTDAT,9,2);     53500000
    EDQBSDS_BAU.DRMOSMR = SUBSTR(TB_RCBV190.SCHED_REMOVAL_DATE,1,4)     53510000
                       || SUBSTR(TB_RCBV190.SCHED_REMOVAL_DATE,6,2)     53520000
                       || SUBSTR(TB_RCBV190.SCHED_REMOVAL_DATE,9,2);    53530000
                                                                        53540000
    EDQBSDS_BAU.NCUSABB = TB_RCBV010.CUSTOMER_NAME;                     53550000
    EDQBSDS_BAU.CCUSTOC = TB_RCBV010.TYPE_OF_CUSTOMER;                  53560000
                                                                        53570000
    CALL RCBCS3M_BAU_CUST_INFO(TB_RCBV190.CUSTOMER_NUMBER);             53580000
    WRK_ADDRESS_NUMBER_BAU = WRK_ADDRESS_NUMBER;                        53590000
                                                                        53600000
    EDQBSDS_BAU.ICUSGZC = TB_RCBV150.ZIP_CODE;                          53610000
    EDQBSDS_BAU.FCUSEMB = TB_RCBV350.EMBARGO_CODE;                      53620000
    EDQBSDS_BAU.NCUSSTR = WRK_ADDRESS_LINES(1);                         53630000
    EDQBSDS_BAU.ICUSCTY = WRK_ADDRESS_LINES(2);                         53640000
    EDQBSDS_BAU.SEDQTEL = WRK_ADDRESS_LINES(3);                         53650000
    DO I=1 TO 9;                                                        53660000
      USER_EXTRA_INFO_BAU.ADDR_LINES(I) = WRK_ADDRESS_LINES(I);         53670000
    END;                                                                53680000
   END;                                                                 53690000
  WHEN(100);                                                            53700000
  OTHERWISE                                                             53710000
   DO;                                                                  53720000
     RCBCQES.MESSAGE_NUMBER = 'C235';                                   53730000
     WRK_SQLCODE = SQLCA.SQLCODE;                                       53740000
     WRK_TABLE = 'RCBV0010&RCBV0190';                                   53750000
     CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                   53760000
   END;                                                                 53770000
  END;                                                                  53780000
                                                                        53790000
 END RCBCS3M_BAU_CUST;                                                  53800000
1/*********************************************************************/53810000
 /*                                                                   */53820000
 /* MODULE NAME      : RCBCS3M_PI_CUST                                */53830000
 /*                                                                   */53840000
 /* DESCRIPTION      : RETRIEVE CUSTOMER DETAILS FROM PI              */53850000
 /*                                                                   */53860000
 /*********************************************************************/53870000
 RCBCS3M_PI_CUST: PROC;                                                 53880000
                     /* FETCH CUSTOMER DETAILS FROM TABLES T010, T011 */53890000
 CALL RCBCS3M_READ_PI_CUST;                               /* AND T190 */53900000
                                                                        53910000
 T170_OU_CODE_FLAG = FALSE;                           /* SOC RC01313*/  53920000
 /* TO GET OU_CODE FOR GIVEN TOS */                                     53930000
 CALL RCBCS3M_READ_OU_HW;                             /* EOC RC01313*/  53940000
                                                                        53950000
 SELECT(TB_RCBV051.SOURCE_INDICATOR);                                   53960000
 WHEN('O')                                                              53970000
  DO;                                                                   53980000
    SELECT;                                                             53990000
    WHEN(T010_CUSTOMER_FLAG = TRUE)                                     54000000
     DO;                                                                54010000
       DATA_ORIGIN2 = '0';                            /* CEDS00000538 */54020000
       EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T010_CUST_NUM;                  54030000
       EDQBSDS_PI.NCUSABB = WRK_T010_CUST_NAME;       /* CEDS00000522 */54040000
       EDQBSDS_PI.CCUSTOC = WRK_T010_TYPE_OF_CUST;    /* CEDS00000522 */54050000
       CALL RCBCS3M_BAU_CUST_INFO(WRK_T010_CUST_NUM);                   54060000
       T011_CUSTOMER_FLAG  = FALSE;                                     54070000
     END;                                                               54080000
    WHEN(T190_CUSTOMER_FLAG = TRUE)                                     54090000
     DO;                                                                54100000
       DATA_ORIGIN2 = '0';                            /* CEDS00000538 */54110000
       EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T190_CUST_NUM;                  54120000
       EDQBSDS_PI.NCUSABB = TB_RCBV010.CUSTOMER_NAME;  /*CEDS00000522 */54130000
       EDQBSDS_PI.CCUSTOC = TB_RCBV010.TYPE_OF_CUSTOMER;/*CEDS00000522*/54140000
       CALL RCBCS3M_BAU_CUST_INFO(WRK_T190_CUST_NUM);                   54150000
       T011_CUSTOMER_FLAG  = FALSE;                                     54160000
     END;                                                               54170000
    WHEN(T011_CUSTOMER_FLAG = TRUE)                                     54180000
     DO;                                                                54190000
       DATA_ORIGIN2 = '1';                            /* CEDS00000538 */54200000
       EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T011_CUST_NUM;                  54210000
       CALL RCBCS3M_PI_CUST_INFO;                                       54220000
     END;                                                               54230000
    OTHERWISE;                                                          54240000
    END;                                                                54250000
                                                      /* SOC RC01313*/  54260000
    IF (T010_CUSTOMER_FLAG = TRUE |                                     54270000
        T190_CUSTOMER_FLAG = TRUE  ) & T170_OU_CODE_FLAG = TRUE THEN    54280000
    DO;                                                                 54290000
      EDQBSDS_PI.CUSCODE.SEDQCSX = '2' || TB_RCBV170.OU_CODE;           54300000
      EDQBSDS_PI.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV170.OU_CODE;          54310000
    END;                                                                54320000
                                                      /* EOC RC01313*/  54330000
  END;                                                                  54340000
 WHEN('S')                                                              54350000
  DO;                                                                   54360000
    SELECT;                                                             54370000
    WHEN(T190_CUSTOMER_FLAG = TRUE)                                     54380000
     DO;                                                                54390000
       DATA_ORIGIN2 = '0';                            /* CEDS00000538 */54400000
       EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T190_CUST_NUM;                  54410000
       EDQBSDS_PI.NCUSABB = TB_RCBV010.CUSTOMER_NAME;  /* CEDS00000522*/54420000
       EDQBSDS_PI.CCUSTOC = TB_RCBV010.TYPE_OF_CUSTOMER;/*CEDS00000522*/54430000
       CALL RCBCS3M_BAU_CUST_INFO(WRK_T190_CUST_NUM);                   54440000
       T011_CUSTOMER_FLAG  = FALSE;                                     54450000
       IF T170_OU_CODE_FLAG = TRUE THEN               /* SOC RC01313*/  54460000
       DO;                                                              54470000
         EDQBSDS_PI.CUSCODE.SEDQCSX = '2' || TB_RCBV170.OU_CODE;        54480000
         EDQBSDS_PI.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV170.OU_CODE;       54490000
       END;                                           /* EOC RC01313*/  54500000
     END;                                                               54510000
    WHEN(T011_CUSTOMER_FLAG = TRUE)                                     54520000
     DO;                                                                54530000
       DATA_ORIGIN2 = '1';                            /* CEDS00000538 */54540000
       EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T011_CUST_NUM;                  54550000
       CALL RCBCS3M_PI_CUST_INFO;                                       54560000
     END;                                                               54570000
    OTHERWISE;                                                          54580000
    END;                                                                54590000
  END;                                                                  54600000
 OTHERWISE                                                              54610000
  DO;                                                                   54620000
    SELECT;                                                             54630000
    WHEN(T190_CUSTOMER_FLAG = TRUE)                                     54640000
     DO;                                                                54650000
       DATA_ORIGIN2 = '0';                            /* CEDS00000538 */54660000
       EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T190_CUST_NUM;                  54670000
       EDQBSDS_PI.NCUSABB = TB_RCBV010.CUSTOMER_NAME;  /* CEDS00000522*/54680000
       EDQBSDS_PI.CCUSTOC = TB_RCBV010.TYPE_OF_CUSTOMER;/*CEDS00000522*/54690000
       CALL RCBCS3M_BAU_CUST_INFO(WRK_T190_CUST_NUM);                   54700000
       T011_CUSTOMER_FLAG  = FALSE;                                     54710000
       IF T170_OU_CODE_FLAG = TRUE THEN               /* SOC RC01313*/  54720000
       DO;                                                              54730000
         EDQBSDS_PI.CUSCODE.SEDQCSX = '2' || TB_RCBV170.OU_CODE;        54740000
         EDQBSDS_PI.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV170.OU_CODE;       54750000
       END;                                           /* EOC RC01313*/  54760000
     END;                                                               54770000
    WHEN(T010_CUSTOMER_FLAG = TRUE)                                     54780000
     DO;                                                                54790000
       DATA_ORIGIN2 = '0';                            /* CEDS00000538 */54800000
       EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T010_CUST_NUM;                  54810000
       EDQBSDS_PI.NCUSABB = WRK_T010_CUST_NAME;       /* CEDS00000522 */54820000
       EDQBSDS_PI.CCUSTOC = WRK_T010_TYPE_OF_CUST;    /* CEDS00000522 */54830000
       CALL RCBCS3M_BAU_CUST_INFO(WRK_T010_CUST_NUM);                   54840000
       T011_CUSTOMER_FLAG  = FALSE;                                     54850000
     END;                                                               54860000
     WHEN(T011_CUSTOMER_FLAG = TRUE)              /* SOC CEDS00000739 */54870000
      DO;                                                               54880000
        DATA_ORIGIN2 = '1';                                             54890000
        EDQBSDS_PI.CUSCODE.ICUSHWU = WRK_T011_CUST_NUM;                 54900000
        CALL RCBCS3M_PI_CUST_INFO;                                      54910000
      END;                                        /* EOC CEDS00000739 */54920000
    OTHERWISE;                                                          54930000
    END;                                                                54940000
  END;                                                                  54950000
 END;                                                                   54960000
                                                                        54970000
 EDQBSDS_PI.SRCCCMD.ICUSHWU = EDQBSDS_PI.CUSCODE.ICUSHWU;               54980000
                                                                        54990000
 /* FOR BAU CUSTOMER, ZIP CODE, EMBARGO CODE ETC.,ARE TAKEN FROM        55000000
   RESPECTIVE BAU TABLES                                           */   55010000
 /* FOR PI CUSTOMER THEY WOULD HAVE BEEN RETRIEVED FROM TABLE T011      55020000
   IN RCBCS3M_PI_CUST_INFO PROC                                    */   55030000
 IF ((T190_CUSTOMER_FLAG = TRUE) | (T010_CUSTOMER_FLAG = TRUE))         55040000
     & (T011_CUSTOMER_FLAG = FALSE) THEN                                55050000
  DO;                                                                   55060000
   EDQBSDS_PI.CUSCODE.ICUSANO = '000';                                  55070000
   EDQBSDS_PI.ICUSGZC = TB_RCBV150.ZIP_CODE;                            55080000
   EDQBSDS_PI.FCUSEMB = TB_RCBV350.EMBARGO_CODE;                        55090000
   /* EDQBSDS_PI.NCUSABB = WRK_T010_CUST_NAME;           CEDS00000522 */55100000
   /* EDQBSDS_PI.CCUSTOC = WRK_T010_TYPE_OF_CUST;        CEDS00000522 */55110000
   EDQBSDS_PI.NCUSSTR = WRK_ADDRESS_LINES(1);                           55120000
   EDQBSDS_PI.ICUSCTY = WRK_ADDRESS_LINES(2);                           55130000
   EDQBSDS_PI.SEDQTEL = WRK_ADDRESS_LINES(3);                           55140000
   WRK_ADDRESS_NUMBER_PI = WRK_ADDRESS_NUMBER;                          55150000
   DO I=1 TO 9;                                                         55160000
     USER_EXTRA_INFO_PI.ADDR_LINES(I) = WRK_ADDRESS_LINES(I);           55170000
   END;                                                                 55180000
  END;                                                                  55190000
                                                                        55200000
 END RCBCS3M_PI_CUST;                                                   55210000
1/*********************************************************************/55220000
 /*                                                                   */55230000
 /* MODULE NAME      : RCBCS3M_BAU_CUST_INFO                          */55240000
 /*                                                                   */55250000
 /* DESCRIPTION      : RETRIEVE BAU CUSTOMER DETAILS                  */55260000
 /*                                                                   */55270000
 /*********************************************************************/55280000
 RCBCS3M_BAU_CUST_INFO: PROC(WRK_CUSTOMER_NUMBER);                      55290000
                                                                        55300000
 DCL WRK_CUSTOMER_NUMBER CHAR(08);                                      55310000
                                                                        55320000
 EXEC SQL                                                               55330000
  SELECT EMBARGO_CODE                                                   55340000
  /*INTO :TB_RCBV350.EMBARGO_CODE                      CEDS00000518 */  55350000
    INTO :TB_RCBV350.EMBARGO_CODE :WRK_INDNULL      /* CEDS00000518 */  55360000
  FROM RCBV0350_CUST_MOD                                                55370000
  WHERE COUNTRY_NUMBER = :REFCTRY                                       55380000
  AND CUSTOMER_NUMBER  = :WRK_CUSTOMER_NUMBER                           55390000
  AND :DATE10 BETWEEN EFFECTIVE_DATE AND END_DATE                       55400000
 WITH UR;                                                               55410000
                                                                        55420000
 SELECT(SQLCA.SQLCODE);                                                 55430000
 WHEN(0,100);                                                           55440000
 OTHERWISE                                                              55450000
   DO;                                                                  55460000
     RCBCQES.MESSAGE_NUMBER = 'C236';                                   55470000
     WRK_SQLCODE = SQLCA.SQLCODE;                                       55480000
     WRK_TABLE = 'RCBV0350_CUST_MOD';                                   55490000
     CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                   55500000
   END;                                                                 55510000
 END;                                                                   55520000
                                                                        55530000
 IF WRK_ADDRESS_RES = '1' THEN                                          55540000
   DO;                                                                  55550000
    TB_RCBV340 = ' ';                                                   55560000
    TB_RCBV150 = ' ';                                                   55570000
    TB_RCBV340.PRODUCT_TYPE    = REQTYPE ;                              55580000
 /* TB_RCBV340.ORIGIN          = REQORIG;            SOC RB01320 */     55590000
 /* TB_RCBV340.SEQUENCE_NUMBER = REQSEQN;                         */    55600000
                                                 /* SOC CEDS00000727 */ 55610000
 /* TB_RCBV340.ORIGIN          = WRK_ORIGIN;                            55620000
    TB_RCBV340.SEQUENCE_NUMBER = WRK_SEQ_NO;    *//* EOC RB01320 */     55630000
    TB_RCBV340.ORIGIN          = SUBSTR(WRK_LONG_SERIAL,1,2);           55640000
    TB_RCBV340.SEQUENCE_NUMBER = SUBSTR(WRK_LONG_SERIAL,3);             55650000
                                                 /* EOC CEDS00000727 */ 55660000
    TB_RCBV340.CUSTOMER_USER   = WRK_CUSTOMER_NUMBER;                   55670000
    TB_RCBV150.COUNTRY_NUMBER  = REFCTRY;                               55680000
    TB_RCBV150.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER;                   55690000
                                                                        55700000
    CALL RCBCS3M_SELECT_RCBV340;                                        55710000
    IF SQLCA.SQLCODE = 0 THEN                                           55720000
      WRK_ADDRESS_NUMBER = TB_RCBV340.ADDRESS_NUMBER;                   55730000
   END;                                                                 55740000
                                                                        55750000
 IF WRK_ADDRESS_NUMBER = ' ' THEN                                       55760000
   DO;                                                                  55770000
    TB_RCBV150 = ' ';                                                   55780000
    TB_RCBV150.COUNTRY_NUMBER  = REFCTRY;                               55790000
    TB_RCBV150.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER;                   55800000
                                                                        55810000
    CALL RCBCS3M_SELECT_RCBV150;                                        55820000
    IF SQLCA.SQLCODE = 0 THEN                                           55830000
      WRK_ADDRESS_NUMBER = TB_RCBV150.ADDRESS_NUMBER;                   55840000
   END;                                                                 55850000
                                                                        55860000
 WRK_ADDRESS_LINES = ' ';                                               55870000
                                                                        55880000
 IF WRK_ADDRESS_NUMBER ¬= ' ' THEN                                      55890000
 DO;                                                                    55900000
   TB_RCBV280 = ' ';                                                    55910000
                                                                        55920000
   TB_RCBV280.COUNTRY_NUMBER = REFCTRY;                                 55930000
   TB_RCBV280.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER;                    55940000
   TB_RCBV280.ADDRESS_NUMBER = WRK_ADDRESS_NUMBER;                      55950000
   CALL RCBCS3M_ADDRESS_LINE('@OPENN');                                 55960000
   CALL RCBCS3M_ADDRESS_LINE('@FETCH');                                 55970000
   DO I= 1 TO 9 WHILE (¬SWITCH_EOC_ADDR);                               55980000
     WRK_ADDRESS_LINES(I) = TB_RCBV280.TEXT;                            55990000
     CALL RCBCS3M_ADDRESS_LINE('@FETCH');                               56000000
   END;                                                                 56010000
   CALL RCBCS3M_ADDRESS_LINE('@CLOSE');                                 56020000
 END;                                                                   56030000
                                                                        56040000
 END RCBCS3M_BAU_CUST_INFO;                                             56050000
1/*********************************************************************/56060000
 /*                                                                   */56070000
 /* MODULE NAME      : RCBCS3M_PI_CUST_INFO                           */56080000
 /*                                                                   */56090000
 /* DESCRIPTION      : RETRIEVE PI CUSTOMER DETAILS                   */56100000
 /*                                                                   */56110000
 /*********************************************************************/56120000
 RCBCS3M_PI_CUST_INFO: PROC;                                            56130000
                                                                        56140000
 IF TB_RCBV011_I.INDNULL(03) = 0 THEN                                   56150000
   EDQBSDS_PI.CUSCODE.ICUSANO = TB_RCBV011.CUSTOMER_NR_EXTEND;          56160000
 ELSE                                                                   56170000
   EDQBSDS_PI.CUSCODE.ICUSANO = '';                                     56180000
                                                                        56190000
 IF TB_RCBV011_I.INDNULL(04) = 0 THEN                                   56200000
   EDQBSDS_PI.NCUSABB = TB_RCBV011.CUSTOMER_NAME;                       56210000
 ELSE                                                                   56220000
   EDQBSDS_PI.NCUSABB = '';                                             56230000
                                                                        56240000
 IF TB_RCBV011_I.INDNULL(05) = 0 THEN                                   56250000
   EDQBSDS_PI.CCUSTOC = TB_RCBV011.TYPE_OF_CUSTOMER;                    56260000
 ELSE                                                                   56270000
   EDQBSDS_PI.CCUSTOC = '';                                             56280000
                                                                        56290000
 IF TB_RCBV011_I.INDNULL(06) = 0 THEN                                   56300000
   EDQBSDS_PI.NCUSSTR = TB_RCBV011.ADDRESS_LINE_1;                      56310000
 ELSE                                                                   56320000
   EDQBSDS_PI.NCUSSTR = '';                                             56330000
                                                                        56340000
 IF TB_RCBV011_I.INDNULL(07) = 0 THEN                                   56350000
   EDQBSDS_PI.ICUSCTY = TB_RCBV011.ADDRESS_LINE_2;                      56360000
 ELSE                                                                   56370000
   EDQBSDS_PI.ICUSCTY = '';                                             56380000
                                                                        56390000
 IF TB_RCBV011_I.INDNULL(08) = 0 THEN                                   56400000
   EDQBSDS_PI.SEDQTEL = TB_RCBV011.ADDRESS_LINE_3;                      56410000
 ELSE                                                                   56420000
   EDQBSDS_PI.SEDQTEL = '';                                             56430000
                                                                        56440000
 IF TB_RCBV011_I.INDNULL(09) = 0 THEN                                   56450000
   EDQBSDS_PI.ICUSGZC = TB_RCBV011.ZIP_CODE;                            56460000
 ELSE                                                                   56470000
   EDQBSDS_PI.ICUSGZC = '';                                             56480000
                                                                        56490000
 IF TB_RCBV011_I.INDNULL(10) = 0 THEN                                   56500000
   EDQBSDS_PI.FCUSEMB = TB_RCBV011.EMBARGO_CODE;                        56510000
 ELSE                                                                   56520000
   EDQBSDS_PI.FCUSEMB = '';                                             56530000
                                                                        56540000
 USER_EXTRA_INFO_PI.ADDR_LINES(1) = TB_RCBV011.ADDRESS_LINE_1 ;         56550000
 USER_EXTRA_INFO_PI.ADDR_LINES(2) = TB_RCBV011.ADDRESS_LINE_2 ;         56560000
 USER_EXTRA_INFO_PI.ADDR_LINES(3) = TB_RCBV011.ADDRESS_LINE_3 ;         56570000
 USER_EXTRA_INFO_PI.ADDR_LINES(4) = TB_RCBV011.ZIP_CODE;                56580000
                                                                        56590000
 END RCBCS3M_PI_CUST_INFO;                                              56600000
1/*********************************************************************/56610000
 /*                                                                   */56620000
 /* MODULE NAME      : RCBCS3M_READ_PI_CUST                           */56630000
 /*                                                                   */56640000
 /* DESCRIPTION      : RETRIEVE CUSTOMER DETAILS FROM TABLES T010,    */56650000
 /*                    T011 & T190                                    */56660000
 /*********************************************************************/56670000
 RCBCS3M_READ_PI_CUST: PROC;                                            56680000
                                                                        56690000
 T010_CUSTOMER_FLAG = FALSE;                                            56700000
 T011_CUSTOMER_FLAG = FALSE;                                            56710000
                                                                        56720000
 IF T190_CUSTOMER_FLAG = FALSE THEN                                     56730000
  DO;                                                                   56740000
  EXEC SQL                                                              56750000
    SELECT T190.CUSTOMER_NUMBER,                                        56760000
           T010.CUSTOMER_NAME,                                          56770000
           T010.TYPE_OF_CUSTOMER                                        56780000
    INTO :WRK_T190_CUST_NUM     :WRK_INDNULL,                           56790000
    /*   :WRK_T010_CUST_NAME    :WRK_INDNULL,        SOC CEDS00000522   56800000
         :WRK_T010_TYPE_OF_CUST :WRK_INDNULL   */                       56810000
         :TB_RCBV010.CUSTOMER_NAME      :WRK_INDNULL,                   56820000
         :TB_RCBV010.TYPE_OF_CUSTOMER   :WRK_INDNULL                    56830000
                                                  /* EOC CEDS00000522 */56840000
    FROM RCBV0190_HW_CUST T190,                                         56850000
         RCBV0010_CUSTOMER T010                                         56860000
    WHERE T190.COUNTRY_NUMBER   = :REFCTRY                              56870000
      AND T190.PRODUCT_TYPE     = :REQTYPE                              56880000
 /*   AND T190.ORIGIN           = :REQORIG              SOC RB01320 */  56890000
 /*   AND T190.SEQUENCE_NUMBER  = :REQSEQN    */                        56900000
                                                 /* SOC CEDS00000727 */ 56910000
 /*   AND ((     T190.ORIGIN          = :WRK_ORIGIN                     56920000
            AND  T190.SEQUENCE_NUMBER = :WRK_SEQ_NO)                    56930000
           OR (T190.ORIGIN||T190.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))  56940000
                                                   *//* EOC RB01320 */  56950000
      AND  T190.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)          56960000
      AND  T190.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)            56970000
                                                 /* EOC CEDS00000727 */ 56980000
      AND T190.TYPE_OF_RELATION = 'U'                                   56990000
      AND :DATE10 BETWEEN T190.EFFECTIVE_DATE AND T190.END_DATE         57000000
      AND T010.COUNTRY_NUMBER   = T190.COUNTRY_NUMBER                   57010000
      AND T010.CUSTOMER_NUMBER  = T190.CUSTOMER_NUMBER                  57020000
      AND :DATE10 BETWEEN T010.EFFECTIVE_DATE AND T010.END_DATE         57030000
    WITH UR;                                                            57040000
                                                                        57050000
    SELECT(SQLCA.SQLCODE);                                              57060000
      WHEN(0) T190_CUSTOMER_FLAG = TRUE;                                57070000
      WHEN(100) T190_CUSTOMER_FLAG = FALSE;                             57080000
      OTHERWISE                                                         57090000
      DO;                                                               57100000
        RCBCQES.MESSAGE_NUMBER = 'C237';                                57110000
        WRK_SQLCODE = SQLCA.SQLCODE;                                    57120000
        WRK_TABLE = 'RCBV0190&RCBV0010';                                57130000
        CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                57140000
      END;                                                              57150000
    END;                                                                57160000
  END;                                                                  57170000
                                                                        57180000
 EXEC SQL                                                               57190000
   SELECT COUNTRY_NUMBER    ,                                           57200000
          CUSTOMER_NUMBER   ,                                           57210000
          CUSTOMER_NR_EXTEND,                                           57220000
          CUSTOMER_NAME     ,                                           57230000
          TYPE_OF_CUSTOMER  ,                                           57240000
          ADDRESS_LINE_1    ,                                           57250000
          ADDRESS_LINE_2    ,                                           57260000
          ADDRESS_LINE_3    ,                                           57270000
          ZIP_CODE          ,                                           57280000
          EMBARGO_CODE      ,                                           57290000
          SOURCE_INDICATOR  ,                                           57300000
          LAST_CHANGE_DATE                                              57310000
   INTO :TB_RCBV011                                                     57320000
        :TB_RCBV011_I.INDNULL                                           57330000
   FROM   RCBV0011_PI_CUST  T011                                        57340000
   WHERE T011.COUNTRY_NUMBER     = :REFCTRY                             57350000
    AND  T011.CUSTOMER_NUMBER    = :TB_RCBV051.CUSTOMER_NUMBER          57360000
    AND  T011.CUSTOMER_NR_EXTEND = :TB_RCBV051.CUSTOMER_NR_EXTEND       57370000
   WITH UR;                                                             57380000
                                                                        57390000
   SELECT(SQLCA.SQLCODE);                                               57400000
   WHEN(0)                                                              57410000
   DO;                                                                  57420000
     T011_CUSTOMER_FLAG = TRUE;                                         57430000
     WRK_T011_CUST_NUM = TB_RCBV011.CUSTOMER_NUMBER;                    57440000
   END;                                                                 57450000
   WHEN(100) T011_CUSTOMER_FLAG =  FALSE;                               57460000
   OTHERWISE                                                            57470000
    DO;                                                                 57480000
      RCBCQES.MESSAGE_NUMBER = 'C238';                                  57490000
      WRK_SQLCODE = SQLCA.SQLCODE;                                      57500000
      WRK_TABLE = 'RCBV0011_PI_CUST';                                   57510000
      CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                  57520000
    END;                                                                57530000
   END;                                                                 57540000
                                                                        57550000
 EXEC SQL                                                               57560000
   SELECT CUSTOMER_NUMBER,                                              57570000
          CUSTOMER_NAME,                                                57580000
          TYPE_OF_CUSTOMER                                              57590000
    INTO :WRK_T010_CUST_NUM     :WRK_INDNULL,                           57600000
         :WRK_T010_CUST_NAME    :WRK_INDNULL,                           57610000
         :WRK_T010_TYPE_OF_CUST :WRK_INDNULL                            57620000
    FROM RCBV0010_CUSTOMER                                              57630000
    WHERE COUNTRY_NUMBER = :REFCTRY                                     57640000
    AND CUSTOMER_NUMBER  = :TB_RCBV051.CUSTOMER_NUMBER                  57650000
    AND :DATE10 BETWEEN EFFECTIVE_DATE AND END_DATE                     57660000
   WITH UR;                                                             57670000
                                                                        57680000
   SELECT(SQLCA.SQLCODE);                                               57690000
   WHEN(0) T010_CUSTOMER_FLAG = TRUE;                                   57700000
   WHEN(100) T010_CUSTOMER_FLAG = FALSE;                                57710000
   OTHERWISE                                                            57720000
    DO;                                                                 57730000
    /*RCBCQES.MESSAGE_NUMBER = 'C239';                  CEDS00000522 */ 57740000
      RCBCQES.MESSAGE_NUMBER = 'C262';               /* CEDS00000522 */ 57750000
      WRK_SQLCODE = SQLCA.SQLCODE;                                      57760000
      WRK_TABLE = 'RCBV0010_CUSTOMER';                                  57770000
      CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                  57780000
    END;                                                                57790000
   END;                                                                 57800000
                                                                        57810000
 END RCBCS3M_READ_PI_CUST;                                              57820000
1/*********************************************************************/57830000
 /*                                                                   */57840000
 /* MODULE NAME      : RCBCS3M_SELECT_RCBV340                         */57850000
 /*                                                                   */57860000
 /* DESCRIPTION      : RETRIEVE DETAILS FROM TABLE RCBT340            */57870000
 /*                                                                   */57880000
 /*********************************************************************/57890000
 RCBCS3M_SELECT_RCBV340: PROC;                                          57900000
                                                                        57910000
 EXEC SQL                                                               57920000
  SELECT T340.ADDRESS_NUMBER,                                           57930000
         T150.ZIP_CODE                                                  57940000
  INTO :TB_RCBV340.ADDRESS_NUMBER :WRK_INDNULL,                         57950000
       :TB_RCBV150.ZIP_CODE       :WRK_INDNULL                          57960000
  FROM RCBV0340_HW_ADDR T340,                                           57970000
       RCBV0150_CUST_ADDR T150                                          57980000
  WHERE T150.COUNTRY_NUMBER   = :TB_RCBV150.COUNTRY_NUMBER              57990000
    AND T150.CUSTOMER_NUMBER  = :TB_RCBV150.CUSTOMER_NUMBER             58000000
                                                  /* SOC CEDS00000522 */58010000
  /*AND T150.ADDRESS_NUMBER   = :TB_RCBV150.ADDRESS_NUMBER */           58020000
    AND T150.ADDRESS_NUMBER   = T340.ADDRESS_NUMBER                     58030000
                                                  /* EOC CEDS00000522 */58040000
    AND :DATE10  BETWEEN T150.EFFECTIVE_DATE AND T150.END_DATE          58050000
    AND T340.COUNTRY_NUMBER   = T150.COUNTRY_NUMBER                     58060000
    AND T340.PRODUCT_TYPE     = :TB_RCBV340.PRODUCT_TYPE                58070000
 /* AND T340.ORIGIN           = :TB_RCBV340.ORIGIN     SOC RB01320  */  58080000
 /* AND T340.SEQUENCE_NUMBER  = :TB_RCBV340.SEQUENCE_NUMBER         */  58090000
                                                 /* SOC CEDS00000727 */ 58100000
 /* AND ((    T340.ORIGIN           = :TB_RCBV340.ORIGIN                58110000
          AND T340.SEQUENCE_NUMBER  = :TB_RCBV340.SEQUENCE_NUMBER)      58120000
         OR (T340.ORIGIN||T340.SEQUENCE_NUMBER = : WRK_LONG_SERIAL))    58130000
                                                  *//* EOC RB01320  */  58140000
    AND  T340.ORIGIN          = SUBSTR(:WRK_LONG_SERIAL,1,2)            58150000
    AND  T340.SEQUENCE_NUMBER = SUBSTR(:WRK_LONG_SERIAL,3)              58160000
                                                 /* EOC CEDS00000727 */ 58170000
    AND T340.CUSTOMER_USER    = :TB_RCBV340.CUSTOMER_USER               58180000
    AND :DATE10 BETWEEN T340.EFFECTIVE_DATE AND T340.END_DATE           58190000
  WITH UR;                                                              58200000
                                                                        58210000
  SELECT(SQLCA.SQLCODE);                                                58220000
  WHEN(0,100);                                                          58230000
  OTHERWISE                                                             58240000
    DO;                                                                 58250000
      RCBCQES.MESSAGE_NUMBER = 'C240';                                  58260000
      WRK_SQLCODE = SQLCA.SQLCODE;                                      58270000
      WRK_TABLE = 'RCBV0150&RCBV0340';                                  58280000
      CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                  58290000
    END;                                                                58300000
  END;                                                                  58310000
                                                                        58320000
 END RCBCS3M_SELECT_RCBV340;                                            58330000
1/*********************************************************************/58340000
 /*                                                                   */58350000
 /* MODULE NAME      : RCBCS3M_SELECT_RCBV150                         */58360000
 /*                                                                   */58370000
 /* DESCRIPTION      : RETRIEVE DETAILS FROM TABLE RCBT150            */58380000
 /*                                                                   */58390000
 /*********************************************************************/58400000
 RCBCS3M_SELECT_RCBV150: PROC;                                          58410000
                                                                        58420000
 EXEC SQL                                                               58430000
  SELECT ADDRESS_NUMBER,                                                58440000
         ZIP_CODE                                                       58450000
  INTO :TB_RCBV150.ADDRESS_NUMBER :WRK_INDNULL,                         58460000
       :TB_RCBV150.ZIP_CODE       :WRK_INDNULL                          58470000
  FROM RCBV0150_CUST_ADDR T150                                          58480000
  WHERE T150.COUNTRY_NUMBER  = :TB_RCBV150.COUNTRY_NUMBER               58490000
    AND T150.CUSTOMER_NUMBER = :TB_RCBV150.CUSTOMER_NUMBER              58500000
    AND T150.ADDRESS_NUMBER  =                                          58510000
        ( SELECT MIN(ADDRESS_NUMBER)                                    58520000
          FROM RCBV0150_CUST_ADDR                                       58530000
          WHERE COUNTRY_NUMBER = :TB_RCBV150.COUNTRY_NUMBER             58540000
           AND CUSTOMER_NUMBER = :TB_RCBV150.CUSTOMER_NUMBER            58550000
     /*    AND T150.ADDRESS_MASK LIKE '__1%'  */ /* SOC CEDS00000650 */ 58560000
           AND ADDRESS_MASK LIKE '__1%'          /* EOC CEDS00000650 */ 58570000
           AND :DATE10 BETWEEN EFFECTIVE_DATE AND END_DATE)             58580000
  WITH UR;                                                              58590000
                                                                        58600000
  SELECT(SQLCA.SQLCODE);                                                58610000
    WHEN(0,100);                                                        58620000
    OTHERWISE                                                           58630000
     DO;                                                                58640000
     /*RCBCQES.MESSAGE_NUMBER = 'C241';*/              /* SOC RC01326 */58650000
       RCBCQES.MESSAGE_NUMBER = 'C246';                /* EOC RC01326 */58660000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     58670000
       WRK_TABLE = 'RCBV0150_CUST_ADDR';                                58680000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 58690000
     END;                                                               58700000
  END;                                                                  58710000
                                                                        58720000
 END RCBCS3M_SELECT_RCBV150;                                            58730000
1/*********************************************************************/58740000
 /*                                                                   */58750000
 /* MODULE NAME      : RCBCS3M_ADDRESS_LINE                           */58760000
 /*                                                                   */58770000
 /* DESCRIPTION      : RETRIEVE ADDRESS LINES FROM TABLE RCBT280      */58780000
 /*                                                                   */58790000
 /*********************************************************************/58800000
 RCBCS3M_ADDRESS_LINE: PROC(ACTION);                                    58810000
                                                                        58820000
 DCL ACTION CHAR(06);                                                   58830000
                                                                        58840000
 SELECT(ACTION);                                                        58850000
   WHEN('@OPENN')                                                       58860000
    DO;                                                                 58870000
      EXEC SQL                                                          58880000
       OPEN ADDR_CURSOR;                                                58890000
      IF SQLCA.SQLCODE ¬= 0 THEN                                        58900000
       DO;                                                              58910000
         RCBCQES.MESSAGE_NUMBER = 'C242';                               58920000
         WRK_SQLCODE = SQLCA.SQLCODE;                                   58930000
         WRK_TABLE = 'RCBV0280_ADDR_LIN1';                              58940000
         CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);               58950000
       END;                                                             58960000
    END;                                                                58970000
   WHEN('@FETCH')                                                       58980000
    DO;                                                                 58990000
      EXEC SQL                                                          59000000
       FETCH ADDR_CURSOR                                                59010000
        INTO :TB_RCBV280.LINE_NUMBER :WRK_INDNULL,                      59020000
             :TB_RCBV280.TEXT :WRK_INDNULL;                             59030000
         SELECT(SQLCA.SQLCODE);                                         59040000
         WHEN(0) SWITCH_EOC_ADDR = FALSE;                               59050000
         WHEN(100) SWITCH_EOC_ADDR = TRUE;                              59060000
         OTHERWISE                                                      59070000
          DO;                                                           59080000
            RCBCQES.MESSAGE_NUMBER = 'C243';                            59090000
            WRK_SQLCODE = SQLCA.SQLCODE;                                59100000
            WRK_TABLE = 'RCBV0280_ADDR_LIN2';                           59110000
            CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);            59120000
          END;                                                          59130000
         END;                                                           59140000
    END;                                                                59150000
   OTHERWISE                                                            59160000
    DO;                                                                 59170000
      EXEC SQL                                                          59180000
       CLOSE ADDR_CURSOR;                                               59190000
      IF SQLCA.SQLCODE ¬= 0 THEN                                        59200000
       DO;                                                              59210000
         RCBCQES.MESSAGE_NUMBER = 'C244';                               59220000
         WRK_SQLCODE = SQLCA.SQLCODE;                                   59230000
         WRK_TABLE = 'RCBV0280_ADDR_LIN3';                              59240000
         CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);               59250000
       END;                                                             59260000
    END;                                                                59270000
   END;                                                                 59280000
                                                                        59290000
 END RCBCS3M_ADDRESS_LINE;                                              59300000
1/*********************************************************************/59310000
 /*                                                                   */59320000
 /* MODULE NAME      : RCBCS3M_RTREV_SRVICE_DLVRY_CONS                */59330000
 /*                                                                   */59340000
 /* DESCRIPTION      : PASSING SDM TO DOWNSTREAM I.S.O. SERVICE TYPE  */59350000
 /*                                                                   */59360000
 /*********************************************************************/59370000
0RCBCS3M_RTREV_SRVICE_DLVRY_CONS: PROC;                                 59380000
                                                                        59390000
 TB_RCBV645                  = '';                                      59400000
 TB_RCBV645_I.INDNULL(*)     = 0;                                       59410000
 TB_RCBV645.SERVICE_TYPE     = TB_RCBV240.SERVICE_TYPE;                 59420000
                                                                        59430000
 EXEC SQL                                                               59440000
   SELECT * INTO : TB_RCBV645 :TB_RCBV645_I.INDNULL                     59450000
   FROM RCBT0645_CTRY_SVT                                               59460000
   WHERE     SERVICE_TYPE    =  :TB_RCBV645.SERVICE_TYPE                59470000
   AND       COUNTRY_NUMBER  =  :REFCTRY                                59480000
   AND       CONSOLIDATE_IND =  'Y' ;                                   59490000
                                                                        59500000
 SELECT (SQLCA.SQLCODE);                                                59510000
 WHEN (0)                                                               59520000
 DO;                                                                    59530000
   EDQBSDS_BAU.SRCCCMD.SERVICE_DLVR_METHD  =                            59540000
                    TB_RCBV645.SERVICE_DLVR_METHD;                      59550000
 END;                                                                   59560000
 WHEN (100)                                                             59570000
 DO;                                                                    59580000
   EDQBSDS_BAU.SRCCCMD.SERVICE_DLVR_METHD  = TB_RCBV240.SERVICE_TYPE;   59590000
 END;                                                                   59600000
 OTHERWISE                                                              59610000
 DO;                                                                    59620000
   RCBCQES.MESSAGE_NUMBER = 'C245';                                     59630000
   WRK_SQLCODE = SQLCA.SQLCODE;                                         59640000
   WRK_TABLE = 'RCBT0645_CTRY_SVT';                                     59650000
   CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                     59660000
 END;                                                                   59670000
 END;                                                                   59680000
 END RCBCS3M_RTREV_SRVICE_DLVRY_CONS;                                   59690000
1/*********************************************************************/59700000
 /*                                                                   */59710000
 /* MODULE NAME      : RCBCS3M_CHECK_PRIORITY                         */59720000
 /*                                                                   */59730000
 /* DESCRIPTION      :                                                */59740000
 /*                                                                   */59750000
 /*                                                                   */59760000
 /*********************************************************************/59770000
 RCBCS3M_CHECK_PRIORITY : PROC;                                         59780000
                                                                        59790000
 IF ¬OUT_OF_COUNTRY THEN DO;                                            59800000
 SELECT;                                                                59810000
  WHEN(SWITCH_BAU_WARR) DO;                                             59820000
    USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                              59830000
    WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                               59840000
    SELECT;                                                             59850000
    WHEN(SWITCH_BAU_CTR) DO;                                            59860000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                   59870000
      COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_BAUWARR_EFFDATE,  59880000
                                 EDQBSDS_BAU.DDBSEFF);                  59890000
      COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_BAUWARR_ENDDATE,  59900000
                                 EDQBSDS_BAU.DDBSMED);                  59910000
    END;                                                                59920000
    WHEN(SWITCH_PI_CTR) DO;                                             59930000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS, BY NAME;                  59940000
      COMMAREA.EDQBSDS.SRCCCMD = EDQBSDS_PI.EDQBSDS.SRCCCMD,BY NAME;    59950000
      COMMAREA.EDQBSDS.CHSISTM = EDQBSDS_BAU.CHSISTM;                   59960000
      COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_BAUWARR_EFFDATE,  59970000
                                 EDQBSDS_PI.DDBSEFF);                   59980000
      COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_BAUWARR_ENDDATE,  59990000
                                 EDQBSDS_PI.DDBSMED);                   60000000
    END;                                                                60010000
    WHEN(SWITCH_HV_CTR)                                                 60020000
    DO;                                                                 60030000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                   60040000
      COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_BAUWARR_EFFDATE,  60050000
                                 EDQBSDS_BAU.DDBSEFF);                  60060000
      COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_BAUWARR_ENDDATE,  60070000
                                 EDQBSDS_BAU.DDBSMED);                  60080000
    END;                                                                60090000
    OTHERWISE DO;                                                       60100000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                   60110000
      COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                          60120000
    END;                                                                60130000
    END;                                                                60140000
  END;                                                                  60150000
                                                                        60160000
  WHEN(SWITCH_PI_WARR) DO;                                              60170000
   USER_EXTRA_INFO = USER_EXTRA_INFO_PI;                                60180000
   WRK_AAS_ADD = WRK_ADDRESS_NUMBER_PI;                                 60190000
   SELECT;                                                              60200000
   WHEN(SWITCH_BAU_CTR) DO;                                             60210000
    COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS,BY NAME;                      60220000
    COMMAREA.EDQBSDS.SRCCCMD = EDQBSDS_BAU.EDQBSDS.SRCCCMD,BY NAME;     60230000
    COMMAREA.EDQBSDS.CHSISTM = EDQBSDS_PI.CHSISTM;                      60240000
    COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_PIWARR_EFFDATE,     60250000
                                  EDQBSDS_BAU.DDBSEFF);                 60260000
    COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_PIWARR_ENDDATE,     60270000
                                  EDQBSDS_BAU.DDBSMED);                 60280000
   END;                                                                 60290000
   WHEN(SWITCH_PI_CTR) DO;                                              60300000
    COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS,BY NAME;                      60310000
    COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_PIWARR_EFFDATE,     60320000
                               EDQBSDS_PI.DDBSEFF);                     60330000
    COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_PIWARR_ENDDATE,     60340000
                               EDQBSDS_PI.DDBSMED);                     60350000
   END;                                                                 60360000
   WHEN(SWITCH_HV_CTR) DO;                                              60370000
    COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS,BY NAME;                      60380000
    COMMAREA.EDQBSDS.SRCCCMD = EDQBSDS_BAU.EDQBSDS.SRCCCMD,BY NAME;     60390000
    COMMAREA.EDQBSDS.CHSISTM = EDQBSDS_PI.CHSISTM;                      60400000
    COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_PIWARR_EFFDATE,     60410000
                                EDQBSDS_BAU.DDBSEFF);                   60420000
    COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_PIWARR_ENDDATE,     60430000
                                EDQBSDS_BAU.DDBSMED);                   60440000
   END;                                                                 60450000
   OTHERWISE DO;                                                        60460000
     COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS,BY NAME;                     60470000
     COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                           60480000
   END;                                                                 60490000
  END;                                                                  60500000
  END;                                                                  60510000
                                                                        60520000
  WHEN(SWITCH_INTERNAL|SWITCH_LEASE_RENTAL)                             60530000
   DO;                                                                  60540000
    USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                              60550000
    WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                               60560000
    SELECT;                                                             60570000
    WHEN(SWITCH_BAU_CTR) DO;                                            60580000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                   60590000
      COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_BAUWARR_EFFDATE,  60600000
                                 EDQBSDS_BAU.DDBSEFF);                  60610000
      COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_BAUWARR_ENDDATE,  60620000
                                 EDQBSDS_BAU.DDBSMED);                  60630000
    END;                                                                60640000
    WHEN(SWITCH_PI_CTR) DO;                                             60650000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS, BY NAME;                  60660000
      COMMAREA.EDQBSDS.SRCCCMD = EDQBSDS_PI.EDQBSDS.SRCCCMD,BY NAME;    60670000
      COMMAREA.EDQBSDS.CHSISTM = EDQBSDS_BAU.CHSISTM;                   60680000
      COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_BAUWARR_EFFDATE,  60690000
                                 EDQBSDS_PI.DDBSEFF);                   60700000
      COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_BAUWARR_ENDDATE,  60710000
                                 EDQBSDS_PI.DDBSMED);                   60720000
    END;                                                                60730000
    WHEN(SWITCH_HV_CTR)                                                 60740000
    DO;                                                                 60750000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                   60760000
      COMMAREA.EDQBSDS.DDBSEFF = RCBCS3M_MAX_DATE(WRK_BAUWARR_EFFDATE,  60770000
                                 EDQBSDS_BAU.DDBSEFF);                  60780000
      COMMAREA.EDQBSDS.DDBSMED = RCBCS3M_MIN_DATE(WRK_BAUWARR_ENDDATE,  60790000
                                 EDQBSDS_BAU.DDBSMED);                  60800000
    END;                                                                60810000
    OTHERWISE DO;                                                       60820000
      COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                   60830000
      COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                          60840000
    END;                                                                60850000
    END;                                                                60860000
  END;                                                                  60870000
  WHEN(SWITCH_SUPPL_CTR) DO;                                            60880000
     COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                    60890000
     COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                           60900000
     USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                             60910000
     WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                              60920000
    END;                                                                60930000
  WHEN(SWITCH_PI_CTR) DO;                                               60940000
     COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS,BY NAME;                     60950000
     COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                           60960000
     USER_EXTRA_INFO = USER_EXTRA_INFO_PI;                              60970000
     WRK_AAS_ADD = WRK_ADDRESS_NUMBER_PI;                               60980000
    END;                                                                60990000
  WHEN(SWITCH_HV_CTR) DO;                                               61000000
     COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                    61010000
     COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                           61020000
     USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                             61030000
     WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                              61040000
    END;                                                                61050000
  WHEN(SWITCH_BAU_PERCALL) DO;                                          61060000
     COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS,BY NAME;                    61070000
     COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                           61080000
     USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                             61090000
     WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                              61100000
    END;                                                                61110000
  WHEN(SWITCH_PI_PERCALL) DO;                                           61120000
     COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS,BY NAME;                     61130000
     COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                           61140000
     USER_EXTRA_INFO = USER_EXTRA_INFO_PI;                              61150000
     WRK_AAS_ADD = WRK_ADDRESS_NUMBER_PI;                               61160000
    END;                                                                61170000
  OTHERWISE DO;                                                         61180000
                                                  /* SOC CEDS00000642 */61190000
    /*EDQBSHS.CRMORET = '9';                                            61200000
    EDQBSHS.REQ.NTBLNME = 'TOS NOT FOUND'; */                           61210000
    COMMAREA.EDQBSHS.CRMORET = '9';                                     61220000
    COMMAREA.EDQBSHS.REQ.NTBLNME = 'TOS NOT FOUND';                     61230000
                                                      /* SOC RB01320  */61240000
    IF SWITCH_0211_S3 THEN                                              61250000
      DO;                                                               61260000
       COMMAREA_OLD = COMMAREA;                                         61270000
    /* COMMAREA     = ''; */                                            61280000
      END;                                                              61290000
    ELSE                                          /* EOC CEDS00000642 */61300000
    IF SWITCH_3317_S3 THEN                                              61310000
      DO;                                                               61320000
                                                  /* SOC CEDS00000642 */61330000
       COMMAREA_NEW = '';                                               61340000
       COMMAREA_NEW.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;               61350000
       COMMAREA_NEW.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;               61360000
       COMMAREA_NEW.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;                 61370000
       IF WRK_LONG_SERIAL ¬= '' THEN                       /* RC01349 */61380000
       COMMAREA_NEW.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;                 61390017
       ELSE                                            /* SOC RC01349 */61400000
          COMMAREA_NEW.EDQBSDS1.SEDQGSN =                               61410000
                 COMMAREA_NEW.EDQBSDS1.IOLCPLM ||                       61420000
                 COMMAREA_NEW.EDQBSDS1.IHSINBR ;       /* EOC RC01349 */61430000
                                                      /* SOC RC01359 */ 61440000
       IF CHECKSEQ = '' THEN                                            61450000
           DO;                                                          61460000
             IF (LENGTH(TRIM(COMMAREA_NEW.EDQBSDS1.IHSINBR)) = 7 &      61470000
                 SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,1,2) = '00') THEN 61480000
          COMMAREA_NEW.EDQBSDS1.SEDQGSN=COMMAREA_NEW.EDQBSDS1.IOLCPLM ||61490000
                     SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,3,5);         61500000
           END;                                                         61510000
                                                      /* EOC RC01359 */ 61520000
    /*  NEW_VERSION_DUMMY.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;         61530000
        NEW_VERSION_DUMMY.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;           61540000
        NEW_VERSION_DUMMY.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;         61550000
        NEW_VERSION_DUMMY.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;           61560000
        COMMAREA1.EDQBSHS1 = ' ';                                       61570000
        COMMAREA1.EDQBSHS1 = NEW_VERSION_DUMMY.EDQBSHS1;                61580000
        COMMAREA1.EDQBSDS1 = NEW_VERSION_DUMMY.EDQBSDS1; */             61590000
                                                  /* EOC CEDS00000642 */61600000
      END;                                                              61610000
                                                      /* EOC RB01320  */61620000
    EXEC CICS RETURN;                                                   61630000
  END;                                                                  61640000
 END;                                                                   61650000
 END;                                                                   61660000
 ELSE DO;                                                               61670000
 SELECT;                                                                61680000
  WHEN(SWITCH_BAU_WARR & ¬SWITCH_OOC_HB) DO;                            61690000
    COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS, BY NAME;                    61700000
    COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                            61710000
    USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                              61720000
    WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                               61730000
  END;                                                                  61740000
  WHEN(SWITCH_PI_WARR) DO;                                              61750000
    COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS, BY NAME;                     61760000
    COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                            61770000
    USER_EXTRA_INFO = USER_EXTRA_INFO_PI;                               61780000
    WRK_AAS_ADD = WRK_ADDRESS_NUMBER_PI;                                61790000
  END;                                                                  61800000
                                                  /* SOC CEDS00000632 */61810000
  /*                                                                    61820000
  WHEN(SWITCH_INTERNAL_CTR|SWITCH_LEASE_RENTAL) DO;*/ /* CEDS00000521 */61830000
  WHEN(SWITCH_INTERNAL|SWITCH_LEASE_RENTAL) DO;   /* EOC CEDS00000632 */61840000
    COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS, BY NAME;                    61850000
    COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                            61860000
    USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                              61870000
    WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                               61880000
  END;                                                                  61890000
                                                  /* SOC CEDS00000521 */61900000
  /* WHEN(SWITCH_BAU_CTR|SWITCH_INTERNAL|SWITCH_LEASE_RENTAL|           61910000
     SWITCH_BAU_PERCALL | SWITCH_OOC_HB ) DO;        */                 61920000
  WHEN(SWITCH_BAU_CTR|SWITCH_SUPPL_CTR|SWITCH_BAU_PERCALL|              61930000
       SWITCH_OOC_HB ) DO;                                              61940000
    EDQBSDS_BAU.SRCCCMD.CHSISTM = '3';                                  61950000
    COMMAREA.EDQBSDS = EDQBSDS_BAU.EDQBSDS, BY NAME;                    61960000
    COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                            61970000
    USER_EXTRA_INFO = USER_EXTRA_INFO_BAU;                              61980000
    WRK_AAS_ADD = WRK_ADDRESS_NUMBER_BAU;                               61990000
  END;                                            /* EOC CEDS00000521 */62000000
  WHEN(SWITCH_PI_CTR|SWITCH_PI_PERCALL) DO;                             62010000
    EDQBSDS_PI.SRCCCMD.CHSISTM = '3';                /* CEDS00000521 */ 62020000
    COMMAREA.EDQBSDS = EDQBSDS_PI.EDQBSDS, BY NAME;                     62030000
    COMMAREA.EDQBSDS.BASE_WARRANTY_SLC = '';                            62040000
    USER_EXTRA_INFO = USER_EXTRA_INFO_PI;                               62050000
    WRK_AAS_ADD = WRK_ADDRESS_NUMBER_PI;                                62060000
  END;                                                                  62070000
  OTHERWISE DO;                                                         62080000
                                                  /* SOC CEDS00000642 */62090000
  /*EDQBSHS.CRMORET = '9';                                              62100000
    EDQBSHS.REQ.NTBLNME = 'TOS NOT FOUND';        */                    62110000
    COMMAREA.EDQBSHS.CRMORET = '9';                                     62120000
    COMMAREA.EDQBSHS.REQ.NTBLNME = 'TOS NOT FOUND';                     62130000
                                                      /* SOC RB01320  */62140000
    IF SWITCH_0211_S3 THEN                                              62150000
      DO;                                                               62160000
       COMMAREA_OLD = COMMAREA;                                         62170000
    /* COMMAREA     = ''; */                                            62180000
      END;                                                              62190000
    ELSE                                          /* EOC CEDS00000642 */62200000
    IF SWITCH_3317_S3 THEN                                              62210000
      DO;                                                               62220000
                                                  /* SOC CEDS00000642 */62230000
       COMMAREA_NEW = '';                                               62240000
       COMMAREA_NEW.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;               62250000
       COMMAREA_NEW.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;               62260000
       COMMAREA_NEW.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;                 62270017
       IF WRK_LONG_SERIAL ¬= '' THEN                       /* RC01349 */62280000
       COMMAREA_NEW.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;                 62290000
       ELSE                                           /* SOC RC01349  */62300000
          COMMAREA_NEW.EDQBSDS1.SEDQGSN =                               62310000
                 COMMAREA_NEW.EDQBSDS1.IOLCPLM ||                       62320000
                 COMMAREA_NEW.EDQBSDS1.IHSINBR ;      /* EOC RC01349  */62330000
                                                      /* SOC RC01359 */ 62340000
       IF CHECKSEQ = '' THEN                                            62350000
          DO;                                                           62360000
              IF (LENGTH(TRIM(COMMAREA_NEW.EDQBSDS1.IHSINBR)) = 7 &     62370000
                  SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,1,2) = '00') THEN62380000
          COMMAREA_NEW.EDQBSDS1.SEDQGSN=COMMAREA_NEW.EDQBSDS1.IOLCPLM ||62390000
                     SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,3,5);         62400000
          END;                                                          62410000
                                                      /* EOC RC01359 */ 62420000
    /*  NEW_VERSION_DUMMY.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;         62430000
        NEW_VERSION_DUMMY.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;           62440000
        NEW_VERSION_DUMMY.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;         62450000
        NEW_VERSION_DUMMY.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;           62460000
        COMMAREA1.EDQBSHS1 = ' ';                                       62470000
        COMMAREA1.EDQBSHS1 = NEW_VERSION_DUMMY.EDQBSHS1;                62480000
        COMMAREA1.EDQBSDS1 = NEW_VERSION_DUMMY.EDQBSDS1;  */            62490000
                                                  /* EOC CEDS00000642 */62500000
      END;                                                              62510000
                                                      /* EOC RB01320  */62520000
    EXEC CICS RETURN;                                                   62530000
  END;                                                                  62540000
  END;                                                                  62550000
 END;                                                                   62560000
                                                  /* SOC CEDS00000528 */62570000
 /* For a BAU registered machine (even if PI warranty or contract info  62580000
    is used) foll. details must be retrieved from BAU tables            62590000
    T10-1161 & PCR PCEDSP-0021 */                                       62600000
                                                                        62610000
 IF EDQBSDS_BAU.IHSITOS.CSLMTYP ¬= '' THEN DO;                          62620000
    COMMAREA.EDQBSDS.CHSIISC = TB_RCBV110.STATUS;                       62630000
    COMMAREA.EDQBSDS.CSLMMOD,                                           62640000
    COMMAREA.EDQBSDS.BUILT_TO_MODEL_NR = TB_RCBV300.MODEL_NUMBER;       62650000
    COMMAREA.EDQBSDS.ISLMCPU         = TB_RCBV380.CPU_TYPE;             62660000
    COMMAREA.EDQBSDS.ICUOSYN         = TB_RCBV380.DP_SYSTEM_NUMBER;     62670000
    STRING(COMMAREA.EDQBSDS.GMKTMBO) = TB_RCBV380.INSTALLING_OU;        62680000
    COMMAREA.EDQBSDS.CAGRTYP         = TB_RCBV380.TYPE_OF_AGREEMENT;    62690000
    COMMAREA.EDQBSDS.ICUOORN = TB_RCBV260.ORDER_REF_NUMBER;             62700000
    COMMAREA.EDQBSDS.CUSCODE.SEDQCSX = '2' || TB_RCBV170.OU_CODE;       62710000
    COMMAREA.EDQBSDS.SRCCCMD.IODPDBU.CODPDIV = '2';                     62720000
                                                                        62730000
    COMMAREA.EDQBSDS.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV170.OU_CODE;      62740000
                                                                        62750000
    DATA_ORIGIN2 = '0';                              /* CEDS00000538 */ 62760000
    COMMAREA.EDQBSDS.CUSCODE.ICUSHWU = EDQBSDS_BAU.CUSCODE.ICUSHWU;     62770000
    COMMAREA.EDQBSDS.SRCCCMD.ICUSHWU = EDQBSDS_BAU.SRCCCMD.ICUSHWU;     62780000
    COMMAREA.EDQBSDS.CUSCODE.ICUSANO = EDQBSDS_BAU.CUSCODE.ICUSANO;     62790000
    COMMAREA.EDQBSDS.NCUSABB = EDQBSDS_BAU.NCUSABB;                     62800000
    COMMAREA.EDQBSDS.CCUSTOC = EDQBSDS_BAU.CCUSTOC;                     62810000
    COMMAREA.EDQBSDS.ICUSGZC = EDQBSDS_BAU.ICUSGZC;                     62820000
    COMMAREA.EDQBSDS.FCUSEMB = EDQBSDS_BAU.FCUSEMB;                     62830000
    COMMAREA.EDQBSDS.NCUSSTR = EDQBSDS_BAU.NCUSSTR;                     62840000
    COMMAREA.EDQBSDS.ICUSCTY = EDQBSDS_BAU.ICUSCTY;                     62850000
    COMMAREA.EDQBSDS.SEDQTEL = EDQBSDS_BAU.SEDQTEL;                     62860000
    END;                                                                62870000
                                                  /* EOC CEDS00000528 */62880000
                                                      /* SOC RC01313*/  62890000
 /* SET CUSTOMER NUMBER AND OU_CODE WHEN PI MACHINE REGISTERED IN BAU*/ 62900000
 IF EDQBSDS_BAU.IHSITOS.CSLMTYP ¬= '' &                                 62910000
    EDQBSDS_PI.IHSITOS.CSLMTYP  ¬= '' THEN                              62920000
 DO;                                                                    62930000
    COMMAREA.EDQBSDS.CUSCODE.SEDQCSX = EDQBSDS_PI.CUSCODE.SEDQCSX;      62940000
                                                                        62950000
    COMMAREA.EDQBSDS.SRCCCMD.IODPDBU.CODPBUC =                          62960000
                    EDQBSDS_PI.SRCCCMD.IODPDBU.CODPBUC;                 62970000
    COMMAREA.EDQBSDS.CUSCODE.ICUSHWU = EDQBSDS_PI.CUSCODE.ICUSHWU;      62980000
    COMMAREA.EDQBSDS.SRCCCMD.ICUSHWU = EDQBSDS_PI.SRCCCMD.ICUSHWU;      62990000
 END;                                                 /* EOC RC01313*/  63000000
                                                      /* SOC RC01326*/  63010000
  EDQBSDS_PI.SERV_EXTENSION(*)  = '';                                   63020000
  EDQBSDS_BAU.SERV_EXTENSION(*) = '';                                   63030000
  BAU_SERV_EXTENSION_CTR(*)     = '';                                   63040000
  PI_SERV_EXTENSION_CTR(*)      = '';                                   63050000
  TEMP_SERV_EXTENSION(*)        = '';                                   63060000
                                                      /* EOC RC01326*/  63070000
 END RCBCS3M_CHECK_PRIORITY;                                            63080000
1/*********************************************************************/63090000
 /*                                                                   */63100000
 /* MODULE NAME      : RCBCS3M_SERV_EXTN                              */63110000
 /*                                                                   */63120000
 /* DESCRIPTION      :                                                */63130000
 /*                                                                   */63140000
 /*                                                                   */63150000
 /*********************************************************************/63160000
 RCBCS3M_SERV_EXTN: PROC;                                               63170000
                                                                        63180000
                                               /* SOC CEDS00000718 */   63190000
 /* IF SWITCH_BAU_WARR THEN */                        /* SOC RC01326 */ 63200000
 /* DO; */                                        /* EOC RC01326 */     63210000
                                               /* EOC CEDS00000718 */   63220000
 IF ¬OUT_OF_COUNTRY THEN                          /* SOC CEDS00000596 */63230000
    CALL RCBCS3M_READ_BAU_SERV_EXTN;                                    63240000
                                               /* SOC CEDS00000718 */   63250000
  /* END; */                                      /* SOC RC01326 */     63260000
                                               /* EOC CEDS00000718 */   63270000
  J = I;                                               /* EOC RC01326 */63280000
 IF SWITCH_PI_WARR THEN                                                 63290000
    CALL RCBCS3M_READ_PI_SERV_EXTN;               /* EOC CEDS00000596 */63300000
                                                                        63310000
                                                       /* SOC RC01326 */63320000
 COMMAREA.EDQBSDS.SERV_EXTENSION(*) = TEMP_SERV_EXTENSION;              63330000
 /********* THIS PART OF CODE IS COMMENTED AS PART OF PCR 421 *********/63340000
 /* DCL K FIXED BIN(31) INIT(01);*/                                     63350000
                                                                        63360000
 /* SELECT; */                                                          63370000
 /*  WHEN(CNT_BAU_SE ¬= 0 & CNT_PI_SE ¬= 0) DO;*/                       63380000
 /* IF CNT_BAU_SE >= 5 THEN                            CEDS00000530 */  63390000
                                                      /* SOC RB01320 */ 63400000
  /*COMMAREA.SERV_EXTENSION(*) = EDQBSDS_BAU.SERV_EXTENSION(*);*/       63410000
  /*COMMAREA.EDQBSDS.SERV_EXTENSION(*) = EDQBSDS_BAU.SERV_EXTENSION(*); 63420000
  */                                                  /* EOC RB01320 */ 63430000
 /*ELSE DO;                                            CEDS00000530 */  63440000
 /* IF CNT_BAU_SE < 5 THEN*/                         /*CEDS00000530 */  63450000
 /*  DO WHILE((CNT_BAU_SE + K) <= 6 & EDQBSDS_PI.SERV_EXTENSION(K)¬='');63460000
      IF K <= (5 - CNT_BAU_SE) THEN */                                  63470000
                                                      /* SOC RB01320 */ 63480000
      /* COMMAREA.SERV_EXTENSION(CNT_BAU_SE+K) = */                     63490000
 /*      COMMAREA.EDQBSDS.SERV_EXTENSION(CNT_BAU_SE+K) = */             63500000
                                                      /* EOC RB01320 */ 63510000
 /*           EDQBSDS_PI.SERV_EXTENSION(K); */                          63520000
 /*   ELSE */                                                           63530000
                                                      /* SOC RB01320 */ 63540000
      /* COMMAREA.SERV_EXTENSION(5) = 'ME>'; */                         63550000
 /*      COMMAREA.EDQBSDS.SERV_EXTENSION(5) = 'ME>'; */                 63560000
                                                      /* EOC RB01320 */ 63570000
 /*  K = K + 1;                                                         63580000
    END; */                                                             63590000
 /*END;                                                CEDS00000530 */  63600000
 /*END;                                                                 63610000
  WHEN(CNT_BAU_SE ¬= 0) */                                              63620000
  /*COMMAREA.SERV_EXTENSION(*) = EDQBSDS_BAU.SERV_EXTENSION(*);*/       63630000
                                                      /* SOC RB01320 */ 63640000
  /*COMMAREA.EDQBSDS.SERV_EXTENSION(*) = EDQBSDS_BAU.SERV_EXTENSION(*); 63650000
  */                                                  /* EOC RB01320 */ 63660000
  /*WHEN(CNT_PI_SE ¬= 0)*/                                              63670000
                                                      /* SOC RB01320 */ 63680000
  /*COMMAREA.SERV_EXTENSION(*) = EDQBSDS_PI.SERV_EXTENSION(*);*/        63690000
  /*COMMAREA.EDQBSDS.SERV_EXTENSION(*) = EDQBSDS_PI.SERV_EXTENSION(*);  63700000
  */                                                  /* EOC RB01320 */ 63710000
  /*OTHERWISE */                                                        63720000
                                                      /* SOC RB01320 */ 63730000
  /*COMMAREA.SERV_EXTENSION(*) = ' ';*/                                 63740000
  /*  COMMAREA.EDQBSDS.SERV_EXTENSION(*) = ' '; */                      63750000
                                                      /* EOC RB01320 */ 63760000
 /*END;*/                                                               63770000
 /*********************************************************************/63780000
                                                       /* EOC RC01326 */63790000
                                                                        63800000
 END RCBCS3M_SERV_EXTN;                                                 63810000
1/*********************************************************************/63820000
 /*                                                                   */63830000
 /* MODULE NAME      : RCBCS3M_READ_CONTRACT                          */63840000
 /*                                                                   */63850000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0030    */63860000
 /*                                                                   */63870000
 /*                                                                   */63880000
 /*********************************************************************/63890000
0RCBCS3M_READ_CONTRACT : PROC;                                          63900000
                                                                        63910000
 TB_RCBV030 = '';                                                       63920000
                                                                        63930000
0EXEC SQL                                                               63940000
      SELECT  TYPE_OF_CONTRACT                                          63950000
        INTO :TB_RCBV030.TYPE_OF_CONTRACT  :WRK_INDNULL                 63960000
        FROM  RCBV0030_CONTRACT  T030                                   63970000
       WHERE  T030.COUNTRY_NUMBER  = :REFCTRY                           63980000
         AND  T030.CONTRACT_NUMBER = :TB_RCBV240.CONTRACT_NUMBER        63990000
      WITH UR;                                                          64000000
                                                                        64010000
 SELECT(SQLCA.SQLCODE);                                                 64020000
   WHEN(0)                                                              64030000
    DO;                                                   /* RC01353 */ 64040000
     EDQBSDS_BAU.SRCCCMD.IAGRTCN = TB_RCBV030.TYPE_OF_CONTRACT;         64050000
                                                      /* SOC RC01353 */ 64060000
      IF EDQBSDS_BAU.SRCCCMD.IAGRTCN = 'SERVINT' THEN                   64070000
         EDQBSDS_BAU.SRCCCMD.SSRCIND = 'I';                             64080000
    END;                                                                64090000
                                                      /* EOC RC01353 */ 64100000
   WHEN(100);                                                           64110000
   OTHERWISE                                                            64120000
     DO;                                                                64130000
     /*RCBCQES.MESSAGE_NUMBER = 'C246';*/             /* SOC RC01326 */ 64140000
       RCBCQES.MESSAGE_NUMBER = 'C241';               /* EOC RC01326 */ 64150000
       WRK_SQLCODE = SQLCA.SQLCODE;                                     64160000
       WRK_TABLE = 'RCBT0030_CONTRACT';                                 64170000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 64180000
     END;                                                               64190000
 END;                                                                   64200000
                                                                        64210000
 END RCBCS3M_READ_CONTRACT;                                             64220000
                                                                        64230000
1/*********************************************************************/64240000
 /*                                                                   */64250000
 /* MODULE NAME      : RCBCS3M_READ_HV_CTR                            */64260000
 /*                                                                   */64270000
 /* DESCRIPTION      : EXTEND LOOKUP TO READ THE HIGH VOLUME CONTRACT */64280000
 /*                    DATA FROM RCBT0240 FOR THE REFERENCED ROW      */64290000
 /*                                                                   */64300000
 /*********************************************************************/64310000
0RCBCS3M_READ_HV_CTR : PROC;                                            64320000
                                                                        64330000
 SWITCH_HV_CTR       = FALSE;                         /* CEDS00000522 */64340000
 WRK_CUSTOMER_NUMBER = '';                                              64350000
 WRK_MODEL_NUMBER    = '';                                              64360000
 WRK_SEQUENCE_NUMBER = '';                                              64370000
                                                                        64380000
                                                  /* SOC CEDS00000522 */64390000
 /* IF TB_RCBV051.SOURCE_INDICATOR = 'O' THEN */                        64400000
 IF TB_RCBV051.SOURCE_INDICATOR = 'O' &                                 64410000
   (DATE10 >= TB_RCBV051.INSTALL_DATE &                                 64420000
    DATE10 <= TB_RCBV051.WARRANTY_EXP_DATE) THEN  /* EOC CEDS00000522 */64430000
   DO;                                                                  64440000
   /*WRK_CUSTOMER_NUMBER = EDQBSDS_PI.CUSCODE.ICUSHWU;   CEDS00000522 */64450000
     WRK_CUSTOMER_NUMBER = TB_RCBV051.CUSTOMER_NUMBER;/* CEDS00000522 */64460000
     WRK_MODEL_NUMBER    = EDQBSDS_PI.CSLMMOD;                          64470000
     SWITCH_HV_CTR       = TRUE;                                        64480000
     IF WRK_MODEL_NUMBER = '' THEN                                      64490000
       WRK_MODEL_NUMBER = EDQBSDS_BAU.CSLMMOD;                          64500000
     IF WRK_MODEL_NUMBER = '' THEN                                      64510000
       SWITCH_HV_CTR = FALSE;                                           64520000
   END;                                                                 64530000
 ELSE                                                                   64540000
   DO;                                                                  64550000
   WRK_CUSTOMER_NUMBER = EDQBSDS_BAU.CUSCODE.ICUSHWU;                   64560000
   WRK_MODEL_NUMBER    = EDQBSDS_BAU.CSLMMOD;                           64570000
   SWITCH_HV_CTR       = TRUE;                                          64580000
   IF WRK_CUSTOMER_NUMBER = '' | WRK_MODEL_NUMBER = '' THEN             64590000
      SWITCH_HV_CTR = FALSE;                                            64600000
   END;                                                                 64610000
                                                                        64620000
 IF SWITCH_HV_CTR = TRUE THEN                                           64630000
 DO;                                                                    64640000
    EXEC SQL                                                            64650000
       SELECT T190.SEQUENCE_NUMBER                                      64660000
       INTO  :WRK_SEQUENCE_NUMBER                                       64670000
       FROM   RCBV0190_HW_CUST T190,                                    64680000
              RCBV0300_HW_REAL T300                                     64690000
       WHERE  T190.COUNTRY_NUMBER   = :REFCTRY                          64700000
         AND  T190.PRODUCT_TYPE     = :REQTYPE                          64710000
         AND  T190.ORIGIN           = 'HV'                              64720000
         AND  T190.CUSTOMER_NUMBER  = :WRK_CUSTOMER_NUMBER              64730000
         AND  T190.TYPE_OF_RELATION = 'U'                               64740000
         AND :DATE10 BETWEEN T190.EFFECTIVE_DATE                        64750000
                         AND T190.END_DATE                              64760000
         AND  T300.COUNTRY_NUMBER   = T190.COUNTRY_NUMBER               64770000
         AND  T300.PRODUCT_TYPE     = T190.PRODUCT_TYPE                 64780000
         AND  T300.ORIGIN           = 'HV'                              64790000
         AND  T300.MODEL_NUMBER     = :WRK_MODEL_NUMBER                 64800000
         AND  T300.SEQUENCE_NUMBER  = T190.SEQUENCE_NUMBER              64810000
         AND :DATE10 BETWEEN T300.EFFECTIVE_DATE                        64820000
                         AND T300.END_DATE                              64830000
         ;                                                              64840000
                                                                        64850000
       SELECT (SQLCA.SQLCODE);                                          64860000
         WHEN (0)                                                       64870000
           SWITCH_HV_CTR = TRUE;                                        64880000
         WHEN (100)                                                     64890000
           SWITCH_HV_CTR = FALSE;                                       64900000
         OTHERWISE                                                      64910000
           DO;                                                          64920000
             RCBCQES.MESSAGE_NUMBER = 'C247';                           64930000
             WRK_SQLCODE = SQLCA.SQLCODE;                               64940000
             WRK_TABLE = 'T190 & T300';                                 64950000
             CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);           64960000
           END;                                                         64970000
       END;                                                             64980000
 END;                                                                   64990000
                                 /* FETCH HIGH VOLUME CONTRACT DATA */  65000000
 IF SWITCH_HV_CTR = TRUE THEN    /* FOR THE NEW SEQUENCE NUMBER     */  65010000
   DO;                           /* WITH ORIGIN = 'HV'              */  65020000
      EXEC SQL                                                          65030000
           SELECT T240.COUNTRY_NUMBER    ,                              65040000
                  T240.PRODUCT_TYPE      ,                              65050000
                  T240.ORIGIN            ,                              65060000
                  T240.SEQUENCE_NUMBER   ,                              65070000
                  T240.HVP_QUANTITY      ,                              65080000
                  T240.CONTRACT_NUMBER   ,                              65090000
                  T240.SERVICE_START_DATE,                              65100000
                  T240.SERVICE_STOP_DATE ,                              65110000
                  T240.SUPPL_CTR_NUMBER  ,                              65120000
                  T240.SERVICE_MODULE_1  ,                              65130000
                  T240.SERVICE_MODULE_2  ,                              65140000
                  T240.SERVICE_MODULE_3  ,                              65150000
                  T240.SERVICE_MODULE_4  ,                              65160000
                  T240.SERVICE_MODULE_5  ,                              65170000
                  T240.AGREEMENT_TYPE    ,                              65180000
                  T240.AGREEMENT_OPTION  ,                              65190000
                  T240.SPECIAL_OPTION    ,                              65200000
                  T240.AMENDM_COMB_CODE  ,                              65210000
                  T240.COVERAGE_START_1  ,                              65220000
                  T240.COVERAGE_END_1    ,                              65230000
                  T240.COVERAGE_START_2  ,                              65240000
                  T240.COVERAGE_END_2    ,                              65250000
                  T240.COVERAGE_START_3  ,                              65260000
                  T240.COVERAGE_END_3    ,                              65270000
                  T240.COVERAGE_START_4  ,                              65280000
                  T240.COVERAGE_END_4    ,                              65290000
                  T240.COVERAGE_START_5  ,                              65300000
                  T240.COVERAGE_END_5    ,                              65310000
                  T240.COVERAGE_START_6  ,                              65320000
                  T240.COVERAGE_END_6    ,                              65330000
                  T240.COVERAGE_START_7  ,                              65340000
                  T240.COVERAGE_END_7    ,                              65350000
                  T240.SERVICE_TYPE      ,                              65360000
                  T240.SERVICE_LVL_CODE  ,                              65370000
                  T240.SOURCE_INDICATOR  ,                              65380000
                  T240.LAST_CHANGE_DATE  ,                              65390000
                  T240.EFFECTIVE_DATE    ,                              65400000
                  T240.END_DATE          ,                              65410000
                  T220.TYPE_OF_MAINT     ,                              65420000
                  T220.SOURCE_INDICATOR                                 65430000
            INTO :TB_RCBV240                                            65440000
                 :TB_RCBV240_I.INDNULL,                                 65450000
                 :WRK_TYPE_OF_MAINT :WRK_INDNULL,                       65460000
                 :WRK_SRC_IND :WRK_INDNULL                              65470000
           FROM   RCBV0240_SERV_CTR   T240,                             65480000
                  RCBV0220_SUPPL_CTR  T220                              65490000
           WHERE  T240.COUNTRY_NUMBER  = :REFCTRY                       65500000
             AND  T240.PRODUCT_TYPE    = :REQTYPE                       65510000
             AND  T240.ORIGIN          = 'HV'                           65520000
             AND  T240.SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER           65530000
             AND :DATE10         BETWEEN T240.EFFECTIVE_DATE            65540000
                                     AND T240.END_DATE                  65550000
             AND  T220.COUNTRY_NUMBER  = T240.COUNTRY_NUMBER            65560000
             AND  T220.PRODUCT_TYPE    = T240.PRODUCT_TYPE              65570000
             AND  T220.ORIGIN          = T240.ORIGIN                    65580000
             AND  T220.SEQUENCE_NUMBER = T240.SEQUENCE_NUMBER           65590000
             AND :DATE10         BETWEEN T220.EFFECTIVE_DATE            65600000
                                     AND T220.END_DATE                  65610000
           WITH UR;                                                     65620000
                                                                        65630000
      SELECT(SQLCA.SQLCODE);                                            65640000
        WHEN(0)                                                         65650000
          DO;                                                           65660000
            IF ((WRK_TYPE_OF_MAINT = '2' |                              65670000
                 WRK_TYPE_OF_MAINT = 'A' |                              65680000
                 WRK_TYPE_OF_MAINT = 'B' |                              65690000
                 WRK_TYPE_OF_MAINT = 'E'  ) &                           65700000
                WRK_SRC_IND='C') THEN                                   65710000
             DO;                                                        65720000
        /*     CALL RCBCS3M_CHECK_INTERNAL;       /* SOC CEDS00000508 */65730000
                                                                        65740000
               CALL RCBCS3M_CHECK_INTERNAL('HV',WRK_SEQUENCE_NUMBER);   65750000
                                                  /* EOC CEDS00000508 */65760000
               IF SWITCH_INTERNAL_CTR = FALSE THEN                      65770000
                 EDQBSDS_BAU.SRCCCMD.CHSISTM = WRK_TYPE_OF_MAINT;       65780000
             END;                                                       65790000
            CALL RCBCS3M_MOVE_SERV_CTR;                                 65800000
          END;                                                          65810000
        WHEN(100);                                                      65820000
        OTHERWISE                                                       65830000
          DO;                                                           65840000
            RCBCQES.MESSAGE_NUMBER = 'C248';                            65850000
            WRK_SQLCODE = SQLCA.SQLCODE;                                65860000
            WRK_TABLE = 'RCBT0240_SERV_CTR';                            65870000
            CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);            65880000
          END;                                                          65890000
      END;                                                              65900000
   END;                                                                 65910000
 END RCBCS3M_READ_HV_CTR;                                               65920000
                                                                        65930000
1/*********************************************************************/65940000
 /*                                                                   */65950000
 /* MODULE NAME      : RCBCS3M_CHECK_LENOVO                           */65960000
 /*                                                                   */65970000
 /* DESCRIPTION      : CHECK THAT THE RETRIEVED PI DATA IS EITHER AN  */65980000
 /*                    IBM MACHINE OR A LENOVO MACHINE AND SET THE    */65990000
 /*                    SOURCE INDICATOR ACCORDINGLY.                  */66000000
 /*                                                                   */66010000
 /*                    THIS USES THE PLINCL RCBLENO WHICH CALCULATES  */66020000
 /*                    THE LENOVO TRANSACTION INDICATOR (LTI).        */66030000
 /*                    - A VALUE OF BLANK MEANS IT IS NOT LENOVO      */66040000
 /*                      THERFORE LEAVE THE SOURCE INDICATOR AS IS    */66050000
 /*                    - A VALUE OF '1' MEANS LENOVO BASE WARRANTY    */66060000
 /*                      CHANGE THE SOURCE INDICATOR TO 'Y'           */66070000
 /*                    - A VALUE OF '2' MEANS LENOVE SERVICE OFFERING */66080000
 /*                      CHANGE THE SOURCE INDICATOR TO 'Z'           */66090000
 /*                                                                   */66100000
 /*********************************************************************/66110000
0RCBCS3M_CHECK_LENOVO : PROC;                                           66120000
                                                                        66130000
 WRK_LENOVO_TI = CALCULATE_LTI (TB_RCBV051.WARRANTY_EXP_DATE,           66140000
                                TB_RCBV241.AUTHORISATION_CODE,          66150000
                                TB_RCBV241.EFFECTIVE_DATE,              66160000
                                TB_RCBV241.END_DATE,                    66170000
                                DATE10,                                 66180000
                                TB_RCBV051.WARRANTY_LIABILITY);         66190000
                                                                        66200000
                                                                        66210000
 SELECT(WRK_LENOVO_TI);                                                 66220000
   WHEN(' ');                                                           66230000
   WHEN('1')                                                            66240000
     EDQBSDS_PI.SRCCCMD.SSRCIND = 'Y';                                  66250000
   WHEN('2')                                                            66260000
     EDQBSDS_PI.SRCCCMD.SSRCIND = 'Z';                                  66270000
   OTHERWISE;                                                           66280000
 END;                                                                   66290000
                                                                        66300000
 END RCBCS3M_CHECK_LENOVO;                                              66310000
 %INCLUDE RCBLENO;                                                      66320000
1/********************************************************************/ 66330000
 /*      F I N A L    P R O C E S S I N G                            */ 66340000
 /********************************************************************/ 66350000
0RCBCS3M_FINALISATION : PROC;                                           66360000
0SELECT (RESPONSE);                                                     66370000
    WHEN (DFHRESP(NORMAL))                                              66380000
    DO;                                                                 66390000
                                                 /* SOC CEDS00000642 */ 66400000
    /* EDQBSHS.CRMORET = '0';       */                                  66410000
       COMMAREA.EDQBSHS.CRMORET = '0';                                  66420000
                                                 /* EOC CEDS00000642 */ 66430000
    END;                                                                66440000
    WHEN (DFHRESP(INVREQ))                                              66450000
    DO;                                                                 66460000
                                                 /* SOC CEDS00000642 */ 66470000
    /* EDQBSHS.CRMORET = '3';       */                                  66480000
       COMMAREA.EDQBSHS.CRMORET = '3';                                  66490000
                                                 /* EOC CEDS00000642 */ 66500000
       RCBCQES.MESSAGE_NUMBER = 'C206';                                 66510000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 66520000
    END;                                                                66530000
    OTHERWISE                                                           66540000
    DO;                                                                 66550000
                                                 /* SOC CEDS00000642 */ 66560000
    /* EDQBSHS.CRMORET = '3';                    */                     66570000
       COMMAREA.EDQBSHS.CRMORET = '3';                                  66580000
                                                 /* EOC CEDS00000642 */ 66590000
       RCBCQES.MESSAGE_NUMBER = 'C207';                                 66600000
       CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 66610000
    END;                                                                66620000
 END;                                                                   66630000
 IF SWITCH_0211_S3 THEN                          /* SOC CEDS00000642 */ 66640000
   DO;                                                                  66650000
    COMMAREA_OLD = COMMAREA;                                            66660000
   END;                                                                 66670000
 ELSE                                            /* EOC CEDS00000642 */ 66680000
 IF SWITCH_3317_S3 THEN                              /* SOC RB01320 */  66690000
   DO;                                                                  66700000
                                                 /* SOC CEDS00000642 */ 66710000
    COMMAREA_NEW = '';                                                  66720000
    COMMAREA_NEW.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;                  66730000
    COMMAREA_NEW.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;                  66740000
    COMMAREA_NEW.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;                    66750000
    IF WRK_LONG_SERIAL ¬= '' THEN                          /* RC01349 */66760000
    COMMAREA_NEW.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;                    66770000
      ELSE                                             /* SOC RC01349 */66780000
         COMMAREA_NEW.EDQBSDS1.SEDQGSN =                                66790000
                COMMAREA_NEW.EDQBSDS1.IOLCPLM ||                        66800000
                COMMAREA_NEW.EDQBSDS1.IHSINBR ;        /* EOC RC01349 */66810000
                                                      /* SOC RC01359 */ 66820000
    IF CHECKSEQ = '' THEN                                               66830000
         DO;                                                            66840000
            IF (LENGTH(TRIM(COMMAREA_NEW.EDQBSDS1.IHSINBR)) = 7 &       66850000
            SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,1,2) = '00') THEN      66860000
          COMMAREA_NEW.EDQBSDS1.SEDQGSN=COMMAREA_NEW.EDQBSDS1.IOLCPLM ||66870000
                     SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,3,5);         66880000
         END;                                                           66890000
                                                      /* EOC RC01359 */ 66900000
 /*  NEW_VERSION_DUMMY.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;            66910000
     NEW_VERSION_DUMMY.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;              66920000
     NEW_VERSION_DUMMY.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;            66930000
     NEW_VERSION_DUMMY.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;              66940000
     COMMAREA1.EDQBSHS1 = ' ';                                          66950000
     COMMAREA1.EDQBSHS1 = NEW_VERSION_DUMMY.EDQBSHS1;                   66960000
     COMMAREA1.EDQBSDS1 = NEW_VERSION_DUMMY.EDQBSDS1; */                66970000
                                                 /* EOC CEDS00000642 */ 66980000
   END;                                               /* EOC RB01320  */66990000
0EXEC CICS RETURN                                                       67000000
    RESP(RESPONSE);                                                     67010000
0END RCBCS3M_FINALISATION;                                              67020000
1/*********************************************************************/67030000
 /*                                                                   */67040000
 /* MODULE NAME      :  R012_TRANS_TIME                               */67050000
 /*                                                                   */67060000
 /* DESCRIPTION      :  TRANSLATE DB2 TIME FORMAT TO EXTRACT FILE     */67070000
 /*                     TIME FORMAT                                   */67080000
 /*                                                                   */67090000
 /*********************************************************************/67100000
 R012_TRANS_TIME: PROC (DB2_TIME_IN)                                    67110000
                  RETURNS(FIXED DEC(3,0));                              67120000
                                                                        67130000
 DCL DB2_TIME_IN         CHAR(08);                                      67140000
 DCL EXTRACT_TIME_OUT    FIXED DEC(3,0);                                67150000
 DCL 1 TIME_IN           BASED(ADDR(DB2_TIME_IN)),                      67160000
      3 HOURS            CHAR(02),                                      67170000
      3 POINT            CHAR(01),                                      67180000
      3 MINUTES          PIC'99';                                       67190000
 DCL TIME_OUT_CHAR       CHAR(03);                                      67200000
 DCL PIC_TIME_OUT_CHAR   PIC'999'  BASED(ADDR(TIME_OUT_CHAR));          67210000
 DCL CALC_HOUR_PART      PIC'99V9';                                     67220000
 DCL HOUR_PART           PIC'999';                                      67230000
                                                                        67240000
                              /* TRANSLATE                           */ 67250000
 TIME_OUT_CHAR = '';                                                    67260000
                                                                        67270000
 IF VERIFY(DB2_TIME_IN,'0123456789.') ¬= 0                              67280000
 THEN EXTRACT_TIME_OUT = 0;                                             67290000
 ELSE DO;                                                               67300000
                                                                        67310000
   SUBSTR(TIME_OUT_CHAR,1,2) = TIME_IN.HOURS;                           67320000
   CALC_HOUR_PART            = (TIME_IN.MINUTES / 6);                   67330000
   HOUR_PART                 = ROUND(CALC_HOUR_PART,0);                 67340000
   PIC_TIME_OUT_CHAR         = PIC_TIME_OUT_CHAR + HOUR_PART;           67350000
   EXTRACT_TIME_OUT          = PIC_TIME_OUT_CHAR;                       67360000
                                                                        67370000
 END;                                                                   67380000
                                                                        67390000
 RETURN(EXTRACT_TIME_OUT);                                              67400000
                                                                        67410000
 END R012_TRANS_TIME;                                                   67420000
1/*********************************************************************/67430000
 /*                                                                   */67440000
 /* MODULE NAME      :  RCBCS3M_DATE_CALC                             */67450000
 /*                                                                   */67460000
 /* DESCRIPTION      : CALCULATE WARRANTY EXPIRE DATE                 */67470000
 /*                                                                   */67480000
 /*********************************************************************/67490000
 RCBCS3M_DATE_CALC: PROC (WRK_IN_DATE,                                  67500000
                          CALC_VALUE)                                   67510000
                          RETURNS(CHAR(10));                            67520000
 DCL WRK_IN_DATE         CHAR(10);                                      67530000
 DCL WRK_OUT_DATE        CHAR(10);                                      67540000
 DCL CALC_VALUE          FIXED BIN (31);                                67550000
                                                                        67560000
 IF WRK_IN_DATE = '9999-12-31'                                          67570000
 THEN DO;                                                               67580000
   RETURN(WRK_IN_DATE);                                                 67590000
   END;                                                                 67600000
 ELSE DO;                                                               67610000
        DATE_AREA                = '';                                  67620000
        DATE_AREA.WD_IN_FORMAT   = 'ISO';                               67630000
        DATE_AREA.WD_OUT_FORMAT  = 'ISO';                               67640000
        DATE_AREA.WD_FUNCTION    = 'C';                                 67650000
        DATE_AREA.WD_PERIOD_TYPE = 'D';                                 67660000
        DATE_AREA.WD_PERIOD      = CALC_VALUE;                          67670000
        DATE_AREA.WD_IN_DATE     = WRK_IN_DATE;                         67680000
        CALL RCB004N (ADDR(DATE_AREA));                                 67690000
        IF DATE_AREA.WD_STATUS ¬= ''                                    67700000
        THEN                                                            67710000
          DO;                                                           67720000
        /*EDQBSHS.CRMORET = '4';                     SOC CEDS00000642 */67730000
          COMMAREA.EDQBSHS.CRMORET = '4';         /* EOC CEDS00000642 */67740000
          RCBCQES.MESSAGE_NUMBER = 'C259';                              67750000
          WRK_TABLE = 'RCB004N';                                        67760000
          CALL RCBCS3M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              67770000
          END;                                                          67780000
        WRK_OUT_DATE = DATE_AREA.WD_OUT_DATE;                           67790000
        RETURN(WRK_OUT_DATE);                                           67800000
      END;                                                              67810000
 END RCBCS3M_DATE_CALC;                                                 67820000
1/*********************************************************************/67830000
 /*                                                                   */67840000
 /* MODULE NAME      :  RCBCS3M_MIN_DATE                              */67850000
 /*                                                                   */67860000
 /* DESCRIPTION      :  FIND MINIMUM OF TWO DATES                     */67870000
 /*                                                                   */67880000
 /*********************************************************************/67890000
 RCBCS3M_MIN_DATE:     PROC (FIRST_IN_DATE,                             67900000
                            SECOND_IN_DATE)                             67910000
                       RETURNS (CHAR(08));                              67920000
                                                                        67930000
 DCL FIRST_IN_DATE   CHAR (08);                                         67940000
 DCL SECOND_IN_DATE  CHAR (08);                                         67950000
 DCL OUT_DATE        CHAR (08);                                         67960000
                                                                        67970000
 OUT_DATE = FIRST_IN_DATE;                                              67980000
                                                                        67990000
 IF OUT_DATE > SECOND_IN_DATE                                           68000000
 THEN                                                                   68010000
   DO;                                                                  68020000
     OUT_DATE = SECOND_IN_DATE;                                         68030000
   END;                                                                 68040000
                                                                        68050000
 RETURN(OUT_DATE);                                                      68060000
 END RCBCS3M_MIN_DATE;                                                  68070000
1/*********************************************************************/68080000
 /*                                                                   */68090000
 /* MODULE NAME      :  RCBCS3M_MAX_DATE                              */68100000
 /*                                                                   */68110000
 /* DESCRIPTION      :  FIND MAXIMUM OF TWO DATES                     */68120000
 /*                                                                   */68130000
 /*********************************************************************/68140000
 RCBCS3M_MAX_DATE:     PROC (FIRST_IN_DATE,                             68150000
                             SECOND_IN_DATE)                            68160000
                       RETURNS (CHAR(08));                              68170000
                                                                        68180000
 DCL FIRST_IN_DATE   CHAR (08);                                         68190000
 DCL SECOND_IN_DATE  CHAR (08);                                         68200000
 DCL OUT_DATE        CHAR (08);                                         68210000
                                                                        68220000
 OUT_DATE = FIRST_IN_DATE;                                              68230000
                                                                        68240000
 IF OUT_DATE < SECOND_IN_DATE                                           68250000
 THEN                                                                   68260000
   DO;                                                                  68270000
     OUT_DATE = SECOND_IN_DATE;                                         68280000
   END;                                                                 68290000
                                                                        68300000
 RETURN(OUT_DATE);                                                      68310000
 END RCBCS3M_MAX_DATE;                                                  68320000
1/********************************************************************/ 68330000
 /*      E R R O R   L O G G I N G                                   */ 68340000
 /********************************************************************/ 68350000
0RCBCS3M_LOG_ERROR : PROC(ERR_SQLCODE,ERR_TABLE);                       68360000
                                                                        68370000
 DCL ERR_TABLE   CHAR(18);                                              68380000
 DCL ERR_SQLCODE FIXED BIN(31);                                         68390000
                                                                        68400000
 SELECT(ERR_SQLCODE);                                                   68410000
    WHEN (0);                                                           68420000
    WHEN (100)                                                          68430000
    DO;                                          /* SOC CEDS00000642 */ 68440000
    /* EDQBSHS.REQ.CRMORET = '9'; */                                    68450000
       COMMAREA.EDQBSHS.REQ.CRMORET = '9';                              68460000
    END;                                         /* EOC CEDS00000642 */ 68470000
    WHEN (-923)                                                         68480000
    DO;                                          /* SOC CEDS00000642 */ 68490000
    /* EDQBSHS.REQ.CRMORET = '8'; */                                    68500000
       COMMAREA.EDQBSHS.REQ.CRMORET = '8';                              68510000
    END;                                         /* EOC CEDS00000642 */ 68520000
    WHEN (9999)                                                         68530000
    DO;                                          /* SOC CEDS00000642 */ 68540000
    /* EDQBSHS.REQ.CRMORET = '4'; */                                    68550000
       COMMAREA.EDQBSHS.REQ.CRMORET = '4';                              68560000
    END;                                         /* EOC CEDS00000642 */ 68570000
    OTHERWISE                                                           68580000
    DO;                                          /* SOC CEDS00000642 */ 68590000
    /* EDQBSHS.REQ.CRMORET = '7'; */                                    68600000
       COMMAREA.EDQBSHS.REQ.CRMORET = '7';                              68610000
    END;                                         /* EOC CEDS00000642 */ 68620000
 END;                                                                   68630000
                                                 /* SOC CEDS00000642 */ 68640000
0/*EDQBSHS.REQ.NTBLNME = ERR_TABLE;                                     68650000
 EDQBSHS.REQ.CRMOSUB = ERR_SQLCODE; */                                  68660000
0COMMAREA.EDQBSHS.REQ.NTBLNME = ERR_TABLE;                              68670000
 COMMAREA.EDQBSHS.REQ.CRMOSUB = ERR_SQLCODE;     /* EOC CEDS00000642 */ 68680000
                                                                        68690000
0RCBCQES.MESSAGE_TYPE  = 'IS';                                          68700000
 RCBCQES.LANGUAGE_CODE = 'EN';                                          68710000
 RCBCQES.PROGRAM_ID    = 'RCBCS3M';                                     68720000
 CALL RCBCQEM(RCBCQES_PTR);                                             68730000
 IF SWITCH_0211_S3 THEN                          /* SOC CEDS00000642 */ 68740000
   DO;                                                                  68750000
    COMMAREA_OLD = COMMAREA;                                            68760000
 /* COMMAREA     = '';   */                                             68770000
   END;                                                                 68780000
 ELSE                                            /* EOC CEDS00000642 */ 68790000
 IF SWITCH_3317_S3 THEN                             /* SOC RB01320 */   68800000
   DO;                                                                  68810000
                                                 /* SOC CEDS00000642 */ 68820000
    COMMAREA_NEW = '';                                                  68830000
    COMMAREA_NEW.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;                  68840000
    COMMAREA_NEW.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;                  68850000
    COMMAREA_NEW.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;                    68860000
    IF WRK_LONG_SERIAL ¬= '' THEN                      /* RC01349  */   68870000
    COMMAREA_NEW.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;                    68880000
    ELSE                                            /* SOC RC01349 */   68890000
       COMMAREA_NEW.EDQBSDS1.SEDQGSN =                                  68900000
              COMMAREA_NEW.EDQBSDS1.IOLCPLM ||                          68910000
              COMMAREA_NEW.EDQBSDS1.IHSINBR ;       /* EOC RC01349 */   68920000
                                                      /* SOC RC01359 */ 68930000
    IF CHECKSEQ = '' THEN                                               68940000
     DO;                                                                68950000
     IF (LENGTH(TRIM(COMMAREA_NEW.EDQBSDS1.IHSINBR)) = 7 &              68960000
         SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,1,2) = '00') THEN         68970000
        COMMAREA_NEW.EDQBSDS1.SEDQGSN=COMMAREA_NEW.EDQBSDS1.IOLCPLM ||  68980000
                     SUBSTR(COMMAREA_NEW.EDQBSDS1.IHSINBR,3,5);         68990000
     END;                                                               69000000
                                                      /* EOC RC01359 */ 69010000
 /*  NEW_VERSION_DUMMY.EDQBSHS1 = COMMAREA.EDQBSHS, BY NAME;            69020000
     NEW_VERSION_DUMMY.EDQBSHS1.SEDQGSN = WRK_LONG_SERIAL;              69030000
     NEW_VERSION_DUMMY.EDQBSDS1 = COMMAREA.EDQBSDS, BY NAME;            69040000
     NEW_VERSION_DUMMY.EDQBSDS1.SEDQGSN = WRK_LONG_SERIAL;              69050000
     COMMAREA1.EDQBSHS1 = ' ';                                          69060000
     COMMAREA1.EDQBSHS1 = NEW_VERSION_DUMMY.EDQBSHS1;                   69070000
     COMMAREA1.EDQBSDS1 = NEW_VERSION_DUMMY.EDQBSDS1; */                69080000
                                                 /* EOC CEDS00000642 */ 69090000
   END;                                             /* EOC RB01320 */   69100000
 EXEC CICS RETURN;                                                      69110000
0END RCBCS3M_LOG_ERROR;                                                 69120000
-/*-----------------------------------------------------------------@*/ 69130000
 /* IDENTIFIER : $DTSEP                                              */ 69140000
 /* FUNCTION   : ADD SEPARATORS TO DATE OR TIME STRINGS              */ 69150000
 /* DESCRIPTION: IF YEAR HAS 4 DIGITS, YYYYMMDD DATE FORMAT REQUIRED */ 69160000
 /*      OTHERWISE WHICHEVER 6-DIGITS DATE OR TIME FORMAT IS ALLOWED */ 69170000
 /*----------------------------------------------------------------@@*/ 69180000
 $DTSEP:  PROC(DATE_IN,SEP)                                             69190000
          RETURNS(CHAR(10)  VAR)  REORDER;                              69200000
    DCL DATE_IN    CHAR(*);                                             69210000
    DCL SEP        CHAR(01);                                            69220000
    DCL DATE_OUT   CHAR(10)  VAR  INIT('');                             69230000
    DCL LIN        FIXED BIN(15)  INIT(0);                              69240000
    LIN = LENGTH(DATE_IN);                                              69250000
    DATE_OUT = DATE_IN || (2)' ';                                       69260000
    SUBSTR(DATE_OUT,LIN-3,3) =                                          69270000
            SEP || SUBSTR(DATE_IN,LIN-3,2);                             69280000
    SUBSTR(DATE_OUT,LIN,3)   =                                          69290000
            SEP || SUBSTR(DATE_IN,LIN-1,2);                             69300000
    RETURN(DATE_OUT);                                                   69310000
  END  $DTSEP;                                                          69320000
1/*******************************************************************/  69330000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  69340000
 /*******************************************************************/  69350000
0 %INCLUDE DAIFPLH;                      /* COMPILE DATE/TIME STAMP */  69360000
  $DAIMOD (RCBCS3M);                     /* MODULE TO BE COMPILED   */  69370000
0/*******************************************************************/  69380000
 /* END OF ABR BLOCK '                                              */  69390000
 /*******************************************************************/  69400000
0END RCBCS3M;                                                           69410000