 /* RCBCQBM - CEDS LAM FOR "TE" REQUESTS                             */ 00019718
 /*                                                                  */ 00020000
 /*                                                                  */ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /*                                                                  */ 00070000
 /********************************************************************/ 00080000
 /* PROGRAM          : RCBCQBM                                       */ 00090000
 /*                                                                  */ 00100000
 /* LANGUAGE         : PLICSQL                                       */ 00110000
 /*                                                                  */ 00120000
 /* TYPE             : LINKABLE MODULE                               */ 00130000
 /*                                                                  */ 00140000
 /* DESCRIPTION      : CEDS LAM FOR "TE" REQUEST                     */ 00150000
 /*                                                                  */ 00160000
 /* INPUT            : SEARCH ARGUMENTS                              */ 00170000
 /*                                                                  */ 00180000
 /* OUTPUT           : DETAILS FROM RCBT0075_SE_PO TABLE             */ 00190000
 /*                    POINTER TO SQLCA                              */ 00200000
 /*                                                                  */ 00210000
 /*                                                                  */ 00220000
 /* EXTERNAL MODULES :                                               */ 00230000
 /*                                                                  */ 00240000
 /*                                                                  */ 00250000
 /* MESSAGES         :                                               */ 00260000
 /*                                                                  */ 00270000
 /* DEPENDENCIES     : NONE                                          */ 00280000
 /*                                                                  */ 00290000
 /* MAINTENANCE LOG  :                                               */ 00300000
 /* ---------------                                                  */ 00310000
 /*                                                                  */ 00320000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00330000
 /* --------------------------------------------------------------   */ 00340000
 /*  1995-09-11 | WI4124       | CEDS 2.3                           **/ 00350000
 /*  1996-04-22 | PTM0902      | UPGRADE TO CICS 4.1 - MOVE FROM    **/ 00360000
 /*             |              | PLISQL TO PLICSQL LIBRARY.         **/ 00370000
 /*  1997-04-22 | PTM1036      | USE STANDARD PROLOGS                */ 00380000
 /*             |              |                                     */ 00390000
 /********************************************************************/ 00400000
1RCBCQBM: PROC (RCBCQBS_PTR)                                            00410000
          REORDER;                                                      00420000
0/********************************************************************/ 00430000
 /*                 P A R A M E T E R S                              */ 00440000
 /********************************************************************/ 00450000
0DCL RCBCQBS_PTR     PTR;              /* PTR TO INTERFACE STRUCTURE */ 00460000
0DCL 1 RCBCQBS       BASED(RCBCQBS_PTR),                                00470000
      %INCLUDE RCBCQBS;;                                                00480000
0DCL 1 RCBCQBS_SQLCA BASED(SQLCA_PTR)                                   00490000
      LIKE SQLCA;                                                       00500000
1/********************************************************************/ 00510000
 /*                 S Q L    D E C L A R A T I O N S                 */ 00520000
 /********************************************************************/ 00530000
0EXEC SQL INCLUDE SQLCA;                                                00540000
0/********************************************************************/ 00550000
 /* DB2 TABLE STRUCTURES                                             */ 00560000
 /********************************************************************/ 00570000
 DCL 1 TB_RCBV075,                                                      00580000
      %INCLUDE (RCB075S);;                                              00590000
 DCL 1 TB_RCBV075_I,                                                    00600000
      %INCLUDE (RCB075SI);;                                             00610000
0/********************************************************************/ 00620000
 /*         M I S C E L L A N E O U S   F I E L D S                  */ 00630000
 /********************************************************************/ 00640000
0DCL WRK_SERVICE_NUMBER   CHAR (10);                                    00650000
0DCL (ADDR,                                                             00660000
      NULL,                                                             00670000
      SUBSTR)             BUILTIN;                                      00680000
1/********************************************************************/ 00690000
 /*           P R O C E S S I N G                                    */ 00700000
 /********************************************************************/ 00710000
0CALL RCBCQBM_INITIALISATION;                                           00720000
0CALL RCBCQBM_MAIN_PROCESSING;                                          00730000
1/********************************************************************/ 00740000
 /*           I N I T I A L     P R O C E S S I N G                  */ 00750000
 /********************************************************************/ 00760000
0RCBCQBM_INITIALISATION : PROC;                                         00770000
0RCBCQBS_SQLCA = '';                                                    00780000
 RCBCQBS.DATA     = '';                                                 00790000
0END RCBCQBM_INITIALISATION;                                            00800000
1/********************************************************************/ 00810000
 /*           M A I N     P R O C E S S I N G                        */ 00820000
 /********************************************************************/ 00830000
0RCBCQBM_MAIN_PROCESSING : PROC;                                        00840000
 WRK_SERVICE_NUMBER = SUBSTR(RCBCQBS.SEARCH.IOFFNIK,1,10);              00850000
 EXEC SQL                                                               00860000
     SELECT                                                             00870000
         COUNTRY_NUMBER                                                 00880000
        ,SERVICE_DESCR_1                                                00890000
        ,SERVICE_DESCR_2                                                00900000
     INTO                                                               00910000
         :TB_RCBV075.COUNTRY_NUMBER                                     00920000
        ,:TB_RCBV075.SERVICE_DESCR_1                                    00930000
        ,:TB_RCBV075.SERVICE_DESCR_2                                    00940000
     FROM RCBV0075_SE_PO                                                00950000
     WHERE                                                              00960000
       COUNTRY_NUMBER  = :SEARCH.IOPUCTY AND                            00970000
       SERVICE_NUMBER  = :WRK_SERVICE_NUMBER;                           00980000
                                                                        00990000
 SELECT (SQLCA.SQLCODE);                                                01000000
    WHEN (0)                                                            01010000
    DO;                                                                 01020000
       RCBCQBS.DATA.SERVICE_DESCR_1 = TB_RCBV075.SERVICE_DESCR_1;       01030000
       RCBCQBS.DATA.SERVICE_DESCR_2 = TB_RCBV075.SERVICE_DESCR_2;       01040000
    END;                                                                01050000
    OTHERWISE;                                                          01060000
 END;                                                                   01070000
 RCBCQBS_SQLCA = SQLCA;                                                 01080000
0END RCBCQBM_MAIN_PROCESSING;                                           01090000
0/********************************************************************/ 01100000
 %INCLUDE DAIFPLH ;                    /* COMPILE DATE/TIME STAMP    */ 01110000
 $DAIMOD (RCBCQBM);                    /* MODULE TO BE COMPILED      */ 01120000
 END RCBCQBM;                                                           01130000