 /* RCBC10P - MAINTAIN MACHINE RELATED CONTRACT DATA                 */ 00010000
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* TRANSACTION CODE    : RC10                                       */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME        : RCBC10M                                    */ 00060000
 /*                                                                  */ 00070000
 /* TYPE                : CICS/VS                                    */ 00080000
 /*                                                                  */ 00090000
 /* USED MAPSET         : RCBM10                                     */ 00100000
 /*      MAP            : RCBM10                                     */ 00110000
 /*                     : RCBM10A                                    */ 00120000
 /*                     : RCBH10A                                    */ 00130000
 /*                     : RCBH10B                                    */ 00140000
 /*                                                                  */ 00150000
 /*                                                                  */ 00160000
 /* DESCRIPTION         : MAINTAIN MACHINE RELATED CONTRACT DATA     */ 00170000
 /*                                                                  */ 00180000
 /* LINKED TRANSACTION  : RC10                                       */ 00190000
 /*                                                                  */ 00200000
 /* MESSAGES            :                                            */ 00210000
 /*                                                                  */ 00220000
 /*                                                                  */ 00230000
 /*  MAINTENANCE LOG :                                               */ 00240000
 /*  ---------------                                                 */ 00250000
 /*                                                                  */ 00260000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00270000
 /*  --------------------------------------------------------------  */ 00280000
 /*  2001-10-29 | RC01230      | CSP TO PL1/CICS CONVERSION          */ 00290000
 /*  2004/02/06 | RB01261      | MAKE COUNTRY NUMBER CHANGEABLE      */ 00300000
 /*  2004/02/06 | RB01263      | MINOR CICS CHANGES                  */ 00310000
 /*  2008/02/08 | CEDS00000361 | WORK_DATE HAS ASSIGNED              */ 00320000
 /*  2008/04/16 | CEDS00000385 | TYPO IN A MESSAGE                   */ 00330000
 /*  2008/07/30 | CEDS00000428 | DISPLAYING OF PROPER ERROR MESSAGE  */ 00340000
 /*  2009-06-19 | CEDS00000475 | CHANGES ARE MADE TO HANDLE FLEXIBLE-*/ 00350000
 /*             |              | WARRANTY/HARDBUNDLE FIELDS          */ 00360000
 /*  2010-06-01 | RB01308      | CHANGES ARE MADE TO HANDLE HELP    -*/ 00370000
 /*             |              | FUNCTION AT SCREEN RCBH10A AND TO   */ 00380000
 /*             |              | ALLOW SWAP BETWEEN TWO HELP SCREENS */ 00390000
 /*  2012-04-14 | RB01320      | LONG SERIAL IMPACT                  */ 00400000
 /*  2014-11-07 | RC01347      | INTEGRATE SUPERIOR LOGIC HAS BEEN  -*/ 00410000
 /*             |              | IMPLEMETED FOR BOTH INSERT AND      */ 00420000
 /*             |              | UPDATE OPERATIONS                   */ 00430000
 /*  2014-11-25 | CEDS00000713 | TOM FOR INSERT OPERATION NOT        */ 00440000
 /*             |              | POPULATING CORRECT VALUES           */ 00450000
 /*  2015-02-06 | RC01351      | UPDATE WARRANTY EXPIRY DATE IN T220 */ 00460000
 /*             |              | FOR A NEW ONLINE CONTRACT           */ 00470000
 /*  2015-02-19 | CEDS00000731 | T10-2107:WARRANTY_EXP_DATE FIELD IS */ 00480000
 /*             |              | INITIALIZED SO THAT CORRECT WARRANTY*/ 00490000
 /*             |              | EXPIRY DATE IS POPULATED            */ 00500000
 /*  2015-03-03 | CEDS00000733 | T10-2130:CHECK FOR T110_FLAG TO     */ 00510000
 /*             |              | AVOID INSERTING RECORD WHEN A       */ 00520000
 /*             |              | MACHINE IS NOT INSTALLED            */ 00530000
 /*  2015-04-01 | CEDS00000737 | T10-2135:UPDATE SCENARIO IS MODIFIED*/ 00540000
 /*             |              | WITH TWO NEW PROCS INORDER TO UPDATE*/ 00550000
 /*             |              | CONTRACT DATES IN T220              */ 00560000
 /*  2015-06-12 | RC01360      | PCR617:DELETE SCENARIO IS MODIFIED  */ 00561000
 /*             |              | TO UPDATE THE ENDDATE IN T220 & T240*/ 00562000
 /*             |              | WITH RUNDATE - 1                    */ 00563000
 /*  2017-04-03 | CEDS00000813 | T10-2214:MESSAGES ARE UPDATED FOR   */ 00571079
 /*             |              | ONLINE DELETE FUNCTION FOR PRESENT  */ 00572075
 /*             |              | AND FUTURE EFFECTIVE DATES          */ 00574075
 /*                                                                  */ 00575075
 /********************************************************************/ 00580000
1RCBC10M: PROC(COMMPTR)                                                 00590000
          OPTIONS (MAIN)                                                00600000
          REORDER;                                                      00610000
0/********************************************************************/ 00620000
 /*  EXTERNAL ENTRIES                                                */ 00630000
 /********************************************************************/ 00640000
                                                                        00650000
0DCL PLIXOPT   VAR  CHAR (256)                                          00660000
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;            00670000
                                                                        00680000
 DCL RCBFAVN ENTRY EXTERNAL;                                            00690000
 DCL RCBFAXN ENTRY EXTERNAL;                                            00700000
 DCL RCB004N ENTRY EXTERNAL;                                            00710000
                                                                        00720000
0/********************************************************************/ 00730000
 /*  BMS RELATED CONSTANTS                                           */ 00740000
 /********************************************************************/ 00750000
 %INCLUDE DFHBMSCA;                                                     00760000
0/********************************************************************/ 00770000
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00780000
 /********************************************************************/ 00790000
 %INCLUDE DFHAID;                                                       00800000
1/********************************************************************/ 00810000
 /*  COMMUNICATION AREA                                              */ 00820000
 /********************************************************************/ 00830000
     %INCLUDE (RCBCP2S);                                                00840000
     %INCLUDE (RCBCHDS);,                                               00850000
     %INCLUDE (RCBC00S);,                                               00860000
     %INCLUDE (RCBC10S);;                                               00870000
0/********************************************************************/ 00880000
 /*  MAP STRUCTURES                                                  */ 00890000
 /********************************************************************/ 00900000
 %INCLUDE (RCBM10);                                                     00910000
0/********************************************************************/ 00920000
 /*  DB2 STRUCTURES                                                  */ 00930000
 /********************************************************************/ 00940000
 DCL 1 RCB125S,                                         /*SOC RB01320*/ 00950000
      %INCLUDE RCB125S;;                                                00960000
 DCL 1 RCB125SI,                                                        00970000
      %INCLUDE RCB125SI;;                               /*EOC RB01320*/ 00980000
 DCL 1 RCB220S,                                                         00990000
      %INCLUDE RCB220S;;                                                01000000
 DCL 1 RCB220SI,                                                        01010000
      %INCLUDE RCB220SI;;                                               01020000
 DCL 1 RCB240S,                                                         01030000
      %INCLUDE RCB240S;;                                                01040000
 DCL 1 RCB240SI,                                                        01050000
      %INCLUDE RCB240SI;;                                               01060000
 DCL 1 RCB500S,                                                         01070000
      %INCLUDE RCB500S;;                                                01080000
 DCL 1 RCB500SI,                                                        01090000
      %INCLUDE RCB500SI;;                                               01100000
 DCL 1 RCB560S,                                                         01110000
     %INCLUDE (RCB560S);;                                               01120000
 DCL 1 RCB560SI,                                                        01130000
     %INCLUDE (RCB560SI);;                                              01140000
 DCL 1 RCB610S,                                                         01150000
     %INCLUDE (RCB610S);;                                               01160000
 DCL 1 RCB610SI,                                                        01170000
     %INCLUDE (RCB610SI);;                                              01180000
0/********************************************************************/ 01190000
 /*  NULL INDICATORS                                                 */ 01200000
 /********************************************************************/ 01210000
 DCL 1 NULL220      BASED(ADDR(RCB220SI)),                              01220000
       3 NUL220A    FIXED  BIN(15) INIT(0),                             01230000
       3 NUL220B    FIXED  BIN(15) INIT(0),                             01240000
       3 NUL220C    FIXED  BIN(15) INIT(0),                             01250000
       3 NUL220D    FIXED  BIN(15) INIT(0),                             01260000
       3 NUL220E    FIXED  BIN(15) INIT(0),                             01270000
       3 NUL220F    FIXED  BIN(15) INIT(0),                             01280000
       3 NUL220G    FIXED  BIN(15) INIT(0),                             01290000
       3 NUL220H    FIXED  BIN(15) INIT(0),                             01300000
       3 NUL220I    FIXED  BIN(15) INIT(0),                             01310000
       3 NUL220J    FIXED  BIN(15) INIT(0),                             01320000
       3 NUL220K    FIXED  BIN(15) INIT(0),                             01330000
    /* 3 NUL220L    FIXED  BIN(15) INIT(0);  */  /* SOC CEDS00000475 */ 01340000
       3 NUL220L    FIXED  BIN(15) INIT(0),                             01350000
       3 NUL220M    FIXED  BIN(15) INIT(0),                             01360000
       3 NUL220N    FIXED  BIN(15) INIT(0),                             01370000
       3 NUL220O    FIXED  BIN(15) INIT(0);      /* EOC CEDS00000475 */ 01380000
 DCL 1 NULL240      BASED(ADDR(RCB240SI)),                              01390000
       3 NUL240A    FIXED  BIN(15) INIT(0),                             01400000
       3 NUL240B    FIXED  BIN(15) INIT(0),                             01410000
       3 NUL240C    FIXED  BIN(15) INIT(0),                             01420000
       3 NUL240D    FIXED  BIN(15) INIT(0),                             01430000
       3 NUL240E    FIXED  BIN(15) INIT(0),                             01440000
       3 NUL240F    FIXED  BIN(15) INIT(0),                             01450000
       3 NUL240G    FIXED  BIN(15) INIT(0),                             01460000
       3 NUL240H    FIXED  BIN(15) INIT(0),                             01470000
       3 NUL240I    FIXED  BIN(15) INIT(0),                             01480000
       3 NUL240J    FIXED  BIN(15) INIT(0),                             01490000
       3 NUL240K    FIXED  BIN(15) INIT(0),                             01500000
       3 NUL240L    FIXED  BIN(15) INIT(0),                             01510000
       3 NUL240M    FIXED  BIN(15) INIT(0),                             01520000
       3 NUL240N    FIXED  BIN(15) INIT(0),                             01530000
       3 NUL240O    FIXED  BIN(15) INIT(0),                             01540000
       3 NUL240P    FIXED  BIN(15) INIT(0),                             01550000
       3 NUL240Q    FIXED  BIN(15) INIT(0),                             01560000
       3 NUL240R    FIXED  BIN(15) INIT(0),                             01570000
       3 NUL240S    FIXED  BIN(15) INIT(0),                             01580000
       3 NUL240T    FIXED  BIN(15) INIT(0),                             01590000
       3 NUL240U    FIXED  BIN(15) INIT(0),                             01600000
       3 NUL240V    FIXED  BIN(15) INIT(0),                             01610000
       3 NUL240W    FIXED  BIN(15) INIT(0),                             01620000
       3 NUL240X    FIXED  BIN(15) INIT(0),                             01630000
       3 NUL240Y    FIXED  BIN(15) INIT(0),                             01640000
       3 NUL240Z    FIXED  BIN(15) INIT(0),                             01650000
       3 NUL2400    FIXED  BIN(15) INIT(0),                             01660000
       3 NUL2401    FIXED  BIN(15) INIT(0),                             01670000
       3 NUL2402    FIXED  BIN(15) INIT(0),                             01680000
       3 NUL2403    FIXED  BIN(15) INIT(0),                             01690000
       3 NUL2404    FIXED  BIN(15) INIT(0),                             01700000
       3 NUL2405    FIXED  BIN(15) INIT(0),                             01710000
       3 NUL2406    FIXED  BIN(15) INIT(0),                             01720000
       3 NUL2407    FIXED  BIN(15) INIT(0),                             01730000
       3 NUL2408    FIXED  BIN(15) INIT(0),                             01740000
       3 NUL2409    FIXED  BIN(15) INIT(0),                             01750000
       3 NUL24010   FIXED  BIN(15) INIT(0),                             01760000
       3 NUL24011   FIXED  BIN(15) INIT(0);                             01770000
0/********************************************************************/ 01780000
 /*  INTERFACE AREAS                                                 */ 01790000
 /********************************************************************/ 01800000
 DCL 1 DATE_AREA,                                                       01810000
     %INCLUDE (RCBZ03S);;                                               01820000
 DCL 1 RCBZ02S,                                                         01830000
      %INCLUDE RCBZ02S;;                                                01840000
 DCL 1 SQLCA_R      BASED(ADDR(RCBZ02S.RETURN_SQL))                     01850000
                    LIKE SQLCA;                                         01860000
 DCL 1 PARM_INT_AREA,                                                   01870000
      %INCLUDE RCBZ01S;;                                                01880000
0/********************************************************************/ 01890000
 /*  RETURN CODES                                                    */ 01900000
 /********************************************************************/ 01910000
 DCL RESPONSE     FIXED BINARY(31) INIT('');   /*RETURN CODE         */ 01920000
 DCL CODE_EXPLAIN FIXED BINARY(31) INIT('');   /*RETURN CODE EXPLAIN */ 01930000
-/********************************************************************/ 01940000
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 01950000
 /********************************************************************/ 01960000
  EXEC SQL  WHENEVER NOT FOUND   CONTINUE;                              01970000
  EXEC SQL  WHENEVER SQLWARNING  CONTINUE;                              01980000
  EXEC SQL  WHENEVER SQLERROR    CONTINUE;                              01990000
0/********************************************************************/ 02000000
 /*  WORKING DECLARATIONS                                            */ 02010000
 /********************************************************************/ 02020000
 DCL PF5_FLAG                 BIT(1) INIT('0'B);                        02030000
 DCL DATE_UPD_FLAG            BIT(1) INIT('0'B);                        02040000
 DCL T220_UPD_FLAG            BIT(1) INIT('0'B);                        02050000
 DCL T240_UPD_FLAG            BIT(1) INIT('0'B);                        02060000
 DCL T125_FND_FLAG            BIT(1) INIT('0'B);            /*RB01320*/ 02070000
 DCL T110_FLAG                BIT(1) INIT('0'B);                        02080000
 DCL T220_FLAG                BIT(1) INIT('0'B);                        02090000
 DCL T240_FLAG                BIT(1) INIT('0'B);                        02100000
 DCL T470_FLAG                BIT(1) INIT('0'B);                        02110000
 DCL T640_FLAG                BIT(1) INIT('0'B);                        02120000
 DCL ERROR_FLAG               BIT(1) INIT('0'B);                        02130000
 DCL ERASE_EOF                CHAR(1) INIT('Ø');                        02140000
 DCL PIC_CNT                  PIC 'ZZZZ9' INIT(0);                      02150000
 DCL COMMAREA_STRING          CHAR(5984) INIT('');                      02160000
 DCL ALPHANUM                 CHAR(37) INIT                             02170000
   ('ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890 ');                           02180000
 DCL TMP_SEQ                  CHAR(9) INIT('');                         02190000
 DCL TMP_SEQB                 CHAR(9) INIT('%%%%%%%%%');                02200000
 DCL DUMMY_ORIGIN             CHAR(2);                  /*SOC RB01320*/ 02210000
 DCL DUMMY_SEQUENCE           CHAR(28);                                 02220000
 DCL ORIGIN                   CHAR(2);                                  02230000
 DCL SEQNO                    CHAR(28);                                 02240000
 DCL REAL_ORIGIN              CHAR(2);                                  02250000
 DCL REAL_SEQNO               CHAR(28);                 /*EOC RB01320*/ 02260000
 DCL WRK_PERIOD               FIXED BIN(31) INIT(0);                    02270000
 DCL WRK_REC_COUNT            FIXED BIN(31) INIT(0);                    02280000
 DCL WRK_REC_COUNT1           FIXED BIN(31) INIT(0);    /*SOC RB01320*/ 02290000
 DCL WRK_REC_COUNT2           FIXED BIN(31) INIT(0);    /*EOC RB01320*/ 02300000
 DCL I1                       FIXED BIN(15) INIT(0);                    02310000
 DCL I2                       FIXED BIN(15) INIT(0);                    02320000
 DCL I3                       FIXED BIN(15) INIT(0);                    02330000
 DCL WRK_OUT_DATE             CHAR(10) INIT('');                        02340000
 DCL WRK_IN_DATE              CHAR(10) INIT('');                        02350000
 DCL DATE1                    CHAR(10) INIT('');        /*CEDS00000737*/02360000
 DCL T240_EFF_DATE            CHAR(10) INIT('');        /*SOC RB01320*/ 02370000
 DCL T240_END_DATE            CHAR(10) INIT('');        /*EOC RB01320*/ 02380000
 DCL WRK_END                  CHAR(10) INIT('');                        02390000
 DCL WRK_HORIZON_PARM         PIC'999' INIT(0);                         02400000
 DCL WRK_O                    CHAR(1) INIT('O');                        02410000
 DCL WRK_CS1                  CHAR(8) INIT('');                         02420000
 DCL WRK_CE1                  CHAR(8) INIT('');                         02430000
 DCL WRK_CS2                  CHAR(8) INIT('');                         02440000
 DCL WRK_CE2                  CHAR(8) INIT('');                         02450000
 DCL WRK_CS3                  CHAR(8) INIT('');                         02460000
 DCL WRK_CE3                  CHAR(8) INIT('');                         02470000
 DCL WRK_CS4                  CHAR(8) INIT('');                         02480000
 DCL WRK_CE4                  CHAR(8) INIT('');                         02490000
 DCL WRK_CS5                  CHAR(8) INIT('');                         02500000
 DCL WRK_CE5                  CHAR(8) INIT('');                         02510000
 DCL WRK_CS6                  CHAR(8) INIT('');                         02520000
 DCL WRK_CE6                  CHAR(8) INIT('');                         02530000
 DCL WRK_CS7                  CHAR(8) INIT('');                         02540000
 DCL WRK_CE7                  CHAR(8) INIT('');                         02550000
                                                  /* SOC CEDS00000713 */02560000
 /*DCL WRK_TYPE_OF_MAINT        CHAR(1) INIT('');         SOC RC01347 */02570000
 /*DCL WRK_TOM_NULL             FIXED BIN(15);            EOC RC01347 */02580000
                                                  /* EOC CEDS00000713 */02590000
 DCL WRKMAP_DATA              CHAR(500) INIT('');                       02600000
 DCL 1 WRKMAP                 BASED(ADDR(WRKMAP_DATA)),                 02610000
     %INCLUDE RCBB564;;                                                 02620000
 DCL WRK_TIME_IN              CHAR(26) INIT(''); /* CEDS00000361      */02630000
 DCL WRK_EFFECTIVE_DTE        CHAR(10) INIT('');      /* CEDS00000813 */02631079
                                                                        02632000
0/********************************************************************/ 02640000
 /*  MESSAGES                                                        */ 02650000
 /********************************************************************/ 02660000
 DCL ERR_MESSAGE3 CHAR(30) INIT('ERROR IN RECEIVING MAP ');             02670000
 DCL ERR_MESSAGE13 CHAR(33) INIT('OTHER ERRORS                     ');  02680000
 DCL ERR_MESSAGE30 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       02690000
 DCL ERR_O002 CHAR(12) INIT('Invalid date');                            02700000
 DCL ERR_O004 CHAR(30) INIT('Invalid use of function key');             02710000
 DCL ERR_O005 CHAR(50) INIT                                             02720000
  ('The highlighted fields have a syntax ERROR');                       02730000
 DCL ERR_O006 CHAR(12) INIT('Invalid time');                            02740000
 DCL ERR_O011 CHAR(40) INIT('TO time earlier than FROM time');          02750000
 DCL ERR_O012 CHAR(40) INIT('End date earlier than effective date');    02760000
 DCL ERR_O022 CHAR(19) INIT('Press F5 to execute');                     02770000
 DCL ERR_O030 CHAR(24) INIT('Already on first page');                   02780000
 DCL ERR_O031 CHAR(23) INIT('Already on last page');                    02790000
 DCL ERR_O032 CHAR(17) INIT('No item selected');                        02800000
 DCL ERR_O037 CHAR(70) INIT                                             02810000
  ('Product not related to an online entered service contract');        02820000
 DCL ERR_O043 CHAR(30) INIT('The TOS is not installed');                02830000
 DCL ERR_O045 CHAR(70) INIT                                             02840000
  ('The TOS is not installed until the end date of reallocation');      02850000
 DCL ERR_O051 CHAR(20) INIT('TOS may not be blank');                    02860000
 DCL ERR_O052 CHAR(15) INIT('Fill in the TOS');                         02870000
 DCL ERR_O053 CHAR(18) INIT('Nothing is updated');                      02880000
 DCL ERR_O055 CHAR(70) INIT                                             02890000
  ('End date must be within the window defined by parameter RCB050');   02900000
 DCL ERR_O056 CHAR(70) INIT                                             02910000
  ('Product already related to an online entered service contract');    02920000
 DCL ERR_O057 CHAR(70) INIT                                             02930000
 ('You are not authorized to use the function for this Country number');02940000
 DCL ERR_O060 CHAR(70) INIT                                             02950000
  ('When the TOS is changed, F5 will not execute any update');          02960000
 DCL ERR_O061 CHAR(70) INIT                                             02970000
  ('Product is under warranty or not purchased in the eff period');     02980000
 DCL ERR_O064 CHAR(40) INIT('Fill in the action you want to perform');  02990000
 DCL ERR_O068 CHAR(30) INIT('All the updates are performed');           03000000
 DCL ERR_O072 CHAR(25) INIT('Country number is invalid');               03010000
 DCL ERR_O073 CHAR(70) INIT                                             03020000
  ('The combination Agreement type/Agreement Option is not valid');     03030000
 DCL ERR_O077 CHAR(50) INIT                                             03040000
  ('If this screen is OK , then press Enter or F5');                    03050000
 DCL ERR_O078 CHAR(21) INIT('Type is not effective');                   03060000
 DCL ERR_O079 CHAR(70) INIT                                             03070000
 ('Not allowed to maintain serv. contracts,no activity report created');03080000
 DCL ERR_O080 CHAR(70) INIT                                             03090000
  ('The TO time has to be filled in when the FROM time is filled in');  03100000
 DCL ERR_O081 CHAR(70) INIT                                             03110000
  ('The FROM time has to be filled in, when the TO time is filled in'); 03120000
 DCL ERR_O098 CHAR(30) INIT('Invalid command entered');                 03130000
 DCL ERR_O112 CHAR(40) INIT('The entered Service Type is not valid');   03140000
 DCL ERR_O113 CHAR(70) INIT                                             03150000
  ('A vaild Service Type does not exist');                              03160000
 DCL ERR_O114 CHAR(50) INIT                                             03170000
  ('Either ATO or SERVICE TYPE should be filled in');                   03180000
 DCL ERR_O115 CHAR(40) INIT('Agreement option should be filled in');    03190000
 DCL ERR_O116 CHAR(70) INIT                                             03200000
  ('TOS may not be part of other contract within the specified period');03210000
 DCL ERR_O142 CHAR(40) INIT('Service_Level_Code does not exist');       03220000
                                                 /* SOC CEDS00000813 */ 03220179
 DCL ERR_O143 CHAR(70) INIT                                             03221000
  ('CONTRACT CANNOT BE DELETED ON THE SAME DAY IT IS BEING EFFECTIVE'); 03222078
 DCL ERR_O144 CHAR(70) INIT('FUTURE CONTRACT CANNOT BE DELETED');       03222176
                                                 /* EOC CEDS00000813 */ 03223079
0/********************************************************************/ 03230000
 /*  TS AREA                                                         */ 03240000
 /********************************************************************/ 03250000
 DCL 1 TS_REC,                                                          03260000
       3 TYPE      CHAR(04) INIT(''),                                   03270000
       3 ORIGIN    CHAR(02) INIT(''),                                   03280000
       3 SEQNO     CHAR(07) INIT(''),                                   03290000
       3 EFFDATE   CHAR(10) INIT(''),                                   03300000
       3 ENDDATE   CHAR(10) INIT('');                                   03310000
 DCL 1 T125,                                            /*SOC RB01320*/ 03320000
       3 PRODUCT_TYPE       CHAR(04) INIT(''),                          03330000
       3 REAL_SERIAL_NUMBER CHAR(30) INIT(''),                          03340000
       3 DUMMY_ORIGIN       CHAR(02) INIT(''),                          03350000
       3 DUMMY_SEQUENCE_NUM CHAR(07) INIT('');          /*EOC RB01320*/ 03360000
 /********************************************************************/ 03370000
 /*                 BUILT IN FUNCTIONS                               */ 03380000
 /********************************************************************/ 03390000
0DCL (LENGTH,                                                           03400000
      STRING,                                                           03410000
      SUBSTR,                                                           03420000
      VERIFY,                                                           03430000
      DECIMAL,                                                          03440000
      DATETIME,                                                         03450000
      CHAR,                                                             03460000
      NULL,                                                             03470000
      CSTG,                                                             03480000
      STG,                                                              03490000
      ADDR)   BUILTIN;                                                  03500000
0/********************************************************************/ 03510000
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 03520000
 /********************************************************************/ 03530000
  EXEC SQL  INCLUDE  SQLCA;                                             03540000
0/********************************************************************/ 03550000
 /****   DECLARATIONS OF DB2 CURSORS                              ****/ 03560000
 /********************************************************************/ 03570000
  EXEC SQL DECLARE C_125 CURSOR FOR                     /*SOC RB01320*/ 03580000
         SELECT PRODUCT_TYPE                                            03590000
                 ,REAL_SERIAL_NUMBER                                    03600000
                 ,DUMMY_ORIGIN                                          03610000
                 ,DUMMY_SEQUENCE_NUM                                    03620000
           FROM RCBV0125_DMMY_REAL                                      03630000
           WHERE COUNTRY_NUMBER       = :WRK_COUNTRY_NUMBER             03640000
             AND ((PRODUCT_TYPE       = :TYPE_SEL                       03650000
              OR   :TYPE_ENT          = 'N')                            03660000
             AND  (DUMMY_ORIGIN       = :ORIGIN_SEL                     03670000
              OR   :ORIGIN_ENT        = 'N')                            03680000
             AND  (DUMMY_SEQUENCE_NUM LIKE :TMP_SEQ                     03690000
              OR   :SEQ_ENT           = 'N'))                           03700000
           ORDER BY PRODUCT_TYPE,DUMMY_ORIGIN,DUMMY_SEQUENCE_NUM        03710000
           FOR FETCH ONLY                                               03720000
           WITH UR;                                     /*EOC RB01320*/ 03730000
                                                                        03740000
  EXEC SQL DECLARE C_240 CURSOR FOR                                     03750000
           SELECT PRODUCT_TYPE                                          03760000
                 ,ORIGIN                                                03770000
                 ,SEQUENCE_NUMBER                                       03780000
                 ,EFFECTIVE_DATE                                        03790000
                 ,END_DATE                                              03800000
           FROM RCBV0240_SERV_CTR                                       03810000
           WHERE COUNTRY_NUMBER       = :WRK_COUNTRY_NUMBER             03820000
             AND SOURCE_INDICATOR     = :WRK_O                          03830000
             AND ((PRODUCT_TYPE       = :TYPE_SEL                       03840000
              OR   :TYPE_ENT          = 'N')                            03850000
             AND  (ORIGIN             = :ORIGIN_SEL                     03860000
              OR   :ORIGIN_ENT        = 'N')                            03870000
             AND  (SEQUENCE_NUMBER LIKE :TMP_SEQ                        03880000
              OR   :SEQ_ENT           = 'N'))                           03890000
           ORDER BY PRODUCT_TYPE,ORIGIN,SEQUENCE_NUMBER,                03900000
                    EFFECTIVE_DATE                                      03910000
           FOR FETCH ONLY                                               03920000
           WITH UR;                                                     03930000
                                                                        03940000
1/********************************************************************/ 03950000
 /*                   M A I N   P R O C E S S I N G                  */ 03960000
 /*                                                                  */ 03970000
 /********************************************************************/ 03980000
                                                                        03990000
 IF EIBCALEN = 0 THEN                                                   04000000
 DO;                                                                    04010000
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   04020000
 END;                                                                   04030000
                                                                        04040000
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP; /* CEDS00000361      */ 04050000
 WRK_DATE = SUBSTR(WRK_TIME_IN,1,10);           /* CEDS00000361      */ 04060000
                                                                        04070000
                                                                        04080000
 IF HEADER.NEXT = '99' THEN                                             04090000
 DO;                                                                    04100000
   HEADER.NEXT = '00';                                                  04110000
   CALL RCBC10M_CLEAR_SEL;                                              04120000
   CALL RCBC10M_CLEAR_WORK;                                             04130000
   CALL RCBC10M_CLEAR_MAPA;                                             04140000
   TMP_COUNTRY_NUMBER = WRK_COUNTRY_NUMBER;                             04150000
   CALL RCBC10M_GET_T500A;                                              04160000
   CALL RCBC10M_SEND_MAPA;                                              04170000
 END;                                                                   04180000
                                                                        04190000
 IF HEADER.NEXT = 'H0' THEN                                             04200000
 DO;                                                                    04210000
   HEADER.NEXT = '00';                                                  04220000
   IF  HEADER.REQUEST_ID = 'A' THEN                                     04230000
   DO;                                                                  04240000
     IF TS_CNT = 0 THEN                                                 04250000
     DO;                                                                04260000
       CALL RCBC10M_CLEAR_MAPA;                                         04270000
       CALL RCBC10M_SEND_MAPA;                                          04280000
     END;                                                               04290000
     J = J - K;                                                         04300000
     CALL RCBC10M_FILL_MAPA;                                            04310000
     RCBM10AI.SELL(1) = -1;                                             04320000
     CALL RCBC10M_SEND_MAPA_CSR;                                        04330000
   END;                                                                 04340000
   CALL RCBC10M_RESTORE_MAP;                                            04350000
   CALL RCBC10M_GET_CSR_POS;                                            04360000
   CALL RCBC10M_SEND_MAP_CSR;                                           04370000
 END;                                                                   04380000
                                                                        04390000
 IF HEADER.NEXT = 'H1'                                                  04400000
  | HEADER.NEXT = 'H2' THEN                                             04410000
 DO;                                                                    04420000
  SELECT (EIBAID);                                     /* SOC RB01308 */04430000
    WHEN (DFHPF7,DFHPF19)                                               04440000
    DO;                                                                 04450000
      IF HEADER.NEXT = 'H1' THEN                                        04460000
       CALL RCBC10M_HELP_MAP1;                                          04470000
    END;                                                                04480000
    WHEN (DFHPF8,DFHPF20)                                               04490000
    DO;                                                                 04500000
      IF HEADER.NEXT = 'H2' THEN                                        04510000
       CALL RCBC10M_HELP_MAP1;                                          04520000
    END;                                                                04530000
    OTHERWISE;                                                          04540000
 END;                                                  /* EOC RB01308 */04550000
   HEADER.NEXT = '00';                                                  04560000
   CALL RCBC10M_FILL_MAP;                                               04570000
   CALL RCBC10M_SEND_MAP;                                               04580000
 END;                                                                   04590000
                                                                        04600000
 SELECT (EIBAID);                                                       04610000
   WHEN (DFHPF1,DFHPF13)                                                04620000
   DO;                                                                  04630000
     CALL RCBC10M_HELP_MAP;                                             04640000
   END;                                                                 04650000
                                                                        04660000
   WHEN (DFHPF2,DFHPF14)                                                04670000
   DO;                                                                  04680000
     IF  HEADER.REQUEST_ID = 'A' THEN                                   04690000
     DO;                                                                04700000
     CALL RCBC10M_CLEAR_SEL;                                            04710000
     CALL RCBC10M_CLEAR_WORK;                                           04720000
     CALL RCBC10M_CLEAR_MAPA;                                           04730000
     CALL RCBC10M_SEND_MAPA;                                            04740000
     END;                                                               04750000
     ELSE DO;                                                           04760000
       CALL RCBC10M_RECEIVE_MAP;                                        04770000
       RCBM10O.MSG_LINEO = ERR_O004;                                    04780000
       RCBM10I.ACTIONL   = -1;                                          04790000
       CALL RCBC10M_SEND_MAP_CSR;                                       04800000
     END;                                                               04810000
   END;                                                                 04820000
                                                                        04830000
   WHEN (DFHPF3,DFHPF15)                                                04840000
   DO;                                                                  04850000
     IF UPD_OK_FLAG = TRUE THEN                                         04860000
     DO;                                                                04870000
       UPD_OK_FLAG = FALSE;                                             04880000
       CALL RCBC10M_GET_SELECTION;                                      04890000
       CALL RCBC10M_FILL_MAPA;                                          04900000
       RCBM10AI.SELL(1) = -1;                                           04910000
       CALL RCBC10M_SEND_MAPA_CSR;                                      04920000
     END;                                                               04930000
                                                                        04940000
     IF  HEADER.REQUEST_ID = '' THEN                                    04950000
     DO;                                                                04960000
       IF TS_CNT = 0 THEN                                               04970000
       DO;                                                              04980000
         CALL RCBC10M_CLEAR_WORK;                                       04990000
         CALL RCBC10M_CLEAR_MAP;                                        05000000
         CALL RCBC10M_CLEAR_MAPA;                                       05010000
         CALL RCBC10M_SEND_MAPA;                                        05020000
       END;                                                             05030000
                                                                        05040000
       CALL RCBC10M_CLEAR_WORK;                                         05050000
       CALL RCBC10M_CLEAR_MAP;                                          05060000
       J = J - K;                                                       05070000
       CALL RCBC10M_FILL_MAPA;                                          05080000
       RCBM10AI.SELL(1) = -1;                                           05090000
       CALL RCBC10M_SEND_MAPA_CSR;                                      05100000
     END;                                                               05110000
                                                                        05120000
     HEADER.NEXT = 'H1';                                                05130000
     TS_Q = 'RC00' || EIBTRMID;                                         05140000
     EXEC CICS IGNORE CONDITION QIDERR;                                 05150000
     EXEC CICS DELETEQ TS QUEUE(TS_Q);                                  05160000
     EXEC CICS HANDLE CONDITION QIDERR;                                 05170000
                                                                        05180000
     EXEC CICS XCTL                                                     05190000
         PROGRAM('RCBC00P')                                             05200000
         COMMAREA(COMMAREA)                                             05210000
         LENGTH(CSTG(COMMAREA))                                         05220000
         RESP(RESPONSE)                                                 05230000
         RESP2(CODE_EXPLAIN);                                           05240000
   END;                                                                 05250000
                                                                        05260000
   WHEN (DFHPF4,DFHPF16)                                                05270000
   DO;                                                                  05280000
     IF  HEADER.REQUEST_ID = 'A' THEN                                   05290000
     DO;                                                                05300000
       CALL RCBC10M_CLEAR_MAP;                                          05310000
       RCBM10O.ACTIONO = '1';                                           05320000
       RCBM10I.ACTIONL = -1;                                            05330000
       CALL RCBC10M_SEND_MAP_CSR;                                       05340000
     END;                                                               05350000
     ELSE DO;                                                           05360000
       CALL RCBC10M_RECEIVE_MAP;                                        05370000
       RCBM10O.MSG_LINEO = ERR_O004;                                    05380000
       RCBM10I.ACTIONL   = -1;                                          05390000
       CALL RCBC10M_SEND_MAP_CSR;                                       05400000
     END;                                                               05410000
   END;                                                                 05420000
                                                                        05430000
   WHEN (DFHPF5,DFHPF17)                                                05440000
   DO;                                                                  05450000
     IF  HEADER.REQUEST_ID = 'A' THEN                                   05460000
     DO;                                                                05470000
     CALL RCBC10M_RECEIVE_MAPA;                                         05480000
       RCBM10AO.MSG_LINEO = ERR_O004;                                   05490000
       RCBM10AI.SELL(1)   = -1;                                         05500000
       CALL RCBC10M_SEND_MAPA_CSR;                                      05510000
     END;                                                               05520000
                                                                        05530000
     PF5_FLAG = TRUE;                                                   05540000
     CALL RCBC10M_RECEIVE_MAP;                                          05550000
                                                                        05560000
     IF WRK_COUNTRY_NUMBER  = RCBM10I.COUNTRY_NUMBERI                   05570000
      & WRK_PRODUCT_TYPE    = RCBM10I.TYPEI                             05580000
      & WRK_ORIGIN          = RCBM10I.ORIGINI                           05590000
      & WRK_SEQUENCE_NUMBER = RCBM10I.SEQNOI THEN                       05600000
     DO;                                                                05610000
       CALL RCBC10M_ACTION_PROCESS;                                     05620000
     END;                                                               05630000
                                                                        05640000
     CALL RCBC10M_VALIDATE_MAP;                                         05650000
     CALL RCBC10M_SEND_MAP;                                             05660000
   END;                                                                 05670000
                                                                        05680000
   WHEN (DFHPF7,DFHPF19)                                                05690000
   DO;                                                                  05700000
     IF  HEADER.REQUEST_ID = 'A' THEN                                   05710000
     DO;                                                                05720000
       IF TS_CNT = 0 THEN                                               05730000
       DO;                                                              05740000
         CALL RCBC10M_CLEAR_MAPA;                                       05750000
         RCBM10AO.MSG_LINEO = ERR_O032;                                 05760000
         RCBM10AI.SELL(1) = -1;                                         05770000
         CALL RCBC10M_SEND_MAPA_CSR;                                    05780000
       END;                                                             05790000
                                                                        05800000
       IF L - 16 < 0 THEN                                               05810000
       DO;                                                              05820000
         J = 0;                                                         05830000
         RCBM10AO.MSG_LINEO = ERR_O030;                                 05840000
         CALL RCBC10M_FILL_MAPA;                                        05850000
         CALL RCBC10M_SEND_MAPA;                                        05860000
       END;                                                             05870000
       ELSE DO;                                                         05880000
         J = L - 16;                                                    05890000
         CALL RCBC10M_FILL_MAPA;                                        05900000
         RCBM10AI.SELL(1) = -1;                                         05910000
         CALL RCBC10M_SEND_MAPA_CSR;                                    05920000
       END;                                                             05930000
     END;                                                               05940000
                                                                        05950000
     CALL RCBC10M_RECEIVE_MAP;                                          05960000
     RCBM10O.MSG_LINEO = ERR_O004;                                      05970000
     RCBM10I.TYPEL     = -1;                                            05980000
     CALL RCBC10M_SEND_MAP_CSR;                                         05990000
   END;                                                                 06000000
                                                                        06010000
   WHEN (DFHPF8,DFHPF20)                                                06020000
   DO;                                                                  06030000
     IF  HEADER.REQUEST_ID = 'A' THEN                                   06040000
     DO;                                                                06050000
     IF TS_CNT = 0 THEN                                                 06060000
     DO;                                                                06070000
       CALL RCBC10M_CLEAR_MAPA;                                         06080000
       RCBM10AO.MSG_LINEO = ERR_O032;                                   06090000
       RCBM10AI.SELL(1) = -1;                                           06100000
       CALL RCBC10M_SEND_MAPA_CSR;                                      06110000
     END;                                                               06120000
                                                                        06130000
     IF J >= TS_CNT THEN                                                06140000
     DO;                                                                06150000
       J = J - K;                                                       06160000
       RCBM10AO.MSG_LINEO = ERR_O031;                                   06170000
       CALL RCBC10M_FILL_MAPA;                                          06180000
       RCBM10AI.SELL(1) = -1;                                           06190000
       CALL RCBC10M_SEND_MAPA_CSR;                                      06200000
     END;                                                               06210000
                                                                        06220000
     CALL RCBC10M_FILL_MAPA;                                            06230000
     RCBM10AI.SELL(1) = -1;                                             06240000
     CALL RCBC10M_SEND_MAPA_CSR;                                        06250000
     END;                                                               06260000
                                                                        06270000
     CALL RCBC10M_RECEIVE_MAP;                                          06280000
     RCBM10O.MSG_LINEO = ERR_O004;                                      06290000
     RCBM10I.TYPEL     = -1;                                            06300000
     CALL RCBC10M_SEND_MAP_CSR;                                         06310000
   END;                                                                 06320000
                                                                        06330000
   WHEN (DFHPF9,DFHPF21)                                                06340000
   DO;                                                                  06350000
     IF  HEADER.REQUEST_ID = '' THEN                                    06360000
     DO;                                                                06370000
       CALL RCBC10M_RECEIVE_MAP;                                        06380000
       RCBM10O.MSG_LINEO = ERR_O004;                                    06390000
       RCBM10I.ACTIONL   = -1;                                          06400000
       CALL RCBC10M_SEND_MAP_CSR;                                       06410000
     END;                                                               06420000
                                                                        06430000
     IF  HEADER.REQUEST_ID = 'A' THEN                                   06440000
     DO;                                                                06450000
       IF O = 0                                                         06460000
        & TS_CNT > 15 THEN                                              06470000
       DO;                                                              06480000
         O = 1;                                                         06490000
         J = TS_CNT - 15;                                               06500000
         IF J < 1 THEN J = 1;                                           06510000
         CALL RCBC10M_FILL_MAPA;                                        06520000
         CALL RCBC10M_SEND_MAPA;                                        06530000
       END;                                                             06540000
                                                                        06550000
       O = 0;                                                           06560000
       J = 0;                                                           06570000
       CALL RCBC10M_FILL_MAPA;                                          06580000
       CALL RCBC10M_SEND_MAPA;                                          06590000
     END;                                                               06600000
   END;                                                                 06610000
                                                                        06620000
   WHEN (DFHENTER)                                                      06630000
   DO;                                                                  06640000
     IF  HEADER.REQUEST_ID = 'A' THEN                                   06650000
     DO;                                                                06660000
       CALL RCBC10M_RECEIVE_MAPA;                                       06670000
                                                                        06680000
       IF RCBM10AI.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER                06690000
        | RCBM10AI.TYPE_SELI       ¬= TYPE_SEL                          06700000
        | RCBM10AI.ORIGIN_SELI     ¬= ORIGIN_SEL                        06710000
        | RCBM10AI.SEQ_SELI        ¬= SEQ_SEL THEN                      06720000
       DO;                                                              06730000
         T240_UPD_FLAG  = FALSE;                                        06740000
         CALL RCBC10M_VALIDATE_MAPA;                                    06750000
         CALL RCBC10M_GET_SELECTION;                                    06760000
         CALL RCBC10M_FILL_MAPA;                                        06770000
         CALL RCBC10M_SEND_MAPA;                                        06780000
       END;                                                             06790000
       CALL RCBC10M_CHECK_MAPA;                                         06800000
       CALL RCBC10M_GET_CONTRACT;                                       06810000
       CALL RCBC10M_SEND_MAP;                                           06820000
     END;                                                               06830000
                                                                        06840000
     CALL RCBC10M_RECEIVE_MAP;                                          06850000
                                                                        06860000
     IF WRK_COUNTRY_NUMBER  = RCBM10I.COUNTRY_NUMBERI                   06870000
      & WRK_PRODUCT_TYPE    = RCBM10I.TYPEI                             06880000
      & WRK_ORIGIN          = RCBM10I.ORIGINI                           06890000
      & WRK_SEQUENCE_NUMBER = RCBM10I.SEQNOI THEN                       06900000
     DO;                                                                06910000
       CALL RCBC10M_ACTION_PROCESS;                                     06920000
     END;                                                               06930000
                                                                        06940000
     CALL RCBC10M_VALIDATE_MAP;                                         06950000
     CALL RCBC10M_SEND_MAP;                                             06960000
   END;                                                                 06970000
                                                                        06980000
   WHEN (DFHCLEAR)                                                      06990000
   DO;                                                                  07000000
     EXEC CICS SEND                                                     07010000
        CONTROL                                                         07020000
        ERASE                                                           07030000
        FREEKB;                                                         07040000
     EXEC CICS RETURN;                                                  07050000
   END;                                                                 07060000
                                                                        07070000
   OTHERWISE                        /* INVALID KEY ENTERED */           07080000
   DO;                                                                  07090000
     IF HEADER.REQUEST_ID = 'A' THEN                                    07100000
     DO;                                                                07110000
       J = 0;                                                           07120000
       CALL RCBC10M_RECEIVE_MAPA;                                       07130000
       RCBM10AO.MSG_LINEO = ERR_O004;                                   07140000
       RCBM10AI.SELL(1)   = -1;                                         07150000
       CALL RCBC10M_SEND_MAPA_CSR;                                      07160000
     END;                                                               07170000
                                                                        07180000
     CALL RCBC10M_RECEIVE_MAP;                                          07190000
     RCBM10O.MSG_LINEO = ERR_O004;                                      07200000
     RCBM10I.TYPEL     = -1;                                            07210000
     CALL RCBC10M_SEND_MAP_CSR;                                         07220000
   END;                                                                 07230000
                                                                        07240000
 END;                                                                   07250000
1/********************************************************************/ 07260000
 /*      RECEIVE MAP RCBM10                                          */ 07270000
 /********************************************************************/ 07280000
0RCBC10M_RECEIVE_MAP : PROC;                                            07290000
                                                                        07300000
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      07310000
    MAP('RCBM10')                                                       07320000
    MAPSET('RCBM10')                                                    07330000
    RESP(RESPONSE)                                                      07340000
    RESP2(CODE_EXPLAIN);                                                07350000
                                                                        07360000
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      07370000
   WHEN(DFHRESP(NORMAL));                                               07380000
                                                                        07390000
   OTHERWISE                                                            07400000
   DO;                                                                  07410000
     RCBM10O.MSG_LINEO = ERR_MESSAGE3;                                  07420000
     CALL RCBC10M_SEND_MAP;                                             07430000
   END;                                                                 07440000
 END;                                                                   07450000
                                                                        07460000
0END RCBC10M_RECEIVE_MAP;                                               07470000
1/********************************************************************/ 07480000
 /*      RECEIVE MAP RCBM10A                                         */ 07490000
 /********************************************************************/ 07500000
0RCBC10M_RECEIVE_MAPA: PROC;                                            07510000
                                                                        07520000
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      07530000
    MAP('RCBM10A')                                                      07540000
    MAPSET('RCBM10')                                                    07550000
    RESP(RESPONSE)                                                      07560000
    RESP2(CODE_EXPLAIN);                                                07570000
                                                                        07580000
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      07590000
   WHEN(DFHRESP(NORMAL));                                               07600000
                                                                        07610000
   OTHERWISE                                                            07620000
   DO;                                                                  07630000
     RCBM10O.MSG_LINEO = ERR_MESSAGE3;                                  07640000
     CALL RCBC10M_SEND_MAP;                                             07650000
   END;                                                                 07660000
 END;                                                                   07670000
                                                                        07680000
0END RCBC10M_RECEIVE_MAPA;                                              07690000
1/********************************************************************/ 07700000
 /*      FILL MAP FROM WORK FIELDS                                   */ 07710000
 /********************************************************************/ 07720000
0RCBC10M_FILL_MAP: PROC;                                                07730000
                                                                        07740000
 RCBM10O.COUNTRY_NUMBERO       = WRK_COUNTRY_NUMBER;                    07750000
 RCBM10O.ACTIONO               = WRK_ACTION;                            07760000
 RCBM10O.TYPEO                 = WRK_PRODUCT_TYPE;                      07770000
 RCBM10O.ORIGINO               = WRK_ORIGIN;                            07780000
 RCBM10O.SEQNOO                = WRK_SEQUENCE_NUMBER;                   07790000
 RCBM10O.EFFECTIVE_DATEO       = WRK_EFFECTIVE_DATE;                    07800000
 RCBM10O.END_DATEO             = WRK_END_DATE;                          07810000
 RCBM10O.AGREEMENT_TYPEO       = WRK_AGREEMENT_TYPE;;                   07820000
 RCBM10O.AGREEMENT_OPTIONO     = WRK_AGREEMENT_OPTION;                  07830000
 RCBM10O.SERVICE_TYPEO         = WRK_SERVICE_TYPE;                      07840000
 RCBM10O.SERVICE_LVL_CODEO     = WRK_SERVICE_LVL_CODE;                  07850000
 RCBM10O.COVERAGE_START_1O     = WRK_COVERAGE_START_1;                  07860000
 RCBM10O.COVERAGE_END_1O       = WRK_COVERAGE_END_1;                    07870000
 RCBM10O.COVERAGE_START_2O     = WRK_COVERAGE_START_2;                  07880000
 RCBM10O.COVERAGE_END_2O       = WRK_COVERAGE_END_2;                    07890000
 RCBM10O.COVERAGE_START_3O     = WRK_COVERAGE_START_3;                  07900000
 RCBM10O.COVERAGE_END_3O       = WRK_COVERAGE_END_3;                    07910000
 RCBM10O.COVERAGE_START_4O     = WRK_COVERAGE_START_4;                  07920000
 RCBM10O.COVERAGE_END_4O       = WRK_COVERAGE_END_4;                    07930000
 RCBM10O.COVERAGE_START_5O     = WRK_COVERAGE_START_5;                  07940000
 RCBM10O.COVERAGE_END_5O       = WRK_COVERAGE_END_5;                    07950000
 RCBM10O.COVERAGE_START_6O     = WRK_COVERAGE_START_6;                  07960000
 RCBM10O.COVERAGE_END_6O       = WRK_COVERAGE_END_6;                    07970000
 RCBM10O.COVERAGE_START_7O     = WRK_COVERAGE_START_7;                  07980000
 RCBM10O.COVERAGE_END_7O       = WRK_COVERAGE_END_7;                    07990000
                                                                        08000000
0END RCBC10M_FILL_MAP;                                                  08010000
1/********************************************************************/ 08020000
 /*      FILL MAP RCBM10A                                            */ 08030000
 /********************************************************************/ 08040000
0RCBC10M_FILL_MAPA: PROC;                                               08050000
                                                                        08060000
 CALL RCBC10M_CLEAR_MAPA;                                               08070000
                                                                        08080000
 K = 0;                                                                 08090000
 PIC_CNT          = J + 1;                                              08100000
 IF PIC_CNT = 0 THEN PIC_CNT = 1;                                       08110000
                                                                        08120000
 RCBM10AO.INCNTO  = PIC_CNT;                                            08130000
 L                = PIC_CNT;                                            08140000
 PIC_CNT          = TS_CNT;                                             08150000
 RCBM10AO.TOTCNTO = PIC_CNT;                                            08160000
                                                                        08170000
 DO I = 1 TO 15;                                                        08180000
   RCBM10AO.SELA(I) = DFHBMPRF;                                         08190000
 END;                                                                   08200000
                                                                        08210000
 TS_Q = 'RC00' || EIBTRMID;                                             08220000
                                                                        08230000
 DO I = 1 TO 15;                                                        08240000
                                                                        08250000
   IF J <= TS_CNT                                                       08260000
    & TS_CNT ¬= 0 THEN                                                  08270000
   DO;                                                                  08280000
     J = J + 1;     /* NUMBER OF LINES DISPLAYED */                     08290000
     K = K + 1;     /* NUMBER OF LINES DISPLAYED ON CURRENT SCREEN */   08300000
     EXEC CICS READQ TS QUEUE(TS_Q) INTO(TS_REC) ITEM(J);               08310000
     RCBM10AO.SELA(I)             = DFHBMUNP;                           08320000
     RCBM10AO.PRODUCT_TYPEO(I)    = TS_REC.TYPE;                        08330000
     RCBM10AO.ORIGINO(I)          = TS_REC.ORIGIN;                      08340000
     RCBM10AO.SEQUENCE_NUMBERO(I) = TS_REC.SEQNO;                       08350000
     RCBM10AO.EFFECTIVE_DATEO(I)  = TS_REC.EFFDATE;                     08360000
     RCBM10AO.END_DATEO(I)        = TS_REC.ENDDATE;                     08370000
   END;                                                                 08380000
                                                                        08390000
   IF J >= TS_CNT THEN                                                  08400000
     I = 16;                                                            08410000
 END;                                                                   08420000
                                                                        08430000
 CALL RCBC10M_SET_MAPA;                                                 08440000
                                                                        08450000
0END RCBC10M_FILL_MAPA;                                                 08460000
1/********************************************************************/ 08470000
 /*      VALIDATE MAP RCBM10A                                        */ 08480000
 /********************************************************************/ 08490000
0RCBC10M_VALIDATE_MAPA: PROC;                                           08500000
                                                                        08510000
 TYPE_ENT   = 'N';                                                      08520000
 ORIGIN_ENT = 'N';                                                      08530000
 SEQ_ENT    = 'N';                                                      08540000
 TYPE_SEL   = '';                                                       08550000
 ORIGIN_SEL = '';                                                       08560000
 SEQ_SEL    = '';                                                       08570000
                                                                        08580000
 IF RCBM10AI.TYPE_SELL   = 0 THEN                                       08590000
   RCBM10AO.TYPE_SELO    = '';                                          08600000
 IF RCBM10AI.ORIGIN_SELL = 0 THEN                                       08610000
   RCBM10AO.ORIGIN_SELO  = '';                                          08620000
 IF RCBM10AI.SEQ_SELL    = 0 THEN                                       08630000
   RCBM10AO.SEQ_SELO     = '';                                          08640000
                                                                        08650000
 IF WRK_COUNTRY_NUMBER ¬= RCBM10AI.COUNTRY_NUMBERI THEN                 08660000
 DO;                                                                    08670000
   SEL_OPT = '4';                                                       08680000
   WRK_COUNTRY_NUMBER = RCBM10AI.COUNTRY_NUMBERI;                       08690000
                                                                        08700000
   EXEC CICS LINK                                                       08710000
      PROGRAM('RCBC99P')                                                08720000
      COMMAREA(COMMAREA)                                                08730000
      LENGTH(CSTG(COMMAREA));                                           08740000
                                                                        08750000
   IF CTY_OK_FLAG = FALSE THEN                                          08760000
   DO;                                                                  08770000
     RCBM10AO.MSG_LINEO       = ERR_O072;                               08780000
     RCBM10AI.COUNTRY_NUMBERL = -1;                                     08790000
     RCBM10AO.COUNTRY_NUMBERC = DFHRED;                                 08800000
     WRK_COUNTRY_NUMBER       = '001';                                  08810000
     CALL RCBC10M_CLEAR_MAPA_2;                                         08820000
     CALL RCBC10M_SEND_MAPA_CSR;                                        08830000
   END;                                                                 08840000
                                                                        08850000
   IF OK_FLAG = FALSE THEN                                              08860000
   DO;                                                                  08870000
     RCBM10AO.MSG_LINEO       = ERR_O057;                               08880000
     RCBM10AI.COUNTRY_NUMBERL = -1;                                     08890000
     RCBM10AO.COUNTRY_NUMBERC = DFHRED;                                 08900000
     WRK_COUNTRY_NUMBER       = '001';                                  08910000
     CALL RCBC10M_CLEAR_MAPA_2;                                         08920000
     CALL RCBC10M_SEND_MAPA_CSR;                                        08930000
   END;                                                                 08940000
                                                                        08950000
   IF RCB025_FLAG = FALSE THEN                                          08960000
   DO;                                                                  08970000
     RCBM10AO.MSG_LINEO =                                               08980000
                     'Parameter RCB025 is missing for this country';    08990000
     RCBM10AO.COUNTRY_NUMBERC = DFHRED;                                 09000000
     RCBM10AI.COUNTRY_NUMBERL = -1;                                     09010000
     WRK_COUNTRY_NUMBER       = '001';                                  09020000
     CALL RCBC10M_CLEAR_MAPA_2;                                         09030000
     CALL RCBC10M_SEND_MAPA_CSR;                                        09040000
   END;                                                                 09050000
                                                                        09060000
   IF RCB098_FLAG = FALSE THEN                                          09070000
   DO;                                                                  09080000
     RCBM10AO.MSG_LINEO =                                               09090000
                     'Parameter RCB098 is missing for this country';    09100000
     RCBM10AO.COUNTRY_NUMBERC = DFHRED;                                 09110000
     RCBM10AI.COUNTRY_NUMBERL = -1;                                     09120000
     WRK_COUNTRY_NUMBER       = '001';                                  09130000
     CALL RCBC10M_CLEAR_MAPA_2;                                         09140000
     CALL RCBC10M_SEND_MAPA_CSR;                                        09150000
   END;                                                                 09160000
                                                                        09170000
   IF ASCA_STOP_FLAG = TRUE THEN                                        09180000
   DO;                                                                  09190000
     RCBM10AO.MSG_LINEO       = ERR_O079;                               09200000
     RCBM10AO.COUNTRY_NUMBERC = DFHRED;                                 09210000
     RCBM10AI.COUNTRY_NUMBERL = -1;                                     09220000
     WRK_COUNTRY_NUMBER       = '001';                                  09230000
     CALL RCBC10M_CLEAR_MAPA_2;                                         09240000
     CALL RCBC10M_SEND_MAPA_CSR;                                        09250000
   END;                                                                 09260000
                                                                        09270000
   WRK_COUNTRY_NUMBER = RCBM10AI.COUNTRY_NUMBERI;                       09280000
 END;                                                                   09290000
                                                                        09300000
 IF RCBM10AI.TYPE_SELI ¬= '' THEN                                       09310000
 DO;                                                                    09320000
   TYPE_SEL = RCBM10AI.TYPE_SELI;                                       09330000
   TYPE_ENT = 'Y';                                                      09340000
 END;                                                                   09350000
                                                                        09360000
 IF RCBM10AI.ORIGIN_SELI ¬= '' THEN                                     09370000
 DO;                                                                    09380000
   ORIGIN_SEL = RCBM10AI.ORIGIN_SELI;                                   09390000
   ORIGIN_ENT = 'Y';                                                    09400000
 END;                                                                   09410000
                                                                        09420000
 IF RCBM10AI.SEQ_SELI ¬= '' THEN                                        09430000
 DO;                                                                    09440000
   SEQ_SEL = RCBM10AI.SEQ_SELI;                                         09450000
   SEQ_ENT = 'Y';                                                       09460000
 END;                                                                   09470000
                                                                        09480000
0END RCBC10M_VALIDATE_MAPA;                                             09490000
1/********************************************************************/ 09500000
 /*      SET MAP RCBM10A                                             */ 09510000
 /********************************************************************/ 09520000
0RCBC10M_SET_MAPA: PROC;                                                09530000
                                                                        09540000
 RCBM10AO.TYPE_SELO   = TYPE_SEL;                                       09550000
 RCBM10AO.ORIGIN_SELO = ORIGIN_SEL;                                     09560000
 RCBM10AO.SEQ_SELO    = SEQ_SEL;                                        09570000
                                                                        09580000
0END RCBC10M_SET_MAPA;                                                  09590000
1/********************************************************************/ 09600000
 /*      CHECK MAP RCBM10A                                           */ 09610000
 /********************************************************************/ 09620000
0RCBC10M_CHECK_MAPA: PROC;                                              09630000
                                                                        09640000
 M = 0;                                                                 09650000
 DO I = 1 TO 15;                                                        09660000
   IF RCBM10AO.SELO(I) = 'S' THEN                                       09670000
   DO;                                                                  09680000
     WRK_PRODUCT_TYPE     = RCBM10AI.PRODUCT_TYPEI(I);                  09690000
     WRK_ORIGIN           = RCBM10AI.ORIGINI(I);                        09700000
     WRK_SEQUENCE_NUMBER  = RCBM10AI.SEQUENCE_NUMBERI(I);               09710000
     WRK_EFFECTIVE_DATE   = RCBM10AI.EFFECTIVE_DATEI(I);                09720000
     WRK_END_DATE         = RCBM10AI.END_DATEI(I);                      09730000
     RCBM10AO.SELO(I)     = '';                                         09740000
     M = 1;                                                             09750000
                                                                        09760000
     RCBM10O.TYPEO   = WRK_PRODUCT_TYPE;                                09770000
     RCBM10O.ORIGINO = WRK_ORIGIN;                                      09780000
     RCBM10O.SEQNOO  = WRK_SEQUENCE_NUMBER;                             09790000
   END;                                                                 09800000
 END;                                                                   09810000
                                                                        09820000
 IF M = 0 THEN                                                          09830000
 DO;                                                                    09840000
   RCBM10AI.SELL(1)   = -1;                                             09850000
   RCBM10AO.MSG_LINEO = ERR_O032;                                       09860000
   CALL RCBC10M_SEND_MAPA_CSR;                                          09870000
 END;                                                                   09880000
                                                                        09890000
0END RCBC10M_CHECK_MAPA;                                                09900000
1/********************************************************************/ 09910000
 /*      GET CONTRACT SELECTION                                      */ 09920000
 /********************************************************************/ 09930000
0RCBC10M_GET_SELECTION: PROC;                                           09940000
                                                                        09950000
 CALL RCBC10M_COUNT_T240;                                               09960000
 IF WRK_REC_COUNT > 32767 THEN                                          09970000
 DO;                                                                    09980000
   RCBM10AO.MSG_LINEO =                                                 09990000
   'Please refine search criteria, too many rows retrieved';            10000000
   CALL RCBC10M_SEND_MAPA;                                              10010000
 END;                                                                   10020000
                                                                        10030000
 TS_Q = 'RC00' || EIBTRMID;                                             10040000
                                                                        10050000
 EXEC CICS IGNORE CONDITION QIDERR;                                     10060000
                                                                        10070000
 EXEC CICS DELETEQ TS QUEUE(TS_Q);                                      10080000
                                                                        10090000
 EXEC CICS HANDLE CONDITION QIDERR;                                     10100000
                                                                        10110000
 OK_FLAG = TRUE;                                                        10120000
 TS_CNT  = 0;                                                           10130000
 J       = 0;                                                           10140000
 L       = 1;                                                           10150000
 RCBM10AO.INCNTO  = '';                                                 10160000
 RCBM10AO.TOTCNTO = '';                                                 10170000
                                                                        10180000
 IF SEQ_SEL ¬= '' THEN                                                  10190000
 DO;                                                                    10200000
   TMP_SEQ = TMP_SEQB;                                                  10210000
   DO I1 = 1 TO 7;                                                      10220000
     IF SUBSTR(SEQ_SEL,I1,1) ¬= '' THEN                                 10230000
     DO;                                                                10240000
       DO I2 = 7 TO 1 BY -1;                                            10250000
         IF SUBSTR(SEQ_SEL,I2,1) ¬= '' THEN                             10260000
         DO;                                                            10270000
           I3 = I2 - I1 + 1;                                            10280000
           SUBSTR(TMP_SEQ,2,I3) = SUBSTR(SEQ_SEL,I1,I3);                10290000
           I1 = 8;                                                      10300000
           I2 = 0;                                                      10310000
         END;                                                           10320000
       END;                                                             10330000
     END;                                                               10340000
   END;                                                                 10350000
 END;                                                                   10360000
                                                                        10370000
 EXEC SQL  OPEN C_125;                                  /*SOC RB01320*/ 10380000
 SELECT(SQLCA.SQLCODE);                                                 10390000
   WHEN(0);                                                             10400000
   OTHERWISE                                                            10410000
   DO;                                                                  10420000
     RCBM10AO.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';  10430000
     CALL RCBC10M_SEND_MAPA_CSR;                                        10440000
   END;                                                                 10450000
 END;                                                                   10460000
                                                                        10470000
 DO WHILE (OK_FLAG = TRUE);                                             10480000
   T125 = '';                                                           10490000
   TS_REC = '';                                                         10500000
                                                                        10510000
   EXEC SQL  FETCH C_125                                                10520000
             INTO :T125.PRODUCT_TYPE                                    10530000
                 ,:T125.REAL_SERIAL_NUMBER                              10540000
                 ,:T125.DUMMY_ORIGIN                                    10550000
                 ,:T125.DUMMY_SEQUENCE_NUM;                             10560000
                                                                        10570000
     SELECT (SQLCA.SQLCODE);                                            10580000
     WHEN (0)                                                           10590000
      DO;                                                               10600000
       REAL_ORIGIN = SUBSTR(T125.REAL_SERIAL_NUMBER,1,2);               10610000
       REAL_SEQNO  = SUBSTR(T125.REAL_SERIAL_NUMBER,3,28);              10620000
       CALL RCBC10M_GET_T125_T240;                                      10630000
      END;                                                              10640000
     OTHERWISE                                                          10650000
      DO;                                                               10660000
       OK_FLAG = FALSE;                                                 10670000
      END;                                                              10680000
     END;                                                               10690000
 END;                                                                   10700000
                                                                        10710000
 OK_FLAG = TRUE;                                        /*EOC RB01320*/ 10720000
                                                                        10730000
 EXEC SQL  OPEN C_240;                                                  10740000
                                                                        10750000
 SELECT(SQLCA.SQLCODE);                                                 10760000
   WHEN(0);                                                             10770000
   OTHERWISE                                                            10780000
   DO;                                                                  10790000
     RCBM10AO.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';  10800000
     CALL RCBC10M_SEND_MAPA_CSR;                                        10810000
   END;                                                                 10820000
 END;                                                                   10830000
                                                                        10840000
 DO WHILE (OK_FLAG = TRUE);                                             10850000
   TS_REC = '';                                                         10860000
   EXEC SQL  FETCH C_240                                                10870000
             INTO :TS_REC.TYPE                                          10880000
   /*            ,:TS_REC.ORIGIN                          SOC RB01320*/ 10890000
   /*            ,:TS_REC.SEQNO                                      */ 10900000
                 ,:ORIGIN                                               10910000
                 ,:SEQNO                                /*EOC RB01320*/ 10920000
                 ,:TS_REC.EFFDATE                                       10930000
                 ,:TS_REC.ENDDATE;                                      10940000
                                                                        10950000
   /*IF (SQLCA.SQLCODE = 0) THEN                        /*SOC RB01320*/ 10960000
   /*DO;                                                                10970000
       EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                    10980000
       TS_CNT = TS_CNT + 1;                                             10990000
     END;                                                               11000000
                                                                        11010000
     IF (SQLCA.SQLCODE ¬= 0) THEN                                       11020000
     DO;                                                                11030000
       OK_FLAG = FALSE;                                                 11040000
     END;          */                                                   11050000
     SELECT (SQLCA.SQLCODE);                                            11060000
     WHEN (0)                                                           11070000
       CALL RCBC10M_GET_SHORT_SEQ;                                      11080000
     OTHERWISE                                                          11090000
       OK_FLAG = FALSE;                                                 11100000
     END;                                               /*EOC RB01320*/ 11110000
   END;                                                                 11120000
                                                                        11130000
 IF TS_CNT = 0 THEN                                                     11140000
 DO;                                                                    11150000
   CALL RCBC10M_CLEAR_MAPA;                                             11160000
   CALL RCBC10M_SET_MAPA;                                               11170000
                                                                        11180000
   RCBM10AI.TYPE_SELL = -1;                                             11190000
                                                /* SOC CEDS00000385 */  11200000
 /*RCBM10AO.MSG_LINEO = 'No records found for this seqrch criteria';*/  11210000
   RCBM10AO.MSG_LINEO = 'No records found for this search criteria';    11220000
                                                /* EOC CEDS00000385 */  11230000
   CALL RCBC10M_SEND_MAPA_CSR;                                          11240000
 END;                                                                   11250000
                                                                        11260000
0END RCBC10M_GET_SELECTION;                                             11270000
1/********************************************************************/ 11280000
 /*      GET SHORT SEQUENCE FROM T125                        RB01320 */ 11290000
 /********************************************************************/ 11300000
0RCBC10M_GET_SHORT_SEQ: PROC;                                           11310000
                                                                        11320000
 DCL WRK_A CHAR(01);                                                    11330000
                                                                        11340000
 EXEC SQL                                                               11350000
   SELECT 'A'                                                           11360000
   INTO :WRK_A                                                          11370000
   FROM RCBV0125_DMMY_REAL                                              11380000
   WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                       11390000
     AND PRODUCT_TYPE       = :TS_REC.TYPE                              11400000
     AND REAL_SERIAL_NUMBER = :ORIGIN || :SEQNO;                        11410000
                                                                        11420000
 SELECT (SQLCA.SQLCODE);                                                11430000
   WHEN(0);                                                             11440000
   WHEN(100)                                                            11450000
     DO;                                                                11460000
      TS_REC.ORIGIN = ORIGIN;                                           11470000
      TS_REC.SEQNO  = SEQNO;                                            11480000
      EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                     11490000
      TS_CNT = TS_CNT + 1;                                              11500000
     END;                                                               11510000
   OTHERWISE                                                            11520000
     DO;                                                                11530000
       RCBM10O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                11540000
                         || ' OCCURED ON RCBT0125';                     11550000
       CALL RCBC10M_SEND_MAP_CSR;                                       11560000
     END;                                                               11570000
 END;                                                                   11580000
                                                                        11590000
 END RCBC10M_GET_SHORT_SEQ;                                             11600000
1/********************************************************************/ 11610000
 /*      VALIDATE MAP                                                */ 11620000
 /********************************************************************/ 11630000
0RCBC10M_VALIDATE_MAP: PROC;                                            11640000
                                                                        11650000
 IF RCBM10I.TYPEL   = 0 THEN                                            11660000
   RCBM10O.TYPEO    = '';                                               11670000
 IF RCBM10I.ORIGINL = 0 THEN                                            11680000
   RCBM10O.ORIGINO  = '';                                               11690000
 IF RCBM10I.SEQNOL  = 0 THEN                                            11700000
   RCBM10O.SEQNOO   = '';                                               11710000
                                                                        11720000
 /*                                                                     11730000
 IF WRK_COUNTRY_NUMBER ¬= RCBM10I.COUNTRY_NUMBERI THEN                  11740000
 DO;                                                                    11750000
   SEL_OPT = '4';                                                       11760000
   WRK_COUNTRY_NUMBER = RCBM10I.COUNTRY_NUMBERI;                        11770000
                                                                        11780000
   EXEC CICS LINK                                                       11790000
      PROGRAM('RCBC99P')                                                11800000
      COMMAREA(COMMAREA)                                                11810000
      LENGTH(CSTG(COMMAREA));                                           11820000
                                                                        11830000
   IF CTY_OK_FLAG = FALSE THEN                                          11840000
   DO;                                                                  11850000
     RCBM10O.MSG_LINEO       = ERR_O072;                                11860000
     RCBM10I.COUNTRY_NUMBERL = -1;                                      11870000
     RCBM10O.COUNTRY_NUMBERC = DFHRED;                                  11880000
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      11890000
     CALL RCBC10M_SEND_MAP_CSR;                                         11900000
   END;                                                                 11910000
                                                                        11920000
   IF OK_FLAG = FALSE THEN                                              11930000
   DO;                                                                  11940000
     RCBM10O.MSG_LINEO       = ERR_O057;                                11950000
     RCBM10I.COUNTRY_NUMBERL = -1;                                      11960000
     RCBM10O.COUNTRY_NUMBERC = DFHRED;                                  11970000
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      11980000
     CALL RCBC10M_SEND_MAP_CSR;                                         11990000
   END;                                                                 12000000
                                                                        12010000
   IF RCB025_FLAG = FALSE THEN                                          12020000
   DO;                                                                  12030000
     RCBM10O.MSG_LINEO =                                                12040000
                     'Parameter RCB025 is missing for this country';    12050000
     RCBM10O.COUNTRY_NUMBERC = DFHRED;                                  12060000
     RCBM10I.COUNTRY_NUMBERL = -1;                                      12070000
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      12080000
     CALL RCBC10M_SEND_MAP_CSR;                                         12090000
   END;                                                                 12100000
                                                                        12110000
   IF RCB098_FLAG = FALSE THEN                                          12120000
   DO;                                                                  12130000
     RCBM10O.MSG_LINEO =                                                12140000
                     'Parameter RCB098 is missing for this country';    12150000
     RCBM10O.COUNTRY_NUMBERC = DFHRED;                                  12160000
     RCBM10I.COUNTRY_NUMBERL = -1;                                      12170000
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      12180000
     CALL RCBC10M_SEND_MAP_CSR;                                         12190000
   END;                                                                 12200000
                                                                        12210000
   IF ASCA_STOP_FLAG = TRUE THEN                                        12220000
   DO;                                                                  12230000
     RCBM10O.MSG_LINEO       = ERR_O079;                                12240000
     RCBM10O.COUNTRY_NUMBERO = '';                                      12250000
     RCBM10I.COUNTRY_NUMBERL = -1;                                      12260000
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      12270000
     CALL RCBC10M_SEND_MAP_CSR;                                         12280000
   END;                                                                 12290000
                                                                        12300000
   TMP_COUNTRY_NUMBER = RCBM10I.COUNTRY_NUMBERI;                        12310000
 END;                                                                   12320000
 */                                                                     12330000
                                                                        12340000
 IF VERIFY(RCBM10I.ACTIONI, ' 123') ¬= 0 THEN                           12350000
 DO;                                                                    12360000
   RCBM10O.MSG_LINEO = ERR_O064;                                        12370000
   RCBM10O.ACTIONC   = DFHRED;                                          12380000
   RCBM10I.ACTIONL   = -1;                                              12390000
   CALL RCBC10M_SEND_MAP_CSR;                                           12400000
 END;                                                                   12410000
                                                                        12420000
 WRK_ACTION = RCBM10I.ACTIONI;                                          12430000
                                                                        12440000
 IF (WRK_PRODUCT_TYPE    = ''                                           12450000
   & RCBM10I.TYPEI       = '')                                          12460000
  | (WRK_ORIGIN          = ''                                           12470000
   & RCBM10I.ORIGINI     = '')                                          12480000
  | (WRK_SEQUENCE_NUMBER = ''                                           12490000
   & RCBM10I.SEQNOI      = '') THEN                                     12500000
 DO;                                                                    12510000
   RCBM10O.MSG_LINEO = ERR_O051;                                        12520000
   RCBM10O.TYPEC     = DFHRED;                                          12530000
   RCBM10O.ORIGINC   = DFHRED;                                          12540000
   RCBM10O.SEQNOC    = DFHRED;                                          12550000
   RCBM10I.TYPEL     = -1;                                              12560000
   CALL RCBC10M_SEND_MAP_CSR;                                           12570000
 END;                                                                   12580000
                                                                        12590000
 WRK_PRODUCT_TYPE    = RCBM10I.TYPEI;                                   12600000
 WRK_ORIGIN          = RCBM10I.ORIGINI;                                 12610000
 WRK_SEQUENCE_NUMBER = RCBM10I.SEQNOI;                                  12620000
                                                                        12630000
 IF RCBM10I.EFFECTIVE_DATEI = '' THEN                                   12640000
 DO;                                                                    12650000
   RCBM10O.EFFECTIVE_DATEO = WRK_DATE;                                  12660000
   WRK_EFFECTIVE_DATE      = RCBM10I.EFFECTIVE_DATEI;                   12670000
 END;                                                                   12680000
                                                                        12690000
 IF RCBM10I.EFFECTIVE_DATEI ¬= WRK_EFFECTIVE_DATE THEN                  12700000
 DO;                                                                    12710000
   IF ( ¬ RCBC10M_VALID_DATE(RCBM10I.EFFECTIVE_DATEI)) THEN             12720000
   DO;                                                                  12730000
     RCBM10O.MSG_LINEO       = ERR_O002;                                12740000
     RCBM10O.EFFECTIVE_DATEC = DFHRED;                                  12750000
     RCBM10I.EFFECTIVE_DATEL = -1;                                      12760000
     CALL RCBC10M_SEND_MAP_CSR;                                         12770000
   END;                                                                 12780000
 END;                                                                   12790000
                                                                        12800000
 WRK_EFFECTIVE_DATE = RCBM10I.EFFECTIVE_DATEI;                          12810000
                                                                        12820000
 IF RCBM10I.END_DATEI = '' THEN                                         12830000
 DO;                                                                    12840000
   WRK_END_DATE      = WRK_HORIZON_DATE;                                12850000
   RCBM10I.END_DATEI = WRK_HORIZON_DATE;                                12860000
 END;                                                                   12870000
                                                                        12880000
 IF RCBM10I.END_DATEI ¬= WRK_END_DATE THEN                              12890000
 DO;                                                                    12900000
   IF ( ¬ RCBC10M_VALID_DATE(RCBM10I.END_DATEI)) THEN                   12910000
   DO;                                                                  12920000
     RCBM10O.MSG_LINEO = ERR_O002;                                      12930000
     RCBM10O.END_DATEC = DFHRED;                                        12940000
     RCBM10I.END_DATEL = -1;                                            12950000
     CALL RCBC10M_SEND_MAP_CSR;                                         12960000
   END;                                                                 12970000
 END;                                                                   12980000
                                                                        12990000
 WRK_END_DATE = RCBM10I.END_DATEI;                                      13000000
                                                                        13010000
 IF WRK_ACTION ¬= '1' THEN                                              13020000
 DO;                                                                    13030000
   CALL RCBC10M_GET_CONTRACT;                                           13040000
 END;                                                                   13050000
                                                                        13060000
0END RCBC10M_VALIDATE_MAP;                                              13070000
1/********************************************************************/ 13080000
 /*      GET CUSTOMER DETAILS                                        */ 13090000
 /********************************************************************/ 13100000
0RCBC10M_GET_CONTRACT: PROC;                                            13110000
                                                                        13120000
 CALL RCBC10M_CHECK_T125;                                   /*RB01320*/ 13130000
                                                                        13140000
 EXEC SQL                                                               13150000
   SELECT SERVICE_MODULE_1                                              13160000
         ,SERVICE_MODULE_2                                              13170000
         ,SERVICE_MODULE_3                                              13180000
         ,SERVICE_MODULE_4                                              13190000
         ,SERVICE_MODULE_5                                              13200000
         ,AGREEMENT_TYPE                                                13210000
         ,AGREEMENT_OPTION                                              13220000
         ,COVERAGE_START_1                                              13230000
         ,COVERAGE_END_1                                                13240000
         ,COVERAGE_START_2                                              13250000
         ,COVERAGE_END_2                                                13260000
         ,COVERAGE_START_3                                              13270000
         ,COVERAGE_END_3                                                13280000
         ,COVERAGE_START_4                                              13290000
         ,COVERAGE_END_4                                                13300000
         ,COVERAGE_START_5                                              13310000
         ,COVERAGE_END_5                                                13320000
         ,COVERAGE_START_6                                              13330000
         ,COVERAGE_END_6                                                13340000
         ,COVERAGE_START_7                                              13350000
         ,COVERAGE_END_7                                                13360000
         ,SERVICE_TYPE                                                  13370000
         ,SERVICE_LVL_CODE                                              13380000
         ,EFFECTIVE_DATE                                                13390000
         ,END_DATE                                                      13400000
   INTO :WRK_SERVICE_MODULE_1    :NUL240J                               13410000
       ,:WRK_SERVICE_MODULE_2    :NUL240K                               13420000
       ,:WRK_SERVICE_MODULE_3    :NUL240L                               13430000
       ,:WRK_SERVICE_MODULE_4    :NUL240M                               13440000
       ,:WRK_SERVICE_MODULE_5    :NUL240N                               13450000
       ,:WRK_AGREEMENT_TYPE      :NUL240O                               13460000
       ,:WRK_AGREEMENT_OPTION    :NUL240P                               13470000
       ,:WRK_COVERAGE_START_1    :NUL240S                               13480000
       ,:WRK_COVERAGE_END_1      :NUL240T                               13490000
       ,:WRK_COVERAGE_START_2    :NUL240U                               13500000
       ,:WRK_COVERAGE_END_2      :NUL240V                               13510000
       ,:WRK_COVERAGE_START_3    :NUL240W                               13520000
       ,:WRK_COVERAGE_END_3      :NUL240X                               13530000
       ,:WRK_COVERAGE_START_4    :NUL240Y                               13540000
       ,:WRK_COVERAGE_END_4      :NUL240Z                               13550000
       ,:WRK_COVERAGE_START_5    :NUL2400                               13560000
       ,:WRK_COVERAGE_END_5      :NUL2401                               13570000
       ,:WRK_COVERAGE_START_6    :NUL2402                               13580000
       ,:WRK_COVERAGE_END_6      :NUL2403                               13590000
       ,:WRK_COVERAGE_START_7    :NUL2404                               13600000
       ,:WRK_COVERAGE_END_7      :NUL2405                               13610000
       ,:WRK_SERVICE_TYPE        :NUL2406                               13620000
       ,:WRK_SERVICE_LVL_CODE    :NUL2407                               13630000
       ,:WRK_EFFECTIVE_DATE      :NUL24010                              13640000
       ,:WRK_END_DATE            :NUL24011                              13650000
   FROM RCBV0240_SERV_CTR                                               13660000
   WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                       13670000
     AND PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                         13680000
     AND ORIGIN             = :WRK_ORIGIN                               13690000
     AND SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER                      13700000
     AND SOURCE_INDICATOR   = :WRK_O                                    13710000
     AND EFFECTIVE_DATE    <= :WRK_EFFECTIVE_DATE                       13720000
     AND END_DATE          >= :WRK_END_DATE;                            13730000
                                                                        13740000
 SELECT(SQLCA.SQLCODE);                                                 13750000
   WHEN(0)                                                              13760000
   DO;                                                                  13770000
     IF WRK_ACTION = '1' THEN                                           13780000
     DO;                                                                13790000
       RCBM10O.MSG_LINEO = ERR_O116;                                    13800000
       RCBM10O.TYPEC     = DFHRED;                                      13810000
       RCBM10O.ORIGINC   = DFHRED;                                      13820000
       RCBM10O.SEQNOC    = DFHRED;                                      13830000
       RCBM10I.TYPEL     = -1;                                          13840000
       CALL RCBC10M_SEND_MAP_CSR;                                       13850000
     END;                                                               13860000
                                                                        13870000
     IF NUL240J ¬= -1 THEN                                              13880000
       WRK_SERVICE_MODULE_1      = '';                                  13890000
                                                                        13900000
     IF NUL240K ¬= -1 THEN                                              13910000
       WRK_SERVICE_MODULE_2      = '';                                  13920000
                                                                        13930000
     IF NUL240K ¬= -1 THEN                                              13940000
       WRK_SERVICE_MODULE_3      = '';                                  13950000
                                                                        13960000
     IF NUL240M ¬= -1 THEN                                              13970000
       WRK_SERVICE_MODULE_4      = '';                                  13980000
                                                                        13990000
     IF NUL240N ¬= -1 THEN                                              14000000
       WRK_SERVICE_MODULE_5      = '';                                  14010000
                                                                        14020000
     IF NUL240O ¬= -1 THEN                                              14030000
       RCBM10O.AGREEMENT_TYPEO = WRK_AGREEMENT_TYPE;                    14040000
     ELSE DO;                                                           14050000
       RCBM10O.AGREEMENT_TYPEO = '';                                    14060000
       WRK_AGREEMENT_TYPE      = '';                                    14070000
     END;                                                               14080000
                                                                        14090000
     IF NUL240P ¬= -1 THEN                                              14100000
       RCBM10O.AGREEMENT_OPTIONO = WRK_AGREEMENT_OPTION;                14110000
     ELSE DO;                                                           14120000
       RCBM10O.AGREEMENT_OPTIONO = '';                                  14130000
       WRK_AGREEMENT_OPTION      = '';                                  14140000
     END;                                                               14150000
                                                                        14160000
     IF NUL240S ¬= -1 THEN                                              14170000
       RCBM10O.COVERAGE_START_1O = WRK_COVERAGE_START_1;                14180000
     ELSE DO;                                                           14190000
       RCBM10O.COVERAGE_START_1O = '';                                  14200000
       WRK_COVERAGE_START_1      = '';                                  14210000
     END;                                                               14220000
                                                                        14230000
     IF NUL240T ¬= -1 THEN                                              14240000
       RCBM10O.COVERAGE_END_1O = WRK_COVERAGE_END_1;                    14250000
     ELSE DO;                                                           14260000
       RCBM10O.COVERAGE_END_1O = '';                                    14270000
       WRK_COVERAGE_END_1      = '';                                    14280000
     END;                                                               14290000
                                                                        14300000
     IF NUL240U ¬= -1 THEN                                              14310000
       RCBM10O.COVERAGE_START_2O = WRK_COVERAGE_START_2;                14320000
     ELSE DO;                                                           14330000
       RCBM10O.COVERAGE_START_2O = '';                                  14340000
       WRK_COVERAGE_START_2      = '';                                  14350000
     END;                                                               14360000
                                                                        14370000
     IF NUL240V ¬= -1 THEN                                              14380000
       RCBM10O.COVERAGE_END_2O = WRK_COVERAGE_END_2;                    14390000
     ELSE DO;                                                           14400000
       RCBM10O.COVERAGE_END_2O = '';                                    14410000
       WRK_COVERAGE_END_2      = '';                                    14420000
     END;                                                               14430000
                                                                        14440000
     IF NUL240W ¬= -1 THEN                                              14450000
       RCBM10O.COVERAGE_START_3O = WRK_COVERAGE_START_3;                14460000
     ELSE DO;                                                           14470000
       RCBM10O.COVERAGE_START_3O = '';                                  14480000
       WRK_COVERAGE_START_3      = '';                                  14490000
     END;                                                               14500000
                                                                        14510000
     IF NUL240X ¬= -1 THEN                                              14520000
       RCBM10O.COVERAGE_END_3O = WRK_COVERAGE_END_3;                    14530000
     ELSE DO;                                                           14540000
       RCBM10O.COVERAGE_END_3O = '';                                    14550000
       WRK_COVERAGE_END_3      = '';                                    14560000
     END;                                                               14570000
                                                                        14580000
     IF NUL240Y ¬= -1 THEN                                              14590000
       RCBM10O.COVERAGE_START_4O = WRK_COVERAGE_START_4;                14600000
     ELSE DO;                                                           14610000
       RCBM10O.COVERAGE_START_4O = '';                                  14620000
       WRK_COVERAGE_START_4      = '';                                  14630000
     END;                                                               14640000
                                                                        14650000
     IF NUL240Z ¬= -1 THEN                                              14660000
       RCBM10O.COVERAGE_END_4O = WRK_COVERAGE_END_4;                    14670000
     ELSE DO;                                                           14680000
       RCBM10O.COVERAGE_END_4O = '';                                    14690000
       WRK_COVERAGE_END_4      = '';                                    14700000
     END;                                                               14710000
                                                                        14720000
     IF NUL2400 ¬= -1 THEN                                              14730000
       RCBM10O.COVERAGE_START_5O = WRK_COVERAGE_START_5;                14740000
     ELSE DO;                                                           14750000
       RCBM10O.COVERAGE_START_5O = '';                                  14760000
       WRK_COVERAGE_START_5      = '';                                  14770000
     END;                                                               14780000
                                                                        14790000
     IF NUL2401 ¬= -1 THEN                                              14800000
       RCBM10O.COVERAGE_END_5O = WRK_COVERAGE_END_5;                    14810000
     ELSE DO;                                                           14820000
       RCBM10O.COVERAGE_END_5O = '';                                    14830000
       WRK_COVERAGE_END_5      = '';                                    14840000
     END;                                                               14850000
                                                                        14860000
     IF NUL2402 ¬= -1 THEN                                              14870000
       RCBM10O.COVERAGE_START_6O = WRK_COVERAGE_START_6;                14880000
     ELSE DO;                                                           14890000
       RCBM10O.COVERAGE_START_6O = '';                                  14900000
       WRK_COVERAGE_START_6      = '';                                  14910000
     END;                                                               14920000
                                                                        14930000
     IF NUL2403 ¬= -1 THEN                                              14940000
       RCBM10O.COVERAGE_END_6O = WRK_COVERAGE_END_6;                    14950000
     ELSE DO;                                                           14960000
       RCBM10O.COVERAGE_END_6O = '';                                    14970000
       WRK_COVERAGE_END_6      = '';                                    14980000
     END;                                                               14990000
                                                                        15000000
     IF NUL2404 ¬= -1 THEN                                              15010000
       RCBM10O.COVERAGE_START_7O = WRK_COVERAGE_START_7;                15020000
     ELSE DO;                                                           15030000
       RCBM10O.COVERAGE_START_7O = '';                                  15040000
       WRK_COVERAGE_START_7      = '';                                  15050000
     END;                                                               15060000
                                                                        15070000
     IF NUL2405 ¬= -1 THEN                                              15080000
       RCBM10O.COVERAGE_END_7O = WRK_COVERAGE_END_7;                    15090000
     ELSE DO;                                                           15100000
       RCBM10O.COVERAGE_END_7O = '';                                    15110000
       WRK_COVERAGE_END_7      = '';                                    15120000
     END;                                                               15130000
                                                                        15140000
     IF NUL2406 ¬= -1 THEN                                              15150000
       RCBM10O.SERVICE_TYPEO = WRK_SERVICE_TYPE;                        15160000
     ELSE DO;                                                           15170000
       RCBM10O.SERVICE_TYPEO = '';                                      15180000
       WRK_SERVICE_TYPE      = '';                                      15190000
     END;                                                               15200000
                                                                        15210000
     IF NUL2407 ¬= -1 THEN                                              15220000
       RCBM10O.SERVICE_LVL_CODEO = WRK_SERVICE_LVL_CODE;                15230000
     ELSE DO;                                                           15240000
       RCBM10O.SERVICE_LVL_CODEO = '';                                  15250000
       WRK_SERVICE_LVL_CODE      = '';                                  15260000
     END;                                                               15270000
                                                                        15280000
     IF NUL24010 ¬= -1 THEN                                             15290000
       RCBM10O.EFFECTIVE_DATEO = WRK_EFFECTIVE_DATE;                    15300000
     ELSE DO;                                                           15310000
       RCBM10O.EFFECTIVE_DATEO = '';                                    15320000
       WRK_EFFECTIVE_DATE      = '';                                    15330000
     END;                                                               15340000
                                                                        15350000
     IF NUL24011 ¬= -1 THEN                                             15360000
       RCBM10O.END_DATEO = WRK_END_DATE;                                15370000
     ELSE DO;                                                           15380000
       RCBM10O.END_DATEO = '';                                          15390000
       WRK_END_DATE      = '';                                          15400000
     END;                                                               15410000
   END;                                                                 15420000
                                                                        15430000
   WHEN(100)                                                            15440000
   DO;                                                                  15450000
     IF WRK_ACTION ¬= '1' THEN                                          15460000
     DO;                                                                15470000
       WRK_PRODUCT_TYPE  = ' ';                        /*CEDS00000737*/ 15480000
       WRK_ORIGIN        = ' ';                        /*CEDS00000737*/ 15490000
       WRK_SEQUENCE_NUMBER=' ';                        /*CEDS00000737*/ 15500000
       RCBM10O.MSG_LINEO = ERR_O037;                                    15510000
       RCBM10O.TYPEC     = DFHRED;                                      15520000
       RCBM10I.TYPEL     = -1;                                          15530000
       CALL RCBC10M_SEND_MAP_CSR;                                       15540000
     END;                                                               15550000
   END;                                                                 15560000
                                                                        15570000
   OTHERWISE                                                            15580000
   DO;                                                                  15590000
     RCBM10O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE || ' OCCURED';   15600000
     CALL RCBC10M_SEND_MAP;                                             15610000
   END;                                                                 15620000
 END;                                                                   15630000
                                                                        15640000
 IF T125_FND_FLAG = TRUE THEN                           /*SOC RB01320*/ 15650000
 DO;                                                                    15660000
    WRK_ORIGIN          = DUMMY_ORIGIN;                                 15670000
    WRK_SEQUENCE_NUMBER = DUMMY_SEQUENCE ;                              15680000
 END;                                                   /*EOC RB01320*/ 15690000
                                                                        15700000
0END RCBC10M_GET_CONTRACT;                                              15710000
1/********************************************************************/ 15720000
 /*      PROCESS ACTION REQUEST                                      */ 15730000
 /********************************************************************/ 15740000
0RCBC10M_ACTION_PROCESS: PROC;                                          15750000
                                                                        15760000
 CALL RCBC10M_CHECK_T125;                                   /*RB01320*/ 15770000
                                                                        15780000
 SELECT(RCBM10I.ACTIONI);                                               15790000
   WHEN('1')                          /* DEFINE */                      15800000
   DO;                                                                  15810000
     CALL RCBC10M_UPDATE_CHECK;                                         15820000
     CALL RCBC10M_INT_T220;                            /* RC01347 */    15830000
     CALL RCBC10M_INT_T240;                                             15840000
     CALL RCBC10M_UPD_T560;                                             15850000
     UPD_OK_FLAG = TRUE;                                                15860000
     RCBM10O.MSG_LINEO = 'TOS DEFINED';                                 15870000
     IF T125_FND_FLAG = TRUE THEN                       /*SOC RB01320*/ 15880000
     DO;                                                                15890000
      WRK_ORIGIN          = DUMMY_ORIGIN;                               15900000
      WRK_SEQUENCE_NUMBER = DUMMY_SEQUENCE ;                            15910000
     END;                                               /*EOC RB01320*/ 15920000
     CALL RCBC10M_CLEAR_WORK;                                           15930000
     CALL RCBC10M_FILL_MAP;                                             15940000
     CALL RCBC10M_SEND_MAP;                                             15950000
   END;                                                                 15960000
                                                                        15970000
   WHEN('2')                          /* UPDATE */                      15980000
   DO;                                                                  15990000
     CALL RCBC10M_UPDATE_CHECK;                                         16000000
     IF DATE_UPD_FLAG = FALSE THEN                                      16010000
     DO;                                                                16020000
     /*CALL RCBC10M_INT_T220; */      /*CEDS00000737*/ /* RC01347 */    16030000
       CALL RCBC10M_UPDATE_T240;                                        16040000
       CALL RCBC10M_UPDATE_T220;      /*CEDS00000737*/                  16050000
     END;                                                               16060000
     ELSE DO;                                                           16070000
       CALL RCBC10M_DELETE_T240;                                        16080000
       CALL RCBC10M_INT_T240;                                           16090000
       CALL RCBC10M_DELETE_T220;                   /*CEDS00000737*/     16100000
       CALL RCBC10M_INT_T220;                          /* RC01347 */    16110000
       CALL RCBC10M_FUT_DELETE_T220;            /*SOC CEDS00000737*/    16120000
       CALL RCBC10M_INSERT_SP;                  /*EOC CEDS00000737*/    16130000
     END;                                                               16140000
     CALL RCBC10M_UPD_T560;                                             16150000
     UPD_OK_FLAG = TRUE;                                                16160000
     RCBM10O.MSG_LINEO = 'TOS UPDATED';                                 16170000
     IF T125_FND_FLAG = TRUE THEN                       /*SOC RB01320*/ 16180000
     DO;                                                                16190000
      WRK_ORIGIN          = DUMMY_ORIGIN;                               16200000
      WRK_SEQUENCE_NUMBER = DUMMY_SEQUENCE ;                            16210000
     END;                                               /*EOC RB01320*/ 16220000
     CALL RCBC10M_CLEAR_WORK;                                           16230000
     CALL RCBC10M_FILL_MAP;                                             16240000
     CALL RCBC10M_SEND_MAP;                                             16250000
   END;                                                                 16260000
                                                                        16270000
   WHEN('3')                          /* DELETE */                      16280000
   DO;                                                                  16290000
     IF PF5_FLAG = FALSE THEN                                           16300000
     DO;                                                                16310000
       RCBM10O.MSG_LINEO = ERR_O022;                                    16320000
       CALL RCBC10M_SEND_MAP;                                           16330000
     END;                                                               16340000
     ELSE DO;                                                           16350000
      IF WRK_END_DATE >= WRK_DATE THEN               /* SOC RC01360 */  16351072
      DO;                                            /* EOC RC01360 */  16352000
       CALL RCBC10M_GET_T220_2;                                         16353071
       /*CALL RCBC10M_INT_T220;*/                    /* SOC RC01360 */  16370000
       /*CALL RCBC10M_DELETE_T240;*/                 /* EOC RC01360 */  16380000
       /*CALL RCBC10M_DELETE_T220;*/   /* CEDS00000713  *//* RC01347 */ 16390000
                                                 /* SOC CEDS00000813 */ 16390179
             /* ACTIVE RECORDS EFFECTIVE FROM CURRENT DATE(RUN DATE) */ 16390279
        IF WRK_EFFECTIVE_DTE = WRK_DATE THEN                            16390379
        DO;                                                             16390472
         RCBM10O.MSG_LINEO = ERR_O143;                                  16390572
         CALL RCBC10M_SEND_MAP;                                         16390672
        END;                                                            16390772
                                                  /* FUTURE CONTRACT */ 16390879
        IF RCBM10I.EFFECTIVE_DATEI > WRK_DATE THEN                      16390973
        DO;                                                             16391072
         RCBM10O.MSG_LINEO = ERR_O144;                                  16391172
         CALL RCBC10M_SEND_MAP;                                         16391272
        END;                                     /* EOC CEDS00000813 */ 16391379
       CALL RCBC10M_MIN_ONE_DAY (WRK_DATE,           /* SOC RC01360 */  16391471
                                 DATE1);                                16392071
       CALL RCBC10M_LOGICAL_DELETE_T240;                                16392264
       CALL RCBC10M_LOGICAL_DELETE_T220;                                16392364
       RCB220S.END_DATE  = RCBM10I.END_DATEI;                           16392464
       CALL RCBC10M_FUT_DELETE_T220;                                    16392564
       CALL RCBC10M_MIN_ONE_DAY (WRK_DATE,                              16392664
                                 RCBM10I.END_DATEI);                    16392764
                                                                        16393200
       CALL RCBC10M_INSERT_SP;                       /* EOC RC01360 */  16394000
       CALL RCBC10M_UPD_T560;                                           16400000
       UPD_OK_FLAG = TRUE;                                              16410000
       RCBM10O.MSG_LINEO = 'TOS DELETED';                               16420000
       IF T125_FND_FLAG = TRUE THEN                     /*SOC RB01320*/ 16430000
       DO;                                                              16440000
        WRK_ORIGIN          = DUMMY_ORIGIN;                             16450000
        WRK_SEQUENCE_NUMBER = DUMMY_SEQUENCE ;                          16460000
       END;                                             /*EOC RB01320*/ 16470000
       CALL RCBC10M_CLEAR_WORK;                                         16480000
       CALL RCBC10M_FILL_MAP;                                           16490000
       CALL RCBC10M_SEND_MAP;                                           16500000
      END;                                           /* SOC RC01360 */  16500274
      ELSE DO;                                                          16500374
       RCBM10O.MSG_LINEO = 'Inactive contract cannot be deleted';       16502000
       RCBM10O.TYPEC     = DFHRED;                                      16503000
       RCBM10I.TYPEL     = -1;                                          16504000
       CALL RCBC10M_SEND_MAP_CSR;                                       16505000
      END;                                           /* EOC RC01360 */  16506000
     END;                                                               16510000
   END;                                                                 16520000
                                                                        16530000
   OTHERWISE                                                            16540000
   DO;                                                                  16550000
     RCBM10O.MSG_LINEO = ERR_O064;                                      16560000
     RCBM10O.ACTIONC   = DFHRED;                                        16570000
     RCBM10I.ACTIONL   = -1;                                            16580000
     CALL RCBC10M_SEND_MAP_CSR;                                         16590000
   END;                                                                 16600000
 END;                                                                   16610000
                                                                        16620000
0END RCBC10M_ACTION_PROCESS;                                            16630000
1/********************************************************************/ 16640000
 /*      UPDATE REQUESTED                                            */ 16650000
 /********************************************************************/ 16660000
0RCBC10M_UPDATE_CHECK: PROC;                                            16670000
                                                                        16680000
 IF RCBM10I.TYPEL             = 0 THEN                                  16690000
   RCBM10O.TYPEO              = '';                                     16700000
 IF RCBM10I.ORIGINL           = 0 THEN                                  16710000
   RCBM10O.ORIGINO            = '';                                     16720000
 IF RCBM10I.SEQNOL            = 0 THEN                                  16730000
   RCBM10O.SEQNOO             = '';                                     16740000
 IF RCBM10I.EFFECTIVE_DATEL   = 0 THEN                                  16750000
   RCBM10O.EFFECTIVE_DATEO    = '';                                     16760000
 IF RCBM10I.END_DATEL         = 0 THEN                                  16770000
   RCBM10O.END_DATEO          = '';                                     16780000
 IF RCBM10I.AGREEMENT_TYPEL   = 0 THEN                                  16790000
   RCBM10O.AGREEMENT_TYPEO    = '';                                     16800000
 IF RCBM10I.AGREEMENT_OPTIONL = 0 THEN                                  16810000
   RCBM10O.AGREEMENT_OPTIONO  = '';                                     16820000
 IF RCBM10I.SERVICE_TYPEL     = 0 THEN                                  16830000
   RCBM10O.SERVICE_TYPEO      = '';                                     16840000
 IF RCBM10I.SERVICE_LVL_CODEL = 0 THEN                                  16850000
   RCBM10O.SERVICE_LVL_CODEO  = '';                                     16860000
 IF RCBM10I.COVERAGE_START_1L = 0 THEN                                  16870000
   RCBM10O.COVERAGE_START_1O  = '00.00';                                16880000
 IF RCBM10I.COVERAGE_END_1L   = 0 THEN                                  16890000
   RCBM10O.COVERAGE_END_1O    = '00.00';                                16900000
 IF RCBM10I.COVERAGE_START_2L = 0 THEN                                  16910000
   RCBM10O.COVERAGE_START_2O  = '00.00';                                16920000
 IF RCBM10I.COVERAGE_END_2L   = 0 THEN                                  16930000
   RCBM10O.COVERAGE_END_2O    = '00.00';                                16940000
 IF RCBM10I.COVERAGE_START_3L = 0 THEN                                  16950000
   RCBM10O.COVERAGE_START_3O  = '00.00';                                16960000
 IF RCBM10I.COVERAGE_END_3L   = 0 THEN                                  16970000
   RCBM10O.COVERAGE_END_3O    = '00.00';                                16980000
 IF RCBM10I.COVERAGE_START_4L = 0 THEN                                  16990000
   RCBM10O.COVERAGE_START_4O  = '00.00';                                17000000
 IF RCBM10I.COVERAGE_END_4L   = 0 THEN                                  17010000
   RCBM10O.COVERAGE_END_4O    = '00.00';                                17020000
 IF RCBM10I.COVERAGE_START_5L = 0 THEN                                  17030000
   RCBM10O.COVERAGE_START_5O  = '00.00';                                17040000
 IF RCBM10I.COVERAGE_END_5L   = 0 THEN                                  17050000
   RCBM10O.COVERAGE_END_5O    = '00.00';                                17060000
 IF RCBM10I.COVERAGE_START_6L = 0 THEN                                  17070000
   RCBM10O.COVERAGE_START_6O  = '00.00';                                17080000
 IF RCBM10I.COVERAGE_END_6L   = 0 THEN                                  17090000
   RCBM10O.COVERAGE_END_6O    = '00.00';                                17100000
 IF RCBM10I.COVERAGE_START_7L = 0 THEN                                  17110000
   RCBM10O.COVERAGE_START_7O  = '00.00';                                17120000
 IF RCBM10I.COVERAGE_END_7L   = 0 THEN                                  17130000
   RCBM10O.COVERAGE_END_7O    = '00.00';                                17140000
                                                                        17150000
 T240_UPD_FLAG = FALSE;                                                 17160000
 DATE_UPD_FLAG = FALSE;                                                 17170000
 ERROR_FLAG    = FALSE;                                                 17180000
                                                                        17190000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_END_7I)) THEN               17200000
 DO;                                                                    17210000
   RCBM10O.MSG_LINEO       = ERR_O006;                                  17220000
   RCBM10O.COVERAGE_END_7C = DFHRED;                                    17230000
   RCBM10I.COVERAGE_END_7L = -1;                                        17240000
   ERROR_FLAG = TRUE;                                                   17250000
 END;                                                                   17260000
                                                                        17270000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_END_6I)) THEN               17280000
 DO;                                                                    17290000
   RCBM10O.MSG_LINEO       = ERR_O006;                                  17300000
   RCBM10O.COVERAGE_END_6C = DFHRED;                                    17310000
   RCBM10I.COVERAGE_END_6L = -1;                                        17320000
   ERROR_FLAG = TRUE;                                                   17330000
 END;                                                                   17340000
                                                                        17350000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_END_5I)) THEN               17360000
 DO;                                                                    17370000
   RCBM10O.MSG_LINEO       = ERR_O006;                                  17380000
   RCBM10O.COVERAGE_END_5C = DFHRED;                                    17390000
   RCBM10I.COVERAGE_END_5L = -1;                                        17400000
   ERROR_FLAG = TRUE;                                                   17410000
 END;                                                                   17420000
                                                                        17430000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_END_4I)) THEN               17440000
 DO;                                                                    17450000
   RCBM10O.MSG_LINEO       = ERR_O006;                                  17460000
   RCBM10O.COVERAGE_END_4C = DFHRED;                                    17470000
   RCBM10I.COVERAGE_END_4L = -1;                                        17480000
   ERROR_FLAG = TRUE;                                                   17490000
 END;                                                                   17500000
                                                                        17510000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_END_3I)) THEN               17520000
 DO;                                                                    17530000
   RCBM10O.MSG_LINEO       = ERR_O006;                                  17540000
   RCBM10O.COVERAGE_END_3C = DFHRED;                                    17550000
   RCBM10I.COVERAGE_END_3L = -1;                                        17560000
   ERROR_FLAG = TRUE;                                                   17570000
 END;                                                                   17580000
                                                                        17590000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_END_2I)) THEN               17600000
 DO;                                                                    17610000
   RCBM10O.MSG_LINEO       = ERR_O006;                                  17620000
   RCBM10O.COVERAGE_END_2C = DFHRED;                                    17630000
   RCBM10I.COVERAGE_END_2L = -1;                                        17640000
   ERROR_FLAG = TRUE;                                                   17650000
 END;                                                                   17660000
                                                                        17670000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_END_1I)) THEN               17680000
 DO;                                                                    17690000
   RCBM10O.MSG_LINEO       = ERR_O006;                                  17700000
   RCBM10O.COVERAGE_END_1C = DFHRED;                                    17710000
   RCBM10I.COVERAGE_END_1L = -1;                                        17720000
   ERROR_FLAG = TRUE;                                                   17730000
 END;                                                                   17740000
                                                                        17750000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_START_7I)) THEN             17760000
 DO;                                                                    17770000
   RCBM10O.MSG_LINEO         = ERR_O006;                                17780000
   RCBM10O.COVERAGE_START_7C = DFHRED;                                  17790000
   RCBM10I.COVERAGE_START_7L = -1;                                      17800000
   ERROR_FLAG = TRUE;                                                   17810000
 END;                                                                   17820000
                                                                        17830000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_START_6I)) THEN             17840000
 DO;                                                                    17850000
   RCBM10O.MSG_LINEO         = ERR_O006;                                17860000
   RCBM10O.COVERAGE_START_6C = DFHRED;                                  17870000
   RCBM10I.COVERAGE_START_6L = -1;                                      17880000
   ERROR_FLAG = TRUE;                                                   17890000
 END;                                                                   17900000
                                                                        17910000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_START_5I)) THEN             17920000
 DO;                                                                    17930000
   RCBM10O.MSG_LINEO         = ERR_O006;                                17940000
   RCBM10O.COVERAGE_START_5C = DFHRED;                                  17950000
   RCBM10I.COVERAGE_START_5L = -1;                                      17960000
   ERROR_FLAG = TRUE;                                                   17970000
 END;                                                                   17980000
                                                                        17990000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_START_4I)) THEN             18000000
 DO;                                                                    18010000
   RCBM10O.MSG_LINEO         = ERR_O006;                                18020000
   RCBM10O.COVERAGE_START_4C = DFHRED;                                  18030000
   RCBM10I.COVERAGE_START_4L = -1;                                      18040000
   ERROR_FLAG = TRUE;                                                   18050000
 END;                                                                   18060000
                                                                        18070000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_START_3I)) THEN             18080000
 DO;                                                                    18090000
   RCBM10O.MSG_LINEO         = ERR_O006;                                18100000
   RCBM10O.COVERAGE_START_3C = DFHRED;                                  18110000
   RCBM10I.COVERAGE_START_3L = -1;                                      18120000
   ERROR_FLAG = TRUE;                                                   18130000
 END;                                                                   18140000
                                                                        18150000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_START_2I)) THEN             18160000
 DO;                                                                    18170000
   RCBM10O.MSG_LINEO         = ERR_O006;                                18180000
   RCBM10O.COVERAGE_START_2C = DFHRED;                                  18190000
   RCBM10I.COVERAGE_START_2L = -1;                                      18200000
   ERROR_FLAG = TRUE;                                                   18210000
 END;                                                                   18220000
                                                                        18230000
 IF ( ¬ RCBC10M_VALID_TIME(RCBM10I.COVERAGE_START_1I)) THEN             18240000
 DO;                                                                    18250000
   RCBM10O.MSG_LINEO         = ERR_O006;                                18260000
   RCBM10O.COVERAGE_START_1C = DFHRED;                                  18270000
   RCBM10I.COVERAGE_START_1L = -1;                                      18280000
   ERROR_FLAG = TRUE;                                                   18290000
 END;                                                                   18300000
                                                                        18310000
 IF RCBM10I.COVERAGE_START_7I ¬= WRK_COVERAGE_START_7                   18320000
  | RCBM10I.COVERAGE_END_7I   ¬= WRK_COVERAGE_END_7 THEN                18330000
 DO;                                                                    18340000
   IF RCBM10I.COVERAGE_END_7I < RCBM10I.COVERAGE_START_7I THEN          18350000
   DO;                                                                  18360000
  /* RCBM10O.MSG_LINEO           = ERR_O002;*/          /*CEDS00000428*/18370000
     RCBM10O.MSG_LINEO           = ERR_O011;            /*CEDS00000428*/18380000
     RCBM10O.COVERAGE_END_7C   = DFHRED;                                18390000
     RCBM10O.COVERAGE_START_7C = DFHRED;                                18400000
     RCBM10I.COVERAGE_START_7L = -1;                                    18410000
     ERROR_FLAG = TRUE;                                                 18420000
   END;                                                                 18430000
   IF RCBM10I.COVERAGE_START_7I = ''                                    18440000
    & RCBM10I.COVERAGE_END_7I  ¬= '' THEN                               18450000
   DO;                                                                  18460000
     RCBM10O.MSG_LINEO         = ERR_O081;                              18470000
     RCBM10O.COVERAGE_START_7C = DFHRED;                                18480000
     RCBM10I.COVERAGE_START_7L = -1;                                    18490000
     ERROR_FLAG = TRUE;                                                 18500000
   END;                                                                 18510000
   IF RCBM10I.COVERAGE_START_7I ¬= ''                                   18520000
    & RCBM10I.COVERAGE_END_7I    = '' THEN                              18530000
   DO;                                                                  18540000
     RCBM10O.MSG_LINEO         = ERR_O080;                              18550000
     RCBM10O.COVERAGE_START_7C = DFHRED;                                18560000
     RCBM10I.COVERAGE_START_7L = -1;                                    18570000
     ERROR_FLAG = TRUE;                                                 18580000
   END;                                                                 18590000
   T240_UPD_FLAG = TRUE;                                                18600000
 END;                                                                   18610000
                                                                        18620000
 IF RCBM10I.COVERAGE_START_6I ¬= WRK_COVERAGE_START_6                   18630000
  | RCBM10I.COVERAGE_END_6I   ¬= WRK_COVERAGE_END_6 THEN                18640000
 DO;                                                                    18650000
   IF RCBM10I.COVERAGE_END_6I < RCBM10I.COVERAGE_START_6I THEN          18660000
   DO;                                                                  18670000
  /* RCBM10O.MSG_LINEO           = ERR_O002;*/          /*CEDS00000428*/18680000
     RCBM10O.MSG_LINEO           = ERR_O011;            /*CEDS00000428*/18690000
     RCBM10O.COVERAGE_END_6C   = DFHRED;                                18700000
     RCBM10O.COVERAGE_START_6C = DFHRED;                                18710000
     RCBM10I.COVERAGE_START_6L = -1;                                    18720000
     ERROR_FLAG = TRUE;                                                 18730000
   END;                                                                 18740000
   IF RCBM10I.COVERAGE_START_6I = ''                                    18750000
    & RCBM10I.COVERAGE_END_6I  ¬= '' THEN                               18760000
   DO;                                                                  18770000
     RCBM10O.MSG_LINEO         = ERR_O081;                              18780000
     RCBM10O.COVERAGE_START_6C = DFHRED;                                18790000
     RCBM10I.COVERAGE_START_6L = -1;                                    18800000
     ERROR_FLAG = TRUE;                                                 18810000
   END;                                                                 18820000
   IF RCBM10I.COVERAGE_START_6I ¬= ''                                   18830000
    & RCBM10I.COVERAGE_END_6I    = '' THEN                              18840000
   DO;                                                                  18850000
     RCBM10O.MSG_LINEO         = ERR_O080;                              18860000
     RCBM10O.COVERAGE_START_6C = DFHRED;                                18870000
     RCBM10I.COVERAGE_START_6L = -1;                                    18880000
     ERROR_FLAG = TRUE;                                                 18890000
   END;                                                                 18900000
   T240_UPD_FLAG = TRUE;                                                18910000
 END;                                                                   18920000
                                                                        18930000
 IF RCBM10I.COVERAGE_START_5I ¬= WRK_COVERAGE_START_5                   18940000
  | RCBM10I.COVERAGE_END_5I   ¬= WRK_COVERAGE_END_5 THEN                18950000
 DO;                                                                    18960000
   IF RCBM10I.COVERAGE_END_5I < RCBM10I.COVERAGE_START_5I THEN          18970000
   DO;                                                                  18980000
  /* RCBM10O.MSG_LINEO         = ERR_O002;*/            /*CEDS00000428*/18990000
     RCBM10O.MSG_LINEO         = ERR_O011;              /*CEDS00000428*/19000000
     RCBM10O.COVERAGE_END_5C   = DFHRED;                                19010000
     RCBM10O.COVERAGE_START_5C = DFHRED;                                19020000
     RCBM10I.COVERAGE_START_5L = -1;                                    19030000
     ERROR_FLAG = TRUE;                                                 19040000
   END;                                                                 19050000
   IF RCBM10I.COVERAGE_START_5I = ''                                    19060000
    & RCBM10I.COVERAGE_END_5I  ¬= '' THEN                               19070000
   DO;                                                                  19080000
     RCBM10O.MSG_LINEO         = ERR_O081;                              19090000
     RCBM10O.COVERAGE_START_5C = DFHRED;                                19100000
     RCBM10I.COVERAGE_START_5L = -1;                                    19110000
     ERROR_FLAG = TRUE;                                                 19120000
   END;                                                                 19130000
   IF RCBM10I.COVERAGE_START_5I ¬= ''                                   19140000
    & RCBM10I.COVERAGE_END_5I    = '' THEN                              19150000
   DO;                                                                  19160000
     RCBM10O.MSG_LINEO         = ERR_O080;                              19170000
     RCBM10O.COVERAGE_START_5C = DFHRED;                                19180000
     RCBM10I.COVERAGE_START_5L = -1;                                    19190000
     ERROR_FLAG = TRUE;                                                 19200000
   END;                                                                 19210000
   T240_UPD_FLAG = TRUE;                                                19220000
 END;                                                                   19230000
                                                                        19240000
 IF RCBM10I.COVERAGE_START_4I ¬= WRK_COVERAGE_START_4                   19250000
  | RCBM10I.COVERAGE_END_4I   ¬= WRK_COVERAGE_END_4 THEN                19260000
 DO;                                                                    19270000
   IF RCBM10I.COVERAGE_END_4I < RCBM10I.COVERAGE_START_4I THEN          19280000
   DO;                                                                  19290000
  /* RCBM10O.MSG_LINEO         = ERR_O002;*/            /*CEDS00000428*/19300000
     RCBM10O.MSG_LINEO         = ERR_O011;              /*CEDS00000428*/19310000
     RCBM10O.COVERAGE_END_4C   = DFHRED;                                19320000
     RCBM10O.COVERAGE_START_4C = DFHRED;                                19330000
     RCBM10I.COVERAGE_START_4L = -1;                                    19340000
     ERROR_FLAG = TRUE;                                                 19350000
   END;                                                                 19360000
   IF RCBM10I.COVERAGE_START_4I = ''                                    19370000
    & RCBM10I.COVERAGE_END_4I  ¬= '' THEN                               19380000
   DO;                                                                  19390000
     RCBM10O.MSG_LINEO         = ERR_O081;                              19400000
     RCBM10O.COVERAGE_START_4C = DFHRED;                                19410000
     RCBM10I.COVERAGE_START_4L = -1;                                    19420000
     ERROR_FLAG = TRUE;                                                 19430000
   END;                                                                 19440000
   IF RCBM10I.COVERAGE_START_4I ¬= ''                                   19450000
    & RCBM10I.COVERAGE_END_4I    = '' THEN                              19460000
   DO;                                                                  19470000
     RCBM10O.MSG_LINEO         = ERR_O080;                              19480000
     RCBM10O.COVERAGE_START_4C = DFHRED;                                19490000
     RCBM10I.COVERAGE_START_4L = -1;                                    19500000
     ERROR_FLAG = TRUE;                                                 19510000
   END;                                                                 19520000
   T240_UPD_FLAG = TRUE;                                                19530000
 END;                                                                   19540000
                                                                        19550000
 IF RCBM10I.COVERAGE_START_3I ¬= WRK_COVERAGE_START_3                   19560000
  | RCBM10I.COVERAGE_END_3I   ¬= WRK_COVERAGE_END_3 THEN                19570000
 DO;                                                                    19580000
   IF RCBM10I.COVERAGE_END_3I < RCBM10I.COVERAGE_START_3I THEN          19590000
   DO;                                                                  19600000
 /*  RCBM10O.MSG_LINEO         = ERR_O002;*/            /*CEDS00000428*/19610000
     RCBM10O.MSG_LINEO         = ERR_O011;              /*CEDS00000428*/19620000
     RCBM10O.COVERAGE_END_3C   = DFHRED;                                19630000
     RCBM10O.COVERAGE_START_3C = DFHRED;                                19640000
     RCBM10I.COVERAGE_START_3L = -1;                                    19650000
     ERROR_FLAG = TRUE;                                                 19660000
   END;                                                                 19670000
   IF RCBM10I.COVERAGE_START_3I = ''                                    19680000
    & RCBM10I.COVERAGE_END_3I  ¬= '' THEN                               19690000
   DO;                                                                  19700000
     RCBM10O.MSG_LINEO         = ERR_O081;                              19710000
     RCBM10O.COVERAGE_START_3C = DFHRED;                                19720000
     RCBM10I.COVERAGE_START_3L = -1;                                    19730000
     ERROR_FLAG = TRUE;                                                 19740000
   END;                                                                 19750000
   IF RCBM10I.COVERAGE_START_3I ¬= ''                                   19760000
    & RCBM10I.COVERAGE_END_3I    = '' THEN                              19770000
   DO;                                                                  19780000
     RCBM10O.MSG_LINEO         = ERR_O080;                              19790000
     RCBM10O.COVERAGE_START_3C = DFHRED;                                19800000
     RCBM10I.COVERAGE_START_3L = -1;                                    19810000
     ERROR_FLAG = TRUE;                                                 19820000
   END;                                                                 19830000
   T240_UPD_FLAG = TRUE;                                                19840000
 END;                                                                   19850000
                                                                        19860000
 IF RCBM10I.COVERAGE_START_2I ¬= WRK_COVERAGE_START_2                   19870000
  | RCBM10I.COVERAGE_END_2I   ¬= WRK_COVERAGE_END_2 THEN                19880000
 DO;                                                                    19890000
   IF RCBM10I.COVERAGE_END_2I < RCBM10I.COVERAGE_START_2I THEN          19900000
   DO;                                                                  19910000
  /* RCBM10O.MSG_LINEO         = ERR_O002;*/            /*CEDS00000428*/19920000
     RCBM10O.MSG_LINEO         = ERR_O011;              /*CEDS00000428*/19930000
     RCBM10O.COVERAGE_END_2C   = DFHRED;                                19940000
     RCBM10O.COVERAGE_START_2C = DFHRED;                                19950000
     RCBM10I.COVERAGE_START_2L = -1;                                    19960000
     ERROR_FLAG = TRUE;                                                 19970000
   END;                                                                 19980000
   IF RCBM10I.COVERAGE_START_2I = ''                                    19990000
    & RCBM10I.COVERAGE_END_2I  ¬= '' THEN                               20000000
   DO;                                                                  20010000
     RCBM10O.MSG_LINEO         = ERR_O081;                              20020000
     RCBM10O.COVERAGE_START_2C = DFHRED;                                20030000
     RCBM10I.COVERAGE_START_2L = -1;                                    20040000
     ERROR_FLAG = TRUE;                                                 20050000
   END;                                                                 20060000
   IF RCBM10I.COVERAGE_START_2I ¬= ''                                   20070000
    & RCBM10I.COVERAGE_END_2I    = '' THEN                              20080000
   DO;                                                                  20090000
     RCBM10O.MSG_LINEO         = ERR_O080;                              20100000
     RCBM10O.COVERAGE_START_2C = DFHRED;                                20110000
     RCBM10I.COVERAGE_START_2L = -1;                                    20120000
     ERROR_FLAG = TRUE;                                                 20130000
   END;                                                                 20140000
   T240_UPD_FLAG = TRUE;                                                20150000
 END;                                                                   20160000
                                                                        20170000
 IF RCBM10I.COVERAGE_START_1I ¬= WRK_COVERAGE_START_1                   20180000
  | RCBM10I.COVERAGE_END_1I   ¬= WRK_COVERAGE_END_1 THEN                20190000
 DO;                                                                    20200000
   IF RCBM10I.COVERAGE_END_1I < RCBM10I.COVERAGE_START_1I THEN          20210000
   DO;                                                                  20220000
  /* RCBM10O.MSG_LINEO         = ERR_O002;*/            /*CEDS00000428*/20230000
     RCBM10O.MSG_LINEO         = ERR_O011;              /*CEDS00000428*/20240000
     RCBM10O.COVERAGE_END_1C   = DFHRED;                                20250000
     RCBM10O.COVERAGE_START_1C = DFHRED;                                20260000
     RCBM10I.COVERAGE_START_1L = -1;                                    20270000
     ERROR_FLAG = TRUE;                                                 20280000
   END;                                                                 20290000
   IF RCBM10I.COVERAGE_START_1I = ''                                    20300000
    & RCBM10I.COVERAGE_END_1I  ¬= '' THEN                               20310000
   DO;                                                                  20320000
     RCBM10O.MSG_LINEO         = ERR_O081;                              20330000
     RCBM10O.COVERAGE_START_1C = DFHRED;                                20340000
     RCBM10I.COVERAGE_START_1L = -1;                                    20350000
     CALL RCBC10M_SEND_MAP_CSR;                                         20360000
   END;                                                                 20370000
   IF RCBM10I.COVERAGE_START_1I ¬= ''                                   20380000
    & RCBM10I.COVERAGE_END_1I    = '' THEN                              20390000
   DO;                                                                  20400000
     RCBM10O.MSG_LINEO         = ERR_O080;                              20410000
     RCBM10O.COVERAGE_START_1C = DFHRED;                                20420000
     RCBM10I.COVERAGE_START_1L = -1;                                    20430000
     ERROR_FLAG = TRUE;                                                 20440000
   END;                                                                 20450000
   T240_UPD_FLAG = TRUE;                                                20460000
 END;                                                                   20470000
                                                                        20480000
 /* DETERMINE IF THE PRODUCT IS UNDER WARRANTY */                       20490000
 CALL RCBC10M_GET_T220;                                                 20500000
                                                                        20510000
 /* DETERMINE IF THE PRODUCT IS INSTALLED */                            20520000
 IF WRK_ACTION = '1'                                                    20530000
  | (WRK_ACTION = '2'                                                   20540000
   & (RCBM10I.EFFECTIVE_DATEI < WRK_EFFECTIVE_DATE                      20550000
    | RCBM10I.END_DATEI > WRK_END_DATE))             THEN               20560000
 DO;                                                                    20570000
   CALL RCBC10M_GET_T110;                                               20580000
 END;                                                                   20590000
                                                                        20600000
 IF RCBM10I.SERVICE_LVL_CODEI ¬= WRK_SERVICE_LVL_CODE THEN              20610000
 DO;                                                                    20620000
   T240_UPD_FLAG = TRUE;                                                20630000
   IF RCBM10I.SERVICE_LVL_CODEI ¬= ''                                   20640000
    & RCBM10I.SERVICE_LVL_CODEL ¬= 0  THEN                              20650000
   DO;                                                                  20660000
     CALL RCBC10M_GET_T470;                                             20670000
     IF T470_FLAG = FALSE THEN                                          20680000
     DO;                                                                20690000
       RCBM10O.MSG_LINEO         = ERR_O142;                            20700000
       RCBM10O.SERVICE_LVL_CODEC = DFHRED;                              20710000
       RCBM10I.SERVICE_LVL_CODEL = -1;                                  20720000
       ERROR_FLAG = TRUE;                                               20730000
     END;                                                               20740000
   END;                                                                 20750000
 END;                                                                   20760000
                                                                        20770000
 IF RCBM10I.END_DATEI = '' THEN                                         20780000
 DO;                                                                    20790000
   RCBM10I.END_DATEI = WRK_HORIZON_DATE;                                20800000
 END;                                                                   20810000
                                                                        20820000
 IF RCBM10I.END_DATEI ¬= WRK_END_DATE THEN                              20830000
 DO;                                                                    20840000
   IF ( ¬ RCBC10M_VALID_DATE(RCBM10I.END_DATEI)) THEN                   20850000
   DO;                                                                  20860000
     RCBM10O.MSG_LINEO = ERR_O002;                                      20870000
     RCBM10O.END_DATEC = DFHRED;                                        20880000
     RCBM10I.END_DATEL = -1;                                            20890000
     ERROR_FLAG = TRUE;                                                 20900000
   END;                                                                 20910000
   ELSE DO;                                                             20920000
     T240_UPD_FLAG = TRUE;                                              20930000
     DATE_UPD_FLAG = TRUE;                                              20940000
   END;                                                                 20950000
 END;                                                                   20960000
                                                                        20970000
 IF RCBM10I.EFFECTIVE_DATEI ¬= WRK_EFFECTIVE_DATE THEN                  20980000
 DO;                                                                    20990000
   IF ( ¬ RCBC10M_VALID_DATE(RCBM10I.EFFECTIVE_DATEI)) THEN             21000000
   DO;                                                                  21010000
     RCBM10O.MSG_LINEO       = ERR_O002;                                21020000
     RCBM10O.EFFECTIVE_DATEC = DFHRED;                                  21030000
     RCBM10I.EFFECTIVE_DATEL = -1;                                      21040000
     ERROR_FLAG = TRUE;                                                 21050000
   END;                                                                 21060000
   ELSE DO;                                                             21070000
     T240_UPD_FLAG = TRUE;                                              21080000
     DATE_UPD_FLAG = TRUE;                                              21090000
   END;                                                                 21100000
 END;                                                                   21110000
                                                                        21120000
 IF RCBM10I.TYPEI = ''                                                  21130000
  | VERIFY(RCBM10I.TYPEI,ALPHANUM) ¬= 0 THEN                            21140000
 DO;                                                                    21150000
   RCBM10O.MSG_LINEO = ERR_O051;                                        21160000
   RCBM10O.TYPEC     = DFHRED;                                          21170000
   RCBM10I.TYPEL     = -1;                                              21180000
   ERROR_FLAG = TRUE;                                                   21190000
 END;                                                                   21200000
                                                                        21210000
 IF RCBM10I.ORIGINI = ''                                                21220000
  | VERIFY(RCBM10I.ORIGINI,ALPHANUM) ¬= 0 THEN                          21230000
 DO;                                                                    21240000
   RCBM10O.MSG_LINEO = ERR_O051;                                        21250000
   RCBM10O.ORIGINC   = DFHRED;                                          21260000
   RCBM10I.ORIGINL   = -1;                                              21270000
   ERROR_FLAG = TRUE;                                                   21280000
 END;                                                                   21290000
                                                                        21300000
 IF RCBM10I.SEQNOI = ''                                                 21310000
  | VERIFY(RCBM10I.SEQNOI,ALPHANUM) ¬= 0 THEN                           21320000
 DO;                                                                    21330000
   RCBM10O.MSG_LINEO = ERR_O051;                                        21340000
   RCBM10O.SEQNOC    = DFHRED;                                          21350000
   RCBM10I.SEQNOL    = -1;                                              21360000
   ERROR_FLAG = TRUE;                                                   21370000
 END;                                                                   21380000
                                                                        21390000
 /*IF WRK_ACTION = '1' THEN*/                  /*SOC CEDS00000737*/     21400000
 IF RCBM10I.ACTIONI = '1' THEN                 /*EOC CEDS00000737*/     21410000
 DO;                                                                    21420000
   /* CHECK IF TYPE IS EFFECTIVE */                                     21430000
   CALL RCBC10M_GET_T070;                                               21440000
                                                                        21450000
   /* CHECK IF PRODUCT IS ALREADY RELATED TO NON-ONLINE CONTRACTS*/     21460000
   CALL RCBC10M_GET_T240_2;                                             21470000
                                                                        21480000
   /* CHECK IF PRODUCT IS ALREADY RELATED */                            21490000
   CALL RCBC10M_GET_T240;                                               21500000
 END;                                                                   21510000
                                                                        21520000
 /* CHECK ATO FILLED CORRECTLY */                                       21530000
 IF (RCBM10I.AGREEMENT_TYPEI    = ''                                    21540000
   & RCBM10I.AGREEMENT_OPTIONI  = ''                                    21550000
   & RCBM10I.SERVICE_TYPEI      = '')                                   21560000
  | (RCBM10I.AGREEMENT_TYPEI   ¬= ''                                    21570000
   & RCBM10I.AGREEMENT_OPTIONI ¬= ''                                    21580000
   & RCBM10I.SERVICE_TYPEI     ¬= '')                                   21590000
  | (RCBM10I.AGREEMENT_TYPEI   ¬= ''                                    21600000
   & RCBM10I.AGREEMENT_OPTIONI  = ''                                    21610000
   & RCBM10I.SERVICE_TYPEI     ¬= '')                                   21620000
  | (RCBM10I.AGREEMENT_TYPEI    = ''                                    21630000
   & RCBM10I.AGREEMENT_OPTIONI ¬= ''                                    21640000
   & RCBM10I.SERVICE_TYPEI     ¬= '') THEN                              21650000
 DO;                                                                    21660000
   RCBM10O.MSG_LINEO         = ERR_O073;                                21670000
   RCBM10O.AGREEMENT_TYPEC   = DFHRED;                                  21680000
   RCBM10O.AGREEMENT_OPTIONC = DFHRED;                                  21690000
   RCBM10I.AGREEMENT_TYPEL   = -1;                                      21700000
   ERROR_FLAG = TRUE;                                                   21710000
 END;                                                                   21720000
                                                                        21730000
 IF RCBM10I.AGREEMENT_TYPEI  ¬= ''                                      21740000
  & RCBM10I.AGREEMENT_OPTIONI = '' THEN                                 21750000
 DO;                                                                    21760000
   RCBM10O.MSG_LINEO       = ERR_O115;                                  21770000
   RCBM10O.AGREEMENT_OPTIONC = DFHRED;                                  21780000
   RCBM10I.AGREEMENT_OPTIONL = -1;                                      21790000
   ERROR_FLAG = TRUE;                                                   21800000
 END;                                                                   21810000
                                                                        21820000
 IF RCBM10I.AGREEMENT_TYPEI   ¬= '' THEN                                21830000
 DO;                                                                    21840000
   CALL RCBC10M_GET_T610;                                               21850000
   T240_UPD_FLAG = TRUE;                                                21860000
 END;                                                                   21870000
                                                                        21880000
 IF RCBM10I.AGREEMENT_TYPEI   ¬= WRK_AGREEMENT_TYPE                     21890000
  | RCBM10I.AGREEMENT_OPTIONI ¬= WRK_AGREEMENT_OPTION THEN              21900000
 DO;                                                                    21910000
   T240_UPD_FLAG = TRUE;                                                21920000
 END;                                                                   21930000
                                                                        21940000
 IF ERROR_FLAG = TRUE THEN                                              21950000
 DO;                                                                    21960000
   CALL RCBC10M_SEND_MAP_CSR;                                           21970000
 END;                                                                   21980000
                                                                        21990000
 /* CHECK SERVICE TYPE IF NOT '' */                                     22000000
 IF RCBM10I.SERVICE_TYPEI ¬= '' THEN                                    22010000
 DO;                                                                    22020000
   CALL RCBC10M_GET_T640;                                               22030000
 END;                                                                   22040000
                                                                        22050000
 IF RCBM10I.SERVICE_TYPEI ¬= WRK_SERVICE_TYPE THEN                      22060000
   T240_UPD_FLAG = TRUE;                                                22070000
                                                                        22080000
 IF RCBM10I.END_DATEI > WRK_HORIZON_DATE THEN                           22090000
 DO;                                                                    22100000
   RCBM10O.MSG_LINEO = ERR_O055;                                        22110000
   RCBM10O.END_DATEC = DFHRED;                                          22120000
   RCBM10I.END_DATEL = -1;                                              22130000
   CALL RCBC10M_SEND_MAP_CSR;                                           22140000
 END;                                                                   22150000
                                                                        22160000
 IF RCBM10I.END_DATEI < RCBM10I.EFFECTIVE_DATEI THEN                    22170000
 DO;                                                                    22180000
   RCBM10O.MSG_LINEO = ERR_O012;                                        22190000
   RCBM10O.END_DATEC = DFHRED;                                          22200000
   RCBM10I.END_DATEL = -1;                                              22210000
   CALL RCBC10M_SEND_MAP_CSR;                                           22220000
 END;                                                                   22230000
                                                                        22240000
 IF PF5_FLAG = TRUE                                                     22250000
  & T240_UPD_FLAG = TRUE THEN                                           22260000
 DO;                                                                    22270000
   WRK_EFFECTIVE_DATE     = RCBM10I.EFFECTIVE_DATEI;                    22280000
   WRK_END_DATE           = RCBM10I.END_DATEI;                          22290000
   WRK_AGREEMENT_TYPE     = RCBM10I.AGREEMENT_TYPEI;                    22300000
   WRK_AGREEMENT_OPTION   = RCBM10I.AGREEMENT_OPTIONI;                  22310000
   WRK_SERVICE_TYPE       = RCBM10I.SERVICE_TYPEI;                      22320000
   WRK_SERVICE_LVL_CODE   = RCBM10I.SERVICE_LVL_CODEI;                  22330000
   WRK_COVERAGE_START_1   = RCBM10I.COVERAGE_START_1I;                  22340000
   WRK_COVERAGE_END_1     = RCBM10I.COVERAGE_END_1I;                    22350000
   WRK_COVERAGE_START_2   = RCBM10I.COVERAGE_START_2I;                  22360000
   WRK_COVERAGE_END_2     = RCBM10I.COVERAGE_END_2I;                    22370000
   WRK_COVERAGE_START_3   = RCBM10I.COVERAGE_START_3I;                  22380000
   WRK_COVERAGE_END_3     = RCBM10I.COVERAGE_END_3I;                    22390000
   WRK_COVERAGE_START_4   = RCBM10I.COVERAGE_START_4I;                  22400000
   WRK_COVERAGE_END_4     = RCBM10I.COVERAGE_END_4I;                    22410000
   WRK_COVERAGE_START_5   = RCBM10I.COVERAGE_START_5I;                  22420000
   WRK_COVERAGE_END_5     = RCBM10I.COVERAGE_END_5I;                    22430000
   WRK_COVERAGE_START_6   = RCBM10I.COVERAGE_START_6I;                  22440000
   WRK_COVERAGE_END_6     = RCBM10I.COVERAGE_END_6I;                    22450000
   WRK_COVERAGE_START_7   = RCBM10I.COVERAGE_START_7I;                  22460000
   WRK_COVERAGE_END_7     = RCBM10I.COVERAGE_END_7I;                    22470000
 END;                                                                   22480000
                                                                        22490000
 IF PF5_FLAG = FALSE                                                    22500000
  & T240_UPD_FLAG = TRUE THEN                                           22510000
 DO;                                                                    22520000
   RCBM10O.MSG_LINEO = ERR_O022;                                        22530000
   CALL RCBC10M_SEND_MAP;                                               22540000
 END;                                                                   22550000
                                                                        22560000
 IF T240_UPD_FLAG = FALSE THEN                                          22570000
 DO;                                                                    22580000
   RCBM10O.MSG_LINEO = ERR_O053;                                        22590000
   CALL RCBC10M_SEND_MAP;                                               22600000
 END;                                                                   22610000
                                                                        22620000
 END RCBC10M_UPDATE_CHECK;                                              22630000
1/********************************************************************/ 22640000
 /*      CHECK T125                                          RB01320 */ 22650000
 /********************************************************************/ 22660000
0RCBC10M_CHECK_T125: PROC;                                              22670000
                                                                        22680000
 T125_FND_FLAG = FALSE;                                                 22690000
                                                                        22700000
 EXEC SQL                                                               22710000
   SELECT REAL_SERIAL_NUMBER                                            22720000
   INTO :RCB125S.REAL_SERIAL_NUMBER                                     22730000
   FROM RCBV0125_DMMY_REAL                                              22740000
   WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                       22750000
     AND PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                         22760000
     AND DUMMY_ORIGIN       = :WRK_ORIGIN                               22770000
     AND DUMMY_SEQUENCE_NUM = :WRK_SEQUENCE_NUMBER;                     22780000
                                                                        22790000
 SELECT (SQLCA.SQLCODE);                                                22800000
   WHEN(0)                                                              22810000
   DO;                                                                  22820000
     T125_FND_FLAG = TRUE;                                              22830000
     DUMMY_ORIGIN        = WRK_ORIGIN;                                  22840000
     DUMMY_SEQUENCE      = WRK_SEQUENCE_NUMBER;                         22850000
     WRK_ORIGIN          = SUBSTR(RCB125S.REAL_SERIAL_NUMBER,1,2);      22860000
     WRK_SEQUENCE_NUMBER = SUBSTR(RCB125S.REAL_SERIAL_NUMBER,3,28);     22870000
   END;                                                                 22880000
   WHEN(100)                                                            22890000
     T125_FND_FLAG = FALSE;                                             22900000
   OTHERWISE                                                            22910000
     DO;                                                                22920000
       RCBM10O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                22930000
                         || ' OCCURED ON RCBT0125';                     22940000
       CALL RCBC10M_SEND_MAP_CSR;                                       22950000
     END;                                                               22960000
 END;                                                                   22970000
                                                                        22980000
 END RCBC10M_CHECK_T125;                                                22990000
1/********************************************************************/ 23000000
 /*      GET RCBT0070 RECORD                                         */ 23010000
 /********************************************************************/ 23020000
0RCBC10M_GET_T070: PROC;                                                23030000
                                                                        23040000
 WRK_REC_COUNT    = 0;                                                  23050000
                                                                        23060000
 EXEC SQL                                                               23070000
   SELECT COUNT(*)                                                      23080000
   INTO :WRK_REC_COUNT                                                  23090000
   FROM RCBV0070_HW_PO                                                  23100000
   WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                         23110000
     AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                           23120000
     AND MODEL_NUMBER     = ''                                          23130000
     AND HW_REQUEST_CEDS ¬= '0'                                         23140000
     AND :WRK_DATE BETWEEN EFFECTIVE_DATE                               23150000
                       AND END_DATE;                                    23160000
                                                                        23170000
 IF WRK_REC_COUNT = 0 THEN                                              23180000
 DO;                                                                    23190000
   RCBM10O.MSG_LINEO = ERR_O078;                                        23200000
   RCBM10O.TYPEC     = DFHRED;                                          23210000
   RCBM10I.TYPEL     = -1;                                              23220000
   CALL RCBC10M_SEND_MAP_CSR;                                           23230000
 END;                                                                   23240000
                                                                        23250000
0END RCBC10M_GET_T070;                                                  23260000
1/********************************************************************/ 23270000
 /*      GET RCBT0110 RECORD                                         */ 23280000
 /********************************************************************/ 23290000
0RCBC10M_GET_T110: PROC;                                                23300000
                                                                        23310000
 T110_FLAG = FALSE;                                                     23320000
 WRK_END = '';                                                          23330000
                                                                        23340000
 EXEC SQL                                                               23350000
   SELECT END_DATE                                                      23360000
   INTO :WRK_END                                                        23370000
   FROM RCBV0110_HW_STATUS                                              23380000
   WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          23390000
     AND PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                            23400000
     AND ORIGIN          = :WRK_ORIGIN                                  23410000
     AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER                         23420000
     AND (STATUS         = '3'                                          23430000
      OR  STATUS         = '4')                                         23440000
     AND :WRK_DATE BETWEEN EFFECTIVE_DATE                               23450000
                       AND END_DATE;                                    23460000
                                                                        23470000
 SELECT (SQLCA.SQLCODE);                                                23480000
   WHEN(0)                                                              23490000
   DO;                                                                  23500000
     T110_FLAG = TRUE;                                                  23510000
     IF WRK_END < RCBM10I.END_DATEI THEN                                23520000
     DO;                                                                23530000
       RCBM10O.MSG_LINEO = ERR_O045;                                    23540000
       RCBM10O.TYPEC     = DFHRED;                                      23550000
       RCBM10I.TYPEL     = -1;                                          23560000
       CALL RCBC10M_SEND_MAP_CSR;                                       23570000
     END;                                                               23580000
   END;                                                                 23590000
                                                                        23600000
   WHEN(100)                                                            23610000
   /* TOS NOT INSTALLED (NOT FOUND IN T110) */                          23620000
   DO;                                                                  23630000
     RCBM10O.MSG_LINEO = ERR_O043;                                      23640000
     RCBM10O.TYPEC     = DFHRED;                                        23650000
     RCBM10I.TYPEL     = -1;                                            23660000
     CALL RCBC10M_SEND_MAP_CSR;                                         23670000
   END;                                                                 23680000
                                                                        23690000
   OTHERWISE                                                            23700000
   DO;                                                                  23710000
     RCBM10O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                  23720000
                       || ' OCCURED ON RCBT0110';                       23730000
     CALL RCBC10M_SEND_MAP;                                             23740000
   END;                                                                 23750000
 END;                                                                   23760000
                                                                        23770000
0END RCBC10M_GET_T110;                                                  23780000
1/********************************************************************/ 23790000
 /*      GET RCBT0220 RECORD                                         */ 23800000
 /********************************************************************/ 23810000
0RCBC10M_GET_T220: PROC;                                                23820000
                                                                        23830000
 T220_FLAG = FALSE;                                                     23840000
 WRK_REC_COUNT = 0;                                                     23850000
                                                                        23860000
 EXEC SQL                                                               23870000
   SELECT COUNT(*)                                                      23880000
   INTO :WRK_REC_COUNT                                                  23890000
   FROM RCBV0220_SUPPL_CTR                                              23900000
   WHERE PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                            23910000
     AND ORIGIN          = :WRK_ORIGIN                                  23920000
     AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER                         23930000
     AND COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          23940000
     AND (TYPE_OF_MAINT  = '1'                                          23950000
       OR TYPE_OF_WARRANTY IS NOT NULL)                                 23960000
     AND :WRK_DATE BETWEEN EFFECTIVE_DATE                               23970000
                       AND END_DATE;                                    23980000
                                                                        23990000
 IF WRK_REC_COUNT ¬= 0 THEN                                             24000000
 DO;                                                                    24010000
   T220_FLAG = TRUE;                                                    24020000
   RCBM10O.MSG_LINEO = ERR_O061;                                        24030000
   RCBM10O.EFFECTIVE_DATEC = DFHRED;                                    24040000
   RCBM10O.END_DATEC       = DFHRED;                                    24050000
   RCBM10I.EFFECTIVE_DATEL = -1;                                        24060000
   CALL RCBC10M_SEND_MAP_CSR;                                           24070000
 END;                                                                   24080000
                                                                        24090000
0END RCBC10M_GET_T220;                                                  24100000
1/********************************************************************/ 24110000
 /*      GET RCBT0220 RECORD for delete                              */ 24120000
 /********************************************************************/ 24130000
0RCBC10M_GET_T220_2: PROC;                                              24140000
                                                                        24150000
 T220_FLAG = FALSE;                                                     24160000
                                                                        24170000
 EXEC SQL                                                               24180000
   SELECT WARRANTY_EXP_DATE                                             24190000
         ,EFFECTIVE_DATE                             /* CEDS00000813 */ 24191079
   INTO :WRK_WARRANTY_EXP_DATE  :NUL220H                                24200000
       ,:WRK_EFFECTIVE_DTE                           /* CEDS00000813 */ 24201079
   FROM RCBV0220_SUPPL_CTR                                              24210000
   WHERE PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                            24220000
     AND ORIGIN          = :WRK_ORIGIN                                  24230000
     AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER                         24240000
     AND COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          24250000
     AND :WRK_DATE BETWEEN EFFECTIVE_DATE                               24260000
                       AND END_DATE;                                    24270000
                                                                        24280000
 SELECT (SQLCA.SQLCODE);                                                24290000
   WHEN(0)                                                              24300000
   DO;                                                                  24310000
     T220_FLAG = TRUE;                                                  24320000
     IF NUL220H = -1 THEN                                               24330000
       WRK_WARRANTY_EXP_DATE = '';                                      24340000
                                                                        24350000
   END;                                                                 24360000
                                                                        24370000
   WHEN(100)                                                            24380000
   DO;                                                                  24390000
     RCBM10O.MSG_LINEO = 'TOS NOT FOUND IN RCBT0220';                   24400000
     RCBM10O.TYPEC     = DFHRED;                                        24410000
     RCBM10I.TYPEL     = -1;                                            24420000
     CALL RCBC10M_SEND_MAP_CSR;                                         24430000
   END;                                                                 24440000
                                                                        24450000
   OTHERWISE                                                            24460000
   DO;                                                                  24470000
     RCBM10O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                  24480000
                       || ' OCCURED ON RCBT0220';                       24490000
     CALL RCBC10M_SEND_MAP;                                             24500000
   END;                                                                 24510000
 END;                                                                   24520000
                                                                        24530000
0END RCBC10M_GET_T220_2;                                                24540000
1/********************************************************************/ 24550000
 /*      GET RCBT0240 RECORD                                         */ 24560000
 /********************************************************************/ 24570000
0RCBC10M_GET_T240: PROC;                                                24580000
                                                                        24590000
 T240_FLAG = FALSE;                                                     24600000
 WRK_REC_COUNT = 0;                                                     24610000
                                                                        24620000
 EXEC SQL                                                               24630000
   SELECT COUNT(*)                                                      24640000
   INTO :WRK_REC_COUNT                                                  24650000
   FROM RCBV0240_SERV_CTR                                               24660000
   WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                         24670000
     AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                           24680000
     AND ORIGIN           = :WRK_ORIGIN                                 24690000
     AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER                        24700000
     AND SOURCE_INDICATOR = :WRK_O                                      24710000
     AND :WRK_DATE BETWEEN EFFECTIVE_DATE                               24720000
                       AND END_DATE;                                    24730000
                                                                        24740000
 IF WRK_REC_COUNT = 0 THEN                                              24750000
 DO;                                                                    24760000
   T240_FLAG = TRUE;                                                    24770000
 END;                                                                   24780000
                                                                        24790000
 ELSE DO;                                                               24800000
   RCBM10O.MSG_LINEO = ERR_O056;                                        24810000
   RCBM10O.TYPEC     = DFHRED;                                          24820000
   RCBM10I.TYPEL     = -1;                                              24830000
   CALL RCBC10M_SEND_MAP_CSR;                                           24840000
 END;                                                                   24850000
                                                                        24860000
0END RCBC10M_GET_T240;                                                  24870000
1/********************************************************************/ 24880000
 /*      GET RCBT0240 RECORD FOR NOT-ONLINE CONTRACTS                */ 24890000
 /********************************************************************/ 24900000
0RCBC10M_GET_T240_2: PROC;                                              24910000
                                                                        24920000
 T240_FLAG = FALSE;                                                     24930000
 WRK_REC_COUNT = 0;                                                     24940000
                                                                        24950000
 EXEC SQL                                                               24960000
   SELECT COUNT(*)                                                      24970000
   INTO :WRK_REC_COUNT                                                  24980000
   FROM RCBV0240_SERV_CTR                                               24990000
   WHERE COUNTRY_NUMBER    = :WRK_COUNTRY_NUMBER                        25000000
     AND PRODUCT_TYPE      = :WRK_PRODUCT_TYPE                          25010000
     AND ORIGIN            = :WRK_ORIGIN                                25020000
     AND SEQUENCE_NUMBER   = :WRK_SEQUENCE_NUMBER                       25030000
     AND SOURCE_INDICATOR ¬= :WRK_O                                     25040000
     AND :WRK_DATE BETWEEN EFFECTIVE_DATE                               25050000
                       AND END_DATE;                                    25060000
                                                                        25070000
 IF WRK_REC_COUNT  = 0 THEN                       /* SOC CEDS00000713 */25080000
 DO;                                                                    25090000
   T240_UPD_FLAG     = TRUE;                                            25100000
 END;                                             /* EOC CEDS00000713 */25110000
                                                                        25120000
 IF WRK_REC_COUNT ¬= 0 THEN                                             25130000
 DO;                                                                    25140000
   RCBM10O.MSG_LINEO = ERR_O116;                                        25150000
   RCBM10O.TYPEC     = DFHRED;                                          25160000
   RCBM10I.TYPEL     = -1;                                              25170000
   CALL RCBC10M_SEND_MAP_CSR;                                           25180000
 END;                                                                   25190000
                                                                        25200000
0END RCBC10M_GET_T240_2;                                                25210000
1/********************************************************************/ 25220000
 /*      GET RCBT0240 RECORD                                 RB01320 */ 25230000
 /********************************************************************/ 25240000
0RCBC10M_GET_T125_T240: PROC;                                           25250000
                                                                        25260000
 EXEC SQL                                                               25270000
   SELECT  EFFECTIVE_DATE                                               25280000
          ,END_DATE                                                     25290000
   INTO :T240_EFF_DATE, :T240_END_DATE                                  25300000
   FROM RCBV0240_SERV_CTR                                               25310000
   WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                         25320000
     AND PRODUCT_TYPE     = :T125.PRODUCT_TYPE                          25330000
     AND ORIGIN           = :REAL_ORIGIN                                25340000
     AND SEQUENCE_NUMBER  = :REAL_SEQNO                                 25350000
     AND SOURCE_INDICATOR = :WRK_O;                                     25360000
                                                                        25370000
 IF (SQLCA.SQLCODE = 0) THEN                                            25380000
 DO;                                                                    25390000
  TS_REC.TYPE    = T125.PRODUCT_TYPE;                                   25400000
  TS_REC.ORIGIN  = T125.DUMMY_ORIGIN;                                   25410000
  TS_REC.SEQNO   = T125.DUMMY_SEQUENCE_NUM;                             25420000
  TS_REC.EFFDATE = T240_EFF_DATE;                                       25430000
  TS_REC.ENDDATE = T240_END_DATE;                                       25440000
                                                                        25450000
  EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                         25460000
  TS_CNT = TS_CNT + 1;                                                  25470000
 END;                                                                   25480000
                                                                        25490000
0END RCBC10M_GET_T125_T240;                                             25500000
1/********************************************************************/ 25510000
 /*      GET RCBT0470 RECORD                                         */ 25520000
 /********************************************************************/ 25530000
0RCBC10M_GET_T470: PROC;                                                25540000
                                                                        25550000
 T470_FLAG = FALSE;                                                     25560000
 WRK_REC_COUNT = 0;                                                     25570000
                                                                        25580000
 EXEC SQL                                                               25590000
   SELECT COUNT(*)                                                      25600000
   INTO :WRK_REC_COUNT                                                  25610000
   FROM RCBV0470_SERV_COND                                              25620000
   WHERE SERVICE_LVL_CODE = :RCBM10I.SERVICE_LVL_CODEI;                 25630000
                                                                        25640000
 IF WRK_REC_COUNT ¬= 0 THEN                                             25650000
 DO;                                                                    25660000
   T470_FLAG = TRUE;                                                    25670000
 END;                                                                   25680000
                                                                        25690000
0END RCBC10M_GET_T470;                                                  25700000
1/********************************************************************/ 25710000
 /*      GET RCBT0610 RECORD                                         */ 25720000
 /********************************************************************/ 25730000
0RCBC10M_GET_T610: PROC;                                                25740000
                                                                        25750000
 T610_FLAG = FALSE;                                                     25760000
                                                                        25770000
 EXEC SQL                                                               25780000
   SELECT TYPE_OF_MAINT                                                 25790000
         ,SERVICE_TYPE                                                  25800000
   INTO :RCB610S.TYPE_OF_MAINT                                          25810000
       ,:RCB610S.SERVICE_TYPE                                           25820000
   FROM RCBV0610_TRANS_ATO                                              25830000
   WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                         25840000
     AND AGREEMENT_TYPE   = :RCBM10I.AGREEMENT_TYPEI                    25850000
     AND AGREEMENT_OPTION = :RCBM10I.AGREEMENT_OPTIONI;                 25860000
                                                                        25870000
 SELECT (SQLCA.SQLCODE);                                                25880000
   WHEN(0)                                                              25890000
   DO;                                                                  25900000
     T610_FLAG = TRUE;                                                  25910000
   END;                                                                 25920000
                                                                        25930000
   WHEN(100)                                                            25940000
   DO;                                                                  25950000
     RCBM10O.MSG_LINEO         = ERR_O073;                              25960000
     RCBM10O.AGREEMENT_TYPEC   = DFHRED;                                25970000
     RCBM10O.AGREEMENT_OPTIONC = DFHRED;                                25980000
     RCBM10I.AGREEMENT_TYPEL   = -1;                                    25990000
     CALL RCBC10M_SEND_MAP_CSR;                                         26000000
   END;                                                                 26010000
   OTHERWISE                                                            26020000
   DO;                                                                  26030000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       26040000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0610 = '              26050000
                       || PIC_EXPLAIN;                                  26060000
     CALL RCBC10M_SEND_MAP;                                             26070000
   END;                                                                 26080000
 END;                                                                   26090000
                                                                        26100000
0END RCBC10M_GET_T610;                                                  26110000
1/********************************************************************/ 26120000
 /*      GET RCBT0640/RCBT0645 RECORD                                */ 26130000
 /********************************************************************/ 26140000
0RCBC10M_GET_T640: PROC;                                                26150000
                                                                        26160000
 WRK_REC_COUNT = 0;                                                     26170000
                                                                        26180000
 EXEC SQL                                                               26190000
   SELECT COUNT(*)                                                      26200000
   INTO :WRK_REC_COUNT                                                  26210000
   FROM RCBV0645_CTRY_SVT                                               26220000
   WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                         26230000
     AND SERVICE_TYPE = :RCBM10I.SERVICE_TYPEI;                         26240000
                                                                        26250000
 IF WRK_REC_COUNT = 0 THEN                                              26260000
 DO;                                                                    26270000
   EXEC SQL                                                             26280000
     SELECT COUNT(*)                                                    26290000
     INTO :WRK_REC_COUNT                                                26300000
     FROM RCBV0640_TRANS_SVT                                            26310000
     WHERE SERVICE_TYPE = :RCBM10I.SERVICE_TYPEI;                       26320000
 END;                                                                   26330000
                                                                        26340000
 IF WRK_REC_COUNT = 0 THEN                                              26350000
 DO;                                                                    26360000
   RCBM10O.MSG_LINEO = ERR_O113;                                        26370000
   RCBM10O.SERVICE_TYPEC   = DFHRED;                                    26380000
   RCBM10I.SERVICE_TYPEL   = -1;                                        26390000
   CALL RCBC10M_SEND_MAP_CSR;                                           26400000
 END;                                                                   26410000
                                                                        26420000
0END RCBC10M_GET_T640;                                                  26430000
1/********************************************************************/ 26440000
 /*      GET RCBT0500 RECORD PARAMETER RCB050                        */ 26450000
 /********************************************************************/ 26460000
0RCBC10M_GET_T500A: PROC;                                               26470000
                                                                        26480000
 EXEC SQL                                                               26490000
   SELECT PARAMETER_VALUE                                               26500000
   INTO :RCB500S.PARAMETER_VALUE                                        26510000
   FROM RCBV0500_PARM                                                   26520000
   WHERE PARAMETER_KEY    = :WRK_COUNTRY_NUMBER                         26530000
     AND PARAMETER_NUMBER = 'RCB050';                                   26540000
                                                                        26550000
 SELECT (SQLCA.SQLCODE);                                                26560000
   WHEN(0)                                                              26570000
   DO;                                                                  26580000
     WRK_HORIZON_PARM = RCB500S.PARAMETER_VALUE;                        26590000
     WRK_PERIOD = WRK_HORIZON_PARM;                                     26600000
     WRK_IN_DATE = WRK_DATE;                                            26610000
     CALL RCBC10M_ADD_DATE;                                             26620000
     WRK_HORIZON_DATE = WRK_OUT_DATE;                                   26630000
   END;                                                                 26640000
   WHEN(100)                                                            26650000
   DO;                                                                  26660000
     RCBM10I.TYPEL     = -1;                                            26670000
     RCBM10O.MSG_LINEO =                                                26680000
   'Param RCB050 is missing for cty ' || iopucty ||' in table RCBT0500';26690000
     CALL RCBC10M_SEND_MAP_CSR;                                         26700000
   END;                                                                 26710000
   OTHERWISE                                                            26720000
   DO;                                                                  26730000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       26740000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0500 RCB050 = '       26750000
                       || PIC_EXPLAIN;                                  26760000
     CALL RCBC10M_SEND_MAP;                                             26770000
   END;                                                                 26780000
 END;                                                                   26790000
0END RCBC10M_GET_T500A;                                                 26800000
1/********************************************************************/ 26810000
 /*   INTEGRATE T240 RECORD                                          */ 26820000
 /********************************************************************/ 26830000
0RCBC10M_INT_T220: PROC;                                                26840000
                                                  /* SOC CEDS00000713 */26850000
 /*EXEC SQL                                            SOC RC01347      26860000
   SELECT TYPE_OF_MAINT                                                 26870000
   INTO :WRK_TYPE_OF_MAINT :WRK_TOM_NULL                                26880000
   FROM RCBV0220_SUPPL_CTR                                              26890000
   WHERE PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                            26900000
     AND ORIGIN          = :WRK_ORIGIN                                  26910000
     AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER                         26920000
     AND COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          26930000
     AND :WRK_DATE BETWEEN EFFECTIVE_DATE                               26940000
                       AND END_DATE;                                    26950000
 SELECT(SQLCA.SQLCODE);                                                 26960000
   WHEN(0);                                                             26970000
   WHEN(100)                                                            26980000
   WRK_TYPE_OF_MAINT = '2';                                             26990000
   OTHERWISE                                                            27000000
   DO;                                                                  27010000
     RET_CODE = SQLCA.SQLCODE;                                          27020000
     SUB_CODE = SQLCA.SQLCABC;                                          27030000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       27040000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0220 SELECT = '       27050000
                         || PIC_EXPLAIN;                                27060000
     CALL RCBC10M_SEND_MAP;                                             27070000
   END;                                                                 27080000
 END;*/                                              /* EOC RC01347 */  27090000
                                                  /* EOC CEDS00000713 */27100000
 RCB220S                     = '';                                      27110000
 RCB220SI.INDNULL(*)         = 0;                    /* CEDS00000475 */ 27120000
 RCB220S.COUNTRY_NUMBER      = WRK_COUNTRY_NUMBER;                      27130000
 RCB220S.PRODUCT_TYPE        = WRK_PRODUCT_TYPE;                        27140000
 RCB220S.ORIGIN              = WRK_ORIGIN;                              27150000
 RCB220S.SEQUENCE_NUMBER     = WRK_SEQUENCE_NUMBER;                     27160000
                                                  /* SOC CEDS00000713 */27170000
 /*RCB220S.TYPE_OF_MAINT       = WRK_TYPE_OF_MAINT;     SOC RC01347 */  27180000
 RCB220S.TYPE_OF_MAINT       = '2';               /* EOC CEDS00000713 */27190000
 RCB220S.SERVICE_LVL_CODE    = WRK_SERVICE_LVL_CODE; /* EOC RC01347 */  27200000
                                                                        27210000
 IF WRK_SERVICE_LVL_CODE       = '' THEN                                27220000
      RCB220SI.INDNULL(7)      = -1;                                    27230000
 ELSE RCB220S.SERVICE_LVL_CODE = WRK_SERVICE_LVL_CODE;                  27240000
                                                                        27250000
 IF WRK_WARRANTY_EXP_DATE      = '' THEN                                27260000
 /*   RCB220SI.INDNULL(8)      = -1;  */               /* SOC RC01351 */27270000
      RCB220SI.INDNULL(8)      = 99;                   /* EOC RC01351 */27280000
 ELSE RCB220S.WARRANTY_EXP_DATE = WRK_WARRANTY_EXP_DATE;                27290000
 WRK_WARRANTY_EXP_DATE    = '';                       /* CEDS00000731 */27300000
                                                                        27310000
 RCB220S.SOURCE_INDICATOR    = WRK_O;                                   27320000
 PARM_INT_AREA.RUN_DATE      = WRK_DATE;                                27330000
 RCB220S.LAST_CHANGE_DATE    = WRK_DATE;                                27340000
 RCB220S.EFFECTIVE_DATE      = WRK_EFFECTIVE_DATE;                      27350000
 RCB220S.END_DATE            = WRK_END_DATE;                            27360000
                                                                        27370000
 RCB220SI.INDNULL(6)         = -1;                                      27380000
 /* RCB220SI.INDNULL(7)         = -1; */                /* RC01347 */   27390000
 RCB220SI.INDNULL(13)        = -1;               /* SOC CEDS00000475 */ 27400000
 RCB220SI.INDNULL(14)        = -1;                                      27410000
 RCB220SI.INDNULL(15)        = -1;               /* EOC CEDS00000475 */ 27420000
                                                                        27430000
 CALL RCBFAVN (ADDR(RCB220S),                                           27440000
               ADDR(RCB220SI),                                          27450000
               ADDR(RCBZ02S),                                           27460000
               ADDR(PARM_INT_AREA));                                    27470000
                                                                        27480000
 SELECT (RCBZ02S.RETURN_CODE);                                          27490000
   WHEN (0);                                                            27500000
   OTHERWISE                                                            27510000
   DO;                                                                  27520000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBFAVN = '               27530000
                       || RCBZ02S.RETURN_CODE;                          27540000
     RCBM10O.TYPEC     = DFHRED;                                        27550000
     RCBM10I.TYPEL     = -1;                                            27560000
     CALL RCBC10M_SEND_MAP_CSR;                                         27570000
   END;                                                                 27580000
 END;                                                                   27590000
                                                                        27600000
0END RCBC10M_INT_T220;                                                  27610000
1/********************************************************************/ 27620000
 /*   INTEGRATE T240 RECORD                                          */ 27630000
 /********************************************************************/ 27640000
0RCBC10M_INT_T240: PROC;                                                27650000
                                                                        27660000
 RCB240S                     = '';                                      27670000
 RCB240S.COUNTRY_NUMBER      = WRK_COUNTRY_NUMBER;                      27680000
 RCB240S.PRODUCT_TYPE        = WRK_PRODUCT_TYPE;                        27690000
 RCB240S.ORIGIN              = WRK_ORIGIN;                              27700000
 RCB240S.SEQUENCE_NUMBER     = WRK_SEQUENCE_NUMBER;                     27710000
 RCB240S.HVP_QUANTITY        = 0;                                       27720000
                                                                        27730000
 IF WRK_AGREEMENT_TYPE  = '' THEN                                       27740000
 DO;                                                                    27750000
   RCB240SI.INDNULL(15) = -1;                                           27760000
   RCB240SI.INDNULL(16) = -1;                                           27770000
 END;                                                                   27780000
 ELSE DO;                                                               27790000
   RCB240S.AGREEMENT_TYPE   = WRK_AGREEMENT_TYPE;                       27800000
   RCB240S.AGREEMENT_OPTION = WRK_AGREEMENT_OPTION;                     27810000
 END;                                                                   27820000
                                                                        27830000
 RCB240S.COVERAGE_START_1 = WRK_COVERAGE_START_1 || '.00';              27840000
 RCB240S.COVERAGE_END_1   = WRK_COVERAGE_END_1   || '.00';              27850000
 RCB240S.COVERAGE_START_2 = WRK_COVERAGE_START_2 || '.00';              27860000
 RCB240S.COVERAGE_END_2   = WRK_COVERAGE_END_2   || '.00';              27870000
 RCB240S.COVERAGE_START_3 = WRK_COVERAGE_START_3 || '.00';              27880000
 RCB240S.COVERAGE_END_3   = WRK_COVERAGE_END_3   || '.00';              27890000
 RCB240S.COVERAGE_START_4 = WRK_COVERAGE_START_4 || '.00';              27900000
 RCB240S.COVERAGE_END_4   = WRK_COVERAGE_END_4   || '.00';              27910000
 RCB240S.COVERAGE_START_5 = WRK_COVERAGE_START_5 || '.00';              27920000
 RCB240S.COVERAGE_END_5   = WRK_COVERAGE_END_5   || '.00';              27930000
 RCB240S.COVERAGE_START_6 = WRK_COVERAGE_START_6 || '.00';              27940000
 RCB240S.COVERAGE_END_6   = WRK_COVERAGE_END_6   || '.00';              27950000
 RCB240S.COVERAGE_START_7 = WRK_COVERAGE_START_7 || '.00';              27960000
 RCB240S.COVERAGE_END_7   = WRK_COVERAGE_END_7   || '.00';              27970000
                                                                        27980000
 IF WRK_SERVICE_TYPE           = '' THEN                                27990000
      RCB240SI.INDNULL(33)     = -1;                                    28000000
 ELSE RCB240S.SERVICE_TYPE     = WRK_SERVICE_TYPE;                      28010000
                                                                        28020000
 IF WRK_SERVICE_LVL_CODE       = '' THEN                                28030000
      RCB240SI.INDNULL(34)     = -1;                                    28040000
 ELSE RCB240S.SERVICE_LVL_CODE = WRK_SERVICE_LVL_CODE;                  28050000
                                                                        28060000
 RCB240S.SOURCE_INDICATOR    = WRK_O;                                   28070000
 PARM_INT_AREA.RUN_DATE      = WRK_DATE;                                28080000
 RCB240S.LAST_CHANGE_DATE    = WRK_DATE;                                28090000
 RCB240S.EFFECTIVE_DATE      = WRK_EFFECTIVE_DATE;                      28100000
 RCB240S.END_DATE            = WRK_END_DATE;                            28110000
 RCB240S.SERVICE_START_DATE  = WRK_EFFECTIVE_DATE;                      28120000
 RCB240S.SERVICE_STOP_DATE   = WRK_END_DATE;                            28130000
                                                                        28140000
 IF WRK_SERVICE_MODULE_1       = '' THEN                                28150000
      RCB240SI.INDNULL(10)     = -1;                                    28160000
 ELSE RCB240S.SERVICE_MODULE_1 = WRK_SERVICE_MODULE_1;                  28170000
                                                                        28180000
 IF WRK_SERVICE_MODULE_2       = '' THEN                                28190000
      RCB240SI.INDNULL(11)     = -1;                                    28200000
 ELSE RCB240S.SERVICE_MODULE_2 = WRK_SERVICE_MODULE_2;                  28210000
                                                                        28220000
 IF WRK_SERVICE_MODULE_3       = '' THEN                                28230000
      RCB240SI.INDNULL(12)     = -1;                                    28240000
 ELSE RCB240S.SERVICE_MODULE_3 = WRK_SERVICE_MODULE_3;                  28250000
                                                                        28260000
 IF WRK_SERVICE_MODULE_4       = '' THEN                                28270000
      RCB240SI.INDNULL(13)     = -1;                                    28280000
 ELSE RCB240S.SERVICE_MODULE_4 = WRK_SERVICE_MODULE_4;                  28290000
                                                                        28300000
 IF WRK_SERVICE_MODULE_5       = '' THEN                                28310000
      RCB240SI.INDNULL(14)     = -1;                                    28320000
 ELSE RCB240S.SERVICE_MODULE_5 = WRK_SERVICE_MODULE_5;                  28330000
                                                                        28340000
 RCB240SI.INDNULL(6)         = -1;                                      28350000
 RCB240SI.INDNULL(9)         = -1;                                      28360000
 RCB240SI.INDNULL(17)        = -1;                                      28370000
 RCB240SI.INDNULL(18)        = -1;                                      28380000
                                                                        28390000
 CALL RCBFAXN (ADDR(RCB240S),                                           28400000
               ADDR(RCB240SI),                                          28410000
               ADDR(RCBZ02S),                                           28420000
               ADDR(PARM_INT_AREA));                                    28430000
                                                                        28440000
 SELECT (RCBZ02S.RETURN_CODE);                                          28450000
   WHEN (0);                                                            28460000
   OTHERWISE                                                            28470000
   DO;                                                                  28480000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBFAXN = '               28490000
                       || RCBZ02S.RETURN_CODE;                          28500000
     RCBM10O.TYPEC     = DFHRED;                                        28510000
     RCBM10I.TYPEL     = -1;                                            28520000
     CALL RCBC10M_SEND_MAP_CSR;                                         28530000
   END;                                                                 28540000
 END;                                                                   28550000
                                                                        28560000
0END RCBC10M_INT_T240;                                                  28570000
1/********************************************************************/ 28580000
 /*      UPDATE T240 RECORD                                          */ 28590000
 /********************************************************************/ 28600000
0RCBC10M_UPDATE_T240: PROC;                                             28610000
                                                                        28620000
 WRK_CS1 = WRK_COVERAGE_START_1 || '.00';                               28630000
 WRK_CS2 = WRK_COVERAGE_START_2 || '.00';                               28640000
 WRK_CS3 = WRK_COVERAGE_START_3 || '.00';                               28650000
 WRK_CS4 = WRK_COVERAGE_START_4 || '.00';                               28660000
 WRK_CS5 = WRK_COVERAGE_START_5 || '.00';                               28670000
 WRK_CS6 = WRK_COVERAGE_START_6 || '.00';                               28680000
 WRK_CS7 = WRK_COVERAGE_START_7 || '.00';                               28690000
 WRK_CE1 = WRK_COVERAGE_END_1   || '.00';                               28700000
 WRK_CE2 = WRK_COVERAGE_END_2   || '.00';                               28710000
 WRK_CE3 = WRK_COVERAGE_END_3   || '.00';                               28720000
 WRK_CE4 = WRK_COVERAGE_END_4   || '.00';                               28730000
 WRK_CE5 = WRK_COVERAGE_END_5   || '.00';                               28740000
 WRK_CE6 = WRK_COVERAGE_END_6   || '.00';                               28750000
 WRK_CE7 = WRK_COVERAGE_END_7   || '.00';                               28760000
                                                                        28770000
 IF WRK_AGREEMENT_TYPE = '' THEN                                        28780000
 DO;                                                                    28790000
   NUL240O = -1;                                                        28800000
   NUL240P = -1;                                                        28810000
 END;                                                                   28820000
                                                                        28830000
 IF WRK_SERVICE_TYPE = '' THEN                                          28840000
   NUL2406 = -1;                                                        28850000
                                                                        28860000
 IF WRK_SERVICE_LVL_CODE = '' THEN                                      28870000
   NUL2407 = -1;                                                        28880000
                                                                        28890000
 EXEC SQL                                                               28900000
      UPDATE RCBV0240_SERV_CTR                                          28910000
      SET SERVICE_START_DATE = :WRK_EFFECTIVE_DATE                      28920000
                              :NUL240G,                                 28930000
          SERVICE_STOP_DATE = :WRK_END_DATE                             28940000
                              :NUL240H,                                 28950000
          AGREEMENT_TYPE    = :WRK_AGREEMENT_TYPE                       28960000
                              :NUL240O,                                 28970000
          AGREEMENT_OPTION  = :WRK_AGREEMENT_OPTION                     28980000
                              :NUL240P,                                 28990000
          COVERAGE_START_1  = :WRK_CS1                                  29000000
                              :NUL240S,                                 29010000
          COVERAGE_END_1    = :WRK_CE1                                  29020000
                              :NUL240T,                                 29030000
          COVERAGE_START_2  = :WRK_CS2                                  29040000
                              :NUL240U,                                 29050000
          COVERAGE_END_2    = :WRK_CE2                                  29060000
                              :NUL240V,                                 29070000
          COVERAGE_START_3  = :WRK_CS3                                  29080000
                              :NUL240W,                                 29090000
          COVERAGE_END_3    = :WRK_CE3                                  29100000
                              :NUL240X,                                 29110000
          COVERAGE_START_4  = :WRK_CS4                                  29120000
                              :NUL240Y,                                 29130000
          COVERAGE_END_4    = :WRK_CE4                                  29140000
                              :NUL240Z,                                 29150000
          COVERAGE_START_5  = :WRK_CS5                                  29160000
                              :NUL2400,                                 29170000
          COVERAGE_END_5    = :WRK_CE5                                  29180000
                              :NUL2401,                                 29190000
          COVERAGE_START_6  = :WRK_CS6                                  29200000
                              :NUL2402,                                 29210000
          COVERAGE_END_6    = :WRK_CE6                                  29220000
                              :NUL2403,                                 29230000
          COVERAGE_START_7  = :WRK_CS7                                  29240000
                              :NUL2404,                                 29250000
          COVERAGE_END_7    = :WRK_CE7                                  29260000
                              :NUL2405,                                 29270000
          SERVICE_TYPE      = :WRK_SERVICE_TYPE                         29280000
                              :NUL2406,                                 29290000
          SERVICE_LVL_CODE  = :WRK_SERVICE_LVL_CODE                     29300000
                              :NUL2407,                                 29310000
          SOURCE_INDICATOR  = :WRK_O                                    29320000
                              :NUL2408,                                 29330000
          LAST_CHANGE_DATE  = :WRK_DATE                                 29340000
                              :NUL2409                                  29350000
      WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                       29360000
        AND PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                         29370000
        AND ORIGIN          = :WRK_ORIGIN                               29380000
        AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER                      29390000
        AND EFFECTIVE_DATE  = :WRK_EFFECTIVE_DATE                       29400000
      ;                                                                 29410000
 SELECT (SQLCA.SQLCODE);                                                29420000
   WHEN (0);                                                            29430000
   OTHERWISE                                                            29440000
   DO;                                                                  29450000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       29460000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0240 UPDATE = '       29470000
                       || PIC_EXPLAIN;                                  29480000
     RCBM10O.TYPEC     = DFHRED;                                        29490000
     RCBM10I.TYPEL     = -1;                                            29500000
     CALL RCBC10M_SEND_MAP_CSR;                                         29510000
   END;                                                                 29520000
 END;                                                                   29530000
                                                                        29540000
0END RCBC10M_UPDATE_T240;                                               29550000
1/********************************************************************/ 29560000
 /*      DELETE T240 RECORD                                          */ 29570000
 /********************************************************************/ 29580000
0RCBC10M_DELETE_T240: PROC;                                             29590000
                                                                        29600000
 EXEC SQL                                                               29610000
      DELETE FROM RCBV0240_SERV_CTR                                     29620000
      WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                      29630000
        AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                        29640000
        AND ORIGIN           = :WRK_ORIGIN                              29650000
        AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER                     29660000
        AND SOURCE_INDICATOR = :WRK_O               /*CEDS00000737*/    29670000
      ;                                                                 29680000
 SELECT (SQLCA.SQLCODE);                                                29690000
   WHEN (0);                                                            29700000
   OTHERWISE                                                            29710000
   DO;                                                                  29720000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       29730000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0240 DELETE = '       29740000
                       || PIC_EXPLAIN;                                  29750000
     RCBM10O.TYPEC     = DFHRED;                                        29760000
     RCBM10I.TYPEL     = -1;                                            29770000
     CALL RCBC10M_SEND_MAP_CSR;                                         29780000
   END;                                                                 29790000
 END;                                                                   29800000
                                                                        29810000
0END RCBC10M_DELETE_T240;                                               29820000
                                                      /* SOC RC01347 */ 29830000
1/********************************************************************/ 29840000
 /*      DELETE T220 RECORD                                          */ 29850000
 /********************************************************************/ 29860000
 /*0RCBC10M_DELETE_T220: PROC;                    /* SOC CEDS00000713 */29870000
                                                                        29880000
 /*EXEC SQL                                                             29890000
      DELETE FROM RCBV0220_SUPPL_CTR                                    29900000
      WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                      29910000
        AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                        29920000
        AND ORIGIN           = :WRK_ORIGIN                              29930000
        AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER                     29940000
      ;                                                                 29950000
 SELECT (SQLCA.SQLCODE);                                                29960000
   WHEN (0);                                                            29970000
   OTHERWISE                                                            29980000
   DO;                                                                  29990000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       30000000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0220 DELETE = '       30010000
                       || PIC_EXPLAIN;                                  30020000
     RCBM10O.TYPEC     = DFHRED;                                        30030000
     RCBM10I.TYPEL     = -1;                                            30040000
     CALL RCBC10M_SEND_MAP_CSR;                                         30050000
   END;                                                                 30060000
 END;                                                                   30070000
                                                                        30080000
0END RCBC10M_DELETE_T220;*/  /* EOC RC01347 */  /* EOC CEDS00000713  */ 30090000
1/********************************************************************/ 30100000
 /*      DELETE T220 RECORD                      /* SOC CEDS00000737 */ 30110000
 /********************************************************************/ 30120000
 RCBC10M_DELETE_T220: PROC;                                             30130000
                                                                        30140000
 EXEC SQL                                                               30150000
      DELETE FROM RCBV0220_SUPPL_CTR                                    30160000
      WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                      30170000
        AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                        30180000
        AND ORIGIN           = :WRK_ORIGIN                              30190000
        AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER                     30200000
        AND SOURCE_INDICATOR = :WRK_O                                   30210000
      ;                                                                 30220000
 SELECT (SQLCA.SQLCODE);                                                30230000
   WHEN (0,100);                                                        30240000
   OTHERWISE                                                            30250000
   DO;                                                                  30260000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       30270000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0220 DELETE = '       30280000
                       || PIC_EXPLAIN;                                  30290000
     RCBM10O.TYPEC     = DFHRED;                                        30300000
     RCBM10I.TYPEL     = -1;                                            30310000
     CALL RCBC10M_SEND_MAP_CSR;                                         30320000
   END;                                                                 30330000
 END;                                                                   30340000
                                                                        30350000
0END RCBC10M_DELETE_T220;                        /* EOC CEDS00000737 */ 30360000
1/********************************************************************/ 30370000
 /*      CREATE T560 RECORD                                          */ 30380000
 /********************************************************************/ 30390000
0RCBC10M_UPD_T560: PROC;                                                30400000
                                                                        30410000
 /*DCL WRK_TIME_IN  CHAR(26) INIT('');          /* CEDS00000361      */ 30420000
                                                                        30430000
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         30440000
                                                                        30450000
 WRKMAP_DATA = ' ';                                                     30460000
 WRKMAP.PRODUCT_TYPE       = WRK_PRODUCT_TYPE;                          30470000
 WRKMAP.ORIGIN             = WRK_ORIGIN;                                30480000
 WRKMAP.SEQUENCE_NUMBER    = WRK_SEQUENCE_NUMBER;                       30490000
 WRKMAP.EFFECTIVE_DATE     = WRK_EFFECTIVE_DATE;                        30500000
 WRKMAP.END_DATE           = WRK_END_DATE;                              30510000
 WRKMAP.AGREEMENT_TYPE     = WRK_AGREEMENT_TYPE;                        30520000
 WRKMAP.AGREEMENT_OPTION   = WRK_AGREEMENT_OPTION;                      30530000
 WRKMAP.SERVICE_TYPE       = WRK_SERVICE_TYPE;                          30540000
 WRKMAP.SERVICE_LVL_CODE   = WRK_SERVICE_LVL_CODE;                      30550000
 WRKMAP.COVERAGE_START_1   = WRK_COVERAGE_START_1;                      30560000
 WRKMAP.COVERAGE_END_1     = WRK_COVERAGE_END_1;                        30570000
 WRKMAP.COVERAGE_START_2   = WRK_COVERAGE_START_2;                      30580000
 WRKMAP.COVERAGE_END_2     = WRK_COVERAGE_END_2;                        30590000
 WRKMAP.COVERAGE_START_3   = WRK_COVERAGE_START_3;                      30600000
 WRKMAP.COVERAGE_END_3     = WRK_COVERAGE_END_3;                        30610000
 WRKMAP.COVERAGE_START_4   = WRK_COVERAGE_START_4;                      30620000
 WRKMAP.COVERAGE_END_4     = WRK_COVERAGE_END_4;                        30630000
 WRKMAP.COVERAGE_START_5   = WRK_COVERAGE_START_5;                      30640000
 WRKMAP.COVERAGE_END_5     = WRK_COVERAGE_END_5;                        30650000
 WRKMAP.COVERAGE_START_6   = WRK_COVERAGE_START_6;                      30660000
 WRKMAP.COVERAGE_END_6     = WRK_COVERAGE_END_6;                        30670000
 WRKMAP.COVERAGE_START_7   = WRK_COVERAGE_START_7;                      30680000
 WRKMAP.COVERAGE_END_7     = WRK_COVERAGE_END_7;                        30690000
                                                                        30700000
 RCB560S                 = ' ';                                         30710000
 RCB560S.COUNTRY_NUMBER  = WRK_COUNTRY_NUMBER;                          30720000
 RCB560S.TXN_CODE        = 'RCBTXN10';                                  30730000
 RCB560S.TIMESTAMP       = WRK_TIME_IN;                                 30740000
 RCB560S.USERID          = HEADER.USERID;                               30750000
 RCB560S.ACTION          = RCBM10I.ACTIONI;                             30760000
 RCB560S.DATA            = WRKMAP_DATA;                                 30770000
                                                                        30780000
 EXEC SQL                                                               30790000
      INSERT INTO RCBV0560_XACTION                                      30800000
      (COUNTRY_NUMBER,                                                  30810000
       TXN_CODE,                                                        30820000
       TIMESTAMP,                                                       30830000
       USERID,                                                          30840000
       ACTION,                                                          30850000
       DATA)                                                            30860000
        VALUES (:RCB560S:RCB560SI.INDNULL);                             30870000
                                                                        30880000
 SELECT(SQLCA.SQLCODE);                                                 30890000
   WHEN(0);                                                             30900000
   OTHERWISE                                                            30910000
   DO;                                                                  30920000
     RET_CODE = SQLCA.SQLCODE;                                          30930000
     SUB_CODE = SQLCA.SQLCABC;                                          30940000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       30950000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0560 INSERT = '       30960000
                         || PIC_EXPLAIN;                                30970000
     CALL RCBC10M_SEND_MAP;                                             30980000
   END;                                                                 30990000
 END;                                                                   31000000
                                                                        31010000
0END RCBC10M_UPD_T560;                                                  31020000
1/********************************************************************/ 31030000
 /*    COUNT RCBT0240 FOR SEARCH CRITERIA                            */ 31040000
 /********************************************************************/ 31050000
0RCBC10M_COUNT_T240: PROC;                                              31060000
                                                                        31070000
 WRK_REC_COUNT = 0;                                                     31080000
 WRK_REC_COUNT1 = 0;                                                    31090000
 WRK_REC_COUNT2 = 0;                                                    31100000
 EXEC SQL                                                               31110000
   SELECT COUNT(*)                                                      31120000
 /*INTO :WRK_REC_COUNT                                    SOC RB01320*/ 31130000
   INTO :WRK_REC_COUNT1                                 /*EOC RB01320*/ 31140000
   FROM RCBV0240_SERV_CTR                                               31150000
   WHERE COUNTRY_NUMBER       = :WRK_COUNTRY_NUMBER                     31160000
     AND SOURCE_INDICATOR     = :WRK_O                                  31170000
     AND ((PRODUCT_TYPE       = :TYPE_SEL                               31180000
      OR   :TYPE_ENT          = 'N')                                    31190000
     AND  (ORIGIN             = :ORIGIN_SEL                             31200000
      OR   :ORIGIN_ENT        = 'N')                                    31210000
     AND  (SEQUENCE_NUMBER LIKE :TMP_SEQ                                31220000
      OR   :SEQ_ENT           = 'N'));                                  31230000
                                                                        31240000
 EXEC SQL                                               /*SOC RB01320*/ 31250000
   SELECT COUNT(*)                                                      31260000
   INTO :WRK_REC_COUNT2                                                 31270000
   FROM RCBV0125_DMMY_REAL A                                            31280000
   WHERE A.COUNTRY_NUMBER       = :WRK_COUNTRY_NUMBER                   31290000
     AND ((A.PRODUCT_TYPE       = :TYPE_SEL                             31300000
      OR   :TYPE_ENT          = 'N')                                    31310000
     AND  (A.DUMMY_ORIGIN       = :ORIGIN_SEL                           31320000
      OR   :ORIGIN_ENT        = 'N')                                    31330000
     AND  (A.DUMMY_SEQUENCE_NUM LIKE :TMP_SEQ                           31340000
      OR   :SEQ_ENT           = 'N'))                                   31350000
     AND EXISTS (                                                       31360000
           SELECT *                                                     31370000
           FROM RCBV0240_SERV_CTR B                                     31380000
           WHERE B.COUNTRY_NUMBER   = A.COUNTRY_NUMBER                  31390000
             AND B.PRODUCT_TYPE     = A.PRODUCT_TYPE                    31400000
             AND B.ORIGIN           = SUBSTR(A.REAL_SERIAL_NUMBER,1,2)  31410000
             AND B.SEQUENCE_NUMBER  = SUBSTR(A.REAL_SERIAL_NUMBER,3,28) 31420000
             AND B.SOURCE_INDICATOR = :WRK_O                            31430000
                );                                                      31440000
                                                                        31450000
  WRK_REC_COUNT = WRK_REC_COUNT1 + WRK_REC_COUNT2;      /*EOC RB01320*/ 31460000
                                                                        31470000
0END RCBC10M_COUNT_T240;                                                31480000
1/********************************************************************/ 31490000
 /*      VALIDATE TIME PROCESSING                                    */ 31500000
 /********************************************************************/ 31510000
0RCBC10M_VALID_TIME: PROC(A_TIME ) RETURNS(BIT(1));                     31520000
 DCL L_RET          BIT(1) INIT(FALSE);                                 31530000
 DCL A_TIME         CHAR(5);                                            31540000
 DCL 1 S_TIME  BASED(ADDR(A_TIME)),                                     31550000
      3 HOURS    CHAR (2),                                              31560000
      3 DELIM    CHAR (1),                                              31570000
      3 MINUTES  CHAR (2);                                              31580000
                                                                        31590000
 IF VERIFY(S_TIME.HOURS,'0123456789') = 0                               31600000
  & VERIFY(S_TIME.DELIM,'.') = 0                                        31610000
  & VERIFY(S_TIME.MINUTES,'0123456789') = 0 THEN                        31620000
                                                                        31630000
 DO;                                                                    31640000
   IF (S_TIME.HOURS   >= '00' &                                         31650000
       S_TIME.HOURS   <= '23' &                                         31660000
       S_TIME.MINUTES >= '00' &                                         31670000
       S_TIME.MINUTES <= '59')                                          31680000
   |  (S_TIME.HOURS   = '24' &                                          31690000
       S_TIME.MINUTES = '00')                                           31700000
   THEN                                                                 31710000
     L_RET = TRUE;                                                      31720000
 END;                                                                   31730000
                                                                        31740000
 RETURN(L_RET);                                                         31750000
                                                                        31760000
0END RCBC10M_VALID_TIME;                                                31770000
1/********************************************************************/ 31780000
 /*      VALIDATE DATE PROCESSING                                    */ 31790000
 /********************************************************************/ 31800000
0RCBC10M_VALID_DATE: PROC(A_DATE ) RETURNS(BIT(1));                     31810000
 DCL A_DATE         CHAR(*);                                            31820000
 DCL L_RET          BIT(1) INIT(TRUE);                                  31830000
                                                                        31840000
 DATE_AREA               = '';                                          31850000
 DATE_AREA.WD_IN_FORMAT  = 'ISO';                                       31860000
 DATE_AREA.WD_OUT_FORMAT = 'ISO';                                       31870000
 DATE_AREA.WD_FUNCTION   = 'V';  /*VALIDATE*/                           31880000
 DATE_AREA.WD_IN_DATE    = A_DATE;                                      31890000
 CALL RCB004N (ADDR(DATE_AREA));                                        31900000
                                                                        31910000
 IF (DATE_AREA.WD_STATUS ¬= ' ') THEN                                   31920000
 DO;                                                                    31930000
   L_RET = FALSE;                                                       31940000
 END;                                                                   31950000
                                                                        31960000
 RETURN(L_RET);                                                         31970000
                                                                        31980000
0END RCBC10M_VALID_DATE;                                                31990000
1/********************************************************************/ 32000000
 /*      VALIDATE DATE ADD                                           */ 32010000
 /********************************************************************/ 32020000
0RCBC10M_ADD_DATE: PROC;                                                32030000
                                                                        32040000
 DATE_AREA                = '';                                         32050000
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      32060000
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      32070000
 DATE_AREA.WD_FUNCTION    = 'C';                                        32080000
 DATE_AREA.WD_PERIOD_TYPE = 'D';                                        32090000
 DATE_AREA.WD_PERIOD      = WRK_PERIOD;                                 32100000
 DATE_AREA.WD_IN_DATE     = WRK_IN_DATE;                                32110000
 CALL RCB004N (ADDR(DATE_AREA));                                        32120000
                                                                        32130000
 IF DATE_AREA.WD_STATUS = ' ' THEN                                      32140000
 DO;                                                                    32150000
   WRK_OUT_DATE = SUBSTR(DATE_AREA.WD_OUT_DATE,1,10);                   32160000
 END;                                                                   32170000
                                                                        32180000
0END RCBC10M_ADD_DATE;                                                  32190000
1/********************************************************************/ 32200000
 /*      GET CURSOR POSITION                                         */ 32210000
 /*         FOR RETURN FROM HELP SCREENS                             */ 32220000
 /********************************************************************/ 32230000
0RCBC10M_GET_CSR_POS: PROC;                                             32240000
                                                                        32250000
 SELECT(CSR_POS);                                                       32260000
   WHEN(1)  RCBM10I.ACTIONL                    = -1;                    32270000
   WHEN(2)  RCBM10I.TYPEL                      = -1;                    32280000
   WHEN(3)  RCBM10I.ORIGINL                    = -1;                    32290000
   WHEN(4)  RCBM10I.SEQNOL                     = -1;                    32300000
   WHEN(5)  RCBM10I.EFFECTIVE_DATEL            = -1;                    32310000
   WHEN(6)  RCBM10I.END_DATEL                  = -1;                    32320000
   WHEN(7)  RCBM10I.AGREEMENT_TYPEL            = -1;                    32330000
   WHEN(8)  RCBM10I.AGREEMENT_OPTIONL          = -1;                    32340000
   WHEN(9)  RCBM10I.SERVICE_TYPEL              = -1;                    32350000
   WHEN(10) RCBM10I.SERVICE_LVL_CODEL          = -1;                    32360000
   WHEN(11) RCBM10I.COVERAGE_START_1L          = -1;                    32370000
   WHEN(12) RCBM10I.COVERAGE_START_2L          = -1;                    32380000
   WHEN(13) RCBM10I.COVERAGE_START_3L          = -1;                    32390000
   WHEN(14) RCBM10I.COVERAGE_START_4L          = -1;                    32400000
   WHEN(15) RCBM10I.COVERAGE_START_5L          = -1;                    32410000
   WHEN(16) RCBM10I.COVERAGE_START_6L          = -1;                    32420000
   WHEN(17) RCBM10I.COVERAGE_START_7L          = -1;                    32430000
   WHEN(18) RCBM10I.COVERAGE_END_1L            = -1;                    32440000
   WHEN(19) RCBM10I.COVERAGE_END_2L            = -1;                    32450000
   WHEN(20) RCBM10I.COVERAGE_END_3L            = -1;                    32460000
   WHEN(21) RCBM10I.COVERAGE_END_4L            = -1;                    32470000
   WHEN(22) RCBM10I.COVERAGE_END_5L            = -1;                    32480000
   WHEN(23) RCBM10I.COVERAGE_END_6L            = -1;                    32490000
   WHEN(24) RCBM10I.COVERAGE_END_7L            = -1;                    32500000
 END;                                                                   32510000
                                                                        32520000
0END RCBC10M_GET_CSR_POS;                                               32530000
1/********************************************************************/ 32540000
 /*      CLEAR PROCESSING                                            */ 32550000
 /*         CLEAR OUT WORK FIELDS                                    */ 32560000
 /********************************************************************/ 32570000
0RCBC10M_CLEAR_WORK: PROC;                                              32580000
                                                                        32590000
 HEADER.NEXT              = '00';                                       32600000
 WRK_ACTION               = '';                                         32610000
 WRK_PRODUCT_TYPE         = '';                                         32620000
 WRK_ORIGIN               = '';                                         32630000
 WRK_SEQUENCE_NUMBER      = '';                                         32640000
 WRK_AGREEMENT_TYPE       = '';                                         32650000
 WRK_AGREEMENT_OPTION     = '';                                         32660000
 WRK_EFFECTIVE_DATE       = '';                                         32670000
 WRK_END_DATE             = '';                                         32680000
 WRK_SERVICE_TYPE         = '';                                         32690000
 WRK_SERVICE_LVL_CODE     = '';                                         32700000
 WRK_COVERAGE_START_1     = '00.00';                                    32710000
 WRK_COVERAGE_END_1       = '00.00';                                    32720000
 WRK_COVERAGE_START_2     = '00.00';                                    32730000
 WRK_COVERAGE_END_2       = '00.00';                                    32740000
 WRK_COVERAGE_START_3     = '00.00';                                    32750000
 WRK_COVERAGE_END_3       = '00.00';                                    32760000
 WRK_COVERAGE_START_4     = '00.00';                                    32770000
 WRK_COVERAGE_END_4       = '00.00';                                    32780000
 WRK_COVERAGE_START_5     = '00.00';                                    32790000
 WRK_COVERAGE_END_5       = '00.00';                                    32800000
 WRK_COVERAGE_START_6     = '00.00';                                    32810000
 WRK_COVERAGE_END_6       = '00.00';                                    32820000
 WRK_COVERAGE_START_7     = '00.00';                                    32830000
 WRK_COVERAGE_END_7       = '00.00';                                    32840000
 PF5_FLAG                 = FALSE;                                      32850000
                                                                        32860000
0END RCBC10M_CLEAR_WORK;                                                32870000
1/********************************************************************/ 32880000
 /*      CLEAR MAP RCBM10A                                           */ 32890000
 /********************************************************************/ 32900000
0RCBC10M_CLEAR_SEL: PROC;                                               32910000
                                                                        32920000
 TYPE_SEL   = '****';                                                   32930000
 ORIGIN_SEL = '**';                                                     32940000
 SEQ_SEL    = '*******';                                                32950000
 TS_CNT     = 0;                                                        32960000
                                                                        32970000
0END RCBC10M_CLEAR_SEL;                                                 32980000
1/********************************************************************/ 32990000
 /*      SAVE MAP                                                    */ 33000000
 /********************************************************************/ 33010000
0RCBC10M_SAVE_MAP : PROC;                                               33020000
                                                                        33030000
 WRK_PRODUCT_TYPE       = RCBM10I.TYPEI;                                33040000
 WRK_ORIGIN             = RCBM10I.ORIGINI;                              33050000
 WRK_SEQUENCE_NUMBER    = RCBM10I.SEQNOI;                               33060000
 WRK_EFFECTIVE_DATE     = RCBM10I.EFFECTIVE_DATEI;                      33070000
 WRK_END_DATE           = RCBM10I.END_DATEI;                            33080000
 WRK_AGREEMENT_TYPE     = RCBM10I.AGREEMENT_TYPEI;                      33090000
 WRK_AGREEMENT_OPTION   = RCBM10I.AGREEMENT_OPTIONI;                    33100000
 WRK_SERVICE_TYPE       = RCBM10I.SERVICE_TYPEI;                        33110000
 WRK_SERVICE_LVL_CODE   = RCBM10I.SERVICE_LVL_CODEI;                    33120000
 WRK_COVERAGE_START_1   = RCBM10I.COVERAGE_START_1I;                    33130000
 WRK_COVERAGE_END_1     = RCBM10I.COVERAGE_END_1I;                      33140000
 WRK_COVERAGE_START_2   = RCBM10I.COVERAGE_START_2I;                    33150000
 WRK_COVERAGE_END_2     = RCBM10I.COVERAGE_END_2I;                      33160000
 WRK_COVERAGE_START_3   = RCBM10I.COVERAGE_START_3I;                    33170000
 WRK_COVERAGE_END_3     = RCBM10I.COVERAGE_END_3I;                      33180000
 WRK_COVERAGE_START_4   = RCBM10I.COVERAGE_START_4I;                    33190000
 WRK_COVERAGE_END_4     = RCBM10I.COVERAGE_END_4I;                      33200000
 WRK_COVERAGE_START_5   = RCBM10I.COVERAGE_START_5I;                    33210000
 WRK_COVERAGE_END_5     = RCBM10I.COVERAGE_END_5I;                      33220000
 WRK_COVERAGE_START_6   = RCBM10I.COVERAGE_START_6I;                    33230000
 WRK_COVERAGE_END_6     = RCBM10I.COVERAGE_END_6I;                      33240000
 WRK_COVERAGE_START_7   = RCBM10I.COVERAGE_START_7I;                    33250000
 WRK_COVERAGE_END_7     = RCBM10I.COVERAGE_END_7I;                      33260000
                                                                        33270000
0END RCBC10M_SAVE_MAP;                                                  33280000
1/********************************************************************/ 33290000
 /*      RESTORE MAP                                                 */ 33300000
 /********************************************************************/ 33310000
0RCBC10M_RESTORE_MAP : PROC;                                            33320000
                                                                        33330000
 RCBM10O.COUNTRY_NUMBERO   = WRK_COUNTRY_NUMBER;                        33340000
 RCBM10O.ACTIONO           = WRK_ACTION;                                33350000
 RCBM10O.TYPEO             = WRK_PRODUCT_TYPE;                          33360000
 RCBM10O.ORIGINO           = WRK_ORIGIN;                                33370000
 RCBM10O.SEQNOO            = WRK_SEQUENCE_NUMBER;                       33380000
 RCBM10O.EFFECTIVE_DATEO   = WRK_EFFECTIVE_DATE;                        33390000
 RCBM10O.END_DATEO         = WRK_END_DATE;                              33400000
 RCBM10O.AGREEMENT_TYPEO   = WRK_AGREEMENT_TYPE;                        33410000
 RCBM10O.AGREEMENT_OPTIONO = WRK_AGREEMENT_OPTION;                      33420000
 RCBM10O.SERVICE_TYPEO     = WRK_SERVICE_TYPE;                          33430000
 RCBM10O.SERVICE_LVL_CODEO = WRK_SERVICE_LVL_CODE;                      33440000
 RCBM10O.COVERAGE_START_1O = WRK_COVERAGE_START_1;                      33450000
 RCBM10O.COVERAGE_END_1O   = WRK_COVERAGE_END_1;                        33460000
 RCBM10O.COVERAGE_START_2O = WRK_COVERAGE_START_2;                      33470000
 RCBM10O.COVERAGE_END_2O   = WRK_COVERAGE_END_2;                        33480000
 RCBM10O.COVERAGE_START_3O = WRK_COVERAGE_START_3;                      33490000
 RCBM10O.COVERAGE_END_3O   = WRK_COVERAGE_END_3;                        33500000
 RCBM10O.COVERAGE_START_4O = WRK_COVERAGE_START_4;                      33510000
 RCBM10O.COVERAGE_END_4O   = WRK_COVERAGE_END_4;                        33520000
 RCBM10O.COVERAGE_START_5O = WRK_COVERAGE_START_5;                      33530000
 RCBM10O.COVERAGE_END_5O   = WRK_COVERAGE_END_5;                        33540000
 RCBM10O.COVERAGE_START_6O = WRK_COVERAGE_START_6;                      33550000
 RCBM10O.COVERAGE_END_6O   = WRK_COVERAGE_END_6;                        33560000
 RCBM10O.COVERAGE_START_7O = WRK_COVERAGE_START_7;                      33570000
 RCBM10O.COVERAGE_END_7O   = WRK_COVERAGE_END_7;                        33580000
                                                                        33590000
0END RCBC10M_RESTORE_MAP;                                               33600000
1/********************************************************************/ 33610000
 /*     CLEAR MAP FIELDS                                             */ 33620000
 /********************************************************************/ 33630000
0RCBC10M_CLEAR_MAP: PROC;                                               33640000
                                                                        33650000
 RCBM10O.COUNTRY_NUMBERO       = WRK_COUNTRY_NUMBER;                    33660000
 RCBM10O.ACTIONO               = '';                                    33670000
 RCBM10O.TYPEO                 = '';                                    33680000
 RCBM10O.ORIGINO               = '';                                    33690000
 RCBM10O.SEQNOO                = '';                                    33700000
 RCBM10O.EFFECTIVE_DATEO       = '';                                    33710000
 RCBM10O.END_DATEO             = '';                                    33720000
 RCBM10O.AGREEMENT_TYPEO       = '';                                    33730000
 RCBM10O.AGREEMENT_OPTIONO     = '';                                    33740000
 RCBM10O.SERVICE_TYPEO         = '';                                    33750000
 RCBM10O.SERVICE_LVL_CODEO     = '';                                    33760000
 RCBM10O.COVERAGE_START_1O     = '00.00';                               33770000
 RCBM10O.COVERAGE_END_1O       = '00.00';                               33780000
 RCBM10O.COVERAGE_START_2O     = '00.00';                               33790000
 RCBM10O.COVERAGE_END_2O       = '00.00';                               33800000
 RCBM10O.COVERAGE_START_3O     = '00.00';                               33810000
 RCBM10O.COVERAGE_END_3O       = '00.00';                               33820000
 RCBM10O.COVERAGE_START_4O     = '00.00';                               33830000
 RCBM10O.COVERAGE_END_4O       = '00.00';                               33840000
 RCBM10O.COVERAGE_START_5O     = '00.00';                               33850000
 RCBM10O.COVERAGE_END_5O       = '00.00';                               33860000
 RCBM10O.COVERAGE_START_6O     = '00.00';                               33870000
 RCBM10O.COVERAGE_END_6O       = '00.00';                               33880000
 RCBM10O.COVERAGE_START_7O     = '00.00';                               33890000
 RCBM10O.COVERAGE_END_7O       = '00.00';                               33900000
                                                                        33910000
0END RCBC10M_CLEAR_MAP;                                                 33920000
1/********************************************************************/ 33930000
 /*      CLEAR MAP RCBM10A                                           */ 33940000
 /********************************************************************/ 33950000
0RCBC10M_CLEAR_MAPA: PROC;                                              33960000
                                                                        33970000
 M = 0;                                                                 33980000
 RCBM10AO.INCNTO    = '';                                               33990000
 RCBM10AO.TOTCNTO   = '';                                               34000000
 RCBM10AO.TYPE_SELO   = '';                                             34010000
 RCBM10AO.ORIGIN_SELO = '';                                             34020000
 RCBM10AO.SEQ_SELO    = '';                                             34030000
                                                                        34040000
 RCBM10AO.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                         34050000
 DO I = 1 TO 15;                                                        34060000
   RCBM10AO.PRODUCT_TYPEO(I)    = '';                                   34070000
   RCBM10AO.ORIGINO(I)          = '';                                   34080000
   RCBM10AO.SEQUENCE_NUMBERO(I) = '';                                   34090000
   RCBM10AO.EFFECTIVE_DATEO(I)  = '';                                   34100000
   RCBM10AO.END_DATEO(I)        = '';                                   34110000
   RCBM10AO.SELO(I)             = '';                                   34120000
 END;                                                                   34130000
                                                                        34140000
0END RCBC10M_CLEAR_MAPA;                                                34150000
1/********************************************************************/ 34160000
 /*      CLEAR MAP RCBM10A 2                                         */ 34170000
 /********************************************************************/ 34180000
0RCBC10M_CLEAR_MAPA_2: PROC;                                            34190000
                                                                        34200000
 M = 0;                                                                 34210000
 RCBM10AO.INCNTO    = '';                                               34220000
 RCBM10AO.TOTCNTO   = '';                                               34230000
                                                                        34240000
 DO I = 1 TO 15;                                                        34250000
   RCBM10AO.PRODUCT_TYPEO(I)    = '';                                   34260000
   RCBM10AO.ORIGINO(I)          = '';                                   34270000
   RCBM10AO.SEQUENCE_NUMBERO(I) = '';                                   34280000
   RCBM10AO.EFFECTIVE_DATEO(I)  = '';                                   34290000
   RCBM10AO.END_DATEO(I)        = '';                                   34300000
   RCBM10AO.SELO(I)             = '';                                   34310000
 END;                                                                   34320000
                                                                        34330000
0END RCBC10M_CLEAR_MAPA_2;                                              34340000
1/********************************************************************/ 34350000
 /*      SEND MAP RCBM10                                             */ 34360000
 /********************************************************************/ 34370000
0RCBC10M_SEND_MAP : PROC;                                               34380000
                                                                        34390000
 HEADER.REQUEST_ID = '';                                                34400000
 RCBM10O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                          34410000
                                                                        34420000
0EXEC CICS SEND                                                         34430000
    MAP('RCBM10')                                                       34440000
    MAPSET('RCBM10')                                                    34450000
    FREEKB                                                              34460000
    ERASE                                                               34470000
    RESP(RESPONSE)                                                      34480000
    RESP2(CODE_EXPLAIN);                                                34490000
                                                                        34500000
0EXEC CICS RETURN                                                       34510000
    TRANSID('RC10')                                                     34520000
    COMMAREA(COMMAREA)                                                  34530000
    LENGTH(CSTG(COMMAREA))                                              34540000
    RESP(RESPONSE)                                                      34550000
    RESP2(CODE_EXPLAIN);                                                34560000
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 34570000
   WHEN(DFHRESP(NORMAL));                                               34580000
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  34590000
   DO;                                                                  34600000
     COMMAREA_LENGTH = EIBCALEN;                                        34610000
     EXEC CICS RETURN                                                   34620000
        TRANSID('RC10')                                                 34630000
        COMMAREA(COMMAREA)                                              34640000
        LENGTH(COMMAREA_LENGTH);                                        34650000
   END;                                                                 34660000
   OTHERWISE                                                            34670000
   DO;                                                                  34680000
     RCBM10O.MSG_LINEO = ERR_MESSAGE30;                                 34690000
     CALL RCBC10M_SEND_MAP_CSR;                                         34700000
   END;                                                                 34710000
 END;                                                                   34720000
                                                                        34730000
0END RCBC10M_SEND_MAP;                                                  34740000
1/********************************************************************/ 34750000
 /*      SEND MAP RCBM10A                                            */ 34760000
 /********************************************************************/ 34770000
0RCBC10M_SEND_MAPA: PROC;                                               34780000
                                                                        34790000
 HEADER.REQUEST_ID = 'A';                                               34800000
                                                                        34810000
0EXEC CICS SEND                                                         34820000
    MAP('RCBM10A')                                                      34830000
    MAPSET('RCBM10')                                                    34840000
    FREEKB                                                              34850000
    ERASE                                                               34860000
    RESP(RESPONSE)                                                      34870000
    RESP2(CODE_EXPLAIN);                                                34880000
                                                                        34890000
0EXEC CICS RETURN                                                       34900000
    TRANSID('RC10')                                                     34910000
    COMMAREA(COMMAREA)                                                  34920000
    LENGTH(CSTG(COMMAREA))                                              34930000
    RESP(RESPONSE)                                                      34940000
    RESP2(CODE_EXPLAIN);                                                34950000
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 34960000
   WHEN(DFHRESP(NORMAL));                                               34970000
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  34980000
   DO;                                                                  34990000
     COMMAREA_LENGTH = EIBCALEN;                                        35000000
     EXEC CICS RETURN                                                   35010000
        TRANSID('RC10')                                                 35020000
        COMMAREA(COMMAREA)                                              35030000
        LENGTH(COMMAREA_LENGTH);                                        35040000
   END;                                                                 35050000
   OTHERWISE                                                            35060000
   DO;                                                                  35070000
     RCBM10AO.MSG_LINEO = ERR_MESSAGE30;                                35080000
     CALL RCBC10M_SEND_MAPA_CSR;                                        35090000
   END;                                                                 35100000
 END;                                                                   35110000
                                                                        35120000
0END RCBC10M_SEND_MAPA;                                                 35130000
1/********************************************************************/ 35140000
 /*      SEND HELP MAP                                               */ 35150000
 /********************************************************************/ 35160000
0RCBC10M_HELP_MAP : PROC;                                               35170000
                                                                        35180000
 HEADER.NEXT = 'H0';                                                    35190000
 HELP_FLAG   = FALSE;                                                   35200000
                                                                        35210000
 IF HEADER.REQUEST_ID = 'A' THEN                                        35220000
 DO;                                                                    35230000
   IF HELP_FLAG = FALSE THEN                                            35240000
   DO;                                                                  35250000
     EXEC CICS SEND                                                     35260000
        MAP('RCBH10C')                                                  35270000
        MAPSET('RCBM10')                                                35280000
        FREEKB                                                          35290000
        ERASE;                                                          35300000
   END;                                                                 35310000
 END;                                                                   35320000
                                                                        35330000
 IF HEADER.REQUEST_ID = '' THEN                                         35340000
 DO;                                                                    35350000
   CSR_POS     = 1;                                                     35360000
   CALL RCBC10M_RECEIVE_MAP;                                            35370000
   CALL RCBC10M_SAVE_MAP;                                               35380000
                                                                        35390000
   IF RCBM10I.ACTIONF = CSR_HELP                                        35400000
    | RCBM10I.ACTIONF = CSR_EOF THEN                                    35410000
   DO;                                                                  35420000
     CSR_POS   = 1;                                                     35430000
     HELP_FLAG = TRUE;                                                  35440000
     EXEC CICS SEND                                                     35450000
        MAP('ACT123')                                                   35460000
        MAPSET('RCBHELP')                                               35470000
        FREEKB                                                          35480000
        ERASE;                                                          35490000
   END;                                                                 35500000
                                                                        35510000
   IF RCBM10I.TYPEF = CSR_HELP                                          35520000
    | RCBM10I.TYPEF = CSR_EOF THEN                                      35530000
   DO;                                                                  35540000
     CSR_POS   = 2;                                                     35550000
     HELP_FLAG = TRUE;                                                  35560000
     EXEC CICS SEND                                                     35570000
        MAP('TOS')                                                      35580000
        MAPSET('RCBHELP')                                               35590000
        FREEKB                                                          35600000
        ERASE;                                                          35610000
   END;                                                                 35620000
                                                                        35630000
   IF RCBM10I.ORIGINF = CSR_HELP                                        35640000
    | RCBM10I.ORIGINF = CSR_EOF THEN                                    35650000
   DO;                                                                  35660000
     CSR_POS   = 3;                                                     35670000
     HELP_FLAG = TRUE;                                                  35680000
     EXEC CICS SEND                                                     35690000
        MAP('TOS')                                                      35700000
        MAPSET('RCBHELP')                                               35710000
        FREEKB                                                          35720000
        ERASE;                                                          35730000
   END;                                                                 35740000
                                                                        35750000
   IF RCBM10I.SEQNOF = CSR_HELP                                         35760000
    | RCBM10I.SEQNOF = CSR_EOF THEN                                     35770000
   DO;                                                                  35780000
     CSR_POS   = 4;                                                     35790000
     HELP_FLAG = TRUE;                                                  35800000
     EXEC CICS SEND                                                     35810000
        MAP('TOS')                                                      35820000
        MAPSET('RCBHELP')                                               35830000
        FREEKB                                                          35840000
        ERASE;                                                          35850000
   END;                                                                 35860000
                                                                        35870000
   IF RCBM10I.EFFECTIVE_DATEF = CSR_HELP                                35880000
    | RCBM10I.EFFECTIVE_DATEF = CSR_EOF THEN                            35890000
   DO;                                                                  35900000
     CSR_POS   = 5;                                                     35910000
     HELP_FLAG = TRUE;                                                  35920000
     EXEC CICS SEND                                                     35930000
        MAP('EFFDATE')                                                  35940000
        MAPSET('RCBHELP')                                               35950000
        FREEKB                                                          35960000
        ERASE;                                                          35970000
   END;                                                                 35980000
                                                                        35990000
   IF RCBM10I.END_DATEF = CSR_HELP                                      36000000
    | RCBM10I.END_DATEF = CSR_EOF THEN                                  36010000
   DO;                                                                  36020000
     CSR_POS   = 6;                                                     36030000
     HELP_FLAG = TRUE;                                                  36040000
     EXEC CICS SEND                                                     36050000
        MAP('ENDDATE')                                                  36060000
        MAPSET('RCBHELP')                                               36070000
        FREEKB                                                          36080000
        ERASE;                                                          36090000
   END;                                                                 36100000
                                                                        36110000
   IF RCBM10I.AGREEMENT_TYPEF = CSR_HELP                                36120000
    | RCBM10I.AGREEMENT_TYPEF = CSR_EOF THEN                            36130000
   DO;                                                                  36140000
     CSR_POS   = 7;                                                     36150000
     HELP_FLAG = TRUE;                                                  36160000
     EXEC CICS SEND                                                     36170000
        MAP('AGRTYP')                                                   36180000
        MAPSET('RCBHELP')                                               36190000
        FREEKB                                                          36200000
        ERASE;                                                          36210000
   END;                                                                 36220000
                                                                        36230000
   IF RCBM10I.AGREEMENT_OPTIONF = CSR_HELP                              36240000
    | RCBM10I.AGREEMENT_OPTIONF = CSR_EOF THEN                          36250000
   DO;                                                                  36260000
     CSR_POS   = 8;                                                     36270000
     HELP_FLAG = TRUE;                                                  36280000
     EXEC CICS SEND                                                     36290000
        MAP('AGROPT')                                                   36300000
        MAPSET('RCBHELP')                                               36310000
        FREEKB                                                          36320000
        ERASE;                                                          36330000
   END;                                                                 36340000
                                                                        36350000
   IF RCBM10I.SERVICE_TYPEF = CSR_HELP                                  36360000
    | RCBM10I.SERVICE_TYPEF = CSR_EOF THEN                              36370000
   DO;                                                                  36380000
     CSR_POS   = 9;                                                     36390000
     HELP_FLAG = TRUE;                                                  36400000
     EXEC CICS SEND                                                     36410000
        MAP('SERVTYP')                                                  36420000
        MAPSET('RCBHELP')                                               36430000
        FREEKB                                                          36440000
        ERASE;                                                          36450000
   END;                                                                 36460000
                                                                        36470000
   IF RCBM10I.SERVICE_LVL_CODEF = CSR_HELP                              36480000
    | RCBM10I.SERVICE_LVL_CODEF = CSR_EOF THEN                          36490000
   DO;                                                                  36500000
     CSR_POS   = 10;                                                    36510000
     HELP_FLAG = TRUE;                                                  36520000
     EXEC CICS SEND                                                     36530000
        MAP('SLC')                                                      36540000
        MAPSET('RCBHELP')                                               36550000
        FREEKB                                                          36560000
        ERASE;                                                          36570000
   END;                                                                 36580000
                                                                        36590000
   IF RCBM10I.COVERAGE_START_1F = CSR_HELP                              36600000
    | RCBM10I.COVERAGE_START_1F = CSR_EOF THEN                          36610000
   DO;                                                                  36620000
     CSR_POS   = 11;                                                    36630000
     HELP_FLAG = TRUE;                                                  36640000
     EXEC CICS SEND                                                     36650000
        MAP('SRVHRSF')                                                  36660000
        MAPSET('RCBHELP')                                               36670000
        FREEKB                                                          36680000
        ERASE;                                                          36690000
   END;                                                                 36700000
                                                                        36710000
   IF RCBM10I.COVERAGE_START_2F = CSR_HELP                              36720000
    | RCBM10I.COVERAGE_START_2F = CSR_EOF THEN                          36730000
   DO;                                                                  36740000
     CSR_POS   = 12;                                                    36750000
     HELP_FLAG = TRUE;                                                  36760000
     EXEC CICS SEND                                                     36770000
        MAP('SRVHRSF')                                                  36780000
        MAPSET('RCBHELP')                                               36790000
        FREEKB                                                          36800000
        ERASE;                                                          36810000
   END;                                                                 36820000
                                                                        36830000
   IF RCBM10I.COVERAGE_START_3F = CSR_HELP                              36840000
    | RCBM10I.COVERAGE_START_3F = CSR_EOF THEN                          36850000
   DO;                                                                  36860000
     CSR_POS   = 13;                                                    36870000
     HELP_FLAG = TRUE;                                                  36880000
     EXEC CICS SEND                                                     36890000
        MAP('SRVHRSF')                                                  36900000
        MAPSET('RCBHELP')                                               36910000
        FREEKB                                                          36920000
        ERASE;                                                          36930000
   END;                                                                 36940000
                                                                        36950000
   IF RCBM10I.COVERAGE_START_4F = CSR_HELP                              36960000
    | RCBM10I.COVERAGE_START_4F = CSR_EOF THEN                          36970000
   DO;                                                                  36980000
     CSR_POS   = 14;                                                    36990000
     HELP_FLAG = TRUE;                                                  37000000
     EXEC CICS SEND                                                     37010000
        MAP('SRVHRSF')                                                  37020000
        MAPSET('RCBHELP')                                               37030000
        FREEKB                                                          37040000
        ERASE;                                                          37050000
   END;                                                                 37060000
                                                                        37070000
   IF RCBM10I.COVERAGE_START_5F = CSR_HELP                              37080000
    | RCBM10I.COVERAGE_START_5F = CSR_EOF THEN                          37090000
   DO;                                                                  37100000
     CSR_POS   = 15;                                                    37110000
     HELP_FLAG = TRUE;                                                  37120000
     EXEC CICS SEND                                                     37130000
        MAP('SRVHRSF')                                                  37140000
        MAPSET('RCBHELP')                                               37150000
        FREEKB                                                          37160000
        ERASE;                                                          37170000
   END;                                                                 37180000
                                                                        37190000
   IF RCBM10I.COVERAGE_START_6F = CSR_HELP                              37200000
    | RCBM10I.COVERAGE_START_6F = CSR_EOF THEN                          37210000
   DO;                                                                  37220000
     CSR_POS   = 16;                                                    37230000
     HELP_FLAG = TRUE;                                                  37240000
     EXEC CICS SEND                                                     37250000
        MAP('SRVHRSF')                                                  37260000
        MAPSET('RCBHELP')                                               37270000
        FREEKB                                                          37280000
        ERASE;                                                          37290000
   END;                                                                 37300000
                                                                        37310000
   IF RCBM10I.COVERAGE_START_7F = CSR_HELP                              37320000
    | RCBM10I.COVERAGE_START_7F = CSR_EOF THEN                          37330000
   DO;                                                                  37340000
     CSR_POS   = 17;                                                    37350000
     HELP_FLAG = TRUE;                                                  37360000
     EXEC CICS SEND                                                     37370000
        MAP('SRVHRSF')                                                  37380000
        MAPSET('RCBHELP')                                               37390000
        FREEKB                                                          37400000
        ERASE;                                                          37410000
   END;                                                                 37420000
                                                                        37430000
   IF RCBM10I.COVERAGE_END_1F = CSR_HELP                                37440000
    | RCBM10I.COVERAGE_END_1F = CSR_EOF THEN                            37450000
   DO;                                                                  37460000
     CSR_POS   = 18;                                                    37470000
     HELP_FLAG = TRUE;                                                  37480000
     EXEC CICS SEND                                                     37490000
        MAP('SRVHRST')                                                  37500000
        MAPSET('RCBHELP')                                               37510000
        FREEKB                                                          37520000
        ERASE;                                                          37530000
   END;                                                                 37540000
                                                                        37550000
   IF RCBM10I.COVERAGE_END_2F = CSR_HELP                                37560000
    | RCBM10I.COVERAGE_END_2F = CSR_EOF THEN                            37570000
   DO;                                                                  37580000
     CSR_POS   = 19;                                                    37590000
     HELP_FLAG = TRUE;                                                  37600000
     EXEC CICS SEND                                                     37610000
        MAP('SRVHRST')                                                  37620000
        MAPSET('RCBHELP')                                               37630000
        FREEKB                                                          37640000
        ERASE;                                                          37650000
   END;                                                                 37660000
                                                                        37670000
   IF RCBM10I.COVERAGE_END_3F = CSR_HELP                                37680000
    | RCBM10I.COVERAGE_END_3F = CSR_EOF THEN                            37690000
   DO;                                                                  37700000
     CSR_POS   = 20;                                                    37710000
     HELP_FLAG = TRUE;                                                  37720000
     EXEC CICS SEND                                                     37730000
        MAP('SRVHRST')                                                  37740000
        MAPSET('RCBHELP')                                               37750000
        FREEKB                                                          37760000
        ERASE;                                                          37770000
   END;                                                                 37780000
                                                                        37790000
   IF RCBM10I.COVERAGE_END_4F = CSR_HELP                                37800000
    | RCBM10I.COVERAGE_END_4F = CSR_EOF THEN                            37810000
   DO;                                                                  37820000
     CSR_POS   = 21;                                                    37830000
     HELP_FLAG = TRUE;                                                  37840000
     EXEC CICS SEND                                                     37850000
        MAP('SRVHRST')                                                  37860000
        MAPSET('RCBHELP')                                               37870000
        FREEKB                                                          37880000
        ERASE;                                                          37890000
   END;                                                                 37900000
                                                                        37910000
   IF RCBM10I.COVERAGE_END_5F = CSR_HELP                                37920000
    | RCBM10I.COVERAGE_END_5F = CSR_EOF THEN                            37930000
   DO;                                                                  37940000
     CSR_POS   = 22;                                                    37950000
     HELP_FLAG = TRUE;                                                  37960000
     EXEC CICS SEND                                                     37970000
        MAP('SRVHRST')                                                  37980000
        MAPSET('RCBHELP')                                               37990000
        FREEKB                                                          38000000
        ERASE;                                                          38010000
   END;                                                                 38020000
                                                                        38030000
   IF RCBM10I.COVERAGE_END_6F = CSR_HELP                                38040000
    | RCBM10I.COVERAGE_END_6F = CSR_EOF THEN                            38050000
   DO;                                                                  38060000
     CSR_POS   = 23;                                                    38070000
     HELP_FLAG = TRUE;                                                  38080000
     EXEC CICS SEND                                                     38090000
        MAP('SRVHRST')                                                  38100000
        MAPSET('RCBHELP')                                               38110000
        FREEKB                                                          38120000
        ERASE;                                                          38130000
   END;                                                                 38140000
                                                                        38150000
   IF RCBM10I.COVERAGE_END_7F = CSR_HELP                                38160000
    | RCBM10I.COVERAGE_END_7F = CSR_EOF THEN                            38170000
   DO;                                                                  38180000
     CSR_POS   = 24;                                                    38190000
     HELP_FLAG = TRUE;                                                  38200000
     EXEC CICS SEND                                                     38210000
        MAP('SRVHRST')                                                  38220000
        MAPSET('RCBHELP')                                               38230000
        FREEKB                                                          38240000
        ERASE;                                                          38250000
   END;                                                                 38260000
                                                                        38270000
   IF HELP_FLAG = FALSE THEN                                            38280000
   DO;                                                                  38290000
     HEADER.NEXT = 'H2';                                                38300000
                                                                        38310000
     EXEC CICS SEND                                                     38320000
        MAP('RCBH10A')                                                  38330000
        MAPSET('RCBM10')                                                38340000
        FREEKB                                                          38350000
        ERASE;                                                          38360000
   END;                                                                 38370000
 END;                                                                   38380000
                                                                        38390000
0EXEC CICS RETURN                                                       38400000
    TRANSID('RC10')                                                     38410000
    COMMAREA(COMMAREA)                                                  38420000
    LENGTH(CSTG(COMMAREA))                                              38430000
    RESP(RESPONSE)                                                      38440000
    RESP2(CODE_EXPLAIN);                                                38450000
                                                                        38460000
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 38470000
   WHEN(DFHRESP(NORMAL));                                               38480000
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  38490000
   DO;                                                                  38500000
     COMMAREA_LENGTH = EIBCALEN;                                        38510000
     EXEC CICS RETURN                                                   38520000
        TRANSID('RC10')                                                 38530000
        COMMAREA(COMMAREA)                                              38540000
        LENGTH(COMMAREA_LENGTH);                                        38550000
   END;                                                                 38560000
   OTHERWISE                                                            38570000
   DO;                                                                  38580000
     RCBM10O.MSG_LINEO = ERR_MESSAGE30;                                 38590000
     CALL RCBC10M_SEND_MAP_CSR;                                         38600000
   END;                                                                 38610000
 END;                                                                   38620000
                                                                        38630000
0END RCBC10M_HELP_MAP;                                                  38640000
1/********************************************************************/ 38650000
 /*      SEND HELP MAP1                                              */ 38660000
 /********************************************************************/ 38670000
0RCBC10M_HELP_MAP1: PROC;                                               38680000
                                                                        38690000
 /*HEADER.NEXT = 'H1';                                   SOC RB01308  */38700000
 IF HEADER.NEXT = 'H2' THEN                /* FOR THE HELP FUNCTION F8*/38710000
  DO;                                                                   38720000
    HEADER.NEXT = 'H1';                                                 38730000
0   EXEC CICS SEND                                                      38740000
        MAP('RCBH10B')                                                  38750000
        MAPSET('RCBM10')                                                38760000
        FREEKB                                                          38770000
        ERASE;                                                          38780000
  END;                                                                  38790000
  ELSE                                                                  38800000
  IF HEADER.NEXT = 'H1' THEN               /* FOR THE HELP FUNCTION F7*/38810000
   DO;                                                                  38820000
     HEADER.NEXT = 'H2';                                                38830000
0    EXEC CICS SEND                                                     38840000
         MAP('RCBH10A')                                                 38850000
         MAPSET('RCBM10')                                               38860000
         FREEKB                                                         38870000
         ERASE;                                                         38880000
  END;                                                 /* EOC RB01308 */38890000
                                                                        38900000
0EXEC CICS RETURN                                                       38910000
    TRANSID('RC10')                                                     38920000
    COMMAREA(COMMAREA)                                                  38930000
    LENGTH(CSTG(COMMAREA))                                              38940000
    RESP(RESPONSE)                                                      38950000
    RESP2(CODE_EXPLAIN);                                                38960000
                                                                        38970000
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 38980000
   WHEN(DFHRESP(NORMAL));                                               38990000
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  39000000
   DO;                                                                  39010000
     COMMAREA_LENGTH = EIBCALEN;                                        39020000
     EXEC CICS RETURN                                                   39030000
        TRANSID('RC10')                                                 39040000
        COMMAREA(COMMAREA)                                              39050000
        LENGTH(COMMAREA_LENGTH);                                        39060000
   END;                                                                 39070000
   OTHERWISE                                                            39080000
   DO;                                                                  39090000
     RCBM10O.MSG_LINEO = ERR_MESSAGE30;                                 39100000
     CALL RCBC10M_SEND_MAP_CSR;                                         39110000
   END;                                                                 39120000
 END;                                                                   39130000
                                                                        39140000
0END RCBC10M_HELP_MAP1;                                                 39150000
1/********************************************************************/ 39160000
 /*      SEND ERROR MAP - WITH CURSOR RCBM10                         */ 39170000
 /********************************************************************/ 39180000
 RCBC10M_SEND_MAP_CSR : PROC;                                           39190000
                                                                        39200000
 HEADER.REQUEST_ID = '';                                                39210000
                                                                        39220000
 PF5_FLAG    = FALSE;                                                   39230000
 IF T110_FLAG = TRUE  THEN                          /*SOC CEDS00000733*/39240000
 DO;                                                /*EOC CEDS00000733*/39250000
    WRK_ACTION  = '';                                                   39260000
 END;                                                   /*CEDS00000733*/39270000
                                                                        39280000
 EXEC CICS SEND                                                         39290000
    MAP('RCBM10')                                                       39300000
    MAPSET('RCBM10')                                                    39310000
    CURSOR                                                              39320000
    ERASE                                                               39330000
    FREEKB;                                                             39340000
                                                                        39350000
 EXEC CICS RETURN                                                       39360000
    TRANSID('RC10')                                                     39370000
    COMMAREA(COMMAREA)                                                  39380000
    LENGTH(CSTG(COMMAREA));                                             39390000
                                                                        39400000
 END RCBC10M_SEND_MAP_CSR;                                              39410000
1/********************************************************************/ 39420000
 /*      SEND ERROR MAP - WITH CURSOR RCBM10A                        */ 39430000
 /********************************************************************/ 39440000
 RCBC10M_SEND_MAPA_CSR: PROC;                                           39450000
                                                                        39460000
 HEADER.REQUEST_ID = 'A';                                               39470000
                                                                        39480000
 EXEC CICS SEND                                                         39490000
    MAP('RCBM10A')                                                      39500000
    MAPSET('RCBM10')                                                    39510000
    CURSOR                                                              39520000
    ERASE                                                               39530000
    FREEKB;                                                             39540000
                                                                        39550000
 EXEC CICS RETURN                                                       39560000
    TRANSID('RC10')                                                     39570000
    COMMAREA(COMMAREA)                                                  39580000
    LENGTH(CSTG(COMMAREA));                                             39590000
                                                                        39600000
 END RCBC10M_SEND_MAPA_CSR;                                             39610000
                                                 /* SOC CEDS00000737 */ 39620000
1/********************************************************************/ 39630000
 /*                                                                  */ 39640000
 /* MODULE NAME      : FUT_DELETE_T220                               */ 39650000
 /*                                                                  */ 39660000
 /* DESCRIPTION      : DELETE ALL RECORD OF RCBV0220_SUPPL_CTR       */ 39670000
 /*                    BETWEEN TWO DATES USING RCBHAVN               */ 39680000
 /*                                                                  */ 39690000
 /********************************************************************/ 39700000
 RCBC10M_FUT_DELETE_T220: PROC;                                         39710000
   CALL RCBC10M_ADD_ONE_DAY (RCB220S.END_DATE,                          39720000
                           DATE1);                                      39730000
   IF RCB220S.EFFECTIVE_DATE ¬= '9999-12-31'                            39740000
   THEN                                                                 39750000
   DO;                                                                  39760000
    EXEC SQL                                                            39770000
      DELETE FROM RCBV0220_SUPPL_CTR                                    39780000
       WHERE COUNTRY_NUMBER     = :RCB220S.COUNTRY_NUMBER               39790000
         AND PRODUCT_TYPE       = :RCB220S.PRODUCT_TYPE                 39800000
         AND ORIGIN             = :RCB220S.ORIGIN                       39810000
         AND SEQUENCE_NUMBER    = :RCB220S.SEQUENCE_NUMBER              39820000
         AND EFFECTIVE_DATE    >= :DATE1                                39830000
         AND END_DATE          <= '9999-12-31'                          39840000
         AND TYPE_OF_WARRANTY IS NULL;                                  39850000
                                                                        39860000
     SELECT (SQLCA.SQLCODE);                                            39870000
     WHEN (0,100);                                                      39880000
     OTHERWISE                                                          39890000
     DO;                                                                39900000
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     39910000
       RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM FUT DEL OF RCBT0220 = ' 39920000
                          || PIC_EXPLAIN;                               39930000
       CALL RCBC10M_SEND_MAP;                                           39940000
     END;                                                               39950000
   END;                                                                 39960000
 END RCBC10M_FUT_DELETE_T220;                                           39970000
1/********************************************************************/ 39980000
 /*                                                                  */ 39990000
 /* MODULE NAME      : INSERT_SP                                     */ 40000000
 /*                                                                  */ 40010000
 /* DESCRIPTION      : INSERT ROW INTO RCBV0220_SUPPLY_CTR           */ 40020000
 /*                    USING RCBFAVN                                 */ 40030000
 /*                                                                  */ 40040000
 /********************************************************************/ 40050000
 RCBC10M_INSERT_SP: PROC;                                               40060000
                                     /* FILL DUMMY RECORD            */ 40070000
 RCB220SI.INDNULL (*)      = 0;                                         40080000
 RCB220S.COUNTRY_NUMBER    = WRK_COUNTRY_NUMBER;                        40090000
 RCB220S.PRODUCT_TYPE      = WRK_PRODUCT_TYPE;                          40100000
 RCB220S.ORIGIN            = WRK_ORIGIN;                                40110000
 RCB220S.SEQUENCE_NUMBER   = WRK_SEQUENCE_NUMBER;                       40120000
 RCB220S.TYPE_OF_MAINT     = LOW(1);                                    40130000
 RCB220SI.INDNULL (5)      = 0;                                         40140000
 RCB220S.TYPE_OF_WARRANTY  = '';                                        40150000
 RCB220SI.INDNULL (6)      = -1;                                        40160000
 RCB220S.SERVICE_LVL_CODE  = '';                                        40170000
 RCB220SI.INDNULL (7)      = -1;                                        40180000
 RCB220S.WARRANTY_EXP_DATE = '';                                        40190000
 RCB220SI.INDNULL (8)      = 99;        /*  DO NOT OVERWRITE THE WED */ 40200000
 RCB220S.SOURCE_INDICATOR  = '';                                        40210000
 PARM_INT_AREA.RUN_DATE    = WRK_DATE;               /* SOC RC01360 */  40210100
 RCB220S.LAST_CHANGE_DATE  = WRK_DATE;               /* EOC RC01360 */  40211000
 RCB220S.END_DATE          = '9999-12-31';                              40220000
 RCB220S.F_TYPE_OF_WARRANTY= '';                         /* RC01360 */  40221000
 RCB220SI.INDNULL (13)     = -1;                                        40230000
 RCB220S.F_SPLT_DATE       = '';                         /* RC01360 */  40231000
 RCB220SI.INDNULL (14)     = -1;                                        40240000
 RCB220S.SERVICE_LVL_CODE_2= '';                     /* SOC RC01360 */  40240100
 RCB220SI.INDNULL (15)     = -1;                     /* EOC RC01360 */  40241000
 CALL RCBC10M_ADD_ONE_DAY (RCBM10I.END_DATEI,                           40250000
                           RCB220S.EFFECTIVE_DATE);                     40260000
                                     /* INSERT INTO TABLE            */ 40270000
 IF RCB220S.EFFECTIVE_DATE ¬= ''                                        40280000
 THEN DO;                                                               40290000
   CALL RCBFAVN (ADDR(RCB220S),                                         40300000
                 ADDR(RCB220SI),                                        40310000
                 ADDR(RCBZ02S),                                         40320000
                 ADDR(PARM_INT_AREA));                                  40330000
   SELECT (RCBZ02S.RETURN_CODE);                                        40340000
     WHEN (0)                                                           40350000
       ;                                                                40360000
     OTHERWISE                                                          40370000
     DO;                                                                40380000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBFAVN = '               40390000
                       || RCBZ02S.RETURN_CODE;                          40400000
     RCBM10O.TYPEC     = DFHRED;                                        40410000
     RCBM10I.TYPEL     = -1;                                            40420000
     CALL RCBC10M_SEND_MAP_CSR;                                         40430000
     END;                                                               40440000
 END;                                                                   40450000
 END RCBC10M_INSERT_SP;                                                 40460000
1/********************************************************************/ 40470000
 /*                                                                  */ 40480000
 /* MODULE NAME      : RCBC10M_ADD_ONE_DAY                           */ 40490000
 /*                                                                  */ 40500000
 /* DESCRIPTION      : ADD ONE DAY TO DATE                           */ 40510000
 /*                                                                  */ 40520000
 /********************************************************************/ 40530000
 RCBC10M_ADD_ONE_DAY: PROC (DATE_IN,                                    40540000
                            DATE_OUT);                                  40550000
 DCL DATE_IN  CHAR (10);                                                40560000
 DCL DATE_OUT CHAR (10);                                                40570000
 IF DATE_IN = '9999-12-31'                                              40580000
 THEN                                                                   40590000
 DO;                                                                    40600000
   DATE_OUT = '';                                                       40610000
 END;                                                                   40620000
 ELSE                                                                   40630000
 DO;                                                                    40640000
   DATE_AREA              = '';                                         40650000
   DATE_AREA.WD_IN_FORMAT   = 'ISO';                                    40660000
   DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                    40670000
   DATE_AREA.WD_IN_DATE     = DATE_IN;                                  40680000
   DATE_AREA.WD_FUNCTION    = 'C';                                      40690000
   DATE_AREA.WD_PERIOD      = 1;                                        40700000
   DATE_AREA.WD_PERIOD_TYPE = 'D';                                      40710000
   CALL RCB004N (ADDR(DATE_AREA));                                      40720000
   RCBZ02S.RETURN_CODE      = DATE_AREA.WD_STATUS;                      40730000
   SELECT (RCBZ02S.RETURN_CODE);                                        40740000
     WHEN ('')                                                          40750000
       DATE_OUT = SUBSTR(DATE_AREA.WD_OUT_DATE,1,10);                   40760000
     OTHERWISE                                                          40770000
     DO;                                                                40780000
      RCBM10AO.MSG_LINEO = 'DATE MODIFICATION ERROR WITH RC:'           40790000
                           || RCBZ02S.RETURN_CODE || 'OCCURED';         40800000
      CALL RCBC10M_SEND_MAP_CSR;                                        40810000
     END;                                                               40820000
   END;                                                                 40830000
 END;                                                                   40840000
                                                                        40850000
 END RCBC10M_ADD_ONE_DAY;                                               40860000
1/********************************************************************/ 40870000
 /*      UPDATE T220 RECORD                                          */ 40880000
 /********************************************************************/ 40890000
0RCBC10M_UPDATE_T220: PROC;                                             40900000
                                                                        40910000
 IF WRK_SERVICE_LVL_CODE = '' THEN                                      40920000
    NUL220G = -1;                                                       40930000
                                                                        40940000
 EXEC SQL                                                               40950000
      UPDATE RCBV0220_SUPPL_CTR                                         40960000
      SET SERVICE_LVL_CODE  = :WRK_SERVICE_LVL_CODE                     40970000
                              :NUL220G,                                 40980000
          LAST_CHANGE_DATE  = :WRK_DATE                                 40990000
                              :NUL220J                                  41000000
      WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                       41010000
        AND PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                         41020000
        AND ORIGIN          = :WRK_ORIGIN                               41030000
        AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER                      41040000
        AND SOURCE_INDICATOR= :WRK_O                                    41050000
        AND EFFECTIVE_DATE >= :WRK_EFFECTIVE_DATE                       41060000
        AND END_DATE       <= :WRK_END_DATE                             41070000
      ;                                                                 41080000
 SELECT (SQLCA.SQLCODE);                                                41090000
   WHEN (0,100);                                                        41100000
   OTHERWISE                                                            41110000
   DO;                                                                  41120000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       41130000
     RCBM10O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0220 UPDATE = '       41140000
                       || PIC_EXPLAIN;                                  41150000
     RCBM10O.TYPEC     = DFHRED;                                        41160000
     RCBM10I.TYPEL     = -1;                                            41170000
     CALL RCBC10M_SEND_MAP_CSR;                                         41180000
   END;                                                                 41190000
 END;                                                                   41200000
                                                                        41210000
0END RCBC10M_UPDATE_T220;                         /*EOC CEDS00000737*/  41220000
                                                      /* SOC RC01360 */ 41220100
1/********************************************************************/ 41221000
 /*                                                                  */ 41222000
 /* MODULE NAME      : RCBC10M_MIN_ONE_DAY                           */ 41223000
 /*                                                                  */ 41224000
 /* DESCRIPTION      : SUB ONE DAY TO DATE                           */ 41225000
 /*                                                                  */ 41226000
 /********************************************************************/ 41227000
 RCBC10M_MIN_ONE_DAY: PROC (DATE_IN,                                    41228000
                            DATE_OUT);                                  41229000
 DCL DATE_IN  CHAR (10);                                                41229100
 DCL DATE_OUT CHAR (10);                                                41229200
 IF DATE_IN = '9999-12-31'                                              41229300
 THEN                                                                   41229400
 DO;                                                                    41229500
   DATE_OUT = '';                                                       41229600
 END;                                                                   41229700
 ELSE                                                                   41229800
 DO;                                                                    41229900
   DATE_AREA              = '';                                         41230000
   DATE_AREA.WD_IN_FORMAT   = 'ISO';                                    41230100
   DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                    41230200
   DATE_AREA.WD_IN_DATE     = DATE_IN;                                  41230300
   DATE_AREA.WD_FUNCTION    = 'C';                                      41230400
   DATE_AREA.WD_PERIOD      = -1;                                       41230500
   DATE_AREA.WD_PERIOD_TYPE = 'D';                                      41230600
   CALL RCB004N (ADDR(DATE_AREA));                                      41230700
   RCBZ02S.RETURN_CODE      = DATE_AREA.WD_STATUS;                      41230800
   SELECT (RCBZ02S.RETURN_CODE);                                        41230900
     WHEN ('')                                                          41231000
       DATE_OUT = SUBSTR(DATE_AREA.WD_OUT_DATE,1,10);                   41231100
     OTHERWISE                                                          41231200
     DO;                                                                41231300
      RCBM10AO.MSG_LINEO = 'DATE MODIFICATION ERROR WITH RC:'           41231400
                           || RCBZ02S.RETURN_CODE || 'OCCURED';         41231500
      CALL RCBC10M_SEND_MAP_CSR;                                        41231600
     END;                                                               41231700
   END;                                                                 41231800
 END;                                                                   41231900
                                                                        41232000
 END RCBC10M_MIN_ONE_DAY;                                               41232100
1/********************************************************************/ 41232200
 /*                                                                  */ 41232300
 /* MODULE NAME      : RCBC10M_LOGICAL_DELETE_T240                   */ 41232400
 /*                                                                  */ 41232500
 /* DESCRIPTION      : LOGICAL DELETE OF THE CONTRACT RECORD BY      */ 41232600
 /*                    UPDATING THE SERV ENDDATE AND END DATE WITH   */ 41232700
 /*                    RUNDATE-1                                     */ 41232800
 /********************************************************************/ 41232900
 RCBC10M_LOGICAL_DELETE_T240: PROC;                                     41233000
                                                                        41233400
    EXEC SQL                                                            41233600
      UPDATE RCBV0240_SERV_CTR                                          41233700
         SET SERVICE_STOP_DATE  = :DATE1,                               41233800
             END_DATE           = :DATE1,                               41233900
             LAST_CHANGE_DATE   = :WRK_DATE                             41234000
       WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                   41234100
         AND PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                     41234200
         AND ORIGIN             = :WRK_ORIGIN                           41234300
         AND SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER                  41234400
         AND SOURCE_INDICATOR   = :WRK_O                                41234500
         AND EFFECTIVE_DATE     = :WRK_EFFECTIVE_DATE                   41234600
         ;                                                              41234800
                                                                        41234900
     SELECT (SQLCA.SQLCODE);                                            41235000
     WHEN (0);                                                          41235100
     WHEN (100)                                                         41235200
     DO;                                                                41235300
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     41235400
       RCBM10O.MSG_LINEO = 'NO RECORD FOUND IN T240 FOR DELETE'         41235500
                          || PIC_EXPLAIN;                               41235600
       CALL RCBC10M_SEND_MAP;                                           41235700
     END;                                                               41235800
     OTHERWISE                                                          41235900
     DO;                                                                41236000
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     41236100
       RCBM10O.MSG_LINEO = 'DB2 ERROR-RC FROM LOGICAL DEL OF RCBT0240=' 41236200
                          || PIC_EXPLAIN;                               41236300
       CALL RCBC10M_SEND_MAP;                                           41236400
     END;                                                               41236500
   END;                                                                 41236600
 END RCBC10M_LOGICAL_DELETE_T240;                                       41236700
1/********************************************************************/ 41236800
 /*                                                                  */ 41236900
 /* MODULE NAME      : RCBC10M_LOGICAL_DELETE_T220                   */ 41237000
 /*                                                                  */ 41237100
 /* DESCRIPTION      : LOGICAL DELETE OF THE CONTRACT RECORD BY      */ 41237200
 /*                    UPDATING THE ENDDATE WITH RUNDATE-1           */ 41237300
 /********************************************************************/ 41237500
 RCBC10M_LOGICAL_DELETE_T220: PROC;                                     41237600
                                                                        41237700
    EXEC SQL                                                            41238100
      UPDATE RCBV0220_SUPPL_CTR                                         41238200
         SET END_DATE           = :DATE1,                               41238300
             LAST_CHANGE_DATE   = :WRK_DATE                             41238400
       WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                   41238500
         AND PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                     41238600
         AND ORIGIN             = :WRK_ORIGIN                           41238700
         AND SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER                  41238800
         AND SOURCE_INDICATOR   = :WRK_O                                41238900
         AND EFFECTIVE_DATE     = :WRK_EFFECTIVE_DATE                   41239000
         ;                                                              41239100
                                                                        41239200
     SELECT (SQLCA.SQLCODE);                                            41239300
     WHEN (0);                                                          41239400
     WHEN (100)                                                         41239500
     DO;                                                                41239600
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     41239700
       RCBM10O.MSG_LINEO = 'NO RECORD FOUND IN T220 FOR DELETE'         41239800
                          || PIC_EXPLAIN;                               41239900
       CALL RCBC10M_SEND_MAP;                                           41240000
     END;                                                               41240100
     OTHERWISE                                                          41240200
     DO;                                                                41240300
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     41240400
       RCBM10O.MSG_LINEO = 'DB2 ERROR-RC FROM LOGICAL DEL OF RCBT0220=' 41240500
                          || PIC_EXPLAIN;                               41240600
       CALL RCBC10M_SEND_MAP;                                           41240700
     END;                                                               41240800
                                                                        41240900
 END RCBC10M_LOGICAL_DELETE_T220;                    /* EOC RC01360 */  41241000
1/*******************************************************************/  41249700
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  41249800
 /*******************************************************************/  41250000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  41260000
  $DAIMOD (RCBC10M);                     /* MODULE TO BE COMPILED   */  41270000
0/*******************************************************************/  41280000
 /* END OF ABR BLOCK '                                              */  41290000
 /*******************************************************************/  41300000
0 END RCBC10M;                                                          41310000