 /* RCBC25P - LIST MA SLC AND DISPLAY DETAILS                        */ 00010001
 /********************************************************************/ 00020001
 /*                                                                  */ 00030001
 /* TRANSACTION CODE    : RC25                                       */ 00040001
 /*                                                                  */ 00050001
 /* PROGRAM NAME        : RCBC25M                                    */ 00060001
 /*                                                                  */ 00070001
 /* TYPE                : CICS/VS                                    */ 00080001
 /*                                                                  */ 00090001
 /* USED MAPSET         : RCBM25                                     */ 00100001
 /*      MAP            : RCBM25                                     */ 00110001
 /*                     : RCBH25                                     */ 00120001
 /*                                                                  */ 00130001
 /* DESCRIPTION         : _ LIST MA SLC'S AND DISPLAY DETAILS        */ 00140001
 /*                                                                  */ 00150001
 /* LINKED TRANSACTION  : - RC25                                     */ 00160001
 /*                                                                  */ 00170001
 /* MESSAGES            :                                            */ 00180001
 /*                                                                  */ 00190001
 /*                                                                  */ 00200001
 /*  MAINTENANCE LOG :                                               */ 00210001
 /*  ---------------                                                 */ 00220001
 /*                                                                  */ 00230001
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00240001
 /*  --------------------------------------------------------------  */ 00250001
 /*  2002-06-25 | RA01233      | TACTICAL SERVICE REFERENCE          */ 00260001
 /*  2004/01/13 | RB01261      | MAKE COUNTRY NUMBER CHANGEABLE      */ 00271050
 /*  2004/01/13 | RB01263      | MINOR CICS CHANGES                  */ 00272050
 /*  2004/05/26 | RB01256      | ALIGN SLC ENTITY NAMES              */ 00273050
 /*  2008/08/11 | CEDS00000437 | Fix to delete the records where only*/ 00280056
 /*             |              | contract number is present          */ 00281056
 /*  2014/05/05 | RB01338      | CEDS 3.3 A21 RELEASE - RACF USER    */ 00281167
 /*             |              | GROUP FOR TS ACCESS MANAGEMENT TEAM */ 00281268
 /********************************************************************/ 00290001
1RCBC25M: PROC(COMMPTR)                                                 00300001
          OPTIONS (MAIN)                                                00310001
          REORDER;                                                      00320001
0/********************************************************************/ 00330040
 /*  EXTERNAL ENTRIES                                                */ 00340040
 /********************************************************************/ 00350040
                                                                        00351051
0DCL PLIXOPT   VAR  CHAR (256)                                          00352051
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;            00353051
                                                                        00354051
 DCL RCB004N ENTRY EXTERNAL;                                            00360040
0/********************************************************************/ 00370001
 /*  BMS RELATED CONSTANTS                                           */ 00380001
 /********************************************************************/ 00390001
 %INCLUDE DFHBMSCA;                                                     00400001
0/********************************************************************/ 00410001
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00420001
 /********************************************************************/ 00430001
 %INCLUDE DFHAID;                                                       00440001
1/********************************************************************/ 00450001
 /*  COMMUNICATION AREA                                              */ 00460001
 /********************************************************************/ 00470001
     %INCLUDE (RCBCP2S);                                                00480001
     %INCLUDE (RCBCHDS);,                                               00490001
     %INCLUDE (RCBC00S);,                                               00500001
     %INCLUDE (RCBC21S);,                                               00510016
     %INCLUDE (RCBC25S);;                                               00520001
0/********************************************************************/ 00530001
 /*  MAP STRUCTURES                                                  */ 00540001
 /********************************************************************/ 00550001
 %INCLUDE (RCBM25);                                                     00560001
 %INCLUDE (RCBM22);                                                     00570016
0/********************************************************************/ 00580001
 /*  DB2 STRUCTURES                                                  */ 00590001
 /********************************************************************/ 00600001
 DCL 1 RCB470S,                                                         00610016
     %INCLUDE (RCB470S);;                                               00620016
 DCL 1 RCB470SI,                                                        00630016
     %INCLUDE (RCB470SI);;                                              00640016
 DCL 1 RCB475S,                                                         00650016
     %INCLUDE (RCB475S);;                                               00660016
 DCL 1 RCB475SI,                                                        00670016
     %INCLUDE (RCB475SI);;                                              00680016
 DCL 1 RCB480S,                                                         00690016
     %INCLUDE (RCB480S);;                                               00700016
 DCL 1 RCB480SI,                                                        00710016
     %INCLUDE (RCB480SI);;                                              00720016
 DCL 1 RCB560S,                                                         00730001
     %INCLUDE (RCB560S);;                                               00740001
 DCL 1 RCB560SI,                                                        00750001
     %INCLUDE (RCB560SI);;                                              00760001
0/********************************************************************/ 00770014
 /*  NULL INDICATORS                                                 */ 00780014
 /********************************************************************/ 00790014
 DCL 1 NULL470      BASED(ADDR(RCB470SI)),                              00800016
       3 NUL470AA   FIXED  BIN(15) INIT(0),                             00810037
       3 NUL470AB   FIXED  BIN(15) INIT(0),                             00820037
       3 NUL470AC   FIXED  BIN(15) INIT(0),                             00830037
       3 NUL470AD   FIXED  BIN(15) INIT(0),                             00840037
       3 NUL470AE   FIXED  BIN(15) INIT(0),                             00850037
       3 NUL470AF   FIXED  BIN(15) INIT(0),                             00860037
       3 NUL470AG   FIXED  BIN(15) INIT(0),                             00870037
       3 NUL470AH   FIXED  BIN(15) INIT(0),                             00880037
       3 NUL470AI   FIXED  BIN(15) INIT(0),                             00890037
       3 NUL470AJ   FIXED  BIN(15) INIT(0),                             00900037
       3 NUL470AK   FIXED  BIN(15) INIT(0),                             00910037
       3 NUL470AL   FIXED  BIN(15) INIT(0),                             00920037
       3 NUL470AM   FIXED  BIN(15) INIT(0),                             00930037
       3 NUL470AN   FIXED  BIN(15) INIT(0),                             00940037
       3 NUL470AO   FIXED  BIN(15) INIT(0),                             00950037
       3 NUL470AP   FIXED  BIN(15) INIT(0),                             00960037
       3 NUL470AQ   FIXED  BIN(15) INIT(0),                             00970037
       3 NUL470AR   FIXED  BIN(15) INIT(0),                             00980037
       3 NUL470AS   FIXED  BIN(15) INIT(0),                             00990037
       3 NUL470AT   FIXED  BIN(15) INIT(0),                             01000037
       3 NUL470AU   FIXED  BIN(15) INIT(0),                             01010037
       3 NUL470AV   FIXED  BIN(15) INIT(0),                             01020037
       3 NUL470AW   FIXED  BIN(15) INIT(0),                             01030037
       3 NUL470AX   FIXED  BIN(15) INIT(0),                             01040037
       3 NUL470AY   FIXED  BIN(15) INIT(0),                             01050037
       3 NUL470AZ   FIXED  BIN(15) INIT(0),                             01060037
       3 NUL470BA   FIXED  BIN(15) INIT(0),                             01070037
       3 NUL470BB   FIXED  BIN(15) INIT(0),                             01080037
       3 NUL470BC   FIXED  BIN(15) INIT(0),                             01090037
       3 NUL470BD   FIXED  BIN(15) INIT(0),                             01100037
       3 NUL470BE   FIXED  BIN(15) INIT(0),                             01110037
       3 NUL470BF   FIXED  BIN(15) INIT(0),                             01120037
       3 NUL470BG   FIXED  BIN(15) INIT(0),                             01130037
       3 NUL470BH   FIXED  BIN(15) INIT(0),                             01140037
       3 NUL470BI   FIXED  BIN(15) INIT(0),                             01150037
       3 NUL470BJ   FIXED  BIN(15) INIT(0),                             01160037
       3 NUL470BK   FIXED  BIN(15) INIT(0),                             01170037
       3 NUL470BL   FIXED  BIN(15) INIT(0),                             01180037
       3 NUL470BM   FIXED  BIN(15) INIT(0),                             01190037
       3 NUL470BN   FIXED  BIN(15) INIT(0),                             01200037
       3 NUL470BO   FIXED  BIN(15) INIT(0),                             01210037
       3 NUL470BP   FIXED  BIN(15) INIT(0),                             01220037
       3 NUL470BQ   FIXED  BIN(15) INIT(0),                             01230037
       3 NUL470BR   FIXED  BIN(15) INIT(0),                             01240037
       3 NUL470BS   FIXED  BIN(15) INIT(0),                             01250037
       3 NUL470BT   FIXED  BIN(15) INIT(0),                             01260037
       3 NUL470BU   FIXED  BIN(15) INIT(0),                             01270037
       3 NUL470BV   FIXED  BIN(15) INIT(0),                             01280037
       3 NUL470BW   FIXED  BIN(15) INIT(0),                             01290037
       3 NUL470BX   FIXED  BIN(15) INIT(0),                             01300037
       3 NUL470BY   FIXED  BIN(15) INIT(0),                             01310037
       3 NUL470BZ   FIXED  BIN(15) INIT(0),                             01320037
       3 NUL470CA   FIXED  BIN(15) INIT(0),                             01330037
       3 NUL470CB   FIXED  BIN(15) INIT(0),                             01340037
       3 NUL470CC   FIXED  BIN(15) INIT(0),                             01350037
       3 NUL470CD   FIXED  BIN(15) INIT(0),                             01360037
       3 NUL470CE   FIXED  BIN(15) INIT(0),                             01370037
       3 NUL470CF   FIXED  BIN(15) INIT(0),                             01380037
       3 NUL470CG   FIXED  BIN(15) INIT(0),                             01390037
       3 NUL470CH   FIXED  BIN(15) INIT(0),                             01400037
       3 NUL470CI   FIXED  BIN(15) INIT(0),                             01410037
       3 NUL470CJ   FIXED  BIN(15) INIT(0),                             01420037
       3 NUL470CK   FIXED  BIN(15) INIT(0);                             01430037
                                                                        01440016
 DCL 1 NULL475      BASED(ADDR(RCB475SI)),                              01450016
       3 NUL475A    FIXED  BIN(15) INIT(0),                             01460037
       3 NUL475B    FIXED  BIN(15) INIT(0),                             01470037
       3 NUL475C    FIXED  BIN(15) INIT(0),                             01480037
       3 NUL475D    FIXED  BIN(15) INIT(0),                             01490037
       3 NUL475E    FIXED  BIN(15) INIT(0),                             01500037
       3 NUL475F    FIXED  BIN(15) INIT(0),                             01510037
       3 NUL475G    FIXED  BIN(15) INIT(0),                             01520037
       3 NUL475H    FIXED  BIN(15) INIT(0),                             01530037
       3 NUL475I    FIXED  BIN(15) INIT(0),                             01540037
       3 NUL475J    FIXED  BIN(15) INIT(0),                             01550037
       3 NUL475K    FIXED  BIN(15) INIT(0),                             01560037
       3 NUL475L    FIXED  BIN(15) INIT(0),                             01570037
       3 NUL475M    FIXED  BIN(15) INIT(0),                             01580037
       3 NUL475N    FIXED  BIN(15) INIT(0),                             01590037
       3 NUL475O    FIXED  BIN(15) INIT(0),                             01600037
       3 NUL475P    FIXED  BIN(15) INIT(0),                             01610037
       3 NUL475Q    FIXED  BIN(15) INIT(0);                             01620037
                                                                        01630016
 DCL 1 NULL480      BASED(ADDR(RCB480SI)),                              01640014
       3 NUL480A    FIXED  BIN(15) INIT(0),                             01650037
       3 NUL480B    FIXED  BIN(15) INIT(0),                             01660037
       3 NUL480C    FIXED  BIN(15) INIT(0),                             01670037
       3 NUL480D    FIXED  BIN(15) INIT(0),                             01680037
       3 NUL480E    FIXED  BIN(15) INIT(0),                             01690037
       3 NUL480F    FIXED  BIN(15) INIT(0),                             01700037
       3 NUL480G    FIXED  BIN(15) INIT(0);                             01710037
0/********************************************************************/ 01720040
 /*  INTERFACE AREAS                                                 */ 01730040
 /********************************************************************/ 01740040
 DCL 1 DATE_AREA,                                                       01750040
     %INCLUDE (RCBZ03S);;                                               01760040
 DCL 1 RCBZ02S,                                                         01770040
      %INCLUDE RCBZ02S;;                                                01780040
 DCL 1 SQLCA_R      BASED(ADDR(RCBZ02S.RETURN_SQL))                     01790040
                    LIKE SQLCA;                                         01800040
 DCL 1 PARM_INT_AREA,                                                   01810040
      %INCLUDE RCBZ01S;;                                                01820040
0/********************************************************************/ 01830001
 /*  RETURN CODES                                                    */ 01840001
 /********************************************************************/ 01850001
 DCL RESPONSE     FIXED BINARY(31) INIT(0);    /*RETURN CODE         */ 01860037
 DCL CODE_EXPLAIN FIXED BINARY(31) INIT(0);    /*RETURN CODE EXPLAIN */ 01870037
-/********************************************************************/ 01880001
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 01890001
 /********************************************************************/ 01900001
  EXEC SQL  WHENEVER NOT FOUND   CONTINUE;                              01910037
  EXEC SQL  WHENEVER SQLWARNING  CONTINUE;                              01920037
  EXEC SQL  WHENEVER SQLERROR    CONTINUE;                              01930037
0/********************************************************************/ 01940001
 /*  WORKING DECLARATIONS                                            */ 01950001
 /********************************************************************/ 01960001
 DCL SCREEN_ERROR             BIT(1) INIT('0'B);                        01990035
 DCL PF5_FLAG                 BIT(1) INIT('0'B);                        02000035
 DCL F5_OK_FLAG1              BIT(1) INIT('0'B);       /*CEDS00000437*/ 02001056
 DCL ACT_SEL                  BIT(1) INIT('0'B);                        02010035
 DCL T480_UPD_FLAG            BIT(1) INIT('0'B);                        02020035
 DCL WRK_REC_COUNT            FIXED  BIN(31) INIT(0);                   02090045
 DCL PIC_CNT                  PIC 'ZZZZ9' INIT(0);                      02100045
 DCL SALINE               CHAR(52)                                      02110022
         INIT('Set Act to A(dd) D(elete) C(hange) and make changes.');  02120022
 DCL PFLINE1              CHAR(64) INIT                                 02130025
   ('F1=Help F2=Clear F3=Return F7=Bkwd F8=Fwd F9=Top/Bot');            02140025
 DCL PFLINE1A             CHAR(64) INIT                                 02150025
   ('F1=Help F2=Clear F3=Return F5=Execute F7=Bkwd F8=Fwd F9=Top/Bot'); 02160025
 DCL CHKLINE1             CHAR(64) INIT                                 02170027
   ('WARNING: This could delete all the records for this contract.');   02180027
 DCL CHKLINE2             CHAR(64) INIT                                 02190027
   ('Enter Y to delete ALL or N to delete only the selected record.');  02200027
 DCL COMMAREA_STRING          CHAR(5984) INIT('');                      02220035
 DCL WRKMAP_DATA              CHAR(500) INIT('');                       02230035
 DCL 1 WRKMAP                 BASED(ADDR(WRKMAP_DATA)),                 02240027
     %INCLUDE RCBB56D;;                                                 02250001
0/********************************************************************/ 02260001
 /*  MESSAGES                                                        */ 02270001
 /********************************************************************/ 02280001
 DCL ERR_MESSAGE2 CHAR(30) INIT('ERROR IN SENDING MAP ');               02290001
 DCL ERR_MESSAGE3 CHAR(30) INIT('ERROR IN RECEIVING MAP ');             02300001
 DCL ERR_MESSAGE14 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       02310001
 DCL ERR_MESSAGE30 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       02320001
 DCL ERR_O004 CHAR(30) INIT('Invalid use of Function Key');             02330001
 DCL ERR_O022 CHAR(19) INIT('Press F5 to execute');                     02340001
 DCL ERR_O030 CHAR(24) INIT('Already on first page');                   02350001
 DCL ERR_O031 CHAR(23) INIT('Already on last page');                    02360001
 DCL ERR_O032 CHAR(17) INIT('No item selected');                        02370001
 DCL ERR_O053 CHAR(18) INIT('Nothing is updated');                      02380001
 DCL ERR_O057 CHAR(70) INIT                                             02390042
 ('You are not authorized to use the function for this Country number');02400042
 DCL ERR_O072 CHAR(25) INIT('Country number is invalid');               02410040
 DCL ERR_O079 CHAR(70) INIT                                             02420040
 ('Not allowed to maintain cont. SLCs, no activity report created');    02430040
 DCL ERR_O098 CHAR(25) INIT('Invalid command entered');                 02440001
 DCL ERR_O120 CHAR(65) INIT                                             02450001
  ('Row for update not found. Choose action = A or fill in new values');02460001
 DCL ERR_O121 CHAR(65) INIT                                             02470027
  ('Row for delete not found. Choose action = A or fill in new values');02480001
 DCL ERR_O122 CHAR(41) INIT                                             02490001
  ('Delete successful. Enter new data or EXIT');                        02500001
 DCL ERR_O123 CHAR(41) INIT                                             02510001
  ('Insert successful. Enter new data or EXIT');                        02520001
 DCL ERR_O124 CHAR(41) INIT                                             02530001
  ('Update successful. Enter new data or EXIT');                        02540001
 DCL ERR_O127 CHAR(48) INIT                                             02550001
  ('Invalid action. Choose one of the valid options');                  02560054
 DCL ERR_O142 CHAR(40) INIT('Service_Level_Code does not exist');       02570007
0/********************************************************************/ 02580001
 /*  TS AREA                                                         */ 02590001
 /********************************************************************/ 02600001
 DCL 1 TS_REC,                                                          02610001
       3 CONT       CHAR(15) INIT(''),                                  02620037
       3 TYPE       CHAR(4) INIT(''),                                   02630037
       3 MODEL      CHAR(3) INIT(''),                                   02640037
       3 ORIGIN     CHAR(2) INIT(''),                                   02650037
       3 SEQNO      CHAR(7) INIT(''),                                   02660037
       3 SLC        CHAR(3) INIT('');                                   02670037
0/********************************************************************/ 02680001
 /*                 BUILD IN FUNCTIONS                               */ 02690001
 /********************************************************************/ 02700001
0DCL (LENGTH,                                                           02710001
      STRING,                                                           02720001
      SUBSTR,                                                           02730001
      VERIFY,                                                           02740001
      DECIMAL,                                                          02750001
      DATETIME,                                                         02760001
      CHAR,                                                             02770001
      NULL,                                                             02780001
      CSTG,                                                             02790001
      STG,                                                              02800001
      ADDR)   BUILTIN;                                                  02810001
-/********************************************************************/ 02820001
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 02830001
 /********************************************************************/ 02840001
  EXEC SQL  INCLUDE  SQLCA;                                             02850001
-/********************************************************************/ 02860001
 /****   DECLARATIONS OF DB2 CURSORS                              ****/ 02870001
 /********************************************************************/ 02880001
  EXEC SQL  DECLARE C_480 CURSOR FOR                                    02890001
            SELECT CONTRACT_NUMBER                                      02900014
                  ,PRODUCT_TYPE                                         02910014
                  ,MODEL_NUMBER                                         02920014
                  ,ORIGIN                                               02930014
                  ,SEQUENCE_NUMBER                                      02940001
                  ,SERVICE_LVL_CODE                                     02950001
            FROM RCBV0480_MA_SLC                                        02960001
            WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                  02970040
              AND ((CONTRACT_NUMBER  = :SEL_CONT                        02980014
               OR  :ENT_CONT         = 'N')                             02990014
              AND  (PRODUCT_TYPE     = :SEL_TYPE                        03000014
               OR  :ENT_TYPE         = 'N')                             03010014
              AND  (MODEL_NUMBER     = :SEL_MODEL                       03020014
               OR  :ENT_MODEL        = 'N'))                            03030014
            ORDER BY CONTRACT_NUMBER,PRODUCT_TYPE,MODEL_NUMBER,ORIGIN,  03040014
                     SEQUENCE_NUMBER                                    03050014
            FOR FETCH ONLY                                              03060001
            WITH UR;                                                    03070001
                                                                        03080001
1/********************************************************************/ 03090001
 /*                   M A I N   P R O C E S S I N G                  */ 03100001
 /*                                                                  */ 03110001
 /********************************************************************/ 03120001
0RCBM25O.MSG_LINEO = '';                                                03130001
                                                                        03140001
 IF EIBCALEN = 0 THEN                                                   03150001
 DO;                                                                    03160001
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   03170001
 END;                                                                   03180001
                                                                        03190001
 IF HEADER.NEXT = '99' THEN                                             03200001
 DO;                                                                    03210001
   HEADER.NEXT = '00';                                                  03220001
   CALL RCBC25M_CLEAR_WORK;                                             03230001
   CALL RCBC25M_CLEAR_MAP;                                              03240001
   TMP_COUNTRY_NUMBER = WRK_COUNTRY_NUMBER;                             03250042
   CALL RCBC25M_SEND_MAP;                                               03260001
 END;                                                                   03270001
                                                                        03280001
 IF HEADER.NEXT = 'H1' THEN                                             03290001
 DO;                                                                    03300001
   HEADER.NEXT = '00';                                                  03310001
   CALL RCBC25M_CLEAR_MAP;                                              03320017
   IF SEL_MODEL ¬= '***' THEN                                           03330017
   DO;                                                                  03340017
     CALL RCBC25M_GET_SLC;                                              03350017
     CALL RCBC25M_FILL_MAP;                                             03360017
   END;                                                                 03370017
   CALL RCBC25M_GET_CSR_POS;                                            03371044
   CALL RCBC25M_SEND_MAP_CSR;                                           03372044
 END;                                                                   03390017
                                                                        03400001
 SELECT (EIBAID);                                                       03410001
  WHEN (DFHPF1,DFHPF13)                                                 03420001
   DO;                                                                  03420144
     CALL RCBC25M_RECEIVE_MAP;                                          03421044
     CALL RCBC25M_HELP_MAP;                                             03430044
   END;                                                                 03431044
                                                                        03440001
   WHEN (DFHPF2,DFHPF14)                                                03450025
   DO;                                                                  03460001
     CALL RCBC25M_CLEAR_WORK;                                           03470011
     CALL RCBC25M_CLEAR_MAP;                                            03480011
     CALL RCBC25M_SEND_MAP;                                             03490025
   END;                                                                 03500001
                                                                        03510001
   WHEN (DFHPF3,DFHPF15)                                                03520025
   DO;                                                                  03530025
     HEADER.NEXT = 'H1';                                                03540025
     CALL RCBC25M_CLEAR_WORK;                                           03550025
     CALL RCBC25M_CLEAR_MAP;                                            03560025
     TS_Q = 'RC00' || EIBTRMID;                                         03570045
     EXEC CICS IGNORE CONDITION QIDERR;                                 03580039
     EXEC CICS DELETEQ TS QUEUE(TS_Q);                                  03590039
     EXEC CICS HANDLE CONDITION QIDERR;                                 03600039
                                                                        03610039
     EXEC CICS XCTL                                                     03620025
         PROGRAM('RCBC20P')                                             03630025
         COMMAREA(COMMAREA)                                             03640025
         LENGTH(CSTG(COMMAREA))                                         03650025
         RESP(RESPONSE)                                                 03660025
         RESP2(CODE_EXPLAIN);                                           03670025
   END;                                                                 03680025
                                                                        03690025
   WHEN (DFHPF5,DFHPF17)                                                03700001
   DO;                                                                  03710001
   /*IF ADMIN_FLAG  = FALSE                          *//* SOC RB01338 */03720063
   /* & UPD_OK_FLAG = FALSE THEN                                      */03730059
     IF UPD_OK_FLAG = FALSE THEN                                        03731057
                                                       /* EOC RB01338 */03732063
     DO;                                                                03740022
       RCBM25O.MSG_LINEO = ERR_O004;                                    03750038
       RCBM25I.ACTIONL(1)  = -1;                                        03760047
       CALL RCBC25M_SEND_MAP_CSR;                                       03770037
     END;                                                               03780022
                                                                        03790022
     CALL RCBC25M_RECEIVE_MAP;                                          03800001
  /* IF OK_FLAG = FALSE THEN */                                         03810054
       CALL RCBC25M_PRE_CHECK_MAP;                                      03820030
                                                                        03830030
     PF5_FLAG = TRUE;                                                   03840030
     CALL RCBC25M_CHECK_MAP;                                            03850001
     IF CONT_FLAG = FALSE THEN                                          03860026
     DO;                                                                03870026
       CALL RCBC25M_CLEAR_MAP;                                          03880026
       CALL RCBC25M_GET_SLC;                                            03890026
       CALL RCBC25M_FILL_MAP;                                           03900026
     END;                                                               03910026
     IF T480_UPD_FLAG = TRUE THEN                                       03920001
     DO;                                                                03930001
       RCBM25O.MSG_LINEO  = 'Updates have been done';                   03940001
       T480_UPD_FLAG = FALSE;                                           03950001
       CONT_FLAG     = FALSE;                                           03960026
     END;                                                               03970001
     CALL RCBC25M_SEND_MAP;                                             03980001
   END;                                                                 03990001
                                                                        04000001
   WHEN (DFHPF7,DFHPF19)                                                04010001
   DO;                                                                  04020001
     IF TS_CNT = 0 THEN                                                 04030034
     DO;                                                                04040034
       CALL RCBC25M_CLEAR_MAP;                                          04050034
       CALL RCBC25M_SEND_MAP;                                           04060034
     END;                                                               04070034
                                                                        04080034
     IF L - 16 < 0 THEN                                                 04090033
     DO;                                                                04100001
       J = 0;                                                           04110001
       CALL RCBC25M_FILL_MAP;                                           04130001
       RCBM25O.MSG_LINEO  = ERR_O030;                                   04130147
       RCBM25I.ACTIONL(1) = -1;                                         04131047
       CALL RCBC25M_SEND_MAP_CSR;                                       04140047
     END;                                                               04150001
     ELSE DO;                                                           04160001
       J = L - 16;                                                      04170033
       CALL RCBC25M_FILL_MAP;                                           04180001
       RCBM25I.ACTIONL(1) = -1;                                         04181047
       CALL RCBC25M_SEND_MAP_CSR;                                       04190047
     END;                                                               04200001
   END;                                                                 04210001
                                                                        04220001
   WHEN (DFHPF8,DFHPF20)                                                04230001
   DO;                                                                  04240001
     IF TS_CNT = 0 THEN                                                 04250034
     DO;                                                                04260034
       CALL RCBC25M_CLEAR_MAP;                                          04270034
       CALL RCBC25M_SEND_MAP;                                           04280034
     END;                                                               04290034
                                                                        04300034
     IF J >= TS_CNT THEN                                                04310001
     DO;                                                                04320001
       J = J - K;                                                       04330001
       CALL RCBC25M_FILL_MAP;                                           04350001
       RCBM25O.MSG_LINEO  = ERR_O031;                                   04350147
       RCBM25I.ACTIONL(1) = -1;                                         04351047
       CALL RCBC25M_SEND_MAP_CSR;                                       04352047
     END;                                                               04370001
                                                                        04380001
     CALL RCBC25M_FILL_MAP;                                             04390001
     RCBM25I.ACTIONL(1) = -1;                                           04391047
     CALL RCBC25M_SEND_MAP_CSR;                                         04392047
   END;                                                                 04410001
                                                                        04420001
   WHEN (DFHPF9,DFHPF21)                                                04430025
   DO;                                                                  04440025
     IF TS_CNT = 0 THEN                                                 04450034
     DO;                                                                04460034
       CALL RCBC25M_CLEAR_MAP;                                          04470034
       CALL RCBC25M_SEND_MAP;                                           04480034
     END;                                                               04490034
                                                                        04500034
     IF O = 0                                                           04510030
      & TS_CNT > 15 THEN                                                04520030
     DO;                                                                04530025
       O = 1;                                                           04540025
       J = TS_CNT - 15;                                                 04550025
       IF J < 1 THEN J = 1;                                             04560029
       CALL RCBC25M_FILL_MAP;                                           04570025
       RCBM25I.ACTIONL(1) = -1;                                         04571047
       CALL RCBC25M_SEND_MAP_CSR;                                       04572047
     END;                                                               04590025
                                                                        04600025
     O = 0;                                                             04610025
     J = 0;                                                             04620025
     CALL RCBC25M_FILL_MAP;                                             04630025
     RCBM25I.ACTIONL(1) = -1;                                           04631047
     CALL RCBC25M_SEND_MAP_CSR;                                         04632047
   END;                                                                 04650025
                                                                        04660025
   WHEN (DFHENTER)                                                      04670001
   DO;                                                                  04680001
     CALL RCBC25M_RECEIVE_MAP;                                          04690001
                                                                        04700001
     DO I = 1 TO 15;                                                    04710035
       IF VERIFY(RCBM25I.ACTIONI(I), 'ACDV') = 0 THEN                   04720035
       DO;                                                              04730035
         ACT_SEL = TRUE;                                                04740035
       END;                                                             04750035
     END;                                                               04760035
                                                                        04770035
     IF (RCBM25I.COUNTRY_NUMBERI ¬= WRK_COUNTRY_NUMBER                  04780041
       | RCBM25I.CONT_SELI       ¬= SEL_CONT                            04790041
       | RCBM25I.TYPE_SELI       ¬= SEL_TYPE                            04800041
       | RCBM25I.MODEL_SELI      ¬= SEL_MODEL)                          04810041
      & ACT_SEL                   = FALSE     THEN                      04820041
     DO;                                                                04830041
       CALL RCBC25M_VALIDATE_MAP;                                       04840001
       CALL RCBC25M_GET_SLC;                                            04850001
       CALL RCBC25M_FILL_MAP;                                           04860001
       CALL RCBC25M_SEND_MAP;                                           04870001
     END;                                                               04880001
                                                                        04890035
     ACT_SEL = FALSE;                                                   04900035
  /* IF OK_FLAG = FALSE THEN */                                         04910054
       CALL RCBC25M_PRE_CHECK_MAP;                                      04920035
                                                                        04930035
     IF ACT_SEL = TRUE THEN                                             04940035
       CALL RCBC25M_VALIDATE_MAP;                                       04950035
     ELSE DO;                                                           04960036
       CALL RCBC25M_CHECK_MAP;                                          04970035
     END;                                                               04980036
                                                                        04990035
     ACT_SEL = FALSE;                                                   05000035
     CALL RCBC25M_GET_SLC;                                              05010035
     CALL RCBC25M_FILL_MAP;                                             05020035
     CALL RCBC25M_SEND_MAP;                                             05030035
   END;                                                                 05040001
                                                                        05050001
   WHEN (DFHCLEAR)                                                      05060001
   DO;                                                                  05070001
     EXEC CICS SEND                                                     05080001
        CONTROL                                                         05090001
        ERASE                                                           05100001
        FREEKB;                                                         05110001
     EXEC CICS RETURN;                                                  05120001
   END;                                                                 05130001
                                                                        05140001
   OTHERWISE                                                            05150001
   DO;                                                                  05160001
     CALL RCBC25M_RECEIVE_MAP;                                          05161046
     RCBM25O.MSG_LINEO = ERR_O004;                                      05170047
     RCBM25I.CONT_SELL = -1;                                            05180047
     CALL RCBC25M_SEND_MAP_CSR;                                         05190037
   END;                                                                 05200001
                                                                        05210001
 END;                                                                   05220001
1/********************************************************************/ 05230001
 /*      FILL MAP RCBM25                                             */ 05240001
 /********************************************************************/ 05250001
0RCBC25M_FILL_MAP: PROC;                                                05260001
                                                                        05270001
 CALL RCBC25M_CLEAR_MAP;                                                05280001
 IF SEL_CONT  = '***************' THEN                                  05290035
   RCBM25O.CONT_SELO  = '';                                             05300035
 ELSE                                                                   05310035
   RCBM25O.CONT_SELO  = SEL_CONT;                                       05320035
 IF SEL_TYPE  = '****' THEN                                             05330035
   RCBM25O.TYPE_SELO  = '';                                             05340035
 ELSE                                                                   05350035
   RCBM25O.TYPE_SELO  = SEL_TYPE;                                       05360035
 IF SEL_MODEL = '***' THEN                                              05370035
   RCBM25O.MODEL_SELO = '';                                             05380035
 ELSE                                                                   05390035
   RCBM25O.MODEL_SELO = SEL_MODEL;                                      05400035
                                                                        05410035
                                                                        05420001
 K = 0;                                                                 05430001
 PIC_CNT         = J + 1;                                               05440029
 IF PIC_CNT = 0 THEN PIC_CNT = 1;                                       05450025
 RCBM25O.INCNTO  = PIC_CNT;                                             05460025
 L               = PIC_CNT;                                             05470033
 PIC_CNT         = TS_CNT;                                              05480033
 RCBM25O.TOTCNTO = PIC_CNT;                                             05490025
 DO I = 1 TO 15;                                                        05500014
                                                                        05510001
   IF J <= TS_CNT THEN                                                  05520001
   DO;                                                                  05530001
     J = J + 1;     /* NUMBER OF LINES DISPLAYED */                     05540001
     K = K + 1;     /* NUMBER OF LINES DISPLAYED ON CURRENT SCREEN */   05550001
     EXEC CICS READQ TS QUEUE(TS_Q) INTO(TS_REC) ITEM(J);               05560001
     RCBM25O.CONTRACT_NUMBERO(I)  = TS_REC.CONT;                        05570014
     RCBM25O.PRODUCT_TYPEO(I)     = TS_REC.TYPE;                        05580014
     RCBM25O.MODEL_NUMBERO(I)     = TS_REC.MODEL;                       05590014
     RCBM25O.ORIGINO(I)           = TS_REC.ORIGIN;                      05600014
     RCBM25O.SEQUENCE_NUMBERO(I)  = TS_REC.SEQNO;                       05610025
     RCBM25O.SERVICE_LVL_CODEO(I) = TS_REC.SLC;                         05620002
     RCBM25O.CONTRACT_NUMBERA(I)  = DFHBMPRF;                           05630014
     RCBM25O.PRODUCT_TYPEA(I)     = DFHBMPRF;                           05640014
     RCBM25O.MODEL_NUMBERA(I)     = DFHBMPRF;                           05650014
     RCBM25O.ORIGINA(I)           = DFHBMPRF;                           05660014
     RCBM25O.SEQUENCE_NUMBERA(I)  = DFHBMPRF;                           05670002
     FILL_FLAG(I)                 = TRUE;                               05680008
   END;                                                                 05690001
                                                                        05700001
   IF J >= TS_CNT THEN                                                  05710045
     I = 31;                                                            05770001
 END;                                                                   05790001
                                                                        05800001
0END RCBC25M_FILL_MAP;                                                  05810001
1/********************************************************************/ 05820001
 /*      RECEIVE MAP RCBM25                                          */ 05830001
 /********************************************************************/ 05840001
0RCBC25M_RECEIVE_MAP: PROC;                                             05850001
                                                                        05860001
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      05870030
    MAP('RCBM25')                                                       05880030
    MAPSET('RCBM25')                                                    05890030
    RESP(RESPONSE)                                                      05900030
    RESP2(CODE_EXPLAIN);                                                05910030
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      05920030
    WHEN(DFHRESP(NORMAL))                                               05930030
    DO;                                                                 05940030
      HEADER.RET_CODE = '';        /* INITIALISE RETURN CODES  */       05950030
      HEADER.SUB_CODE = '';                                             05960030
    END;                                                                05970030
                                                                        05980030
    OTHERWISE                                                           05990030
    DO;                                                                 06000030
      RCBM25O.MSG_LINEO = ERR_MESSAGE3;                                 06010030
      CALL RCBC25M_SEND_MAP;                                            06020037
    END;                                                                06030030
 END;                                                                   06040030
                                                                        06050001
0END RCBC25M_RECEIVE_MAP;                                               06060001
1/********************************************************************/ 06070001
 /*      VALIDATE MAP RCBM25                                         */ 06080001
 /********************************************************************/ 06090001
0RCBC25M_VALIDATE_MAP: PROC;                                            06100001
                                                                        06110001
 ENT_CONT  = 'N';                                                       06120014
 ENT_TYPE  = 'N';                                                       06130002
 ENT_MODEL = 'N';                                                       06140014
 SEL_CONT  = '';                                                        06150014
 SEL_TYPE  = '';                                                        06160007
 SEL_MODEL = '';                                                        06170014
 CONT_FLAG = FALSE;                                                     06180026
                                                                        06190001
 IF WRK_COUNTRY_NUMBER ¬= RCBM25I.COUNTRY_NUMBERI THEN                  06200042
 DO;                                                                    06210042
   SEL_OPT = '9';                                                       06220042
   WRK_COUNTRY_NUMBER = RCBM25I.COUNTRY_NUMBERI;                        06230042
                                                                        06240042
   EXEC CICS LINK                                                       06250042
      PROGRAM('RCBC99P')                                                06260042
      COMMAREA(COMMAREA)                                                06270042
      LENGTH(CSTG(COMMAREA));                                           06280042
                                                                        06290042
   IF CTY_OK_FLAG = FALSE THEN                                          06300042
   DO;                                                                  06310042
     RCBM25O.MSG_LINEO       = ERR_O072;                                06320042
     RCBM25I.COUNTRY_NUMBERL = -1;                                      06330042
     RCBM25O.COUNTRY_NUMBERC = DFHRED;                                  06340042
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      06350042
     CALL RCBC25M_SEND_MAP_CSR;                                         06360042
   END;                                                                 06370042
                                                                        06380042
   IF OK_FLAG = FALSE THEN                                              06390042
   DO;                                                                  06400042
     RCBM25O.MSG_LINEO       = ERR_O057;                                06410042
     RCBM25I.COUNTRY_NUMBERL = -1;                                      06420042
     RCBM25O.COUNTRY_NUMBERC = DFHRED;                                  06430042
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      06440042
     CALL RCBC25M_SEND_MAP_CSR;                                         06450042
   END;                                                                 06460042
                                                                        06470042
   IF RCB025_FLAG = FALSE THEN                                          06480042
   DO;                                                                  06490042
     RCBM25O.MSG_LINEO =                                                06500042
                     'Parameter RCB025 is missing for this country';    06510042
     RCBM25O.COUNTRY_NUMBERC = DFHRED;                                  06520042
     RCBM25I.COUNTRY_NUMBERL = -1;                                      06530042
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      06540042
     CALL RCBC25M_SEND_MAP_CSR;                                         06550042
   END;                                                                 06560042
                                                                        06570042
   IF RCB098_FLAG = FALSE THEN                                          06580042
   DO;                                                                  06590042
     RCBM25O.MSG_LINEO =                                                06600042
                     'Parameter RCB098 is missing for this country';    06610042
     RCBM25O.COUNTRY_NUMBERC = DFHRED;                                  06620042
     RCBM25I.COUNTRY_NUMBERL = -1;                                      06630042
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      06640042
     CALL RCBC25M_SEND_MAP_CSR;                                         06650042
   END;                                                                 06660042
                                                                        06670042
   IF ASCA_STOP_FLAG = TRUE THEN                                        06680042
   DO;                                                                  06690042
     RCBM25O.MSG_LINEO       = ERR_O079;                                06700042
     RCBM25O.COUNTRY_NUMBERC = DFHRED;                                  06710042
     RCBM25I.COUNTRY_NUMBERL = -1;                                      06720042
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      06730042
     CALL RCBC25M_SEND_MAP_CSR;                                         06740042
   END;                                                                 06750042
                                                                        06760042
   TMP_COUNTRY_NUMBER = RCBM25I.COUNTRY_NUMBERI;                        06770042
 END;                                                                   06780042
                                                                        06790042
 IF RCBM25I.CONT_SELF  = ERASE_EOF THEN                                 06800014
   RCBM25O.CONT_SELO   = '';                                            06810014
 IF RCBM25I.TYPE_SELF  = ERASE_EOF THEN                                 06820014
   RCBM25O.TYPE_SELO   = '';                                            06830014
 IF RCBM25I.MODEL_SELF = ERASE_EOF THEN                                 06840014
   RCBM25O.MODEL_SELO  = '';                                            06850014
                                                                        06860001
 DO I = 1 TO 15;                                                        06870026
   IF RCBM25I.ACTIONI(I) ¬= '' THEN                                     06880026
   DO;                                                                  06890026
     CONT_FLAG = TRUE;                                                  06900026
     IF RCBM25I.CONTRACT_NUMBERI(I) ¬= '' THEN                          06910026
     DO;                                                                06920026
       ENT_CONT = 'Y';                                                  06930026
       SEL_CONT = RCBM25I.CONTRACT_NUMBERI(I);                          06940026
     END;                                                               06950026
                                                                        06960026
     IF RCBM25I.PRODUCT_TYPEI(I) ¬= '' THEN                             06970026
     DO;                                                                06980026
       ENT_TYPE = 'Y';                                                  06990026
       SEL_TYPE = RCBM25I.PRODUCT_TYPEI(I);                             07000026
     END;                                                               07010026
                                                                        07020026
     IF RCBM25I.MODEL_NUMBERI(I) ¬= '' THEN                             07030026
     DO;                                                                07040026
       ENT_MODEL = 'Y';                                                 07050026
       SEL_MODEL = RCBM25I.MODEL_NUMBERI(I);                            07060026
     END;                                                               07070026
                                                                        07080026
     CALL RCBC25M_CHECK_MAP;                                            07090026
   END;                                                                 07100026
 END;                                                                   07110026
                                                                        07120026
 IF RCBM25I.CONT_SELI ¬= '' THEN                                        07130026
 DO;                                                                    07140001
   ENT_CONT = 'Y';                                                      07150014
   SEL_CONT = RCBM25O.CONT_SELO;                                        07161052
 END;                                                                   07170001
                                                                        07180001
 IF RCBM25I.TYPE_SELI ¬= '' THEN                                        07190001
 DO;                                                                    07200001
   ENT_TYPE = 'Y';                                                      07210014
   SEL_TYPE = RCBM25O.TYPE_SELO;                                        07221052
 END;                                                                   07230001
                                                                        07240001
 IF RCBM25I.MODEL_SELI ¬= '' THEN                                       07250052
 DO;                                                                    07260014
   ENT_MODEL = 'Y';                                                     07270014
   SEL_MODEL = RCBM25O.MODEL_SELO;                                      07281052
 END;                                                                   07290014
                                                                        07300014
0END RCBC25M_VALIDATE_MAP;                                              07310025
1/********************************************************************/ 07320001
 /*      PRE CHECK MAP RCBM25                                        */ 07330030
 /********************************************************************/ 07340001
0RCBC25M_PRE_CHECK_MAP: PROC;                                           07350030
                                                                        07360001
 MAP_OK_FLAG = TRUE;                                                    07370030
 OK_FLAG     = FALSE;                                                   07380030
 F5_OK_FLAG  = FALSE;                                  /*CEDS00000437*/ 07381056
 F5_OK_FLAG1 = FALSE;                                  /*CEDS00000437*/ 07382056
                                                                        07390030
 DO I = 1 TO 15;                                                        07400014
   IF VERIFY(RCBM25I.ACTIONI(I), ' ACDV') ¬= 0 THEN                     07410016
   DO;                                                                  07420001
     RCBM25I.ACTIONL(I) = -1;                                           07430030
     RCBM25O.ACTIONC(I) = DFHRED;                                       07440030
     MAP_OK_FLAG        = FALSE;                                        07450030
   END;                                                                 07460001
                                                                        07470001
   IF RCBM25I.ACTIONI(I) ¬= '' THEN                                     07480008
   DO;                                                                  07490008
     OK_FLAG = TRUE;                                                    07500008
   END;                                                                 07510008
                                                                        07520008
   IF RCBM25I.ACTIONI(I) = 'D' THEN                                     07530030
   DO;                                                                  07540001
     IF RCBM25I.CONTRACT_NUMBERI(I) ¬= ''                               07550029
      & RCBM25I.PRODUCT_TYPEI(I)     = ''                               07560029
      & RCBM25I.MODEL_NUMBERI(I)     = ''                               07570029
      & RCBM25I.ORIGINI(I)           = ''                               07580029
   /* & RCBM25I.SEQUENCE_NUMBERI(I)  = '' THEN*/    /*SOC CEDS00000437*/07590056
      & RCBM25I.SEQUENCE_NUMBERI(I)  = ''                               07591056
      & RCBM25I.ACCEPTI = '' THEN                   /*EOC CEDS00000437*/07592056
     DO;                                                                07600029
       F5_OK_FLAG         = TRUE;                                       07610029
       RCBM25O.ACTIONC(I) = DFHRED;                                     07620030
       RCBM25O.MSG_LINEAO = CHKLINE1;                                   07630029
       RCBM25O.MSG_LINEO  = CHKLINE2;                                   07640029
       RCBM25O.ACCEPTH    = DFHUNDLN;                                   07650029
       RCBM25O.ACCEPTA    = DFHBMUNP;                                   07660029
       RCBM25I.ACCEPTL    = -1;                                         07670029
     END;                                                               07680029
     IF RCBM25I.CONTRACT_NUMBERI(I) ¬= ''           /*SOC CEDS00000437*/07681056
      & RCBM25I.PRODUCT_TYPEI(I)     = ''                               07682056
      & RCBM25I.MODEL_NUMBERI(I)     = ''                               07683056
      & RCBM25I.ORIGINI(I)           = ''                               07684056
      & RCBM25I.SEQUENCE_NUMBERI(I)  = ''                               07687056
      & RCBM25I.ACCEPTI ¬= '' THEN                                      07687156
     DO;                                                                07688056
       F5_OK_FLAG1        = TRUE;                                       07689056
     END;                                           /*EOC CEDS00000437*/07689756
   END;                                                                 07690001
 END;                                                                   07700030
                                                                        07710016
 IF MAP_OK_FLAG = FALSE THEN                                            07720030
 DO;                                                                    07730030
   OK_FLAG = FALSE;                                                     07740030
   CALL RCBC25M_PROTECT_MAP;                                            07750030
   RCBM25I.ACTIONL(1)   = -1;                                           07760030
   RCBM25O.ACTIONC(I)   = DFHRED;                                       07770030
   RCBM25O.MSG_LINEO = ERR_O127;                                        07780038
   CALL RCBC25M_SEND_MAP_CSR;                                           07790037
 END;                                                                   07800030
                                                                        07810030
 IF F5_OK_FLAG = TRUE THEN                                              07820030
 DO;                                                                    07830030
   CALL RCBC25M_PROTECT_MAP;                                            07840030
   CALL RCBC25M_SEND_MAP_CSR;                                           07850037
 END;                                                                   07860030
                                                                        07870030
 IF OK_FLAG = FALSE THEN                                                07880030
 DO;                                                                    07890030
   CALL RCBC25M_PROTECT_MAP;                                            07900030
   RCBM25O.MSG_LINEO  = ERR_O032;                                       07910038
   CALL RCBC25M_SEND_MAP;                                               07920037
 END;                                                                   07930030
                                                                        07940030
0END RCBC25M_PRE_CHECK_MAP;                                             07950030
1/********************************************************************/ 07960030
 /*      CHECK MAP RCBM25                                            */ 07970030
 /********************************************************************/ 07980030
0RCBC25M_CHECK_MAP: PROC;                                               07990030
                                                                        08000030
 T480_UPD_FLAG = FALSE;                                                 08010036
                                                                        08020030
 IF RCBM25I.ACCEPTI = 'Y'                                               08030030
 /*& F5_OK_FLAG = TRUE THEN */                          /*CEDS00000437*/08040056
 & F5_OK_FLAG1 = TRUE THEN                              /*CEDS00000437*/08041056
   TOP_DEL_FLAG = TRUE;                                                 08050030
                                                                        08060030
 DO I = 1 TO 15;                                                        08070036
   IF VERIFY(RCBM25I.ACTIONI(I), 'AC') = 0 THEN                         08080030
   DO;                                                                  08090030
     CALL RCBC25M_GET_T470;                                             08100030
   END;                                                                 08110030
                                                                        08120030
   IF RCBM25I.ACTIONI(I) = 'A' THEN                                     08130030
   DO;                                                                  08140030
     CALL RCBC25M_CHECK_ADD;                                            08150030
     IF PF5_FLAG = TRUE THEN                                            08160030
     DO;                                                                08170030
       CALL RCBC25M_DEFINE_SLC;                                         08180030
       WRK_ACTION = '1';                                                08190030
       CALL RCBC25M_UPD_T560;                                           08200030
       RCBM25I.ACTIONI(I) = '';                                         08210030
     END;                                                               08220030
   END;                                                                 08230030
                                                                        08240030
   IF RCBM25I.ACTIONI(I) = 'C'                                          08250030
    & PF5_FLAG           = TRUE THEN                                    08260030
   DO;                                                                  08270030
     CALL RCBC25M_UPDATE_SLC;                                           08280030
     WRK_ACTION = '2';                                                  08290030
     CALL RCBC25M_UPD_T560;                                             08300030
     RCBM25I.ACTIONI(I) = '';                                           08310030
   END;                                                                 08320030
                                                                        08330030
   IF RCBM25I.ACTIONI(I) = 'D'                                          08340030
    & PF5_FLAG           = TRUE THEN                                    08350030
   DO;                                                                  08360030
     CALL RCBC25M_DELETE_SLC;                                           08370030
     WRK_ACTION = '3';                                                  08380030
     CALL RCBC25M_UPD_T560;                                             08390030
     RCBM25I.ACTIONI(I) = '';                                           08400030
   END;                                                                 08410030
                                                                        08420030
   IF RCBM25I.ACTIONI(I) = 'V' THEN                                     08430030
   DO;                                                                  08440030
     RCBM25I.ACTIONI(I) = '';                                           08450030
     CALL RCBC25M_GET_DETAILS;                                          08460036
   END;                                                                 08470030
 END;                                                                   08480030
                                                                        08490030
 IF OK_FLAG  = TRUE                                                     08500030
  & PF5_FLAG = FALSE THEN                                               08510030
 DO;                                                                    08520030
   CALL RCBC25M_PROTECT_MAP;                                            08530030
   RCBM25O.MSG_LINEO = ERR_O022;                                        08540038
   CALL RCBC25M_SEND_MAP;                                               08550030
 END;                                                                   08560030
                                                                        08570030
0END RCBC25M_CHECK_MAP;                                                 08580030
1/********************************************************************/ 08590030
 /*      VALIDATE RECORD TO BE ADDED                                 */ 08600014
 /********************************************************************/ 08610008
0RCBC25M_CHECK_ADD: PROC;                                               08620014
                                                                        08630008
 IF RCBM25I.CONTRACT_NUMBERI(I)  = ''                                   08640014
  & (RCBM25I.PRODUCT_TYPEI(I)    = ''                                   08650014
   | RCBM25I.ORIGINI(I)          = ''                                   08660014
   | RCBM25I.SEQUENCE_NUMBERI(I) = '') THEN                             08670014
 DO;                                                                    08680014
   CALL RCBC25M_PROTECT_MAP;                                            08690014
   RCBM25O.MSG_LINEO = 'TOS must be filled if Contract Number is blank';08700014
   RCBM25O.PRODUCT_TYPEC(I) = DFHRED;                                   08710014
   RCBM25I.PRODUCT_TYPEL(I) = -1;                                       08720014
   CALL RCBC25M_SEND_MAP_CSR;                                           08730037
 END;                                                                   08740014
                                                                        08750014
 IF RCBM25I.SEQUENCE_NUMBERI(I) ¬= ''                                   08760025
  & SUBSTR(RCBM25I.SEQUENCE_NUMBERI(I),1,2) ¬= '00' THEN                08770025
 DO;                                                                    08780025
   SUBSTR(WRK_SEQUENCE_NUMBER,1,2) = '00';                              08790025
   SUBSTR(WRK_SEQUENCE_NUMBER,3,5) =                                    08800025
     SUBSTR(RCBM25I.SEQUENCE_NUMBERI(I),1,5);                           08810025
   RCBM25O.SEQUENCE_NUMBERO(I) = WRK_SEQUENCE_NUMBER;                   08820025
 END;                                                                   08830025
                                                                        08840025
0END RCBC25M_CHECK_ADD;                                                 08850014
1/********************************************************************/ 08860014
 /*      GET SLC                                                     */ 08870014
 /********************************************************************/ 08880014
0RCBC25M_GET_SLC: PROC;                                                 08890014
                                                                        08900014
 DO I = 1 TO 15;                                                        08910026
   RCBM25O.ACTIONO(I)           = '';                                   08920026
   RCBM25O.CONTRACT_NUMBERO(I)  = '';                                   08930026
   RCBM25O.PRODUCT_TYPEO(I)     = '';                                   08940026
   RCBM25O.MODEL_NUMBERO(I)     = '';                                   08950026
   RCBM25O.ORIGINO(I)           = '';                                   08960026
   RCBM25O.SEQUENCE_NUMBERO(I)  = '';                                   08970026
   RCBM25O.SERVICE_LVL_CODEO(I) = '';                                   08980026
   FILL_FLAG(I)                 = FALSE;                                08990026
 END;                                                                   09000026
                                                                        09010026
 CALL RCBC25M_COUNT_T480;                                               09011045
 IF WRK_REC_COUNT > 32767 THEN                                          09012045
 DO;                                                                    09013045
   RCBM25O.MSG_LINEO =                                                  09014045
   'Please refine search criteria, too many rows retrieved';            09015045
   CALL RCBC25M_SEND_MAP;                                               09016045
 END;                                                                   09017045
                                                                        09018045
 RCBM25O.INCNTO  = '';                                                  09020026
 RCBM25O.TOTCNTO = '';                                                  09030026
                                                                        09040026
 TS_Q = 'RC00' || EIBTRMID;                                             09050045
                                                                        09060001
 EXEC CICS IGNORE CONDITION QIDERR;                                     09070001
                                                                        09080001
 EXEC CICS DELETEQ TS QUEUE(TS_Q);                                      09090001
                                                                        09100001
 EXEC CICS HANDLE CONDITION QIDERR;                                     09110001
                                                                        09120001
 OK_FLAG = TRUE;                                                        09130001
 TS_CNT = 0;                                                            09140001
 J      = 0;                                                            09150001
 L      = 1;                                                            09160001
                                                                        09170001
 EXEC SQL  OPEN C_480;                                                  09180001
                                                                        09190001
 SELECT(SQLCA.SQLCODE);                                                 09200001
   WHEN(0);                                                             09210001
   WHEN(100)                                                            09220025
   DO;                                                                  09230025
     CALL RCBC25M_SEND_MAP;                                             09240025
   END;                                                                 09250025
   OTHERWISE                                                            09260001
   DO;                                                                  09270001
     RCBM25O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   09280001
     CALL RCBC25M_SEND_MAP_CSR;                                         09290037
   END;                                                                 09300001
 END;                                                                   09310001
                                                                        09320001
 DO WHILE (OK_FLAG = TRUE);                                             09330001
   TS_REC.CONT   = '';                                                  09340014
   TS_REC.TYPE   = '';                                                  09350014
   TS_REC.MODEL  = '';                                                  09360014
   TS_REC.ORIGIN = '';                                                  09370014
   TS_REC.SEQNO  = '';                                                  09380014
   TS_REC.SLC    = '';                                                  09390014
                                                                        09400014
   EXEC SQL  FETCH C_480                                                09410002
             INTO :RCB480S.CONTRACT_NUMBER :NUL480B                     09420014
                 ,:RCB480S.PRODUCT_TYPE    :NUL480C                     09430014
                 ,:RCB480S.MODEL_NUMBER    :NUL480D                     09440014
                 ,:RCB480S.ORIGIN          :NUL480E                     09450014
                 ,:RCB480S.SEQUENCE_NUMBER :NUL480F                     09460014
                 ,:TS_REC.SLC;                                          09470002
                                                                        09480001
   IF (SQLCA.SQLCODE = 0) THEN                                          09490041
   DO;                                                                  09500001
     IF NUL480B     ¬= -1 THEN                                          09510014
       TS_REC.CONT   = RCB480S.CONTRACT_NUMBER;                         09520014
     IF NUL480C     ¬= -1 THEN                                          09530014
       TS_REC.TYPE   = RCB480S.PRODUCT_TYPE;                            09540014
     IF NUL480D     ¬= -1 THEN                                          09550014
       TS_REC.MODEL  = RCB480S.MODEL_NUMBER;                            09560014
     IF NUL480E     ¬= -1 THEN                                          09570014
       TS_REC.ORIGIN = RCB480S.ORIGIN;                                  09580014
     IF NUL480F     ¬= -1 THEN                                          09590014
       TS_REC.SEQNO  = RCB480S.SEQUENCE_NUMBER;                         09600014
                                                                        09610014
     EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                      09620001
     TS_CNT = TS_CNT + 1;                                               09630001
   END;                                                                 09640001
                                                                        09650001
   IF (SQLCA.SQLCODE ¬= 0) THEN                                         09660041
   DO;                                                                  09670001
     OK_FLAG = FALSE;                                                   09680001
   END;                                                                 09690001
 END;                                                                   09700001
                                                                        09710001
 EXEC SQL  CLOSE C_480;                                                 09720002
                                                                        09730001
 IF TS_CNT = 0 THEN                                                     09740026
 DO;                                                                    09750001
   IF (RCBM25I.CONT_SELI  ¬= ''                                         09760026
    |  RCBM25I.TYPE_SELI  ¬= ''                                         09770026
    |  RCBM25I.MODEL_SELI ¬= '') THEN                                   09780026
     RCBM25O.MSG_LINEO = 'No items found for this search criteria';     09790026
   CALL RCBC25M_SEND_MAP;                                               09800025
 END;                                                                   09810001
                                                                        09820001
0END RCBC25M_GET_SLC;                                                   09830001
1/********************************************************************/ 09840007
 /*      GET RCBT0470 RECORD                                         */ 09850007
 /********************************************************************/ 09860007
0RCBC25M_GET_T470: PROC;                                                09870007
                                                                        09880007
 T470_FLAG = FALSE;                                                     09890007
 WRK_REC_COUNT = 0;                                                     09900007
 WRK_SLC = RCBM25I.SERVICE_LVL_CODEI(I);                                09910007
                                                                        09920007
 EXEC SQL                                                               09930007
   SELECT COUNT(*)                                                      09940007
   INTO :WRK_REC_COUNT                                                  09950007
   FROM RCBV0470_SERV_COND                                              09960007
   WHERE SERVICE_LVL_CODE = :WRK_SLC;                                   09970007
                                                                        09980007
 IF WRK_REC_COUNT ¬= 0 THEN                                             09990007
 DO;                                                                    10000007
   T470_FLAG = TRUE;                                                    10010007
 END;                                                                   10020007
 ELSE DO;                                                               10030007
   CALL RCBC25M_PROTECT_MAP;                                            10040011
   RCBM25O.MSG_LINEO = ERR_O142;                                        10050038
   RCBM25O.SERVICE_LVL_CODEC(I) = DFHRED;                               10060007
   RCBM25I.SERVICE_LVL_CODEL(I) = -1;                                   10070007
   CALL RCBC25M_SEND_MAP_CSR;                                           10080037
 END;                                                                   10090007
                                                                        10100007
0END RCBC25M_GET_T470;                                                  10110007
1/********************************************************************/ 10120016
 /*      GET RCBT0470/RCBT0475 DELAILS                               */ 10130016
 /********************************************************************/ 10140016
0RCBC25M_GET_DETAILS: PROC;                                             10150016
                                                                        10160016
 T475_FLAG = TRUE;                                                      10170016
 WRK_SLC = RCBM25I.SERVICE_LVL_CODEI(I);                                10180016
 RCBM22O.SLCO = WRK_SLC;                                                10190016
 RCBM22O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                          10200040
                                                                        10210016
 EXEC SQL                                                               10220016
   SELECT COVERAGE_START_1                                              10230016
         ,COVERAGE_START_2                                              10240016
         ,COVERAGE_START_3                                              10250016
         ,COVERAGE_START_4                                              10260016
         ,COVERAGE_START_5                                              10270016
         ,COVERAGE_START_6                                              10280016
         ,COVERAGE_START_7                                              10290016
         ,COVERAGE_END_1                                                10300016
         ,COVERAGE_END_2                                                10310016
         ,COVERAGE_END_3                                                10320016
         ,COVERAGE_END_4                                                10330016
         ,COVERAGE_END_5                                                10340016
         ,COVERAGE_END_6                                                10350016
         ,COVERAGE_END_7                                                10360016
         ,COMMENT_TEXT                                                  10370016
   INTO :WRK_COVERAGE_START_1   :NUL475C                                10380016
       ,:WRK_COVERAGE_START_2   :NUL475D                                10390016
       ,:WRK_COVERAGE_START_3   :NUL475E                                10400016
       ,:WRK_COVERAGE_START_4   :NUL475F                                10410016
       ,:WRK_COVERAGE_START_5   :NUL475G                                10420016
       ,:WRK_COVERAGE_START_6   :NUL475H                                10430016
       ,:WRK_COVERAGE_START_7   :NUL475I                                10440016
       ,:WRK_COVERAGE_END_1     :NUL475J                                10450016
       ,:WRK_COVERAGE_END_2     :NUL475K                                10460016
       ,:WRK_COVERAGE_END_3     :NUL475L                                10470016
       ,:WRK_COVERAGE_END_4     :NUL475M                                10480016
       ,:WRK_COVERAGE_END_5     :NUL475N                                10490016
       ,:WRK_COVERAGE_END_6     :NUL475O                                10500016
       ,:WRK_COVERAGE_END_7     :NUL475P                                10510016
       ,:WRK_COMMENT_TEXT       :NUL475Q                                10520016
   FROM RCBV0475_CTRY_COND                                              10530016
   WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                         10540040
     AND SERVICE_LVL_CODE = :WRK_SLC;                                   10550016
                                                                        10560016
 SELECT(SQLCA.SQLCODE);                                                 10570016
   WHEN(0)                                                              10580016
   DO;                                                                  10590016
     RCBM22O.COVERAGE_START_1O = WRK_COVERAGE_START_1;                  10600016
     RCBM22O.COVERAGE_END_1O   = WRK_COVERAGE_END_1;                    10610016
     RCBM22O.COVERAGE_START_2O = WRK_COVERAGE_START_2;                  10620016
     RCBM22O.COVERAGE_END_2O   = WRK_COVERAGE_END_2;                    10630016
     RCBM22O.COVERAGE_START_3O = WRK_COVERAGE_START_3;                  10640016
     RCBM22O.COVERAGE_END_3O   = WRK_COVERAGE_END_3;                    10650016
     RCBM22O.COVERAGE_START_4O = WRK_COVERAGE_START_4;                  10660016
     RCBM22O.COVERAGE_END_4O   = WRK_COVERAGE_END_4;                    10670016
     RCBM22O.COVERAGE_START_5O = WRK_COVERAGE_START_5;                  10680016
     RCBM22O.COVERAGE_END_5O   = WRK_COVERAGE_END_5;                    10690016
     RCBM22O.COVERAGE_START_6O = WRK_COVERAGE_START_6;                  10700016
     RCBM22O.COVERAGE_END_6O   = WRK_COVERAGE_END_6;                    10710016
     RCBM22O.COVERAGE_START_7O = WRK_COVERAGE_START_7;                  10720016
     RCBM22O.COVERAGE_END_7O   = WRK_COVERAGE_END_7;                    10730016
     RCBM22O.COMMENT_TEXTO     = WRK_COMMENT_TEXT;                      10740016
     RCBM22O.SERVICE_DLVR_METHDC   = DFHBLUE;                           10750016
     RCBM22O.TIME_ZERO_INDC        = DFHBLUE;                           10760016
     RCBM22O.CONTACT_TIME_QTY_1C   = DFHBLUE;                           10770048
     RCBM22O.CONTACT_TIME_UNT_1C   = DFHBLUE;                           10780048
     RCBM22O.CONTACT_TIME_COM_1C   = DFHBLUE;                           10790048
     RCBM22O.CONTACT_TIME_QTY_2C   = DFHBLUE;                           10800048
     RCBM22O.CONTACT_TIME_UNT_2C   = DFHBLUE;                           10810048
     RCBM22O.CONTACT_TIME_COM_2C   = DFHBLUE;                           10820048
     RCBM22O.CONTACT_TIME_QTY_3C   = DFHBLUE;                           10830048
     RCBM22O.CONTACT_TIME_UNT_3C   = DFHBLUE;                           10840048
     RCBM22O.CONTACT_TIME_COM_3C   = DFHBLUE;                           10850048
     RCBM22O.ONSITE_RESP_QTY_1C    = DFHBLUE;                           10860049
     RCBM22O.ONSITE_RESP_UNT_1C    = DFHBLUE;                           10870049
     RCBM22O.ONSITE_RESP_COM_1C    = DFHBLUE;                           10880049
     RCBM22O.ONSITE_RESP_QTY_2C    = DFHBLUE;                           10890049
     RCBM22O.ONSITE_RESP_UNT_2C    = DFHBLUE;                           10900049
     RCBM22O.ONSITE_RESP_COM_2C    = DFHBLUE;                           10910049
     RCBM22O.ONSITE_RESP_QTY_3C    = DFHBLUE;                           10920049
     RCBM22O.ONSITE_RESP_UNT_3C    = DFHBLUE;                           10930049
     RCBM22O.ONSITE_RESP_COM_3C    = DFHBLUE;                           10940049
     RCBM22O.FIX_TIME_QTY_1C       = DFHBLUE;                           10950016
     RCBM22O.FIX_TIME_UNT_1C       = DFHBLUE;                           10960016
     RCBM22O.FIX_TIME_COM_1C       = DFHBLUE;                           10970016
     RCBM22O.FIX_TIME_QTY_2C       = DFHBLUE;                           10980016
     RCBM22O.FIX_TIME_UNT_2C       = DFHBLUE;                           10990016
     RCBM22O.FIX_TIME_COM_2C       = DFHBLUE;                           11000016
     RCBM22O.FIX_TIME_QTY_3C       = DFHBLUE;                           11010016
     RCBM22O.FIX_TIME_UNT_3C       = DFHBLUE;                           11020016
     RCBM22O.FIX_TIME_COM_3C       = DFHBLUE;                           11030016
     RCBM22O.TURN_AROUND_QTY_1C    = DFHBLUE;                           11040049
     RCBM22O.TURN_AROUND_UNT_1C    = DFHBLUE;                           11050049
     RCBM22O.TURN_AROUND_COM_1C    = DFHBLUE;                           11060049
     RCBM22O.TURN_AROUND_QTY_2C    = DFHBLUE;                           11070049
     RCBM22O.TURN_AROUND_UNT_2C    = DFHBLUE;                           11080049
     RCBM22O.TURN_AROUND_COM_2C    = DFHBLUE;                           11090049
     RCBM22O.TURN_AROUND_QTY_3C    = DFHBLUE;                           11100049
     RCBM22O.TURN_AROUND_UNT_3C    = DFHBLUE;                           11110049
     RCBM22O.TURN_AROUND_COM_3C    = DFHBLUE;                           11120049
     RCBM22O.PRT_ONS_TIME_QTY_1C   = DFHBLUE;                           11130016
     RCBM22O.PRT_ONS_TIME_UNT_1C   = DFHBLUE;                           11140016
     RCBM22O.PRT_ONS_TIME_COM_1C   = DFHBLUE;                           11150016
     RCBM22O.PRT_ONS_TIME_QTY_2C   = DFHBLUE;                           11160016
     RCBM22O.PRT_ONS_TIME_UNT_2C   = DFHBLUE;                           11170016
     RCBM22O.PRT_ONS_TIME_COM_2C   = DFHBLUE;                           11180016
     RCBM22O.PRT_ONS_TIME_QTY_3C   = DFHBLUE;                           11190016
     RCBM22O.PRT_ONS_TIME_UNT_3C   = DFHBLUE;                           11200016
     RCBM22O.PRT_ONS_TIME_COM_3C   = DFHBLUE;                           11210016
   END;                                                                 11220016
                                                                        11230016
   WHEN(100)                                                            11240016
   DO;                                                                  11250016
     T475_FLAG = FALSE;                                                 11260016
   END;                                                                 11270016
   OTHERWISE                                                            11280016
   DO;                                                                  11290016
     RCBM25O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE ||  ' OCCURED';  11300016
     CALL RCBC25M_SEND_MAP_CSR;                                         11310037
   END;                                                                 11320016
 END;                                                                   11330016
                                                                        11340016
 EXEC SQL                                                               11350016
   SELECT COVERAGE_START_1                                              11360016
         ,COVERAGE_END_1                                                11370016
         ,COVERAGE_START_2                                              11380016
         ,COVERAGE_END_2                                                11390016
         ,COVERAGE_START_3                                              11400016
         ,COVERAGE_END_3                                                11410016
         ,COVERAGE_START_4                                              11420016
         ,COVERAGE_END_4                                                11430016
         ,COVERAGE_START_5                                              11440016
         ,COVERAGE_END_5                                                11450016
         ,COVERAGE_START_6                                              11460016
         ,COVERAGE_END_6                                                11470016
         ,COVERAGE_START_7                                              11480016
         ,COVERAGE_END_7                                                11490016
         ,SERVICE_DLVR_METHD                                            11500016
         ,TIME_ZERO_IND                                                 11510016
         ,CONTACT_TIME_QTY_1                                            11520048
         ,CONTACT_TIME_UNT_1                                            11530048
         ,CONTACT_TIME_COM_1                                            11540048
         ,CONTACT_TIME_QTY_2                                            11550048
         ,CONTACT_TIME_UNT_2                                            11560048
         ,CONTACT_TIME_COM_2                                            11570048
         ,CONTACT_TIME_QTY_3                                            11580048
         ,CONTACT_TIME_UNT_3                                            11590048
         ,CONTACT_TIME_COM_3                                            11600048
         ,ONSITE_RESP_QTY_1                                             11610049
         ,ONSITE_RESP_UNT_1                                             11620049
         ,ONSITE_RESP_COM_1                                             11630049
         ,ONSITE_RESP_QTY_2                                             11640049
         ,ONSITE_RESP_UNT_2                                             11650049
         ,ONSITE_RESP_COM_2                                             11660049
         ,ONSITE_RESP_QTY_3                                             11670049
         ,ONSITE_RESP_UNT_3                                             11680049
         ,ONSITE_RESP_COM_3                                             11690049
         ,FIX_TIME_QTY_1                                                11700016
         ,FIX_TIME_UNT_1                                                11710016
         ,FIX_TIME_COM_1                                                11720016
         ,FIX_TIME_QTY_2                                                11730016
         ,FIX_TIME_UNT_2                                                11740016
         ,FIX_TIME_COM_2                                                11750016
         ,FIX_TIME_QTY_3                                                11760016
         ,FIX_TIME_UNT_3                                                11770016
         ,FIX_TIME_COM_3                                                11780016
         ,TURN_AROUND_QTY_1                                             11790049
         ,TURN_AROUND_UNT_1                                             11800049
         ,TURN_AROUND_COM_1                                             11810049
         ,TURN_AROUND_QTY_2                                             11820049
         ,TURN_AROUND_UNT_2                                             11830049
         ,TURN_AROUND_COM_2                                             11840049
         ,TURN_AROUND_QTY_3                                             11850049
         ,TURN_AROUND_UNT_3                                             11860049
         ,TURN_AROUND_COM_3                                             11870049
         ,PRT_ONS_TIME_QTY_1                                            11880016
         ,PRT_ONS_TIME_UNT_1                                            11890016
         ,PRT_ONS_TIME_COM_1                                            11900016
         ,PRT_ONS_TIME_QTY_2                                            11910016
         ,PRT_ONS_TIME_UNT_2                                            11920016
         ,PRT_ONS_TIME_COM_2                                            11930016
         ,PRT_ONS_TIME_QTY_3                                            11940016
         ,PRT_ONS_TIME_UNT_3                                            11950016
         ,PRT_ONS_TIME_COM_3                                            11960016
         ,COMMENT_TEXT                                                  11970016
   INTO :WRK_COVERAGE_START_1    :NUL470AB                              11980016
       ,:WRK_COVERAGE_END_1      :NUL470AC                              11990016
       ,:WRK_COVERAGE_START_2    :NUL470AD                              12000016
       ,:WRK_COVERAGE_END_2      :NUL470AE                              12010016
       ,:WRK_COVERAGE_START_3    :NUL470AF                              12020016
       ,:WRK_COVERAGE_END_3      :NUL470AG                              12030016
       ,:WRK_COVERAGE_START_4    :NUL470AH                              12040016
       ,:WRK_COVERAGE_END_4      :NUL470AI                              12050016
       ,:WRK_COVERAGE_START_5    :NUL470AJ                              12060016
       ,:WRK_COVERAGE_END_5      :NUL470AK                              12070016
       ,:WRK_COVERAGE_START_6    :NUL470AL                              12080016
       ,:WRK_COVERAGE_END_6      :NUL470AM                              12090016
       ,:WRK_COVERAGE_START_7    :NUL470AN                              12100016
       ,:WRK_COVERAGE_END_7      :NUL470AO                              12110016
       ,:WRK_SERVICE_DLVR_METHD  :NUL470AP                              12120016
       ,:WRK_TIME_ZERO_IND       :NUL470AQ                              12130016
       ,:WRK_CONTACT_TIME_QTY_1F :NUL470AR                              12140048
       ,:WRK_CONTACT_TIME_UNT_1  :NUL470AS                              12150048
       ,:WRK_CONTACT_TIME_COM_1  :NUL470AT                              12160048
       ,:WRK_CONTACT_TIME_QTY_2F :NUL470AU                              12170048
       ,:WRK_CONTACT_TIME_UNT_2  :NUL470AV                              12180048
       ,:WRK_CONTACT_TIME_COM_2  :NUL470AW                              12190048
       ,:WRK_CONTACT_TIME_QTY_3F :NUL470AX                              12200048
       ,:WRK_CONTACT_TIME_UNT_3  :NUL470AY                              12210048
       ,:WRK_CONTACT_TIME_COM_3  :NUL470AZ                              12220048
       ,:WRK_ONSITE_RESP_QTY_1F  :NUL470BA                              12230049
       ,:WRK_ONSITE_RESP_UNT_1   :NUL470BB                              12240049
       ,:WRK_ONSITE_RESP_COM_1   :NUL470BC                              12250049
       ,:WRK_ONSITE_RESP_QTY_2F  :NUL470BD                              12260049
       ,:WRK_ONSITE_RESP_UNT_2   :NUL470BE                              12270049
       ,:WRK_ONSITE_RESP_COM_2   :NUL470BF                              12280049
       ,:WRK_ONSITE_RESP_QTY_3F  :NUL470BG                              12290049
       ,:WRK_ONSITE_RESP_UNT_3   :NUL470BH                              12300049
       ,:WRK_ONSITE_RESP_COM_3   :NUL470BI                              12310049
       ,:WRK_FIX_TIME_QTY_1F     :NUL470BJ                              12320016
       ,:WRK_FIX_TIME_UNT_1      :NUL470BK                              12330016
       ,:WRK_FIX_TIME_COM_1      :NUL470BL                              12340016
       ,:WRK_FIX_TIME_QTY_2F     :NUL470BM                              12350016
       ,:WRK_FIX_TIME_UNT_2      :NUL470BN                              12360016
       ,:WRK_FIX_TIME_COM_2      :NUL470BO                              12370016
       ,:WRK_FIX_TIME_QTY_3F     :NUL470BP                              12380016
       ,:WRK_FIX_TIME_UNT_3      :NUL470BQ                              12390016
       ,:WRK_FIX_TIME_COM_3      :NUL470BR                              12400016
       ,:WRK_TURN_AROUND_QTY_1F  :NUL470BS                              12410049
       ,:WRK_TURN_AROUND_UNT_1   :NUL470BT                              12420049
       ,:WRK_TURN_AROUND_COM_1   :NUL470BU                              12430049
       ,:WRK_TURN_AROUND_QTY_2F  :NUL470BV                              12440049
       ,:WRK_TURN_AROUND_UNT_2   :NUL470BW                              12450049
       ,:WRK_TURN_AROUND_COM_2   :NUL470BX                              12460049
       ,:WRK_TURN_AROUND_QTY_3F  :NUL470BY                              12470049
       ,:WRK_TURN_AROUND_UNT_3   :NUL470BZ                              12480049
       ,:WRK_TURN_AROUND_COM_3   :NUL470CA                              12490049
       ,:WRK_PRT_ONS_TIME_QTY_1F :NUL470CB                              12500016
       ,:WRK_PRT_ONS_TIME_UNT_1  :NUL470CC                              12510016
       ,:WRK_PRT_ONS_TIME_COM_1  :NUL470CD                              12520016
       ,:WRK_PRT_ONS_TIME_QTY_2F :NUL470CE                              12530016
       ,:WRK_PRT_ONS_TIME_UNT_2  :NUL470CF                              12540016
       ,:WRK_PRT_ONS_TIME_COM_2  :NUL470CG                              12550016
       ,:WRK_PRT_ONS_TIME_QTY_3F :NUL470CH                              12560016
       ,:WRK_PRT_ONS_TIME_UNT_3  :NUL470CI                              12570016
       ,:WRK_PRT_ONS_TIME_COM_3  :NUL470CJ                              12580016
       ,:WRK_COMMENT_TEXT        :NUL470CK                              12590016
   FROM RCBV0470_SERV_COND                                              12600016
   WHERE SERVICE_LVL_CODE = :WRK_SLC;                                   12610016
                                                                        12620016
 SELECT(SQLCA.SQLCODE);                                                 12630016
   WHEN(0)                                                              12640016
   DO;                                                                  12650016
     IF T475_FLAG = FALSE THEN                                          12660016
     DO;                                                                12670016
       RCBM22O.COVERAGE_START_1O = WRK_COVERAGE_START_1;                12680016
       RCBM22O.COVERAGE_END_1O   = WRK_COVERAGE_END_1;                  12690016
       RCBM22O.COVERAGE_START_2O = WRK_COVERAGE_START_2;                12700016
       RCBM22O.COVERAGE_END_2O   = WRK_COVERAGE_END_2;                  12710016
       RCBM22O.COVERAGE_START_3O = WRK_COVERAGE_START_3;                12720016
       RCBM22O.COVERAGE_END_3O   = WRK_COVERAGE_END_3;                  12730016
       RCBM22O.COVERAGE_START_4O = WRK_COVERAGE_START_4;                12740016
       RCBM22O.COVERAGE_END_4O   = WRK_COVERAGE_END_4;                  12750016
       RCBM22O.COVERAGE_START_5O = WRK_COVERAGE_START_5;                12760016
       RCBM22O.COVERAGE_END_5O   = WRK_COVERAGE_END_5;                  12770016
       RCBM22O.COVERAGE_START_6O = WRK_COVERAGE_START_6;                12780016
       RCBM22O.COVERAGE_END_6O   = WRK_COVERAGE_END_6;                  12790016
       RCBM22O.COVERAGE_START_7O = WRK_COVERAGE_START_7;                12800016
       RCBM22O.COVERAGE_END_7O   = WRK_COVERAGE_END_7;                  12810016
       RCBM22O.COMMENT_TEXTO     = WRK_COMMENT_TEXT;                    12820016
     END;                                                               12830016
                                                                        12840016
     IF NUL470AP = -1 THEN                                              12850016
     DO;                                                                12860016
       WRK_SERVICE_DLVR_METHD = '';                                     12870016
     END;                                                               12880016
                                                                        12890016
     IF NUL470AQ = -1 THEN                                              12900016
     DO;                                                                12910016
       WRK_TIME_ZERO_IND = '';                                          12920016
     END;                                                               12930016
                                                                        12940016
     IF NUL470AR ¬= -1 THEN                                             12950016
     DO;                                                                12960016
       WRK_CONTACT_TIME_QTY_1 = WRK_CONTACT_TIME_QTY_1F;                12970048
     END;                                                               12980016
     ELSE DO;                                                           12990016
       WRK_CONTACT_TIME_QTY_1 = 0;                                      13000048
     END;                                                               13010016
                                                                        13020016
     IF NUL470AS = -1 THEN                                              13030016
     DO;                                                                13040016
       WRK_CONTACT_TIME_UNT_1 = '';                                     13050048
     END;                                                               13060016
                                                                        13070016
     IF NUL470AT = -1 THEN                                              13080016
     DO;                                                                13090016
       WRK_CONTACT_TIME_COM_1 = '';                                     13100048
     END;                                                               13110016
                                                                        13120016
     IF NUL470AU ¬= -1 THEN                                             13130016
     DO;                                                                13140016
       WRK_CONTACT_TIME_QTY_2 = WRK_CONTACT_TIME_QTY_2F;                13150048
     END;                                                               13160016
     ELSE DO;                                                           13170016
       WRK_CONTACT_TIME_QTY_2 = 0;                                      13180048
     END;                                                               13190016
                                                                        13200016
     IF NUL470AV = -1 THEN                                              13210016
     DO;                                                                13220016
       WRK_CONTACT_TIME_UNT_2 = '';                                     13230048
     END;                                                               13240016
                                                                        13250016
     IF NUL470AW = -1 THEN                                              13260016
     DO;                                                                13270016
       WRK_CONTACT_TIME_COM_2 = '';                                     13280048
     END;                                                               13290016
                                                                        13300016
     IF NUL470AX ¬= -1 THEN                                             13310016
     DO;                                                                13320016
       WRK_CONTACT_TIME_QTY_3 = WRK_CONTACT_TIME_QTY_3F;                13330048
     END;                                                               13340016
     ELSE DO;                                                           13350016
       WRK_CONTACT_TIME_QTY_3 = 0;                                      13360048
     END;                                                               13370016
                                                                        13380016
     IF NUL470AY = -1 THEN                                              13390016
     DO;                                                                13400016
       WRK_CONTACT_TIME_UNT_3 = '';                                     13410048
     END;                                                               13420016
                                                                        13430016
     IF NUL470AZ = -1 THEN                                              13440016
     DO;                                                                13450016
       WRK_CONTACT_TIME_COM_3 = '';                                     13460048
     END;                                                               13470016
                                                                        13480016
     IF NUL470BA ¬= -1 THEN                                             13490016
     DO;                                                                13500016
       WRK_ONSITE_RESP_QTY_1 = WRK_ONSITE_RESP_QTY_1F;                  13510049
     END;                                                               13520016
     ELSE DO;                                                           13530016
       WRK_ONSITE_RESP_QTY_1 = 0;                                       13540049
     END;                                                               13550016
                                                                        13560016
     IF NUL470BB = -1 THEN                                              13570016
     DO;                                                                13580016
       WRK_ONSITE_RESP_UNT_1 = '';                                      13590049
     END;                                                               13600016
                                                                        13610016
     IF NUL470BC = -1 THEN                                              13620016
     DO;                                                                13630016
       WRK_ONSITE_RESP_COM_1 = '';                                      13640049
     END;                                                               13650016
                                                                        13660016
     IF NUL470BD ¬= -1 THEN                                             13670016
     DO;                                                                13680016
       WRK_ONSITE_RESP_QTY_2 = WRK_ONSITE_RESP_QTY_2F;                  13690049
     END;                                                               13700016
     ELSE DO;                                                           13710016
       WRK_ONSITE_RESP_QTY_2 = 0;                                       13720049
     END;                                                               13730016
                                                                        13740016
     IF NUL470BE = -1 THEN                                              13750016
     DO;                                                                13760016
       WRK_ONSITE_RESP_UNT_2 = '';                                      13770049
     END;                                                               13780016
                                                                        13790016
     IF NUL470BF = -1 THEN                                              13800016
     DO;                                                                13810016
       WRK_ONSITE_RESP_COM_2 = '';                                      13820049
     END;                                                               13830016
                                                                        13840016
     IF NUL470BG ¬= -1 THEN                                             13850016
     DO;                                                                13860016
       WRK_ONSITE_RESP_QTY_3 = WRK_ONSITE_RESP_QTY_3F;                  13870049
     END;                                                               13880016
     ELSE DO;                                                           13890016
       WRK_ONSITE_RESP_QTY_3 = 0;                                       13900049
     END;                                                               13910016
                                                                        13920016
     IF NUL470BH = -1 THEN                                              13930016
     DO;                                                                13940016
       WRK_ONSITE_RESP_UNT_3 = '';                                      13950049
     END;                                                               13960016
                                                                        13970016
     IF NUL470BI = -1 THEN                                              13980016
     DO;                                                                13990016
       WRK_ONSITE_RESP_COM_3 = '';                                      14000049
     END;                                                               14010016
                                                                        14020016
     IF NUL470BJ ¬= -1 THEN                                             14030016
     DO;                                                                14040016
       WRK_FIX_TIME_QTY_1 = WRK_FIX_TIME_QTY_1F;                        14050016
     END;                                                               14060016
     ELSE DO;                                                           14070016
       WRK_FIX_TIME_QTY_1 = 0;                                          14080016
     END;                                                               14090016
                                                                        14100016
     IF NUL470BK = -1 THEN                                              14110016
     DO;                                                                14120016
       WRK_FIX_TIME_UNT_1 = '';                                         14130016
     END;                                                               14140016
                                                                        14150016
     IF NUL470BL = -1 THEN                                              14160016
     DO;                                                                14170016
       WRK_FIX_TIME_COM_1 = '';                                         14180016
     END;                                                               14190016
                                                                        14200016
     IF NUL470BM ¬= -1 THEN                                             14210016
     DO;                                                                14220016
       WRK_FIX_TIME_QTY_2 = WRK_FIX_TIME_QTY_2F;                        14230016
     END;                                                               14240016
     ELSE DO;                                                           14250016
       WRK_FIX_TIME_QTY_2 = 0;                                          14260016
     END;                                                               14270016
                                                                        14280016
     IF NUL470BN = -1 THEN                                              14290016
     DO;                                                                14300016
       WRK_FIX_TIME_UNT_2 = '';                                         14310016
     END;                                                               14320016
                                                                        14330016
     IF NUL470BO = -1 THEN                                              14340016
     DO;                                                                14350016
       WRK_FIX_TIME_COM_2 = '';                                         14360016
     END;                                                               14370016
                                                                        14380016
     IF NUL470BP ¬= -1 THEN                                             14390016
     DO;                                                                14400016
       WRK_FIX_TIME_QTY_3 = WRK_FIX_TIME_QTY_3F;                        14410016
     END;                                                               14420016
     ELSE DO;                                                           14430016
       WRK_FIX_TIME_QTY_3 = 0;                                          14440016
     END;                                                               14450016
                                                                        14460016
     IF NUL470BQ = -1 THEN                                              14470016
     DO;                                                                14480016
       WRK_FIX_TIME_UNT_3 = '';                                         14490016
     END;                                                               14500016
                                                                        14510016
     IF NUL470BR = -1 THEN                                              14520016
     DO;                                                                14530016
       WRK_FIX_TIME_COM_3 = '';                                         14540016
     END;                                                               14550016
                                                                        14560016
     IF NUL470BS ¬= -1 THEN                                             14570016
     DO;                                                                14580016
       WRK_TURN_AROUND_QTY_1 = WRK_TURN_AROUND_QTY_1F;                  14590049
     END;                                                               14600016
     ELSE DO;                                                           14610016
       WRK_TURN_AROUND_QTY_1 = 0;                                       14620049
     END;                                                               14630016
                                                                        14640016
     IF NUL470BT = -1 THEN                                              14650016
     DO;                                                                14660016
       WRK_TURN_AROUND_UNT_1 = '';                                      14670049
     END;                                                               14680016
                                                                        14690016
     IF NUL470BU = -1 THEN                                              14700016
     DO;                                                                14710016
       WRK_TURN_AROUND_COM_1 = '';                                      14720049
     END;                                                               14730016
                                                                        14740016
     IF NUL470BV ¬= -1 THEN                                             14750016
     DO;                                                                14760016
       WRK_TURN_AROUND_QTY_2 = WRK_TURN_AROUND_QTY_2F;                  14770049
     END;                                                               14780016
     ELSE DO;                                                           14790016
       WRK_TURN_AROUND_QTY_2 = 0;                                       14800049
     END;                                                               14810016
                                                                        14820016
     IF NUL470BW = -1 THEN                                              14830016
     DO;                                                                14840016
       WRK_TURN_AROUND_UNT_2 = '';                                      14850049
     END;                                                               14860016
                                                                        14870016
     IF NUL470BX = -1 THEN                                              14880016
     DO;                                                                14890016
       WRK_TURN_AROUND_COM_2 = '';                                      14900049
     END;                                                               14910016
                                                                        14920016
     IF NUL470BY ¬= -1 THEN                                             14930016
     DO;                                                                14940016
       WRK_TURN_AROUND_QTY_3 = WRK_TURN_AROUND_QTY_3F;                  14950049
     END;                                                               14960016
     ELSE DO;                                                           14970016
       WRK_TURN_AROUND_QTY_3 = 0;                                       14980049
     END;                                                               14990016
                                                                        15000016
     IF NUL470BZ = -1 THEN                                              15010016
     DO;                                                                15020016
       WRK_TURN_AROUND_UNT_3 = '';                                      15030049
     END;                                                               15040016
                                                                        15050016
     IF NUL470CA = -1 THEN                                              15060016
     DO;                                                                15070016
       WRK_TURN_AROUND_COM_3 = '';                                      15080049
     END;                                                               15090016
                                                                        15100016
     IF NUL470CB ¬= -1 THEN                                             15110016
     DO;                                                                15120016
       WRK_PRT_ONS_TIME_QTY_1 = WRK_PRT_ONS_TIME_QTY_1F;                15130016
     END;                                                               15140016
     ELSE DO;                                                           15150016
       WRK_PRT_ONS_TIME_QTY_1 = 0;                                      15160016
     END;                                                               15170016
                                                                        15180016
     IF NUL470CC = -1 THEN                                              15190016
     DO;                                                                15200016
       WRK_PRT_ONS_TIME_UNT_1 = '';                                     15210016
     END;                                                               15220016
                                                                        15230016
     IF NUL470CD = -1 THEN                                              15240016
     DO;                                                                15250016
       WRK_PRT_ONS_TIME_COM_1 = '';                                     15260016
     END;                                                               15270016
                                                                        15280016
     IF NUL470CE ¬= -1 THEN                                             15290016
     DO;                                                                15300016
       WRK_PRT_ONS_TIME_QTY_2 = WRK_PRT_ONS_TIME_QTY_2F;                15310016
     END;                                                               15320016
     ELSE DO;                                                           15330016
       WRK_PRT_ONS_TIME_QTY_2 = 0;                                      15340016
     END;                                                               15350016
                                                                        15360016
     IF NUL470CF = -1 THEN                                              15370016
     DO;                                                                15380016
       WRK_PRT_ONS_TIME_UNT_2 = '';                                     15390016
     END;                                                               15400016
                                                                        15410016
     IF NUL470CG = -1 THEN                                              15420016
     DO;                                                                15430016
       WRK_PRT_ONS_TIME_COM_2 = '';                                     15440016
     END;                                                               15450016
                                                                        15460016
     IF NUL470CH ¬= -1 THEN                                             15470016
     DO;                                                                15480016
     WRK_PRT_ONS_TIME_QTY_3 = WRK_PRT_ONS_TIME_QTY_3F;                  15490016
     END;                                                               15500016
     ELSE DO;                                                           15510016
       WRK_PRT_ONS_TIME_QTY_3 = 0;                                      15520016
     END;                                                               15530016
                                                                        15540016
     IF NUL470CI = -1 THEN                                              15550016
     DO;                                                                15560016
       WRK_PRT_ONS_TIME_UNT_3 = '';                                     15570016
     END;                                                               15580016
                                                                        15590016
     IF NUL470CJ = -1 THEN                                              15600016
     DO;                                                                15610016
       WRK_PRT_ONS_TIME_COM_3 = '';                                     15620016
     END;                                                               15630016
                                                                        15640016
     RCBM22O.SERVICE_DLVR_METHDO = WRK_SERVICE_DLVR_METHD;              15650016
     RCBM22O.TIME_ZERO_INDO      = WRK_TIME_ZERO_IND;                   15660016
                                                                        15670016
     IF WRK_CONTACT_TIME_QTY_1     = 0 THEN                             15680048
       RCBM22O.CONTACT_TIME_QTY_1O = '';                                15690048
     ELSE                                                               15700016
       RCBM22O.CONTACT_TIME_QTY_1O = WRK_CONTACT_TIME_QTY_1;            15710048
     RCBM22O.CONTACT_TIME_UNT_1O = WRK_CONTACT_TIME_UNT_1;              15720048
     RCBM22O.CONTACT_TIME_COM_1O = WRK_CONTACT_TIME_COM_1;              15730048
     IF WRK_CONTACT_TIME_QTY_2      = 0 THEN                            15740048
       RCBM22O.CONTACT_TIME_QTY_2O = '';                                15750048
     ELSE                                                               15760016
       RCBM22O.CONTACT_TIME_QTY_2O = WRK_CONTACT_TIME_QTY_2;            15770048
     RCBM22O.CONTACT_TIME_UNT_2O = WRK_CONTACT_TIME_UNT_2;              15780048
     RCBM22O.CONTACT_TIME_COM_2O = WRK_CONTACT_TIME_COM_2;              15790048
     IF WRK_CONTACT_TIME_QTY_3      = 0 THEN                            15800048
       RCBM22O.CONTACT_TIME_QTY_3O = '';                                15810048
     ELSE                                                               15820016
       RCBM22O.CONTACT_TIME_QTY_3O = WRK_CONTACT_TIME_QTY_3;            15830048
     RCBM22O.CONTACT_TIME_UNT_3O = WRK_CONTACT_TIME_UNT_3;              15840048
     RCBM22O.CONTACT_TIME_COM_3O = WRK_CONTACT_TIME_COM_3;              15850048
     IF WRK_ONSITE_RESP_QTY_1       = 0 THEN                            15860049
       RCBM22O.ONSITE_RESP_QTY_1O = '';                                 15870049
     ELSE                                                               15880016
       RCBM22O.ONSITE_RESP_QTY_1O = WRK_ONSITE_RESP_QTY_1;              15890049
     RCBM22O.ONSITE_RESP_UNT_1O = WRK_ONSITE_RESP_UNT_1;                15900049
     RCBM22O.ONSITE_RESP_COM_1O = WRK_ONSITE_RESP_COM_1;                15910049
     IF WRK_ONSITE_RESP_QTY_2       = 0 THEN                            15920049
       RCBM22O.ONSITE_RESP_QTY_2O = '';                                 15930049
     ELSE                                                               15940016
       RCBM22O.ONSITE_RESP_QTY_2O = WRK_ONSITE_RESP_QTY_2;              15950049
     RCBM22O.ONSITE_RESP_UNT_2O = WRK_ONSITE_RESP_UNT_2;                15960049
     RCBM22O.ONSITE_RESP_COM_2O = WRK_ONSITE_RESP_COM_2;                15970049
     IF WRK_ONSITE_RESP_QTY_3       = 0 THEN                            15980049
       RCBM22O.ONSITE_RESP_QTY_3O = '';                                 15990049
     ELSE                                                               16000016
       RCBM22O.ONSITE_RESP_QTY_3O = WRK_ONSITE_RESP_QTY_3;              16010049
     RCBM22O.ONSITE_RESP_UNT_3O = WRK_ONSITE_RESP_UNT_3;                16020049
     RCBM22O.ONSITE_RESP_COM_3O = WRK_ONSITE_RESP_COM_3;                16030049
     IF WRK_FIX_TIME_QTY_1      = 0 THEN                                16040016
       RCBM22O.FIX_TIME_QTY_1O = '';                                    16050016
     ELSE                                                               16060016
       RCBM22O.FIX_TIME_QTY_1O = WRK_FIX_TIME_QTY_1;                    16070016
     RCBM22O.FIX_TIME_UNT_1O    = WRK_FIX_TIME_UNT_1;                   16080016
     RCBM22O.FIX_TIME_COM_1O    = WRK_FIX_TIME_COM_1;                   16090016
     IF WRK_FIX_TIME_QTY_2      = 0 THEN                                16100016
       RCBM22O.FIX_TIME_QTY_2O = '';                                    16110016
     ELSE                                                               16120016
       RCBM22O.FIX_TIME_QTY_2O = WRK_FIX_TIME_QTY_2;                    16130016
     RCBM22O.FIX_TIME_UNT_2O    = WRK_FIX_TIME_UNT_2;                   16140016
     RCBM22O.FIX_TIME_COM_2O    = WRK_FIX_TIME_COM_2;                   16150016
     IF WRK_FIX_TIME_QTY_3      = 0 THEN                                16160016
       RCBM22O.FIX_TIME_QTY_3O = '';                                    16170016
     ELSE                                                               16180016
       RCBM22O.FIX_TIME_QTY_3O = WRK_FIX_TIME_QTY_3;                    16190016
     RCBM22O.FIX_TIME_UNT_3O    = WRK_FIX_TIME_UNT_3;                   16200016
     RCBM22O.FIX_TIME_COM_3O    = WRK_FIX_TIME_COM_3;                   16210016
     IF WRK_TURN_AROUND_QTY_1       = 0 THEN                            16220049
       RCBM22O.TURN_AROUND_QTY_1O = '';                                 16230049
     ELSE                                                               16240016
       RCBM22O.TURN_AROUND_QTY_1O = WRK_TURN_AROUND_QTY_1;              16250049
     RCBM22O.TURN_AROUND_UNT_1O = WRK_TURN_AROUND_UNT_1;                16260049
     RCBM22O.TURN_AROUND_COM_1O = WRK_TURN_AROUND_COM_1;                16270049
     IF WRK_TURN_AROUND_QTY_2       = 0 THEN                            16280049
       RCBM22O.TURN_AROUND_QTY_2O = '';                                 16290049
     ELSE                                                               16300016
       RCBM22O.TURN_AROUND_QTY_2O = WRK_TURN_AROUND_QTY_2;              16310049
     RCBM22O.TURN_AROUND_UNT_2O = WRK_TURN_AROUND_UNT_2;                16320049
     RCBM22O.TURN_AROUND_COM_2O = WRK_TURN_AROUND_COM_2;                16330049
     IF WRK_TURN_AROUND_QTY_3       = 0 THEN                            16340049
       RCBM22O.TURN_AROUND_QTY_3O = '';                                 16350049
     ELSE                                                               16360016
       RCBM22O.TURN_AROUND_QTY_3O = WRK_TURN_AROUND_QTY_3;              16370049
     RCBM22O.TURN_AROUND_UNT_3O = WRK_TURN_AROUND_UNT_3;                16380049
     RCBM22O.TURN_AROUND_COM_3O = WRK_TURN_AROUND_COM_3;                16390049
     IF WRK_PRT_ONS_TIME_QTY_1      = 0 THEN                            16400016
       RCBM22O.PRT_ONS_TIME_QTY_1O = '';                                16410016
     ELSE                                                               16420016
       RCBM22O.PRT_ONS_TIME_QTY_1O = WRK_PRT_ONS_TIME_QTY_1;            16430016
     RCBM22O.PRT_ONS_TIME_UNT_1O = WRK_PRT_ONS_TIME_UNT_1;              16440016
     RCBM22O.PRT_ONS_TIME_COM_1O = WRK_PRT_ONS_TIME_COM_1;              16450016
     IF WRK_PRT_ONS_TIME_QTY_2      = 0 THEN                            16460016
       RCBM22O.PRT_ONS_TIME_QTY_2O = '';                                16470016
     ELSE                                                               16480016
       RCBM22O.PRT_ONS_TIME_QTY_2O = WRK_PRT_ONS_TIME_QTY_2;            16490016
     RCBM22O.PRT_ONS_TIME_UNT_2O    = WRK_PRT_ONS_TIME_UNT_2;           16500016
     RCBM22O.PRT_ONS_TIME_COM_2O    = WRK_PRT_ONS_TIME_COM_2;           16510016
     IF WRK_PRT_ONS_TIME_QTY_3      = 0 THEN                            16520016
       RCBM22O.PRT_ONS_TIME_QTY_3O = '';                                16530016
     ELSE                                                               16540016
       RCBM22O.PRT_ONS_TIME_QTY_3O = WRK_PRT_ONS_TIME_QTY_3;            16550016
     RCBM22O.PRT_ONS_TIME_UNT_3O    = WRK_PRT_ONS_TIME_UNT_3;           16560016
     RCBM22O.PRT_ONS_TIME_COM_3O    = WRK_PRT_ONS_TIME_COM_3;           16570016
                                                                        16580016
     RCBM22O.ACTIONA               = DFHBMPRF;                          16590016
     RCBM22O.SLCA                  = DFHBMPRF;                          16600016
     RCBM22O.COVERAGE_START_1A     = DFHBMPRF;                          16610016
     RCBM22O.COVERAGE_START_2A     = DFHBMPRF;                          16620016
     RCBM22O.COVERAGE_START_3A     = DFHBMPRF;                          16630016
     RCBM22O.COVERAGE_START_4A     = DFHBMPRF;                          16640016
     RCBM22O.COVERAGE_START_5A     = DFHBMPRF;                          16650016
     RCBM22O.COVERAGE_START_6A     = DFHBMPRF;                          16660016
     RCBM22O.COVERAGE_START_7A     = DFHBMPRF;                          16670016
     RCBM22O.COVERAGE_END_1A       = DFHBMPRF;                          16680016
     RCBM22O.COVERAGE_END_2A       = DFHBMPRF;                          16690016
     RCBM22O.COVERAGE_END_3A       = DFHBMPRF;                          16700016
     RCBM22O.COVERAGE_END_4A       = DFHBMPRF;                          16710016
     RCBM22O.COVERAGE_END_5A       = DFHBMPRF;                          16720016
     RCBM22O.COVERAGE_END_6A       = DFHBMPRF;                          16730016
     RCBM22O.COVERAGE_END_7A       = DFHBMPRF;                          16740016
     RCBM22O.COMMENT_TEXTA         = DFHBMPRF;                          16750016
     RCBM22O.SERVICE_DLVR_METHDA   = DFHBMPRF;                          16760016
     RCBM22O.TIME_ZERO_INDA        = DFHBMPRF;                          16770016
     RCBM22O.CONTACT_TIME_QTY_1A   = DFHBMPRF;                          16780048
     RCBM22O.CONTACT_TIME_UNT_1A   = DFHBMPRF;                          16790048
     RCBM22O.CONTACT_TIME_COM_1A   = DFHBMPRF;                          16800048
     RCBM22O.CONTACT_TIME_QTY_2A   = DFHBMPRF;                          16810048
     RCBM22O.CONTACT_TIME_UNT_2A   = DFHBMPRF;                          16820048
     RCBM22O.CONTACT_TIME_COM_2A   = DFHBMPRF;                          16830048
     RCBM22O.CONTACT_TIME_QTY_3A   = DFHBMPRF;                          16840048
     RCBM22O.CONTACT_TIME_UNT_3A   = DFHBMPRF;                          16850048
     RCBM22O.CONTACT_TIME_COM_3A   = DFHBMPRF;                          16860048
     RCBM22O.ONSITE_RESP_QTY_1A = DFHBMPRF;                             16870049
     RCBM22O.ONSITE_RESP_UNT_1A = DFHBMPRF;                             16880049
     RCBM22O.ONSITE_RESP_COM_1A = DFHBMPRF;                             16890049
     RCBM22O.ONSITE_RESP_QTY_2A = DFHBMPRF;                             16900049
     RCBM22O.ONSITE_RESP_UNT_2A = DFHBMPRF;                             16910049
     RCBM22O.ONSITE_RESP_COM_2A = DFHBMPRF;                             16920049
     RCBM22O.ONSITE_RESP_QTY_3A = DFHBMPRF;                             16930049
     RCBM22O.ONSITE_RESP_UNT_3A = DFHBMPRF;                             16940049
     RCBM22O.ONSITE_RESP_COM_3A = DFHBMPRF;                             16950049
     RCBM22O.FIX_TIME_QTY_1A       = DFHBMPRF;                          16960016
     RCBM22O.FIX_TIME_UNT_1A       = DFHBMPRF;                          16970016
     RCBM22O.FIX_TIME_COM_1A       = DFHBMPRF;                          16980016
     RCBM22O.FIX_TIME_QTY_2A       = DFHBMPRF;                          16990016
     RCBM22O.FIX_TIME_UNT_2A       = DFHBMPRF;                          17000016
     RCBM22O.FIX_TIME_COM_2A       = DFHBMPRF;                          17010016
     RCBM22O.FIX_TIME_QTY_3A       = DFHBMPRF;                          17020016
     RCBM22O.FIX_TIME_UNT_3A       = DFHBMPRF;                          17030016
     RCBM22O.FIX_TIME_COM_3A       = DFHBMPRF;                          17040016
     RCBM22O.TURN_AROUND_QTY_1A = DFHBMPRF;                             17050049
     RCBM22O.TURN_AROUND_UNT_1A = DFHBMPRF;                             17060049
     RCBM22O.TURN_AROUND_COM_1A = DFHBMPRF;                             17070049
     RCBM22O.TURN_AROUND_QTY_2A = DFHBMPRF;                             17080049
     RCBM22O.TURN_AROUND_UNT_2A = DFHBMPRF;                             17090049
     RCBM22O.TURN_AROUND_COM_2A = DFHBMPRF;                             17100049
     RCBM22O.TURN_AROUND_QTY_3A = DFHBMPRF;                             17110049
     RCBM22O.TURN_AROUND_UNT_3A = DFHBMPRF;                             17120049
     RCBM22O.TURN_AROUND_COM_3A = DFHBMPRF;                             17130049
     RCBM22O.PRT_ONS_TIME_QTY_1A   = DFHBMPRF;                          17140016
     RCBM22O.PRT_ONS_TIME_UNT_1A   = DFHBMPRF;                          17150016
     RCBM22O.PRT_ONS_TIME_COM_1A   = DFHBMPRF;                          17160016
     RCBM22O.PRT_ONS_TIME_QTY_2A   = DFHBMPRF;                          17170016
     RCBM22O.PRT_ONS_TIME_UNT_2A   = DFHBMPRF;                          17180016
     RCBM22O.PRT_ONS_TIME_COM_2A   = DFHBMPRF;                          17190016
     RCBM22O.PRT_ONS_TIME_QTY_3A   = DFHBMPRF;                          17200016
     RCBM22O.PRT_ONS_TIME_UNT_3A   = DFHBMPRF;                          17210016
     RCBM22O.PRT_ONS_TIME_COM_3A   = DFHBMPRF;                          17220016
     RCBM22O.PFLINEO = 'Press ENTER to Return';                         17230016
                                                                        17240016
     HEADER.NEXT = 'H1';                                                17250036
     CALL RCBC25M_SEND_MAP22;                                           17260016
   END;                                                                 17270016
                                                                        17280016
   WHEN(100)                                                            17290025
   DO;                                                                  17300025
     CALL RCBC25M_SEND_MAP;                                             17310025
   END;                                                                 17320025
                                                                        17330025
   OTHERWISE                                                            17340016
   DO;                                                                  17350016
     RCBM25O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                  17360016
                                      ||  ' OCCURED';                   17370016
     CALL RCBC25M_SEND_MAP;                                             17380037
   END;                                                                 17390016
 END;                                                                   17400016
                                                                        17410016
0END RCBC25M_GET_DETAILS;                                               17420016
1/********************************************************************/ 17430016
 /*      UPDATE T480 RECORD                                          */ 17440016
 /********************************************************************/ 17450016
0RCBC25M_UPDATE_SLC: PROC;                                              17460016
                                                                        17470016
 RCB480S    = '';                                                       17480016
 UPD_CONT   = 'Y';                                                      17490016
 UPD_TYPE   = 'Y';                                                      17500016
 UPD_MODEL  = 'Y';                                                      17510016
 UPD_ORIGIN = 'Y';                                                      17520016
 UPD_SEQNO  = 'Y';                                                      17530016
                                                                        17540016
 IF RCBM25I.CONTRACT_NUMBERI(I) = '' THEN                               17550016
   UPD_CONT   = 'N';                                                    17560016
 ELSE                                                                   17570016
   RCB480S.CONTRACT_NUMBER  = RCBM25I.CONTRACT_NUMBERI(I);              17580016
                                                                        17590016
 IF RCBM25I.PRODUCT_TYPEI(I) = '' THEN                                  17600016
   UPD_TYPE   = 'N';                                                    17610016
 ELSE                                                                   17620016
   RCB480S.PRODUCT_TYPE = RCBM25I.PRODUCT_TYPEI(I);                     17630016
                                                                        17640016
 IF RCBM25I.MODEL_NUMBERI(I) = '' THEN                                  17650016
   UPD_MODEL  = 'N';                                                    17660016
 ELSE                                                                   17670016
   RCB480S.MODEL_NUMBER = RCBM25I.MODEL_NUMBERI(I);                     17680016
                                                                        17690016
 IF RCBM25I.ORIGINI(I) = '' THEN                                        17700016
   UPD_ORIGIN = 'N';                                                    17710016
 ELSE                                                                   17720016
   RCB480S.ORIGIN = RCBM25I.ORIGINI(I);                                 17730016
                                                                        17740016
 IF RCBM25I.SEQUENCE_NUMBERI(I) = '' THEN                               17750016
   UPD_SEQNO  = 'N';                                                    17760016
 ELSE                                                                   17770016
   RCB480S.SEQUENCE_NUMBER = RCBM25I.SEQUENCE_NUMBERI(I);               17780016
                                                                        17790016
 RCB480S.SERVICE_LVL_CODE = RCBM25I.SERVICE_LVL_CODEI(I);               17800015
                                                                        17810001
 EXEC SQL                                                               17820015
    UPDATE RCBV0480_MA_SLC                                              17830015
    SET SERVICE_LVL_CODE  = :RCB480S.SERVICE_LVL_CODE                   17840015
    WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                         17850040
      AND (CONTRACT_NUMBER = :RCB480S.CONTRACT_NUMBER                   17860015
       OR ( CONTRACT_NUMBER IS NULL                                     17870016
      AND  :UPD_CONT         = 'N'))                                    17880016
      AND (PRODUCT_TYPE    = :RCB480S.PRODUCT_TYPE                      17890015
       OR (PRODUCT_TYPE    IS NULL                                      17900016
      AND  :UPD_TYPE         = 'N'))                                    17910016
      AND (MODEL_NUMBER    = :RCB480S.MODEL_NUMBER                      17920015
       OR (MODEL_NUMBER    IS NULL                                      17930016
      AND  :UPD_MODEL        = 'N'))                                    17940016
      AND (ORIGIN          = :RCB480S.ORIGIN                            17950015
       OR (ORIGIN          IS NULL                                      17960016
      AND  :UPD_ORIGIN       = 'N'))                                    17970016
      AND (SEQUENCE_NUMBER = :RCB480S.SEQUENCE_NUMBER                   17980015
       OR (SEQUENCE_NUMBER IS NULL                                      17990016
      AND  :UPD_SEQNO        = 'N'));                                   18000016
                                                                        18010015
 SELECT (SQLCA.SQLCODE);                                                18020001
   WHEN (0);                                                            18030001
                                                                        18040008
   WHEN (100)                                                           18050008
   DO;                                                                  18060001
     CALL RCBC25M_PROTECT_MAP;                                          18070011
     RCBM25O.MSG_LINEO = ERR_O120;                                      18080038
     RCBM25O.ACTIONC(I) = DFHRED;                                       18090002
     RCBM25I.ACTIONL(I) = -1;                                           18100002
     CALL RCBC25M_SEND_MAP_CSR;                                         18110037
   END;                                                                 18120001
                                                                        18130008
   OTHERWISE                                                            18140008
   DO;                                                                  18150008
     CALL RCBC25M_PROTECT_MAP;                                          18160011
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       18170008
     RCBM25O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0480 UPDATE = '       18180008
                       || PIC_EXPLAIN;                                  18190008
     RCBM25O.ACTIONC(I) = DFHRED;                                       18200008
     RCBM25I.ACTIONL(I) = -1;                                           18210008
     CALL RCBC25M_SEND_MAP_CSR;                                         18220037
   END;                                                                 18230008
 END;                                                                   18240001
                                                                        18250001
 T480_UPD_FLAG = TRUE;                                                  18260001
                                                                        18270001
0END RCBC25M_UPDATE_SLC;                                                18280001
1/********************************************************************/ 18290001
 /*      CREATE T480 RECORD                                          */ 18300001
 /********************************************************************/ 18310001
0RCBC25M_DEFINE_SLC: PROC;                                              18320001
                                                                        18330001
 RCB480S = '';                                                          18340014
 RCB480SI.INDNULL(*) = 0;                                               18350014
 IF RCBM25I.CONTRACT_NUMBERI(I) = '' THEN                               18360014
   RCB480SI.INDNULL(2) = -1;                                            18370014
 ELSE                                                                   18380014
   RCB480S.CONTRACT_NUMBER = RCBM25I.CONTRACT_NUMBERI(I);               18390014
 IF RCBM25I.PRODUCT_TYPEI(I) = '' THEN                                  18400014
   RCB480SI.INDNULL(3) = -1;                                            18410014
 ELSE                                                                   18420014
   RCB480S.PRODUCT_TYPE = RCBM25I.PRODUCT_TYPEI(I);                     18430014
 IF RCBM25I.MODEL_NUMBERI(I) = '' THEN                                  18440014
   RCB480SI.INDNULL(4) = -1;                                            18450014
 ELSE                                                                   18460014
   RCB480S.MODEL_NUMBER = RCBM25I.MODEL_NUMBERI(I);                     18470014
 IF RCBM25I.ORIGINI(I) = '' THEN                                        18480014
   RCB480SI.INDNULL(5) = -1;                                            18490014
 ELSE                                                                   18500014
   RCB480S.ORIGIN = RCBM25I.ORIGINI(I);                                 18510014
 IF RCBM25I.SEQUENCE_NUMBERI(I) = '' THEN                               18520014
   RCB480SI.INDNULL(6) = -1;                                            18530014
 ELSE                                                                   18540014
   RCB480S.SEQUENCE_NUMBER  = RCBM25I.SEQUENCE_NUMBERI(I);              18550014
                                                                        18560014
 RCB480S.COUNTRY_NUMBER   = WRK_COUNTRY_NUMBER;                         18570040
 RCB480S.SERVICE_LVL_CODE = RCBM25I.SERVICE_LVL_CODEI(I);               18580002
                                                                        18590001
 EXEC SQL                                                               18600001
      INSERT INTO RCBV0480_MA_SLC                                       18610002
         (COUNTRY_NUMBER                                                18620001
         ,CONTRACT_NUMBER                                               18630014
         ,PRODUCT_TYPE                                                  18640014
         ,MODEL_NUMBER                                                  18650014
         ,ORIGIN                                                        18660014
         ,SEQUENCE_NUMBER                                               18670001
         ,SERVICE_LVL_CODE)                                             18680001
      VALUES (:RCB480S:RCB480SI.INDNULL);                               18690014
                                                                        18700001
 SELECT (SQLCA.SQLCODE);                                                18710001
   WHEN (0);                                                            18720001
                                                                        18730001
   WHEN (-803)                                                          18740001
   DO;                                                                  18750001
     CALL RCBC25M_PROTECT_MAP;                                          18760011
     RCBM25O.MSG_LINEO = 'TOS already exists';                          18770002
     RCBM25O.PRODUCT_TYPEC(I)    = DFHRED;                              18780020
     RCBM25O.ORIGINC(I)          = DFHRED;                              18790020
     RCBM25O.SEQUENCE_NUMBERC(I) = DFHRED;                              18800020
     RCBM25I.ACTIONL(I)          = -1;                                  18810002
     CALL RCBC25M_SEND_MAP_CSR;                                         18820037
   END;                                                                 18830001
                                                                        18840001
   OTHERWISE                                                            18850001
   DO;                                                                  18860001
     CALL RCBC25M_PROTECT_MAP;                                          18870011
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       18880001
     RCBM25O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0480 INSERT = '       18890002
                       || PIC_EXPLAIN;                                  18900001
     RCBM25O.ACTIONC(I) = DFHRED;                                       18910002
     RCBM25I.ACTIONL(I) = -1;                                           18920002
     CALL RCBC25M_SEND_MAP_CSR;                                         18930037
   END;                                                                 18940001
 END;                                                                   18950001
                                                                        18960001
 T480_UPD_FLAG = TRUE;                                                  18970001
                                                                        18980001
0END RCBC25M_DEFINE_SLC;                                                18990001
1/********************************************************************/ 19000001
 /*      DELETE T480 RECORD                                          */ 19010001
 /********************************************************************/ 19020001
0RCBC25M_DELETE_SLC: PROC;                                              19030001
                                                                        19040001
 RCB480S    = '';                                                       19050014
 UPD_CONT   = 'Y';                                                      19060014
 UPD_TYPE   = 'Y';                                                      19070014
 UPD_MODEL  = 'Y';                                                      19080014
 UPD_ORIGIN = 'Y';                                                      19090014
 UPD_SEQNO  = 'Y';                                                      19100014
                                                                        19110029
 IF TOP_DEL_FLAG = TRUE THEN                                            19120030
 DO;                                                                    19130027
   RCB480S.CONTRACT_NUMBER = RCBM25I.CONTRACT_NUMBERI(I);               19140030
   EXEC SQL                                                             19150029
        DELETE FROM RCBV0480_MA_SLC                                     19160029
        WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                     19170040
          AND CONTRACT_NUMBER = :RCB480S.CONTRACT_NUMBER;               19180030
                                                                        19190029
   SELECT (SQLCA.SQLCODE);                                              19200029
     WHEN (0);                                                          19210029
                                                                        19220029
     WHEN (100)                                                         19230029
     DO;                                                                19240029
       CALL RCBC25M_PROTECT_MAP;                                        19250029
       RCBM25O.MSG_LINEO = ERR_O121;                                    19260038
       RCBM25O.ACTIONC(I) = DFHRED;                                     19270029
       RCBM25I.ACTIONL(I) = -1;                                         19280029
       CALL RCBC25M_SEND_MAP_CSR;                                       19290037
     END;                                                               19300029
                                                                        19310029
     OTHERWISE                                                          19320029
     DO;                                                                19330029
       CALL RCBC25M_PROTECT_MAP;                                        19340029
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     19350029
       RCBM25O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0480 DELETE = '     19360029
                         || PIC_EXPLAIN;                                19370029
       RCBM25O.ACTIONC(I) = DFHRED;                                     19380029
       RCBM25I.ACTIONL(I) = -1;                                         19390029
       CALL RCBC25M_SEND_MAP_CSR;                                       19400037
     END;                                                               19410029
   END;                                                                 19420029
                                                                        19430029
   F5_OK_FLAG    = FALSE;                                               19440029
   T480_UPD_FLAG = TRUE;                                                19450029
   RETURN;                                                              19460029
 END;                                                                   19470027
                                                                        19480029
 IF RCBM25I.CONTRACT_NUMBERI(I) = '' THEN                               19490027
   UPD_CONT   = 'N';                                                    19500014
 ELSE                                                                   19510014
   RCB480S.CONTRACT_NUMBER  = RCBM25I.CONTRACT_NUMBERI(I);              19520014
                                                                        19530014
 IF RCBM25I.PRODUCT_TYPEI(I) = '' THEN                                  19540014
   UPD_TYPE   = 'N';                                                    19550014
 ELSE                                                                   19560014
   RCB480S.PRODUCT_TYPE = RCBM25I.PRODUCT_TYPEI(I);                     19570014
                                                                        19580014
 IF RCBM25I.MODEL_NUMBERI(I) = '' THEN                                  19590014
   UPD_MODEL  = 'N';                                                    19600014
 ELSE                                                                   19610014
   RCB480S.MODEL_NUMBER = RCBM25I.MODEL_NUMBERI(I);                     19620014
                                                                        19630014
 IF RCBM25I.ORIGINI(I) = '' THEN                                        19640014
   UPD_ORIGIN = 'N';                                                    19650014
 ELSE                                                                   19660014
   RCB480S.ORIGIN = RCBM25I.ORIGINI(I);                                 19670014
                                                                        19680014
 IF RCBM25I.SEQUENCE_NUMBERI(I) = '' THEN                               19690014
   UPD_SEQNO  = 'N';                                                    19700014
 ELSE                                                                   19710014
   RCB480S.SEQUENCE_NUMBER = RCBM25I.SEQUENCE_NUMBERI(I);               19720014
                                                                        19730014
                                                                        19740001
 EXEC SQL                                                               19750001
      DELETE FROM RCBV0480_MA_SLC                                       19760004
      WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                       19770040
      AND (CONTRACT_NUMBER = :RCB480S.CONTRACT_NUMBER                   19780016
       OR ( CONTRACT_NUMBER IS NULL                                     19790016
      AND  :UPD_CONT         = 'N'))                                    19800016
      AND (PRODUCT_TYPE    = :RCB480S.PRODUCT_TYPE                      19810016
       OR (PRODUCT_TYPE    IS NULL                                      19820016
      AND  :UPD_TYPE         = 'N'))                                    19830016
      AND (MODEL_NUMBER    = :RCB480S.MODEL_NUMBER                      19840016
       OR (MODEL_NUMBER    IS NULL                                      19850016
      AND  :UPD_MODEL        = 'N'))                                    19860016
      AND (ORIGIN          = :RCB480S.ORIGIN                            19870016
       OR (ORIGIN          IS NULL                                      19880016
      AND  :UPD_ORIGIN       = 'N'))                                    19890016
      AND (SEQUENCE_NUMBER = :RCB480S.SEQUENCE_NUMBER                   19900016
       OR (SEQUENCE_NUMBER IS NULL                                      19910016
      AND  :UPD_SEQNO        = 'N'));                                   19920016
                                                                        19930001
 SELECT (SQLCA.SQLCODE);                                                19940001
   WHEN (0);                                                            19950001
                                                                        19960008
   WHEN (100)                                                           19970008
   DO;                                                                  19980008
     CALL RCBC25M_PROTECT_MAP;                                          19990011
     RCBM25O.MSG_LINEO = ERR_O121;                                      20000038
     RCBM25O.ACTIONC(I) = DFHRED;                                       20010008
     RCBM25I.ACTIONL(I) = -1;                                           20020008
     CALL RCBC25M_SEND_MAP_CSR;                                         20030037
   END;                                                                 20040008
                                                                        20050008
   OTHERWISE                                                            20060001
   DO;                                                                  20070001
     CALL RCBC25M_PROTECT_MAP;                                          20080011
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       20090001
     RCBM25O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0480 DELETE = '       20100001
                       || PIC_EXPLAIN;                                  20110001
     RCBM25O.ACTIONC(I) = DFHRED;                                       20120002
     RCBM25I.ACTIONL(I) = -1;                                           20130002
     CALL RCBC25M_SEND_MAP_CSR;                                         20140037
   END;                                                                 20150001
 END;                                                                   20160001
                                                                        20170001
 T480_UPD_FLAG = TRUE;                                                  20180001
                                                                        20190001
0END RCBC25M_DELETE_SLC;                                                20200001
1/********************************************************************/ 20210014
 /*      CREATE T560 RECORD                                          */ 20220001
 /********************************************************************/ 20230001
0RCBC25M_UPD_T560: PROC;                                                20240001
                                                                        20250021
 DCL WRK_TIME_IN  CHAR(26) INIT('');                                    20260021
                                                                        20270021
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         20280021
                                                                        20290021
 WRKMAP_DATA = ' ';                                                     20300001
 WRKMAP.CONTRACT_NUMBER = RCBM25I.CONTRACT_NUMBERI(I);                  20310014
 WRKMAP.PRODUCT_TYPE    = RCBM25I.PRODUCT_TYPEI(I);                     20320014
 WRKMAP.MODEL_NUMBER    = RCBM25I.MODEL_NUMBERI(I);                     20330014
 WRKMAP.ORIGIN          = RCBM25I.ORIGINI(I);                           20340014
 WRKMAP.SEQUENCE_NUMBER = RCBM25I.SEQUENCE_NUMBERI(I);                  20350002
 WRKMAP.SLC             = RCBM25I.SERVICE_LVL_CODEI(I);                 20360002
                                                                        20370021
 RCB560S                 = ' ';                                         20380001
 RCB560S.COUNTRY_NUMBER  = WRK_COUNTRY_NUMBER;                          20390040
 RCB560S.TXN_CODE        = 'RCBTXN25';                                  20400002
 RCB560S.TIMESTAMP       = WRK_TIME_IN;                                 20410021
 RCB560S.USERID          = HEADER.USERID;                               20420001
 RCB560S.ACTION          = WRK_ACTION;                                  20430001
 RCB560S.DATA            = WRKMAP_DATA;                                 20440001
                                                                        20450001
 EXEC SQL                                                               20460001
      INSERT INTO RCBV0560_XACTION                                      20470001
      (COUNTRY_NUMBER,                                                  20480001
       TXN_CODE,                                                        20490001
       TIMESTAMP,                                                       20500001
       USERID,                                                          20510001
       ACTION,                                                          20520001
       DATA)                                                            20530001
        VALUES (:RCB560S:RCB560SI.INDNULL);                             20540001
                                                                        20550001
 SELECT(SQLCA.SQLCODE);                                                 20560001
   WHEN(0);                                                             20570001
   OTHERWISE                                                            20580001
   DO;                                                                  20590001
     CALL RCBC25M_PROTECT_MAP;                                          20600014
     RET_CODE = SQLCA.SQLCODE;                                          20610001
     SUB_CODE = SQLCA.SQLCABC;                                          20620001
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       20630001
     RCBM25O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0560 INSERT = '       20640001
                        || PIC_EXPLAIN;                                 20650001
     CALL RCBC25M_SEND_MAP;                                             20660037
   END;                                                                 20670001
 END;                                                                   20680001
                                                                        20690001
0END RCBC25M_UPD_T560;                                                  20700001
1/********************************************************************/ 20701045
 /*    COUNT RCBT0480 FOR SEARCH CRITERIA                            */ 20702045
 /********************************************************************/ 20703045
0RCBC25M_COUNT_T480: PROC;                                              20704045
                                                                        20705045
 WRK_REC_COUNT = 0;                                                     20706045
 EXEC SQL                                                               20707045
   SELECT COUNT(*)                                                      20708045
   INTO :WRK_REC_COUNT                                                  20709045
   FROM RCBV0480_MA_SLC                                                 20709145
   WHERE COUNTRY_NUMBER = :WRK_COUNTRY_NUMBER                           20709245
     AND ((CONTRACT_NUMBER  = :SEL_CONT                                 20709345
      OR  :ENT_CONT         = 'N')                                      20709445
     AND  (PRODUCT_TYPE     = :SEL_TYPE                                 20709545
      OR  :ENT_TYPE         = 'N')                                      20709645
     AND  (MODEL_NUMBER     = :SEL_MODEL                                20709745
      OR  :ENT_MODEL        = 'N'));                                    20709845
                                                                        20709945
0END RCBC25M_COUNT_T480;                                                20710045
1/********************************************************************/ 20711035
 /*      CLEAR WORK                                                  */ 20720035
 /********************************************************************/ 20730035
0RCBC25M_CLEAR_WORK: PROC;                                              20740035
                                                                        20750035
 PF5_FLAG     = FALSE;                                                  20760035
 F5_OK_FLAG   = FALSE;                                                  20770035
 MAP_OK_FLAG  = FALSE;                                                  20780035
 TOP_DEL_FLAG = FALSE;                                                  20790035
                                                                        20800035
 WRK_SLC   = '';                                                        20810035
 SEL_MODEL = '***';                                                     20820035
 SEL_TYPE  = '****';                                                    20830035
 SEL_CONT  = '***************';                                         20840035
 ENT_MODEL = 'N';                                                       20850035
 ENT_CONT  = 'N';                                                       20860035
 ENT_TYPE  = 'N';                                                       20870035
                                                                        20880035
0END RCBC25M_CLEAR_WORK;                                                20890035
1/********************************************************************/ 20900035
 /*      CLEAR MAP RCBM25                                            */ 20910035
 /********************************************************************/ 20920035
0RCBC25M_CLEAR_MAP: PROC;                                               20930035
                                                                        20940035
 TOP_DEL_FLAG = FALSE;                                                  20950035
 F5_OK_FLAG   = FALSE;                                                  20960035
 RCBM25O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                          20970040
 RCBM25O.MODEL_SELO = '';                                               20980035
 RCBM25O.TYPE_SELO  = '';                                               20990035
 RCBM25O.CONT_SELO  = '';                                               21000035
 RCBM25O.INCNTO     = '';                                               21010035
 RCBM25O.TOTCNTO    = '';                                               21020035
 RCBM25O.ACCEPTO    = '';                                               21030035
                                                                        21040035
 DO I = 1 TO 15;                                                        21050035
   RCBM25O.ACTIONO(I)           = '';                                   21060035
   RCBM25O.CONTRACT_NUMBERO(I)  = '';                                   21070035
   RCBM25O.PRODUCT_TYPEO(I)     = '';                                   21080035
   RCBM25O.MODEL_NUMBERO(I)     = '';                                   21090035
   RCBM25O.ORIGINO(I)           = '';                                   21100035
   RCBM25O.SEQUENCE_NUMBERO(I)  = '';                                   21110035
   RCBM25O.SERVICE_LVL_CODEO(I) = '';                                   21120035
   FILL_FLAG(I)                 = FALSE;                                21130035
 END;                                                                   21140035
                                                                        21150035
0END RCBC25M_CLEAR_MAP;                                                 21160035
1/********************************************************************/ 21170035
 /*      PROTECT MAP RCBM25                                          */ 21180041
 /********************************************************************/ 21190035
0RCBC25M_PROTECT_MAP: PROC;                                             21200035
                                                                        21210035
 DO M = 1 TO 15;                                                        21220035
   IF FILL_FLAG(M) = TRUE THEN                                          21230035
   DO;                                                                  21240035
     RCBM25O.CONTRACT_NUMBERA(M) = DFHBMPRF;                            21250035
     RCBM25O.PRODUCT_TYPEA(M)    = DFHBMPRF;                            21260035
     RCBM25O.MODEL_NUMBERA(M)    = DFHBMPRF;                            21270035
     RCBM25O.ORIGINA(M)          = DFHBMPRF;                            21280035
     RCBM25O.SEQUENCE_NUMBERA(M) = DFHBMPRF;                            21290035
   END;                                                                 21300035
 END;                                                                   21310035
                                                                        21320035
0END RCBC25M_PROTECT_MAP;                                               21330035
1/********************************************************************/ 21331044
 /*      GET CURSOR POSITION                                         */ 21332044
 /*         FROR RETURN FROM HALP SCREENS                            */ 21333044
 /********************************************************************/ 21334044
0RCBC25M_GET_CSR_POS: PROC;                                             21335044
                                                                        21336044
 RCBM25I.ACTIONL(1) = 0;                                                21337044
 SELECT(CSR_POS);                                                       21338044
   WHEN(1)  RCBM25I.CONT_SELL                    = -1;                  21339044
   WHEN(2)  RCBM25I.TYPE_SELL                    = -1;                  21339144
   WHEN(3)  RCBM25I.MODEL_SELL                   = -1;                  21339244
   WHEN(4)  RCBM25I.ACTIONL(CSR_ROW)             = -1;                  21339344
   WHEN(5)  RCBM25I.CONTRACT_NUMBERL(CSR_ROW)    = -1;                  21339444
   WHEN(6)  RCBM25I.PRODUCT_TYPEL(CSR_ROW)       = -1;                  21339544
   WHEN(7)  RCBM25I.MODEL_NUMBERL(CSR_ROW)       = -1;                  21339644
   WHEN(8)  RCBM25I.ORIGINL(CSR_ROW)             = -1;                  21339744
   WHEN(9)  RCBM25I.SEQUENCE_NUMBERL(CSR_ROW)    = -1;                  21339844
   WHEN(10) RCBM25I.SERVICE_LVL_CODEL(CSR_ROW) = -1;                    21340044
   OTHERWISE RCBM25I.ACTIONL(CSR_ROW)            = -1;                  21340144
 END;                                                                   21340644
                                                                        21340744
0END RCBC25M_GET_CSR_POS;                                               21340844
1/********************************************************************/ 21340944
 /*      SEND HELP MAP                                               */ 21341044
 /********************************************************************/ 21341144
0RCBC25M_HELP_MAP: PROC;                                                21341244
                                                                        21341344
 HEADER.NEXT = 'H1';                                                    21341444
 HELP_FLAG   = FALSE;                                                   21341544
 CSR_POS     = 1;                                                       21341644
 CSR_ROW     = 1;                                                       21341744
                                                                        21341844
 DO N = 1 TO 15;                                                        21341944
   CSR_ROW = N;                                                         21342044
   IF RCBM25I.ACTIONF(N) = CSR_HELP                                     21342144
    | RCBM25I.ACTIONF(N) = CSR_EOF THEN                                 21342244
   DO;                                                                  21342344
     N = 16;                                                            21342444
     CSR_POS   = 4;                                                     21342544
     HELP_FLAG = TRUE;                                                  21342644
     EXEC CICS SEND                                                     21342744
        MAP('ACTACDV')                                                  21342844
        MAPSET('RCBHELP')                                               21342944
        FREEKB                                                          21343044
        ERASE;                                                          21343144
   END;                                                                 21343244
                                                                        21343344
   IF RCBM25I.CONTRACT_NUMBERF(N) = CSR_HELP                            21343444
    | RCBM25I.CONTRACT_NUMBERF(N) = CSR_EOF THEN                        21343544
   DO;                                                                  21343644
     N = 16;                                                            21343744
     CSR_POS   = 5;                                                     21343844
     HELP_FLAG = TRUE;                                                  21343944
     EXEC CICS SEND                                                     21344044
        MAP('CONTNO')                                                   21344144
        MAPSET('RCBHELP')                                               21344244
        FREEKB                                                          21344344
        ERASE;                                                          21344444
   END;                                                                 21344544
                                                                        21344644
   IF RCBM25I.PRODUCT_TYPEF(N) = CSR_HELP                               21346044
    | RCBM25I.PRODUCT_TYPEF(N) = CSR_EOF THEN                           21346144
   DO;                                                                  21346244
     N = 16;                                                            21346344
     CSR_POS   = 6;                                                     21346444
     HELP_FLAG = TRUE;                                                  21346544
     EXEC CICS SEND                                                     21346644
        MAP('PRODTYP')                                                  21346753
        MAPSET('RCBHELP')                                               21346844
        FREEKB                                                          21346944
        ERASE;                                                          21347044
   END;                                                                 21347144
                                                                        21347244
   IF RCBM25I.MODEL_NUMBERF(N) = CSR_HELP                               21347344
    | RCBM25I.MODEL_NUMBERF(N) = CSR_EOF THEN                           21347444
   DO;                                                                  21347544
     N = 16;                                                            21347644
     CSR_POS   = 7;                                                     21347744
     HELP_FLAG = TRUE;                                                  21347844
     EXEC CICS SEND                                                     21347944
        MAP('MODELT')                                                   21348053
        MAPSET('RCBHELP')                                               21348144
        FREEKB                                                          21348244
        ERASE;                                                          21348344
   END;                                                                 21348444
                                                                        21348544
   IF RCBM25I.ORIGINF(N) = CSR_HELP                                     21348644
    | RCBM25I.ORIGINF(N) = CSR_EOF THEN                                 21348744
   DO;                                                                  21348844
     N = 16;                                                            21348944
     CSR_POS   = 8;                                                     21349044
     HELP_FLAG = TRUE;                                                  21349144
     EXEC CICS SEND                                                     21349244
        MAP('TOS')                                                      21349344
        MAPSET('RCBHELP')                                               21349444
        FREEKB                                                          21349544
        ERASE;                                                          21349644
   END;                                                                 21349744
                                                                        21349844
   IF RCBM25I.SEQUENCE_NUMBERF(N) = CSR_HELP                            21349944
    | RCBM25I.SEQUENCE_NUMBERF(N) = CSR_EOF THEN                        21350044
   DO;                                                                  21350144
     N = 16;                                                            21350244
     CSR_POS   = 9;                                                     21350344
     HELP_FLAG = TRUE;                                                  21350444
     EXEC CICS SEND                                                     21350544
        MAP('TOS')                                                      21350644
        MAPSET('RCBHELP')                                               21350744
        FREEKB                                                          21350844
        ERASE;                                                          21350944
   END;                                                                 21351044
                                                                        21351144
   IF RCBM25I.SERVICE_LVL_CODEF(N) = CSR_HELP                           21351244
    | RCBM25I.SERVICE_LVL_CODEF(N) = CSR_EOF THEN                       21351344
   DO;                                                                  21351444
     N = 16;                                                            21351544
     CSR_POS   = 10;                                                    21351644
     HELP_FLAG = TRUE;                                                  21351744
     EXEC CICS SEND                                                     21351844
        MAP('SLC')                                                      21351944
        MAPSET('RCBHELP')                                               21352044
        FREEKB                                                          21352144
        ERASE;                                                          21352244
   END;                                                                 21353044
 END;                                                                   21358944
                                                                        21359044
 IF RCBM25I.CONT_SELF = CSR_HELP                                        21359144
  | RCBM25I.CONT_SELF = CSR_EOF THEN                                    21359244
 DO;                                                                    21359344
   CSR_POS   = 1;                                                       21359444
   HELP_FLAG = TRUE;                                                    21359544
   EXEC CICS SEND                                                       21359644
      MAP('CONTNO')                                                     21359744
      MAPSET('RCBHELP')                                                 21359844
      FREEKB                                                            21359944
      ERASE;                                                            21360044
 END;                                                                   21360144
                                                                        21360244
 IF RCBM25I.TYPE_SELF = CSR_HELP                                        21360344
  | RCBM25I.TYPE_SELF = CSR_EOF THEN                                    21360444
 DO;                                                                    21360544
   CSR_POS   = 2;                                                       21360644
   HELP_FLAG = TRUE;                                                    21360744
   EXEC CICS SEND                                                       21360844
      MAP('PRODTYP')                                                    21360955
      MAPSET('RCBHELP')                                                 21361044
      FREEKB                                                            21361144
      ERASE;                                                            21361244
 END;                                                                   21361344
                                                                        21361444
 IF RCBM25I.MODEL_SELF = CSR_HELP                                       21361544
  | RCBM25I.MODEL_SELF = CSR_EOF THEN                                   21361644
 DO;                                                                    21361744
   CSR_POS   = 3;                                                       21361844
   HELP_FLAG = TRUE;                                                    21361944
   EXEC CICS SEND                                                       21362044
      MAP('MODELT')                                                     21362155
      MAPSET('RCBHELP')                                                 21362244
      FREEKB                                                            21362344
      ERASE;                                                            21362444
 END;                                                                   21362544
                                                                        21362644
 IF HELP_FLAG = FALSE THEN                                              21362744
 DO;                                                                    21362844
   EXEC CICS SEND                                                       21362944
      MAP('RCBH25')                                                     21363044
      MAPSET('RCBM25')                                                  21363144
      FREEKB                                                            21363244
      ERASE;                                                            21363344
 END;                                                                   21363444
                                                                        21363544
                                                                        21363644
0EXEC CICS RETURN                                                       21363744
    TRANSID('RC25')                                                     21363844
    COMMAREA(COMMAREA)                                                  21363944
    LENGTH(CSTG(COMMAREA))                                              21364044
    RESP(RESPONSE)                                                      21364144
    RESP2(CODE_EXPLAIN);                                                21364244
                                                                        21364344
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 21364444
    WHEN(DFHRESP(NORMAL));                                              21364544
    WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */ 21364644
                                                                        21364744
    DO;                                                                 21364844
      COMMAREA_LENGTH = EIBCALEN;                                       21364944
      EXEC CICS RETURN                                                  21365044
         TRANSID('RC25')                                                21365144
         COMMAREA(COMMAREA)                                             21365244
         LENGTH(COMMAREA_LENGTH);                                       21365344
    END;                                                                21365444
                                                                        21365544
    OTHERWISE                                                           21365644
    DO;                                                                 21365744
      RCBM25O.MSG_LINEO = ERR_MESSAGE14;                                21365844
      CALL RCBC25M_SEND_MAP_CSR;                                        21365944
    END;                                                                21366044
 END;                                                                   21366144
                                                                        21366244
0END RCBC25M_HELP_MAP;                                                  21366344
1/********************************************************************/ 21366435
 /*      SEND MAP RCBM22                                             */ 21366535
 /********************************************************************/ 21367035
0RCBC25M_SEND_MAP22: PROC;                                              21370035
                                                                        21380035
0EXEC CICS SEND                                                         21390035
    MAP('RCBM22')                                                       21400035
    MAPSET('RCBM22')                                                    21410035
    FREEKB                                                              21420035
    ERASE                                                               21430035
    RESP(RESPONSE)                                                      21440035
    RESP2(CODE_EXPLAIN);                                                21450035
                                                                        21460035
0SELECT(RESPONSE);                                                      21470035
    WHEN(DFHRESP(NORMAL))                                               21480035
    DO;                                                                 21490035
      EXEC CICS RETURN                                                  21500035
         TRANSID('RC25')                                                21510035
         COMMAREA(COMMAREA)                                             21520035
         LENGTH(CSTG(COMMAREA));                                        21530035
    END;                                                                21540035
    OTHERWISE                                                           21550035
    DO;                                                                 21560035
      RCBM25O.MSG_LINEO = ERR_MESSAGE2 || 'RCBM25';                     21570035
      CALL RCBC25M_SEND_MAP_CSR;                                        21580037
    END;                                                                21590035
 END;                                                                   21600035
0END RCBC25M_SEND_MAP22;                                                21610035
1/********************************************************************/ 21620035
 /*      SEND MAP RCBM25                                             */ 21630035
 /********************************************************************/ 21640035
0RCBC25M_SEND_MAP: PROC;                                                21650035
                                                                        21660035
 /*IF ADMIN_FLAG  = TRUE                             *//* SOC RB01338 */21670063
 /* | UPD_OK_FLAG = TRUE THEN                                         */21680059
 IF UPD_OK_FLAG = TRUE THEN                                             21680258
                                                       /* EOC RB01338 */21681063
 DO;                                                                    21690035
   RCBM25O.PFLINEO = PFLINE1A;                                          21700035
   RCBM25O.SALINEO = SALINE;                                            21710035
 END;                                                                   21720035
 ELSE DO                                                                21730035
   RCBM25O.PFLINEO = PFLINE1;                                           21740035
 END;                                                                   21750035
                                                                        21760035
0EXEC CICS SEND                                                         21770035
    MAP('RCBM25')                                                       21780035
    MAPSET('RCBM25')                                                    21790035
    FREEKB                                                              21800035
    ERASE                                                               21810035
    RESP(RESPONSE)                                                      21820035
    RESP2(CODE_EXPLAIN);                                                21830035
                                                                        21840035
0SELECT(RESPONSE);                                                      21850035
    WHEN(DFHRESP(NORMAL))                                               21860035
    DO;                                                                 21870035
      EXEC CICS RETURN                                                  21880035
         TRANSID('RC25')                                                21890035
         COMMAREA(COMMAREA)                                             21900035
         LENGTH(CSTG(COMMAREA));                                        21910035
    END;                                                                21920035
    OTHERWISE                                                           21930035
    DO;                                                                 21940035
      RCBM25O.MSG_LINEO = ERR_MESSAGE2 || 'RCBM25';                     21950035
      CALL RCBC25M_SEND_MAP_CSR;                                        21960037
    END;                                                                21970035
 END;                                                                   21980035
0END RCBC25M_SEND_MAP;                                                  21990035
1/********************************************************************/ 22400001
 /*      SEND ERROR MAP                                              */ 22410001
 /********************************************************************/ 22420001
 RCBC25M_SEND_MAP_CSR : PROC;                                           22430037
                                                                        22440001
 /*IF ADMIN_FLAG  = TRUE                             *//* SOC RB01338 */22450063
 /* | UPD_OK_FLAG = TRUE THEN                                         */22460059
 IF UPD_OK_FLAG = TRUE THEN                                             22461058
                                                       /* EOC RB01338 */22462063
 DO;                                                                    22470058
   RCBM25O.PFLINEO = PFLINE1A;                                          22480025
   RCBM25O.SALINEO = SALINE;                                            22490025
 END;                                                                   22500025
 ELSE DO                                                                22510025
   RCBM25O.PFLINEO = PFLINE1;                                           22520025
 END;                                                                   22530025
                                                                        22540025
 EXEC CICS SEND                                                         22550001
    MAP('RCBM25')                                                       22560001
    MAPSET('RCBM25')                                                    22570001
    CURSOR                                                              22580001
    ERASE                                                               22590037
    FREEKB;                                                             22600001
                                                                        22610001
 EXEC CICS RETURN                                                       22620001
    TRANSID('RC25')                                                     22630001
    COMMAREA(COMMAREA)                                                  22640001
    LENGTH(CSTG(COMMAREA));                                             22650001
                                                                        22660001
 END RCBC25M_SEND_MAP_CSR;                                              22670037
1/*******************************************************************/  22680001
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  22690001
 /*******************************************************************/  22700001
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  22710001
  $DAIMOD (RCBC25M);                     /* MODULE TO BE COMPILED   */  22720001
0/*******************************************************************/  22730001
 /* END OF ABR BLOCK '                                              */  22740001
 /*******************************************************************/  22750001
0 END RCBC25M;                                                          22760001