 /* RCBCQ6M - RCMS REQUEST "TE" TEXT                                 */ 00010000
 /*                                                                  */ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /*                                                                  */ 00060000
 /********************************************************************/ 00070000
 /* PROGRAM          : RCBCQ6M                                       */ 00080000
 /*                                                                  */ 00090000
 /* LANGUAGE         : PLICSQL                                       */ 00100000
 /*                                                                  */ 00110000
 /* TYPE             : LINKABLE MODULE                               */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION      : RCMS REQUEST "TE" TEXT.                       */ 00140000
 /*                    THIS PROGRAM IS CALLED BY THE ROOT MODULE     */ 00150000
 /*                    RCBCQ0M.                                      */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : COMMPTR - COMMUNICATION AREA POINTER          */ 00180000
 /*                                                                  */ 00190000
 /* OUTPUT           : -                                             */ 00200000
 /*                                                                  */ 00210000
 /* EXTERNAL MODULES : RCBCQBM - CEDS LAM FOR "TE" REQUEST           */ 00220000
 /*                    QCH0TXM - CHIS LAM                            */ 00230000
 /*                    RCBCQEM - ERROR LOGGING MODULE                */ 00240000
 /*                                                                  */ 00250000
 /* MESSAGES         : 154, 155, 156, 158, 159, 161                  */ 00260000
 /*                                                                  */ 00270000
 /* DEPENDENCIES     : NONE                                          */ 00280000
 /*                                                                  */ 00290000
 /* MAINTENANCE LOG  :                                               */ 00300000
 /* ---------------                                                  */ 00310000
 /*                                                                  */ 00320000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00330000
 /* --------------------------------------------------------------   */ 00340000
 /*  1994-09-27 | WI4316       | CEDS 2.3                            */ 00350000
 /*  1996-04-22 | PTM0902      | UPGRADE TO CICS 4.1 - MOVE FROM     */ 00360000
 /*             |              | PLISQL TO PLICSQL LIBRARY.          */ 00370000
 /*  1997-05-12 | PTM1036      | USE STANDARD PROLOGS                */ 00380000
 /*  2014-07-11 | RB01341      | CEDS 3.3 A22 RELEASE - ISRAEL       */ 00381002
 /*             |              | COUNTRY CONVERSION                  */ 00382002
 /*             |              |                                     */ 00390000
 /********************************************************************/ 00400000
1RCBCQ6M: PROC(COMMPTR)                                                 00410000
          REORDER;                                                      00420000
0/********************************************************************/ 00430000
 /*  EXTERNAL ENTRIES                                                */ 00440000
 /********************************************************************/ 00450000
 DCL RCBCQBM   ENTRY EXTERNAL;     /* CEDS TEXT LAM                  */ 00460000
 DCL QCH0TXM   ENTRY EXTERNAL;     /* CHIS TEXT LAM                  */ 00470000
 DCL RCBCQEM   ENTRY EXTERNAL;     /* ERROR LOGGING ROUTINE          */ 00480000
0/********************************************************************/ 00490000
 /*  COMMUNICATION AREA                                              */ 00500000
 /********************************************************************/ 00510000
 DCL    COMMPTR   PTR;             /*ADDRESS OF COMMUNICATION AREA   */ 00520000
 /********************************************************************/ 00530000
0/********************************************************************/ 00540000
0DCL 1 COMMAREA           BASED (COMMPTR)                               00550000
 %INCLUDE EDQYIHS;                                                      00560000
 %INCLUDE EDQYITS;;                                                     00570000
0/********************************************************************/ 00580000
 /*  GENERAL DECLARATION                                             */ 00590000
 /********************************************************************/ 00600000
0DCL WRK_CURRENT_ROW      FIXED BIN(15);                                00610000
0DCL WRK_ITEM_NO          FIXED BIN(15);                                00620000
0DCL CATXT_ITEM_NO        FIXED BIN(15);                                00630000
0DCL MAX_TEXT_TABLE       FIXED BIN(15) INIT (6);                       00640000
0DCL 1 DESCR_TABLE,                                                     00650000
       2 TEXTLNE_1        CHAR(200),                                    00660000
       2 TEXTLNE_2        CHAR(200),                                    00670000
       2 FILLER           CHAR(44);                                     00680000
0DCL 1 TEXT_TABLE DEFINED DESCR_TABLE,                                  00690000
       2 TEXTLNE_STRUC(MAX_TEXT_TABLE),                                 00700000
         3 TEXTLINE       CHAR(74);                                     00710000
0DCL DASH_DAGRCAS         CHAR(10) INIT('');                            00720000
0DCL WRK_SQLCODE          FIXED BIN(31);                                00730000
0DCL WRK_TABLE            CHAR(18);                                     00740000
0/********************************************************************/ 00750000
 /*  RCBCQBM DECLARATIONS (CEDS LAM)                                 */ 00760000
 /********************************************************************/ 00770000
0DCL 1 RCBCQBS_PTR      PTR;     /* PTR TO INTERFACE STRUCTURE  */      00780000
0DCL 1 RCBCQBS,                                                         00790000
      %INCLUDE RCBCQBS;;                                                00800000
0DCL 1 RCBCQBS_SQLCA                                                    00810000
      LIKE SQLCA;                                                       00820000
0/********************************************************************/ 00830000
 /*  QCH0TXSI INPUT PARAMETER STRUCTURE                              */ 00840000
 /********************************************************************/ 00850000
0DCL QCH0TXSI_PTR    PTR;              /* PTR TO INTERFACE STRUCTURE */ 00860000
0DCL 1 QCH0TXSI_PARM,                                                   00870000
      %INCLUDE QCH0TXSI;;                                               00880000
0/********************************************************************/ 00890000
 /*  QCH0TXSO OUTPUT PARAMETER STRUCTURE                             */ 00900000
 /********************************************************************/ 00910000
0DCL QCH0TXSO_PTR    PTR;              /* PTR TO INTERFACE STRUCTURE */ 00920000
0DCL 1 QCH0TXSO_PARM,                                                   00930000
      %INCLUDE QCH0TXSO;;                                               00940000
0DCL QCH0TXS_SQLCA_PTR  PTR;                                            00950000
0DCL 1 QCH0TXS_SQLCA                                                    00960000
      LIKE SQLCA;                                                       00970000
0/********************************************************************/ 00980000
 /*  ERROR LOGGING PARAMETER STRUCTURE                               */ 00990000
 /********************************************************************/ 01000000
0DCL RCBCQES_PTR     PTR;              /* PTR TO INTERFACE STRUCTURE */ 01010000
 DCL 1 RCBCQES,                                                         01020000
      %INCLUDE RCBCQES;;                                                01030000
 DCL 1 RCBCQES_SQLCA                                                    01040000
      LIKE SQLCA;                                                       01050000
0/********************************************************************/ 01060000
 /*            S Q L    D E C L A R A T I O N S                      */ 01070000
 /********************************************************************/ 01080000
0EXEC SQL INCLUDE SQLCA;                                                01090000
0/********************************************************************/ 01100000
 /*                 BUILD IN FUNCTIONS                               */ 01110000
 /********************************************************************/ 01120000
0DCL (ADDR,                                                             01130000
      SUBSTR)                                                           01140000
              BUILTIN;                                                  01150000
1/********************************************************************/ 01160000
 /*                 S T A R T   P R O C E S S I N G                  */ 01170000
 /********************************************************************/ 01180000
 CALL RCBCQ6M_INITIALISATION;                                           01190000
 CALL RCBCQ6M_MAIN_PROCESSING;                                          01200000
1/********************************************************************/ 01210000
 /*      INITIALISATION                                              */ 01220000
 /********************************************************************/ 01230000
0RCBCQ6M_INITIALISATION : PROC;                                         01240000
0RCBCQBS_PTR = ADDR(RCBCQBS);                                           01250000
 RCBCQBS.SQLCA_PTR = ADDR(RCBCQBS_SQLCA);                               01260000
 QCH0TXS_SQLCA_PTR = ADDR(QCH0TXS_SQLCA);                               01270000
 QCH0TXSI_PTR      = ADDR(QCH0TXSI_PARM);                               01280000
 QCH0TXSO_PTR      = ADDR(QCH0TXSO_PARM);                               01290000
 RCBCQES_PTR       = ADDR(RCBCQES);                                     01300000
 RCBCQES.SQLCA_PTR = ADDR(RCBCQES_SQLCA);                               01310000
0WRK_CURRENT_ROW = 0;                                                   01320000
 WRK_ITEM_NO = 0;                                                       01330000
 EDQYIHS.PAGING_PARMS.QLNETOT = 0;                                      01340000
0EDQYITS = '';                                                          01350000
 DASH_DAGRCAS = SUBSTR(EDQYIHS.REQUEST.DAGRCAS,1,4) || '-' ||           01360000
                SUBSTR(EDQYIHS.REQUEST.DAGRCAS,5,2) || '-' ||           01370000
                SUBSTR(EDQYIHS.REQUEST.DAGRCAS,7,2);                    01380000
 WRK_SQLCODE = 0;                                                       01390000
 WRK_TABLE   = '';                                                      01400000
                                                                        01410000
0END RCBCQ6M_INITIALISATION;                                            01420000
1/********************************************************************/ 01430000
 /*      M A I N   P R O C E S S I N G                               */ 01440000
 /********************************************************************/ 01450000
0RCBCQ6M_MAIN_PROCESSING : PROC;                                        01460000
 IF EDQYIHS.REQUEST.CATTSRC = 'O' THEN                                  01470000
   DO;                                                                  01480000
    IF EDQYIHS.REQUEST.IOPUCTY = '' |  /* CHECK MANDATORY FIELD      */ 01490000
       EDQYIHS.REQUEST.IAGRNBR = '' |  /* FILLED AND NOT ESA SERVICE */ 01500000
       EDQYIHS.REQUEST.LDBSOSN = 0 |   /* SOURCE CODE REQUEST        */ 01510000
       EDQYIHS.REQUEST.DAGRCAS = '' |                                   01520000
       EDQYIHS.REQUEST.LCMGTXT = 0 |                                    01530000
       EDQYIHS.REQUEST.QLNEFST = 0 |                                    01540000
       EDQYIHS.REQUEST.QLNERET = 0                                      01550000
    THEN                                                                01560000
      DO;                                                               01570000
        EDQYIHS.CRMORET = '4';          /* INVALID REQUEST            */01580000
        RCBCQES.MESSAGE_NUMBER = 'C154';                                01590000
        CALL RCBCQ6M_LOG_ERR (WRK_SQLCODE, WRK_TABLE);                  01600000
      END;                                                              01610000
    ELSE                                                                01620000
      DO;                                                               01630000
                                       /* REQUEST FOR CHIS DATA      */ 01640000
       CALL RCBCQ6M_CHIS_LAM;                                           01650000
      END;                                                              01660000
   END;                                                                 01670000
 ELSE                                                                   01680000
    IF EDQYIHS.REQUEST.IOPUCTY = '' |  /* CHECK MANDATORY FIELDS     */ 01690000
       EDQYIHS.REQUEST.IOFFNIK = ''    /* FILLED                     */ 01700000
    THEN                                                                01710000
      DO;                                                               01720000
          EDQYIHS.ACK.CRMORET = '4';   /* INVALID REQUEST            */ 01730000
          RCBCQES.MESSAGE_NUMBER = 'C155';                              01740000
          CALL RCBCQ6M_LOG_ERR (WRK_SQLCODE, WRK_TABLE);                01750000
      END;                                                              01760000
    ELSE                                                                01770000
      DO;                                                               01780000
       CALL RCBCQ6M_CEDS_LAM;          /* REQUEST FOR CEDS           */ 01790000
      END;                                                              01800000
0END RCBCQ6M_MAIN_PROCESSING;                                           01810000
1/********************************************************************/ 01820000
 /*      C H I S   L A M   P R O C E S S I N G                       */ 01830000
 /*                                                                  */ 01840000
 /*   INITIALISE RETURNED DATA STRUCTURE                             */ 01850000
 /*   SET UP SEARCH PARAMETERS                                       */ 01860000
 /*   CALL CHIS LAM TO FETCH ALL ROWS THAT MEET SEARCH CRITERIA      */ 01870000
 /*   ASSIGN DATA TO COMMAREA IF WITHIN PAGING REQUIREMENTS          */ 01880000
 /*                                                                  */ 01890000
 /********************************************************************/ 01900000
0RCBCQ6M_CHIS_LAM : PROC;                                               01910000
 QCH0TXSO_PARM = '';                                                    01920000
                                                      /* SOC RB01341 */ 01921002
 IF EDQYIHS.IOPUCTY = '755' THEN                                        01922002
 QCH0TXSI_PARM.IOPUCTY = '756';                                         01930001
 ELSE                                                                   01930102
                                                      /* EOC RB01341 */ 01930202
 QCH0TXSI_PARM.IOPUCTY = EDQYIHS.IOPUCTY;                               01931001
 QCH0TXSI_PARM.IAGRCID = SUBSTR(EDQYIHS.IAGRNBR,1,6);                   01940000
 QCH0TXSI_PARM.LDBSOSN = EDQYIHS.LDBSOSN;                               01950000
 QCH0TXSI_PARM.DAGRCAS = DASH_DAGRCAS;                                  01960000
 QCH0TXSI_PARM.LCMGTXT = EDQYIHS.LCMGTXT;                               01970000
 QCH0TXSI_PARM.QLNEFST = EDQYIHS.QLNEFST;                               01980000
 QCH0TXSI_PARM.QLNERET = EDQYIHS.QLNERET;                               01990000
 CALL QCH0TXM (QCH0TXSI_PTR, QCH0TXSO_PTR, QCH0TXS_SQLCA_PTR);          02000000
 SELECT (QCH0TXS_SQLCA.SQLCODE);                                        02010000
  WHEN (0)                                                              02020000
    DO;                                                                 02030000
      IF QCH0TXSO_PARM.QLNERET = 0 THEN                                 02040000
         EDQYIHS.CRMORET = '9';       /* NO ITEM(S) FOUND           */  02050000
      ELSE                                                              02060000
      DO;                                                               02070000
         EDQYIHS.PAGING_PARMS.QLNETOT = 0;                              02080000
         WRK_ITEM_NO = 1;                                               02090000
         CALL RCBCQ6M_ASS_CHIS;                                         02100000
         EDQYIHS.CRMORET = '0';       /* PROCESSING OK              */  02110000
      END;                                                              02120000
    END;                                                                02130000
  WHEN (+100,+9997)                                                     02140000
      EDQYIHS.CRMORET = '9';          /* NO ITEM(S) FOUND           */  02150000
  WHEN (+9998,+9999)                                                    02160000
    DO;                                                                 02170000
      EDQYIHS.CRMORET = '4';          /* INVALID REQUEST            */  02180000
      RCBCQES.MESSAGE_NUMBER = 'C156';                                  02190000
      RCBCQES_SQLCA = QCH0TXS_SQLCA;                                    02200000
      CALL RCBCQ6M_LOG_ERR (WRK_SQLCODE, WRK_TABLE);                    02210000
    END;                                                                02220000
  OTHERWISE                                                             02230000
    DO;                                                                 02240000
      RCBCQES.MESSAGE_NUMBER = 'C158';                                  02250000
      RCBCQES_SQLCA = QCH0TXS_SQLCA;                                    02260000
      WRK_SQLCODE  = QCH0TXS_SQLCA.SQLCODE;                             02270000
      WRK_TABLE = 'CHIS DB2 TABLE';                                     02280000
      CALL RCBCQ6M_LOG_ERR (WRK_SQLCODE, WRK_TABLE);                    02290000
    END;                                                                02300000
  END;                                                                  02310000
0END RCBCQ6M_CHIS_LAM;                                                  02320000
1/********************************************************************/ 02330000
 /*      C E D S   L A M   P R O C E S S I N G                       */ 02340000
 /*                                                                  */ 02350000
 /*   INITIALISE RETURNED DATA STRUCTURE                             */ 02360000
 /*   SET UP SEARCH PARAMETERS                                       */ 02370000
 /*   CALL CEDS LAM TO FETCH ALL ROWS THAT MEET SEARCH CRITERIA      */ 02380000
 /*   ASSIGN DATA TO COMMAREA IF WITHIN PAGING REQUIREMENTS          */ 02390000
 /*                                                                  */ 02400000
 /********************************************************************/ 02410000
0RCBCQ6M_CEDS_LAM : PROC;                                               02420000
 RCBCQBS.DATA           = '';                                           02430000
 RCBCQBS.SEARCH.IOPUCTY = EDQYIHS.IOPUCTY;                              02440000
 RCBCQBS.SEARCH.IOFFNIK = EDQYIHS.IOFFNIK;                              02450000
0CALL RCBCQBM (RCBCQBS_PTR);                                            02460000
 SELECT (RCBCQBS_SQLCA.SQLCODE);                                        02470000
    WHEN (0)                                                            02480000
    DO;                                                                 02490000
       EDQYIHS.PAGING_PARMS.QLNETOT = 0;                                02500000
       CATXT_ITEM_NO = 1;                                               02510000
       WRK_ITEM_NO = 1;                                                 02520000
       CALL RCBCQ6M_ASSIGN_CEDS_DATA;                                   02530000
       EDQYIHS.CRMORET = '0';          /* PROCESSING OK              */ 02540000
    END;                                                                02550000
    WHEN (+100)                                                         02560000
       EDQYIHS.CRMORET = '9';          /* NO ITEM(S) FOUND           */ 02570000
    WHEN (+9999)                                                        02580000
      DO;                                                               02590000
       EDQYIHS.CRMORET = '4';          /* INVALID REQUEST            */ 02600000
       RCBCQES.MESSAGE_NUMBER = 'C159';                                 02610000
       RCBCQES_SQLCA = QCH0TXS_SQLCA;                                   02620000
       CALL RCBCQ6M_LOG_ERR (WRK_SQLCODE, WRK_TABLE);                   02630000
      END;                                                              02640000
    OTHERWISE                                                           02650000
    DO;                                                                 02660000
       RCBCQES.MESSAGE_NUMBER = 'C161';                                 02670000
       RCBCQES_SQLCA = RCBCQBS_SQLCA;                                   02680000
       WRK_SQLCODE  = RCBCQBS_SQLCA.SQLCODE;                            02690000
       WRK_TABLE = 'RCBT0075_SE_PO';                                    02700000
       CALL RCBCQ6M_LOG_ERR (WRK_SQLCODE, WRK_TABLE);                   02710000
    END;                                                                02720000
 END;                                                                   02730000
0END RCBCQ6M_CEDS_LAM;                                                  02740000
1/********************************************************************/ 02750000
 /*      ASSIGN DATA FROM CEDS LAM TO TEXT LIST                      */ 02760000
 /********************************************************************/ 02770000
0RCBCQ6M_ASSIGN_CEDS_DATA : PROC;                                       02780000
0DESCR_TABLE.TEXTLNE_1 = RCBCQBS.DATA.SERVICE_DESCR_1;                  02790000
 DESCR_TABLE.TEXTLNE_2 = RCBCQBS.DATA.SERVICE_DESCR_2;                  02800000
 DO WHILE (MAX_TEXT_TABLE > WRK_ITEM_NO);                               02810000
    IF TEXT_TABLE.TEXTLINE(WRK_ITEM_NO) ¬= '' THEN                      02820000
    DO;                                                                 02830000
       EDQYITS.TEXTLNE(CATXT_ITEM_NO)                                   02840000
                    = TEXT_TABLE.TEXTLINE(WRK_ITEM_NO);                 02850000
       EDQYIHS.PAGING_PARMS.QLNETOT = EDQYIHS.PAGING_PARMS.QLNETOT + 1; 02860000
       CATXT_ITEM_NO = CATXT_ITEM_NO + 1;                               02870000
    END;                                                                02880000
    WRK_ITEM_NO = WRK_ITEM_NO + 1;                                      02890000
 END;                                                                   02900000
0END RCBCQ6M_ASSIGN_CEDS_DATA;                                          02910000
1/********************************************************************/ 02920000
 /*      ASSIGN DATA FROM CHIS LAM TO TEXT LIST                      */ 02930000
 /********************************************************************/ 02940000
0RCBCQ6M_ASS_CHIS : PROC;                                               02950000
   EDQYIHS.PAGING_PARMS.QLNEFST = QCH0TXSO_PARM.QLNEFST;                02960000
   EDQYIHS.PAGING_PARMS.QLNETOT = QCH0TXSO_PARM.QLNETOT;                02970000
   /* EDQYIHS.PAGING_PARMS.QLNERET = QCH0TXSO_PARM.QLNERET */           02980000
   DO WRK_ITEM_NO = 1 TO 52;                                            02990000
      EDQYITS.TEXTLNE(WRK_ITEM_NO) =                                    03000000
                         QCH0TXSO_PARM.TEXTLNE(WRK_ITEM_NO);            03010000
   END;                                                                 03020000
0END RCBCQ6M_ASS_CHIS;                                                  03030000
1/********************************************************************/ 03040000
 /*      ERROR LOGGING                                               */ 03050000
 /********************************************************************/ 03060000
0RCBCQ6M_LOG_ERR : PROC(ERR_SQLCODE,ERR_TABLE);                         03070000
0DCL ERR_TABLE   CHAR(18);                                              03080000
0DCL ERR_SQLCODE FIXED BIN(31);                                         03090000
0IF ERR_SQLCODE = -923 THEN                                             03100000
    EDQYIHS.CRMORET = '8';                                              03110000
 ELSE                                                                   03120000
    IF ERR_SQLCODE ¬= 0 THEN                                            03130000
       EDQYIHS.CRMORET = '7';                                           03140000
0EDQYIHS.ACK.NTBLNME = ERR_TABLE;                                       03150000
0EDQYIHS.ACK.CRMOSUB = ERR_SQLCODE;                                     03160000
0RCBCQES.MESSAGE_TYPE  = 'IS';                                          03170000
 RCBCQES.LANGUAGE_CODE = 'EN';                                          03180000
 RCBCQES.PROGRAM_ID    = 'RCBCQ6M';                                     03190000
 CALL RCBCQEM(RCBCQES_PTR);                                             03200000
0END RCBCQ6M_LOG_ERR;                                                   03210000
1/*******************************************************************/  03220000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  03230000
 /*******************************************************************/  03240000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  03250000
  $DAIMOD (RCBCQ6M);                     /* MODULE TO BE COMPILED   */  03260000
0/*******************************************************************/  03270000
 /* END OF ABR BLOCK                                                */  03280000
 /*******************************************************************/  03290000
0END RCBCQ6M;                                                           03300000