 /* RCBCS4M - PI DETAIL MODULE  / CEDS QUERY BY SERIAL TRANSACTION   */ 00019671
 /*                                                                  */ 00020049
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030049
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040049
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050049
 /*                                                                  */ 00060049
 /********************************************************************/ 00070049
 /* PROGRAM          : RCBCS4M                                       */ 00080049
 /*                                                                  */ 00090049
 /* LANGUAGE         : PLICSQL                                       */ 00100049
 /*                                                                  */ 00110049
 /* TYPE             : LINKABLE MODULE                               */ 00120049
 /*                                                                  */ 00130049
 /* DESCRIPTION      : RCMS REQUEST "DE" LIST ITEMS.                 */ 00140049
 /*                  : THIS PROGRAM IS CALLED BY THE ROOT MODULE     */ 00150049
 /*                    RCBCS1M.                                      */ 00160049
 /*                                                                  */ 00170049
 /* ALL WARNINGS AND ERRORS WILL BE STORED IN AN EXTRA PARTITION     */ 00180049
 /* TRANSIENT DATASET.                                               */ 00190049
 /*                                                                  */ 00200049
 /* INPUT            : COMMPTR - COMMUNICATION AREA POINTER          */ 00210049
 /*                                                                  */ 00220049
 /* OUTPUT           :                                               */ 00230049
 /*                                                                  */ 00240049
 /*                                                                  */ 00250049
 /* EXTERNAL MODULES : RCBISRM - RETRIEVE RCBT0470_SERV_COND         */ 00260049
 /*                                       RCBT0475_CTRY_COND         */ 00270049
 /*                  : RCBCQEM - ERROR LOGGING MODULE                */ 00280049
 /*                                                                  */ 00290049
 /* MESSAGES         :                                               */ 00300049
 /*                                                                  */ 00310049
 /* DEPENDENCIES     : NONE                                          */ 00320049
 /*                                                                  */ 00330049
 /* MAINTENANCE LOG  :                                               */ 00340049
 /* ---------------                                                  */ 00350049
 /*                                                                  */ 00360049
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00370049
 /* --------------------------------------------------------------   */ 00380049
 /*  2002-07-24 | RA01233      | TACTICAL SERVICE REFERENCE          */ 00390049
 /*  2004-04-28 | RA01256      | ALIGN SLC ENTITY NAMES              */ 00400049
 /*  2006-08-09 | RB01272      | LENOVO ENHANCEMENTS FOR CEDS 3.3    */ 00410049
 /*  2006-11-02 | RB01278      | CEDS 3.3 (LENOVO)VENDOR COST        */ 00420049
 /*             |              | ASSIGNMENT                          */ 00430049
 /*  2007-01-29 | CEDS00000320 | WSU/WSUC CHANGES                    */ 00440049
 /*  2007-04-23 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY       */ 00450049
 /*             |              | MACHINES                            */ 00460049
 /*  2007-10-29 | RB01282      | SERVICE LEVEL EXTENSION             */ 00470049
 /*  2007-11-08 | RB01283      | LENOVO FLAG                         */ 00480049
 /*  2007-12-28 | CEDS00000365 | SERVICE EXT IS SPACE FOR PI CONTRACT*/ 00490049
 /*  2008-05-30 | CEDS00000403 | HANDLE THE NULL INDICATORS FOR THE  */ 00500049
 /*             |              | FETCH'S FROM T650 AND T011 AND      */ 00510049
 /*             |              | INITIALISE VARIABLE 'CRMOSUB' TO 0, */ 00520049
 /*             |              | TO AVOID THE JUNK VALUE IN THE MAP  */ 00530049
 /*  2008-01-22 | RB01288      | CHANGES FOR NON SERIALIZED MACHINE  */ 00540049
 /*  2008-03-02 | RB01289      | PRIME INPUT CUSTOMER NUMBER         */ 00550049
 /*  2008-05-20 | RB01290      | ACCEPT CONTRACTS ON INTERNAL        */ 00560049
 /*             |              | MACHINES                            */ 00570049
 /*  2008-08-06 | CEDS00000435 | PASSING TOW VALUE FROM T051 TO QBS  */ 00580049
 /*             |              | SCREEN                              */ 00590049
 /*  2008-08-11 | CEDS00000438 | PASSING FLEXIBLE WARRANTY FROM T051 */ 00600049
 /*             |              | TO QBS SCREEN FOR PI MACHINE        */ 00610049
 /*  2008-11-10 | RB01298      | HANDLING HARDBUNDLE MACHINES        */ 00620049
 /*  2009-02-21 | RB01299      | CEDS ALIGNMENT TO CHIS 810          */ 00630049
 /*  2009-05-28 | CEDS00000468 | ADDED TYPE_OF_RELATION=U CHECK WHILE*/ 00631051
 /*             |              | RETRIEVING CUSTOMER NUMBER FROM T190*/ 00632051
 /*             |              |                                     */ 00640049
 /********************************************************************/ 00650049
1RCBCS4M: PROC(COMMPTR)                                                 00660049
          OPTIONS (MAIN)                                                00670049
          REORDER;                                                      00680049
0/********************************************************************/ 00690049
 /*  EXTERNAL ENTRIES                                                */ 00700049
 /********************************************************************/ 00710049
 DCL RCBISRN   ENTRY EXTERNAL;     /* RETRIEVE T470/475              */ 00720049
 DCL RCBCQEM   ENTRY EXTERNAL;     /* ERROR LOGGING ROUTINE          */ 00730049
 DCL RCBDR4U   ENTRY EXTERNAL;     /* USER EXIT                      */ 00740049
 DCL RCB004N   ENTRY EXTERNAL;     /* DATE CALC ROUTINE      RB01298 */ 00750049
0/********************************************************************/ 00760049
 /*  COMMUNICATION AREA                                              */ 00770049
 /********************************************************************/ 00780049
 DCL    COMMPTR   PTR;             /*ADDRESS OF COMMUNICATION AREA   */ 00790049
 /********************************************************************/ 00800049
0/********************************************************************/ 00810049
0DCL 1 COMMAREA           BASED (COMMPTR),                              00820049
 %INCLUDE EDQBSHS;,                                                     00830049
 %INCLUDE EDQBSDS;;                                                     00840049
0/********************************************************************/ 00850049
 /*  RETURN CODES                                                    */ 00860049
 /********************************************************************/ 00870049
0DCL RESPONSE             FIXED BIN(31) INIT ('0'B);/* CICS RESPONSE */ 00880049
0/********************************************************************/ 00890049
 /*  RCBISRN PARAMETER DECLARATIONS                                  */ 00900049
 /********************************************************************/ 00910049
 DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 00920049
       %INCLUDE (RCBZ02S);;                                             00930049
 DCL 1 SQLCA_R            BASED(ADDR(RETURN_AREA_BB.RETURN_SQL))        00940049
                          LIKE SQLCA;                                   00950049
0/********************************************************************/ 00960049
 /*  RCBDR4U PARAMETER DECLARATIONS                                  */ 00970049
 /********************************************************************/ 00980049
 DCL SWITCH_USER_EXIT          BIT (1)      INIT ('0'B);                00990049
 DCL DATA_ORIGIN               CHAR(1)      INIT ('1');                 01000049
 DCL 1 USER_FILE_RCBDRF1,                                               01010049
       2 DATA,                                                          01020049
      %INCLUDE (RCBDRFS);;                                              01030049
                                                                        01040049
 DCL 1 USER_FILE_PI,                                                    01050049
       2 DATA,                                                          01060049
      %INCLUDE (RCBDRFS);;                                              01070049
                                                                        01080049
 DCL 1 USER_EXTRA_INFO,                                                 01090049
      %INCLUDE (RCBDRFSU);;                                             01100049
                                                                        01110049
 DCL PTR_INT_AREA        PTR;          /* PTR TO INTERFACE STRUCTURE */ 01120049
 DCL 1 PARM_INT_AREA,                                                   01130049
       %INCLUDE (RCBZ01S);;                                             01140049
 PTR_INT_AREA = ADDR(PARM_INT_AREA);                                    01150049
0/********************************************************************/ 01160049
 /*  RCBCQEM PARAMETER DECLARATIONS                                  */ 01170049
 /********************************************************************/ 01180049
0DCL RCBCQES_PTR     PTR;              /* PTR TO INTERFACE STRUCTURE */ 01190049
 DCL 1 RCBCQES,                                                         01200049
      %INCLUDE RCBCQES;;                                                01210049
 DCL 1 DATE_AREA,                                     /* SOC RB01298 */ 01220049
     %INCLUDE (RCBZ03S);;                             /* EOC RB01298 */ 01230049
 DCL 1 RCBCQES_SQLCA                                                    01240049
      LIKE SQLCA;                                                       01250049
0RCBCQES_PTR       = ADDR(RCBCQES);                                     01260049
0RCBCQES.SQLCA_PTR = ADDR(RCBCQES_SQLCA);                               01270049
0/********************************************************************/ 01280049
 /*            S Q L    D E C L A R A T I O N S                      */ 01290049
 /********************************************************************/ 01300049
0EXEC SQL INCLUDE SQLCA;                                                01310049
0/********************************************************************/ 01320049
 /* DB2 TABLE STRUCTURES                                             */ 01330049
 /********************************************************************/ 01340049
 DCL 1 TB_RCBV010,                                                      01350049
      %INCLUDE (RCB010S);;                                              01360049
 DCL 1 TB_RCBV010_I,                                                    01370049
      %INCLUDE (RCB010SI);;                                             01380049
 DCL 1 TB_RCBV011,                                                      01390049
      %INCLUDE (RCB011S);;                                              01400049
 DCL 1 TB_RCBV011_I,                                                    01410049
      %INCLUDE (RCB011SI);;                                             01420049
 DCL 1 TB_RCBV051,                                                      01430049
      %INCLUDE (RCB051S);;                                              01440049
 DCL 1 TB_RCBV051_I,                                                    01450049
      %INCLUDE (RCB051SI);;                                             01460049
 DCL 1 TB_RCBV150,                                                      01470049
      %INCLUDE (RCB150S);;                                              01480049
 DCL 1 TB_RCBV150_I,                                                    01490049
      %INCLUDE (RCB150SI);;                                             01500049
 DCL 1 TB_RCBV211,                                                      01510049
      %INCLUDE (RCB211S);;                                              01520049
 DCL 1 TB_RCBV211_I,                                                    01530049
      %INCLUDE (RCB211SI);;                                             01540049
 DCL 1 TB_RCBV241,                                                      01550049
      %INCLUDE (RCB241S);;                                              01560049
 DCL 1 TB_RCBV241_I,                                                    01570049
      %INCLUDE (RCB241SI);;                                             01580049
 DCL 1 TB_RCBV280,                                                      01590049
      %INCLUDE (RCB280S);;                                              01600049
 DCL 1 TB_RCBV280_I,                                                    01610049
      %INCLUDE (RCB280SI);;                                             01620049
 DCL 1 TB_RCBV340,                                                      01630049
      %INCLUDE (RCB340S);;                                              01640049
 DCL 1 TB_RCBV340_I,                                                    01650049
      %INCLUDE (RCB340SI);;                                             01660049
 DCL 1 TB_RCBV350,                                                      01670049
      %INCLUDE (RCB350S);;                                              01680049
 DCL 1 TB_RCBV350_I,                                                    01690049
      %INCLUDE (RCB350SI);;                                             01700049
 DCL 1 TB_RCBV400,                                                      01710049
      %INCLUDE (RCB400S);;                                              01720049
 DCL 1 TB_RCBV400_I,                                                    01730049
      %INCLUDE (RCB400SI);;                                             01740049
 DCL 1 TB_RCBV470,                                                      01750049
      %INCLUDE (RCB470S);;                                              01760049
 DCL 1 TB_RCBV470_I,                                                    01770049
      %INCLUDE (RCB470SI);;                                             01780049
 DCL 1 TB_RCBV500,                                                      01790049
      %INCLUDE (RCB500S);;                                              01800049
 DCL 1 TB_RCBV500_I,                                                    01810049
      %INCLUDE (RCB500SI);;                                             01820049
 DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  01830049
      %INCLUDE (RCBP05S);;                                              01840049
 DCL 1 TB_RCBV680,                                                      01850049
      %INCLUDE (RCB680S);;                                              01860049
 DCL 1 TB_RCBV680_I,                                                    01870049
      %INCLUDE (RCB680SI);;                                             01880049
 DCL 1 TB_RCBV650,                                    /* SOC RB01282 */ 01890049
      %INCLUDE (RCB650S);;                                              01900049
 DCL 1 TB_RCBV650_I,                                                    01910049
      %INCLUDE (RCB650SI);;                           /* EOC RB01282 */ 01920049
 DCL 1 TB_RCBV030,                                    /* SOC RB01288 */ 01930049
      %INCLUDE (RCB030S);;                                              01940049
 DCL 1 TB_RCBV030_I,                                                    01950049
      %INCLUDE (RCB030SI);;                                             01960049
 DCL 1 TB_RCBV110,                                                      01970049
      %INCLUDE (RCB110S);;                                              01980049
 DCL 1 TB_RCBV110_I,                                                    01990049
      %INCLUDE (RCB110SI);;                                             02000049
 DCL 1 TB_RCBV170,                                                      02010049
      %INCLUDE (RCB170S);;                                              02020049
 DCL 1 TB_RCBV170_I,                                                    02030049
      %INCLUDE (RCB170SI);;                                             02040049
 DCL 1 TB_RCBV190,                                                      02050049
      %INCLUDE (RCB190S);;                                              02060049
 DCL 1 TB_RCBV190_I,                                                    02070049
      %INCLUDE (RCB190SI);;                                             02080049
 DCL 1 TB_RCBV220,                                                      02090049
      %INCLUDE (RCB220S);;                                              02100049
 DCL 1 TB_RCBV220_I,                                                    02110049
      %INCLUDE (RCB220SI);;                                             02120049
 DCL 1 TB_RCBV240,                                                      02130049
      %INCLUDE (RCB240S);;                                              02140049
 DCL 1 TB_RCBV240_I,                                                    02150049
      %INCLUDE (RCB240SI);;                                             02160049
 DCL 1 TB_RCBV260,                                                      02170049
      %INCLUDE (RCB260S);;                                              02180049
 DCL 1 TB_RCBV260_I,                                                    02190049
      %INCLUDE (RCB260SI);;                                             02200049
 DCL 1 TB_RCBV300,                                                      02210049
      %INCLUDE (RCB300S);;                                              02220049
 DCL 1 TB_RCBV300_I,                                                    02230049
      %INCLUDE (RCB300SI);;                                             02240049
 DCL 1 TB_RCBV380,                                                      02250049
      %INCLUDE (RCB380S);;                                              02260049
 DCL 1 TB_RCBV380_I,                                                    02270049
      %INCLUDE (RCB380SI);;                                             02280049
 DCL 1 TB_RCBV645,                                                      02290049
      %INCLUDE (RCB645S);;                                              02300049
 DCL 1 TB_RCBV645_I,                                                    02310049
      %INCLUDE (RCB645SI);;                           /* EOC RB01288 */ 02320049
 DCL 1 TB_RCBP70S            BASED (ADDR(TB_RCBV500)),    /* RB01290 */ 02330049
      %INCLUDE (RCBP70S);;                                /* RB01290 */ 02340049
 DCL 1 TB_RCB063S            BASED (ADDR(TB_RCBV500)),/* SOC RB01298*/  02350049
      %INCLUDE (RCBP63S);;                                              02360049
 DCL 1 TB_RCB064S            BASED (ADDR(TB_RCBV500)),                  02370049
      %INCLUDE (RCBP64S);;                            /* EOC RB01298*/  02380049
-/********************************************************************/ 02390049
 /*        WORK FIELDS                                               */ 02400049
 /********************************************************************/ 02410049
 DCL REQTYPE     CHAR(04)      INIT('');    /* REQUEST MACH. TYPE    */ 02420049
 DCL REQORIG     CHAR(02)      INIT('');    /* REQUEST ORIGIN        */ 02430049
 DCL REQSEQN     CHAR(07)      INIT('');    /* REQUEST SERIAL NBR.   */ 02440049
 DCL REFCTRY     CHAR(03)      INIT('');    /* REQUEST COUNTRY CODE  */ 02450049
 DCL ACMCTRY     CHAR(03)      INIT('');    /* ACM CALL COUNTRY CODE */ 02460049
 DCL DATE10      CHAR(10)      INIT('');    /*YYYY-MM-DD DATE FORMAT */ 02470049
 DCL WRK_QTYD    PIC'99999'    INIT(0);     /*                       */ 02480049
 DCL WRK_QTYH    PIC'999V99'   BASED(ADDR(WRK_QTYD));                   02490049
 DCL WRK_SQLCODE FIXED BIN(31) INIT(0);                                 02500049
 DCL WRK_TABLE   CHAR(18)      INIT('');                                02510049
 DCL WRK_CTR_IND BIT(01)       INIT('0'B);                              02520049
 DCL TRUE        BIT(01)       INIT('1'B);                              02530049
 DCL FALSE       BIT(01)       INIT('0'B);                              02540049
 DCL SWITCH_EOC_ADDR           BIT(01)      INIT('0'B);                 02550049
 DCL OUT_OF_COUNTRY            BIT(01)      INIT('0'B);                 02560049
 DCL I           FIXED BIN(31) INIT(0);                                 02570049
 DCL WRK_INDNULL FIXED BIN(15) INIT(0);                                 02580049
 DCL WRK_PARMKEY CHAR(06)      INIT('');                                02590049
 DCL WRK_LENOVO_TI             CHAR(01)     INIT(''); /* SOC RB01272 */ 02600049
 DCL 1 WRK_TPMNT_VAL,                                 /* SOC RB01288 */ 02610049
       %INCLUDE (RCBZ99S);;                                             02620049
 DCL WRK051_TYPE_OF_WARRANTY   CHAR (01)    INIT('');                   02630049
 DCL WRK051_F_TYPE_OF_WARRANTY CHAR (01)    INIT('');                   02640049
 DCL WRK051_SPLT_DATE          CHAR (10)    INIT('');                   02650049
 DCL WRK051_EXP_DATE           CHAR (10)    INIT('');                   02660049
 DCL WRK051_WARRANTY_EXP_DATE  CHAR (10)    INIT('');     /* RB01298 */ 02670049
 DCL WRK_CUSTOMER_NUMBER       CHAR(08)     INIT('');                   02680049
 DCL WRK_MODEL_NUMBER          CHAR(03)     INIT('');                   02690049
 DCL WRK_SEQUENCE_NUMBER       CHAR(28)     INIT('');                   02700049
 DCL WRK_TEMP                  CHAR(03)     INIT('');                   02710049
 DCL SWITCH_HV_CTR             BIT(01)      INIT('0'B);                 02720049
 DCL SWITCH_READ_BAU_WAR       BIT(01)      INIT('1'B);                 02730049
 DCL SWITCH_READ_PI_CTR        BIT(01)      INIT('1'B);/*EOC RB01288 */ 02740049
 DCL WRK_T190_CUST_NUM         CHAR(08)     INIT('');  /*SOC RB01289 */ 02750049
 DCL WRK_T010_CUST_NUM         CHAR(08)     INIT('');                   02760049
 DCL WRK_T011_CUST_NUM         CHAR(08)     INIT('');                   02770049
 DCL WRK_SLCT_BAU_CUST         CHAR(08)     INIT('');                   02780049
 DCL SWITCH_BAU_FLAG           BIT(01)      INIT('0'B);/*EOC RB01289 */ 02790049
 DCL SWITCH_INTERNAL_MACHINE_CTR    BIT(01) INIT('0'B);   /* RB01290 */ 02800049
 DCL WRK_TOC_V30_IND          FIXED BIN(15) INIT(0);      /* RB01290 */ 02810049
 DCL WRK_FWTOW                 CHAR(01)     INIT('');     /* RB01298 */ 02820049
 DCL WRK_HBTOM                 CHAR(01)     INIT('');     /* RB01298 */ 02830049
0/********************************************************************/ 02840049
 /*         D E F I N E    C U R S O R S                             */ 02850049
 /********************************************************************/ 02860049
 EXEC SQL                                                               02870049
   DECLARE ADDR_CURSOR CURSOR FOR                                       02880049
     SELECT  T280.COUNTRY_NUMBER ,                                      02890049
             T280.CUSTOMER_NUMBER,                                      02900049
             T280.ADDRESS_NUMBER ,                                      02910049
             T280.LINE_NUMBER    ,                                      02920049
             T280.TEXT ,                                                02930049
             T280.LAST_CHANGE_DATE                                      02940049
       FROM  RCBV0280_ADDR_LINE  T280                                   02950049
      WHERE  T280.COUNTRY_NUMBER  = :REFCTRY                            02960049
        AND  T280.CUSTOMER_NUMBER = :TB_RCBV051.CUSTOMER_NUMBER         02970049
        AND  T280.ADDRESS_NUMBER  = :TB_RCBV150.ADDRESS_NUMBER          02980049
      ORDER BY 1,2,3,4                                                  02990049
      FOR FETCH ONLY;                                                   03000049
                                                      /* SOC RB01289 */ 03010049
 EXEC SQL                                                               03020049
   DECLARE ADDR_CURSOR1 CURSOR FOR                                      03030049
     SELECT  T280.COUNTRY_NUMBER ,                                      03040049
             T280.CUSTOMER_NUMBER,                                      03050049
             T280.ADDRESS_NUMBER ,                                      03060049
             T280.LINE_NUMBER    ,                                      03070049
             T280.TEXT ,                                                03080049
             T280.LAST_CHANGE_DATE                                      03090049
       FROM  RCBV0280_ADDR_LINE  T280                                   03100049
      WHERE  T280.COUNTRY_NUMBER  = :REFCTRY                            03110049
        AND  T280.CUSTOMER_NUMBER = :WRK_SLCT_BAU_CUST                  03120049
        AND  T280.ADDRESS_NUMBER  = :TB_RCBV150.ADDRESS_NUMBER          03130049
      ORDER BY 1,2,3,4                                                  03140049
      FOR FETCH ONLY;                                                   03150049
                                                      /* EOC RB01289 */ 03160049
0/********************************************************************/ 03170049
 /*                 BUILT IN FUNCTIONS                               */ 03180049
 /********************************************************************/ 03190049
0DCL (LENGTH,                                                           03200049
      CSTG,                                                             03210049
      STRING,                                                           03220049
      SUBSTR,                                                           03230049
      NULL,                                                             03240049
      ROUND,                                                            03250049
      VERIFY,                                                           03260049
      ADDR)                                                             03270049
              BUILTIN;                                                  03280049
1/********************************************************************/ 03290049
 /*                 S T A R T   P R O C E S S I N G                  */ 03300049
 /********************************************************************/ 03310049
0CALL RCBCS4M_INITIALISATION;                                           03320049
0CALL RCBCS4M_MAIN_PROCESSING;                                          03330049
0CALL RCBCS4M_FINALISATION;                                             03340049
1/********************************************************************/ 03350049
 /*      I N I T I A L I S A T I O N   P R O C E S S I N G           */ 03360049
 /********************************************************************/ 03370049
0RCBCS4M_INITIALISATION : PROC;                                         03380049
                                                                        03390049
 SELECT (EIBCALEN);                      /* CHECK LENGTH OF COMMAREA */ 03400049
    WHEN(0)                              /* COMMAREA EMPTY           */ 03410049
    DO;                                                                 03420049
       EDQBSHS.CRMORET = '4';                                           03430049
       RCBCQES.MESSAGE_NUMBER = 'C201';                                 03440049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 03450049
    END;                                                                03460049
    WHEN(150)                            /* HEADER RECORD            */ 03470049
    DO;                                                                 03480049
       IF EDQBSHS.REQ.TYPE ¬= 'DE' THEN                                 03490049
       DO;                                                              03500049
          EDQBSHS.CRMORET = '4';                                        03510049
          RCBCQES.MESSAGE_NUMBER = 'C203';                              03520049
          CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              03530049
       END;                                                             03540049
    END;                                                                03550049
    WHEN(750)                            /* HEADER & DETAIL ITEM     */ 03560049
    DO;                                                                 03570049
       IF EDQBSHS.REQ.TYPE ¬= 'DE' THEN                                 03580049
       DO;                                                              03590049
          EDQBSHS.CRMORET = '4';                                        03600049
          RCBCQES.MESSAGE_NUMBER = 'C203';                              03610049
          CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);              03620049
       END;                                                             03630049
    END;                                                                03640049
    OTHERWISE                            /* INVALID COMMAREA LENGTH  */ 03650049
    DO;                                                                 03660049
       EDQBSHS.CRMORET = '4';                                           03670049
       RCBCQES.MESSAGE_NUMBER = 'C202';                                 03680049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 03690049
    END;                                                                03700049
 END;                                                                   03710049
                                                                        03720049
 TB_RCBV010 = '';                                                       03730049
 TB_RCBV011 = '';                                                       03740049
 TB_RCBV051 = '';                                                       03750049
 TB_RCBV150 = '';                                                       03760049
 TB_RCBV241 = '';                                                       03770049
 TB_RCBV280 = '';                                                       03780049
 TB_RCBV340 = '';                                                       03790049
 TB_RCBV350 = '';                                                       03800049
 TB_RCBV400 = '';                                                       03810049
 TB_RCBV470 = '';                                                       03820049
 TB_RCBV500 = '';                                                       03830049
 TB_RCBV680 = '';                                                       03840049
 TB_RCBV030 = '';                                    /* SOC RB01288 */  03850049
 TB_RCBV110 = '';                                                       03860049
 TB_RCBV170 = '';                                                       03870049
 TB_RCBV190 = '';                                                       03880049
 TB_RCBV220 = '';                                                       03890049
 TB_RCBV240 = '';                                                       03900049
 TB_RCBV260 = '';                                                       03910049
 TB_RCBV300 = '';                                                       03920049
 TB_RCBV380 = '';                                    /* EOC RB01288 */  03930049
                                                                        03940049
 TB_RCBV241.HVP_QUANTITY = 0;                                           03950049
                                                                        03960049
 USER_FILE_RCBDRF1 = '';                                                03970049
 USER_FILE_PI      = '';                                                03980049
 USER_EXTRA_INFO   = '';                                                03990049
 PARM_INT_AREA.MSG_AREA = '';                                           04000049
 PARM_INT_AREA.ERR_AREA = '';                                           04010049
                                                                        04020049
 REFCTRY = EDQBSHS.REQ.REQKEY.IOPUCTY;                                  04030049
 ACMCTRY = EDQBSHS.REQ.TARGCTY;                                         04040049
 REQTYPE = EDQBSHS.REQ.REQKEY.CSLMTYP;                                  04050049
 REQORIG = EDQBSHS.REQ.REQKEY.IHSIMID.IOLCPLM;                          04060049
 REQSEQN = EDQBSHS.REQ.REQKEY.IHSIMID.IHSINBR;                          04070049
 DATE10  = $DTSEP(EDQBSHS.REQ.DFLTREF,'-');                             04080049
                                                                        04090049
 EDQBSHS.REQ.CRMOSUB = 0;                            /* CEDS00000403 */ 04100049
                                                                        04110049
 EDQBSDS = '';                                                          04120049
                                                                        04130049
0END RCBCS4M_INITIALISATION;                                            04140049
1/********************************************************************/ 04150049
 /*      M A I N   P R O C E S S I N G                               */ 04160049
 /********************************************************************/ 04170049
0RCBCS4M_MAIN_PROCESSING : PROC;                                        04180049
                                                                        04190049
                                                /* SOC : CEDS00000320 */04200049
 /* CALL RCBCS4M_READ_RCB101;                              /* RB01272 */04210049
                                                                        04220049
                                                       /* SOC RB01288 */04230049
         /* LOOK FOR WARRANTY DETAILS IN PI (T051) IF NOT FOUND THEN  */04240049
         /* CONTINUE TO SEARCH IN BAU (T220) IF NOT FOUND THEN RETURN */04250049
         /* THE CONTROL TO THE CALLED PROGRAM                         */04260049
                                                       /* EOC RB01288 */04270049
 CALL RCBCS4M_READ_PI_HW_PR;                                            04280049
 IF SWITCH_READ_BAU_WAR = TRUE THEN                    /* SOC RB01288 */04290049
   DO;                                                     /* RB01290 */04300049
     CALL RCBCS4M_READ_SUPPL_CTR;                                       04310049
     WRK_CTR_IND = FALSE;                              /* SOC RB01290 */04320049
     SWITCH_READ_PI_CTR = TRUE;                                         04330049
     IF ((TB_RCBV220.TYPE_OF_MAINT = '2')|                              04340049
         (SWITCH_INTERNAL_MACHINE_CTR = TRUE)) THEN                     04350049
       DO;                                                              04360049
         CALL RCBCS4M_READ_BAU_SERV_CTR;                                04370049
       END;                                                             04380049
   END;                                                /* EOC RB01290 */04390049
 ELSE                                                                   04400049
   DO;                                                 /* EOC RB01288 */04410049
     /* CALL RCBCS4M_READ_REV_DIV;                         /* RB01272 */04420049
                                                /* EOC : CEDS00000320 */04430049
                                                                        04440049
     IF EDQBSHS.REQ.REQKEY.IOPUCTY ¬= EDQBSHS.REQ.TARGCTY THEN          04450049
       CALL RCBCS4M_READ_PO_MOD1;                                       04460049
                                                                        04470049
     CALL RCBCS4M_READ_TRANS_SDF;                          /* RB01282 */04480049
     CALL RCBCS4M_READ_SERV_CTR;                           /* RB01290 */04490049
   END;                                                    /* RB01288 */04500049
                                                                        04510049
                                                       /* SOC RB01288 */04520049
          /* BAU CONTRACT PREFER'S PI CONTRACT                        */04530049
          /* LOOK FOR CONTRAT DETAILS IN BAU (T240) IF NOT FOUND THEN */04540049
          /* CONTINUE TO SEARCH IN PI (T241) IF NOT FOUND THEN EXTEND */04550049
          /* THE LOOKUP FOR HIGH VOLUME CONTRACT                      */04560049
                                                                        04570049
 /* CALL RCBCS4M_READ_SERV_CTR;                            /* RB01290 */04580049
                                                                        04590049
 IF SWITCH_READ_PI_CTR = TRUE THEN                     /* EOC RB01288 */04600049
      CALL RCBCS4M_READ_PI_CTR;                                         04610049
                                                                        04620049
 IF SWITCH_READ_BAU_WAR = TRUE THEN                    /* SOC RB01288 */04630049
   DO;                                                                  04640049
      CALL RCBCS4M_READ_HW_CUST;                                        04650049
      CALL RCBCS4M_READ_RCB005;                                         04660049
      CALL RCBCS4M_READ_ADDRESS;                                        04670049
   END;                                                                 04680049
 ELSE                                                  /* EOC RB01288 */04690049
      CALL RCBCS4M_READ_PI_CUST;                                        04700049
                                                                        04710049
                                                                        04720049
                                                /* SOC : CEDS00000320 */04730049
                                                /* EOC : CEDS00000320 */04740049
                                                                        04750049
 IF TB_RCBV051.WARRANTY_LIABILITY = 'LEN'                  /* RB01283 */04760049
 THEN                                                                   04770049
    CALL RCBCS4M_CHECK_LENOVO;                                          04780049
                                                       /* EOC RB01272 */04790049
                                                                        04800049
 END RCBCS4M_MAIN_PROCESSING;                                           04810049
1/*********************************************************************/04820049
 /*                                                                   */04830049
 /* MODULE NAME      : RCBCS4M_READ_PI_HW_PR                          */04840049
 /*                                                                   */04850049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0051    */04860049
 /*                                                                   */04870049
 /*                                                                   */04880049
 /*********************************************************************/04890049
0RCBCS4M_READ_PI_HW_PR: PROC;                                           04900049
                                                                        04910049
 EXEC SQL                                                               04920049
      SELECT PRODUCT_TYPE       ,                                       04930049
             ORIGIN             ,                                       04940049
             SEQUENCE_NUMBER    ,                                       04950049
             COUNTRY_NUMBER     ,                                       04960049
             MODEL_NUMBER       ,                                       04970049
             BUILT_TO_MODEL_NR  ,                                       04980049
             INSTALL_DATE       ,                                       04990049
             TYPE_OF_MAINT      ,                                       05000049
             TYPE_OF_WARRANTY   ,                                       05010049
             SERVICE_DELIV_FLAG ,                                       05020049
             SERVICE_LVL_CODE_1 ,                                       05030049
             WARRANTY_SPLT_DATE ,                                       05040049
             SERVICE_LVL_CODE_2 ,                                       05050049
             WARRANTY_EXP_DATE  ,                                       05060049
             CUSTOMER_NUMBER    ,                                       05070049
             CUSTOMER_NR_EXTEND ,                                       05080049
             OU_CODE            ,                                       05090049
             DEALER_NUMBER      ,                                       05100049
             SERVICE_LVL_CODE_C ,                                       05110049
             SOURCE_INDICATOR   ,                                       05120049
             LAST_CHANGE_DATE   ,                                       05130049
             F_TYPE_OF_WARRANTY ,                        /* RB01281 */  05140049
             WARRANTY_LIABILITY                          /* RB01283 */  05150049
       INTO :TB_RCBV051                                                 05160049
            :TB_RCBV051_I.INDNULL                                       05170049
       FROM  RCBV0051_PI_HW_PR  T051                                    05180049
      WHERE  T051.COUNTRY_NUMBER  = :REFCTRY                            05190049
        AND  T051.PRODUCT_TYPE    = :REQTYPE                            05200049
        AND  T051.ORIGIN          = :REQORIG                            05210049
        AND  T051.SEQUENCE_NUMBER = :REQSEQN                            05220049
      WITH UR;                                                          05230049
                                                                        05240049
 SELECT(SQLCA.SQLCODE);                                                 05250049
   WHEN(0)                                                              05260049
     DO;                                               /* SOC RB01288 */05270049
       SWITCH_READ_BAU_WAR = FALSE;                    /* EOC RB01288 */05280049
       CALL RCBCS4M_MOVE_PI_HW_PR;                                      05290049
     END;                                                  /* RB01288 */05300049
   WHEN(100)                                                            05310049
     DO;                                                                05320049
  /*   EDQBSHS.REQ.CRMORET = '9';  */                  /* SOC RB01288 */05330049
  /*   EXEC CICS RETURN;           */                                   05340049
       SWITCH_READ_BAU_WAR = TRUE;                     /* EOC RB01288 */05350049
     END;                                                               05360049
   OTHERWISE                                                            05370049
     DO;                                                                05380049
       RCBCQES.MESSAGE_NUMBER = 'C214';                                 05390049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     05400049
       WRK_TABLE = 'RCBT0051_PI_HW_PR';                                 05410049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 05420049
     END;                                                               05430049
 END;                                                                   05440049
 END RCBCS4M_READ_PI_HW_PR;                                             05450049
 /*********************************************************************/05460049
 /*                                            /* SOC RB01282         */05470049
 /* MODULE NAME      : RCBCS4M_READ_TRANS_SDF                         */05480049
 /*                                                                   */05490049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0650    */05500049
 /*                                                                   */05510049
 /*                                                                   */05520049
 /*********************************************************************/05530049
 RCBCS4M_READ_TRANS_SDF: PROC;                                          05540049
                                                                        05550049
 EXEC SQL                                                               05560049
      SELECT *                                                          05570049
   INTO :TB_RCBV650                                                     05580049
        :TB_RCBV650_I.INDNULL                                           05590049
   FROM RCBV0650_TRANS_SDF T650                                         05600049
  WHERE T650.SERVICE_DELIV_FLAG = :TB_RCBV051.SERVICE_DELIV_FLAG        05610049
    AND T650.COUNTRY_NUMBER     = :TB_RCBV051.COUNTRY_NUMBER            05620049
   WITH UR;                                                             05630049
   SELECT(SQLCA.SQLCODE);                                               05640049
     WHEN(0)                                                            05650049
       CALL RCBCS4M_MOVE_TRANS_SDF;                                     05660049
     WHEN(100);                                                         05670049
     OTHERWISE                                                          05680049
       DO;                                                              05690049
         RCBCQES.MESSAGE_NUMBER = 'C236';                               05700049
         WRK_SQLCODE            = SQLCA.SQLCODE;                        05710049
         WRK_TABLE              = 'RCBV0650_TRANS_SDF';                 05720049
         CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);               05730049
       END;                                                             05740049
   END;                                                                 05750049
                                                                        05760049
   END RCBCS4M_READ_TRANS_SDF;                         /* EOC RB01282 */05770049
1/*********************************************************************/05780049
 /*                                                                   */05790049
 /* MODULE NAME      : RCBCS4M_MOVE_PI_HW_PR                          */05800049
 /*                                                                   */05810049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0051    */05820049
 /*                    TO THE COMMAREA FIELDS.                        */05830049
 /*                                                                   */05840049
 /*********************************************************************/05850049
0RCBCS4M_MOVE_PI_HW_PR: PROC;                                           05860049
                                                                        05870049
 EDQBSDS.IHSITOS.CSLMTYP         = TB_RCBV051.PRODUCT_TYPE;             05880049
 EDQBSDS.IHSITOS.IHSIMID.IOLCPLM = TB_RCBV051.ORIGIN;                   05890049
 EDQBSDS.IHSITOS.IHSIMID.IHSINBR = TB_RCBV051.SEQUENCE_NUMBER;          05900049
 EDQBSDS.IOPUCTY                 = TB_RCBV051.COUNTRY_NUMBER;           05910049
                                                                        05920049
 IF TB_RCBV051_I.INDNULL(05) = 0 THEN                                   05930049
   EDQBSDS.CSLMMOD = TB_RCBV051.MODEL_NUMBER;                           05940049
                                                                        05950049
 IF TB_RCBV051_I.INDNULL(06) = 0 THEN                                   05960049
   EDQBSDS.BUILT_TO_MODEL_NR = TB_RCBV051.BUILT_TO_MODEL_NR;            05970049
                                                                        05980049
 EDQBSDS.DHSIINS = SUBSTR(TB_RCBV051.INSTALL_DATE,1,4) ||               05990049
                   SUBSTR(TB_RCBV051.INSTALL_DATE,6,2) ||               06000049
                   SUBSTR(TB_RCBV051.INSTALL_DATE,9,2);                 06010049
                                                                        06020049
                                                 /*SOC CEDS00000435 */  06030049
 IF TB_RCBV051_I.INDNULL(09) = 0 THEN                                   06040049
   EDQBSDS.SRCCCMD.CHSISTM = TB_RCBV051.TYPE_OF_WARRANTY;               06050049
                                                 /*EOC CEDS00000435 */  06060049
                                                 /*SOC CEDS00000438 */  06070049
 IF (TB_RCBV051.F_TYPE_OF_WARRANTY ¬= '' &                              06080049
     TB_RCBV051.WARRANTY_SPLT_DATE ¬= '' &                              06090049
     TB_RCBV051.TYPE_OF_WARRANTY   ¬= TB_RCBV051.F_TYPE_OF_WARRANTY)    06100049
   THEN                                                                 06110049
  DO;                                                                   06120049
    IF (DATE10  >  TB_RCBV051.WARRANTY_SPLT_DATE &                      06130049
        DATE10  <= TB_RCBV051.WARRANTY_EXP_DATE)                        06140049
      THEN                                                              06150049
                                                                        06160049
        EDQBSDS.SRCCCMD.CHSISTM = TB_RCBV051.F_TYPE_OF_WARRANTY;        06170049
  END;                                           /*EOC CEDS00000438 */  06180049
                                                                        06190049
 IF TB_RCBV051_I.INDNULL(10) = 0 THEN                                   06200049
   EDQBSDS.SRCCCMD.SERVICE_DELIV_FLAG = TB_RCBV051.SERVICE_DELIV_FLAG;  06210049
                                                   /* SOC RB01298 */    06220049
 IF VERIFY (TB_RCBV051.F_TYPE_OF_WARRANTY,WRK_FWTOW) = 0 THEN           06230049
 DO;                                               /* EOC RB01298 */    06240049
   EDQBSDS.DAGREWP = SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,1,4) ||        06250049
                     SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,6,2) ||        06260049
                     SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,9,2);          06270049
 END;                                              /* SOC RB01298 */    06280049
 ELSE                                                                   06290049
 IF VERIFY (TB_RCBV051.F_TYPE_OF_WARRANTY,WRK_HBTOM) = 0 THEN           06300049
 DO;                                                                    06310049
   WRK051_WARRANTY_EXP_DATE =                                           06320049
             RCBCS4M_DATE_CALC(TB_RCBV051.WARRANTY_SPLT_DATE,-1);       06330049
   EDQBSDS.DAGREWP = SUBSTR(WRK051_WARRANTY_EXP_DATE,1,4) ||            06340049
                     SUBSTR(WRK051_WARRANTY_EXP_DATE,6,2) ||            06350049
                     SUBSTR(WRK051_WARRANTY_EXP_DATE,9,2);              06360049
 END;                                              /* EOC RB01298 */    06370049
 EDQBSDS.CUSCODE.ICUSHWU = TB_RCBV051.CUSTOMER_NUMBER;                  06380049
                                                                        06390049
 SWITCH_BAU_FLAG = FALSE ;                            /* SOC RB01289 */ 06400049
 CALL RCBBCS4M_READ_CUST_NUM;                                           06410049
                                                                        06420049
 SELECT (TB_RCBV051.SOURCE_INDICATOR);                                  06430049
   WHEN ('O')                                                           06440049
     DO;                                                                06450049
       IF WRK_T010_CUST_NUM ¬= '' THEN                                  06460049
         DO;                                                            06470049
           EDQBSDS.CUSCODE.ICUSHWU = WRK_T010_CUST_NUM;                 06480049
           SWITCH_BAU_FLAG = TRUE;                                      06490049
         END;                                                           06500049
       ELSE IF WRK_T190_CUST_NUM ¬= '' THEN                             06510049
         DO;                                                            06520049
           EDQBSDS.CUSCODE.ICUSHWU = WRK_T190_CUST_NUM;                 06530049
           SWITCH_BAU_FLAG = TRUE;                                      06540049
         END;                                                           06550049
            ELSE IF WRK_T011_CUST_NUM ¬= '' THEN                        06560049
              DO;                                                       06570049
                 EDQBSDS.CUSCODE.ICUSHWU = WRK_T011_CUST_NUM;           06580049
              END;                                                      06590049
     END;                                                               06600049
   WHEN ('S')                                                           06610049
     DO;                                                                06620049
       IF WRK_T190_CUST_NUM ¬= '' THEN                                  06630049
         DO;                                                            06640049
           EDQBSDS.CUSCODE.ICUSHWU = WRK_T190_CUST_NUM;                 06650049
           SWITCH_BAU_FLAG = TRUE;                                      06660049
         END;                                                           06670049
       ELSE IF WRK_T011_CUST_NUM ¬= '' THEN                             06680049
         DO;                                                            06690049
           EDQBSDS.CUSCODE.ICUSHWU = WRK_T011_CUST_NUM;                 06700049
         END;                                                           06710049
     END;                                                               06720049
   OTHERWISE                                                            06730049
     DO;                                                                06740049
       IF WRK_T190_CUST_NUM ¬= '' THEN                                  06750049
         DO;                                                            06760049
           EDQBSDS.CUSCODE.ICUSHWU = WRK_T190_CUST_NUM;                 06770049
           SWITCH_BAU_FLAG = TRUE;                                      06780049
         END;                                                           06790049
       ELSE IF WRK_T010_CUST_NUM ¬= '' THEN                             06800049
         DO;                                                            06810049
           EDQBSDS.CUSCODE.ICUSHWU = WRK_T010_CUST_NUM;                 06820049
           SWITCH_BAU_FLAG = TRUE;                                      06830049
         END;                                                           06840049
     END;                                                               06850049
 END;                                                                   06860049
                                                                        06870049
 IF SWITCH_BAU_FLAG = FALSE THEN                                        06880049
    EDQBSDS.CUSCODE.ICUSANO = TB_RCBV051.CUSTOMER_NR_EXTEND;            06890049
                                                                        06900049
                                                       /* EOC RB01289 */06910049
 EDQBSDS.CUSCODE.SEDQCSX = '2' || TB_RCBV051.OU_CODE;                   06920049
 /*EDQBSDS.CUSCODE.ICUSANO = TB_RCBV051.CUSTOMER_NR_EXTEND;/* RB01289 */06930049
 EDQBSDS.SRCCCMD.ICUSHWU = EDQBSDS.CUSCODE.ICUSHWU;        /* RB01289 */06940049
                                                                        06950049
                                                                        06960049
 EDQBSDS.SRCCCMD.TAKE_CEDS = 'N';                                       06970049
                                                                        06980049
 EDQBSDS.SRCCCMD.IODPDBU.CODPDIV = '2';                                 06990049
 EDQBSDS.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV051.OU_CODE;                  07000049
                                                                        07010049
 IF TB_RCBV051_I.INDNULL(18) = 0 THEN                                   07020049
   EDQBSDS.DEALER =  TB_RCBV051.DEALER_NUMBER;                          07030049
                                                                        07040049
 EDQBSDS.SRCCCMD.SSRCIND = TB_RCBV051.SOURCE_INDICATOR;                 07050049
                                                                        07060049
 END RCBCS4M_MOVE_PI_HW_PR;                                             07070049
1/*********************************************************************/07080049
 /*                                                                   */07090049
 /* MODULE NAME      : RCBCS4M_READ_PO_MOD1                           */07100049
 /*                                                                   */07110049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0400    */07120049
 /*                                                                   */07130049
 /*                                                                   */07140049
 /*********************************************************************/07150049
0RCBCS4M_READ_PO_MOD1 : PROC;                                           07160049
                                                                        07170049
 EXEC SQL                                                               07180049
      SELECT COUNTRY_NUMBER,                                            07190049
             PRODUCT_TYPE,                                              07200049
             MODEL_NUMBER,                                              07210049
             REPAIR_CENTER_MARK,                                        07220049
             MACHINE_CATEGORY,                                          07230049
             REGROUP_PR_CAT,                                            07240049
             ACTIVITY_REP_OPT,                                          07250049
             MC_MAINT_GROUP,                                            07260049
             MIN_MONTH_MAINT_CH,                                        07270049
             DEVELOP_DIV_CODE,                                          07280049
             CUSTOMER_SETUP_IND,                                        07290049
             WARRANTY_CATEGORY,                                         07300049
             CE_PRODUCT_KEY,                                            07310049
             SERVICE_LVL_CODE_1,                                        07320049
             WARRANTY_DURATN_1,                                         07330049
             SERVICE_LVL_CODE_2,                                        07340049
             WARRANTY_DURATN_2,                                         07350049
             SERVICE_LVL_CODE_C,                                        07360049
             SERVICE_LVL_CD_MA1,                                        07370049
             SERVICE_LVL_CD_MA2,                                        07380049
             SERVICE_LVL_CD_MA3,                                        07390049
             PROD_REVENUE_DIV,                                          07400049
             SEGMENT_ACRONYM,                                           07410049
             MANUAL_DIVISION,                                           07420049
             EXPLICIT_TYPE,                                             07430049
             LAST_CHANGE_DATE,                                          07440049
             EFFECTIVE_DATE,                                            07450049
             END_DATE                                                   07460049
       INTO :TB_RCBV400                                                 07470049
            :TB_RCBV400_I.INDNULL                                       07480049
       FROM  RCBV0400_PO_MOD1  T400                                     07490049
      WHERE  T400.COUNTRY_NUMBER  = :ACMCTRY                            07500049
        AND  T400.PRODUCT_TYPE    = :REQTYPE                            07510049
        AND  T400.MODEL_NUMBER    = :TB_RCBV051.MODEL_NUMBER            07520049
        AND :DATE10          BETWEEN T400.EFFECTIVE_DATE                07530049
                                 AND T400.END_DATE                      07540049
      WITH UR;                                                          07550049
                                                                        07560049
 SELECT(SQLCA.SQLCODE);                                                 07570049
   WHEN(0)                                                              07580049
     OUT_OF_COUNTRY = TRUE;                                             07590049
   WHEN(100)                                                            07600049
     OUT_OF_COUNTRY = FALSE;                                            07610049
   OTHERWISE                                                            07620049
     DO;                                                                07630049
       RCBCQES.MESSAGE_NUMBER = 'C225';                                 07640049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     07650049
       WRK_TABLE = 'RCBT0400_PO_MOD1';                                  07660049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 07670049
     END;                                                               07680049
 END;                                                                   07690049
 END RCBCS4M_READ_PO_MOD1;                                              07700049
1/*********************************************************************/07710049
 /*                                                                   */07720049
 /* MODULE NAME      : RCBCS4M_READ_PI_CTR                            */07730049
 /*                                                                   */07740049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0241    */07750049
 /*                                                                   */07760049
 /*                                                                   */07770049
 /*********************************************************************/07780049
0RCBCS4M_READ_PI_CTR : PROC;                                            07790049
                                                                        07800049
0WRK_CTR_IND = FALSE;                                                   07810049
                                                                        07820049
0EXEC SQL                                                               07830049
      SELECT COUNTRY_NUMBER  ,                                          07840049
             PRODUCT_TYPE    ,                                          07850049
             ORIGIN          ,                                          07860049
             SEQUENCE_NUMBER ,                                          07870049
             HVP_QUANTITY    ,                                          07880049
             CONTRACT_NUMBER ,                                          07890049
             SERVICE_MODULE_1,                                          07900049
             SERVICE_MODULE_2,                                          07910049
             SERVICE_MODULE_3,                                          07920049
             SERVICE_MODULE_4,                                          07930049
             SERVICE_MODULE_5,                                          07940049
             COVERAGE_START_1,                                          07950049
             COVERAGE_END_1  ,                                          07960049
             COVERAGE_START_2,                                          07970049
             COVERAGE_END_2  ,                                          07980049
             COVERAGE_START_3,                                          07990049
             COVERAGE_END_3  ,                                          08000049
             COVERAGE_START_4,                                          08010049
             COVERAGE_END_4  ,                                          08020049
             COVERAGE_START_5,                                          08030049
             COVERAGE_END_5    ,                                        08040049
             COVERAGE_START_6  ,                                        08050049
             COVERAGE_END_6    ,                                        08060049
             COVERAGE_START_7  ,                                        08070049
             COVERAGE_END_7    ,                                        08080049
             SERVICE_TYPE      ,                                        08090049
             SERVICE_LVL_CODE  ,                                        08100049
             AUTHORISATION_CODE,                                        08110049
             SOURCE_INDICATOR  ,                                        08120049
             LAST_CHANGE_DATE  ,                                        08130049
             EFFECTIVE_DATE    ,                                        08140049
             END_DATE                                                   08150049
       INTO :TB_RCBV241                                                 08160049
            :TB_RCBV241_I.INDNULL                                       08170049
      FROM   RCBV0241_PI_CTR  T241                                      08180049
      WHERE  T241.COUNTRY_NUMBER  = :REFCTRY                            08190049
        AND  T241.PRODUCT_TYPE    = :REQTYPE                            08200049
        AND  T241.ORIGIN          = :REQORIG                            08210049
        AND  T241.SEQUENCE_NUMBER = :REQSEQN                            08220049
        AND  :DATE10        BETWEEN T241.EFFECTIVE_DATE                 08230049
                                AND T241.END_DATE                       08240049
      WITH UR;                                                          08250049
                                                                        08260049
 SELECT(SQLCA.SQLCODE);                                                 08270049
   WHEN(0)                                                              08280049
     CALL RCBCS4M_MOVE_PI_CTR;                                          08290049
   WHEN(100)                                                            08300049
 /*  CALL RCBCS4M_CALC_SLC;    */                      /* SOC RB01288 */08310049
     CALL RCBCS4M_READ_HV_CTR;                         /* EOC RB01288 */08320049
   OTHERWISE                                                            08330049
     DO;                                                                08340049
       RCBCQES.MESSAGE_NUMBER = 'C215';                                 08350049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     08360049
       WRK_TABLE = 'RCBT0241_PI_CTR';                                   08370049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 08380049
     END;                                                               08390049
 END;                                                                   08400049
 END RCBCS4M_READ_PI_CTR;                                               08410049
1/*********************************************************************/08420049
 /*                                                                   */08430049
 /* MODULE NAME      : RCBCS4M_CALC_SLC                               */08440049
 /*                                                                   */08450049
 /* DESCRIPTION      : DETERMINE WHICH SLC TO USE FOR WARRANTY OR     */08460049
 /*                    PER CALL.                                      */08470049
 /*                                                                   */08480049
 /*********************************************************************/08490049
0RCBCS4M_CALC_SLC : PROC;                                               08500049
                                                                        08510049
 IF DATE10 <= TB_RCBV051.WARRANTY_EXP_DATE THEN                         08520049
   DO;                                                                  08530049
 /*EDQBSDS.SRCCCMD.CHSISTM=TB_RCBV051.TYPE_OF_WARRANTY; CEDS00000435*/  08540049
     IF TB_RCBV051_I.INDNULL(12) = 0                                    08550049
     &  DATE10 > TB_RCBV051.WARRANTY_SPLT_DATE THEN                     08560049
       DO;                                                              08570049
         IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(16) = 0 THEN          08580049
           DO;                                                          08590049
             EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                         08600049
                                          TB_RCBV400.SERVICE_LVL_CODE_2;08610049
             CALL RCBCS4M_READ_SERV_COND                                08620049
                                        (TB_RCBV400.SERVICE_LVL_CODE_2);08630049
           END;                                                         08640049
         ELSE                                                           08650049
           DO;                                                          08660049
             IF TB_RCBV051_I.INDNULL(13) = 0 THEN                       08670049
               DO;                                                      08680049
                 EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                     08690049
                                          TB_RCBV051.SERVICE_LVL_CODE_2;08700049
                 CALL RCBCS4M_READ_SERV_COND                            08710049
                                        (TB_RCBV051.SERVICE_LVL_CODE_2);08720049
               END;                                                     08730049
           END;                                                         08740049
       END;                                                             08750049
     ELSE                                                               08760049
       DO;                                                              08770049
         IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(14) = 0 THEN          08780049
           DO;                                                          08790049
             EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                         08800049
                                          TB_RCBV400.SERVICE_LVL_CODE_1;08810049
             CALL RCBCS4M_READ_SERV_COND                                08820049
                                        (TB_RCBV400.SERVICE_LVL_CODE_1);08830049
           END;                                                         08840049
         ELSE                                                           08850049
           DO;                                                          08860049
             IF TB_RCBV051_I.INDNULL(11) = 0 THEN                       08870049
               DO;                                                      08880049
                 EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                     08890049
                                          TB_RCBV051.SERVICE_LVL_CODE_1;08900049
                 CALL RCBCS4M_READ_SERV_COND                            08910049
                                        (TB_RCBV051.SERVICE_LVL_CODE_1);08920049
               END;                                                     08930049
           END;                                                         08940049
       END;                                                             08950049
                                                /* SOC : CEDS00000320 */08960049
    EDQBSDS.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV051.INSTALL_DATE,1,4) ||    08970049
                              SUBSTR(TB_RCBV051.INSTALL_DATE,6,2) ||    08980049
                              SUBSTR(TB_RCBV051.INSTALL_DATE,9,2);      08990049
                                                                        09000049
    EDQBSDS.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,1,4)  09010049
                           || SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,6,2)  09020049
                           || SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,9,2); 09030049
                                                /* EOC : CEDS00000320 */09040049
   END;                                                                 09050049
 ELSE                                                                   09060049
   DO;                                                                  09070049
     EDQBSDS.SRCCCMD.CHSISTM = '3';                                     09080049
                                                /* SOC : CEDS00000320 */09090049
   EDQBSDS.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,1,4)   09100049
                          || SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,6,2)   09110049
                          || SUBSTR(TB_RCBV051.WARRANTY_EXP_DATE,9,2);  09120049
                                                                        09130049
   EDQBSDS.SRCCCMD.DDBSMED = '99991231';                                09140049
                                                /* EOC : CEDS00000320 */09150049
     IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(18) = 0 THEN              09160049
       DO;                                                              09170049
         EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                             09180049
                                    TB_RCBV400.SERVICE_LVL_CODE_C;      09190049
         CALL RCBCS4M_READ_SERV_COND                                    09200049
                                  (TB_RCBV400.SERVICE_LVL_CODE_C);      09210049
       END;                                                             09220049
     ELSE                                                               09230049
       DO;                                                              09240049
         IF TB_RCBV051_I.INDNULL(19) = 0 THEN                           09250049
           DO;                                                          09260049
             EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                         09270049
                                    TB_RCBV051.SERVICE_LVL_CODE_C;      09280049
             CALL RCBCS4M_READ_SERV_COND                                09290049
                                  (TB_RCBV051.SERVICE_LVL_CODE_C);      09300049
           END;                                                         09310049
       END;                                                             09320049
   END;                                                                 09330049
 END RCBCS4M_CALC_SLC;                                                  09340049
1/*********************************************************************/09350049
 /*                                                                   */09360049
 /* MODULE NAME      : RCBCS4M_MOVE_PI_CTR                            */09370049
 /*                                                                   */09380049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0241    */09390049
 /*                    TO THE COMMAREA FIELDS.                        */09400049
 /*                                                                   */09410049
 /*********************************************************************/09420049
0RCBCS4M_MOVE_PI_CTR: PROC;                                             09430049
                                                                        09440049
 WRK_CTR_IND = TRUE;                                                    09450049
                                                                        09460049
 EDQBSDS.QCUOHVP = TB_RCBV241.HVP_QUANTITY;                             09470049
                                                                        09480049
 EDQBSDS.SRCCCMD.TAKE_CEDS = 'Y';                                       09490049
                                                                        09500049
 IF TB_RCBV051.WARRANTY_EXP_DATE ¬= '' THEN            /* SOC RB01288 */09510049
   DO;                                                 /* EOC RB01288 */09520049
      IF DATE10 > TB_RCBV051.WARRANTY_EXP_DATE                          09530049
       | SUBSTR(TB_RCBV051.CUSTOMER_NUMBER,1,2) = 'CI' THEN             09540049
       DO;                                                              09550049
         IF TB_RCBV051.TYPE_OF_MAINT = 'G' THEN      /* SOC : RB01278 */09560049
            EDQBSDS.SRCCCMD.CHSISTM  = TB_RCBV051.TYPE_OF_MAINT;        09570049
         ELSE                                        /* EOC : RB01278 */09580049
            EDQBSDS.SRCCCMD.CHSISTM  = '2';                             09590049
       END;                                                             09600049
   END;                                                    /* RB01288 */09610049
                                                   /*SOC CEDS00000438 */09620049
                                                        /* SOC RB01281*/09630049
 /*IF (TB_RCBV051.F_TYPE_OF_WARRANTY ¬= '' &                            09640049
      TB_RCBV051.WARRANTY_SPLT_DATE ¬= '' &                             09650049
      TB_RCBV051.TYPE_OF_WARRANTY   ¬= TB_RCBV051.F_TYPE_OF_WARRANTY)   09660049
    THEN                                                                09670049
   DO;                                                                  09680049
     IF (DATE10  >  TB_RCBV051.WARRANTY_SPLT_DATE &                     09690049
         DATE10  <= TB_RCBV051.WARRANTY_EXP_DATE)                       09700049
       THEN                                                             09710049
                                                                        09720049
         EDQBSDS.SRCCCMD.CHSISTM = TB_RCBV051.F_TYPE_OF_WARRANTY;       09730049
   END;                                                            */   09740049
                                                     /* EOC RB01281*/   09750049
                                                   /*EOC CEDS00000438 */09760049
 IF TB_RCBV241_I.INDNULL(06) = 0 THEN                                   09770049
   EDQBSDS.SRCCCMD.IAGRNBR = TB_RCBV241.CONTRACT_NUMBER;                09780049
                                                                        09790049
 IF TB_RCBV241_I.INDNULL(07) = 0 THEN                                   09800049
   EDQBSDS.SRCCCMD.RHSIESA(1).IHSIESA = TB_RCBV241.SERVICE_MODULE_1;    09810049
                                                                        09820049
 IF TB_RCBV241_I.INDNULL(08) = 0 THEN                                   09830049
   EDQBSDS.SRCCCMD.RHSIESA(2).IHSIESA = TB_RCBV241.SERVICE_MODULE_2;    09840049
                                                                        09850049
 IF TB_RCBV241_I.INDNULL(09) = 0 THEN                                   09860049
   EDQBSDS.SRCCCMD.RHSIESA(3).IHSIESA = TB_RCBV241.SERVICE_MODULE_3;    09870049
                                                                        09880049
 IF TB_RCBV241_I.INDNULL(10) = 0 THEN                                   09890049
   EDQBSDS.SRCCCMD.RHSIESA(4).IHSIESA = TB_RCBV241.SERVICE_MODULE_4;    09900049
                                                                        09910049
 IF TB_RCBV241_I.INDNULL(11) = 0 THEN                                   09920049
   EDQBSDS.SRCCCMD.RHSIESA(5).IHSIESA = TB_RCBV241.SERVICE_MODULE_5;    09930049
                                                                        09940049
 IF TB_RCBV241_I.INDNULL(12) = 0 THEN                                   09950049
   EDQBSDS.SRCCCMD.RAGRWCP(1).DAGRMFR =                                 09960049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_1);09970049
                                                                        09980049
 IF TB_RCBV241_I.INDNULL(13) = 0 THEN                                   09990049
   EDQBSDS.SRCCCMD.RAGRWCP(1).DAGRMTO =                                 10000049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_1);  10010049
                                                                        10020049
 IF TB_RCBV241_I.INDNULL(14) = 0 THEN                                   10030049
   EDQBSDS.SRCCCMD.RAGRWCP(2).DAGRMFR =                                 10040049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_2);10050049
                                                                        10060049
 IF TB_RCBV241_I.INDNULL(15) = 0 THEN                                   10070049
   EDQBSDS.SRCCCMD.RAGRWCP(2).DAGRMTO =                                 10080049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_2);  10090049
                                                                        10100049
 IF TB_RCBV241_I.INDNULL(16) = 0 THEN                                   10110049
   EDQBSDS.SRCCCMD.RAGRWCP(3).DAGRMFR =                                 10120049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_3);10130049
                                                                        10140049
 IF TB_RCBV241_I.INDNULL(17) = 0 THEN                                   10150049
   EDQBSDS.SRCCCMD.RAGRWCP(3).DAGRMTO =                                 10160049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_3);  10170049
                                                                        10180049
 IF TB_RCBV241_I.INDNULL(18) = 0 THEN                                   10190049
   EDQBSDS.SRCCCMD.RAGRWCP(4).DAGRMFR =                                 10200049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_4);10210049
                                                                        10220049
 IF TB_RCBV241_I.INDNULL(19) = 0 THEN                                   10230049
   EDQBSDS.SRCCCMD.RAGRWCP(4).DAGRMTO =                                 10240049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_4);  10250049
                                                                        10260049
 IF TB_RCBV241_I.INDNULL(20) = 0 THEN                                   10270049
   EDQBSDS.SRCCCMD.RAGRWCP(5).DAGRMFR =                                 10280049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_5);10290049
                                                                        10300049
 IF TB_RCBV241_I.INDNULL(21) = 0 THEN                                   10310049
   EDQBSDS.SRCCCMD.RAGRWCP(5).DAGRMTO =                                 10320049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_5);  10330049
                                                                        10340049
 IF TB_RCBV241_I.INDNULL(22) = 0 THEN                                   10350049
   EDQBSDS.SRCCCMD.RAGRWCP(6).DAGRMFR =                                 10360049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_6);10370049
                                                                        10380049
 IF TB_RCBV241_I.INDNULL(23) = 0 THEN                                   10390049
   EDQBSDS.SRCCCMD.RAGRWCP(6).DAGRMTO =                                 10400049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_6);  10410049
                                                                        10420049
 IF TB_RCBV241_I.INDNULL(24) = 0 THEN                                   10430049
   EDQBSDS.SRCCCMD.RAGRWCP(7).DAGRMFR =                                 10440049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_START_7);10450049
                                                                        10460049
 IF TB_RCBV241_I.INDNULL(25) = 0 THEN                                   10470049
   EDQBSDS.SRCCCMD.RAGRWCP(7).DAGRMTO =                                 10480049
                           R012_TRANS_TIME(TB_RCBV241.COVERAGE_END_7);  10490049
                                                                        10500049
 /* EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD =  TB_RCBV241.SERVICE_TYPE;   */ 10510049
                                                          /* RB01299 */ 10520049
                                                                        10530049
 IF TB_RCBV241_I.INDNULL(27) = 0 THEN                                   10540049
   EDQBSDS.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV241.SERVICE_LVL_CODE;      10550049
                                                                        10560049
 IF TB_RCBV241_I.INDNULL(28) = 0 THEN                                   10570049
   EDQBSDS.SRCCCMD.IAGRTCN = TB_RCBV241.AUTHORISATION_CODE;             10580049
                                                                        10590049
 EDQBSDS.SRCCCMD.SSRCIND = TB_RCBV241.SOURCE_INDICATOR;                 10600049
                                                                        10610049
 EDQBSDS.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV241.EFFECTIVE_DATE,1,4) ||     10620049
                           SUBSTR(TB_RCBV241.EFFECTIVE_DATE,6,2) ||     10630049
                           SUBSTR(TB_RCBV241.EFFECTIVE_DATE,9,2);       10640049
                                                                        10650049
 EDQBSDS.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV241.END_DATE,1,4) ||           10660049
                           SUBSTR(TB_RCBV241.END_DATE,6,2) ||           10670049
                           SUBSTR(TB_RCBV241.END_DATE,9,2);             10680049
                                                                        10690049
 IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(14) = 0 THEN                  10700049
   DO;                                                                  10710049
     EDQBSDS.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV400.SERVICE_LVL_CODE_1;  10720049
     EDQBSDS.DAGREWP = SUBSTR(TB_RCBV241.END_DATE,1,4) ||               10730049
                       SUBSTR(TB_RCBV241.END_DATE,6,2) ||               10740049
                       SUBSTR(TB_RCBV241.END_DATE,9,2);                 10750049
     WRK_CTR_IND = FALSE;                                               10760049
     CALL RCBCS4M_READ_SERV_COND(TB_RCBV400.SERVICE_LVL_CODE_1);        10770049
                                                                        10780049
   END;                                                                 10790049
 ELSE                                                                   10800049
   DO;                                                                  10810049
     IF EDQBSDS.SRCCCMD.SSRCIND = 'S' THEN                              10820049
       DO;                                                              10830049
         IF TB_RCBV241_I.INDNULL(27) = 0 THEN                           10840049
           CALL RCBCS4M_READ_SERV_COND (TB_RCBV241.SERVICE_LVL_CODE);   10850049
       END;                                                             10860049
     IF EDQBSDS.SRCCCMD.SSRCIND = 'P' THEN                              10870049
       CALL RCBCS4M_READ_TRANS_PEW;                                     10880049
     IF TB_RCBV241.CONTRACT_NUMBER = '61P7319'                          10890049
     |  TB_RCBV241.CONTRACT_NUMBER = '61P7320'                          10900049
     |  TB_RCBV241.CONTRACT_NUMBER = '61P7323'                          10910049
     |  TB_RCBV241.CONTRACT_NUMBER = '61P7324' THEN                     10920049
       CALL RCBCS4M_READ_PI_SERV;                                       10930049
   END;                                                                 10940049
                                                                        10950049
                                                      /* SOC RB01299 */ 10960049
 IF EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD = '' THEN                        10970049
   DO;                                                                  10980049
     EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD =  TB_RCBV241.SERVICE_TYPE;     10990049
   END;                                                                 11000049
                                                      /* EOC RB01299 */ 11010049
 /* FOR PI CONTRACTS, SERVICE EXT WILL BE SPACES    SOC CEDS00000365 */ 11020049
  EDQBSDS.SERV_EXTENSION = '';                    /*EOC CEDS00000365 */ 11030049
                                                                        11040049
 END RCBCS4M_MOVE_PI_CTR;                                               11050049
1/********************************************************************/ 11060049
 /*                                           /* SOC RB01282         */ 11070049
 /* MODULE NAME      : RCBCS4M_MOVE_TRANS_SDF                        */ 11080049
 /*                                                                  */ 11090049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0650   */ 11100049
 /*                    TO THE COMMAREA FIELDS.                       */ 11110049
 /*                                                                  */ 11120049
 /********************************************************************/ 11130049
0RCBCS4M_MOVE_TRANS_SDF: PROC;                                          11140049
                                                                        11150049
  IF TB_RCBV650_I.INDNULL(13)  = 0    THEN             /*CEDS00000403*/ 11160049
    EDQBSDS.SERV_EXTENSION = TB_RCBV650.SERVICE_EXTENSION;              11170049
  ELSE                                                 /*CEDS00000403*/ 11180049
    EDQBSDS.SERV_EXTENSION = '';                       /*CEDS00000403*/ 11190049
                                                                        11200049
 END RCBCS4M_MOVE_TRANS_SDF;                  /* EOC RB01282 */         11210049
1/*********************************************************************/11220049
 /*                                                                   */11230049
 /* MODULE NAME      : RCBCS4M_READ_PI_SERV                           */11240049
 /*                                                                   */11250049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0211    */11260049
 /*                                                                   */11270049
 /*                                                                   */11280049
 /*********************************************************************/11290049
0RCBCS4M_READ_PI_SERV : PROC;                                           11300049
                                                                        11310049
0EXEC SQL                                                               11320049
      SELECT QTY_MU_CONTRACTED                                          11330049
       INTO :TB_RCBV211.QTY_MU_CONTRACTED                               11340049
            :WRK_INDNULL                                                11350049
      FROM   RCBV0211_PI_SERV T211                                      11360049
      WHERE  T211.COUNTRY_NUMBER  = :REFCTRY                            11370049
        AND  T211.CONTRACT_NUMBER = :TB_RCBV241.CONTRACT_NUMBER         11380049
        AND  T211.CUSTOMER_NUMBER = :TB_RCBV051.CUSTOMER_NUMBER         11390049
        AND  :DATE10        BETWEEN T211.EFFECTIVE_DATE                 11400049
                                AND T211.END_DATE                       11410049
      WITH UR;                                                          11420049
                                                                        11430049
 SELECT(SQLCA.SQLCODE);                                                 11440049
   WHEN(0)                                                              11450049
     SELECT (TB_RCBV211.QTY_MU_CONTRACTED);                             11460049
       WHEN(0);                                                         11470049
       WHEN(1)                                                          11480049
         EDQBSDS.SRCCCMD.DESCRIPTION = '1 ACCIDENTAL DAMAGE CLAIM USED '11490049
                                     || EDQBSDS.SRCCCMD.DESCRIPTION;    11500049
       WHEN(2)                                                          11510049
         EDQBSDS.SRCCCMD.DESCRIPTION =                                  11520049
         'BOTH ACCIDENTAL DAMAGE CLAIMS USED-CHARGEABLE CALL';          11530049
       OTHERWISE;                                                       11540049
     END;                                                               11550049
   WHEN(100);                                                           11560049
   OTHERWISE                                                            11570049
     DO;                                                                11580049
       RCBCQES.MESSAGE_NUMBER = 'C215';                                 11590049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     11600049
       WRK_TABLE = 'RCBT0211_PI_SERV';                                  11610049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 11620049
     END;                                                               11630049
 END;                                                                   11640049
 END RCBCS4M_READ_PI_SERV;                                              11650049
1/*********************************************************************/11660049
 /*                                                                   */11670049
 /* MODULE NAME      : RCBCS4M_READ_SERV_COND                         */11680049
 /*                                                                   */11690049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0470/475*/11700049
 /*                                                                   */11710049
 /*                                                                   */11720049
 /*********************************************************************/11730049
0RCBCS4M_READ_SERV_COND: PROC (SLC);                                    11740049
                                                                        11750049
 DCL SLC      CHAR(03);                                                 11760049
                                                                        11770049
 TB_RCBV470               = '';                                         11780049
 TB_RCBV470_I.INDNULL(*)  = 0;                                          11790049
 TB_RCBV470.SERVICE_LVL_CODE = SLC;                                     11800049
                                                                        11810049
 CALL RCBISRN (ADDR(TB_RCBV470),                                        11820049
               ADDR(TB_RCBV470_I),                                      11830049
               ADDR(RETURN_AREA_BB),                                    11840049
               REFCTRY);                                                11850049
                                                                        11860049
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   11870049
 WHEN (0)                                                               11880049
   DO;                                                                  11890049
     CALL RCBCS4M_MOVE_SERV_COND;                                       11900049
   END;                                                                 11910049
 OTHERWISE                                                              11920049
   DO;                                                                  11930049
     RCBCQES.MESSAGE_NUMBER = 'C216';                                   11940049
     WRK_SQLCODE = SQLCA_R.SQLCODE;                                     11950049
     WRK_TABLE = 'RCBV0470_SERV_COND';                                  11960049
     CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                   11970049
   END;                                                                 11980049
 END;                                                                   11990049
                                                                        12000049
 END RCBCS4M_READ_SERV_COND;                                            12010049
1/*********************************************************************/12020049
 /*                                                                   */12030049
 /* MODULE NAME      : RCBCS4M_MOVE_SERV_COND                         */12040049
 /*                                                                   */12050049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0470/475*/12060049
 /*                    TO THE COMMAREA FIELDS.                        */12070049
 /*                                                                   */12080049
 /*********************************************************************/12090049
0RCBCS4M_MOVE_SERV_COND : PROC;                                         12100049
                                                                        12110049
 IF WRK_CTR_IND = FALSE THEN                                            12120049
   DO;                                                                  12130049
     IF TB_RCBV470_I.INDNULL(02) = 0 THEN                               12140049
       EDQBSDS.SRCCCMD.RAGRWCP(1).DAGRMFR =                             12150049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_1);12160049
                                                                        12170049
     IF TB_RCBV470_I.INDNULL(03) = 0 THEN                               12180049
       EDQBSDS.SRCCCMD.RAGRWCP(1).DAGRMTO =                             12190049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_1);  12200049
                                                                        12210049
     IF TB_RCBV470_I.INDNULL(04) = 0 THEN                               12220049
       EDQBSDS.SRCCCMD.RAGRWCP(2).DAGRMFR =                             12230049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_2);12240049
                                                                        12250049
     IF TB_RCBV470_I.INDNULL(05) = 0 THEN                               12260049
       EDQBSDS.SRCCCMD.RAGRWCP(2).DAGRMTO =                             12270049
                            R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_2); 12280049
                                                                        12290049
     IF TB_RCBV470_I.INDNULL(06) = 0 THEN                               12300049
       EDQBSDS.SRCCCMD.RAGRWCP(3).DAGRMFR =                             12310049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_3);12320049
                                                                        12330049
     IF TB_RCBV470_I.INDNULL(07) = 0 THEN                               12340049
       EDQBSDS.SRCCCMD.RAGRWCP(3).DAGRMTO =                             12350049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_3);  12360049
                                                                        12370049
     IF TB_RCBV470_I.INDNULL(08) = 0 THEN                               12380049
       EDQBSDS.SRCCCMD.RAGRWCP(4).DAGRMFR =                             12390049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_4);12400049
                                                                        12410049
     IF TB_RCBV470_I.INDNULL(09) = 0 THEN                               12420049
       EDQBSDS.SRCCCMD.RAGRWCP(4).DAGRMTO =                             12430049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_4);  12440049
                                                                        12450049
     IF TB_RCBV470_I.INDNULL(10) = 0 THEN                               12460049
       EDQBSDS.SRCCCMD.RAGRWCP(5).DAGRMFR =                             12470049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_5);12480049
                                                                        12490049
     IF TB_RCBV470_I.INDNULL(11) = 0 THEN                               12500049
       EDQBSDS.SRCCCMD.RAGRWCP(5).DAGRMTO =                             12510049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_5);  12520049
                                                                        12530049
     IF TB_RCBV470_I.INDNULL(12) = 0 THEN                               12540049
       EDQBSDS.SRCCCMD.RAGRWCP(6).DAGRMFR =                             12550049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_6);12560049
                                                                        12570049
     IF TB_RCBV470_I.INDNULL(13) = 0 THEN                               12580049
       EDQBSDS.SRCCCMD.RAGRWCP(6).DAGRMTO =                             12590049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_6);  12600049
                                                                        12610049
     IF TB_RCBV470_I.INDNULL(14) = 0 THEN                               12620049
       EDQBSDS.SRCCCMD.RAGRWCP(7).DAGRMFR =                             12630049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_7);12640049
                                                                        12650049
     IF TB_RCBV470_I.INDNULL(15) = 0 THEN                               12660049
       EDQBSDS.SRCCCMD.RAGRWCP(7).DAGRMTO =                             12670049
                           R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_7);  12680049
   END;                                                                 12690049
                                                                        12700049
                                                      /* SOC RB01299 */ 12710049
 /* IF TB_RCBV470_I.INDNULL(16) = 0                                     12720049
 &  EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD = '' THEN */                     12730049
 IF TB_RCBV470_I.INDNULL(16) = 0 THEN                 /* ECO RB01299 */ 12740049
   EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD = TB_RCBV470.SERVICE_DLVR_METHD;  12750049
                                                                        12760049
 IF TB_RCBV470_I.INDNULL(17) = 0 THEN                                   12770049
   EDQBSDS.SRCCCMD.TIMEZERO = TB_RCBV470.TIME_ZERO_IND;                 12780049
                                                                        12790049
 EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'N';                                 12800049
                                                                        12810049
 IF TB_RCBV470_I.INDNULL(18) = 0                                        12820049
 THEN DO;                                                               12830049
   EDQBSDS.CBK_TIMESPAN_QTY(1)  = TB_RCBV470.CONTACT_TIME_QTY_1;        12840049
   EDQBSDS.CBK_TIMESPAN_UNIT(1) = TB_RCBV470.CONTACT_TIME_UNT_1;        12850049
   EDQBSDS.CBK_TIMESPAN_COM(1)  = TB_RCBV470.CONTACT_TIME_COM_1;        12860049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               12870049
 END;                                                                   12880049
 IF TB_RCBV470_I.INDNULL(21) = 0                                        12890049
 THEN DO;                                                               12900049
   EDQBSDS.CBK_TIMESPAN_QTY(2)  = TB_RCBV470.CONTACT_TIME_QTY_2;        12910049
   EDQBSDS.CBK_TIMESPAN_UNIT(2) = TB_RCBV470.CONTACT_TIME_UNT_2;        12920049
   EDQBSDS.CBK_TIMESPAN_COM(2)  = TB_RCBV470.CONTACT_TIME_COM_2;        12930049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               12940049
 END;                                                                   12950049
 IF TB_RCBV470_I.INDNULL(24) = 0                                        12960049
 THEN DO;                                                               12970049
   EDQBSDS.CBK_TIMESPAN_QTY(3)  = TB_RCBV470.CONTACT_TIME_QTY_3;        12980049
   EDQBSDS.CBK_TIMESPAN_UNIT(3) = TB_RCBV470.CONTACT_TIME_UNT_3;        12990049
   EDQBSDS.CBK_TIMESPAN_COM(3)  = TB_RCBV470.CONTACT_TIME_COM_3;        13000049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13010049
 END;                                                                   13020049
 IF TB_RCBV470_I.INDNULL(27) = 0                                        13030049
 THEN DO;                                                               13040049
   EDQBSDS.TAT_TIMESPAN_QTY(1)  = TB_RCBV470.ONSITE_RESP_QTY_1;         13050049
   EDQBSDS.TAT_TIMESPAN_UNIT(1) = TB_RCBV470.ONSITE_RESP_UNT_1;         13060049
   EDQBSDS.TAT_TIMESPAN_COM(1)  = TB_RCBV470.ONSITE_RESP_COM_1;         13070049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13080049
 END;                                                                   13090049
 IF TB_RCBV470_I.INDNULL(30) = 0                                        13100049
 THEN DO;                                                               13110049
   EDQBSDS.TAT_TIMESPAN_QTY(2)  = TB_RCBV470.ONSITE_RESP_QTY_2;         13120049
   EDQBSDS.TAT_TIMESPAN_UNIT(2) = TB_RCBV470.ONSITE_RESP_UNT_2;         13130049
   EDQBSDS.TAT_TIMESPAN_COM(2)  = TB_RCBV470.ONSITE_RESP_COM_2;         13140049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13150049
 END;                                                                   13160049
 IF TB_RCBV470_I.INDNULL(33) = 0                                        13170049
 THEN DO;                                                               13180049
   EDQBSDS.TAT_TIMESPAN_QTY(3)  = TB_RCBV470.ONSITE_RESP_QTY_3;         13190049
   EDQBSDS.TAT_TIMESPAN_UNIT(3) = TB_RCBV470.ONSITE_RESP_UNT_3;         13200049
   EDQBSDS.TAT_TIMESPAN_COM(3)  = TB_RCBV470.ONSITE_RESP_COM_3;         13210049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13220049
 END;                                                                   13230049
 IF TB_RCBV470_I.INDNULL(36) = 0                                        13240049
 THEN DO;                                                               13250049
   EDQBSDS.FIX_TIMESPAN_QTY(1)  = TB_RCBV470.FIX_TIME_QTY_1;            13260049
   EDQBSDS.FIX_TIMESPAN_UNIT(1) = TB_RCBV470.FIX_TIME_UNT_1;            13270049
   EDQBSDS.FIX_TIMESPAN_COM(1)  = TB_RCBV470.FIX_TIME_COM_1;            13280049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13290049
 END;                                                                   13300049
 IF TB_RCBV470_I.INDNULL(39) = 0                                        13310049
 THEN DO;                                                               13320049
   EDQBSDS.FIX_TIMESPAN_QTY(2)  = TB_RCBV470.FIX_TIME_QTY_2;            13330049
   EDQBSDS.FIX_TIMESPAN_UNIT(2) = TB_RCBV470.FIX_TIME_UNT_2;            13340049
   EDQBSDS.FIX_TIMESPAN_COM(2)  = TB_RCBV470.FIX_TIME_COM_2;            13350049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13360049
 END;                                                                   13370049
 IF TB_RCBV470_I.INDNULL(42) = 0                                        13380049
 THEN DO;                                                               13390049
   EDQBSDS.FIX_TIMESPAN_QTY(3)  = TB_RCBV470.FIX_TIME_QTY_3;            13400049
   EDQBSDS.FIX_TIMESPAN_UNIT(3) = TB_RCBV470.FIX_TIME_UNT_3;            13410049
   EDQBSDS.FIX_TIMESPAN_COM(3)  = TB_RCBV470.FIX_TIME_COM_3;            13420049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13430049
 END;                                                                   13440049
 IF TB_RCBV470_I.INDNULL(45) = 0                                        13450049
 THEN DO;                                                               13460049
   EDQBSDS.CTY_TIMESPAN_QTY(1)  = TB_RCBV470.TURN_AROUND_QTY_1;         13470049
   EDQBSDS.CTY_TIMESPAN_UNIT(1) = TB_RCBV470.TURN_AROUND_UNT_1;         13480049
   EDQBSDS.CTY_TIMESPAN_COM(1)  = TB_RCBV470.TURN_AROUND_COM_1;         13490049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13500049
 END;                                                                   13510049
 IF TB_RCBV470_I.INDNULL(48) = 0                                        13520049
 THEN DO;                                                               13530049
   EDQBSDS.CTY_TIMESPAN_QTY(2)  = TB_RCBV470.TURN_AROUND_QTY_2;         13540049
   EDQBSDS.CTY_TIMESPAN_UNIT(2) = TB_RCBV470.TURN_AROUND_UNT_2;         13550049
   EDQBSDS.CTY_TIMESPAN_COM(2)  = TB_RCBV470.TURN_AROUND_COM_2;         13560049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13570049
 END;                                                                   13580049
 IF TB_RCBV470_I.INDNULL(51) = 0                                        13590049
 THEN DO;                                                               13600049
   EDQBSDS.CTY_TIMESPAN_QTY(3)  = TB_RCBV470.TURN_AROUND_QTY_3;         13610049
   EDQBSDS.CTY_TIMESPAN_UNIT(3) = TB_RCBV470.TURN_AROUND_UNT_3;         13620049
   EDQBSDS.CTY_TIMESPAN_COM(3)  = TB_RCBV470.TURN_AROUND_COM_3;         13630049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13640049
 END;                                                                   13650049
 IF TB_RCBV470_I.INDNULL(54) = 0                                        13660049
 THEN DO;                                                               13670049
   EDQBSDS.ONS_TIMESPAN_QTY(1)  = TB_RCBV470.PRT_ONS_TIME_QTY_1;        13680049
   EDQBSDS.ONS_TIMESPAN_UNIT(1) = TB_RCBV470.PRT_ONS_TIME_UNT_1;        13690049
   EDQBSDS.ONS_TIMESPAN_COM(1)  = TB_RCBV470.PRT_ONS_TIME_COM_1;        13700049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13710049
 END;                                                                   13720049
 IF TB_RCBV470_I.INDNULL(57) = 0                                        13730049
 THEN DO;                                                               13740049
   EDQBSDS.ONS_TIMESPAN_QTY(2)  = TB_RCBV470.PRT_ONS_TIME_QTY_2;        13750049
   EDQBSDS.ONS_TIMESPAN_UNIT(2) = TB_RCBV470.PRT_ONS_TIME_UNT_2;        13760049
   EDQBSDS.ONS_TIMESPAN_COM(2)  = TB_RCBV470.PRT_ONS_TIME_COM_2;        13770049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13780049
 END;                                                                   13790049
 IF TB_RCBV470_I.INDNULL(60) = 0                                        13800049
 THEN DO;                                                               13810049
   EDQBSDS.ONS_TIMESPAN_QTY(3)  = TB_RCBV470.PRT_ONS_TIME_QTY_3;        13820049
   EDQBSDS.ONS_TIMESPAN_UNIT(3) = TB_RCBV470.PRT_ONS_TIME_UNT_3;        13830049
   EDQBSDS.ONS_TIMESPAN_COM(3)  = TB_RCBV470.PRT_ONS_TIME_COM_3;        13840049
   EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                               13850049
 END;                                                                   13860049
                                                                        13870049
 IF TB_RCBV470_I.INDNULL(63) = 0 THEN                                   13880049
   EDQBSDS.SRCCCMD.DESCRIPTION = TB_RCBV470.COMMENT_TEXT;               13890049
                                                                        13900049
 EDQBSDS.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV470.SERVICE_LVL_CODE;        13910049
                                                                        13920049
 END RCBCS4M_MOVE_SERV_COND;                                            13930049
1/*********************************************************************/13940049
 /*                                                                   */13950049
 /* MODULE NAME      : RCBCS4M_READ_TRANS_PEW                         */13960049
 /*                                                                   */13970049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0680    */13980049
 /*                                                                   */13990049
 /*                                                                   */14000049
 /*********************************************************************/14010049
0RCBCS4M_READ_TRANS_PEW: PROC;                                          14020049
                                                                        14030049
 EXEC SQL                                                               14040049
      SELECT SDF ,                                                      14050049
             TOT_MONTHS ,                                               14060049
             PHASE ,                                                    14070049
             PHASE_DURATION ,                                           14080049
             SERVICE_DELIV ,                                            14090049
             WARR_MAINT_UPG ,                                           14100049
             LABOR_FLAG ,                                               14110049
             TRAVEL_FLAG ,                                              14120049
             PARTS_FLAG ,                                               14130049
             HC_MONTHS ,                                                14140049
             COVERAGE_HOURS ,                                           14150049
             COVERAGE_DAYS ,                                            14160049
             COVERAGE_MONTHS,                                           14170049
             RESPONSE_TIME ,                                            14180049
             RESPONSE_IND ,                                             14190049
             SDF_DESC ,                                                 14200049
             MON_START,                                                 14210049
             MON_STOP ,                                                 14220049
             TUE_START,                                                 14230049
             TUE_STOP ,                                                 14240049
             WED_START,                                                 14250049
             WED_STOP ,                                                 14260049
             THU_START,                                                 14270049
             THU_STOP ,                                                 14280049
             FRI_START,                                                 14290049
             FRI_STOP ,                                                 14300049
             SAT_START,                                                 14310049
             SAT_STOP ,                                                 14320049
             SUN_START,                                                 14330049
             SUN_STOP                                                   14340049
        INTO :TB_RCBV680                                                14350049
             :TB_RCBV680_I.INDNULL                                      14360049
        FROM RCBV0680_TRANS_PEW  T680                                   14370049
       WHERE T680.SDF = :TB_RCBV051.SERVICE_DELIV_FLAG                  14380049
         AND T680.PHASE = '1'                                           14390049
        WITH UR;                                                        14400049
                                                                        14410049
 SELECT(SQLCA.SQLCODE);                                                 14420049
   WHEN(0)                                                              14430049
     CALL RCBCS4M_MOVE_TRANS_PEW;                                       14440049
   WHEN(100);                                                           14450049
   OTHERWISE                                                            14460049
     DO;                                                                14470049
       RCBCQES.MESSAGE_NUMBER = 'C217';                                 14480049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     14490049
       WRK_TABLE = 'RCBV0680_TRANS_PEW';                                14500049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 14510049
     END;                                                               14520049
 END;                                                                   14530049
                                                                        14540049
 END RCBCS4M_READ_TRANS_PEW;                                            14550049
1/*********************************************************************/14560049
 /*                                                                   */14570049
 /* MODULE NAME      : RCBCS4M_MOVE_TRANS_PEW                         */14580049
 /*                                                                   */14590049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0680    */14600049
 /*                    TO THE COMMAREA FIELDS.                        */14610049
 /*                                                                   */14620049
 /*********************************************************************/14630049
0RCBCS4M_MOVE_TRANS_PEW : PROC;                                         14640049
                                                                        14650049
 EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD = TB_RCBV680.SERVICE_DELIV;         14660049
                                                                        14670049
 WRK_QTYD = TB_RCBV680.RESPONSE_TIME;                                   14680049
                                                                        14690049
 IF TB_RCBV680.RESPONSE_IND = 'H' THEN                                  14700049
   EDQBSDS.TAT_TIMESPAN_QTY(1) = WRK_QTYH;                              14710049
 ELSE                                                                   14720049
   EDQBSDS.TAT_TIMESPAN_QTY(1) = WRK_QTYD;                              14730049
                                                                        14740049
 EDQBSDS.TAT_TIMESPAN_UNIT(1)  = TB_RCBV680.RESPONSE_IND;               14750049
                                                                        14760049
 EDQBSDS.SRCCCMD.PRES_VALID_FLAG = 'Y';                                 14770049
                                                                        14780049
 EDQBSDS.SRCCCMD.DESCRIPTION = TB_RCBV680.SDF_DESC;                     14790049
                                                                        14800049
 EDQBSDS.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV680.SDF;                     14810049
                                                                        14820049
 END RCBCS4M_MOVE_TRANS_PEW;                                            14830049
1/*********************************************************************/14840049
 /*                                                                   */14850049
 /* MODULE NAME      : RCBCS4M_READ_PI_CUST                           */14860049
 /*                                                                   */14870049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0011    */14880049
 /*                                                                   */14890049
 /*                                                                   */14900049
 /*********************************************************************/14910049
0RCBCS4M_READ_PI_CUST : PROC;                                           14920049
                                                         /*SOC RB01289*/14930049
 IF SWITCH_BAU_FLAG = FALSE THEN                                        14940049
 DO;                                                     /*EOC RB01289*/14950049
 EXEC SQL                                                               14960049
      SELECT COUNTRY_NUMBER    ,                                        14970049
             CUSTOMER_NUMBER   ,                                        14980049
             CUSTOMER_NR_EXTEND,                                        14990049
             CUSTOMER_NAME     ,                                        15000049
             TYPE_OF_CUSTOMER  ,                                        15010049
             ADDRESS_LINE_1    ,                                        15020049
             ADDRESS_LINE_2    ,                                        15030049
             ADDRESS_LINE_3    ,                                        15040049
             ZIP_CODE          ,                                        15050049
             EMBARGO_CODE      ,                                        15060049
             SOURCE_INDICATOR  ,                                        15070049
             LAST_CHANGE_DATE                                           15080049
       INTO :TB_RCBV011                                                 15090049
            :TB_RCBV011_I.INDNULL                                       15100049
      FROM   RCBV0011_PI_CUST  T011                                     15110049
      WHERE  T011.COUNTRY_NUMBER     = :REFCTRY                         15120049
        AND  T011.CUSTOMER_NUMBER    = :TB_RCBV051.CUSTOMER_NUMBER      15130049
        AND  T011.CUSTOMER_NR_EXTEND = :TB_RCBV051.CUSTOMER_NR_EXTEND   15140049
      WITH UR;                                                          15150049
                                                                        15160049
 SELECT(SQLCA.SQLCODE);                                                 15170049
   WHEN(0)                                                              15180049
     CALL RCBCS4M_MOVE_PI_CUST;                                         15190049
   WHEN(100)                                                            15200049
     CALL RCBCS4M_READ_BAU_CUST;                                        15210049
   OTHERWISE                                                            15220049
     DO;                                                                15230049
       RCBCQES.MESSAGE_NUMBER = 'C218';                                 15240049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     15250049
       WRK_TABLE = 'RCBV0011_PI_CUST';                                  15260049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 15270049
     END;                                                               15280049
 END;                                                                   15290049
 END;                                                       /*RB01289*/ 15300049
 ELSE                                                       /*RB01289*/ 15310049
     CALL RCBCS4M_READ_BAU_CUST;                            /*RB01289*/ 15320049
                                                                        15330049
 END RCBCS4M_READ_PI_CUST;                                              15340049
1/*********************************************************************/15350049
 /*                                                                   */15360049
 /* MODULE NAME      : RCBCS4M_MOVE_PI_CUST                           */15370049
 /*                                                                   */15380049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0011    */15390049
 /*                    TO THE COMMAREA FIELDS.                        */15400049
 /*                                                                   */15410049
 /*********************************************************************/15420049
0RCBCS4M_MOVE_PI_CUST : PROC;                                           15430049
                                                                        15440049
 IF TB_RCBV011_I.INDNULL(04) = 0 THEN                                   15450049
   EDQBSDS.NCUSABB = TB_RCBV011.CUSTOMER_NAME;                          15460049
 ELSE                                                  /*CEDS00000403*/ 15470049
   EDQBSDS.NCUSABB = '';                               /*CEDS00000403*/ 15480049
                                                                        15490049
 IF TB_RCBV011_I.INDNULL(05) = 0 THEN                                   15500049
   EDQBSDS.CCUSTOC = TB_RCBV011.TYPE_OF_CUSTOMER;                       15510049
 ELSE                                                  /*CEDS00000403*/ 15520049
   EDQBSDS.CCUSTOC = '';                               /*CEDS00000403*/ 15530049
                                                                        15540049
 IF TB_RCBV011_I.INDNULL(06) = 0 THEN                                   15550049
   EDQBSDS.NCUSSTR = TB_RCBV011.ADDRESS_LINE_1;                         15560049
 ELSE                                                  /*CEDS00000403*/ 15570049
   EDQBSDS.NCUSSTR = '';                               /*CEDS00000403*/ 15580049
                                                                        15590049
 IF TB_RCBV011_I.INDNULL(07) = 0 THEN                                   15600049
   EDQBSDS.ICUSCTY = TB_RCBV011.ADDRESS_LINE_2;                         15610049
 ELSE                                                  /*CEDS00000403*/ 15620049
   EDQBSDS.ICUSCTY = '';                               /*CEDS00000403*/ 15630049
                                                                        15640049
 IF TB_RCBV011_I.INDNULL(08) = 0 THEN                                   15650049
   EDQBSDS.SEDQTEL = TB_RCBV011.ADDRESS_LINE_3;                         15660049
 ELSE                                                  /*CEDS00000403*/ 15670049
   EDQBSDS.SEDQTEL = '';                               /*CEDS00000403*/ 15680049
                                                                        15690049
 IF TB_RCBV011_I.INDNULL(09) = 0 THEN                                   15700049
   EDQBSDS.ICUSGZC = TB_RCBV011.ZIP_CODE;                               15710049
 ELSE                                                  /*CEDS00000403*/ 15720049
   EDQBSDS.ICUSGZC = '';                               /*CEDS00000403*/ 15730049
                                                                        15740049
 IF TB_RCBV011_I.INDNULL(10) = 0 THEN                                   15750049
   EDQBSDS.FCUSEMB = TB_RCBV011.EMBARGO_CODE;                           15760049
 ELSE                                                  /*CEDS00000403*/ 15770049
   EDQBSDS.FCUSEMB = '';                               /*CEDS00000403*/ 15780049
                                                                        15790049
 END RCBCS4M_MOVE_PI_CUST;                                              15800049
1/*********************************************************************/15810049
 /*                                                                   */15820049
 /* MODULE NAME      : RCBCS4M_READ_BAU_CUST                          */15830049
 /*                                                                   */15840049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0190    */15850049
 /*                    AND RCBT0010                                   */15860049
 /*                                                                   */15870049
 /*********************************************************************/15880049
0RCBCS4M_READ_BAU_CUST : PROC;                                          15890049
                                                                        15900049
 WRK_SLCT_BAU_CUST = EDQBSDS.CUSCODE.ICUSHWU;                /*RB01289*/15910049
                                                                        15920049
 EXEC SQL                                                               15930049
     SELECT  T010.CUSTOMER_NAME      ,                                  15940049
             T010.TYPE_OF_CUSTOMER                                      15950049
       INTO :TB_RCBV010.CUSTOMER_NAME      :WRK_INDNULL,                15960049
            :TB_RCBV010.TYPE_OF_CUSTOMER   :WRK_INDNULL                 15970049
       FROM  RCBV0010_CUSTOMER T010                                     15980049
      WHERE  T010.COUNTRY_NUMBER   = :REFCTRY                           15990049
 /* AND T010.CUSTOMER_NUMBER  = :TB_RCBV051.CUSTOMER_NUMBER    RB01289*/16000049
        AND  T010.CUSTOMER_NUMBER  = :WRK_SLCT_BAU_CUST      /*RB01289*/16010049
        AND :DATE10          BETWEEN T010.EFFECTIVE_DATE                16020049
                                 AND T010.END_DATE                      16030049
      WITH UR;                                                          16040049
                                                                        16050049
 SELECT(SQLCA.SQLCODE);                                                 16060049
   WHEN(0)                                                              16070049
     DO;                                                                16080049
       EDQBSDS.NCUSABB = TB_RCBV010.CUSTOMER_NAME;                      16090049
       EDQBSDS.CCUSTOC = TB_RCBV010.TYPE_OF_CUSTOMER;                   16100049
       CALL RCBCS4M_READ_RCB005;                                        16110049
       CALL RCBCS4M_READ_ADDRES1;                           /*RB01289*/ 16120049
     END;                                                               16130049
   WHEN(100);                                                           16140049
   OTHERWISE                                                            16150049
     DO;                                                                16160049
       RCBCQES.MESSAGE_NUMBER = 'C226';                                 16170049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     16180049
       WRK_TABLE = 'RCBV0010_CUSTOMER';                                 16190049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 16200049
     END;                                                               16210049
 END;                                                                   16220049
                                                                        16230049
 EXEC SQL                                                               16240049
     SELECT  T350.EMBARGO_CODE                                          16250049
       INTO :TB_RCBV350.EMBARGO_CODE       :WRK_INDNULL                 16260049
       FROM  RCBV0350_CUST_MOD T350                                     16270049
      WHERE  T350.COUNTRY_NUMBER   = :REFCTRY                           16280049
 /*AND  T350.CUSTOMER_NUMBER  = :TB_RCBV051.CUSTOMER_NUMBER    RB01289*/16290049
        AND  T350.CUSTOMER_NUMBER  = :WRK_SLCT_BAU_CUST      /*RB01289*/16300049
        AND :DATE10          BETWEEN T350.EFFECTIVE_DATE                16310049
                                 AND T350.END_DATE                      16320049
      WITH UR;                                                          16330049
                                                                        16340049
 SELECT(SQLCA.SQLCODE);                                                 16350049
   WHEN(0)                                                              16360049
     EDQBSDS.FCUSEMB = TB_RCBV350.EMBARGO_CODE;                         16370049
   WHEN(100);                                                           16380049
   OTHERWISE                                                            16390049
     DO;                                                                16400049
       RCBCQES.MESSAGE_NUMBER = 'C226';                                 16410049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     16420049
       WRK_TABLE = 'RCBV0350_CUST_MOD';                                 16430049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 16440049
     END;                                                               16450049
 END;                                                                   16460049
                                                                        16470049
 END RCBCS4M_READ_BAU_CUST;                                             16480049
1/*********************************************************************/16490049
 /*                                                                   */16500049
 /* MODULE NAME      : RCBCS4M_READ_RCB005                            */16510049
 /*                                                                   */16520049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0500    */16530049
 /*                                                                   */16540049
 /*                                                                   */16550049
 /*********************************************************************/16560049
0RCBCS4M_READ_RCB005 : PROC;                                            16570049
                                                                        16580049
 TB_RCBV500 = '';                                          /* RB01288 */16590049
                                                                        16600049
 WRK_PARMKEY = REFCTRY || 'A01';                                        16610049
                                                                        16620049
 EXEC SQL                                                               16630049
      SELECT T500.PARAMETER_VALUE                                       16640049
       INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                   16650049
      FROM   RCBV0500_PARM  T500                                        16660049
      WHERE  T500.PARAMETER_NUMBER = 'RCB005'                           16670049
        AND  T500.PARAMETER_KEY    = :WRK_PARMKEY                       16680049
      WITH UR;                                                          16690049
                                                                        16700049
 SELECT(SQLCA.SQLCODE);                                                 16710049
   WHEN(0);                                                             16720049
   WHEN(100);                                                           16730049
   OTHERWISE                                                            16740049
     DO;                                                                16750049
       RCBCQES.MESSAGE_NUMBER = 'C227';                                 16760049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     16770049
       WRK_TABLE = 'RCBV0500_PARM';                                     16780049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 16790049
     END;                                                               16800049
 END;                                                                   16810049
                                                                        16820049
 END RCBCS4M_READ_RCB005;                                               16830049
1/*********************************************************************/16840049
 /*                                                                   */16850049
 /* MODULE NAME      : RCBCS4M_READ_ADDRESS                           */16860049
 /*                                                                   */16870049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0500    */16880049
 /*                    OR RCBT0340                                    */16890049
 /*                                                                   */16900049
 /*********************************************************************/16910049
0RCBCS4M_READ_ADDRESS : PROC;                                           16920049
                                                                        16930049
 IF TB_RCBP05S.ADDRESS_RES = '1' THEN                                   16940049
   DO;                                                                  16950049
     EXEC SQL                                                           16960049
       SELECT ADDRESS_NUMBER,                                           16970049
              CUSTOMER_USER                                             16980049
         INTO :TB_RCBV340.ADDRESS_NUMBER,                               16990049
              :TB_RCBV051.CUSTOMER_NUMBER                               17000049
         FROM RCBV0340_HW_ADDR  T340                                    17010049
        WHERE T340.COUNTRY_NUMBER  = :REFCTRY                           17020049
          AND T340.PRODUCT_TYPE    = :REQTYPE                           17030049
          AND T340.ORIGIN          = :REQORIG                           17040049
          AND T340.SEQUENCE_NUMBER = :REQSEQN                           17050049
          AND :DATE10        BETWEEN T340.EFFECTIVE_DATE                17060049
                                 AND T340.END_DATE                      17070049
         WITH UR                                                        17080049
       ;                                                                17090049
                                                                        17100049
     SELECT(SQLCA.SQLCODE);                                             17110049
       WHEN(0);                                                         17120049
       WHEN(100);                                                       17130049
       OTHERWISE                                                        17140049
         DO;                                                            17150049
           RCBCQES.MESSAGE_NUMBER = 'C228';                             17160049
           WRK_SQLCODE = SQLCA.SQLCODE;                                 17170049
           WRK_TABLE = 'RCBV0340_HW_ADDR';                              17180049
           CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);             17190049
         END;                                                           17200049
     END;                                                               17210049
   END;                                                                 17220049
                                                       /* SOC RB01288 */17230049
 IF SWITCH_READ_BAU_WAR = TRUE THEN                                     17240049
    TB_RCBV051.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;            17250049
                                                       /* EOC RB01288 */17260049
 IF TB_RCBV340.ADDRESS_NUMBER = '' THEN                                 17270049
   DO;                                                                  17280049
     EXEC SQL                                                           17290049
       SELECT MIN(ADDRESS_NUMBER)                                       17300049
         INTO :TB_RCBV340.ADDRESS_NUMBER  :WRK_INDNULL                  17310049
         FROM RCBV0150_CUST_ADDR T150                                   17320049
        WHERE T150.COUNTRY_NUMBER  = :REFCTRY                           17330049
          AND T150.CUSTOMER_NUMBER = :TB_RCBV051.CUSTOMER_NUMBER        17340049
          AND T150.ADDRESS_MASK LIKE '__1%'                             17350049
          AND :DATE10        BETWEEN T150.EFFECTIVE_DATE                17360049
                                 AND T150.END_DATE                      17370049
         WITH UR                                                        17380049
       ;                                                                17390049
     SELECT(SQLCA.SQLCODE);                                             17400049
       WHEN(0);                                                         17410049
       WHEN(100);                                                       17420049
       OTHERWISE                                                        17430049
         DO;                                                            17440049
           RCBCQES.MESSAGE_NUMBER = 'C246';                             17450049
           WRK_SQLCODE = SQLCA.SQLCODE;                                 17460049
           WRK_TABLE = 'RCBV0150_CUST_ADDR';                            17470049
           CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);             17480049
         END;                                                           17490049
     END;                                                               17500049
   END;                                                                 17510049
                                                                        17520049
 EXEC SQL                                                               17530049
   SELECT ADDRESS_NUMBER,                                               17540049
          ZIP_CODE                                                      17550049
     INTO :TB_RCBV150.ADDRESS_NUMBER,                                   17560049
          :TB_RCBV150.ZIP_CODE                                          17570049
     FROM RCBV0150_CUST_ADDR T150                                       17580049
    WHERE T150.COUNTRY_NUMBER  = :REFCTRY                               17590049
      AND T150.CUSTOMER_NUMBER = :TB_RCBV051.CUSTOMER_NUMBER            17600049
      AND T150.ADDRESS_NUMBER  = :TB_RCBV340.ADDRESS_NUMBER             17610049
      AND :DATE10        BETWEEN T150.EFFECTIVE_DATE                    17620049
                             AND T150.END_DATE                          17630049
     WITH UR                                                            17640049
   ;                                                                    17650049
                                                                        17660049
 SELECT(SQLCA.SQLCODE);                                                 17670049
   WHEN(0)                                                              17680049
     EDQBSDS.ICUSGZC = TB_RCBV150.ZIP_CODE;                             17690049
   WHEN(100);                                                           17700049
   OTHERWISE                                                            17710049
     DO;                                                                17720049
       RCBCQES.MESSAGE_NUMBER = 'C229';                                 17730049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     17740049
       WRK_TABLE = 'RCBV0150_CUST_ADDR';                                17750049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 17760049
     END;                                                               17770049
 END;                                                                   17780049
                                                                        17790049
 EXEC SQL                              /* INIT CURSOR ADDR_CURSOR    */ 17800049
      OPEN ADDR_CURSOR;                                                 17810049
                                                                        17820049
 SELECT(SQLCA.SQLCODE);                                                 17830049
   WHEN (0);                                                            17840049
   OTHERWISE                                                            17850049
     DO;                                                                17860049
       RCBCQES.MESSAGE_NUMBER = 'C230';                                 17870049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     17880049
       WRK_TABLE = 'ADDR_CURSOR';                                       17890049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 17900049
     END;                                                               17910049
 END;                                                                   17920049
                                                                        17930049
 CALL RCBCS4M_READ_ADDR_LINE;                                           17940049
                                                                        17950049
 DO I = 1 TO 9 WHILE (¬SWITCH_EOC_ADDR);                                17960049
   USER_EXTRA_INFO.ADDR_LINES(I) = TB_RCBV280.TEXT;                     17970049
   CALL RCBCS4M_READ_ADDR_LINE;                                         17980049
 END;                                                                   17990049
                                                                        18000049
 EXEC SQL                                                               18010049
      CLOSE ADDR_CURSOR;                                                18020049
                                                                        18030049
 SELECT(SQLCA.SQLCODE);                                                 18040049
   WHEN (0);                                                            18050049
   OTHERWISE                                                            18060049
     DO;                                                                18070049
       RCBCQES.MESSAGE_NUMBER = 'C232';                                 18080049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     18090049
       WRK_TABLE = 'ADDR_CURSOR';                                       18100049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 18110049
     END;                                                               18120049
 END;                                                                   18130049
                                                                        18140049
 USER_FILE_RCBDRF1.CUNOUSE = EDQBSDS.SRCCCMD.ICUSHWU;                   18150049
 USER_FILE_RCBDRF1.IODPDBU = EDQBSDS.SRCCCMD.IODPDBU;                   18160049
 USER_FILE_RCBDRF1.ICUSANO = EDQBSDS.CUSCODE.ICUSANO;                   18170049
 USER_FILE_RCBDRF1.CUNAME  = EDQBSDS.NCUSABB;                           18180049
 USER_FILE_RCBDRF1.NCUSSTR = EDQBSDS.NCUSSTR;                           18190049
 USER_FILE_RCBDRF1.ICUSCTY = EDQBSDS.ICUSCTY;                           18200049
 USER_FILE_RCBDRF1.ICUS3AD = EDQBSDS.SEDQTEL;                           18210049
 USER_FILE_RCBDRF1.ICUSGZC = EDQBSDS.ICUSGZC;                           18220049
 USER_FILE_RCBDRF1.UDTEUEX = EDQBSDS.UDTEUEX;                           18230049
 USER_FILE_RCBDRF1.UDTECUF = EDQBSDS.UDTECUF;                           18240049
 USER_FILE_RCBDRF1.AAS_ADD = TB_RCBV150.ADDRESS_NUMBER;                 18250049
 USER_FILE_RCBDRF1.FCUSEMB = EDQBSDS.FCUSEMB;                           18260049
 USER_FILE_RCBDRF1.CCUSTOC = EDQBSDS.CCUSTOC;                           18270049
                                                                        18280049
 CALL RCBDR4U (ADDR(SWITCH_USER_EXIT),                                  18290049
               ADDR(DATA_ORIGIN),                                       18300049
               ADDR(USER_FILE_RCBDRF1),                                 18310049
               ADDR(USER_FILE_PI),                                      18320049
               ADDR(USER_EXTRA_INFO),                                   18330049
               PTR_INT_AREA);                                           18340049
                                                                        18350049
 IF SWITCH_USER_EXIT = TRUE THEN                                        18360049
   DO;                                                                  18370049
     EDQBSDS.SRCCCMD.IODPDBU   = USER_FILE_RCBDRF1.IODPDBU;             18380049
     EDQBSDS.CUSCODE.ICUSANO   = USER_FILE_RCBDRF1.ICUSANO;             18390049
     EDQBSDS.NCUSSTR           = USER_FILE_RCBDRF1.NCUSSTR;             18400049
     EDQBSDS.ICUSCTY           = USER_FILE_RCBDRF1.ICUSCTY;             18410049
     EDQBSDS.SEDQTEL           = USER_FILE_RCBDRF1.ICUS3AD;             18420049
     EDQBSDS.ICUSGZC           = USER_FILE_RCBDRF1.ICUSGZC;             18430049
     EDQBSDS.UDTEUEX           = USER_FILE_RCBDRF1.UDTEUEX;             18440049
     EDQBSDS.UDTECUF           = USER_FILE_RCBDRF1.UDTECUF;             18450049
     EDQBSDS.FCUSEMB           = USER_FILE_RCBDRF1.FCUSEMB;             18460049
     EDQBSDS.CCUSTOC           = USER_FILE_RCBDRF1.CCUSTOC;             18470049
   END;                                                                 18480049
 ELSE                                                                   18490049
   DO;                                                                  18500049
     EDQBSDS.NCUSSTR = USER_EXTRA_INFO.ADDR_LINES(1);                   18510049
     EDQBSDS.ICUSCTY = USER_EXTRA_INFO.ADDR_LINES(2);                   18520049
     EDQBSDS.SEDQTEL = USER_EXTRA_INFO.ADDR_LINES(3);                   18530049
   END;                                                                 18540049
                                                                        18550049
 END RCBCS4M_READ_ADDRESS;                                              18560049
                                                       /* SOC RB01289 */18570049
1/*********************************************************************/18580049
 /*                                                       SOC RB01289 */18590049
 /* MODULE NAME      : RCBCS4M_READ_ADDRES1                           */18600049
 /*                                                                   */18610049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0500    */18620049
 /*                    OR RCBT0340                                    */18630049
 /*                                                                   */18640049
 /*********************************************************************/18650049
0RCBCS4M_READ_ADDRES1 : PROC;                                           18660049
                                                                        18670049
 IF TB_RCBP05S.ADDRESS_RES = '1' THEN                                   18680049
   DO;                                                                  18690049
     EXEC SQL                                                           18700049
       SELECT ADDRESS_NUMBER,                                           18710049
              CUSTOMER_USER                                             18720049
         INTO :TB_RCBV340.ADDRESS_NUMBER,                               18730049
              :WRK_SLCT_BAU_CUST                                        18740049
         FROM RCBV0340_HW_ADDR  T340                                    18750049
        WHERE T340.COUNTRY_NUMBER  = :REFCTRY                           18760049
          AND T340.PRODUCT_TYPE    = :REQTYPE                           18770049
          AND T340.ORIGIN          = :REQORIG                           18780049
          AND T340.SEQUENCE_NUMBER = :REQSEQN                           18790049
          AND :DATE10        BETWEEN T340.EFFECTIVE_DATE                18800049
                                 AND T340.END_DATE                      18810049
         WITH UR                                                        18820049
       ;                                                                18830049
                                                                        18840049
     SELECT(SQLCA.SQLCODE);                                             18850049
       WHEN(0);                                                         18860049
       WHEN(100);                                                       18870049
       OTHERWISE                                                        18880049
         DO;                                                            18890049
           RCBCQES.MESSAGE_NUMBER = 'C283';                             18900049
           WRK_SQLCODE = SQLCA.SQLCODE;                                 18910049
           WRK_TABLE = 'RCBV0340_HW_ADDR';                              18920049
           CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);             18930049
         END;                                                           18940049
     END;                                                               18950049
   END;                                                                 18960049
                                                       /* SOC RB01288 */18970049
 IF SWITCH_READ_BAU_WAR = TRUE THEN                                     18980049
    WRK_SLCT_BAU_CUST = TB_RCBV190.CUSTOMER_NUMBER;                     18990049
                                                       /* EOC RB01288 */19000049
 IF TB_RCBV340.ADDRESS_NUMBER = '' THEN                                 19010049
   DO;                                                                  19020049
     EXEC SQL                                                           19030049
       SELECT MIN(ADDRESS_NUMBER)                                       19040049
         INTO :TB_RCBV340.ADDRESS_NUMBER  :WRK_INDNULL                  19050049
         FROM RCBV0150_CUST_ADDR T150                                   19060049
        WHERE T150.COUNTRY_NUMBER  = :REFCTRY                           19070049
          AND T150.CUSTOMER_NUMBER = :WRK_SLCT_BAU_CUST                 19080049
          AND T150.ADDRESS_MASK LIKE '__1%'                             19090049
          AND :DATE10        BETWEEN T150.EFFECTIVE_DATE                19100049
                                 AND T150.END_DATE                      19110049
         WITH UR                                                        19120049
       ;                                                                19130049
     SELECT(SQLCA.SQLCODE);                                             19140049
       WHEN(0);                                                         19150049
       WHEN(100);                                                       19160049
       OTHERWISE                                                        19170049
         DO;                                                            19180049
           RCBCQES.MESSAGE_NUMBER = 'C284';                             19190049
           WRK_SQLCODE = SQLCA.SQLCODE;                                 19200049
           WRK_TABLE = 'RCBV0150_CUST_ADDR';                            19210049
           CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);             19220049
         END;                                                           19230049
     END;                                                               19240049
   END;                                                                 19250049
                                                                        19260049
 EXEC SQL                                                               19270049
   SELECT ADDRESS_NUMBER,                                               19280049
          ZIP_CODE                                                      19290049
     INTO :TB_RCBV150.ADDRESS_NUMBER,                                   19300049
          :TB_RCBV150.ZIP_CODE                                          19310049
     FROM RCBV0150_CUST_ADDR T150                                       19320049
    WHERE T150.COUNTRY_NUMBER  = :REFCTRY                               19330049
      AND T150.CUSTOMER_NUMBER = :WRK_SLCT_BAU_CUST                     19340049
      AND T150.ADDRESS_NUMBER  = :TB_RCBV340.ADDRESS_NUMBER             19350049
      AND :DATE10        BETWEEN T150.EFFECTIVE_DATE                    19360049
                             AND T150.END_DATE                          19370049
     WITH UR                                                            19380049
   ;                                                                    19390049
                                                                        19400049
 SELECT(SQLCA.SQLCODE);                                                 19410049
   WHEN(0)                                                              19420049
     EDQBSDS.ICUSGZC = TB_RCBV150.ZIP_CODE;                             19430049
   WHEN(100);                                                           19440049
   OTHERWISE                                                            19450049
     DO;                                                                19460049
       RCBCQES.MESSAGE_NUMBER = 'C285';                                 19470049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     19480049
       WRK_TABLE = 'RCBV0150_CUST_ADDR';                                19490049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 19500049
     END;                                                               19510049
 END;                                                                   19520049
                                                                        19530049
 EXEC SQL                              /* INIT CURSOR ADDR_CURSOR    */ 19540049
      OPEN ADDR_CURSOR1;                                                19550049
                                                                        19560049
 SELECT(SQLCA.SQLCODE);                                                 19570049
   WHEN (0);                                                            19580049
   OTHERWISE                                                            19590049
     DO;                                                                19600049
       RCBCQES.MESSAGE_NUMBER = 'C286';                                 19610049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     19620049
       WRK_TABLE = 'ADDR_CURSOR1';                                      19630049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 19640049
     END;                                                               19650049
 END;                                                                   19660049
                                                                        19670049
 CALL RCBCS4M_READ_ADDR_LINE1;                                          19680049
                                                                        19690049
 DO I = 1 TO 9 WHILE (¬SWITCH_EOC_ADDR);                                19700049
   USER_EXTRA_INFO.ADDR_LINES(I) = TB_RCBV280.TEXT;                     19710049
   CALL RCBCS4M_READ_ADDR_LINE1;                                        19720049
 END;                                                                   19730049
                                                                        19740049
 EXEC SQL                                                               19750049
      CLOSE ADDR_CURSOR1;                                               19760049
                                                                        19770049
 SELECT(SQLCA.SQLCODE);                                                 19780049
   WHEN (0);                                                            19790049
   OTHERWISE                                                            19800049
     DO;                                                                19810049
       RCBCQES.MESSAGE_NUMBER = 'C287';                                 19820049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     19830049
       WRK_TABLE = 'ADDR_CURSOR1';                                      19840049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 19850049
     END;                                                               19860049
 END;                                                                   19870049
                                                                        19880049
 USER_FILE_RCBDRF1.CUNOUSE = EDQBSDS.SRCCCMD.ICUSHWU;                   19890049
 USER_FILE_RCBDRF1.IODPDBU = EDQBSDS.SRCCCMD.IODPDBU;                   19900049
 USER_FILE_RCBDRF1.ICUSANO = EDQBSDS.CUSCODE.ICUSANO;                   19910049
 USER_FILE_RCBDRF1.CUNAME  = EDQBSDS.NCUSABB;                           19920049
 USER_FILE_RCBDRF1.NCUSSTR = EDQBSDS.NCUSSTR;                           19930049
 USER_FILE_RCBDRF1.ICUSCTY = EDQBSDS.ICUSCTY;                           19940049
 USER_FILE_RCBDRF1.ICUS3AD = EDQBSDS.SEDQTEL;                           19950049
 USER_FILE_RCBDRF1.ICUSGZC = EDQBSDS.ICUSGZC;                           19960049
 USER_FILE_RCBDRF1.UDTEUEX = EDQBSDS.UDTEUEX;                           19970049
 USER_FILE_RCBDRF1.UDTECUF = EDQBSDS.UDTECUF;                           19980049
 USER_FILE_RCBDRF1.AAS_ADD = TB_RCBV150.ADDRESS_NUMBER;                 19990049
 USER_FILE_RCBDRF1.FCUSEMB = EDQBSDS.FCUSEMB;                           20000049
 USER_FILE_RCBDRF1.CCUSTOC = EDQBSDS.CCUSTOC;                           20010049
                                                                        20020049
 CALL RCBDR4U (ADDR(SWITCH_USER_EXIT),                                  20030049
               ADDR(DATA_ORIGIN),                                       20040049
               ADDR(USER_FILE_RCBDRF1),                                 20050049
               ADDR(USER_FILE_PI),                                      20060049
               ADDR(USER_EXTRA_INFO),                                   20070049
               PTR_INT_AREA);                                           20080049
                                                                        20090049
 IF SWITCH_USER_EXIT = TRUE THEN                                        20100049
   DO;                                                                  20110049
     EDQBSDS.SRCCCMD.IODPDBU   = USER_FILE_RCBDRF1.IODPDBU;             20120049
     EDQBSDS.CUSCODE.ICUSANO   = USER_FILE_RCBDRF1.ICUSANO;             20130049
     EDQBSDS.NCUSSTR           = USER_FILE_RCBDRF1.NCUSSTR;             20140049
     EDQBSDS.ICUSCTY           = USER_FILE_RCBDRF1.ICUSCTY;             20150049
     EDQBSDS.SEDQTEL           = USER_FILE_RCBDRF1.ICUS3AD;             20160049
     EDQBSDS.ICUSGZC           = USER_FILE_RCBDRF1.ICUSGZC;             20170049
     EDQBSDS.UDTEUEX           = USER_FILE_RCBDRF1.UDTEUEX;             20180049
     EDQBSDS.UDTECUF           = USER_FILE_RCBDRF1.UDTECUF;             20190049
     EDQBSDS.FCUSEMB           = USER_FILE_RCBDRF1.FCUSEMB;             20200049
     EDQBSDS.CCUSTOC           = USER_FILE_RCBDRF1.CCUSTOC;             20210049
   END;                                                                 20220049
 ELSE                                                                   20230049
   DO;                                                                  20240049
     EDQBSDS.NCUSSTR = USER_EXTRA_INFO.ADDR_LINES(1);                   20250049
     EDQBSDS.ICUSCTY = USER_EXTRA_INFO.ADDR_LINES(2);                   20260049
     EDQBSDS.SEDQTEL = USER_EXTRA_INFO.ADDR_LINES(3);                   20270049
   END;                                                                 20280049
                                                                        20290049
 END RCBCS4M_READ_ADDRES1;                             /* EOC RB01289 */20300049
1/*********************************************************************/20310049
 /*                                                                   */20320049
 /* MODULE NAME      : RCBCS4M_READ_ADDR_LINE                         */20330049
 /*                                                                   */20340049
 /* DESCRIPTION      : PROCESS ALL ROWS FROM RCBT0280_ADDR_LINE FOR   */20350049
 /*                    THE GIVEN ADDRESS NUMBER                       */20360049
 /*                                                                   */20370049
 /*********************************************************************/20380049
0RCBCS4M_READ_ADDR_LINE: PROC;                                          20390049
                                                                        20400049
 EXEC SQL                                                               20410049
      FETCH ADDR_CURSOR                                                 20420049
       INTO :TB_RCBV280 :TB_RCBV280_I.INDNULL;                          20430049
                                                                        20440049
 SELECT(SQLCA.SQLCODE);                                                 20450049
   WHEN(0)                                                              20460049
     DO;                                                                20470049
       SWITCH_EOC_ADDR = FALSE;                                         20480049
     END;                                                               20490049
   WHEN(100)                                                            20500049
       SWITCH_EOC_ADDR = TRUE;                                          20510049
   OTHERWISE                                                            20520049
     DO;                                                                20530049
       RCBCQES.MESSAGE_NUMBER = 'C231';                                 20540049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     20550049
       WRK_TABLE = 'ADDR_CURSOR';                                       20560049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 20570049
     END;                                                               20580049
 END;                                                                   20590049
                                                                        20600049
 END RCBCS4M_READ_ADDR_LINE;                                            20610049
                                                       /* SOC RB01289 */20620049
1/*********************************************************************/20630049
 /*                                                                   */20640049
 /* MODULE NAME      : RCBCS4M_READ_ADDR_LINE1                        */20650049
 /*                                                                   */20660049
 /* DESCRIPTION      : PROCESS ALL ROWS FROM RCBT0280_ADDR_LINE FOR   */20670049
 /*                    THE GIVEN ADDRESS NUMBER                       */20680049
 /*                                                                   */20690049
 /*********************************************************************/20700049
0RCBCS4M_READ_ADDR_LINE1: PROC;                                         20710049
                                                                        20720049
 EXEC SQL                                                               20730049
      FETCH ADDR_CURSOR1                                                20740049
       INTO :TB_RCBV280 :TB_RCBV280_I.INDNULL;                          20750049
                                                                        20760049
 SELECT(SQLCA.SQLCODE);                                                 20770049
   WHEN(0)                                                              20780049
     DO;                                                                20790049
       SWITCH_EOC_ADDR = FALSE;                                         20800049
     END;                                                               20810049
   WHEN(100)                                                            20820049
       SWITCH_EOC_ADDR = TRUE;                                          20830049
   OTHERWISE                                                            20840049
     DO;                                                                20850049
       RCBCQES.MESSAGE_NUMBER = 'C288';                                 20860049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     20870049
       WRK_TABLE = 'ADDR_CURSOR1';                                      20880049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 20890049
     END;                                                               20900049
 END;                                                                   20910049
                                                                        20920049
 END RCBCS4M_READ_ADDR_LINE1;                                           20930049
                                                       /* EOC RB01289 */20940049
1/*********************************************************************/20950049
 /*                                                       SOC RB01288 */20960049
 /* MODULE NAME      : RCBCS4M_READ_SUPPL_CTR                         */20970049
 /*                                                                   */20980049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0220    */20990049
 /*                                                                   */21000049
 /*                                                                   */21010049
 /*********************************************************************/21020049
0RCBCS4M_READ_SUPPL_CTR: PROC;                                          21030049
                                                                        21040049
 WRK_TOC_V30_IND = 0;                                      /* RB01290 */21050049
 SWITCH_INTERNAL_MACHINE_CTR = FALSE;                      /* RB01290 */21060049
                                                                        21070049
 EXEC SQL                                                               21080049
      SELECT PRODUCT_TYPE       ,                                       21090049
             ORIGIN             ,                                       21100049
             SEQUENCE_NUMBER    ,                                       21110049
             COUNTRY_NUMBER     ,                                       21120049
             TYPE_OF_MAINT      ,                                       21130049
             TYPE_OF_WARRANTY   ,                                       21140049
             SERVICE_LVL_CODE   ,                                       21150049
             WARRANTY_EXP_DATE  ,                                       21160049
             SOURCE_INDICATOR   ,                                       21170049
             LAST_CHANGE_DATE   ,                                       21180049
             EFFECTIVE_DATE     ,                                       21190049
             END_DATE           ,                                       21200049
             F_TYPE_OF_WARRANTY ,                                       21210049
             F_SPLT_DATE        ,                                       21220049
             SERVICE_LVL_CODE_2                            /* RB01298 */21230049
       INTO :TB_RCBV220                                                 21240049
            :TB_RCBV220_I.INDNULL                                       21250049
       FROM  RCBV0220_SUPPL_CTR  T220                                   21260049
      WHERE  T220.COUNTRY_NUMBER  = :REFCTRY                            21270049
        AND  T220.PRODUCT_TYPE    = :REQTYPE                            21280049
        AND  T220.ORIGIN          = :REQORIG                            21290049
        AND  T220.SEQUENCE_NUMBER = :REQSEQN                            21300049
        AND :DATE10         BETWEEN T220.EFFECTIVE_DATE                 21310049
                                AND T220.END_DATE                       21320049
      WITH UR;                                                          21330049
                                                                        21340049
 SELECT(SQLCA.SQLCODE);                                                 21350049
   WHEN(0)                                                              21360049
     DO;                                                                21370049
       IF (((TB_RCBV220.TYPE_OF_MAINT = '2') |         /* SOC RB01290 */21380049
            (TB_RCBV220.TYPE_OF_MAINT = 'A') |                          21390049
            (TB_RCBV220.TYPE_OF_MAINT = 'B'))&                          21400049
            (TB_RCBV220.SOURCE_INDICATOR = 'C'))                        21410049
       THEN DO;                                                         21420049
              SWITCH_INTERNAL_MACHINE_CTR = TRUE;                       21430049
              EXEC SQL                                                  21440049
                   SELECT  B.TYPE_OF_CONTRACT                           21450049
                     INTO :TB_RCBV030.TYPE_OF_CONTRACT                  21460049
                          :WRK_TOC_V30_IND                              21470049
                     FROM  RCBV0240_SERV_CTR A                          21480049
                          ,RCBV0030_CONTRACT B                          21490049
                    WHERE  A.COUNTRY_NUMBER  = :REFCTRY                 21500049
                      AND  A.PRODUCT_TYPE    = :REQTYPE                 21510049
                      AND  A.ORIGIN          = :REQORIG                 21520049
                      AND  A.SEQUENCE_NUMBER = :REQSEQN                 21530049
                      AND  B.COUNTRY_NUMBER  = A.COUNTRY_NUMBER         21540049
                      AND  B.CONTRACT_NUMBER = A.CONTRACT_NUMBER        21550049
                      AND  :DATE10        BETWEEN A.EFFECTIVE_DATE      21560049
                                         AND A.END_DATE                 21570049
                   WITH UR;                                             21580049
              SELECT(SQLCA.SQLCODE);                                    21590049
                 WHEN (0)                                               21600049
                   DO;                                                  21610049
                     IF ((TB_RCBV030.TYPE_OF_CONTRACT ¬= '') &          21620049
                         (WRK_TOC_V30_IND ¬= -1)) THEN                  21630049
                     DO;                                                21640049
                       CALL RCBCS4M_READ_RCB070;                        21650049
                     END;                                               21660049
                   END;                                                 21670049
                 WHEN (100);                                            21680049
                 OTHERWISE                                              21690049
                   DO;                                                  21700049
                     RCBCQES.MESSAGE_NUMBER = 'C557';                   21710049
                     WRK_SQLCODE = SQLCA.SQLCODE;                       21720049
                     WRK_TABLE = 'RCBT0240_TOM_CTR';                    21730049
                     CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE,WRK_TABLE);    21740049
                   END;                                                 21750049
              END;                                                      21760049
            END;                                       /* EOC RB01290 */21770049
        CALL RCBCS4M_READ_HW_STATUS;                                    21780049
        CALL RCBCS4M_READ_HW_REAL;                                      21790049
        CALL RCBCS4M_READ_HW_PR_MOD;                                    21800049
        CALL RCBCS4M_READ_HW_IN_ORD;                                    21810049
                                                                        21820049
        IF EDQBSHS.REQ.REQKEY.IOPUCTY ¬= EDQBSHS.REQ.TARGCTY THEN       21830049
          DO;                                                           21840049
             WRK_TEMP = TB_RCBV051.MODEL_NUMBER;                        21850049
             TB_RCBV051.MODEL_NUMBER = TB_RCBV300.MODEL_NUMBER;         21860049
             CALL RCBCS4M_READ_PO_MOD1;                                 21870049
             TB_RCBV051.MODEL_NUMBER = WRK_TEMP;                        21880049
          END;                                                          21890049
                                                                        21900049
        CALL RCBCS4M_READ_RCB063;                                       21910049
        CALL RCBCS4M_READ_RCB064;                        /* RB01298 */  21920049
        CALL RCBCS4M_MOVE_SUPPL_CTR;                                    21930049
        CALL RCBCS4M_READ_OU_HW;                                        21940049
     END;                                                               21950049
   WHEN(100)                                                            21960049
     DO;                                                                21970049
       EDQBSHS.REQ.CRMORET = '9';                                       21980049
       EXEC CICS RETURN;                                                21990049
     END;                                                               22000049
   OTHERWISE                                                            22010049
     DO;                                                                22020049
       RCBCQES.MESSAGE_NUMBER = 'C261';                                 22030049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     22040049
       WRK_TABLE = 'RCBT0220_SUPPL_CTR';                                22050049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 22060049
     END;                                                               22070049
 END;                                                                   22080049
 END RCBCS4M_READ_SUPPL_CTR;                           /* EOC RB01288 */22090049
 /*********************************************************************/22100049
 /*                                                    /* SOC RB01290 */22110049
 /* MODULE NAME      : RCBCS4M_READ_RCB070                            */22120049
 /*                                                                   */22130049
 /* DESCRIPTION      : READ THE RCB070 PARAMETER FROM RCBT0500_PARM   */22140049
 /*                    TABLE                                          */22150049
 /*                                                                   */22160049
 /*********************************************************************/22170049
 RCBCS4M_READ_RCB070: PROC;                                             22180049
                                                                        22190049
  TB_RCBP70S   = '';                                                    22200049
                                                                        22210049
  EXEC SQL                                                              22220049
       SELECT  T500.PARAMETER_VALUE                                     22230049
         INTO :TB_RCBV500.PARAMETER_VALUE :WRK_INDNULL                  22240049
         FROM  RCBV0500_PARM  T500                                      22250049
        WHERE  T500.PARAMETER_NUMBER = 'RCB070'                         22260049
          AND  T500.PARAMETER_KEY     = :REFCTRY ||                     22270049
                                        :TB_RCBV030.TYPE_OF_CONTRACT    22280049
       WITH UR;                                                         22290049
                                                                        22300049
  SELECT(SQLCA.SQLCODE);                                                22310049
    WHEN(0)                                                             22320049
      DO;                                                               22330049
        TB_RCBP70S.TOM_INTERNAL_CONTRACT =                              22340049
                               SUBSTR(TB_RCBV500.PARAMETER_VALUE,1,1);  22350049
        IF (TB_RCBP70S.TOM_INTERNAL_CONTRACT ¬= '') THEN                22360049
          DO;                                                           22370049
            TB_RCBV220.TYPE_OF_MAINT =                                  22380049
                                    TB_RCBP70S.TOM_INTERNAL_CONTRACT;   22390049
          END;                                                          22400049
      END;                                                              22410049
    WHEN(100);                                                          22420049
    OTHERWISE                                                           22430049
      DO;                                                               22440049
        RCBCQES.MESSAGE_NUMBER = 'C556';                                22450049
        WRK_SQLCODE = SQLCA.SQLCODE;                                    22460049
        WRK_TABLE = 'RCBV0500_R070';                                    22470049
        CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                22480049
      END;                                                              22490049
  END;                                                                  22500049
                                                                        22510049
  END RCBCS4M_READ_RCB070;                             /* EOC RB01290 */22520049
1/*********************************************************************/22530049
 /*                                                       SOC RB01288 */22540049
 /* MODULE NAME      : RCBCS4M_READ_HW_STAUS                          */22550049
 /*                                                                   */22560049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0110    */22570049
 /*                                                                   */22580049
 /*                                                                   */22590049
 /*********************************************************************/22600049
0RCBCS4M_READ_HW_STATUS : PROC;                                         22610049
                                                                        22620049
 EXEC SQL                                                               22630049
      SELECT T110.STATUS                                                22640049
       INTO :TB_RCBV110.STATUS  :WRK_INDNULL                            22650049
      FROM   RCBV0110_HW_STATUS  T110                                   22660049
      WHERE  T110.PRODUCT_TYPE     = :REQTYPE                           22670049
        AND  T110.ORIGIN           = :REQORIG                           22680049
        AND  T110.SEQUENCE_NUMBER  = :REQSEQN                           22690049
        AND  T110.COUNTRY_NUMBER   = :REFCTRY                           22700049
        AND (T110.STATUS           = '3'                                22710049
         OR  T110.STATUS           = '4')                               22720049
        AND :DATE10          BETWEEN T110.EFFECTIVE_DATE                22730049
                                 AND T110.END_DATE                      22740049
      WITH UR;                                                          22750049
                                                                        22760049
 SELECT(SQLCA.SQLCODE);                                                 22770049
   WHEN(0)                                                              22780049
     EDQBSDS.CHSIISC = TB_RCBV110.STATUS;                               22790049
   WHEN(100);                                                           22800049
   OTHERWISE                                                            22810049
     DO;                                                                22820049
       RCBCQES.MESSAGE_NUMBER = 'C262';                                 22830049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     22840049
       WRK_TABLE = 'RCBV0110_HW_STATUS';                                22850049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 22860049
     END;                                                               22870049
 END;                                                                   22880049
                                                                        22890049
 END RCBCS4M_READ_HW_STATUS;                           /* EOC RB01288 */22900049
1/*********************************************************************/22910049
 /*                                                       SOC RB01288 */22920049
 /* MODULE NAME      : RCBCS4M_READ_HW_REAL                           */22930049
 /*                                                                   */22940049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0300    */22950049
 /*                                                                   */22960049
 /*                                                                   */22970049
 /*********************************************************************/22980049
0RCBCS4M_READ_HW_REAL : PROC;                                           22990049
                                                                        23000049
 EXEC SQL                                                               23010049
      SELECT T300.MODEL_NUMBER                                          23020049
       INTO :TB_RCBV300.MODEL_NUMBER    :WRK_INDNULL                    23030049
      FROM   RCBV0300_HW_REAL  T300                                     23040049
      WHERE  T300.COUNTRY_NUMBER   = :REFCTRY                           23050049
        AND  T300.PRODUCT_TYPE     = :REQTYPE                           23060049
        AND  T300.ORIGIN           = :REQORIG                           23070049
        AND  T300.SEQUENCE_NUMBER  = :REQSEQN                           23080049
        AND :DATE10          BETWEEN T300.EFFECTIVE_DATE                23090049
                                 AND T300.END_DATE                      23100049
      WITH UR;                                                          23110049
                                                                        23120049
 SELECT(SQLCA.SQLCODE);                                                 23130049
   WHEN(0)                                                              23140049
     EDQBSDS.CSLMMOD,                                                   23150049
     EDQBSDS.BUILT_TO_MODEL_NR = TB_RCBV300.MODEL_NUMBER;               23160049
   WHEN(100)                                                            23170049
     DO;                                                                23180049
        EDQBSHS.REQ.CRMORET = '9';                                      23190049
        EXEC CICS RETURN;                                               23200049
     END;                                                               23210049
   OTHERWISE                                                            23220049
     DO;                                                                23230049
       RCBCQES.MESSAGE_NUMBER = 'C263';                                 23240049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     23250049
       WRK_TABLE = 'RCBV0300_HW_REAL';                                  23260049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 23270049
     END;                                                               23280049
 END;                                                                   23290049
                                                                        23300049
 END RCBCS4M_READ_HW_REAL;                           /* EOC : RB01288 */23310049
1/*********************************************************************/23320049
 /*                                                       SOC RB01288 */23330049
 /* MODULE NAME      : RCBCS4M_READ_HW_PR_MOD                         */23340049
 /*                                                                   */23350049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0380    */23360049
 /*                                                                   */23370049
 /*                                                                   */23380049
 /*********************************************************************/23390049
0RCBCS4M_READ_HW_PR_MOD : PROC;                                         23400049
                                                                        23410049
 EXEC SQL                                                               23420049
      SELECT T380.CPU_TYPE         ,                                    23430049
             T380.DP_SYSTEM_NUMBER ,                                    23440049
             T380.INSTALLING_OU    ,                                    23450049
             T380.TYPE_OF_AGREEMENT                                     23460049
       INTO :TB_RCBV380.CPU_TYPE          :WRK_INDNULL,                 23470049
            :TB_RCBV380.DP_SYSTEM_NUMBER  :WRK_INDNULL,                 23480049
            :TB_RCBV380.INSTALLING_OU     :WRK_INDNULL,                 23490049
            :TB_RCBV380.TYPE_OF_AGREEMENT :WRK_INDNULL                  23500049
      FROM   RCBV0380_HW_PR_MOD  T380                                   23510049
      WHERE  T380.COUNTRY_NUMBER   = :REFCTRY                           23520049
        AND  T380.PRODUCT_TYPE     = :REQTYPE                           23530049
        AND  T380.ORIGIN           = :REQORIG                           23540049
        AND  T380.SEQUENCE_NUMBER  = :REQSEQN                           23550049
        AND :DATE10          BETWEEN T380.EFFECTIVE_DATE                23560049
                                 AND T380.END_DATE                      23570049
      WITH UR;                                                          23580049
                                                                        23590049
 SELECT(SQLCA.SQLCODE);                                                 23600049
   WHEN(0)                                                              23610049
     DO;                                                                23620049
       EDQBSDS.ISLMCPU         = TB_RCBV380.CPU_TYPE;                   23630049
       EDQBSDS.ICUOSYN         = TB_RCBV380.DP_SYSTEM_NUMBER;           23640049
       STRING(EDQBSDS.GMKTMBO) = TB_RCBV380.INSTALLING_OU;              23650049
       EDQBSDS.CAGRTYP         = TB_RCBV380.TYPE_OF_AGREEMENT;          23660049
     END;                                                               23670049
   WHEN(100);                                                           23680049
   OTHERWISE                                                            23690049
     DO;                                                                23700049
       RCBCQES.MESSAGE_NUMBER = 'C264';                                 23710049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     23720049
       WRK_TABLE = 'RCBV0380_HW_PR_MOD';                                23730049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 23740049
     END;                                                               23750049
 END;                                                                   23760049
                                                                        23770049
 END RCBCS4M_READ_HW_PR_MOD;                           /* EOC RB01288 */23780049
1/*********************************************************************/23790049
 /*                                                       SOC RB01288 */23800049
 /* MODULE NAME      : RCBCS4M_READ_HW_IN_ORD                         */23810049
 /*                                                                   */23820049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0260    */23830049
 /*                                                                   */23840049
 /*                                                                   */23850049
 /*********************************************************************/23860049
0RCBCS4M_READ_HW_IN_ORD : PROC;                                         23870049
                                                                        23880049
 EXEC SQL                                                               23890049
      SELECT ORDER_REF_NUMBER                                           23900049
        INTO :TB_RCBV260.ORDER_REF_NUMBER                               23910049
        FROM RCBV0260_HW_IN_ORD                                         23920049
       WHERE COUNTRY_NUMBER  = :REFCTRY                                 23930049
         AND PRODUCT_TYPE    = :REQTYPE                                 23940049
         AND MODEL_NUMBER    = :TB_RCBV300.MODEL_NUMBER                 23950049
         AND ORIGIN          = :REQORIG                                 23960049
         AND SEQUENCE_NUMBER = :REQSEQN                                 23970049
         AND ORDER_DATE      =                                          23980049
            (                                                           23990049
             SELECT MAX(ORDER_DATE)                                     24000049
               FROM RCBV0260_HW_IN_ORD                                  24010049
              WHERE COUNTRY_NUMBER  = :REFCTRY                          24020049
                AND PRODUCT_TYPE    = :REQTYPE                          24030049
                AND MODEL_NUMBER    = :TB_RCBV300.MODEL_NUMBER          24040049
                AND ORIGIN          = :REQORIG                          24050049
                AND SEQUENCE_NUMBER = :REQSEQN                          24060049
                AND ORDER_DATE      < :DATE10                           24070049
            )                                                           24080049
      WITH UR;                                                          24090049
                                                                        24100049
 SELECT(SQLCA.SQLCODE);                                                 24110049
   WHEN(0)                                                              24120049
     EDQBSDS.ICUOORN = TB_RCBV260.ORDER_REF_NUMBER;                     24130049
   WHEN(100 ,-811);                                                     24140049
   OTHERWISE                                                            24150049
     DO;                                                                24160049
       RCBCQES.MESSAGE_NUMBER = 'C265';                                 24170049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     24180049
       WRK_TABLE = 'RCBV0260_HW_IN_ORD';                                24190049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 24200049
     END;                                                               24210049
 END;                                                                   24220049
                                                                        24230049
 END RCBCS4M_READ_HW_IN_ORD;                           /* EOC RB01288 */24240049
 /*********************************************************************/24250049
 /*                                                       SOC RB01288 */24260049
 /* MODULE NAME      : RCBCS4M_READ_RCB063                            */24270049
 /*                                                                   */24280049
 /* DESCRIPTION      : READ THE RCB063 PARAMETER FROM RCBT0500_PARM   */24290049
 /*                    TABLE                                          */24300049
 /*                                                                   */24310049
 /*********************************************************************/24320049
 RCBCS4M_READ_RCB063: PROC;                                             24330049
                                                                        24340049
  TB_RCB063S   = '';                                         /*RB01298*/24350049
                                                                        24360049
  EXEC SQL                                                              24370049
       SELECT T500.PARAMETER_VALUE                                      24380049
        INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                  24390049
       FROM   RCBV0500_PARM  T500                                       24400049
       WHERE  T500.PARAMETER_NUMBER = 'RCB063'                          24410049
       WITH UR;                                                         24420049
                                                                        24430049
  SELECT(SQLCA.SQLCODE);                                                24440049
    WHEN(0)                                                             24450049
      DO;                                                /*SOC RB01298*/24460049
        WRK_FWTOW =   TB_RCB063S.F_WARRANTY_MACHINE;                    24470049
        WRK_HBTOM =   TB_RCB063S.HARDBUNDLE;                            24480049
      END;                                               /*EOC RB01298*/24490049
    WHEN(100);                                                          24500049
    OTHERWISE                                                           24510049
      DO;                                                               24520049
        RCBCQES.MESSAGE_NUMBER = 'C266';                                24530049
        WRK_SQLCODE = SQLCA.SQLCODE;                                    24540049
        WRK_TABLE = 'RCBV0500_PARM';                                    24550049
        CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                24560049
      END;                                                              24570049
  END;                                                                  24580049
                                                                        24590049
  END RCBCS4M_READ_RCB063;                             /* EOC RB01288 */24600049
 /*********************************************************************/24610049
 /*                                                       SOC RB01298*/ 24620049
 /* MODULE NAME      : RCBCS4M_READ_RCB064                            */24630049
 /*                                                                   */24640049
 /* DESCRIPTION      : READ THE RCB064 PARAMETER FROM RCBT0500_PARM   */24650049
 /*                    TABLE                                          */24660049
 /*                                                                   */24670049
 /*********************************************************************/24680049
 RCBCS4M_READ_RCB064: PROC;                                             24690049
                                                                        24700049
  TB_RCB064S   = '';                                                    24710049
                                                                        24720049
  EXEC SQL                                                              24730049
       SELECT T500.PARAMETER_VALUE                                      24740049
        INTO :TB_RCBV500.PARAMETER_VALUE  :WRK_INDNULL                  24750049
       FROM   RCBV0500_PARM  T500                                       24760049
       WHERE  T500.PARAMETER_NUMBER = 'RCB064'                          24770049
       AND    T500.PARAMETER_KEY    = :REFCTRY                          24780049
       WITH UR;                                                         24790049
                                                                        24800049
  SELECT(SQLCA.SQLCODE);                                                24810049
    WHEN(0)                                                             24820049
      DO;                                                               24830049
        WRK_FWTOW =   TB_RCB064S.F_WARRANTY_MACHINE;                    24840049
        WRK_HBTOM =   TB_RCB064S.HARDBUNDLE;                            24850049
      END;                                                              24860049
    WHEN(100);                                                          24870049
    OTHERWISE                                                           24880049
      DO;                                                               24890049
        RCBCQES.MESSAGE_NUMBER = 'C289';                                24900049
        WRK_SQLCODE = SQLCA.SQLCODE;                                    24910049
        WRK_TABLE = 'RCBV0500_PARM';                                    24920049
        CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                24930049
      END;                                                              24940049
  END;                                                                  24950049
                                                                        24960049
  END RCBCS4M_READ_RCB064;                             /* EOC RB01298*/ 24970049
1/*********************************************************************/24980049
 /*                                                       SOC RB01288 */24990049
 /* MODULE NAME      : RCBCS4M_MOVE_SUPPL_CTR                         */25000049
 /*                                                                   */25010049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0220    */25020049
 /*                    TO THE COMMAREA FIELDS.                        */25030049
 /*                                                                   */25040049
 /*********************************************************************/25050049
0RCBCS4M_MOVE_SUPPL_CTR: PROC;                                          25060049
                                                                        25070049
 EDQBSDS.IHSITOS.CSLMTYP         = TB_RCBV220.PRODUCT_TYPE;             25080049
 EDQBSDS.IHSITOS.IHSIMID.IOLCPLM = TB_RCBV220.ORIGIN;                   25090049
 EDQBSDS.IHSITOS.IHSIMID.IHSINBR = TB_RCBV220.SEQUENCE_NUMBER;          25100049
 EDQBSDS.IOPUCTY                 = TB_RCBV220.COUNTRY_NUMBER;           25110049
                                                                        25120049
 IF VERIFY(TB_RCBV220.TYPE_OF_WARRANTY,WRK_TPMNT_VAL.TPMNT_WAR) = 0     25130049
  | VERIFY (TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_FWTOW) = 0/*SOC RB01298*/ 25140049
  | VERIFY (TB_RCBV220.F_TYPE_OF_WARRANTY,WRK_HBTOM) = 0                25150049
 /* SUBSTR(TB_RCBV500.PARAMETER_VALUE,1,1)) = 0           EOC RB01298*/ 25160049
   THEN                                                                 25170049
   DO;                                                                  25180049
     EDQBSDS.SRCCCMD.CHSISTM = TB_RCBV220.TYPE_OF_WARRANTY;             25190049
                                                                        25200049
     IF (TB_RCBV220.F_TYPE_OF_WARRANTY ¬= ' ' &                         25210049
         TB_RCBV220.F_SPLT_DATE ¬= ' ' )                                25220049
     THEN DO;                                                           25230049
          IF (DATE10   >  TB_RCBV220.F_SPLT_DATE &                      25240049
              DATE10   <= TB_RCBV220.END_DATE) THEN                     25250049
                                                                        25260049
             EDQBSDS.SRCCCMD.CHSISTM = TB_RCBV220.F_TYPE_OF_WARRANTY;   25270049
     END;                                                               25280049
                                                                        25290049
     IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(14) = 0 THEN              25300049
       DO;                                                              25310049
         EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                             25320049
                                          TB_RCBV400.SERVICE_LVL_CODE_1;25330049
         CALL RCBCS4M_READ_SERV_COND (TB_RCBV400.SERVICE_LVL_CODE_1);   25340049
       END;                                                             25350049
     ELSE                                                               25360049
       DO;                                                              25370049
         IF TB_RCBV220_I.INDNULL(07) = 0 THEN                           25380049
           DO;                                                          25390049
             EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                         25400049
                                            TB_RCBV220.SERVICE_LVL_CODE;25410049
             CALL RCBCS4M_READ_SERV_COND (TB_RCBV220.SERVICE_LVL_CODE); 25420049
           END;                                                         25430049
         IF TB_RCBV220_I.INDNULL(15) = 0  &           /* SOC RB01298 */ 25440049
            (TB_RCBV220.F_SPLT_DATE >= TB_RCBV220.WARRANTY_EXP_DATE) &  25450049
            (DATE10 >= TB_RCBV220.F_SPLT_DATE) &                        25460049
            (DATE10 <= TB_RCBV220.END_DATE)                             25470049
         THEN                                                           25480049
           DO;                                                          25490049
             EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                         25500049
                                          TB_RCBV220.SERVICE_LVL_CODE_2;25510049
             CALL RCBCS4M_READ_SERV_COND                                25520049
                                  (TB_RCBV220.SERVICE_LVL_CODE_2);      25530049
           END;                                       /* EOC RB01298 */ 25540049
       END;                                                             25550049
   END;                                                                 25560049
 ELSE                                                                   25570049
   DO;                                                                  25580049
     CALL RCBCS4M_READ_RCBT0051;                                        25590049
                                                                        25600049
     IF VERIFY(WRK051_TYPE_OF_WARRANTY,WRK_TPMNT_VAL.TPMNT_WAR) = 0     25610049
      | VERIFY(WRK051_F_TYPE_OF_WARRANTY,WRK_FWTOW) = 0 /*SOC RB01298*/ 25620049
      | VERIFY(WRK051_F_TYPE_OF_WARRANTY,WRK_HBTOM) = 0                 25630049
     /* SUBSTR(TB_RCBV500.PARAMETER_VALUE,1,1)) = 0       EOC RB01298*/ 25640049
       THEN                                                             25650049
       DO;                                                              25660049
         EDQBSDS.SRCCCMD.CHSISTM = WRK051_TYPE_OF_WARRANTY;             25670049
         IF (WRK051_F_TYPE_OF_WARRANTY ¬= ''&                           25680049
             WRK051_SPLT_DATE ¬= '' &                                   25690049
             WRK051_TYPE_OF_WARRANTY ¬= WRK051_F_TYPE_OF_WARRANTY) THEN 25700049
             DO;                                                        25710049
              IF DATE10  >  WRK051_SPLT_DATE &                          25720049
                 DATE10  <= WRK051_EXP_DATE THEN                        25730049
                                                                        25740049
                 EDQBSDS.SRCCCMD.CHSISTM = WRK051_F_TYPE_OF_WARRANTY;   25750049
                                                                        25760049
             END;                                                       25770049
         IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(14) = 0 THEN          25780049
           DO;                                                          25790049
             EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                         25800049
                                          TB_RCBV400.SERVICE_LVL_CODE_1;25810049
             CALL RCBCS4M_READ_SERV_COND(TB_RCBV400.SERVICE_LVL_CODE_1);25820049
           END;                                                         25830049
         ELSE                                                           25840049
           DO;                                                          25850049
             IF TB_RCBV220_I.INDNULL(07) = 0 THEN                       25860049
               DO;                                                      25870049
                  EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                    25880049
                                            TB_RCBV220.SERVICE_LVL_CODE;25890049
                  CALL RCBCS4M_READ_SERV_COND                           25900049
                                          (TB_RCBV220.SERVICE_LVL_CODE);25910049
               END;                                                     25920049
             IF TB_RCBV220_I.INDNULL(15) = 0          /* SOC RB01298 */ 25930049
              & (TB_RCBV220.F_SPLT_DATE >= TB_RCBV220.WARRANTY_EXP_DATE)25940049
              & (DATE10 >= TB_RCBV220.F_SPLT_DATE)                      25950049
              & (DATE10 <= TB_RCBV220.END_DATE)                         25960049
             THEN                                                       25970049
               DO;                                                      25980049
                 EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                     25990049
                                       TB_RCBV220.SERVICE_LVL_CODE_2;   26000049
                 CALL RCBCS4M_READ_SERV_COND                            26010049
                                (TB_RCBV220.SERVICE_LVL_CODE_2);        26020049
               END;                                    /* EOC RB01298 */26030049
           END;                                                         26040049
       END;                                                             26050049
     ELSE                                                               26060049
       DO;                                                              26070049
         EDQBSDS.SRCCCMD.CHSISTM = TB_RCBV220.TYPE_OF_MAINT;            26080049
 /*      IF TB_RCBV220.TYPE_OF_MAINT ¬= '2' THEN        /*SOC RB01290 */26090049
         IF ((TB_RCBV220.TYPE_OF_MAINT ¬= '2')&                         26100049
            (SWITCH_INTERNAL_MACHINE_CTR = FALSE)) THEN /*EOC RB01290 */26110049
           DO;                                                          26120049
             IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(18) = 0 THEN      26130049
               DO;                                                      26140049
                 EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                     26150049
                                          TB_RCBV400.SERVICE_LVL_CODE_C;26160049
                 CALL RCBCS4M_READ_SERV_COND                            26170049
                                       (TB_RCBV400.SERVICE_LVL_CODE_C); 26180049
               END;                                                     26190049
             ELSE                                                       26200049
               DO;                                                      26210049
                 IF TB_RCBV220_I.INDNULL(07) = 0 THEN                   26220049
                   DO;                                                  26230049
                     EDQBSDS.SRCCCMD.SERVICE_LVL_CODE =                 26240049
                                          TB_RCBV220.SERVICE_LVL_CODE;  26250049
                   CALL RCBCS4M_READ_SERV_COND                          26260049
                                          (TB_RCBV220.SERVICE_LVL_CODE);26270049
                   END;                                                 26280049
               END;                                                     26290049
           END;                                                         26300049
       END;                                                             26310049
   END;                                                                 26320049
                                                                        26330049
 IF TB_RCBV220_I.INDNULL(08) = 0 THEN                                   26340049
   EDQBSDS.DAGREWP = SUBSTR(TB_RCBV220.WARRANTY_EXP_DATE,1,4) ||        26350049
                     SUBSTR(TB_RCBV220.WARRANTY_EXP_DATE,6,2) ||        26360049
                     SUBSTR(TB_RCBV220.WARRANTY_EXP_DATE,9,2);          26370049
                                                                        26380049
 EDQBSDS.SRCCCMD.TAKE_CEDS = 'N';                                       26390049
                                                                        26400049
 EDQBSDS.SRCCCMD.SSRCIND = TB_RCBV220.SOURCE_INDICATOR;                 26410049
                                                                        26420049
 END RCBCS4M_MOVE_SUPPL_CTR;                           /* EOC RB01288 */26430049
1/*********************************************************************/26440049
 /*                                                    SOC : RB01288  */26450049
 /* MODULE NAME      : RCBCS4M_READ_RCBT0051                          */26460049
 /*                                                                   */26470049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0051    */26480049
 /*                                                                   */26490049
 /*                                                                   */26500049
 /*********************************************************************/26510049
0RCBCS4M_READ_RCBT0051 : PROC;                                          26520049
                                                                        26530049
 WRK051_TYPE_OF_WARRANTY = '';                                          26540049
                                                                        26550049
 EXEC SQL                                                               26560049
      SELECT TYPE_OF_WARRANTY                                           26570049
            ,F_TYPE_OF_WARRANTY                                         26580049
            ,WARRANTY_SPLT_DATE                                         26590049
            ,WARRANTY_EXP_DATE                                          26600049
      INTO   :WRK051_TYPE_OF_WARRANTY   :WRK_INDNULL                    26610049
            ,:WRK051_F_TYPE_OF_WARRANTY :WRK_INDNULL                    26620049
            ,:WRK051_SPLT_DATE          :WRK_INDNULL                    26630049
            ,:WRK051_EXP_DATE           :WRK_INDNULL                    26640049
      FROM   RCBV0051_PI_HW_PR                                          26650049
      WHERE  COUNTRY_NUMBER  = :TB_RCBV220.COUNTRY_NUMBER               26660049
        AND  PRODUCT_TYPE    = :TB_RCBV220.PRODUCT_TYPE                 26670049
        AND  ORIGIN          = :TB_RCBV220.ORIGIN                       26680049
        AND  SEQUENCE_NUMBER = :TB_RCBV220.SEQUENCE_NUMBER              26690049
        AND :DATE10          BETWEEN INSTALL_DATE                       26700049
                                 AND WARRANTY_EXP_DATE                  26710049
      ;                                                                 26720049
                                                                        26730049
 SELECT (SQLCA.SQLCODE);                                                26740049
   WHEN (0)  ;                                                          26750049
   WHEN (100);                                                          26760049
   OTHERWISE                                                            26770049
     DO;                                                                26780049
       RCBCQES.MESSAGE_NUMBER = 'C267';                                 26790049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     26800049
       WRK_TABLE = 'RCBV0051_PI_HW';                                    26810049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 26820049
     END;                                                               26830049
 END;                                                                   26840049
 END RCBCS4M_READ_RCBT0051;                          /* EOC : RB01288 */26850049
1/*********************************************************************/26860049
 /*                                                       SOC RB01288 */26870049
 /* MODULE NAME      : RCBCS4M_READ_OU_HW                             */26880049
 /*                                                                   */26890049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0170    */26900049
 /*                                                                   */26910049
 /*                                                                   */26920049
 /*********************************************************************/26930049
0RCBCS4M_READ_OU_HW : PROC;                                             26940049
                                                                        26950049
 EXEC SQL                                                               26960049
      SELECT T170.OU_CODE                                               26970049
       INTO :TB_RCBV170.OU_CODE      :WRK_INDNULL                       26980049
      FROM   RCBV0170_OU_HW  T170                                       26990049
      WHERE  T170.COUNTRY_NUMBER   = :REFCTRY                           27000049
        AND  T170.PRODUCT_TYPE     = :REQTYPE                           27010049
        AND  T170.ORIGIN           = :REQORIG                           27020049
        AND  T170.SEQUENCE_NUMBER  = :REQSEQN                           27030049
        AND :DATE10          BETWEEN T170.EFFECTIVE_DATE                27040049
                                 AND T170.END_DATE                      27050049
      WITH UR;                                                          27060049
                                                                        27070049
 SELECT(SQLCA.SQLCODE);                                                 27080049
   WHEN(0)                                                              27090049
     DO;                                                                27100049
       EDQBSDS.CUSCODE.SEDQCSX = '2' || TB_RCBV170.OU_CODE;             27110049
       EDQBSDS.SRCCCMD.IODPDBU.CODPDIV = '2';                           27120049
       EDQBSDS.SRCCCMD.IODPDBU.CODPBUC = TB_RCBV170.OU_CODE;            27130049
     END;                                                               27140049
   WHEN(100);                                                           27150049
   OTHERWISE                                                            27160049
     DO;                                                                27170049
       RCBCQES.MESSAGE_NUMBER = 'C268';                                 27180049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     27190049
       WRK_TABLE = 'RCBV0170_OU_HW';                                    27200049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 27210049
     END;                                                               27220049
 END;                                                                   27230049
                                                                        27240049
 END RCBCS4M_READ_OU_HW;                               /* EOC RB01288 */27250049
1/*********************************************************************/27260049
 /*                                                       SOC RB01288 */27270049
 /* MODULE NAME      : RCBCS4M_READ_HW_CUST                           */27280049
 /*                                                                   */27290049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0190    */27300049
 /*                    AND RCBT0010                                   */27310049
 /*                                                                   */27320049
 /*********************************************************************/27330049
0RCBCS4M_READ_HW_CUST : PROC;                                           27340049
                                                                        27350049
 EXEC SQL                                                               27360049
      SELECT T190.CUSTOMER_NUMBER    ,                                  27370049
             T190.MARKETING_INSTDAT  ,                                  27380049
             T190.SCHED_REMOVAL_DATE ,                                  27390049
             T010.CUSTOMER_NAME      ,                                  27400049
             T010.TYPE_OF_CUSTOMER                                      27410049
       INTO :TB_RCBV190.CUSTOMER_NUMBER    :WRK_INDNULL,                27420049
            :TB_RCBV190.MARKETING_INSTDAT  :WRK_INDNULL,                27430049
            :TB_RCBV190.SCHED_REMOVAL_DATE :WRK_INDNULL,                27440049
            :TB_RCBV010.CUSTOMER_NAME      :WRK_INDNULL,                27450049
            :TB_RCBV010.TYPE_OF_CUSTOMER   :WRK_INDNULL                 27460049
      FROM   RCBV0190_HW_CUST  T190,                                    27470049
             RCBV0010_CUSTOMER T010                                     27480049
      WHERE  T190.COUNTRY_NUMBER   = :REFCTRY                           27490049
        AND  T190.PRODUCT_TYPE     = :REQTYPE                           27500049
        AND  T190.ORIGIN           = :REQORIG                           27510049
        AND  T190.SEQUENCE_NUMBER  = :REQSEQN                           27520049
        AND  T190.TYPE_OF_RELATION = 'U'                                27530049
        AND :DATE10          BETWEEN T190.EFFECTIVE_DATE                27540049
                                 AND T190.END_DATE                      27550049
        AND  T010.COUNTRY_NUMBER   = T190.COUNTRY_NUMBER                27560049
        AND  T010.CUSTOMER_NUMBER  = T190.CUSTOMER_NUMBER               27570049
        AND :DATE10          BETWEEN T010.EFFECTIVE_DATE                27580049
                                 AND T010.END_DATE                      27590049
      WITH UR;                                                          27600049
                                                                        27610049
 SELECT(SQLCA.SQLCODE);                                                 27620049
   WHEN(0)                                                              27630049
     DO;                                                                27640049
       EDQBSDS.CUSCODE.ICUSHWU = TB_RCBV190.CUSTOMER_NUMBER;            27650049
       EDQBSDS.SRCCCMD.ICUSHWU = TB_RCBV190.CUSTOMER_NUMBER;            27660049
       EDQBSDS.DHSIINS = SUBSTR(TB_RCBV190.MARKETING_INSTDAT,1,4) ||    27670049
                         SUBSTR(TB_RCBV190.MARKETING_INSTDAT,6,2) ||    27680049
                         SUBSTR(TB_RCBV190.MARKETING_INSTDAT,9,2);      27690049
                                                                        27700049
       EDQBSDS.DRMOSMR = SUBSTR(TB_RCBV190.SCHED_REMOVAL_DATE,1,4) ||   27710049
                         SUBSTR(TB_RCBV190.SCHED_REMOVAL_DATE,6,2) ||   27720049
                         SUBSTR(TB_RCBV190.SCHED_REMOVAL_DATE,9,2);     27730049
                                                                        27740049
       EDQBSDS.NCUSABB = TB_RCBV010.CUSTOMER_NAME;                      27750049
       EDQBSDS.CCUSTOC = TB_RCBV010.TYPE_OF_CUSTOMER;                   27760049
                                                                        27770049
       EXEC SQL                                                         27780049
         SELECT  T350.EMBARGO_CODE                                      27790049
           INTO :TB_RCBV350.EMBARGO_CODE :WRK_INDNULL                   27800049
           FROM  RCBV0350_CUST_MOD T350                                 27810049
          WHERE  T350.COUNTRY_NUMBER   = :REFCTRY                       27820049
            AND  T350.CUSTOMER_NUMBER  = :TB_RCBV190.CUSTOMER_NUMBER    27830049
            AND :DATE10          BETWEEN T350.EFFECTIVE_DATE            27840049
                                     AND T350.END_DATE                  27850049
           WITH UR;                                                     27860049
                                                                        27870049
       SELECT(SQLCA.SQLCODE);                                           27880049
         WHEN(0)                                                        27890049
           EDQBSDS.FCUSEMB = TB_RCBV350.EMBARGO_CODE;                   27900049
         WHEN(100);                                                     27910049
         OTHERWISE                                                      27920049
           DO;                                                          27930049
             RCBCQES.MESSAGE_NUMBER = 'C269';                           27940049
             WRK_SQLCODE = SQLCA.SQLCODE;                               27950049
             WRK_TABLE = 'RCBV0350_CUST_MOD';                           27960049
             CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);           27970049
           END;                                                         27980049
       END;                                                             27990049
     END;                                                               28000049
   WHEN(100);                                                           28010049
   OTHERWISE                                                            28020049
     DO;                                                                28030049
       RCBCQES.MESSAGE_NUMBER = 'C270';                                 28040049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     28050049
       WRK_TABLE = 'RCBV0010_CUSTOMER';                                 28060049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 28070049
     END;                                                               28080049
 END;                                                                   28090049
                                                                        28100049
 END RCBCS4M_READ_HW_CUST;                             /* EOC RB01288 */28110049
1/*********************************************************************/28120049
 /*                                                       SOC RB01288 */28130049
 /* MODULE NAME      : RCBCS4M_READ_SERV_CTR                          */28140049
 /*                                                                   */28150049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0240    */28160049
 /*                                                                   */28170049
 /*                                                                   */28180049
 /*********************************************************************/28190049
0RCBCS4M_READ_SERV_CTR : PROC;                                          28200049
                                                                        28210049
0WRK_CTR_IND = FALSE;                                                   28220049
 SWITCH_READ_PI_CTR = TRUE ;                                            28230049
                                                                        28240049
0EXEC SQL                                                               28250049
      SELECT T240.COUNTRY_NUMBER    ,                                   28260049
             T240.PRODUCT_TYPE      ,                                   28270049
             T240.ORIGIN            ,                                   28280049
             T240.SEQUENCE_NUMBER   ,                                   28290049
             T240.HVP_QUANTITY      ,                                   28300049
             T240.CONTRACT_NUMBER   ,                                   28310049
             T240.SERVICE_START_DATE,                                   28320049
             T240.SERVICE_STOP_DATE ,                                   28330049
             T240.SUPPL_CTR_NUMBER  ,                                   28340049
             T240.SERVICE_MODULE_1  ,                                   28350049
             T240.SERVICE_MODULE_2  ,                                   28360049
             T240.SERVICE_MODULE_3  ,                                   28370049
             T240.SERVICE_MODULE_4  ,                                   28380049
             T240.SERVICE_MODULE_5  ,                                   28390049
             T240.AGREEMENT_TYPE    ,                                   28400049
             T240.AGREEMENT_OPTION  ,                                   28410049
             T240.SPECIAL_OPTION    ,                                   28420049
             T240.AMENDM_COMB_CODE  ,                                   28430049
             T240.COVERAGE_START_1  ,                                   28440049
             T240.COVERAGE_END_1    ,                                   28450049
             T240.COVERAGE_START_2  ,                                   28460049
             T240.COVERAGE_END_2    ,                                   28470049
             T240.COVERAGE_START_3  ,                                   28480049
             T240.COVERAGE_END_3    ,                                   28490049
             T240.COVERAGE_START_4  ,                                   28500049
             T240.COVERAGE_END_4    ,                                   28510049
             T240.COVERAGE_START_5  ,                                   28520049
             T240.COVERAGE_END_5    ,                                   28530049
             T240.COVERAGE_START_6  ,                                   28540049
             T240.COVERAGE_END_6    ,                                   28550049
             T240.COVERAGE_START_7  ,                                   28560049
             T240.COVERAGE_END_7    ,                                   28570049
             T240.SERVICE_TYPE      ,                                   28580049
             T240.SERVICE_LVL_CODE  ,                                   28590049
             T240.SOURCE_INDICATOR  ,                                   28600049
             T240.LAST_CHANGE_DATE  ,                                   28610049
             T240.EFFECTIVE_DATE    ,                                   28620049
             T240.END_DATE                                              28630049
       INTO :TB_RCBV240                                                 28640049
            :TB_RCBV240_I.INDNULL                                       28650049
      FROM   RCBV0240_SERV_CTR   T240,                                  28660049
             RCBV0220_SUPPL_CTR  T220                                   28670049
      WHERE  T240.COUNTRY_NUMBER  = :REFCTRY                            28680049
        AND  T240.PRODUCT_TYPE    = :REQTYPE                            28690049
        AND  T240.ORIGIN          = :REQORIG                            28700049
        AND  T240.SEQUENCE_NUMBER = :REQSEQN                            28710049
        AND :DATE10         BETWEEN T240.EFFECTIVE_DATE                 28720049
                                AND T240.END_DATE                       28730049
        AND  T220.COUNTRY_NUMBER  = T240.COUNTRY_NUMBER                 28740049
        AND  T220.PRODUCT_TYPE    = T240.PRODUCT_TYPE                   28750049
        AND  T220.ORIGIN          = T240.ORIGIN                         28760049
        AND  T220.SEQUENCE_NUMBER = T240.SEQUENCE_NUMBER                28770049
        AND  T220.TYPE_OF_MAINT   = '2'                                 28780049
        AND :DATE10         BETWEEN T220.EFFECTIVE_DATE                 28790049
                                AND T220.END_DATE                       28800049
      WITH UR;                                                          28810049
                                                                        28820049
 SELECT(SQLCA.SQLCODE);                                                 28830049
  WHEN(0)                                                               28840049
    DO;                                                                 28850049
      SWITCH_READ_PI_CTR = FALSE;                                       28860049
      CALL RCBCS4M_MOVE_SERV_CTR;                                       28870049
    END;                                                                28880049
  WHEN(100)                                                             28890049
      SWITCH_READ_PI_CTR = TRUE ;                                       28900049
  OTHERWISE                                                             28910049
    DO;                                                                 28920049
      RCBCQES.MESSAGE_NUMBER = 'C271';                                  28930049
      WRK_SQLCODE = SQLCA.SQLCODE;                                      28940049
      WRK_TABLE = 'RCBT0240_PI_CTR';                                    28950049
      CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                  28960049
    END;                                                                28970049
 END;                                                                   28980049
 END RCBCS4M_READ_SERV_CTR;                            /* EOC RB01288 */28990049
                                                                        29000049
1/*********************************************************************/29010049
 /*                                                       SOC RB01290 */29020049
 /* MODULE NAME      : RCBCS4M_READ_BAU_SERV_CTR                      */29030049
 /*                                                                   */29040049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0240    */29050049
 /*                                                                   */29060049
 /*                                                                   */29070049
 /*********************************************************************/29080049
0RCBCS4M_READ_BAU_SERV_CTR : PROC;                                      29090049
                                                                        29100049
0EXEC SQL                                                               29110049
      SELECT COUNTRY_NUMBER    ,                                        29120049
             PRODUCT_TYPE      ,                                        29130049
             ORIGIN            ,                                        29140049
             SEQUENCE_NUMBER   ,                                        29150049
             HVP_QUANTITY      ,                                        29160049
             CONTRACT_NUMBER   ,                                        29170049
             SERVICE_START_DATE,                                        29180049
             SERVICE_STOP_DATE ,                                        29190049
             SUPPL_CTR_NUMBER  ,                                        29200049
             SERVICE_MODULE_1  ,                                        29210049
             SERVICE_MODULE_2  ,                                        29220049
             SERVICE_MODULE_3  ,                                        29230049
             SERVICE_MODULE_4  ,                                        29240049
             SERVICE_MODULE_5  ,                                        29250049
             AGREEMENT_TYPE    ,                                        29260049
             AGREEMENT_OPTION  ,                                        29270049
             SPECIAL_OPTION    ,                                        29280049
             AMENDM_COMB_CODE  ,                                        29290049
             COVERAGE_START_1  ,                                        29300049
             COVERAGE_END_1    ,                                        29310049
             COVERAGE_START_2  ,                                        29320049
             COVERAGE_END_2    ,                                        29330049
             COVERAGE_START_3  ,                                        29340049
             COVERAGE_END_3    ,                                        29350049
             COVERAGE_START_4  ,                                        29360049
             COVERAGE_END_4    ,                                        29370049
             COVERAGE_START_5  ,                                        29380049
             COVERAGE_END_5    ,                                        29390049
             COVERAGE_START_6  ,                                        29400049
             COVERAGE_END_6    ,                                        29410049
             COVERAGE_START_7  ,                                        29420049
             COVERAGE_END_7    ,                                        29430049
             SERVICE_TYPE      ,                                        29440049
             SERVICE_LVL_CODE  ,                                        29450049
             SOURCE_INDICATOR  ,                                        29460049
             LAST_CHANGE_DATE  ,                                        29470049
             EFFECTIVE_DATE    ,                                        29480049
             END_DATE                                                   29490049
       INTO :TB_RCBV240                                                 29500049
            :TB_RCBV240_I.INDNULL                                       29510049
      FROM   RCBV0240_SERV_CTR T240                                     29520049
      WHERE  T240.COUNTRY_NUMBER  = :REFCTRY                            29530049
        AND  T240.PRODUCT_TYPE    = :REQTYPE                            29540049
        AND  T240.ORIGIN          = :REQORIG                            29550049
        AND  T240.SEQUENCE_NUMBER = :REQSEQN                            29560049
        AND  :DATE10        BETWEEN T240.EFFECTIVE_DATE                 29570049
                                AND T240.END_DATE                       29580049
      WITH UR;                                                          29590049
                                                                        29600049
 SELECT(SQLCA.SQLCODE);                                                 29610049
  WHEN(0)                                                               29620049
    DO;                                                                 29630049
      SWITCH_READ_PI_CTR = FALSE;                                       29640049
      CALL RCBCS4M_MOVE_SERV_CTR;                                       29650049
    END;                                                                29660049
  WHEN(100)                                                             29670049
      SWITCH_READ_PI_CTR = TRUE ;                                       29680049
  OTHERWISE                                                             29690049
    DO;                                                                 29700049
      RCBCQES.MESSAGE_NUMBER = 'C558';                                  29710049
      WRK_SQLCODE = SQLCA.SQLCODE;                                      29720049
      WRK_TABLE = 'RCBT0240_BAU_CTR';                                   29730049
      CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                  29740049
    END;                                                                29750049
 END;                                                                   29760049
                                                                        29770049
 END RCBCS4M_READ_BAU_SERV_CTR;                        /* EOC RB01290 */29780049
1/*********************************************************************/29790049
 /*                                                       SOC RB01288 */29800049
 /* MODULE NAME      : RCBCS4M_MOVE_SERV_CTR                          */29810049
 /*                                                                   */29820049
 /* DESCRIPTION      : MOVE THE EXACT REFERENCED ROW FROM RCBT0240    */29830049
 /*                    TO THE COMMAREA FIELDS.                        */29840049
 /*                                                                   */29850049
 /*********************************************************************/29860049
0RCBCS4M_MOVE_SERV_CTR: PROC;                                           29870049
                                                                        29880049
 WRK_CTR_IND = TRUE;                                                    29890049
                                                                        29900049
 EDQBSDS.QCUOHVP = TB_RCBV240.HVP_QUANTITY;                             29910049
                                                                        29920049
 EDQBSDS.SRCCCMD.TAKE_CEDS = 'Y';                                       29930049
 IF EDQBSDS.SRCCCMD.CHSISTM  = '' THEN                                  29940049
 EDQBSDS.SRCCCMD.CHSISTM  = '2';                                        29950049
 IF TB_RCBV240_I.INDNULL(06) = 0 THEN                                   29960049
   EDQBSDS.SRCCCMD.IAGRNBR = TB_RCBV240.CONTRACT_NUMBER;                29970049
                                                                        29980049
 IF TB_RCBV240_I.INDNULL(10) = 0 THEN                                   29990049
   EDQBSDS.SRCCCMD.RHSIESA(1).IHSIESA = TB_RCBV240.SERVICE_MODULE_1;    30000049
                                                                        30010049
 IF TB_RCBV240_I.INDNULL(11) = 0 THEN                                   30020049
   EDQBSDS.SRCCCMD.RHSIESA(2).IHSIESA = TB_RCBV240.SERVICE_MODULE_2;    30030049
                                                                        30040049
 IF TB_RCBV240_I.INDNULL(12) = 0 THEN                                   30050049
   EDQBSDS.SRCCCMD.RHSIESA(3).IHSIESA = TB_RCBV240.SERVICE_MODULE_3;    30060049
                                                                        30070049
 IF TB_RCBV240_I.INDNULL(13) = 0 THEN                                   30080049
   EDQBSDS.SRCCCMD.RHSIESA(4).IHSIESA = TB_RCBV240.SERVICE_MODULE_4;    30090049
                                                                        30100049
 IF TB_RCBV240_I.INDNULL(14) = 0 THEN                                   30110049
   EDQBSDS.SRCCCMD.RHSIESA(5).IHSIESA = TB_RCBV240.SERVICE_MODULE_5;    30120049
                                                                        30130049
 IF TB_RCBV240_I.INDNULL(15) = 0 THEN                                   30140049
   EDQBSDS.CAGRFOR = TB_RCBV240.AGREEMENT_TYPE;                         30150049
                                                                        30160049
 IF TB_RCBV240_I.INDNULL(16) = 0 THEN                                   30170049
   EDQBSDS.CAGROPT = TB_RCBV240.AGREEMENT_OPTION;                       30180049
                                                                        30190049
 IF TB_RCBV240_I.INDNULL(17) = 0 THEN                                   30200049
   EDQBSDS.CAGRMSO = TB_RCBV240.SPECIAL_OPTION;                         30210049
                                                                        30220049
 IF TB_RCBV240_I.INDNULL(18) = 0 THEN                                   30230049
   EDQBSDS.CAGRIAH = TB_RCBV240.AMENDM_COMB_CODE;                       30240049
                                                                        30250049
 IF TB_RCBV240_I.INDNULL(19) = 0 THEN                                   30260049
   EDQBSDS.SRCCCMD.RAGRWCP(1).DAGRMFR =                                 30270049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_1);30280049
                                                                        30290049
 IF TB_RCBV240_I.INDNULL(20) = 0 THEN                                   30300049
   EDQBSDS.SRCCCMD.RAGRWCP(1).DAGRMTO =                                 30310049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_1);  30320049
                                                                        30330049
 IF TB_RCBV240_I.INDNULL(21) = 0 THEN                                   30340049
   EDQBSDS.SRCCCMD.RAGRWCP(2).DAGRMFR =                                 30350049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_2);30360049
                                                                        30370049
 IF TB_RCBV240_I.INDNULL(22) = 0 THEN                                   30380049
   EDQBSDS.SRCCCMD.RAGRWCP(2).DAGRMTO =                                 30390049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_2);  30400049
                                                                        30410049
 IF TB_RCBV240_I.INDNULL(23) = 0 THEN                                   30420049
   EDQBSDS.SRCCCMD.RAGRWCP(3).DAGRMFR =                                 30430049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_3);30440049
                                                                        30450049
 IF TB_RCBV240_I.INDNULL(24) = 0 THEN                                   30460049
   EDQBSDS.SRCCCMD.RAGRWCP(3).DAGRMTO =                                 30470049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_3);  30480049
                                                                        30490049
 IF TB_RCBV240_I.INDNULL(25) = 0 THEN                                   30500049
   EDQBSDS.SRCCCMD.RAGRWCP(4).DAGRMFR =                                 30510049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_4);30520049
                                                                        30530049
 IF TB_RCBV240_I.INDNULL(26) = 0 THEN                                   30540049
   EDQBSDS.SRCCCMD.RAGRWCP(4).DAGRMTO =                                 30550049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_4);  30560049
                                                                        30570049
 IF TB_RCBV240_I.INDNULL(27) = 0 THEN                                   30580049
   EDQBSDS.SRCCCMD.RAGRWCP(5).DAGRMFR =                                 30590049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_5);30600049
                                                                        30610049
 IF TB_RCBV240_I.INDNULL(28) = 0 THEN                                   30620049
   EDQBSDS.SRCCCMD.RAGRWCP(5).DAGRMTO =                                 30630049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_5);  30640049
                                                                        30650049
 IF TB_RCBV240_I.INDNULL(29) = 0 THEN                                   30660049
   EDQBSDS.SRCCCMD.RAGRWCP(6).DAGRMFR =                                 30670049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_6);30680049
                                                                        30690049
 IF TB_RCBV240_I.INDNULL(30) = 0 THEN                                   30700049
   EDQBSDS.SRCCCMD.RAGRWCP(6).DAGRMTO =                                 30710049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_6);  30720049
                                                                        30730049
 IF TB_RCBV240_I.INDNULL(31) = 0 THEN                                   30740049
   EDQBSDS.SRCCCMD.RAGRWCP(7).DAGRMFR =                                 30750049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_7);30760049
                                                                        30770049
 IF TB_RCBV240_I.INDNULL(32) = 0 THEN                                   30780049
   EDQBSDS.SRCCCMD.RAGRWCP(7).DAGRMTO =                                 30790049
                           R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_7);  30800049
                                                                        30810049
 /* CALL RCBCS4M_RTREV_SRVICE_DLVRY_CONS; */             /* RB01299 */  30820049
                                                                        30830049
                                                                        30840049
 EDQBSDS.SRCCCMD.SSRCIND = TB_RCBV240.SOURCE_INDICATOR;                 30850049
                                                                        30860049
 EDQBSDS.SRCCCMD.DDBSEFF = SUBSTR(TB_RCBV240.EFFECTIVE_DATE,1,4) ||     30870049
                           SUBSTR(TB_RCBV240.EFFECTIVE_DATE,6,2) ||     30880049
                           SUBSTR(TB_RCBV240.EFFECTIVE_DATE,9,2);       30890049
                                                                        30900049
 EDQBSDS.SRCCCMD.DDBSMED = SUBSTR(TB_RCBV240.END_DATE,1,4) ||           30910049
                           SUBSTR(TB_RCBV240.END_DATE,6,2) ||           30920049
                           SUBSTR(TB_RCBV240.END_DATE,9,2);             30930049
                                                                        30940049
 IF OUT_OF_COUNTRY & TB_RCBV400_I.INDNULL(14) = 0 THEN                  30950049
   DO;                                                                  30960049
     EDQBSDS.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV400.SERVICE_LVL_CODE_1;  30970049
     WRK_CTR_IND = FALSE;                                               30980049
     CALL RCBCS4M_READ_SERV_COND(TB_RCBV400.SERVICE_LVL_CODE_1);        30990049
   END;                                                                 31000049
 ELSE                                                                   31010049
   DO;                                                                  31020049
     IF TB_RCBV240_I.INDNULL(34) = 0 THEN                               31030049
       DO;                                                              31040049
         EDQBSDS.SRCCCMD.SERVICE_LVL_CODE = TB_RCBV240.SERVICE_LVL_CODE;31050049
         CALL RCBCS4M_READ_SERV_COND (TB_RCBV240.SERVICE_LVL_CODE);     31060049
       END;                                                             31070049
   END;                                                                 31080049
                                                                        31090049
                                                       /* SOC RB01299 */31100049
 IF EDQBSDS.SRCCCMD.SERVICE_LVL_CODE = '' THEN                          31110049
    DO;                                                                 31120049
       CALL RCBCS4M_RTREV_SRVICE_DLVRY_CONS;                            31130049
    END;                                                                31140049
                                                       /* EOC RB01299 */31150049
 CALL RCBCS4M_READ_CONTRACT;                                            31160049
                                                                        31170049
 END RCBCS4M_MOVE_SERV_CTR;                                             31180049
                                                       /* EOC RB01288 */31190049
1/*********************************************************************/31200049
 /*                                                       SOC RB01288 */31210049
 /* MODULE NAME      : RCBCS4M_RTREV_SRVICE_DLVRY_CONS                */31220049
 /*                                                                   */31230049
 /* DESCRIPTION      : PASSING SDM TO DOWNSTREAM I.S.O. SERVICE TYPE  */31240049
 /*                                                                   */31250049
 /*********************************************************************/31260049
0RCBCS4M_RTREV_SRVICE_DLVRY_CONS: PROC;                                 31270049
                                                                        31280049
 TB_RCBV645                  = '';                                      31290049
 TB_RCBV645_I.INDNULL(*)     = 0;                                       31300049
 TB_RCBV645.SERVICE_TYPE     = TB_RCBV240.SERVICE_TYPE;                 31310049
                                                                        31320049
 EXEC SQL                                                               31330049
   SELECT * INTO : TB_RCBV645 :TB_RCBV645_I.INDNULL                     31340049
   FROM RCBT0645_CTRY_SVT                                               31350049
   WHERE     SERVICE_TYPE    =  :TB_RCBV645.SERVICE_TYPE                31360049
   AND       COUNTRY_NUMBER  =  :REFCTRY                                31370049
   AND       CONSOLIDATE_IND =  'Y' ;                                   31380049
                                                                        31390049
 SELECT (SQLCA.SQLCODE);                                                31400049
 WHEN (0)                                                               31410049
 DO;                                                                    31420049
   EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD  = TB_RCBV645.SERVICE_DLVR_METHD; 31430049
 END;                                                                   31440049
 WHEN (100)                                                             31450049
 DO;                                                                    31460049
   EDQBSDS.SRCCCMD.SERVICE_DLVR_METHD  = TB_RCBV240.SERVICE_TYPE;       31470049
 END;                                                                   31480049
 OTHERWISE                                                              31490049
 DO;                                                                    31500049
   RCBCQES.MESSAGE_NUMBER = 'C272';                                     31510049
   WRK_SQLCODE = SQLCA.SQLCODE;                                         31520049
   WRK_TABLE = 'RCBV0645_HW_STATUS';                                    31530049
   CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                     31540049
 END;                                                                   31550049
 END;                                                                   31560049
 END RCBCS4M_RTREV_SRVICE_DLVRY_CONS;                 /* EOC RB01288 */ 31570049
1/*********************************************************************/31580049
 /*                                                       SOC RB01288 */31590049
 /* MODULE NAME      : RCBCS4M_READ_CONTRACT                          */31600049
 /*                                                                   */31610049
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0030    */31620049
 /*                                                                   */31630049
 /*                                                                   */31640049
 /*********************************************************************/31650049
0RCBCS4M_READ_CONTRACT : PROC;                                          31660049
                                                                        31670049
 TB_RCBV030 = '';                                          /* RB01290 */31680049
                                                                        31690049
0EXEC SQL                                                               31700049
      SELECT  TYPE_OF_CONTRACT                                          31710049
        INTO :TB_RCBV030.TYPE_OF_CONTRACT  :WRK_INDNULL                 31720049
        FROM  RCBV0030_CONTRACT  T030                                   31730049
       WHERE  T030.COUNTRY_NUMBER  = :REFCTRY                           31740049
         AND  T030.CONTRACT_NUMBER = :TB_RCBV240.CONTRACT_NUMBER        31750049
      WITH UR;                                                          31760049
                                                                        31770049
 SELECT(SQLCA.SQLCODE);                                                 31780049
   WHEN(0)                                                              31790049
     EDQBSDS.SRCCCMD.IAGRTCN = TB_RCBV030.TYPE_OF_CONTRACT;             31800049
   WHEN(100);                                                           31810049
   OTHERWISE                                                            31820049
     DO;                                                                31830049
       RCBCQES.MESSAGE_NUMBER = 'C273';                                 31840049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     31850049
       WRK_TABLE = 'RCBT0030_CONTRACT';                                 31860049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 31870049
     END;                                                               31880049
 END;                                                                   31890049
                                                                        31900049
 END RCBCS4M_READ_CONTRACT;                            /* EOC RB01288 */31910049
                                                                        31920049
1/*********************************************************************/31930049
 /*                                                       SOC RB01288 */31940049
 /* MODULE NAME      : RCBCS4M_READ_HV_CTR                            */31950049
 /*                                                                   */31960049
 /* DESCRIPTION      : EXTEND LOOKUP TO READ THE HIGH VOLUME CONTRACT */31970049
 /*                    DATA FROM RCBT0240 FOR THE REFERENCED ROW      */31980049
 /*                                                                   */31990049
 /*                                                                   */32000049
 /*********************************************************************/32010049
0RCBCS4M_READ_HV_CTR : PROC;                                            32020049
                                                                        32030049
 SWITCH_HV_CTR       = FALSE;                                           32040049
 WRK_CUSTOMER_NUMBER = '';                                              32050049
 WRK_MODEL_NUMBER    = '';                                              32060049
 WRK_SEQUENCE_NUMBER = '';                                              32070049
                                   /* FETCH CUSTOMER AND MODEL NUMBER */32080049
 IF TB_RCBV051.SOURCE_INDICATOR = 'O' THEN /* FROM T051 IF SOURCE IND */32090049
   DO;                               /* IS EQUAL TO 'O' ELSE FROM BAU */32100049
     EXEC SQL                                                           32110049
          SELECT CUSTOMER_NUMBER,                                       32120049
                 MODEL_NUMBER                                           32130049
          INTO  :WRK_CUSTOMER_NUMBER       :WRK_INDNULL                 32140049
               ,:WRK_MODEL_NUMBER          :WRK_INDNULL                 32150049
          FROM   RCBV0051_PI_HW_PR                                      32160049
          WHERE  COUNTRY_NUMBER  = :REFCTRY                             32170049
            AND  PRODUCT_TYPE    = :REQTYPE                             32180049
            AND  ORIGIN          = :REQORIG                             32190049
            AND  SEQUENCE_NUMBER = :REQSEQN                             32200049
            AND :DATE10    BETWEEN INSTALL_DATE                         32210049
                               AND WARRANTY_EXP_DATE                    32220049
          ;                                                             32230049
                                                                        32240049
     SELECT (SQLCA.SQLCODE);                                            32250049
       WHEN (0)                                                         32260049
         SWITCH_HV_CTR = TRUE;                                          32270049
       WHEN (100);                                                      32280049
       OTHERWISE                                                        32290049
         DO;                                                            32300049
           RCBCQES.MESSAGE_NUMBER = 'C274';                             32310049
           WRK_SQLCODE = SQLCA.SQLCODE;                                 32320049
           WRK_TABLE = 'RCBV0051_PI_HW';                                32330049
           CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);             32340049
         END;                                                           32350049
     END;                        /* IF MODEL NUMBER IS BLANK THEN    */ 32360049
     IF  SWITCH_HV_CTR = TRUE    /* FETCH MODEL NUMBER FROM BAU T300 */ 32370049
        &WRK_MODEL_NUMBER = '' THEN                                     32380049
       DO;                                                              32390049
          EXEC SQL                                                      32400049
               SELECT MODEL_NUMBER                                      32410049
                INTO :WRK_MODEL_NUMBER        :WRK_INDNULL              32420049
               FROM   RCBV0300_HW_REAL T300                             32430049
               WHERE  T300.COUNTRY_NUMBER   = :REFCTRY                  32440049
                 AND  T300.PRODUCT_TYPE     = :REQTYPE                  32450049
                 AND  T300.ORIGIN           = :REQORIG                  32460049
                 AND  T300.SEQUENCE_NUMBER  = :REQSEQN                  32470049
                 AND :DATE10          BETWEEN T300.EFFECTIVE_DATE       32480049
                                          AND T300.END_DATE             32490049
               WITH UR;                                                 32500049
                                                                        32510049
          SELECT(SQLCA.SQLCODE);                                        32520049
            WHEN(0)                                                     32530049
              SWITCH_HV_CTR = TRUE;                                     32540049
            WHEN(100)                                                   32550049
              SWITCH_HV_CTR = FALSE;                                    32560049
            OTHERWISE                                                   32570049
              DO;                                                       32580049
                RCBCQES.MESSAGE_NUMBER = 'C275';                        32590049
                WRK_SQLCODE = SQLCA.SQLCODE;                            32600049
                WRK_TABLE = 'RCBV0300_HW_REAL';                         32610049
                CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);        32620049
              END;                                                      32630049
          END;                                                          32640049
       END;                                                             32650049
   END;                                                                 32660049
 ELSE                                                                   32670049
   DO;                                                                  32680049
                        /* TO FETCH CUSTOMER NUMBER AND MODEL NUMBER */ 32690049
     EXEC SQL                     /* FROM T190 AND T300 RESPECTIVELY */ 32700049
          SELECT T190.CUSTOMER_NUMBER,                                  32710049
                 T300.MODEL_NUMBER                                      32720049
           INTO :WRK_CUSTOMER_NUMBER     :WRK_INDNULL ,                 32730049
                :WRK_MODEL_NUMBER        :WRK_INDNULL                   32740049
          FROM   RCBV0190_HW_CUST T190,                                 32750049
                 RCBV0300_HW_REAL T300                                  32760049
          WHERE  T190.COUNTRY_NUMBER   = :REFCTRY                       32770049
            AND  T190.PRODUCT_TYPE     = :REQTYPE                       32780049
            AND  T190.ORIGIN           = :REQORIG                       32790049
            AND  T190.SEQUENCE_NUMBER  = :REQSEQN                       32800049
            AND  T190.TYPE_OF_RELATION = 'U'         /* CEDS00000468 */ 32801051
            AND :DATE10          BETWEEN T190.EFFECTIVE_DATE            32810049
                                     AND T190.END_DATE                  32820049
            AND  T300.COUNTRY_NUMBER   = T190.COUNTRY_NUMBER            32830049
            AND  T300.PRODUCT_TYPE     = T190.PRODUCT_TYPE              32840049
            AND  T300.ORIGIN           = T190.ORIGIN                    32850049
            AND  T300.SEQUENCE_NUMBER  = T190.SEQUENCE_NUMBER           32860049
            AND :DATE10          BETWEEN T300.EFFECTIVE_DATE            32870049
                                     AND T300.END_DATE                  32880049
          WITH UR;                                                      32890049
                                                                        32900049
     SELECT(SQLCA.SQLCODE);                                             32910049
       WHEN(0)                                                          32920049
         SWITCH_HV_CTR = TRUE;                                          32930049
       WHEN(100)                                                        32940049
         SWITCH_HV_CTR = FALSE;                                         32950049
       OTHERWISE                                                        32960049
         DO;                                                            32970049
           RCBCQES.MESSAGE_NUMBER = 'C276';                             32980049
           WRK_SQLCODE = SQLCA.SQLCODE;                                 32990049
           WRK_TABLE = 'T190 & T300';                                   33000049
           CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);             33010049
         END;                                                           33020049
     END;                                                               33030049
   END;                                                                 33040049
                                 /* FETCH THE SEQUENCE NUMBER       */  33050049
 IF SWITCH_HV_CTR = TRUE THEN    /* FOR THE REQUESTED TYPE WITH THE */  33060049
   DO;                           /* NEW CUSTOMER AND MODEL NUMBER   */  33070049
                                 /* WITH ORIGIN = 'HV'              */  33080049
      EXEC SQL                                                          33090049
           SELECT T190.SEQUENCE_NUMBER                                  33100049
           INTO  :WRK_SEQUENCE_NUMBER                                   33110049
           FROM   RCBV0190_HW_CUST T190,                                33120049
                  RCBV0300_HW_REAL T300                                 33130049
           WHERE  T190.COUNTRY_NUMBER  = :REFCTRY                       33140049
             AND  T190.PRODUCT_TYPE    = :REQTYPE                       33150049
             AND  T190.ORIGIN          = 'HV'                           33160049
             AND  T190.CUSTOMER_NUMBER = :WRK_CUSTOMER_NUMBER           33170049
             AND  T190.TYPE_OF_RELATION = 'U'       /* CEDS00000468 */  33171051
             AND :DATE10 BETWEEN T190.EFFECTIVE_DATE                    33180049
                             AND T190.END_DATE                          33190049
             AND  T300.COUNTRY_NUMBER  = T190.COUNTRY_NUMBER            33200049
             AND  T300.PRODUCT_TYPE    = T190.PRODUCT_TYPE              33210049
             AND  T300.ORIGIN          = 'HV'                           33220049
             AND  T300.MODEL_NUMBER    = :WRK_MODEL_NUMBER              33230049
             AND  T300.SEQUENCE_NUMBER = T190.SEQUENCE_NUMBER           33240049
             AND :DATE10 BETWEEN T300.EFFECTIVE_DATE                    33250049
                             AND T300.END_DATE                          33260049
           ;                                                            33270049
                                                                        33280049
      SELECT (SQLCA.SQLCODE);                                           33290049
        WHEN (0)                                                        33300049
          SWITCH_HV_CTR = TRUE;                                         33310049
        WHEN (100)                                                      33320049
          SWITCH_HV_CTR = FALSE;                                        33330049
        OTHERWISE                                                       33340049
          DO;                                                           33350049
            RCBCQES.MESSAGE_NUMBER = 'C277';                            33360049
            WRK_SQLCODE = SQLCA.SQLCODE;                                33370049
            WRK_TABLE = 'T190 & T300';                                  33380049
            CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);            33390049
          END;                                                          33400049
      END;                                                              33410049
   END;                                                                 33420049
                                 /* FETCH HIGH VOLUME CONTRACT DATA */  33430049
 IF SWITCH_HV_CTR = TRUE THEN    /* FOR THE NEW SEQUENCE NUMBER     */  33440049
   DO;                           /* WITH ORIGIN = 'HV'              */  33450049
      EXEC SQL                                                          33460049
           SELECT T240.COUNTRY_NUMBER    ,                              33470049
                  T240.PRODUCT_TYPE      ,                              33480049
                  T240.ORIGIN            ,                              33490049
                  T240.SEQUENCE_NUMBER   ,                              33500049
                  T240.HVP_QUANTITY      ,                              33510049
                  T240.CONTRACT_NUMBER   ,                              33520049
                  T240.SERVICE_START_DATE,                              33530049
                  T240.SERVICE_STOP_DATE ,                              33540049
                  T240.SUPPL_CTR_NUMBER  ,                              33550049
                  T240.SERVICE_MODULE_1  ,                              33560049
                  T240.SERVICE_MODULE_2  ,                              33570049
                  T240.SERVICE_MODULE_3  ,                              33580049
                  T240.SERVICE_MODULE_4  ,                              33590049
                  T240.SERVICE_MODULE_5  ,                              33600049
                  T240.AGREEMENT_TYPE    ,                              33610049
                  T240.AGREEMENT_OPTION  ,                              33620049
                  T240.SPECIAL_OPTION    ,                              33630049
                  T240.AMENDM_COMB_CODE  ,                              33640049
                  T240.COVERAGE_START_1  ,                              33650049
                  T240.COVERAGE_END_1    ,                              33660049
                  T240.COVERAGE_START_2  ,                              33670049
                  T240.COVERAGE_END_2    ,                              33680049
                  T240.COVERAGE_START_3  ,                              33690049
                  T240.COVERAGE_END_3    ,                              33700049
                  T240.COVERAGE_START_4  ,                              33710049
                  T240.COVERAGE_END_4    ,                              33720049
                  T240.COVERAGE_START_5  ,                              33730049
                  T240.COVERAGE_END_5    ,                              33740049
                  T240.COVERAGE_START_6  ,                              33750049
                  T240.COVERAGE_END_6    ,                              33760049
                  T240.COVERAGE_START_7  ,                              33770049
                  T240.COVERAGE_END_7    ,                              33780049
                  T240.SERVICE_TYPE      ,                              33790049
                  T240.SERVICE_LVL_CODE  ,                              33800049
                  T240.SOURCE_INDICATOR  ,                              33810049
                  T240.LAST_CHANGE_DATE  ,                              33820049
                  T240.EFFECTIVE_DATE    ,                              33830049
                  T240.END_DATE                                         33840049
            INTO :TB_RCBV240                                            33850049
                 :TB_RCBV240_I.INDNULL                                  33860049
           FROM   RCBV0240_SERV_CTR   T240,                             33870049
                  RCBV0220_SUPPL_CTR  T220                              33880049
           WHERE  T240.COUNTRY_NUMBER  = :REFCTRY                       33890049
             AND  T240.PRODUCT_TYPE    = :REQTYPE                       33900049
             AND  T240.ORIGIN          = 'HV'                           33910049
             AND  T240.SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER           33920049
             AND :DATE10         BETWEEN T240.EFFECTIVE_DATE            33930049
                                     AND T240.END_DATE                  33940049
             AND  T220.COUNTRY_NUMBER  = T240.COUNTRY_NUMBER            33950049
             AND  T220.PRODUCT_TYPE    = T240.PRODUCT_TYPE              33960049
             AND  T220.ORIGIN          = T240.ORIGIN                    33970049
             AND  T220.SEQUENCE_NUMBER = T240.SEQUENCE_NUMBER           33980049
             AND  T220.TYPE_OF_MAINT   = '2'                            33990049
             AND :DATE10         BETWEEN T220.EFFECTIVE_DATE            34000049
                                     AND T220.END_DATE                  34010049
           WITH UR;                                                     34020049
                                                                        34030049
      SELECT(SQLCA.SQLCODE);                                            34040049
        WHEN(0)                                                         34050049
          DO;                                                           34060049
            CALL RCBCS4M_MOVE_SERV_CTR;                                 34070049
            SWITCH_HV_CTR = TRUE;                                       34080049
          END;                                                          34090049
        WHEN(100)                                                       34100049
          DO;                                                           34110049
            SWITCH_HV_CTR = FALSE;                                      34120049
          END;                                                          34130049
        OTHERWISE                                                       34140049
          DO;                                                           34150049
            RCBCQES.MESSAGE_NUMBER = 'C278';                            34160049
            WRK_SQLCODE = SQLCA.SQLCODE;                                34170049
            WRK_TABLE = 'RCBT0240_SERV_CTR';                            34180049
            CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);            34190049
          END;                                                          34200049
      END;                                                              34210049
   END;                                                                 34220049
                                                                        34230049
 IF SWITCH_HV_CTR = FALSE THEN                                          34240049
   DO;                                                                  34250049
    IF SWITCH_READ_BAU_WAR = FALSE THEN                                 34260049
      DO;                                                               34270049
          CALL RCBCS4M_CALC_SLC;                                        34280049
      END;                                                              34290049
   END;                                                                 34300049
                                                                        34310049
 END RCBCS4M_READ_HV_CTR;                              /* EOC RB01288 */34320049
                                                       /* SOC RB01289 */34330049
1/*********************************************************************/34340049
 /*                                                                   */34350049
 /* MODULE NAME      : RCBBCS4M_READ_CUST_NUM                RB01289  */34360049
 /*                                                                   */34370049
 /* DESCRIPTION      : READ CUSTOMER NUMBER FROM TABLES RCBT0010_CUST */34380049
 /*                    OMER, RCBT0011_PI_CUST AND RCBT0190_HW_CUST    */34390049
 /*********************************************************************/34400049
 RCBBCS4M_READ_CUST_NUM: PROC;                                          34410049
                                                                        34420049
 EXEC SQL                                                               34430049
      SELECT CUSTOMER_NUMBER                                            34440049
       INTO :WRK_T190_CUST_NUM  :WRK_INDNULL                            34450049
      FROM   RCBV0190_HW_CUST                                           34460049
      WHERE  COUNTRY_NUMBER   = :REFCTRY                                34470049
        AND  PRODUCT_TYPE     = :REQTYPE                                34480049
        AND  ORIGIN           = :REQORIG                                34490049
        AND  SEQUENCE_NUMBER  = :REQSEQN                                34500049
        AND  TYPE_OF_RELATION = 'U'                   /* CEDS00000468 */34501051
        AND :DATE10     BETWEEN EFFECTIVE_DATE                          34510049
                            AND END_DATE                                34520049
      WITH UR;                                                          34530049
                                                                        34540049
 SELECT(SQLCA.SQLCODE);                                                 34550049
   WHEN(0);                                                             34560049
   WHEN(100)                                                            34570049
     WRK_T190_CUST_NUM = '';                                            34580049
   OTHERWISE                                                            34590049
     DO;                                                                34600049
       RCBCQES.MESSAGE_NUMBER = 'C279';                                 34610049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     34620049
       WRK_TABLE = 'RCBV0190_HW_CUST';                                  34630049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 34640049
     END;                                                               34650049
 END;                                                                   34660049
                                                                        34670049
                                                                        34680049
 EXEC SQL                                                               34690049
      SELECT CUSTOMER_NUMBER                                            34700049
       INTO :WRK_T011_CUST_NUM    :WRK_INDNULL                          34710049
      FROM   RCBV0011_PI_CUST                                           34720049
      WHERE  COUNTRY_NUMBER     = :REFCTRY                              34730049
        AND  CUSTOMER_NUMBER    = :TB_RCBV051.CUSTOMER_NUMBER           34740049
        AND  CUSTOMER_NR_EXTEND = :TB_RCBV051.CUSTOMER_NR_EXTEND        34750049
      WITH UR;                                                          34760049
                                                                        34770049
 SELECT(SQLCA.SQLCODE);                                                 34780049
   WHEN(0);                                                             34790049
   WHEN(100)                                                            34800049
     WRK_T011_CUST_NUM = '';                                            34810049
   OTHERWISE                                                            34820049
     DO;                                                                34830049
       RCBCQES.MESSAGE_NUMBER = 'C280';                                 34840049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     34850049
       WRK_TABLE = 'RCBV0011_PI_CUST';                                  34860049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 34870049
     END;                                                               34880049
 END;                                                                   34890049
                                                                        34900049
                                                                        34910049
 EXEC SQL                                                               34920049
      SELECT CUSTOMER_NUMBER                                            34930049
       INTO :WRK_T010_CUST_NUM  :WRK_INDNULL                            34940049
       FROM  RCBV0010_CUSTOMER                                          34950049
      WHERE  COUNTRY_NUMBER   = :REFCTRY                                34960049
        AND  CUSTOMER_NUMBER  = :TB_RCBV051.CUSTOMER_NUMBER             34970049
        AND :DATE10     BETWEEN EFFECTIVE_DATE                          34980049
                            AND END_DATE                                34990049
      WITH UR;                                                          35000049
                                                                        35010049
 SELECT(SQLCA.SQLCODE);                                                 35020049
   WHEN(0);                                                             35030049
   WHEN(100)                                                            35040049
     WRK_T010_CUST_NUM = '';                                            35050049
   OTHERWISE                                                            35060049
     DO;                                                                35070049
       RCBCQES.MESSAGE_NUMBER = 'C281';                                 35080049
       WRK_SQLCODE = SQLCA.SQLCODE;                                     35090049
       WRK_TABLE = 'RCBV0010_CUSTOMER';                                 35100049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 35110049
     END;                                                               35120049
 END;                                                                   35130049
                                                                        35140049
 END RCBBCS4M_READ_CUST_NUM;                           /* EOC RB01289 */35150049
1/*********************************************************************/35160049
 /*                                                                   */35170049
 /* MODULE NAME      : RCBCS4M_CHECK_LENOVO                 RB01272   */35180049
 /*                                                                   */35190049
 /* DESCRIPTION      : CHECK THAT THE RETRIEVED PI DATA IS EITHER AN  */35200049
 /*                    IBM MACHINE OR A LENOVO MACHINE AND SET THE    */35210049
 /*                    SOURCE INDICATOR ACCORDINGLY.                  */35220049
 /*                                                                   */35230049
 /*                    THIS USES THE PLINCL RCBLENO WHICH CALCULATES  */35240049
 /*                    THE LENOVO TRANSACTION INDICATOR (LTI).        */35250049
 /*                    - A VALUE OF BLANK MEANS IT IS NOT LENOVO      */35260049
 /*                      THERFORE LEAVE THE SOURCE INDICATOR AS IS    */35270049
 /*                    - A VALUE OF '1' MEANS LENOVO BASE WARRANTY    */35280049
 /*                      CHANGE THE SOURCE INSICATOR TO 'Y'           */35290049
 /*                    - A VALUE OF '2' MEANS LENOVE SERVICE OFFERING */35300049
 /*                      CHANGE THE SOURCE INSICATOR TO 'Z'           */35310049
 /*                                                                   */35320049
 /*********************************************************************/35330049
0RCBCS4M_CHECK_LENOVO : PROC;                                           35340049
                                                                        35350049
 IF SWITCH_READ_PI_CTR = FALSE THEN                    /* SOC RB01288 */35360049
   DO;                                                                  35370049
      EXEC SQL                                                          35380049
           SELECT AUTHORISATION_CODE,                                   35390049
                  EFFECTIVE_DATE,                                       35400049
                  END_DATE                                              35410049
            INTO :TB_RCBV241.AUTHORISATION_CODE :WRK_INDNULL,           35420049
                 :TB_RCBV241.EFFECTIVE_DATE,                            35430049
                 :TB_RCBV241.END_DATE                                   35440049
           FROM   RCBV0241_PI_CTR  T241                                 35450049
           WHERE  T241.COUNTRY_NUMBER  = :REFCTRY                       35460049
             AND  T241.PRODUCT_TYPE    = :REQTYPE                       35470049
             AND  T241.ORIGIN          = :REQORIG                       35480049
             AND  T241.SEQUENCE_NUMBER = :REQSEQN                       35490049
             AND  :DATE10        BETWEEN T241.EFFECTIVE_DATE            35500049
                                     AND T241.END_DATE                  35510049
           WITH UR;                                                     35520049
                                                                        35530049
      SELECT(SQLCA.SQLCODE);                                            35540049
        WHEN(0);                                                        35550049
        WHEN(100);                                                      35560049
        OTHERWISE                                                       35570049
          DO;                                                           35580049
            RCBCQES.MESSAGE_NUMBER = 'C282';                            35590049
            WRK_SQLCODE = SQLCA.SQLCODE;                                35600049
            WRK_TABLE = 'RCBT0241_PI_CTR';                              35610049
            CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);            35620049
          END;                                                          35630049
      END;                                                              35640049
   END;                                                /* EOC RB01288 */35650049
                                                                        35660049
 WRK_LENOVO_TI = CALCULATE_LTI (TB_RCBV051.WARRANTY_EXP_DATE,           35670049
                                TB_RCBV241.AUTHORISATION_CODE,          35680049
                                TB_RCBV241.EFFECTIVE_DATE,              35690049
                                TB_RCBV241.END_DATE,                    35700049
                                DATE10,                                 35710049
                                TB_RCBV051.WARRANTY_LIABILITY);         35720049
                                                           /* RB01283 */35730049
                                                                        35740049
 SELECT(WRK_LENOVO_TI);                                                 35750049
   WHEN(' ');                                                           35760049
   WHEN('1')                                                            35770049
     EDQBSDS.SRCCCMD.SSRCIND = 'Y';                                     35780049
   WHEN('2')                                                            35790049
     EDQBSDS.SRCCCMD.SSRCIND = 'Z';                                     35800049
   OTHERWISE;                                                           35810049
 END;                                                                   35820049
                                                                        35830049
 END RCBCS4M_CHECK_LENOVO;                                              35840049
 %INCLUDE RCBLENO;                                                      35850049
1/********************************************************************/ 35860049
 /*      F I N A L    P R O C E S S I N G                            */ 35870049
 /********************************************************************/ 35880049
0RCBCS4M_FINALISATION : PROC;                                           35890049
0SELECT (RESPONSE);                                                     35900049
    WHEN (DFHRESP(NORMAL))                                              35910049
    DO;                                                                 35920049
       EDQBSHS.CRMORET = '0';                                           35930049
    END;                                                                35940049
    WHEN (DFHRESP(INVREQ))                                              35950049
    DO;                                                                 35960049
       EDQBSHS.CRMORET = '3';                                           35970049
       RCBCQES.MESSAGE_NUMBER = 'C206';                                 35980049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 35990049
    END;                                                                36000049
    OTHERWISE                                                           36010049
    DO;                                                                 36020049
       EDQBSHS.CRMORET = '3';                                           36030049
       RCBCQES.MESSAGE_NUMBER = 'C207';                                 36040049
       CALL RCBCS4M_LOG_ERROR (WRK_SQLCODE, WRK_TABLE);                 36050049
    END;                                                                36060049
 END;                                                                   36070049
0EXEC CICS RETURN                                                       36080049
    RESP(RESPONSE);                                                     36090049
0END RCBCS4M_FINALISATION;                                              36100049
1/*********************************************************************/36110049
 /*                                                                   */36120049
 /* MODULE NAME      :  R012_TRANS_TIME                               */36130049
 /*                                                                   */36140049
 /* DESCRIPTION      : TRANSLATE DB2 TIME FORMAT TO EXTRACT FILE     */ 36150049
 /*                    TIME FORMAT                                   */ 36160049
 /*                                                                   */36170049
 /*********************************************************************/36180049
 R012_TRANS_TIME: PROC (DB2_TIME_IN)                                    36190049
                  RETURNS(FIXED DEC(3,0));                              36200049
                                                                        36210049
 DCL DB2_TIME_IN         CHAR(08);                                      36220049
 DCL EXTRACT_TIME_OUT    FIXED DEC(3,0);                    /*PTM1142*/ 36230049
 DCL 1 TIME_IN           BASED(ADDR(DB2_TIME_IN)),                      36240049
      3 HOURS            CHAR(02),                                      36250049
      3 POINT            CHAR(01),                                      36260049
      3 MINUTES          PIC'99';                                       36270049
 DCL TIME_OUT_CHAR       CHAR(03);                                      36280049
 DCL PIC_TIME_OUT_CHAR   PIC'999'  BASED(ADDR(TIME_OUT_CHAR));          36290049
 DCL CALC_HOUR_PART      PIC'99V9';                                     36300049
 DCL HOUR_PART           PIC'999';                                      36310049
                                                                        36320049
                              /* TRANSLATE                           */ 36330049
 TIME_OUT_CHAR = '';                                                    36340049
                                                                        36350049
 IF VERIFY(DB2_TIME_IN,'0123456789.') ¬= 0                              36360049
 THEN EXTRACT_TIME_OUT = 0;                                             36370049
 ELSE DO;                                                               36380049
                                                                        36390049
   SUBSTR(TIME_OUT_CHAR,1,2) = TIME_IN.HOURS;                           36400049
   CALC_HOUR_PART            = (TIME_IN.MINUTES / 6);                   36410049
   HOUR_PART                 = ROUND(CALC_HOUR_PART,0);                 36420049
   PIC_TIME_OUT_CHAR         = PIC_TIME_OUT_CHAR + HOUR_PART;           36430049
   EXTRACT_TIME_OUT          = PIC_TIME_OUT_CHAR;                       36440049
                                                                        36450049
 END;                                                                   36460049
                                                                        36470049
 RETURN(EXTRACT_TIME_OUT);                                              36480049
                                                                        36490049
 END R012_TRANS_TIME;                                                   36500049
1/*********************************************************************/36510049
 /*                                                       SOC RB01298 */36520049
 /* MODULE NAME      :  RCBCS4M_DATE_CALC                             */36530049
 /*                                                                   */36540049
 /* DESCRIPTION      : CALCULATE WARRANTY EXPIRE DATE                 */36550049
 /*                                                                   */36560049
 /*********************************************************************/36570049
 RCBCS4M_DATE_CALC: PROC (WRK_IN_DATE                                   36580049
                        ,WRK_DAY_COUNT)                                 36590049
                         RETURNS (CHAR(10));                            36600049
 DCL WRK_IN_DATE         CHAR(10);                                      36610049
 DCL WRK_DAY_COUNT       FIXED BIN (31);                                36620049
                                                                        36630049
 IF WRK_IN_DATE = '9999-12-31'                                          36640049
 THEN DO;                                                               36650049
   RETURN(WRK_IN_DATE);                                                 36660049
   END;                                                                 36670049
 ELSE DO;                                                               36680049
        DATE_AREA                = '';                                  36690049
        DATE_AREA.WD_IN_FORMAT   = 'ISO';                               36700049
        DATE_AREA.WD_OUT_FORMAT  = 'ISO';                               36710049
        DATE_AREA.WD_FUNCTION    = 'C';                                 36720049
        DATE_AREA.WD_PERIOD_TYPE = 'D';                                 36730049
        DATE_AREA.WD_PERIOD      = WRK_DAY_COUNT;                       36740049
        DATE_AREA.WD_IN_DATE     = WRK_IN_DATE;                         36750049
        CALL RCB004N (ADDR(DATE_AREA));                                 36760049
      END;                                                              36770049
 END RCBCS4M_DATE_CALC;                               /* EOC RB01298 */ 36780049
1/********************************************************************/ 36790049
 /*      E R R O R   L O G G I N G                                   */ 36800049
 /********************************************************************/ 36810049
0RCBCS4M_LOG_ERROR : PROC(ERR_SQLCODE,ERR_TABLE);                       36820049
                                                                        36830049
 DCL ERR_TABLE   CHAR(18);                                              36840049
 DCL ERR_SQLCODE FIXED BIN(31);                                         36850049
                                                                        36860049
 SELECT(ERR_SQLCODE);                                                   36870049
    WHEN (0);                                                           36880049
    WHEN (100)                                                          36890049
       EDQBSHS.REQ.CRMORET = '9';                                       36900049
    WHEN (-923)                                                         36910049
       EDQBSHS.REQ.CRMORET = '8';                                       36920049
    WHEN (9999)                                                         36930049
       EDQBSHS.REQ.CRMORET = '4';                                       36940049
    OTHERWISE                                                           36950049
       EDQBSHS.REQ.CRMORET = '7';                                       36960049
 END;                                                                   36970049
                                                                        36980049
0EDQBSHS.REQ.NTBLNME = ERR_TABLE;                                       36990049
 EDQBSHS.REQ.CRMOSUB = ERR_SQLCODE;                                     37000049
                                                                        37010049
0RCBCQES.MESSAGE_TYPE  = 'IS';                                          37020049
 RCBCQES.LANGUAGE_CODE = 'EN';                                          37030049
 RCBCQES.PROGRAM_ID    = 'RCBCS4M';                                     37040049
 CALL RCBCQEM(RCBCQES_PTR);                                             37050049
 EXEC CICS RETURN;                                                      37060049
0END RCBCS4M_LOG_ERROR;                                                 37070049
-/*-----------------------------------------------------------------@*/ 37080049
 /* IDENTIFIER : $DTSEP                                              */ 37090049
 /* FUNCTION   : ADD SEPARATORS TO DATE OR TIME STRINGS              */ 37100049
 /* DESCRIPTION: IF YEAR HAS 4 DIGITS, YYYYMMDD DATE FORMAT REQUIRED */ 37110049
 /*      OTHERWISE WHICHEVER 6-DIGITS DATE OR TIME FORMAT IS ALLOWED */ 37120049
 /*----------------------------------------------------------------@@*/ 37130049
 $DTSEP:  PROC(DATE_IN,SEP)                                             37140049
          RETURNS(CHAR(10)  VAR)  REORDER;                              37150049
    DCL DATE_IN    CHAR(*);                                             37160049
    DCL SEP        CHAR(01);                                            37170049
    DCL DATE_OUT   CHAR(10)  VAR  INIT('');                             37180049
    DCL LIN        FIXED BIN(15)  INIT(0);                              37190049
    LIN = LENGTH(DATE_IN);                                              37200049
    DATE_OUT = DATE_IN || (2)' ';                                       37210049
    SUBSTR(DATE_OUT,LIN-3,3) =                                          37220049
            SEP || SUBSTR(DATE_IN,LIN-3,2);                             37230049
    SUBSTR(DATE_OUT,LIN,3)   =                                          37240049
            SEP || SUBSTR(DATE_IN,LIN-1,2);                             37250049
    RETURN(DATE_OUT);                                                   37260049
  END  $DTSEP;                                                          37270049
1/*******************************************************************/  37280049
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  37290049
 /*******************************************************************/  37300049
0 %INCLUDE DAIFPLH;                      /* COMPILE DATE/TIME STAMP */  37310049
  $DAIMOD (RCBCS4M);                     /* MODULE TO BE COMPILED   */  37320049
0/*******************************************************************/  37330049
 /* END OF ABR BLOCK '                                              */  37340049
 /*******************************************************************/  37350049
0 END RCBCS4M;                                                          37360049