 /* RCBC35P - ORIGINAL SLC TO MESE SLC TRANSLATION LIST              */ 00010000
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* TRANSACTION CODE    : RC35                                     */   00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME        : RCBC35M                                    */ 00060000
 /*                                                                  */ 00070000
 /* TYPE                : CICS/VS                                    */ 00080000
 /*                                                                  */ 00090000
 /* USED MAPSET         : RCBM35                                     */ 00100000
 /*      MAP            : RCBM35                                     */ 00110000
 /*                     : RCBH35                                     */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION         : ORIGINAL SLC TO MESE SLC TANSLATION LIST   */ 00140000
 /*                       MAINTAINANCE                               */ 00150000
 /*                                                                  */ 00160000
 /* LINKED TRANSACTION  : RC35                                       */ 00170000
 /*                                                                  */ 00180000
 /* MESSAGES            :                                            */ 00190000
 /*                                                                  */ 00200000
 /*                                                                  */ 00210000
 /*  MAINTENANCE LOG :                                               */ 00220000
 /*  ---------------                                                 */ 00230000
 /*                                                                  */ 00240000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00250000
 /*  --------------------------------------------------------------  */ 00260000
 /*  2009-07-27 | RB01301      |CEDS alignment to CHIS 810 - BAU     */ 00270000
 /*             |              |Service Extensions                   */ 00280000
 /*  2009-07-27 | RC01302      |Allow generic SLC '***' value for    */ 00290000
 /*             |              |MESE-SLC field                       */ 00300000
 /********************************************************************/ 00310000
1RCBC35M: PROC(COMMPTR)                                                 00320000
          OPTIONS (MAIN)                                                00330000
          REORDER;                                                      00340000
0/********************************************************************/ 00350000
 /*  EXTERNAL ENTRIES                                                */ 00360000
 /********************************************************************/ 00370000
                                                                        00380000
0DCL PLIXOPT   VAR  CHAR (256)                                          00390000
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;            00400000
                                                                        00410000
 DCL RCB004N ENTRY EXTERNAL;                                            00420000
0/********************************************************************/ 00430000
 /*  BMS RELATED CONSTANTS                                           */ 00440000
 /********************************************************************/ 00450000
 %INCLUDE DFHBMSCA;                                                     00460000
0/********************************************************************/ 00470000
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00480000
 /********************************************************************/ 00490000
 %INCLUDE DFHAID;                                                       00500000
1/********************************************************************/ 00510000
 /*  COMMUNICATION AREA                                              */ 00520000
 /********************************************************************/ 00530000
     %INCLUDE (RCBCP2S);                                                00540000
     %INCLUDE (RCBCHDS);,                                               00550000
     %INCLUDE (RCBC00S);,                                               00560000
     %INCLUDE (RCBC35S);;                                               00570000
0/********************************************************************/ 00580000
 /*  MAP STRUCTURES                                                  */ 00590000
 /********************************************************************/ 00600000
 %INCLUDE (RCBM35);                                                     00610000
0/********************************************************************/ 00620000
 /*  DB2 STRUCTURES                                                  */ 00630000
 /********************************************************************/ 00640000
 DCL 1 RCB692S,                                                         00650000
     %INCLUDE (RCB692S);;                                               00660000
 DCL 1 RCB692SI,                                                        00670000
     %INCLUDE (RCB692SI);;                                              00680000
 DCL 1 RCB470S,                                                         00690000
     %INCLUDE (RCB470S);;                                               00700000
 DCL 1 RCB470SI,                                                        00710000
     %INCLUDE (RCB470SI);;                                              00720000
 DCL 1 RCB560S,                                                         00730000
     %INCLUDE (RCB560S);;                                               00740000
 DCL 1 RCB560SI,                                                        00750000
     %INCLUDE (RCB560SI);;                                              00760000
0/********************************************************************/ 00770000
 /*  INTERFACE AREAS                                                 */ 00780000
 /********************************************************************/ 00790000
 DCL 1 DATE_AREA,                                                       00800000
     %INCLUDE (RCBZ03S);;                                               00810000
0/********************************************************************/ 00820000
 /*  RETURN CODES                                                    */ 00830000
 /********************************************************************/ 00840000
 DCL RESPONSE       FIXED BIN(31) INIT(0);  /*RETURN CODE            */ 00850000
 DCL CODE_EXPLAIN   FIXED BIN(31) INIT(0);  /*RETURN CODE EXPLANATION*/ 00860000
-/********************************************************************/ 00870000
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 00880000
 /********************************************************************/ 00890000
  EXEC SQL  WHENEVER NOT FOUND   CONTINUE   ;/*                      */ 00900000
  EXEC SQL  WHENEVER SQLWARNING  CONTINUE   ;/*                      */ 00910000
  EXEC SQL  WHENEVER SQLERROR    CONTINUE   ;/*                      */ 00920000
0/********************************************************************/ 00930000
 /*  NULL INDICATORS                                                 */ 00940000
 /********************************************************************/ 00950000
 DCL 1 NULL692      BASED(ADDR(RCB692SI)),                              00960000
       3 NUL692A    FIXED BIN(15) INIT(0),                              00970000
       3 NUL692B    FIXED BIN(15) INIT(0),                              00980000
       3 NUL692C    FIXED BIN(15) INIT(0);                              00990000
 /********************************************************************/ 01000000
 /*  WORKING DECLARATIONS                                            */ 01010000
 /********************************************************************/ 01020000
 DCL TRUE           BIT(1)   INIT('1'B);                                01030000
 DCL FALSE          BIT(1)   INIT('0'B);                                01040000
 DCL PF5_FLAG       BIT(1)   INIT('0'B);                                01050000
 DCL ACT_SEL        BIT(1)   INIT('0'B);                                01060000
 DCL ALPHA          CHAR(37)                                            01070000
                    INIT(' ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890');      01080000
 DCL ALPHA1         CHAR(36)                                            01090000
                    INIT('ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890');       01100000
 DCL NUMERIC        CHAR(10)                                            01110000
                    INIT('0123456789');                                 01120000
 DCL T691_FLAG      BIT(1)   INIT('0'B);                                01130000
 DCL T470_FLAG      BIT(1)   INIT('0'B);                                01140000
 DCL T692_UPD_FLAG  BIT(1)   INIT('0'B);                                01150000
 DCL WRK_TIME_IN    CHAR(26) INIT('');                                  01160000
 DCL WRK_ACTIND     CHAR(01);                                           01170000
 DCL WRK_REC_COUNT  FIXED BIN(15);                                      01180000
 DCL WRK_OFFSNAME   CHAR(03);                                           01190000
 DCL WRK_SLC        CHAR(03);                                           01200000
 DCL WRKMAP_DATA    CHAR(500);                                          01210000
 DCL SALINE         CHAR(52) INIT                                       01220000
   ('Set Act to A(dd) D(elete) C(hange) and make changes.');            01230000
 DCL 1 WRKMAP       BASED(ADDR(WRKMAP_DATA)),                           01240000
     %INCLUDE RCBB56N;;                                                 01250000
0/********************************************************************/ 01260000
 /*  MESSAGES                                                        */ 01270000
 /********************************************************************/ 01280000
 DCL ERR_MESSAGE2   CHAR(30) INIT('ERROR IN SENDING MAP ');             01290000
 DCL ERR_MESSAGE3   CHAR(30) INIT('ERROR IN RECEIVING MAP ');           01300000
 DCL ERR_MESSAGE14  CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');      01310000
 DCL ERR_O002       CHAR(75) INIT                                       01320000
  ('INVALID DATE. USE ISO DATE FORMAT: YYYY-MM-DD');                    01330000
 DCL ERR_O004       CHAR(30) INIT('INVALID USE OF FUNCTION KEY');       01340000
 DCL ERR_O005       CHAR(60) INIT                                       01350000
  ('INVALID USE OF FUNCTION KEY. PRESS ENTER TO EXECUTE.');             01360000
 DCL ERR_O022       CHAR(19) INIT('PRESS F5 TO EXECUTE');               01370000
 DCL ERR_O030       CHAR(24) INIT('ALREADY ON FIRST PAGE');             01380000
 DCL ERR_O031       CHAR(23) INIT('ALREADY ON LAST PAGE');              01390000
 DCL ERR_O032       CHAR(75) INIT                                       01400000
  ('NO ITEM SELECTED');                                                 01410000
 DCL ERR_O101       CHAR(33) INIT('FIELD MUST BE FILLED IN CORRECTLY'); 01420000
 DCL ERR_O120       CHAR(65) INIT                                       01430000
  ('Row for update not found. Choose action = A or fill in new values');01440000
 DCL ERR_O121       CHAR(65) INIT                                       01450000
  ('Row for delete not found. Choose action = A or fill in new values');01460000
 DCL ERR_O127       CHAR(48) INIT                                       01470000
  ('Invalid action. Choose one of the valid options');                  01480000
 DCL ERR_O142       CHAR(48) INIT                                       01490000
  ('SERVICE_LEVEL_CODE DOES NOT EXIST');                                01500000
 DCL ERR_O221 CHAR(60) INIT                                             01510000
  ('No items found for this Search Criteria');                          01520000
 DCL ERR_O233       CHAR(48) INIT                                       01530000
  ('OFF_SNAME not registered in T691 Table');                           01540000
 /********************************************************************/ 01550000
 /*  TS AREA                                                         */ 01560000
 /********************************************************************/ 01570000
 DCL 1 TS_REC,                                                          01580000
       3 TS_OFF_SNAME  CHAR(3)  INIT(''),                               01590000
       3 TS_ORI_SLC    CHAR(3)  INIT(''),                               01600000
       3 TS_MESE_SLC   CHAR(3)  INIT('');                               01610000
0/********************************************************************/ 01620000
 /*                 BUILT IN FUNCTIONS                               */ 01630000
 /********************************************************************/ 01640000
0DCL (LENGTH,                                                           01650000
      STRING,                                                           01660000
      SUBSTR,                                                           01670000
      VERIFY,                                                           01680000
      DECIMAL,                                                          01690000
      DATETIME,                                                         01700000
      INDEX,                                                            01710000
      CHAR,                                                             01720000
      NULL,                                                             01730000
      CSTG,                                                             01740000
      STG,                                                              01750000
      ADDR)   BUILTIN;                                                  01760000
-/********************************************************************/ 01770000
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 01780000
 /********************************************************************/ 01790000
  EXEC SQL  INCLUDE  SQLCA                  ;/*                      */ 01800000
-/********************************************************************/ 01810000
 /****   DECLARATIONS OF DB2 CURSORS                              ****/ 01820000
 /********************************************************************/ 01830000
 EXEC SQL DECLARE C_0692 CURSOR FOR                                     01840000
       SELECT OFFERING_SNAME,                                           01850000
              ORIGINAL_SLC,                                             01860000
              ME_SE_SLC                                                 01870000
       FROM  RCBV0692_MESE_SLC                                          01880000
       WHERE ((OFFERING_SNAME       = :SNAMESEL                         01890000
              OR :SNAMESEL_NULL     = 'N')                              01900000
       AND (ORIGINAL_SLC            = :SLCSEL                           01910000
              OR :SLCSEL_NULL       = 'N'))                             01920000
   ORDER BY OFFERING_SNAME,ORIGINAL_SLC                                 01930000
   FOR FETCH ONLY                                                       01940000
   WITH UR;                                                             01950000
                                                                        01960000
1/********************************************************************/ 01970000
 /*              M A I N   P R O C E S S I N G                        */01980000
1/********************************************************************/ 01990000
 RCBM35O.MSGLNO='';                                                     02000000
                                                                        02010000
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         02020000
 WRK_DATE                  = SUBSTR(WRK_TIME_IN,1,10);                  02030000
                                                                        02040000
 IF EIBCALEN = 0 THEN                                                   02050000
 DO;                                                                    02060000
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   02070000
 END;                                                                   02080000
                                                                        02090000
 IF HEADER.NEXT = '99' THEN                                             02100000
 DO;                                                                    02110000
    HEADER.NEXT            = '00';                                      02120000
    CALL RCBC35M_CLEAR_WORK;                                            02130000
    CALL RCBC35M_CLEAR_MAP;                                             02140000
    CALL RCBC35M_SEND_MAP;                                              02150000
 END;                                                                   02160000
 SELECT (EIBAID);                                                       02170000
   WHEN (DFHPF1,DFHPF13)                                                02180000
   DO;                                                                  02190000
     IF HEADER.NEXT = '00' THEN                                         02200000
     DO;                                                                02210000
       CALL RCBC35M_RECEIVE_MAP;                                        02220000
       CALL RCBC35M_SAVE_MAP;                                           02230000
       CALL RCBC35M_HELP_MAP;                                           02240000
     END;                                                               02250000
     ELSE                                                               02260000
     DO;                                                                02270000
      HEADER.NEXT = '00';                                               02280000
      CALL RCBC35M_CLEAR_MAP;                                           02290000
      CALL RCBC35M_CLEAR_WORK;                                          02300000
      RCBM35O.MSGLNO      = ERR_O004;                                   02310000
      RCBM35I.SNAMESELL   = -1;                                         02320000
      CALL RCBC35M_SEND_MAP_CSR;                                        02330000
     END;                                                               02340000
   END;                                                                 02350000
                                                                        02360000
   WHEN (DFHPF2,DFHPF14)                                                02370000
   DO;                                                                  02380000
     IF HEADER.NEXT = '00' THEN                                         02390000
     DO;                                                                02400000
     CALL RCBC35M_CLEAR_WORK;                                           02410000
     CALL RCBC35M_CLEAR_MAP;                                            02420000
     CALL RCBC35M_SEND_MAP;                                             02430000
     END;                                                               02440000
     ELSE DO;                                                           02450000
       HEADER.NEXT = '00';                                              02460000
       CALL RCBC35M_CLEAR_MAP;                                          02470000
       CALL RCBC35M_CLEAR_WORK;                                         02480000
       RCBM35O.MSGLNO      = ERR_O004;                                  02490000
       RCBM35I.SNAMESELL   = -1;                                        02500000
       CALL RCBC35M_SEND_MAP_CSR;                                       02510000
     END;                                                               02520000
   END;                                                                 02530000
                                                                        02540000
   WHEN (DFHPF3,DFHPF15)                                                02550000
   DO;                                                                  02560000
     IF HEADER.NEXT = 'H1' THEN                                         02570000
     DO;                                                                02580000
       HEADER.NEXT = '00';                                              02590000
       CALL RCBC35M_GET_CSR_POS;                                        02600000
       CALL RCBC35M_RESTORE_MAP;                                        02610000
       CALL RCBC35M_CLEAR_WORK;                                         02620000
       CALL RCBC35M_SEND_MAP_CSR;                                       02630000
     END;                                                               02640000
     ELSE                                                               02650000
     DO;                                                                02660000
       HEADER.NEXT    = 'H1';                                           02670000
       CALL RCBC35M_CLEAR_WORK;                                         02680000
       CALL RCBC35M_CLEAR_MAP;                                          02690000
       TS_Q = 'RC00' || EIBTRMID;                                       02700000
       EXEC CICS IGNORE CONDITION QIDERR;                               02710000
       EXEC CICS DELETEQ TS QUEUE(TS_Q);                                02720000
       EXEC CICS HANDLE CONDITION QIDERR;                               02730000
                                                                        02740000
       EXEC CICS XCTL                                                   02750000
            PROGRAM('RCBC20P')                                          02760000
            COMMAREA(COMMAREA)                                          02770000
            LENGTH(CSTG(COMMAREA))                                      02780000
            RESP(RESPONSE)                                              02790000
            RESP2(CODE_EXPLAIN);                                        02800000
     END;                                                               02810000
   END;                                                                 02820000
                                                                        02830000
   WHEN (DFHPF5,DFHPF17)                                                02840000
   DO;                                                                  02850000
     IF HEADER.NEXT = 'H1' THEN                                         02860000
     DO;                                                                02870000
       HEADER.NEXT = '00';                                              02880000
       CALL RCBC35M_CLEAR_MAP;                                          02890000
       CALL RCBC35M_CLEAR_WORK;                                         02900000
       RCBM35O.MSGLNO      = ERR_O004;                                  02910000
       RCBM35I.SNAMESELL   = -1;                                        02920000
       CALL RCBC35M_SEND_MAP_CSR;                                       02930000
     END;                                                               02940000
                                                                        02950000
     CALL RCBC35M_RECEIVE_MAP;                                          02960000
     PF5_FLAG              = TRUE;                                      02970000
     CALL RCBC35M_CHECK_MAP;                                            02980000
     CALL RCBC35M_CLEAR_MAP;                                            02990000
     CALL RCBC35M_GET_MESE;                                             03000000
     CALL RCBC35M_FILL_MAP;                                             03010000
                                                                        03020000
     IF T692_UPD_FLAG = TRUE THEN                                       03030000
     DO;                                                                03040000
       RCBM35O.MSGLNO      = 'UPDATES HAVE BEEN DONE';                  03050000
       T692_UPD_FLAG       = FALSE;                                     03060000
     END;                                                               03070000
     CALL RCBC35M_SAVE_MAP;                                             03080000
     CALL RCBC35M_SEND_MAP;                                             03090000
   END;                                                                 03100000
                                                                        03110000
   WHEN (DFHPF7,DFHPF19)                                                03120000
   DO;                                                                  03130000
     IF HEADER.NEXT = 'H1' THEN                                         03140000
     DO;                                                                03150000
       HEADER.NEXT = '00';                                              03160000
       CALL RCBC35M_CLEAR_MAP;                                          03170000
       CALL RCBC35M_CLEAR_WORK;                                         03180000
       RCBM35O.MSGLNO      = ERR_O004;                                  03190000
       RCBM35I.SNAMESELL   = -1;                                        03200000
       CALL RCBC35M_SEND_MAP_CSR;                                       03210000
     END;                                                               03220000
     IF TS_CNT1 = 0 THEN                                                03230000
     DO;                                                                03240000
       CALL RCBC35M_CLEAR_WORK;                                         03250000
       CALL RCBC35M_CLEAR_MAP;                                          03260000
       CALL RCBC35M_SEND_MAP;                                           03270000
     END;                                                               03280000
                                                                        03290000
     IF L - 15 < 0 THEN                                                 03300000
     DO;                                                                03310000
       J = 0;                                                           03320000
       CALL RCBC35M_FILL_MAP;                                           03330000
       RCBM35O.MSGLNO      = ERR_O030;                                  03340000
       CALL RCBC35M_SEND_MAP;                                           03350000
     END;                                                               03360000
     ELSE DO;                                                           03370000
       J = L - 15;                                                      03380000
       CALL RCBC35M_FILL_MAP;                                           03390000
       CALL RCBC35M_SAVE_MAP;                                           03400000
       CALL RCBC35M_SEND_MAP;                                           03410000
     END;                                                               03420000
   END;                                                                 03430000
                                                                        03440000
   WHEN (DFHPF8,DFHPF20)                                                03450000
   DO;                                                                  03460000
     IF HEADER.NEXT = 'H1' THEN                                         03470000
     DO;                                                                03480000
       HEADER.NEXT = '00';                                              03490000
       CALL RCBC35M_CLEAR_MAP;                                          03500000
       CALL RCBC35M_CLEAR_WORK;                                         03510000
       RCBM35O.MSGLNO      = ERR_O004;                                  03520000
       RCBM35I.SNAMESELL   = -1;                                        03530000
       CALL RCBC35M_SEND_MAP_CSR;                                       03540000
     END;                                                               03550000
     IF TS_CNT1 = 0 THEN                                                03560000
     DO;                                                                03570000
       CALL RCBC35M_CLEAR_WORK;                                         03580000
       CALL RCBC35M_CLEAR_MAP;                                          03590000
       CALL RCBC35M_SEND_MAP;                                           03600000
     END;                                                               03610000
                                                                        03620000
     IF J >= TS_CNT1 THEN                                               03630000
     DO;                                                                03640000
       J = J - K;                                                       03650000
       CALL RCBC35M_FILL_MAP;                                           03660000
       RCBM35O.MSGLNO      = ERR_O031;                                  03670000
       CALL RCBC35M_SEND_MAP;                                           03680000
     END;                                                               03690000
                                                                        03700000
     CALL RCBC35M_FILL_MAP;                                             03710000
     CALL RCBC35M_SAVE_MAP;                                             03720000
     CALL RCBC35M_SEND_MAP;                                             03730000
   END;                                                                 03740000
                                                                        03750000
   WHEN (DFHPF9,DFHPF21)                                                03760000
   DO;                                                                  03770000
     IF HEADER.NEXT = 'H1' THEN                                         03780000
     DO;                                                                03790000
       HEADER.NEXT = '00';                                              03800000
       CALL RCBC35M_CLEAR_MAP;                                          03810000
       CALL RCBC35M_CLEAR_WORK;                                         03820000
       RCBM35O.MSGLNO      = ERR_O004;                                  03830000
       RCBM35I.SNAMESELL   = -1;                                        03840000
       CALL RCBC35M_SEND_MAP_CSR;                                       03850000
     END;                                                               03860000
                                                                        03870000
     IF TS_CNT1 = 0 THEN                                                03880000
     DO;                                                                03890000
       CALL RCBC35M_CLEAR_WORK;                                         03900000
       CALL RCBC35M_CLEAR_MAP;                                          03910000
       CALL RCBC35M_SEND_MAP;                                           03920000
     END;                                                               03930000
                                                                        03940000
     IF TS_CNT1/2 < O THEN                                              03950000
     DO;                                                                03960000
       J = 0;                                                           03970000
       CALL RCBC35M_FILL_MAP;                                           03980000
       CALL RCBC35M_SAVE_MAP;                                           03990000
       CALL RCBC35M_SEND_MAP;                                           04000000
     END;                                                               04010000
     ELSE                                                               04020000
     DO;                                                                04030000
       J =  TS_CNT1 - 14;                                               04040000
       CALL RCBC35M_FILL_MAP;                                           04050000
       CALL RCBC35M_SAVE_MAP;                                           04060000
       CALL RCBC35M_SEND_MAP;                                           04070000
     END;                                                               04080000
   END;                                                                 04090000
                                                                        04100000
   WHEN (DFHENTER)                                                      04110000
   DO;                                                                  04120000
     IF HEADER.NEXT = 'H1' THEN                                         04130000
     DO;                                                                04140000
       HEADER.NEXT = '00';                                              04150000
       CALL RCBC35M_GET_CSR_POS;                                        04160000
       CALL RCBC35M_RESTORE_MAP;                                        04170000
       CALL RCBC35M_CLEAR_WORK;                                         04180000
       CALL RCBC35M_SEND_MAP_CSR;                                       04190000
     END;                                                               04200000
                                                                        04210000
     CALL RCBC35M_RECEIVE_MAP;                                          04220000
     ACT_SEL = FALSE;                                                   04230000
     DO I = 1 TO 14;                                                    04240000
       IF VERIFY(RCBM35I.ACTINDI(I), 'ACD') = 0 THEN                    04250000
       DO;                                                              04260000
         ACT_SEL = TRUE;                                                04270000
       END;                                                             04280000
     END;                                                               04290000
                                                                        04300000
     IF (RCBM35I.SNAMESELI      ¬= SNAMESEL                             04310000
      |  RCBM35I.SLCSELI        ¬= SLCSEL)                              04320000
      &  ACT_SEL                 = FALSE THEN                           04330000
     DO;                                                                04340000
       CALL RCBC35M_VALIDATE_MAP;                                       04350000
       CALL RCBC35M_GET_MESE;                                           04360000
       CALL RCBC35M_FILL_MAP;                                           04370000
       CALL RCBC35M_SAVE_MAP;                                           04380000
       CALL RCBC35M_SEND_MAP;                                           04390000
     END;                                                               04400000
     ELSE                                                               04410000
     DO;                                                                04420000
       CALL RCBC35M_VALIDATE_MAP;                                       04430000
       CALL RCBC35M_CHECK_MAP;                                          04440000
       CALL RCBC35M_FILL_MAP;                                           04450000
       CALL RCBC35M_SAVE_MAP;                                           04460000
       CALL RCBC35M_SEND_MAP;                                           04470000
     END;                                                               04480000
   END;                                                                 04490000
                                                                        04500000
   WHEN (DFHCLEAR)                                                      04510000
   DO;                                                                  04520000
     EXEC CICS SEND                                                     04530000
        CONTROL                                                         04540000
        ERASE                                                           04550000
        FREEKB;                                                         04560000
     EXEC CICS RETURN;                                                  04570000
   END;                                                                 04580000
                                                                        04590000
   OTHERWISE                                                            04600000
   DO;                                                                  04610000
     IF HEADER.NEXT            = '00' THEN                              04620000
     CALL RCBC35M_RECEIVE_MAP;                                          04630000
     ELSE CALL RCBC35M_RESTORE_MAP;                                     04640000
     IF HEADER.NEXT = 'H1' THEN                                         04650000
     DO;                                                                04660000
       HEADER.NEXT = '00';                                              04670000
       CALL RCBC35M_CLEAR_MAP;                                          04680000
       CALL RCBC35M_CLEAR_WORK;                                         04690000
     END;                                                               04700000
     RCBM35O.MSGLNO            = ERR_O004;                              04710000
     RCBM35I.SNAMESELL         = -1;                                    04720000
     CALL RCBC35M_SEND_MAP_CSR;                                         04730000
   END;                                                                 04740000
  END;                                                                  04750000
                                                                        04760000
1/********************************************************************/ 04770000
 /*      CLEAR WORK FIELDS                                           */ 04780000
 /********************************************************************/ 04790000
0RCBC35M_CLEAR_WORK: PROC;                                              04800000
                                                                        04810000
 SNAMESEL                         ='**';                                04820000
 SLCSEL                           ='**';                                04830000
 TS_CNT1                          = 0;                                  04840000
                                                                        04850000
0END RCBC35M_CLEAR_WORK;                                                04860000
1/********************************************************************/ 04870000
 /*      CLEAR MAP RCBM35                                            */ 04880000
 /********************************************************************/ 04890000
 RCBC35M_CLEAR_MAP: PROC;                                               04900000
                                                                        04910000
 RCBM35O.SNAMESELO                = ' ';                                04920000
 RCBM35O.SLCSELO                  = ' ';                                04930000
 RCBM35O.INCNTO                   = ' ';                                04940000
 RCBM35O.TOTCNTO                  = ' ';                                04950000
 RCBM35O.MSGLNO                   = ' ';                                04960000
                                                                        04970000
 DO I = 1 TO 14;                                                        04980000
 RCBM35O.ACTINDO(I)               = ' ';                                04990000
 RCBM35O.OFF_SNAMEO(I)            = ' ';                                05000000
 RCBM35O.ORI_SLCO(I)              = ' ';                                05010000
 RCBM35O.MESE_SLCO(I)             = ' ';                                05020000
 FILL_FLAG(I)                     = FALSE;                              05030000
 END;                                                                   05040000
                                                                        05050000
 END RCBC35M_CLEAR_MAP;                                                 05060000
1/********************************************************************/ 05070000
 /*      SEND MAP RCBM35                                             */ 05080000
 /********************************************************************/ 05090000
0RCBC35M_SEND_MAP: PROC;                                                05100000
                                                                        05110000
 IF RCBM35O.SNAMESELO = '**' THEN RCBM35O.SNAMESELO = ' ';              05120000
 IF RCBM35O.SLCSELO   = '**' THEN RCBM35O.SLCSELO   = ' ';              05130000
 RCBM35O.SALINEO      = SALINE;                                         05140000
0EXEC CICS SEND                                                         05150000
    MAP('RCBM35')                                                       05160000
    MAPSET('RCBM35')                                                    05170000
    FREEKB                                                              05180000
    ERASE                                                               05190000
    RESP(RESPONSE)                                                      05200000
    RESP2(CODE_EXPLAIN);                                                05210000
                                                                        05220000
0SELECT(RESPONSE);                                                      05230000
    WHEN(DFHRESP(NORMAL))                                               05240000
    DO;                                                                 05250000
      EXEC CICS RETURN                                                  05260000
         TRANSID('RC35')                                                05270000
         COMMAREA(COMMAREA)                                             05280000
         LENGTH(CSTG(COMMAREA));                                        05290000
    END;                                                                05300000
    OTHERWISE                                                           05310000
    DO;                                                                 05320000
      RCBM35O.MSGLNO = ERR_MESSAGE2 || 'RCBM35';                        05330000
      CALL RCBC35M_SEND_MAP;                                            05340000
    END;                                                                05350000
 END;                                                                   05360000
                                                                        05370000
0END RCBC35M_SEND_MAP;                                                  05380000
1/********************************************************************/ 05390000
 /*      RECEIVE MAP RCBM35                                          */ 05400000
 /********************************************************************/ 05410000
0RCBC35M_RECEIVE_MAP: PROC;                                             05420000
                                                                        05430000
  EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */     05440000
     MAP('RCBM35')                                                      05450000
     MAPSET('RCBM35')                                                   05460000
     RESP(RESPONSE)                                                     05470000
     RESP2(CODE_EXPLAIN);                                               05480000
  SELECT(RESPONSE);                  /* CHECK RESPONSE           */     05490000
     WHEN(DFHRESP(NORMAL))                                              05500000
     DO;                                                                05510000
       HEADER.RET_CODE = '';        /* INITIALISE RETURN CODES  */      05520000
       HEADER.SUB_CODE = '';                                            05530000
     END;                                                               05540000
                                                                        05550000
     OTHERWISE                                                          05560000
     DO;                                                                05570000
       RCBM35O.MSGLNO = ERR_MESSAGE3;                                   05580000
       CALL RCBC35M_SEND_MAP;                                           05590000
     END;                                                               05600000
   END;                                                                 05610000
                                                                        05620000
0END RCBC35M_RECEIVE_MAP;                                               05630000
1/********************************************************************/ 05640000
 /*      SEND ERROR MAP                                              */ 05650000
 /********************************************************************/ 05660000
 RCBC35M_SEND_MAP_CSR: PROC;                                            05670000
                                                                        05680000
 IF RCBM35O.SNAMESELO = '**' THEN RCBM35O.SNAMESELO = '';               05690000
 IF RCBM35O.SLCSELO   = '**' THEN RCBM35O.SLCSELO   = '';               05700000
                                                                        05710000
 RCBM35O.SALINEO      = SALINE;                                         05720000
                                                                        05730000
 EXEC CICS SEND                                                         05740000
    MAP('RCBM35')                                                       05750000
    MAPSET('RCBM35')                                                    05760000
    CURSOR                                                              05770000
    ERASE                                                               05780000
    FREEKB;                                                             05790000
                                                                        05800000
 EXEC CICS RETURN                                                       05810000
    TRANSID('RC35')                                                     05820000
    COMMAREA(COMMAREA)                                                  05830000
    LENGTH(CSTG(COMMAREA));                                             05840000
                                                                        05850000
 END RCBC35M_SEND_MAP_CSR;                                              05860000
1/********************************************************************/ 05870000
 /*      SEND HELP MAP                                               */ 05880000
 /********************************************************************/ 05890000
0RCBC35M_HELP_MAP: PROC;                                                05900000
                                                                        05910000
 HEADER.NEXT = 'H1';                                                    05920000
 HELP_FLAG   = FALSE;                                                   05930000
 CSR_POS     = 0;                                                       05940000
 CSR_ROW     = 1;                                                       05950000
                                                                        05960000
 DO N = 1 TO 14;                                                        05970000
   CSR_ROW = N;                                                         05980000
                                                                        05990000
   IF RCBM35I.ACTINDF(N) = CSR_HELP  |                                  06000000
      RCBM35I.ACTINDF(N) = CSR_EOF THEN                                 06010000
   DO;                                                                  06020000
       N = 14;                                                          06030000
       CSR_POS   = 3;                                                   06040000
       HELP_FLAG = TRUE;                                                06050000
       EXEC CICS SEND                                                   06060000
         MAP('ACTACD')                                                  06070000
         MAPSET('RCBHELP')                                              06080000
         FREEKB                                                         06090000
         ERASE;                                                         06100000
   END;                                                                 06110000
                                                                        06120000
   IF RCBM35I.OFF_SNAMEF(N) = CSR_HELP  |                               06130000
      RCBM35I.OFF_SNAMEF(N) = CSR_EOF THEN                              06140000
   DO;                                                                  06150000
       N = 14;                                                          06160000
       CSR_POS   = 4;                                                   06170000
       HELP_FLAG = TRUE;                                                06180000
       EXEC CICS SEND                                                   06190000
         MAP('OFFSNM1')                                                 06200000
         MAPSET('RCBHELP')                                              06210000
         FREEKB                                                         06220000
         ERASE;                                                         06230000
   END;                                                                 06240000
                                                                        06250000
   IF RCBM35I.ORI_SLCF(N) = CSR_HELP  |                                 06260000
      RCBM35I.ORI_SLCF(N) = CSR_EOF THEN                                06270000
   DO;                                                                  06280000
       N = 14;                                                          06290000
       CSR_POS   = 5;                                                   06300000
       HELP_FLAG = TRUE;                                                06310000
       EXEC CICS SEND                                                   06320000
         MAP('SLCH35')                                                  06330000
         MAPSET('RCBHELP')                                              06340000
         FREEKB                                                         06350000
         ERASE;                                                         06360000
   END;                                                                 06370000
                                                                        06380000
   IF RCBM35I.MESE_SLCF(N) = CSR_HELP  |                                06390000
      RCBM35I.MESE_SLCF(N) = CSR_EOF THEN                               06400000
   DO;                                                                  06410000
       N = 14;                                                          06420000
       CSR_POS   = 6;                                                   06430000
       HELP_FLAG = TRUE;                                                06440000
       EXEC CICS SEND                                                   06450000
         MAP('MESESLC')                                                 06460000
         MAPSET('RCBHELP')                                              06470000
         FREEKB                                                         06480000
         ERASE;                                                         06490000
   END;                                                                 06500000
 END;                                                                   06510000
 IF RCBM35I.SNAMESELF = CSR_HELP |                                      06520000
    RCBM35I.SNAMESELF = CSR_EOF THEN                                    06530000
       CSR_POS = 1;                                                     06540000
                                                                        06550000
 IF RCBM35I.SLCSELF = CSR_HELP |                                        06560000
    RCBM35I.SLCSELF = CSR_EOF THEN                                      06570000
       CSR_POS = 2;                                                     06580000
                                                                        06590000
 IF HELP_FLAG = FALSE THEN                                              06600000
 EXEC CICS SEND                                                         06610000
    MAP('RCBH35')                                                       06620000
    MAPSET('RCBM35')                                                    06630000
    FREEKB                                                              06640000
    ERASE;                                                              06650000
                                                                        06660000
0EXEC CICS RETURN                                                       06670000
    TRANSID('RC35')                                                     06680000
    COMMAREA(COMMAREA)                                                  06690000
    LENGTH(CSTG(COMMAREA))                                              06700000
    RESP(RESPONSE)                                                      06710000
    RESP2(CODE_EXPLAIN);                                                06720000
                                                                        06730000
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 06740000
    WHEN(DFHRESP(NORMAL));                                              06750000
    WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */ 06760000
                                                                        06770000
    DO;                                                                 06780000
      COMMAREA_LENGTH = EIBCALEN;                                       06790000
      EXEC CICS RETURN                                                  06800000
         TRANSID('RC35')                                                06810000
         COMMAREA(COMMAREA)                                             06820000
         LENGTH(COMMAREA_LENGTH);                                       06830000
    END;                                                                06840000
                                                                        06850000
    OTHERWISE                                                           06860000
    DO;                                                                 06870000
      RCBM35O.MSGLNO = ERR_MESSAGE14;                                   06880000
      CALL RCBC35M_SEND_MAP_CSR;                                        06890000
    END;                                                                06900000
 END;                                                                   06910000
                                                                        06920000
0END RCBC35M_HELP_MAP;                                                  06930000
 /********************************************************************/ 06940000
 /*      RESTORE MAP RCBM35                                          */ 06950000
 /********************************************************************/ 06960000
 RCBC35M_RESTORE_MAP: PROC;                                             06970000
                                                                        06980000
 RCBM35O.SNAMESELO            = SNAMESEL;                               06990000
 RCBM35O.SLCSELO              = SLCSEL;                                 07000000
                                                                        07010000
 DO P = 1 TO 14;                                                        07020000
   FILL_FLAG(P)               = TMP_FILL_FLAG(P);                       07030000
   RCBM35O.ACTINDO(P)         = TMP_ACTION(P);                          07040000
   RCBM35O.OFF_SNAMEO(P)      = TMP_OFF_SNAME(P);                       07050000
   RCBM35O.ORI_SLCO(P)        = TMP_ORI_SLC(P);                         07060000
   RCBM35O.MESE_SLCO(P)       = TMP_MESE_SLC(P);                        07070000
 END;                                                                   07080000
                                                                        07090000
 RCBM35O.INCNTO               = SAVE_INCNT;                             07100000
 RCBM35O.TOTCNTO              = SAVE_TOTCNT;                            07110000
                                                                        07120000
 END RCBC35M_RESTORE_MAP;                                               07130000
1/********************************************************************/ 07140000
 /*      GET CURSOR POSITION                                         */ 07150000
 /*         FOR RETURN FROM HELP SCREENS                             */ 07160000
 /********************************************************************/ 07170000
0RCBC35M_GET_CSR_POS: PROC;                                             07180000
                                                                        07190000
 SELECT(CSR_POS);                                                       07200000
   WHEN(1)  RCBM35I.SNAMESELL                = -1;                      07210000
   WHEN(2)  RCBM35I.SLCSELL                  = -1;                      07220000
   WHEN(3)  RCBM35I.ACTINDL(CSR_ROW)         = -1;                      07230000
   WHEN(4)  RCBM35I.OFF_SNAMEL(CSR_ROW)      = -1;                      07240000
   WHEN(5)  RCBM35I.ORI_SLCL(CSR_ROW)        = -1;                      07250000
   WHEN(6)  RCBM35I.MESE_SLCL(CSR_ROW)       = -1;                      07260000
   OTHERWISE RCBM35I.SNAMESELL               = -1;                      07270000
 END;                                                                   07280000
0END RCBC35M_GET_CSR_POS;                                               07290000
1/********************************************************************/ 07300000
 /*      SAVE DATA BEFORE GO TO HELP MAP.                            */ 07310000
 /********************************************************************/ 07320000
 RCBC35M_SAVE_MAP: PROC;                                                07330000
                                                                        07340000
 SNAMESEL                     = RCBM35I.SNAMESELI;                      07350000
 SLCSEL                       = RCBM35I.SLCSELI;                        07360000
                                                                        07370000
 DO P = 1 TO 14;                                                        07380000
  TMP_ACTION(P)               = RCBM35I.ACTINDI(P);                     07390000
  TMP_OFF_SNAME(P)            = RCBM35I.OFF_SNAMEI(P);                  07400000
  TMP_ORI_SLC(P)              = RCBM35I.ORI_SLCI(P);                    07410000
  TMP_MESE_SLC(P)             = RCBM35I.MESE_SLCI(P);                   07420000
  TMP_FILL_FLAG(P)            = FILL_FLAG(P);                           07430000
 END;                                                                   07440000
  SAVE_INCNT                  = RCBM35I.INCNTI;                         07450000
  SAVE_TOTCNT                 = RCBM35I.TOTCNTI;                        07460000
                                                                        07470000
 END RCBC35M_SAVE_MAP;                                                  07480000
1/********************************************************************/ 07490000
 /*      VALIDATE MAP RCBM35                                         */ 07500000
 /********************************************************************/ 07510000
0RCBC35M_VALIDATE_MAP: PROC;                                            07520000
                                                                        07530000
 SNAMESEL              = ' ';                                           07540000
 SLCSEL                = ' ';                                           07550000
 SNAMESEL_NULL         = 'N';                                           07560000
 SLCSEL_NULL           = 'N';                                           07570000
                                                                        07580000
 IF RCBM35I.SNAMESELL  = 0 |                                            07590000
    RCBM35I.SNAMESELF  = ERASE_EOF THEN                                 07600000
 DO;                                                                    07610000
    RCBM35O.SNAMESELO  = ' ';                                           07620000
    RCBM35I.SNAMESELI  = ' ';                                           07630000
 END;                                                                   07640000
                                                                        07650000
 IF RCBM35I.SLCSELL    = 0 |                                            07660000
    RCBM35I.SLCSELF    = ERASE_EOF THEN                                 07670000
 DO;                                                                    07680000
    RCBM35O.SLCSELO    = ' ';                                           07690000
    RCBM35I.SLCSELI    = ' ';                                           07700000
 END;                                                                   07710000
                                                                        07720000
 IF RCBM35I.SNAMESELI ¬= ' ' THEN                                       07730000
 DO;                                                                    07740000
    SNAMESEL           = RCBM35I.SNAMESELI;                             07750000
    SNAMESEL_NULL      = 'Y';                                           07760000
 END;                                                                   07770000
                                                                        07780000
 IF RCBM35I.SLCSELI ¬= ' ' THEN                                         07790000
 DO;                                                                    07800000
    SLCSEL             = RCBM35I.SLCSELI;                               07810000
    SLCSEL_NULL        = 'Y';                                           07820000
 END;                                                                   07830000
                                                                        07840000
                                                                        07850000
0END RCBC35M_VALIDATE_MAP;                                              07860000
1/********************************************************************/ 07870000
 /*      GET OFFERING ID TRANSLATION LIST                            */ 07880000
 /********************************************************************/ 07890000
0RCBC35M_GET_MESE: PROC;                                                07900000
                                                                        07910000
 IF SNAMESEL = '**' THEN                                                07920000
    SNAMESEL = ' ';                                                     07930000
                                                                        07940000
 IF SLCSEL   = '**' THEN                                                07950000
    SLCSEL   = ' ';                                                     07960000
                                                                        07970000
 DO M = 1 TO 14;                                                        07980000
    FILL_FLAG(M) = FALSE;                                               07990000
 END;                                                                   08000000
                                                                        08010000
 TS_Q = 'RC00' || EIBTRMID;                                             08020000
                                                                        08030000
 EXEC CICS IGNORE CONDITION QIDERR;                                     08040000
                                                                        08050000
 EXEC CICS DELETEQ TS QUEUE(TS_Q);                                      08060000
                                                                        08070000
 EXEC CICS HANDLE CONDITION QIDERR;                                     08080000
                                                                        08090000
 OK_FLAG = TRUE;                                                        08100000
 TS_CNT1 = 0;                                                           08110000
 J      = 0;                                                            08120000
 L      = 1;                                                            08130000
                                                                        08140000
 EXEC SQL OPEN C_0692;                                                  08150000
                                                                        08160000
 SELECT(SQLCA.SQLCODE);                                                 08170000
   WHEN(0);                                                             08180000
   OTHERWISE                                                            08190000
   DO;                                                                  08200000
     RCBM35O.MSGLNO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED        08210000
     WHILE ACCESSING RCBT0692';                                         08220000
     CALL RCBC35M_SEND_MAP_CSR;                                         08230000
   END;                                                                 08240000
 END;                                                                   08250000
                                                                        08260000
 DO WHILE (OK_FLAG = TRUE);                                             08270000
   RCB692SI.INDNULL(*) = 0;                                             08280000
   TS_REC         = '';                                                 08290000
                                                                        08300000
   EXEC SQL FETCH C_0692                                                08310000
            INTO :RCB692S.OFFERING_SNAME : NUL692A                      08320000
                ,:RCB692S.ORIGINAL_SLC   : NUL692B                      08330000
                ,:RCB692S.ME_SE_SLC      : NUL692C;                     08340000
                                                                        08350000
     IF (SQLCODE = 0) THEN                                              08360000
     DO;                                                                08370000
       IF NUL692A ¬= -1 THEN                                            08380000
           TS_REC.TS_OFF_SNAME      = RCB692S.OFFERING_SNAME;           08390000
       IF NUL692B ¬= -1 THEN                                            08400000
           TS_REC.TS_ORI_SLC        = RCB692S.ORIGINAL_SLC;             08410000
       IF NUL692C ¬= -1 THEN                                            08420000
           TS_REC.TS_MESE_SLC       = RCB692S.ME_SE_SLC;                08430000
                                                                        08440000
       EXEC CICS WRITEQ TS QUEUE(TS_Q) FROM(TS_REC);                    08450000
       TS_CNT1 = TS_CNT1 + 1;                                           08460000
     END;                                                               08470000
                                                                        08480000
     IF (SQLCODE ¬= 0) THEN                                             08490000
     DO;                                                                08500000
       OK_FLAG = FALSE;                                                 08510000
     END;                                                               08520000
 END;                                                                   08530000
                                                                        08540000
 EXEC SQL CLOSE C_0692;                                                 08550000
 IF TS_CNT1 = 0 THEN                                                    08560000
 DO;                                                                    08570000
   CALL RCBC35M_CLEAR_MAP;                                              08580000
   IF (SNAMESEL    ¬= ''                                                08590000
    |  SLCSEL      ¬= '') THEN                                          08600000
     RCBM35O.MSGLNO     = ERR_O221;                                     08610000
     RCBM35O.SNAMESELO  = SNAMESEL;                                     08620000
     RCBM35O.SLCSELO    = SLCSEL;                                       08630000
   CALL RCBC35M_CLEAR_WORK;                                             08640000
   CALL RCBC35M_SEND_MAP;                                               08650000
 END;                                                                   08660000
                                                                        08670000
0END RCBC35M_GET_MESE;                                                  08680000
1/********************************************************************/ 08690000
 /*      FILL MAP RCBM35                                             */ 08700000
 /********************************************************************/ 08710000
0RCBC35M_FILL_MAP: PROC;                                                08720000
                                                                        08730000
 CALL RCBC35M_CLEAR_MAP;                                                08740000
                                                                        08750000
 RCBM35O.SNAMESELO   = SNAMESEL;                                        08760000
 RCBM35O.SLCSELO     = SLCSEL;                                          08770000
                                                                        08780000
 K = 0;                                                                 08790000
 PIC_CNT         = J + 1;                                               08800000
 IF PIC_CNT = 0 THEN PIC_CNT = 1;                                       08810000
 RCBM35O.INCNTO  = PIC_CNT;                                             08820000
 L               = PIC_CNT;                                             08830000
 PIC_CNT         = TS_CNT1;                                             08840000
 RCBM35O.TOTCNTO = PIC_CNT;                                             08850000
                                                                        08860000
 RCBM35I.ACTINDL(1) = -1;                                               08870000
                                                                        08880000
 DO I = 1 TO 14;                                                        08890000
                                                                        08900000
   IF J <= TS_CNT1 THEN                                                 08910000
   DO;                                                                  08920000
     J = J + 1;     /* NUMBER OF LINES DISPLAYED */                     08930000
     K = K + 1;     /* NUMBER OF LINES DISPLAYED ON CURRENT SCREEN */   08940000
     EXEC CICS READQ TS QUEUE(TS_Q) INTO(TS_REC) ITEM(J);               08950000
     RCBM35O.OFF_SNAMEO(I)      = TS_REC.TS_OFF_SNAME;                  08960000
     RCBM35O.ORI_SLCO(I)        = TS_REC.TS_ORI_SLC;                    08970000
     RCBM35O.MESE_SLCO(I)       = TS_REC.TS_MESE_SLC;                   08980000
     FILL_FLAG(I)               = TRUE;                                 08990000
   END;                                                                 09000000
                                                                        09010000
   IF J >= TS_CNT1 THEN                                                 09020000
     I = 15;                                                            09030000
 END;                                                                   09040000
   O  = J;                                                              09050000
0END RCBC35M_FILL_MAP;                                                  09060000
1/********************************************************************/ 09070000
 /*      CHECK MAP RCBM35                                            */ 09080000
 /********************************************************************/ 09090000
0RCBC35M_CHECK_MAP: PROC;                                               09100000
                                                                        09110000
 ALL_EMPTY_ACTION_FLAG = TRUE;                                          09120000
 DO I = 1 TO 14;                                                        09130000
   IF VERIFY(RCBM35I.ACTINDI(I), ' ACD') ¬= 0 THEN                      09140000
   DO;                                                                  09150000
     RCBM35I.ACTINDL(I) = -1;                                           09160000
     RCBM35O.ACTINDC(I) = DFHRED;                                       09170000
     RCBM35O.MSGLNO = ERR_O127;                                         09180000
     CALL RCBC35M_SEND_MAP_CSR;                                         09190000
   END;                                                                 09200000
   IF RCBM35I.ACTINDI(I) ¬= ' ' THEN                                    09210000
      ALL_EMPTY_ACTION_FLAG = FALSE;                                    09220000
 END;                                                                   09230000
                                                                        09240000
 IF ALL_EMPTY_ACTION_FLAG = TRUE THEN                                   09250000
 DO;                                                                    09260000
   /*NO ITEM SELECTED*/                                                 09270000
   RCBM35O.ACTINDC(1) = DFHRED;                                         09280000
   RCBM35I.ACTINDL(1) = -1;                                             09290000
   RCBM35O.MSGLNO = ERR_O032;                                           09300000
   CALL RCBC35M_SEND_MAP_CSR;                                           09310000
 END;                                                                   09320000
                                                                        09330000
 DO I = 1 TO 14;                                                        09340000
   IF VERIFY(RCBM35I.ACTINDI(I), 'ACD') = 0 THEN                        09350000
   DO;                                                                  09360000
     IF VERIFY(RCBM35I.OFF_SNAMEI(I),ALPHA1) ¬= 0 THEN                  09370000
     DO;                                                                09380000
        RCBM35O.OFF_SNAMEC(I) = DFHRED;                                 09390000
        RCBM35I.OFF_SNAMEL(I) = -1;                                     09400000
        /*FIELD MUST BE FILLED IN CORRECTLY*/                           09410000
        RCBM35O.MSGLNO = ERR_O101;                                      09420000
        CALL RCBC35M_SEND_MAP_CSR;                                      09430000
     END;                                                               09440000
                                                                        09450000
     IF VERIFY(RCBM35I.ORI_SLCI(I),ALPHA1) ¬= 0 &                       09460000
               RCBM35I.ORI_SLCI(I)         ¬= '***' THEN   /* RC01302 */09470000
     DO;                                                                09480000
        RCBM35O.ORI_SLCC(I) = DFHRED;                                   09490000
        RCBM35I.ORI_SLCL(I) = -1;                                       09500000
        /*FIELD MUST BE FILLED IN CORRECTLY*/                           09510000
        RCBM35O.MSGLNO = ERR_O101;                                      09520000
        CALL RCBC35M_SEND_MAP_CSR;                                      09530000
     END;                                                               09540000
   END;                                                                 09550000
                                                                        09560000
   IF RCBM35I.ACTINDI(I)= 'A'|                                          09570000
      RCBM35I.ACTINDI(I)= 'C' THEN                                      09580000
   DO;                                                                  09590000
     WRK_OFFSNAME = RCBM35I.OFF_SNAMEI(I);                              09600000
     CALL RCBC35M_ADD_CHECK;                                            09610000
     IF T691_FLAG = FALSE THEN                                          09620000
     DO;                                                                09630000
        RCBM35O.OFF_SNAMEC(I) = DFHRED;                                 09640000
        RCBM35I.OFF_SNAMEL(I) = -1;                                     09650000
     /* OFF_SNAME NOT REGISTERED IN T691 TABLE */                       09660000
        RCBM35O.MSGLNO = ERR_O233;                                      09670000
        CALL RCBC35M_SEND_MAP_CSR;                                      09680000
     END;                                                               09690000
                                                                        09700000
     WRK_SLC      =  RCBM35I.ORI_SLCI(I);                               09710000
     IF WRK_SLC   ¬= '***' THEN                            /* RC01302 */09720000
     DO;                                                                09730000
       CALL RCBC35M_SLC_CHECK;                                          09740000
       IF T470_FLAG = FALSE THEN                                        09750000
       DO;                                                              09760000
          RCBM35O.ORI_SLCC(I) = DFHRED;                                 09770000
          RCBM35I.ORI_SLCL(I) = -1;                                     09780000
          /*SERVICE_LEVEL_CODE DOES NOT EXIST */                        09790000
          RCBM35O.MSGLNO = ERR_O142;                                    09800000
          CALL RCBC35M_SEND_MAP_CSR;                                    09810000
       END;                                                             09820000
     END;                                                               09830000
                                                                        09840000
     IF VERIFY(RCBM35I.MESE_SLCI(I),ALPHA1) ¬= 0 THEN                   09850000
     DO;                                                                09860000
        RCBM35O.MESE_SLCC(I) = DFHRED;                                  09870000
        RCBM35I.MESE_SLCL(I) = -1;                                      09880000
        /*FIELD MUST BE FILLED IN CORRECTLY*/                           09890000
        RCBM35O.MSGLNO = ERR_O101;                                      09900000
        CALL RCBC35M_SEND_MAP_CSR;                                      09910000
     END;                                                               09920000
                                                                        09930000
     WRK_SLC      = RCBM35I.MESE_SLCI(I);                               09940000
     CALL RCBC35M_SLC_CHECK;                                            09950000
                                                                        09960000
     IF T470_FLAG = FALSE THEN                                          09970000
     DO;                                                                09980000
        RCBM35O.MESE_SLCC(I) = DFHRED;                                  09990000
        RCBM35I.MESE_SLCL(I) = -1;                                      10000000
       /*SERVICE_LEVEL_CODE DOES NOT EXIST */                           10010000
        RCBM35O.MSGLNO = ERR_O142;                                      10020000
        CALL RCBC35M_SEND_MAP_CSR;                                      10030000
     END;                                                               10040000
   END;                                                                 10050000
 END;                                                                   10060000
                                                                        10070000
 IF PF5_FLAG = FALSE THEN                                               10080000
 DO;                                                                    10090000
   CALL RCBC35M_PROTECT_MAP1;                                           10100000
   RCBM35O.MSGLNO = ERR_O022;                                           10110000
   PF5_FLAG = TRUE;                                                     10120000
   CALL RCBC35M_SEND_MAP;                                               10130000
 END;                                                                   10140000
                                                                        10150000
 IF PF5_FLAG = TRUE THEN                                                10160000
 DO;                                                                    10170000
   T692_UPD_FLAG = FALSE;                                               10180000
   DO I = 1 TO 14;                                                      10190000
                                                                        10200000
     IF (RCBM35I.ACTINDI(I) = 'A') THEN                                 10210000
     DO;                                                                10220000
       CALL RCBC35M_INSERT_RECORD;                                      10230000
       WRK_ACTIND = '1';                                                10240000
       CALL RCBC35M_UPD_T560;                                           10250000
       RCBM35I.ACTINDI(I) = '';                                         10260000
     END;                                                               10270000
                                                                        10280000
     IF (RCBM35I.ACTINDI(I) = 'C') THEN                                 10290000
     DO;                                                                10300000
       CALL RCBC35M_UPDATE_RECORD;                                      10310000
       WRK_ACTIND = '2';                                                10320000
       CALL RCBC35M_UPD_T560;                                           10330000
       RCBM35I.ACTINDI(I) = '';                                         10340000
     END;                                                               10350000
                                                                        10360000
     IF (RCBM35I.ACTINDI(I) = 'D') THEN                                 10370000
     DO;                                                                10380000
       CALL RCBC35M_DELETE_RECORD;                                      10390000
       WRK_ACTIND = '3';                                                10400000
       CALL RCBC35M_UPD_T560;                                           10410000
       RCBM35I.ACTINDI(I) = '';                                         10420000
     END;                                                               10430000
   END;                                                                 10440000
 END;                                                                   10450000
 T692_UPD_FLAG = TRUE;                                                  10460000
0END RCBC35M_CHECK_MAP;                                                 10470000
1/********************************************************************/ 10480000
 /*      PROTECT MAP RCBM35                                          */ 10490000
 /********************************************************************/ 10500000
0RCBC35M_PROTECT_MAP: PROC;                                             10510000
                                                                        10520000
 DO M = 1 TO 14;                                                        10530000
   IF FILL_FLAG(M) = TRUE THEN                                          10540000
   DO;                                                                  10550000
     RCBM35O.OFF_SNAMEA(M)      = DFHBMPRF;                             10560000
   END;                                                                 10570000
 END;                                                                   10580000
                                                                        10590000
0END RCBC35M_PROTECT_MAP;                                               10600000
1/********************************************************************/ 10610000
 /*      PROTECT MAP RCBM35                                          */ 10620000
 /********************************************************************/ 10630000
0RCBC35M_PROTECT_MAP1: PROC;                                            10640000
                                                                        10650000
 RCBM35O.SNAMESELA            = DFHBMPRF;                               10660000
 RCBM35O.SLCSELA              = DFHBMPRF;                               10670000
                                                                        10680000
 DO M = 1 TO 14;                                                        10690000
   RCBM35O.ACTINDA(M)         = DFHBMPRF;                               10700000
   RCBM35O.OFF_SNAMEA(M)      = DFHBMPRF;                               10710000
   RCBM35O.OFF_SNAMEA(M)      = DFHBMPRF;                               10720000
   RCBM35O.ORI_SLCA(M)        = DFHBMPRF;                               10730000
   RCBM35O.MESE_SLCA(M)       = DFHBMPRF;                               10740000
 END;                                                                   10750000
                                                                        10760000
0END RCBC35M_PROTECT_MAP1;                                              10770000
1/********************************************************************/ 10780000
 /*      CHECK OFF_SNAME                                             */ 10790000
 /********************************************************************/ 10800000
0RCBC35M_ADD_CHECK: PROC;                                               10810000
                                                                        10820000
 T691_FLAG = TRUE;                                                      10830000
 WRK_REC_COUNT = 0;                                                     10840000
                                                                        10850000
 EXEC SQL                                                               10860000
   SELECT COUNT(*)                                                      10870000
   INTO :WRK_REC_COUNT                                                  10880000
   FROM RCBV0691_TRANS_OFF                                              10890000
   WHERE OFFERING_SNAME   = :WRK_OFFSNAME                               10900000
   AND   TYPE_OF_OFFERING = 'MESE';                                     10910000
                                                                        10920000
 IF WRK_REC_COUNT = 0 THEN                                              10930000
 DO;                                                                    10940000
   T691_FLAG = FALSE;                                                   10950000
 END;                                                                   10960000
                                                                        10970000
0END RCBC35M_ADD_CHECK;                                                 10980000
1/********************************************************************/ 10990000
 /*      CHECK ORIGINAL-SLC/MESE-SLC                                 */ 11000000
 /********************************************************************/ 11010000
0RCBC35M_SLC_CHECK: PROC;                                               11020000
                                                                        11030000
 WRK_REC_COUNT = 0;                                                     11040000
 T470_FLAG     = TRUE;                                                  11050000
                                                                        11060000
 EXEC SQL                                                               11070000
   SELECT COUNT(*)                                                      11080000
   INTO :WRK_REC_COUNT                                                  11090000
   FROM RCBV0470_SERV_COND                                              11100000
   WHERE SERVICE_LVL_CODE = :WRK_SLC;                                   11110000
                                                                        11120000
 IF WRK_REC_COUNT = 0 THEN                                              11130000
 DO;                                                                    11140000
   T470_FLAG = FALSE;                                                   11150000
 END;                                                                   11160000
                                                                        11170000
0END RCBC35M_SLC_CHECK;                                                 11180000
1/********************************************************************/ 11190000
 /*      INSERT T692 RECORD                                          */ 11200000
 /********************************************************************/ 11210000
0RCBC35M_INSERT_RECORD: PROC;                                           11220000
                                                                        11230000
 RCB692S   = '';                                                        11240000
 RCB692SI.INDNULL(*) = 0;                                               11250000
                                                                        11260000
 RCB692S.OFFERING_SNAME           = RCBM35I.OFF_SNAMEI(I);              11270000
 RCB692S.ORIGINAL_SLC             = RCBM35I.ORI_SLCI(I);                11280000
 RCB692S.ME_SE_SLC                = RCBM35I.MESE_SLCI(I);               11290000
                                                                        11300000
 EXEC SQL                                                               11310000
      INSERT INTO RCBV0692_MESE_SLC                                     11320000
         (OFFERING_SNAME                                                11330000
         ,ORIGINAL_SLC                                                  11340000
         ,ME_SE_SLC)                                                    11350000
      VALUES (:RCB692S:RCB692SI.INDNULL);                               11360000
                                                                        11370000
 SELECT (SQLCA.SQLCODE);                                                11380000
   WHEN (0);                                                            11390000
                                                                        11400000
   WHEN (-803)                                                          11410000
   DO;                                                                  11420000
     CALL RCBC35M_PROTECT_MAP;                                          11430000
     RCBM35O.MSGLNO               = 'RECORD ALREADY EXISTS';            11440000
     RCBM35O.OFF_SNAMEC(I)        = DFHRED;                             11450000
     RCBM35O.ORI_SLCC(I)           = DFHRED;                            11460000
     RCBM35I.OFF_SNAMEL(I)        = -1;                                 11470000
     CALL RCBC35M_SEND_MAP_CSR;                                         11480000
   END;                                                                 11490000
                                                                        11500000
   OTHERWISE                                                            11510000
   DO;                                                                  11520000
     CALL RCBC35M_PROTECT_MAP;                                          11530000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       11540000
     RCBM35O.MSGLNO = 'DB2 ERROR - RC FROM RCBT0692 INSERT = '          11550000
                       || PIC_EXPLAIN;                                  11560000
     RCBM35O.ACTINDC(I) = DFHRED;                                       11570000
     RCBM35I.ACTINDL(I) = -1;                                           11580000
     CALL RCBC35M_SEND_MAP_CSR;                                         11590000
   END;                                                                 11600000
 END;                                                                   11610000
                                                                        11620000
0END RCBC35M_INSERT_RECORD;                                             11630000
1/********************************************************************/ 11640000
 /*      UPDATE T691 RECORD                                          */ 11650000
 /********************************************************************/ 11660000
0RCBC35M_UPDATE_RECORD: PROC;                                           11670000
                                                                        11680000
 RCB692S   = '';                                                        11690000
 RCB692SI.INDNULL(*) = 0;                                               11700000
                                                                        11710000
 RCB692S.OFFERING_SNAME           = RCBM35I.OFF_SNAMEI(I);              11720000
 RCB692S.ORIGINAL_SLC             = RCBM35I.ORI_SLCI(I);                11730000
 RCB692S.ME_SE_SLC                = RCBM35I.MESE_SLCI(I);               11740000
                                                                        11750000
 WRK_REC_COUNT   = 0;                                                   11760000
 EXEC SQL                                                               11770000
 SELECT COUNT(*)                                                        11780000
   INTO :WRK_REC_COUNT                                                  11790000
   FROM RCBV0692_MESE_SLC                                               11800000
    WHERE OFFERING_SNAME         = :RCB692S.OFFERING_SNAME              11810000
    AND   ORIGINAL_SLC           = :RCB692S.ORIGINAL_SLC                11820000
    AND   ME_SE_SLC              = :RCB692S.ME_SE_SLC;                  11830000
 IF WRK_REC_COUNT = 0 THEN                                              11840000
 DO;                                                                    11850000
   EXEC SQL                                                             11860000
     UPDATE RCBV0692_MESE_SLC                                           11870000
     SET ME_SE_SLC                = :RCB692S.ME_SE_SLC                  11880000
     WHERE OFFERING_SNAME         = :RCB692S.OFFERING_SNAME             11890000
     AND   ORIGINAL_SLC           = :RCB692S.ORIGINAL_SLC;              11900000
                                                                        11910000
   SELECT (SQLCA.SQLCODE);                                              11920000
     WHEN (0);                                                          11930000
                                                                        11940000
     WHEN (100)                                                         11950000
     DO;                                                                11960000
       CALL RCBC35M_PROTECT_MAP;                                        11970000
       RCBM35O.MSGLNO     = ERR_O120;                                   11980000
       RCBM35O.ACTINDC(I) = DFHRED;                                     11990000
       RCBM35I.ACTINDL(I) = -1;                                         12000000
       CALL RCBC35M_SEND_MAP_CSR;                                       12010000
     END;                                                               12020000
                                                                        12030000
     OTHERWISE                                                          12040000
     DO;                                                                12050000
       CALL RCBC35M_PROTECT_MAP;                                        12060000
       PIC_EXPLAIN = SQLCA.SQLCODE;                                     12070000
       RCBM35O.MSGLNO = 'DB2 ERROR - RC FROM RCBT0692 UPDATE = '        12080000
                         || PIC_EXPLAIN;                                12090000
       RCBM35O.ACTINDC(I) = DFHRED;                                     12100000
       RCBM35I.ACTINDL(I) = -1;                                         12110000
       CALL RCBC35M_SEND_MAP_CSR;                                       12120000
     END;                                                               12130000
   END;                                                                 12140000
 END;                                                                   12150000
 ELSE DO;                                                               12160000
   CALL RCBC35M_PROTECT_MAP;                                            12170000
   RCBM35O.MSGLNO               = 'RECORD ALREADY EXISTS';              12180000
   RCBM35O.OFF_SNAMEC(I)        = DFHRED;                               12190000
   RCBM35O.ORI_SLCC(I)          = DFHRED;                               12200000
   RCBM35I.OFF_SNAMEL(I)        = -1;                                   12210000
   CALL RCBC35M_SEND_MAP_CSR;                                           12220000
 END;                                                                   12230000
                                                                        12240000
0END RCBC35M_UPDATE_RECORD;                                             12250000
1/********************************************************************/ 12260000
 /*      DELETE T691 RECORD                                          */ 12270000
 /********************************************************************/ 12280000
0RCBC35M_DELETE_RECORD: PROC;                                           12290000
                                                                        12300000
 RCB692S    = '';                                                       12310000
                                                                        12320000
 RCB692S.OFFERING_SNAME        = RCBM35I.OFF_SNAMEI(I);                 12330000
 RCB692S.ORIGINAL_SLC          = RCBM35I.ORI_SLCI(I);                   12340000
                                                                        12350000
 EXEC SQL                                                               12360000
      DELETE FROM RCBV0692_MESE_SLC                                     12370000
      WHERE OFFERING_SNAME   = :RCB692S.OFFERING_SNAME                  12380000
      AND   ORIGINAL_SLC     = :RCB692S.ORIGINAL_SLC;                   12390000
                                                                        12400000
 SELECT (SQLCA.SQLCODE);                                                12410000
   WHEN (0);                                                            12420000
                                                                        12430000
   WHEN (100)                                                           12440000
   DO;                                                                  12450000
     CALL RCBC35M_PROTECT_MAP;                                          12460000
     RCBM35O.MSGLNO     = ERR_O121;                                     12470000
     RCBM35O.ACTINDC(I) = DFHRED;                                       12480000
     RCBM35I.ACTINDL(I) = -1;                                           12490000
     CALL RCBC35M_SEND_MAP_CSR;                                         12500000
   END;                                                                 12510000
                                                                        12520000
   OTHERWISE                                                            12530000
   DO;                                                                  12540000
     CALL RCBC35M_PROTECT_MAP;                                          12550000
     PIC_EXPLAIN        = SQLCA.SQLCODE;                                12560000
     RCBM35O.MSGLNO     = 'DB2 ERROR - RC FROM RCBT0691 DELETE = '      12570000
                       || PIC_EXPLAIN;                                  12580000
     RCBM35O.ACTINDC(I) = DFHRED;                                       12590000
     RCBM35I.ACTINDL(I) = -1;                                           12600000
     CALL RCBC35M_SEND_MAP_CSR;                                         12610000
   END;                                                                 12620000
 END;                                                                   12630000
                                                                        12640000
0END RCBC35M_DELETE_RECORD;                                             12650000
1/********************************************************************/ 12660000
 /*      CREATE T560 RECORD                                          */ 12670000
 /********************************************************************/ 12680000
0RCBC35M_UPD_T560: PROC;                                                12690000
                                                                        12700000
 DCL WRK_TIME_IN  CHAR(26) INIT('');                                    12710000
                                                                        12720000
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         12730000
                                                                        12740000
 WRKMAP_DATA = ' ';                                                     12750000
 WRKMAP.OFF_SNAME       = RCBM35I.OFF_SNAMEI(I);                        12760000
 WRKMAP.ORI_SLC         = RCBM35I.ORI_SLCI(I);                          12770000
 WRKMAP.MESE_SLC        = RCBM35I.MESE_SLCI(I);                         12780000
                                                                        12790000
 RCB560S                = '';                                           12800000
 RCB560SI.INDNULL(*)    = 0;                                            12810000
 RCB560S.COUNTRY_NUMBER = WRK_COUNTRY_NUMBER;                           12820000
 RCB560S.TXN_CODE       = 'RCBTXN35';                                   12830000
 RCB560S.TIMESTAMP      = WRK_TIME_IN;                                  12840000
 RCB560S.USERID         = HEADER.USERID;                                12850000
 RCB560S.ACTION         = WRK_ACTION;                                   12860000
 RCB560S.DATA           = WRKMAP_DATA;                                  12870000
                                                                        12880000
 EXEC SQL                                                               12890000
      INSERT INTO RCBV0560_XACTION                                      12900000
      (COUNTRY_NUMBER,                                                  12910000
       TXN_CODE,                                                        12920000
       TIMESTAMP,                                                       12930000
       USERID,                                                          12940000
       ACTION,                                                          12950000
       DATA)                                                            12960000
        VALUES (:RCB560S:RCB560SI.INDNULL);                             12970000
                                                                        12980000
 SELECT(SQLCA.SQLCODE);                                                 12990000
   WHEN(0);                                                             13000000
   OTHERWISE                                                            13010000
   DO;                                                                  13020000
     CALL RCBC35M_PROTECT_MAP;                                          13030000
     RET_CODE = SQLCA.SQLCODE;                                          13040000
     SUB_CODE = SQLCA.SQLCABC;                                          13050000
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       13060000
     RCBM35O.MSGLNO = 'DB2 ERROR - RC FROM RCBT0560 INSERT = '          13070000
                        || PIC_EXPLAIN;                                 13080000
     CALL RCBC35M_SEND_MAP;                                             13090000
   END;                                                                 13100000
 END;                                                                   13110000
                                                                        13120000
0END RCBC35M_UPD_T560;                                                  13130000
1/*******************************************************************/  13140000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  13150000
 /*******************************************************************/  13160000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  13170000
  $DAIMOD (RCBC35M);                     /* MODULE TO BE COMPILED   */  13180000
0/*******************************************************************/  13190000
 /* END OF ABR BLOCK '                                              */  13200000
 /*******************************************************************/  13210000
0 END RCBC35M;                                                          13220000