 /* RCBC04P - REALLOCATION OF OU FOR HARDWARE PRODUCTS               */ 00010001
 /********************************************************************/ 00020001
 /*                                                                  */ 00030001
 /* TRANSACTION CODE    : RC04                                       */ 00040001
 /*                                                                  */ 00050001
 /* PROGRAM NAME        : RCBC04M                                    */ 00060001
 /*                                                                  */ 00070001
 /* TYPE                : CICS/VS                                    */ 00080001
 /*                                                                  */ 00090001
 /* USED MAPSET         : RCBM04                                     */ 00100001
 /*      MAP            : RCBM04                                     */ 00110001
 /*                     : RCBH04                                     */ 00120032
 /*                                                                  */ 00130032
 /*                                                                  */ 00140001
 /* DESCRIPTION         : REALLOCATION OF OU FOR HARDWARE PRODUCTS   */ 00150001
 /*                                                                  */ 00160001
 /* LINKED TRANSACTION  : RC04                                       */ 00170001
 /*                                                                  */ 00180001
 /* MESSAGES            :                                            */ 00190001
 /*                                                                  */ 00200001
 /*                                                                  */ 00210001
 /*  MAINTENANCE LOG :                                               */ 00220001
 /*  ---------------                                                 */ 00230001
 /*                                                                  */ 00240001
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00250001
 /*  --------------------------------------------------------------  */ 00260001
 /*  2001-10-24 | RC01230      | CSP TO PL1/CICS CONVERSION          */ 00270004
 /*  2003/12/08 | RB01261      | MAKE COUNTRY NUMBER CHANGEABLE      */ 00290054
 /*  2003/12/08 | RB01263      | MINOR CICS CHANGES                  */ 00291054
 /*  2008/02/08 | CEDS00000361 | WORK_DATE HAS ASSIGNED              */ 00291165
 /*  2008/07/17 | CEDS00000417 | INVALID EFFECTIVE DATE HAS BEEN     */ 00291269
 /*             |              | HANDLED                             */ 00292069
 /*  2008/07/21 | CEDS00000422 | CHANGES TO HANDLE ERROR MESSAGES    */ 00293074
 /*  2012/04/14 | RB01320      | LONG SERIAL IMPACT                  */ 00294081
 /*  2015/01/22 | CEDS00000723 | UNABLE TO LOCATE TOS IN THE SCREEN  */ 00295086
 /********************************************************************/ 00300001
1RCBC04M: PROC(COMMPTR)                                                 00310001
          OPTIONS (MAIN)                                                00320001
          REORDER;                                                      00330001
0/********************************************************************/ 00340001
 /*  EXTERNAL ENTRIES                                                */ 00350001
 /********************************************************************/ 00360001
                                                                        00361055
0DCL PLIXOPT   VAR  CHAR (256)                                          00362055
               INIT ('STORAGE(00,00,00,0)') STATIC EXTERNAL;            00363055
                                                                        00370001
 DCL RCBFAQN ENTRY EXTERNAL;                                            00380001
 DCL RCB004N ENTRY EXTERNAL;                                            00390001
                                                                        00400001
0/********************************************************************/ 00410001
 /*  BMS RELATED CONSTANTS                                           */ 00420001
 /********************************************************************/ 00430001
 %INCLUDE DFHBMSCA;                                                     00440001
0/********************************************************************/ 00450001
 /*  ATTENTION IDENTIFIER CONSTANTS                                  */ 00460001
 /********************************************************************/ 00470001
 %INCLUDE DFHAID;                                                       00480001
1/********************************************************************/ 00490001
 /*  COMMUNICATION AREA                                              */ 00500001
 /********************************************************************/ 00510001
     %INCLUDE (RCBCP2S);                                                00520001
     %INCLUDE (RCBCHDS);,                                               00530001
     %INCLUDE (RCBC00S);,                                               00540001
     %INCLUDE (RCBC01S);;                                               00550001
0/********************************************************************/ 00560001
 /*  MAP STRUCTURES                                                  */ 00570001
 /********************************************************************/ 00580001
 %INCLUDE (RCBM04);                                                     00590001
0/********************************************************************/ 00600001
 /*  DB2 STRUCTURES                                                  */ 00610001
 /********************************************************************/ 00620001
 DCL 1 RCB110S,                                                         00630002
     %INCLUDE (RCB110S);;                                               00640002
 DCL 1 RCB110SI,                                                        00650002
     %INCLUDE (RCB110SI);;                                              00660002
 DCL 1 RCB125S,                                         /*SOC RB01320*/ 00661081
     %INCLUDE (RCB125S);;                                               00662078
 DCL 1 RCB125SI,                                                        00663078
     %INCLUDE (RCB125SI);;                              /*EOC RB01320*/ 00664081
 DCL 1 RCB170S,                                                         00670001
     %INCLUDE (RCB170S);;                                               00680001
 DCL 1 RCB170SI,                                                        00690001
     %INCLUDE (RCB170SI);;                                              00700001
 DCL 1 RCB190S,                                                         00710001
     %INCLUDE (RCB190S);;                                               00720001
 DCL 1 RCB190SI,                                                        00730001
     %INCLUDE (RCB190SI);;                                              00740001
 DCL 1 RCB560S,                                                         00781043
     %INCLUDE (RCB560S);;                                               00782043
 DCL 1 RCB560SI,                                                        00783043
     %INCLUDE (RCB560SI);;                                              00784043
0/********************************************************************/ 00790001
 /*  NULL INDICATORS                                                 */ 00800001
 /********************************************************************/ 00810001
 DCL 1 NULL110      BASED(ADDR(RCB110SI)),                              00820001
       3 NUL110A    FIXED BIN(15) INIT(0),                              00830033
       3 NUL110B    FIXED BIN(15) INIT(0),                              00840033
       3 NUL110C    FIXED BIN(15) INIT(0),                              00850033
       3 NUL110D    FIXED BIN(15) INIT(0),                              00860033
       3 NUL110E    FIXED BIN(15) INIT(0),                              00870033
       3 NUL110F    FIXED BIN(15) INIT(0),                              00880033
       3 NUL110G    FIXED BIN(15) INIT(0),                              00890033
       3 NUL110H    FIXED BIN(15) INIT(0),                              00900033
       3 NUL110I    FIXED BIN(15) INIT(0);                              00910033
 DCL 1 NULL170      BASED(ADDR(RCB170SI)),                              00920001
       3 NUL170A    FIXED BIN(15) INIT(0),                              00930033
       3 NUL170B    FIXED BIN(15) INIT(0),                              00940033
       3 NUL170C    FIXED BIN(15) INIT(0),                              00950033
       3 NUL170D    FIXED BIN(15) INIT(0),                              00960033
       3 NUL170E    FIXED BIN(15) INIT(0),                              00970033
       3 NUL170F    FIXED BIN(15) INIT(0),                              00980033
       3 NUL170G    FIXED BIN(15) INIT(0),                              00990033
       3 NUL170H    FIXED BIN(15) INIT(0);                              01000033
 DCL 1 NULL190      BASED(ADDR(RCB190SI)),                              01010001
       3 NUL190A    FIXED BIN(15) INIT(0),                              01020033
       3 NUL190B    FIXED BIN(15) INIT(0),                              01030033
       3 NUL190C    FIXED BIN(15) INIT(0),                              01040033
       3 NUL190D    FIXED BIN(15) INIT(0),                              01050033
       3 NUL190E    FIXED BIN(15) INIT(0),                              01060033
       3 NUL190F    FIXED BIN(15) INIT(0),                              01070033
       3 NUL190G    FIXED BIN(15) INIT(0),                              01080033
       3 NUL190H    FIXED BIN(15) INIT(0),                              01090033
       3 NUL190I    FIXED BIN(15) INIT(0),                              01100033
       3 NUL190J    FIXED BIN(15) INIT(0),                              01110033
       3 NUL190K    FIXED BIN(15) INIT(0);                              01120033
0/********************************************************************/ 01130001
 /*  INTERFACE AREAS                                                 */ 01140001
 /********************************************************************/ 01150001
 DCL 1 DATE_AREA,                                                       01160001
     %INCLUDE (RCBZ03S);;                                               01170001
 DCL 1 RCBZ02S,                                                         01180001
      %INCLUDE RCBZ02S;;                                                01190001
 DCL 1 SQLCA_R      BASED(ADDR(RCBZ02S.RETURN_SQL))                     01200001
                    LIKE SQLCA;                                         01210001
 DCL 1 PARM_INT_AREA,                                                   01220001
      %INCLUDE RCBZ01S;;                                                01230001
0/********************************************************************/ 01240001
 /*  RETURN CODES                                                    */ 01250001
 /********************************************************************/ 01260001
 DCL RESPONSE     FIXED BINARY(31) INIT(0);    /*RETURN CODE         */ 01270033
 DCL CODE_EXPLAIN FIXED BINARY(31) INIT(0);    /*RETURN CODE EXPLAIN */ 01280033
0/********************************************************************/ 01290001
 /*  WORKING DECLARATIONS                                            */ 01300001
 /********************************************************************/ 01310001
 DCL DATE_ERROR               BIT(1) INIT('0'B);                        01340033
 DCL PF4_FLAG                 BIT(1) INIT('0'B);                        01350033
 DCL PF5_FLAG                 BIT(1) INIT('0'B);                        01360033
 DCL ENTER_FLAG               BIT(1) INIT('0'B);                        01370033
 DCL ERROR_FLAG               BIT(1) INIT('0'B);                        01380033
 DCL T040_FND_FLAG            BIT(1) INIT('0'B);                        01400033
 DCL T110_FND_FLAG            BIT(1) INIT('0'B);                        01410033
 DCL T125_FND_FLAG            BIT(1) INIT('0'B);      /* SOC RB01320 */ 01411082
 DCL DUMMY_ORIGIN             CHAR(2);                                  01412082
 DCL DUMMY_SEQUENCE           CHAR(7);                /* EOC RB01320 */ 01413082
 DCL CSRSET                   CHAR(1) INIT('02'X);                      01420036
 DCL WRK_END_DATE_T040        CHAR(10) INIT('');                        01450033
 DCL WRK_OU                   CHAR(7) INIT('');                         01460033
 DCL WRK_HRS_PIC              PIC'Z9V.9' INIT(0);                       01470033
 DCL WRK_HRS_CH               CHAR(4) BASED(ADDR(WRK_HRS_PIC));         01480001
 DCL COMMAREA_STRING          CHAR(5984) INIT('');                      01501046
 DCL WRK_REC_COUNT            FIXED BIN(15) INIT(0);                    01510033
 DCL WRKMAP_DATA              CHAR(500) INIT('');                       01520033
 DCL 1 WRKMAP                 BASED(ADDR(WRKMAP_DATA)),                 01530001
     %INCLUDE RCBB562;;                                                 01540001
 DCL WRK_TIME_IN              CHAR(26) INIT(''); /* CEDS00000361      */01541065
0/********************************************************************/ 01550001
 /*  MESSAGES                                                        */ 01560001
 /********************************************************************/ 01570001
 DCL ERR_MESSAGE3 CHAR(30) INIT('ERROR IN RECEIVING MAP ');             01580001
 DCL ERR_MESSAGE13 CHAR(33) INIT('OTHER ERRORS                     ');  01590001
 DCL ERR_MESSAGE30 CHAR(40) INIT('ERROR IN RETURNING TO CICS  ');       01600001
 DCL ERR_O001 CHAR(31) INIT('Invalid syntax of generic field');         01610001
 DCL ERR_O002 CHAR(12) INIT('Invalid date');                            01620001
 DCL ERR_O003 CHAR(35) INIT('OU code does not exist at view date');     01630001
 DCL ERR_O004 CHAR(27) INIT('Invalid use of function key');             01640001
 DCL ERR_O005 CHAR(45) INIT                                             01650008
  ('The highlighted fields have a syntax ERROR');                       01660001
 DCL ERR_O012 CHAR(38) INIT('End date earlier than effective date');    01670008
 DCL ERR_O018 CHAR(55) INIT                                             01680008
  ('Effective date may not be earlier than current date');              01690001
 DCL ERR_O022 CHAR(19) INIT('Press F5 to execute');                     01700015
 DCL ERR_O025 CHAR(38) INIT('Cursor not on a valid prompt field');      01710001
 DCL ERR_O026 CHAR(68) INIT                                             01720008
  ('All prods which fulfill the selection criteria are reallocated');   01730001
 DCL ERR_O039 CHAR(62) INIT                                             01740001
  ('Customer number, old OU code or TOS should be filled in');          01750001
 DCL ERR_O040 CHAR(40) INIT('Customer Number does not exist');          01760001
 DCL ERR_O041 CHAR(66) INIT                                             01770008
  ('OU code is not effective until the end date of reallocation');      01780001
 DCL ERR_O042 CHAR(53) INIT                                             01790001
  ('Not allowed to specify Ogser if Type is not specified');            01800001
 DCL ERR_O043 CHAR(24) INIT('The TOS is not installed');                01810001
 DCL ERR_O044 CHAR(65) INIT                                             01820008
  ('Not allowed to specify Old OU code if TOS is specified');           01830001
 DCL ERR_O045 CHAR(60) INIT                                             01840008
  ('The TOS is not installed until the end date of reallocation');      01850001
 DCL ERR_O057 CHAR(70) INIT                                             01851047
 ('You are not authorized to use the function for this Country number');01852047
 DCL ERR_O063 CHAR(32) INIT('Type does not exist for Hardware');        01860001
 DCL ERR_O065 CHAR(25) INIT('OU code may not be blank');                01870001
 DCL ERR_O069 CHAR(37) INIT('New and old OU code must be different');   01880001
 DCL ERR_O070 CHAR(68) INIT                                             01890008
  ('There are no products which fulfil the criteria to be reallocated');01900001
 DCL ERR_O072 CHAR(25) INIT('Country number is invalid');               01901045
 DCL ERR_O079 CHAR(68) INIT                                             01910001
 ('Not allowed to maintain serv. contracts,no activity report created');01920001
 DCL ERR_O098 CHAR(23) INIT('Invalid command entered');                 01930001
-/********************************************************************/ 01940002
 /****   DECLARATIONS OF DB2 ERROR CONDITIONS                     ****/ 01950002
 /********************************************************************/ 01960002
  EXEC SQL  WHENEVER NOT FOUND   CONTINUE;                              01970033
  EXEC SQL  WHENEVER SQLWARNING  CONTINUE;                              01980033
  EXEC SQL  WHENEVER SQLERROR    CONTINUE;                              01990033
0/********************************************************************/ 02000001
 /*                 BUILD IN FUNCTIONS                               */ 02010001
 /********************************************************************/ 02020001
0DCL (LENGTH,                                                           02030001
      STRING,                                                           02040001
      SUBSTR,                                                           02050001
      VERIFY,                                                           02060001
      DECIMAL,                                                          02070001
      DATETIME,                                                         02080001
      CHAR,                                                             02090001
      NULL,                                                             02100001
      CSTG,                                                             02110001
      ADDR)   BUILTIN;                                                  02120001
-/********************************************************************/ 02130002
 /****   DECLARATIONS OF DB2 SQLCA                                ****/ 02140002
 /********************************************************************/ 02150002
  EXEC SQL  INCLUDE  SQLCA;                                             02160033
-/********************************************************************/ 02170002
 /****   DECLARATIONS OF DB2 CURSORS                              ****/ 02180002
 /********************************************************************/ 02190002
                                                                        02200002
 /* OU_CODE_OLD & CUSTOMER_NUMBER ¬= *, PRODUCT_TYPE ¬= *      */       02210002
                                                                        02220015
  EXEC SQL  DECLARE CSR_A CURSOR FOR                                    02230002
            SELECT A.ORIGIN                                             02240002
                  ,A.SEQUENCE_NUMBER                                    02250002
                  ,A.EFFECTIVE_DATE                                     02260002
                  ,A.END_DATE                                           02270002
                  ,B.EFFECTIVE_DATE                                     02280002
                  ,B.END_DATE                                           02290002
            FROM RCBV0170_OU_HW A                                       02300002
                ,RCBV0190_HW_CUST B                                     02310002
            WHERE A.COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER              02320046
              AND A.OU_CODE          = :WRK_OU_CODE_OLD                 02330012
              AND A.PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                02340002
              AND B.COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER              02350046
              AND B.CUSTOMER_NUMBER  = :WRK_CUSTOMER_NUMBER             02360002
              AND B.TYPE_OF_RELATION = 'U'                              02370002
              AND B.PRODUCT_TYPE     = A.PRODUCT_TYPE                   02380002
              AND B.ORIGIN           = A.ORIGIN                         02390002
              AND B.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER                02400002
              AND A.EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE              02410002
              AND A.END_DATE        >= :WRK_END_DATE                    02420002
              AND B.EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE              02430002
              AND B.END_DATE        >= :WRK_END_DATE                    02440002
              AND B.EFFECTIVE_DATE  <= A.EFFECTIVE_DATE                 02450002
              AND B.END_DATE        >= A.END_DATE                       02460002
            ORDER BY A.ORIGIN,A.SEQUENCE_NUMBER                         02470002
            FOR FETCH ONLY                                              02480002
            WITH UR;                                                    02490002
                                                                        02500002
 /* OU_CODE_OLD & CUSTOMER_NUMBER ¬= *, PRODUCT_TYPE = *       */       02510002
                                                                        02520015
  EXEC SQL  DECLARE CSR_B CURSOR FOR                                    02530002
            SELECT A.PRODUCT_TYPE                                       02540002
                  ,A.ORIGIN                                             02550002
                  ,A.SEQUENCE_NUMBER                                    02560002
                  ,A.EFFECTIVE_DATE                                     02570002
                  ,A.END_DATE                                           02580002
                  ,B.EFFECTIVE_DATE                                     02590002
                  ,B.END_DATE                                           02600002
            FROM RCBV0170_OU_HW A                                       02610002
                ,RCBV0190_HW_CUST B                                     02620002
            WHERE A.COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER              02630046
              AND A.OU_CODE          = :WRK_OU_CODE_OLD                 02640012
              AND B.COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER              02650046
              AND B.CUSTOMER_NUMBER  = :WRK_CUSTOMER_NUMBER             02660002
              AND B.TYPE_OF_RELATION = 'U'                              02670002
              AND B.PRODUCT_TYPE     = A.PRODUCT_TYPE                   02680002
              AND B.ORIGIN           = A.ORIGIN                         02690002
              AND B.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER                02700002
              AND A.EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE              02710002
              AND A.END_DATE        >= :WRK_END_DATE                    02720002
              AND B.EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE              02730002
              AND B.END_DATE        >= :WRK_END_DATE                    02740002
              AND B.EFFECTIVE_DATE  <= A.EFFECTIVE_DATE                 02750002
              AND B.END_DATE        >= A.END_DATE                       02760002
            ORDER BY A.PRODUCT_TYPE,A.ORIGIN,A.SEQUENCE_NUMBER          02770002
            FOR FETCH ONLY                                              02780002
            WITH UR;                                                    02790002
                                                                        02800002
 /* OU_CODE_OLD ¬= *, CUSTOMER_NUMBER = *, PRODUCT_TYPE ¬= *  */        02810002
                                                                        02820015
  EXEC SQL  DECLARE CSR_C CURSOR FOR                                    02830002
            SELECT ORIGIN                                               02840002
                  ,SEQUENCE_NUMBER                                      02850002
                  ,EFFECTIVE_DATE                                       02860002
                  ,END_DATE                                             02870002
            FROM RCBV0170_OU_HW                                         02880002
            WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                02890046
              AND OU_CODE          = :WRK_OU_CODE_OLD                   02900012
              AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                  02910002
              AND EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE                02920002
              AND END_DATE        >= :WRK_END_DATE                      02930002
            ORDER BY ORIGIN,SEQUENCE_NUMBER                             02940002
            FOR FETCH ONLY                                              02950002
            WITH UR;                                                    02960002
                                                                        02970002
 /* OU_CODE_OLD ¬= *, CUSTOMER_NUMBER = *, PRODUCT_TYPE = *  */         02980002
                                                                        02990015
  EXEC SQL  DECLARE CSR_D CURSOR FOR                                    03000002
            SELECT PRODUCT_TYPE                                         03010002
                  ,ORIGIN                                               03020002
                  ,SEQUENCE_NUMBER                                      03030002
                  ,EFFECTIVE_DATE                                       03040002
                  ,END_DATE                                             03050002
            FROM RCBV0170_OU_HW                                         03060002
            WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                03070046
              AND OU_CODE          = :WRK_OU_CODE_OLD                   03080012
              AND EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE                03090002
              AND END_DATE        >= :WRK_END_DATE                      03100002
            ORDER BY PRODUCT_TYPE,ORIGIN,SEQUENCE_NUMBER                03110002
            FOR FETCH ONLY                                              03120002
            WITH UR;                                                    03130002
                                                                        03140002
 /* OU_CODE_OLD = *, CUSTOMER_NUMBER ¬= *, PRODUCT_TYPE ¬= * */         03150002
 /* SEQUENCE_NUMBER = * OR ' '                               */         03160002
                                                                        03170015
  EXEC SQL  DECLARE CSR_E CURSOR FOR                                    03180002
            SELECT ORIGIN                                               03190002
                  ,SEQUENCE_NUMBER                                      03200002
                  ,EFFECTIVE_DATE                                       03210002
                  ,END_DATE                                             03220002
            FROM RCBV0190_HW_CUST                                       03230002
            WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                03240046
              AND PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                  03250002
              AND CUSTOMER_NUMBER  = :WRK_CUSTOMER_NUMBER               03260002
              AND TYPE_OF_RELATION = 'U'                                03270002
              AND EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE                03280002
              AND END_DATE        >= :WRK_END_DATE                      03290002
            ORDER BY ORIGIN,SEQUENCE_NUMBER                             03300002
            FOR FETCH ONLY                                              03310002
            WITH UR;                                                    03320002
                                                                        03330002
 /* OU_CODE_OLD = *, CUSTOMER_NUMBER ¬= *, PRODUCT_TYPE = *  */         03340002
 /* SEQUENCE_NUMBER = * OR ' '                               */         03350002
                                                                        03360015
  EXEC SQL  DECLARE CSR_F CURSOR FOR                                    03370002
            SELECT PRODUCT_TYPE                                         03380002
                  ,ORIGIN                                               03390002
                  ,SEQUENCE_NUMBER                                      03400002
                  ,EFFECTIVE_DATE                                       03410002
                  ,END_DATE                                             03420002
            FROM RCBV0190_HW_CUST                                       03430002
            WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                03440046
              AND CUSTOMER_NUMBER  = :WRK_CUSTOMER_NUMBER               03450002
              AND TYPE_OF_RELATION = 'U'                                03460002
              AND EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE                03470002
              AND END_DATE        >= :WRK_END_DATE                      03480002
            ORDER BY PRODUCT_TYPE,ORIGIN,SEQUENCE_NUMBER                03490002
            FOR FETCH ONLY                                              03500002
            WITH UR;                                                    03510002
                                                                        03520002
 /* OU_CODE_OLD = *, CUSTOMER_NUMBER ¬= *, OGSER ¬= *        */         03530002
                                                                        03540015
  EXEC SQL  DECLARE CSR_G CURSOR FOR                                    03550002
            SELECT PRODUCT_TYPE                                         03560002
                  ,ORIGIN                                               03570002
                  ,SEQUENCE_NUMBER                                      03580002
                  ,EFFECTIVE_DATE                                       03590002
                  ,END_DATE                                             03600002
            FROM RCBV0190_HW_CUST                                       03610002
            WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                03620046
              AND ORIGIN           = :WRK_ORIGIN                        03630002
              AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER               03640002
              AND CUSTOMER_NUMBER  = :WRK_CUSTOMER_NUMBER               03650002
              AND TYPE_OF_RELATION = 'U'                                03660002
              AND EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE                03670002
              AND END_DATE        >= :WRK_END_DATE                      03680002
            ORDER BY PRODUCT_TYPE,ORIGIN,SEQUENCE_NUMBER                03690002
            FOR FETCH ONLY                                              03700002
            WITH UR;                                                    03710002
                                                                        03720002
 /* OU_CODE_OLD = *, CUSTOMER_NUMBER = *, OGSER ¬= *        */          03730002
                                                                        03740015
  EXEC SQL  DECLARE CSR_H CURSOR FOR                                    03750002
            SELECT PRODUCT_TYPE                                         03760002
                  ,ORIGIN                                               03770002
                  ,SEQUENCE_NUMBER                                      03780002
                  ,EFFECTIVE_DATE                                       03790002
                  ,END_DATE                                             03800002
            FROM RCBV0170_OU_HW                                         03810015
            WHERE COUNTRY_NUMBER   = :WRK_COUNTRY_NUMBER                03820046
              AND ORIGIN           = :WRK_ORIGIN                        03830002
              AND SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER               03840002
              AND EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE                03850002
              AND END_DATE        >= :WRK_END_DATE                      03860002
            ORDER BY PRODUCT_TYPE,ORIGIN,SEQUENCE_NUMBER                03870002
            FOR FETCH ONLY                                              03880002
            WITH UR;                                                    03890002
                                                                        03900002
1/********************************************************************/ 03910002
 /*                   M A I N   P R O C E S S I N G                  */ 03920002
 /*                                                                  */ 03930001
 /********************************************************************/ 03940001
0RCBM04O.MSG_LINEO = '';                                                03950001
                                                                        03960001
 IF EIBCALEN = 0 THEN                                                   03970024
 DO;                                                                    03980024
   EXEC CICS XCTL PROGRAM('RCBC00P');                                   03990024
 END;                                                                   04000024
                                                                        04010024
                                                                        04011065
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP; /* CEDS00000361      */ 04012065
 WRK_DATE = SUBSTR(WRK_TIME_IN,1,10);           /* CEDS00000361      */ 04013065
                                                                        04014065
 IF HEADER.NEXT = '99' THEN                                             04020024
 DO;                                                                    04030001
   HEADER.NEXT = '00';                                                  04040001
   CALL RCBC04M_CLEAR_WORK;                                             04050001
   CALL RCBC04M_FILL_MAP;                                               04060022
   RCBM04O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                        04070046
   TMP_COUNTRY_NUMBER      = WRK_COUNTRY_NUMBER;                        04071047
   CALL RCBC04M_SEND_MAP;                                               04080001
 END;                                                                   04090001
                                                                        04100001
 PF4_FLAG   = FALSE;                                                    04110001
 ENTER_FLAG = FALSE;                                                    04120001
                                                                        04130001
 IF HEADER.NEXT = '98' THEN     /* FROM RCBC02M */                      04140001
 DO;                                                                    04150001
   HEADER.NEXT = '00';                                                  04160001
   IF NEW_OU_FLAG = TRUE THEN                                           04170001
   DO;                                                                  04180012
     NEW_OU_FLAG = FALSE;                                               04190012
     WRK_OU_CODE_NEW = WRK_OU_CODE;                                     04200001
   END;                                                                 04210012
   ELSE                                                                 04220001
     WRK_OU_CODE_OLD = WRK_OU_CODE;                                     04230001
                                                                        04240012
   CALL RCBC04M_FILL_MAP;                                               04250001
   CALL RCBC04M_SEND_MAP;                                               04260001
 END;                                                                   04270001
                                                                        04280001
 IF HEADER.NEXT = '97' THEN     /* FROM RCBC05M */                      04290001
 DO;                                                                    04300001
   HEADER.NEXT = '00';                                                  04310001
   CALL RCBC04M_FILL_MAP;                                               04320001
   CALL RCBC04M_SEND_MAP;                                               04330001
 END;                                                                   04340001
                                                                        04350001
 IF HEADER.NEXT = '96' THEN     /* FROM RCBC06M */                      04360001
 DO;                                                                    04370001
   HEADER.NEXT = '00';                                                  04380001
   CALL RCBC04M_FILL_MAP;                                               04390001
   CALL RCBC04M_SEND_MAP;                                               04400001
 END;                                                                   04410001
                                                                        04420001
 IF HEADER.NEXT = '95' THEN     /* FROM RCBC07M */                      04430001
 DO;                                                                    04440001
   HEADER.NEXT = '00';                                                  04450001
   CALL RCBC04M_FILL_MAP;                                               04460001
   CALL RCBC04M_SEND_MAP;                                               04470001
 END;                                                                   04480001
                                                                        04490001
 IF HEADER.NEXT = 'H1' THEN     /* FROM HELP SCREEN */                  04500028
 DO;                                                                    04510028
   HEADER.NEXT = '00';                                                  04520028
   CALL RCBC04M_RESTORE_MAP;                                            04530038
   CALL RCBC04M_GET_CSR_POS;                                            04540033
   CALL RCBC04M_SEND_MAP_CSR;                                           04550033
 END;                                                                   04560033
                                                                        04570033
 SELECT (EIBAID);                                                       04580033
   WHEN (DFHPF1,DFHPF13)                                                04590001
   DO;                                                                  04600001
     CALL RCBC04M_RECEIVE_MAP;                                          04601053
     CALL RCBC04M_SAVE_MAP;                                             04610038
     CALL RCBC04M_HELP_MAP;                                             04611038
   END;                                                                 04620001
                                                                        04630001
   WHEN (DFHPF3,DFHPF15)                                                04640001
   DO;                                                                  04650001
     HEADER.NEXT = 'H1';                                                04660001
     EXEC CICS XCTL                                                     04670001
         PROGRAM('RCBC00P')                                             04680001
         COMMAREA(COMMAREA)                                             04690001
         LENGTH(CSTG(COMMAREA))                                         04700001
         RESP(RESPONSE)                                                 04710001
         RESP2(CODE_EXPLAIN);                                           04720001
   END;                                                                 04730001
                                                                        04740001
   WHEN (DFHPF4,DFHPF16)                                                04750001
   DO;                                                                  04760001
     PF4_FLAG = TRUE;                                                   04770001
     CALL RCBC04M_RECEIVE_MAP;                                          04780053
     CALL RCBC04M_VALIDATE_MAP;                                         04790001
   END;                                                                 04800001
                                                                        04810001
   WHEN (DFHPF5,DFHPF17)                                                04820001
   DO;                                                                  04830001
     PF5_FLAG = TRUE;                                                   04840001
     CALL RCBC04M_RECEIVE_MAP;                                          04850053
     CALL RCBC04M_VALIDATE_MAP;                                         04860001
     CALL RCBC04M_UPDATE_PROCESS;                                       04870001
   END;                                                                 04880001
                                                                        04890001
   WHEN (DFHENTER)                                                      04900001
   DO;                                                                  04910001
     ENTER_FLAG = TRUE;                                                 04920028
     CALL RCBC04M_RECEIVE_MAP;                                          04930053
     CALL RCBC04M_VALIDATE_MAP;                                         04940028
     CALL RCBC04M_ENTER_PROCESS;                                        04950028
     CALL RCBC04M_SEND_MAP;                                             04960028
   END;                                                                 04970001
                                                                        04980001
   WHEN (DFHCLEAR)                                                      04990008
   DO;                                                                  05000026
     EXEC CICS SEND                                                     05010026
        CONTROL                                                         05020026
        ERASE                                                           05030026
        FREEKB;                                                         05040026
     EXEC CICS RETURN;                                                  05050026
   END;                                                                 05060026
                                                                        05070008
   OTHERWISE                        /* INVALID KEY ENTERED */           05080001
   DO;                                                                  05090001
     CALL RCBC04M_RECEIVE_MAP;                                          05090153
     RCBM04O.MSG_LINEO    = ERR_O004;                                   05100053
     RCBM04I.OU_CODE_NEWL = -1;                                         05110028
     CALL RCBC04M_SEND_MAP_CSR;                                         05120033
   END;                                                                 05130026
                                                                        05140001
 END;                                                                   05150001
1/********************************************************************/ 05160001
 /*      RECEIVE MAP RCB01M                                          */ 05170001
 /********************************************************************/ 05180001
0RCBC04M_RECEIVE_MAP : PROC;                                            05190053
                                                                        05200001
 EXEC CICS RECEIVE                  /* RECEIVE DRIVER MAP       */      05210001
    MAP('RCBM04')                                                       05220001
    MAPSET('RCBM04')                                                    05230001
    RESP(RESPONSE)                                                      05240001
    RESP2(CODE_EXPLAIN);                                                05250001
                                                                        05260001
 SELECT(RESPONSE);                  /* CHECK RESPONSE           */      05270001
   WHEN(DFHRESP(NORMAL))                                                05280001
   DO;                                                                  05290001
     HEADER.RET_CODE = '';        /* INITIALISE RETURN CODES  */        05300001
     HEADER.SUB_CODE = '';                                              05310001
   END;                                                                 05320001
                                                                        05330001
   OTHERWISE                                                            05340001
   DO;                                                                  05350001
     RCBM04O.MSG_LINEO = ERR_MESSAGE3;                                  05360001
     CALL RCBC04M_SEND_MAP;                                             05370033
   END;                                                                 05380001
 END;                                                                   05390001
                                                                        05400001
0END RCBC04M_RECEIVE_MAP;                                               05410053
1/********************************************************************/ 05420001
 /*      FILL MAP FROM WORK FIELDS                                   */ 05430001
 /********************************************************************/ 05440001
0RCBC04M_FILL_MAP: PROC;                                                05450001
                                                                        05460001
 RCBM04O.COUNTRY_NUMBERO   = WRK_COUNTRY_NUMBER;                        05470046
 IF NEW_OU_COUNTRY_FLAG = TRUE THEN                                     05480017
      RCBM04O.OU_CODE_NEWO = 'COUNTRY';                                 05490015
 ELSE RCBM04O.OU_CODE_NEWO = WRK_OU_CODE_NEW;                           05500015
 IF OLD_OU_COUNTRY_FLAG = TRUE THEN                                     05510017
      RCBM04O.OU_CODE_OLDO = 'COUNTRY';                                 05520015
 ELSE RCBM04O.OU_CODE_OLDO = WRK_OU_CODE_OLD;                           05530015
 RCBM04O.CUSTOMER_NUMBERO  = WRK_CUSTOMER_NUMBER;                       05540015
 RCBM04O.PRODUCT_TYPEO     = WRK_PRODUCT_TYPE;                          05550015
 IF T125_FND_FLAG = TRUE THEN                           /*SOC RB01320*/ 05551081
 DO;                                                                    05551178
 RCBM04O.ORIGINO           = DUMMY_ORIGIN;                              05551279
 RCBM04O.SEQNOO            = DUMMY_SEQUENCE;                            05551379
 END;                                                                   05551478
 ELSE DO;                                               /*EOC RB01320*/ 05551581
 RCBM04O.ORIGINO           = WRK_ORIGIN;                                05551678
 RCBM04O.SEQNOO            = WRK_SEQUENCE_NUMBER;                       05551778
 END;                                                       /*RB01320*/ 05551881
 RCBM04O.EFFECTIVE_DATEO   = WRK_EFFECTIVE_DATE;                        05580015
 RCBM04O.END_DATEO         = WRK_END_DATE;                              05590015
                                                                        05600001
0END RCBC04M_FILL_MAP;                                                  05610001
1/********************************************************************/ 05620001
 /*      VALIDATE MAP                                                */ 05630001
 /********************************************************************/ 05640001
0RCBC04M_VALIDATE_MAP: PROC;                                            05650001
                                                                        05660001
 ERROR_FLAG = FALSE;                                                    05661036
                                                                        05662036
 IF WRK_COUNTRY_NUMBER ¬= RCBM04I.COUNTRY_NUMBERI THEN                  05663047
 DO;                                                                    05664047
   SEL_OPT = '2';                                                       05665047
   WRK_COUNTRY_NUMBER = RCBM04I.COUNTRY_NUMBERI;                        05666047
                                                                        05667047
   EXEC CICS LINK                                                       05668047
      PROGRAM('RCBC99P')                                                05669047
      COMMAREA(COMMAREA)                                                05670047
      LENGTH(CSTG(COMMAREA));                                           05670147
                                                                        05670247
   IF CTY_OK_FLAG = FALSE THEN                                          05670347
   DO;                                                                  05670447
     RCBM04O.MSG_LINEO       = ERR_O072;                                05670547
     RCBM04I.COUNTRY_NUMBERL = -1;                                      05670647
     RCBM04O.COUNTRY_NUMBERC = DFHRED;                                  05670747
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      05670847
     CALL RCBC04M_SEND_MAP_CSR;                                         05670947
   END;                                                                 05671047
                                                                        05671147
   IF OK_FLAG = FALSE THEN                                              05671247
   DO;                                                                  05671347
     RCBM04O.MSG_LINEO       = ERR_O057;                                05671447
     RCBM04I.COUNTRY_NUMBERL = -1;                                      05671547
     RCBM04O.COUNTRY_NUMBERC = DFHRED;                                  05671647
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      05671747
     CALL RCBC04M_SEND_MAP_CSR;                                         05671847
   END;                                                                 05671947
                                                                        05672047
   IF RCB025_FLAG = FALSE THEN                                          05672147
   DO;                                                                  05672247
     RCBM04O.MSG_LINEO =                                                05672347
                     'Parameter RCB025 is missing for this country';    05672447
     RCBM04O.COUNTRY_NUMBERC = DFHRED;                                  05672547
     RCBM04I.COUNTRY_NUMBERL = -1;                                      05672647
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      05672747
     CALL RCBC04M_SEND_MAP_CSR;                                         05672847
   END;                                                                 05672947
                                                                        05673047
   IF RCB098_FLAG = FALSE THEN                                          05673147
   DO;                                                                  05673247
     RCBM04O.MSG_LINEO =                                                05673347
                     'Parameter RCB098 is missing for this country';    05673447
     RCBM04O.COUNTRY_NUMBERC = DFHRED;                                  05673547
     RCBM04I.COUNTRY_NUMBERL = -1;                                      05673647
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      05673747
     CALL RCBC04M_SEND_MAP_CSR;                                         05673847
   END;                                                                 05673947
                                                                        05674047
   IF ASCA_STOP_FLAG = TRUE THEN                                        05674147
   DO;                                                                  05674247
     RCBM04O.MSG_LINEO       = ERR_O079;                                05674347
     RCBM04O.COUNTRY_NUMBERC = DFHRED;                                  05674448
     RCBM04I.COUNTRY_NUMBERL = -1;                                      05674647
     WRK_COUNTRY_NUMBER      = TMP_COUNTRY_NUMBER;                      05674747
     CALL RCBC04M_SEND_MAP_CSR;                                         05674847
   END;                                                                 05674947
                                                                        05675047
   TMP_COUNTRY_NUMBER = RCBM04I.COUNTRY_NUMBERI;                        05675147
 END;                                                                   05675247
                                                                        05675347
 IF RCBM04I.EFFECTIVE_DATEL = 0                                         05676033
  | RCBM04I.EFFECTIVE_DATEI = '' THEN                                   05680033
 DO;                                                                    05690007
   WRK_EFFECTIVE_DATE      = WRK_DATE;                                  05700007
   RCBM04O.EFFECTIVE_DATEO = WRK_DATE;                                  05710007
 END;                                                                   05720007
                                                                        05730007
 IF RCBM04I.END_DATEL = 0                                               05740033
  | RCBM04I.END_DATEI = '' THEN                                         05750033
 DO;                                                                    05760033
   WRK_END_DATE      = '9999-12-31';                                    05770033
   RCBM04O.END_DATEO = '9999-12-31';                                    05780033
 END;                                                                   05790033
                                                                        05800033
 IF ( ¬ RCBC04M_VALID_DATE(RCBM04I.END_DATEI)) THEN                     05810007
 DO;                                                                    05820006
   RCBM04O.MSG_LINEO = ERR_O002;                                        05830039
   RCBM04O.END_DATEC = DFHRED;                                          05840006
   RCBM04I.END_DATEL = -1;                                              05850006
   ERROR_FLAG = TRUE;                                                   05851073
 END;                                                                   05870006
                                                                        05880006
 IF ( ¬ RCBC04M_VALID_DATE(RCBM04I.EFFECTIVE_DATEI)) THEN               05890033
 DO;                                                                    05900033
   RCBM04O.MSG_LINEO       = ERR_O002;                                  05910039
   RCBM04O.EFFECTIVE_DATEC = DFHRED;                                    05920033
   RCBM04I.EFFECTIVE_DATEL = -1;                                        05930033
   ERROR_FLAG = TRUE;                                                   05931073
 END;                                                                   05950033
                                                 /* SOC CEDS00000422 */ 05961074
 IF ERROR_FLAG = TRUE THEN                                              05962073
 DO;                                                                    05963073
   CALL RCBC04M_SEND_MAP_CSR;                                           05964073
 END;                                                                   05965073
                                                 /* EOC CEDS00000422 */ 05966074
                                                                        05967073
 IF RCBM04I.EFFECTIVE_DATEI < WRK_DATE THEN                             05970006
 DO;                                                                    05980006
   RCBM04O.MSG_LINEO       = ERR_O018;                                  05990039
   RCBM04O.EFFECTIVE_DATEC = DFHRED;                                    06000006
   RCBM04I.EFFECTIVE_DATEL = -1;                                        06010006
   ERROR_FLAG = TRUE;                                                   06020076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 06021074
 END;                                                                   06030006
                                                                        06040006
 IF RCBM04I.END_DATEI < RCBM04I.EFFECTIVE_DATEI THEN                    06050006
 DO;                                                                    06060006
   RCBM04O.MSG_LINEO       = ERR_O012;                                  06070039
   RCBM04O.EFFECTIVE_DATEC = DFHRED;                                    06080006
   RCBM04O.END_DATEC       = DFHRED;                                    06090006
   RCBM04I.EFFECTIVE_DATEL = -1;                                        06100006
   ERROR_FLAG = TRUE;                                                   06110076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 06111074
 END;                                                                   06120006
                                                                        06130073
 WRK_EFFECTIVE_DATE = RCBM04I.EFFECTIVE_DATEI;                          06140033
 WRK_VIEW_DATE      = RCBM04I.EFFECTIVE_DATEI;                          06150033
 WRK_END_DATE = RCBM04I.END_DATEI;                                      06160033
                                                                        06170033
 IF PF4_FLAG = TRUE THEN                                                06180075
 DO;                                                                    06190001
   IF RCBM04I.OU_CODE_NEWI = 'COUNTRY' THEN                             06200016
   DO;                                                                  06210017
     NEW_OU_COUNTRY_FLAG = TRUE;                                        06220017
     WRK_OU_CODE_NEW     = '';                                          06230018
   END;                                                                 06240017
   ELSE DO;                                                             06250017
     NEW_OU_COUNTRY_FLAG = FALSE;                                       06260017
     WRK_OU_CODE_NEW     = RCBM04I.OU_CODE_NEWI;                        06270018
   END;                                                                 06280017
                                                                        06290017
   IF RCBM04I.OU_CODE_NEWF = CSRSET THEN                                06300017
   DO;                                                                  06310017
     WRK_OU_CODE = RCBM04I.OU_CODE_NEWI;                                06320016
     NEW_OU_FLAG = TRUE;                                                06330016
                                                                        06340016
     HEADER.NEXT = '98';                                                06350016
     CALL RCBC04M_GET_RCBC02M;                                          06360016
   END;                                                                 06370016
                                                                        06380001
   IF RCBM04I.OU_CODE_OLDI = 'COUNTRY' THEN                             06390017
   DO;                                                                  06400017
     OLD_OU_COUNTRY_FLAG = TRUE;                                        06410017
     WRK_OU_CODE_OLD     = '';                                          06420018
   END;                                                                 06430017
   ELSE DO;                                                             06440017
     OLD_OU_COUNTRY_FLAG = FALSE;                                       06450017
     WRK_OU_CODE_OLD     = RCBM04I.OU_CODE_OLDI;                        06460018
   END;                                                                 06470017
                                                                        06480016
   IF RCBM04I.OU_CODE_OLDF = CSRSET THEN                                06490001
   DO;                                                                  06500001
     WRK_OU_CODE = RCBM04I.OU_CODE_OLDI;                                06510013
     NEW_OU_FLAG = FALSE;                                               06520013
                                                                        06530013
     HEADER.NEXT = '98';                                                06540013
     CALL RCBC04M_GET_RCBC02M;                                          06550013
   END;                                                                 06560013
                                                                        06570001
   IF RCBM04I.CUSTOMER_NUMBERF = CSRSET THEN                            06580001
   DO;                                                                  06590001
     WRK_CUSTOMER_NUMBER = RCBM04I.CUSTOMER_NUMBERI;                    06600012
                                                                        06610001
     HEADER.NEXT = '97';                                                06620001
     CALL RCBC04M_GET_RCBC05M;                                          06630002
   END;                                                                 06640001
                                                                        06650001
   RCBM04O.MSG_LINEO    = ERR_O025;                                     06660039
   RCBM04O.OU_CODE_NEWC = DFHRED;                                       06670001
   RCBM04I.OU_CODE_NEWL = -1;                                           06680001
   ERROR_FLAG = TRUE;                                                   06681076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 06690074
 END;                                                                   06700001
                                                                        06710001
 IF RCBM04I.CUSTOMER_NUMBERI = ''                                       06720011
  | RCBM04I.CUSTOMER_NUMBERI = '*'                                      06730021
  | RCBM04I.CUSTOMER_NUMBERL = 0 THEN                                   06740021
 DO;                                                                    06750021
   RCBM04O.CUSTOMER_NUMBERO = '*';                                      06760021
   WRK_CUSTOMER_NUMBER      = '*';                                      06770021
 END;                                                                   06780001
 ELSE DO;                                                               06790020
   WRK_CUSTOMER_NUMBER = RCBM04I.CUSTOMER_NUMBERI;                      06800020
   CALL RCBC04M_CHECK_T010;                                             06810020
                                                                        06810142
   IF WRK_REC_COUNT = 0 THEN                                            06811042
   DO;                                                                  06812042
     RCBM04O.MSG_LINEO        = ERR_O040;                               06813042
     RCBM04O.CUSTOMER_NUMBERC = DFHRED;                                 06814042
     RCBM04I.CUSTOMER_NUMBERL = -1;                                     06815042
     ERROR_FLAG = TRUE;                                                 06815176
     CALL RCBC04M_SEND_MAP_CSR;                      /* CEDS00000422 */ 06815274
   END;                                                                 06817042
                                                                        06818042
 END;                                                                   06820020
                                                                        06830006
 IF RCBM04I.OU_CODE_OLDI = ''                                           06840011
  | RCBM04I.OU_CODE_OLDI = '*'                                          06850019
  | RCBM04I.OU_CODE_OLDL = 0 THEN                                       06860019
 DO;                                                                    06870019
   RCBM04O.OU_CODE_OLDO = '*';                                          06880001
   WRK_OU_CODE_OLD      = '*';                                          06890001
 END;                                                                   06900001
 ELSE DO;                                                               06910014
   IF RCBM04I.OU_CODE_OLDI = 'COUNTRY' THEN                             06920020
   DO;                                                                  06930020
     OLD_OU_COUNTRY_FLAG = TRUE;                                        06940020
     WRK_OU_CODE_OLD     = '';                                          06950020
   END;                                                                 06960020
   ELSE DO;                                                             06970020
     OLD_OU_COUNTRY_FLAG = FALSE;                                       06980020
     WRK_OU_CODE_OLD     = RCBM04I.OU_CODE_OLDI;                        06990020
   END;                                                                 07000020
                                                                        07010020
   WRK_OU = WRK_OU_CODE_OLD;                                            07020019
   CALL RCBC04M_CHECK_T040;                                             07030019
                                                                        07040019
   IF T040_FND_FLAG = FALSE THEN                                        07050019
   DO;                                                                  07060019
     RCBM04O.MSG_LINEO    = ERR_O003;                                   07070039
     RCBM04O.OU_CODE_OLDC = DFHRED;                                     07080019
     RCBM04I.OU_CODE_OLDL = -1;                                         07090019
     ERROR_FLAG = TRUE;                                                 07100076
     CALL RCBC04M_SEND_MAP_CSR;                      /* CEDS00000422 */ 07101074
   END;                                                                 07110019
 END;                                                                   07120019
                                                                        07130001
 IF RCBM04I.OU_CODE_NEWI = ''                                           07140011
  | RCBM04I.OU_CODE_NEWI = '*'                                          07150019
  | RCBM04I.OU_CODE_NEWL = 0 THEN                                       07160019
 DO;                                                                    07170019
   RCBM04O.MSG_LINEO    = ERR_O065;                                     07180039
   RCBM04O.OU_CODE_NEWC = DFHRED;                                       07190010
   RCBM04I.OU_CODE_NEWL = -1;                                           07200001
   ERROR_FLAG = TRUE;                                                   07210076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 07211074
 END;                                                                   07220001
                                                                        07230020
 IF RCBM04I.OU_CODE_NEWI = 'COUNTRY' THEN                               07240020
 DO;                                                                    07250020
   NEW_OU_COUNTRY_FLAG = TRUE;                                          07260020
   WRK_OU_CODE_NEW     = '';                                            07270020
 END;                                                                   07280020
 ELSE DO;                                                               07290020
   NEW_OU_COUNTRY_FLAG = FALSE;                                         07300020
   WRK_OU_CODE_NEW     = RCBM04I.OU_CODE_NEWI;                          07310020
 END;                                                                   07320020
                                                                        07330020
 WRK_OU = WRK_OU_CODE_NEW;                                              07340020
 CALL RCBC04M_CHECK_T040;                                               07350020
                                                                        07360020
 IF T040_FND_FLAG = FALSE THEN                                          07370020
 DO;                                                                    07380020
   RCBM04O.MSG_LINEO    = ERR_O003;                                     07390039
   RCBM04O.OU_CODE_NEWC = DFHRED;                                       07400020
   RCBM04I.OU_CODE_NEWL = -1;                                           07410020
   ERROR_FLAG = TRUE;                                                   07420076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 07421074
 END;                                                                   07430020
                                                                        07440001
 IF RCBM04I.PRODUCT_TYPEI = ''                                          07450019
  | RCBM04I.PRODUCT_TYPEI = '*'                                         07460021
  | RCBM04I.PRODUCT_TYPEL = 0 THEN                                      07470021
 DO;                                                                    07480021
   RCBM04O.PRODUCT_TYPEO = '*';                                         07490021
   WRK_PRODUCT_TYPE      = '*';                                         07500021
 END;                                                                   07510021
 ELSE DO;                                                               07520021
   WRK_PRODUCT_TYPE = RCBM04I.PRODUCT_TYPEI;                            07530021
   CALL RCBC04M_CHECK_T070;                                             07540021
                                                                        07540142
   IF WRK_REC_COUNT = 0 THEN                                            07541042
   DO;                                                                  07542042
     RCBM04O.MSG_LINEO     = ERR_O063;                                  07543042
     RCBM04O.PRODUCT_TYPEC = DFHRED;                                    07544042
     RCBM04I.PRODUCT_TYPEL = -1;                                        07545042
     ERROR_FLAG = TRUE;                                                 07545176
     CALL RCBC04M_SEND_MAP_CSR;                      /* CEDS00000422 */ 07545274
   END;                                                                 07547042
 END;                                                                   07550021
                                                                        07570021
 IF RCBM04I.ORIGINL = 0 THEN                                            07580036
   RCBM04O.ORIGINO = '';                                                07590036
                                                                        07600036
 IF RCBM04I.SEQNOL = 0 THEN                                             07610036
   RCBM04O.SEQNOO = '';                                                 07620036
                                                                        07630036
 IF RCBM04I.ORIGINI = ''                                                07640036
  | RCBM04I.ORIGINI = '*' THEN                                          07650036
 DO;                                                                    07660036
   RCBM04O.ORIGINO = '*';                                               07670036
   WRK_ORIGIN      = '*';                                               07680036
 END;                                                                   07690036
 ELSE WRK_ORIGIN = RCBM04I.ORIGINI;                                     07700036
                                                                        07710036
 IF WRK_CUSTOMER_NUMBER = '*'                                           07720036
  & WRK_OU_CODE_OLD     = '*'                                           07730036
  & WRK_ORIGIN          = '*' THEN                                      07740036
 DO;                                                                    07750036
   RCBM04O.MSG_LINEO        = ERR_O039;                                 07760039
   RCBM04O.CUSTOMER_NUMBERC = DFHRED;                                   07770036
   RCBM04I.CUSTOMER_NUMBERL = -1;                                       07780036
   ERROR_FLAG = TRUE;                                                   07790076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 07791074
 END;                                                                   07800036
                                                                        07810036
 IF WRK_PRODUCT_TYPE = '*'                                              07820036
  & WRK_ORIGIN      ¬= '*' THEN                                         07830036
 DO;                                                                    07840036
   RCBM04O.MSG_LINEO = ERR_O042;                                        07850039
   RCBM04O.ORIGINC   = DFHRED;                                          07860036
   RCBM04O.SEQNOC    = DFHRED;                                          07870036
   RCBM04I.ORIGINL   = -1;                                              07880036
   ERROR_FLAG = TRUE;                                                   07890076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 07891074
 END;                                                                   07900001
                                                                        07910001
 IF WRK_PRODUCT_TYPE ¬= '*'                                             07920001
  & WRK_OU_CODE_OLD  ¬= '*'                                             07930001
  & WRK_ORIGIN       ¬= '*' THEN                                        07940036
 DO;                                                                    07950001
   RCBM04O.MSG_LINEO    = ERR_O044;                                     07960039
   RCBM04O.OU_CODE_OLDC = DFHRED;                                       07970010
   RCBM04I.OU_CODE_OLDL = -1;                                           07980001
   ERROR_FLAG = TRUE;                                                   07990076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 07991074
 END;                                                                   08000001
                                                                        08010001
 IF RCBM04I.OU_CODE_OLDI = RCBM04I.OU_CODE_NEWI THEN                    08020001
 DO;                                                                    08030001
   RCBM04O.MSG_LINEO    = ERR_O069;                                     08040039
   RCBM04O.OU_CODE_OLDC = DFHRED;                                       08050010
   RCBM04O.OU_CODE_NEWC = DFHRED;                                       08060010
   RCBM04I.OU_CODE_NEWL = -1;                                           08070001
   ERROR_FLAG = TRUE;                                                   08080076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 08081074
 END;                                                                   08090001
                                                                        08100001
 IF WRK_END_DATE_T040 < WRK_END_DATE THEN                               08110002
 DO;                                                                    08120001
   RCBM04O.MSG_LINEO = ERR_O041;                                        08130039
   RCBM04O.END_DATEC = DFHRED;                                          08140010
   RCBM04I.END_DATEL = -1;                                              08150001
   ERROR_FLAG = TRUE;                                                   08160076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 08161074
 END;                                                                   08170001
                                                                        08180001
 IF WRK_END_DATE_T040 < WRK_END_DATE THEN                               08190019
 DO;                                                                    08200019
   RCBM04O.MSG_LINEO = ERR_O041;                                        08210039
   RCBM04O.END_DATEC = DFHRED;                                          08220019
   RCBM04I.END_DATEL = -1;                                              08230019
   ERROR_FLAG = TRUE;                                                   08240076
   CALL RCBC04M_SEND_MAP_CSR;                        /* CEDS00000422 */ 08241074
 END;                                                                   08250019
                                                                        08260001
 /* IF WRK_OGSER ¬= '*' THEN    */                   /* CEDS00000422 */ 08270074
 IF WRK_ORIGIN ¬= '*' THEN                           /* CEDS00000422 */ 08271083
 DO;                                                                    08280001
   WRK_SEQUENCE_NUMBER = RCBM04I.SEQNOI;             /* CEDS00000723 */ 08280186
   CALL RCBC04M_CHECK_T125;                                 /*RB01320*/ 08281081
                                                                        08282078
   CALL RCBC04M_CHECK_T110;                                             08290001
                                                                        08300001
   IF T110_FND_FLAG = FALSE THEN                                        08310001
   DO;                                                                  08320001
     RCBM04O.MSG_LINEO     = ERR_O043;                                  08330039
     RCBM04O.PRODUCT_TYPEC = DFHRED;                                    08340010
     RCBM04I.PRODUCT_TYPEL = -1;                                        08350001
     ERROR_FLAG = TRUE;                                                 08360076
     CALL RCBC04M_SEND_MAP_CSR;                      /* CEDS00000422 */ 08361074
   END;                                                                 08370001
                                                                        08380001
   IF WRK_END_DATE_T040 < WRK_END_DATE THEN                             08390002
   DO;                                                                  08400001
     RCBM04O.MSG_LINEO = ERR_O045;                                      08410039
     RCBM04O.END_DATEC = DFHRED;                                        08420010
     RCBM04I.END_DATEL = -1;                                            08430001
     ERROR_FLAG = TRUE;                                                 08440076
     CALL RCBC04M_SEND_MAP_CSR;                      /* CEDS00000422 */ 08441074
   END;                                                                 08450001
                                                                        08451036
   IF ERROR_FLAG = TRUE THEN                                            08452036
   DO;                                                                  08453036
     CALL RCBC04M_SEND_MAP_CSR;                                         08454036
   END;                                                                 08455036
 END;                                                                   08460001
                                                                        08470001
0END RCBC04M_VALIDATE_MAP;                                              08480001
1/********************************************************************/ 08490001
 /*      PROCESS ENTER REQUEST                                       */ 08500001
 /********************************************************************/ 08510001
0RCBC04M_ENTER_PROCESS: PROC;                                           08520001
                                                                        08530001
 IF WRK_PRODUCT_TYPE = '*' THEN                                         08540001
   CALL RCBC04M_GET_RCBC07M;                                            08550002
                                                                        08560001
 IF WRK_ORIGIN        = '*'                                             08570036
  & WRK_PRODUCT_TYPE ¬= '*' THEN                                        08580001
   CALL RCBC04M_GET_RCBC06M;                                            08590002
                                                                        08600001
 RCBM04O.MSG_LINEO = ERR_O022;                                          08610039
                                                                        08620001
0END RCBC04M_ENTER_PROCESS;                                             08630001
1/********************************************************************/ 08640001
 /*      CHECK T010                                                  */ 08650001
 /********************************************************************/ 08660001
0RCBC04M_CHECK_T010: PROC;                                              08670001
                                                                        08680001
 WRK_REC_COUNT = 0;                                                     08681042
                                                                        08682042
 EXEC SQL                                                               08690001
   SELECT COUNT(*)                                                      08700001
   INTO :WRK_REC_COUNT                                                  08710001
   FROM RCBV0010_CUSTOMER                                               08720001
   WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          08730046
     AND CUSTOMER_NUMBER = :WRK_CUSTOMER_NUMBER                         08740006
     AND EFFECTIVE_DATE <= :WRK_EFFECTIVE_DATE                          08750006
     AND END_DATE       >= :WRK_END_DATE;                               08760006
                                                                        08770001
0END RCBC04M_CHECK_T010;                                                08860001
1/********************************************************************/ 08870001
 /*      CHECK T040                                                  */ 08880001
 /********************************************************************/ 08890001
0RCBC04M_CHECK_T040: PROC;                                              08900001
                                                                        08910001
 T040_FND_FLAG = FALSE;                                                 08920001
                                                                        08930001
 EXEC SQL                                                               08940001
   SELECT END_DATE                                                      08950001
   INTO :WRK_END_DATE_T040                                              08960002
   FROM RCBV0040_OU                                                     08970001
   WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          08980046
     AND OU_CODE         = :WRK_OU                                      08990001
     AND EFFECTIVE_DATE <= :WRK_EFFECTIVE_DATE                          09000006
     AND END_DATE       >= :WRK_END_DATE;                               09010006
                                                                        09020001
 SELECT (SQLCA.SQLCODE);                                                09030001
   WHEN(0)                                                              09040001
     T040_FND_FLAG = TRUE;                                              09050001
                                                                        09060001
   WHEN(100);                                                           09070001
                                                                        09070162
   WHEN(-180)                                                           09071063
     DO;                                                                09072062
       RCBM04O.MSG_LINEO       = ERR_O002;                              09081062
       RCBM04O.EFFECTIVE_DATEC = DFHRED;                                09082062
       RCBM04O.END_DATEC       = DFHRED;                                09082162
       RCBM04I.EFFECTIVE_DATEL = -1;                                    09083062
       CALL RCBC04M_SEND_MAP_CSR;                                       09084062
     END;                                                               09085062
                                                                        09086062
   WHEN(-181)                                   /*SOC CEDS00000417 */   09087068
     DO;                                                                09088067
       RCBM04O.MSG_LINEO       = ERR_O002;                              09089067
       RCBM04O.EFFECTIVE_DATEC = DFHRED;                                09089167
       RCBM04O.END_DATEC       = DFHRED;                                09089267
       CALL RCBC04M_SEND_MAP_CSR;                                       09089467
     END;                                       /*EOC CEDS00000417 */   09089568
                                                                        09089667
   OTHERWISE                                                            09090001
     DO;                                                                09100001
       RCBM04O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                09110001
                         || ' OCCURED ON RCBT0040';                     09120001
       CALL RCBC04M_SEND_MAP;                                           09130062
     END;                                                               09140001
 END;                                                                   09150001
                                                                        09160001
0END RCBC04M_CHECK_T040;                                                09170001
1/********************************************************************/ 09180001
 /*      CHECK T070                                                  */ 09190001
 /********************************************************************/ 09200001
0RCBC04M_CHECK_T070: PROC;                                              09210001
                                                                        09220001
 WRK_REC_COUNT = 0;                                                     09221042
                                                                        09222042
 EXEC SQL                                                               09230001
   SELECT COUNT(*)                                                      09240001
   INTO :WRK_REC_COUNT                                                  09250001
   FROM RCBV0070_HW_PO                                                  09260001
   WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          09270046
     AND PRODUCT_TYPE    = :WRK_PRODUCT_TYPE;                           09280031
                                                                        09290001
0END RCBC04M_CHECK_T070;                                                09380001
1/********************************************************************/ 09390001
 /*      CHECK T110                                                  */ 09400001
 /********************************************************************/ 09410001
0RCBC04M_CHECK_T110: PROC;                                              09420001
                                                                        09430001
 T110_FND_FLAG = FALSE;                                                 09440001
 IF T125_FND_FLAG = FALSE THEN                              /*RB01320*/ 09441081
 WRK_SEQUENCE_NUMBER = RCBM04I.SEQNOI;                                  09450036
 RCB110S.END_DATE = '';                                                 09460002
                                                                        09470001
 EXEC SQL                                                               09480001
   SELECT END_DATE                                                      09490001
   INTO :RCB110S.END_DATE                                               09500001
   FROM RCBV0110_HW_STATUS                                              09510001
   WHERE COUNTRY_NUMBER  = :WRK_COUNTRY_NUMBER                          09520046
     AND PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                            09530006
     AND ORIGIN          = :WRK_ORIGIN                                  09540002
     AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER                         09550001
     AND (STATUS         = '3'                                          09560001
      OR  STATUS         = '4')                                         09570001
     AND EFFECTIVE_DATE <= :WRK_EFFECTIVE_DATE                          09580006
     AND END_DATE       >= :WRK_END_DATE;                               09590006
                                                                        09600001
 SELECT (SQLCA.SQLCODE);                                                09610001
   WHEN(0)                                                              09620001
     T110_FND_FLAG = TRUE;                                              09630001
                                                                        09640001
   WHEN(100);                                                           09650001
                                                                        09660001
   OTHERWISE                                                            09670001
     DO;                                                                09680001
       RCBM04O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                09690002
                         || ' OCCURED ON RCBT0110';                     09700003
       CALL RCBC04M_SEND_MAP_CSR;                                       09710033
     END;                                                               09720001
 END;                                                                   09730001
                                                                        09740001
0END RCBC04M_CHECK_T110;                                                09750001
1/********************************************************************/ 09751078
 /*      CHECK T125                       RB01320                    */ 09752081
 /********************************************************************/ 09753078
0RCBC04M_CHECK_T125: PROC;                                              09754078
                                                                        09755078
 T125_FND_FLAG = FALSE;                                                 09756078
                                                                        09756178
 EXEC SQL                                                               09757078
   SELECT REAL_SERIAL_NUMBER                                            09758078
   INTO :RCB125S.REAL_SERIAL_NUMBER                                     09759078
   FROM RCBV0125_DMMY_REAL                                              09759180
   WHERE COUNTRY_NUMBER     = :WRK_COUNTRY_NUMBER                       09759278
     AND PRODUCT_TYPE       = :WRK_PRODUCT_TYPE                         09759378
     AND DUMMY_ORIGIN       = :WRK_ORIGIN                               09759478
     AND DUMMY_SEQUENCE_NUM = :WRK_SEQUENCE_NUMBER;                     09759578
                                                                        09760078
 SELECT (SQLCA.SQLCODE);                                                09760178
   WHEN(0)                                                              09760278
   DO;                                                                  09760378
     T125_FND_FLAG = TRUE;                                              09760478
     DUMMY_ORIGIN        = WRK_ORIGIN;                                  09760579
     DUMMY_SEQUENCE      = WRK_SEQUENCE_NUMBER;                         09760679
     WRK_ORIGIN          = SUBSTR(RCB125S.REAL_SERIAL_NUMBER,1,2);      09760878
     WRK_SEQUENCE_NUMBER = SUBSTR(RCB125S.REAL_SERIAL_NUMBER,3,28);     09760978
   END;                                                                 09761078
   WHEN(100)                                                            09761178
     T125_FND_FLAG = FALSE;                                             09761278
   OTHERWISE                                                            09761378
     DO;                                                                09761478
       RCBM04O.MSG_LINEO = 'SQL ERROR ' || SQLCA.SQLCODE                09761578
                         || ' OCCURED ON RCBT0125';                     09761678
       CALL RCBC04M_SEND_MAP_CSR;                                       09761778
     END;                                                               09761878
 END;                                                                   09761978
                                                                        09762078
0END RCBC04M_CHECK_T125;                                                09762178
1/********************************************************************/ 09763001
 /*      REALLOCATE OUS                                              */ 09770001
 /********************************************************************/ 09780001
0RCBC04M_UPDATE_PROCESS: PROC;                                          09790001
                                                                        09800001
 PF5_FLAG = FALSE;                                                      09810002
 IF  T125_FND_FLAG = FALSE THEN                             /*RB01320*/ 09811081
 WRK_SEQUENCE_NUMBER = RCBM04I.SEQNOI;                                  09820036
 RCBM04O.MSG_LINEO = ERR_O070;                                          09830039
                                                                        09840002
 IF WRK_OU_CODE_OLD     ¬= '*'                                          09850002
  & WRK_CUSTOMER_NUMBER ¬= '*'                                          09860002
  & WRK_PRODUCT_TYPE    ¬= '*' THEN                                     09870002
 DO;                                                                    09880001
   CALL RCBC04M_CURSOR_A;                                               09890002
   CALL RCBC04M_SEND_MAP;                                               09900002
 END;                                                                   09910001
                                                                        09920001
 IF WRK_OU_CODE_OLD     ¬= '*'                                          09930002
  & WRK_CUSTOMER_NUMBER ¬= '*'                                          09940002
  & WRK_PRODUCT_TYPE     = '*' THEN                                     09950002
 DO;                                                                    09960002
   CALL RCBC04M_CURSOR_B;                                               09970002
   CALL RCBC04M_SEND_MAP;                                               09980002
 END;                                                                   09990002
                                                                        10000002
 IF WRK_OU_CODE_OLD     ¬= '*'                                          10010002
  & WRK_CUSTOMER_NUMBER  = '*'                                          10020002
  & WRK_PRODUCT_TYPE    ¬= '*' THEN                                     10030002
 DO;                                                                    10040002
   CALL RCBC04M_CURSOR_C;                                               10050002
   CALL RCBC04M_SEND_MAP;                                               10060002
 END;                                                                   10070002
                                                                        10080002
 IF WRK_OU_CODE_OLD     ¬= '*'                                          10090002
  & WRK_CUSTOMER_NUMBER  = '*'                                          10100002
  & WRK_PRODUCT_TYPE     = '*' THEN                                     10110002
 DO;                                                                    10120002
   CALL RCBC04M_CURSOR_D;                                               10130002
   CALL RCBC04M_SEND_MAP;                                               10140002
 END;                                                                   10150002
                                                                        10160002
 IF WRK_OU_CODE_OLD       = '*'                                         10170002
  & WRK_CUSTOMER_NUMBER  ¬= '*'                                         10180002
  & WRK_PRODUCT_TYPE     ¬= '*'                                         10190002
  & (WRK_SEQUENCE_NUMBER  = '*'                                         10200002
   | WRK_SEQUENCE_NUMBER  = '') THEN                                    10210002
 DO;                                                                    10220002
   CALL RCBC04M_CURSOR_E;                                               10230002
   CALL RCBC04M_SEND_MAP;                                               10240002
 END;                                                                   10250002
                                                                        10260002
 IF WRK_OU_CODE_OLD       = '*'                                         10270002
  & WRK_CUSTOMER_NUMBER  ¬= '*'                                         10280002
  & WRK_PRODUCT_TYPE      = '*'                                         10290002
  & (WRK_SEQUENCE_NUMBER  = '*'                                         10300002
   | WRK_SEQUENCE_NUMBER  = '') THEN                                    10310002
 DO;                                                                    10320002
   CALL RCBC04M_CURSOR_F;                                               10330002
   CALL RCBC04M_SEND_MAP;                                               10340002
 END;                                                                   10350002
                                                                        10360002
 IF WRK_OU_CODE_OLD      = '*'                                          10370002
  & WRK_CUSTOMER_NUMBER ¬= '*'                                          10380002
  & WRK_ORIGIN          ¬= '*' THEN                                     10390036
 DO;                                                                    10400002
   CALL RCBC04M_CURSOR_G;                                               10410002
   CALL RCBC04M_SEND_MAP;                                               10420002
 END;                                                                   10430002
                                                                        10440002
 IF WRK_OU_CODE_OLD      = '*'                                          10450002
  & WRK_CUSTOMER_NUMBER  = '*'                                          10460002
  & WRK_ORIGIN          ¬= '*' THEN                                     10470036
 DO;                                                                    10480002
   CALL RCBC04M_CURSOR_H;                                               10490002
   CALL RCBC04M_SEND_MAP;                                               10500002
 END;                                                                   10510002
                                                                        10520002
                                                                        10530001
 END RCBC04M_UPDATE_PROCESS;                                            10540001
1/********************************************************************/ 10550001
 /*      CREATE T560 RECORD                                          */ 10560001
 /********************************************************************/ 10570001
0RCBC04M_UPD_T560: PROC;                                                10580001
                                                                        10590030
 /*DCL WRK_TIME_IN  CHAR(26) INIT('');           /* CEDS00000361      */10600066
                                                                        10610030
 EXEC SQL SET :WRK_TIME_IN = CURRENT TIMESTAMP;                         10620030
                                                                        10630030
 WRKMAP_DATA = ' ';                                                     10640001
 WRKMAP.OU_CODE_NEW          = WRK_OU_CODE_NEW;                         10650001
 WRKMAP.EFFECTIVE_DATE       = WRK_EFFECTIVE_DATE;                      10660001
 WRKMAP.END_DATE             = WRK_END_DATE;                            10670001
 WRKMAP.OU_CODE_OLD          = WRK_OU_CODE_OLD;                         10680012
 WRKMAP.CUSTOMER_NUMBER      = WRK_CUSTOMER_NUMBER;                     10690001
 WRKMAP.PRODUCT_TYPE         = WRK_PRODUCT_TYPE;                        10700001
 WRKMAP.ORIGIN               = WRK_ORIGIN;                              10710001
 WRKMAP.SEQUENCE_NUMBER      = WRK_SEQUENCE_NUMBER;                     10720001
                                                                        10730001
 RCB560S                 = ' ';                                         10740001
 RCB560S.COUNTRY_NUMBER  = WRK_COUNTRY_NUMBER;                          10750046
 RCB560S.TXN_CODE        = 'RCBTXN04';                                  10760001
 RCB560S.TIMESTAMP       = WRK_TIME_IN;                                 10770030
 RCB560S.USERID          = HEADER.USERID;                               10780001
 RCB560S.ACTION          = '2';                                         10790001
 RCB560S.DATA            = WRKMAP_DATA;                                 10800001
                                                                        10810001
 EXEC SQL                                                               10820001
      INSERT INTO RCBV0560_XACTION                                      10830001
      (COUNTRY_NUMBER,                                                  10840001
       TXN_CODE,                                                        10850001
       TIMESTAMP,                                                       10860001
       USERID,                                                          10870001
       ACTION,                                                          10880001
       DATA)                                                            10890001
        VALUES (:RCB560S:RCB560SI.INDNULL);                             10900001
                                                                        10910001
 SELECT(SQLCA.SQLCODE);                                                 10920001
   WHEN(0)                                                              10930002
   DO;                                                                  10940002
     RCBM04O.MSG_LINEO = ERR_O026;                                      10950039
   END;                                                                 10960002
   OTHERWISE                                                            10970001
   DO;                                                                  10980001
     RET_CODE = SQLCA.SQLCODE;                                          10990001
     SUB_CODE = SQLCA.SQLCABC;                                          11000001
     PIC_EXPLAIN = SQLCA.SQLCODE;                                       11010001
     RCBM04O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBT0560 INSERT = '       11020001
                         || PIC_EXPLAIN;                                11030001
     CALL RCBC04M_SEND_MAP;                                             11040036
   END;                                                                 11050001
 END;                                                                   11060001
                                                                        11070001
0END RCBC04M_UPD_T560;                                                  11080001
1/********************************************************************/ 11090001
 /*      GET EFFECTIVE OU LIST FROM RCBM02                           */ 11100001
 /********************************************************************/ 11110001
0RCBC04M_GET_RCBC02M: PROC;                                             11120002
                                                                        11130001
 HEADER.NEXT = '98';                                                    11140001
 REQUEST_ID  = '4';                                                     11150010
                                                                        11160001
0EXEC CICS XCTL                                                         11170001
     PROGRAM('RCBC02P')                                                 11180001
     COMMAREA(COMMAREA)                                                 11190001
     LENGTH(CSTG(COMMAREA))                                             11200001
     RESP(RESPONSE)                                                     11210001
     RESP2(CODE_EXPLAIN);                                               11220001
                                                                        11230001
  SELECT(RESPONSE);                       /* CHECK RESPONSE           */11240001
     WHEN(DFHRESP(NORMAL));                                             11250001
     WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */11260001
     DO;                                                                11270001
       COMMAREA_LENGTH = EIBCALEN;                                      11280001
       EXEC CICS RETURN                                                 11290001
          TRANSID('RC04')                                               11300001
          COMMAREA(COMMAREA)                                            11310001
          LENGTH(COMMAREA_LENGTH);                                      11320001
     END;                                                               11330001
     OTHERWISE                                                          11340001
     DO;                                                                11350001
       PIC_EXPLAIN = RESPONSE;                                          11360001
       SUB_CODE = PIC_EXPLAIN;                                          11370001
       PIC_EXPLAIN = CODE_EXPLAIN;                                      11380001
       RET_CODE = PIC_EXPLAIN;                                          11390001
       RCBM04O.MSG_LINEO = ERR_MESSAGE13                                11400001
                         || ' ' || SUB_CODE || ' ' || RET_CODE;         11410001
       CALL RCBC04M_SEND_MAP;                                           11420036
     END;                                                               11430001
   END;                                                                 11440001
                                                                        11450001
0END RCBC04M_GET_RCBC02M;                                               11460002
1/********************************************************************/ 11470001
 /*      GET LIST OF CUSTOMERS FROM RCBM05                           */ 11480001
 /********************************************************************/ 11490001
0RCBC04M_GET_RCBC05M: PROC;                                             11500002
                                                                        11510001
 HEADER.NEXT = '97';                                                    11520001
 REQUEST_ID  = '4';                                                     11530010
                                                                        11540001
0EXEC CICS XCTL                                                         11550001
     PROGRAM('RCBC05P')                                                 11560001
     COMMAREA(COMMAREA)                                                 11570001
     LENGTH(CSTG(COMMAREA))                                             11580001
     RESP(RESPONSE)                                                     11590001
     RESP2(CODE_EXPLAIN);                                               11600001
                                                                        11610001
  SELECT(RESPONSE);                       /* CHECK RESPONSE           */11620001
     WHEN(DFHRESP(NORMAL));                                             11630001
     WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */11640001
     DO;                                                                11650001
       COMMAREA_LENGTH = EIBCALEN;                                      11660001
       EXEC CICS RETURN                                                 11670001
          TRANSID('RC04')                                               11680001
          COMMAREA(COMMAREA)                                            11690001
          LENGTH(COMMAREA_LENGTH);                                      11700001
     END;                                                               11710001
     OTHERWISE                                                          11720001
     DO;                                                                11730001
       PIC_EXPLAIN = RESPONSE;                                          11740001
       SUB_CODE = PIC_EXPLAIN;                                          11750001
       PIC_EXPLAIN = CODE_EXPLAIN;                                      11760001
       RET_CODE = PIC_EXPLAIN;                                          11770001
       RCBM04O.MSG_LINEO = ERR_MESSAGE13                                11780001
                         || ' ' || SUB_CODE || ' ' || RET_CODE;         11790001
       CALL RCBC04M_SEND_MAP;                                           11800036
     END;                                                               11810001
   END;                                                                 11820001
                                                                        11830001
0END RCBC04M_GET_RCBC05M;                                               11840002
1/********************************************************************/ 11850001
 /*      GET MACHINES BY TYPE FROM RCBM06                            */ 11860001
 /********************************************************************/ 11870001
0RCBC04M_GET_RCBC06M: PROC;                                             11880002
                                                                        11890001
 HEADER.NEXT = '96';                                                    11900001
 REQUEST_ID  = '4';                                                     11910010
                                                                        11920001
0EXEC CICS XCTL                                                         11930001
     PROGRAM('RCBC06P')                                                 11940001
     COMMAREA(COMMAREA)                                                 11950001
     LENGTH(CSTG(COMMAREA))                                             11960001
     RESP(RESPONSE)                                                     11970001
     RESP2(CODE_EXPLAIN);                                               11980001
                                                                        11990001
  SELECT(RESPONSE);                       /* CHECK RESPONSE           */12000001
     WHEN(DFHRESP(NORMAL));                                             12010001
     WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */12020001
     DO;                                                                12030001
       COMMAREA_LENGTH = EIBCALEN;                                      12040001
       EXEC CICS RETURN                                                 12050001
          TRANSID('RC04')                                               12060001
          COMMAREA(COMMAREA)                                            12070001
          LENGTH(COMMAREA_LENGTH);                                      12080001
     END;                                                               12090001
     OTHERWISE                                                          12100001
     DO;                                                                12110001
       PIC_EXPLAIN = RESPONSE;                                          12120001
       SUB_CODE = PIC_EXPLAIN;                                          12130001
       PIC_EXPLAIN = CODE_EXPLAIN;                                      12140001
       RET_CODE = PIC_EXPLAIN;                                          12150001
       RCBM04O.MSG_LINEO = ERR_MESSAGE13                                12160001
                         || ' ' || SUB_CODE || ' ' || RET_CODE;         12170001
       CALL RCBC04M_SEND_MAP;                                           12180036
     END;                                                               12190001
   END;                                                                 12200001
                                                                        12210001
0END RCBC04M_GET_RCBC06M;                                               12220002
1/********************************************************************/ 12230001
 /*      GET SELECTED MACHINES LIST FROM RCBM07                      */ 12240001
 /********************************************************************/ 12250001
0RCBC04M_GET_RCBC07M: PROC;                                             12260002
                                                                        12270001
 HEADER.NEXT = '95';                                                    12280001
 REQUEST_ID  = '4';                                                     12290010
                                                                        12300001
0EXEC CICS XCTL                                                         12310001
     PROGRAM('RCBC07P')                                                 12320001
     COMMAREA(COMMAREA)                                                 12330001
     LENGTH(CSTG(COMMAREA))                                             12340001
     RESP(RESPONSE)                                                     12350001
     RESP2(CODE_EXPLAIN);                                               12360001
                                                                        12370001
  SELECT(RESPONSE);                       /* CHECK RESPONSE           */12380001
     WHEN(DFHRESP(NORMAL));                                             12390001
     WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */12400001
     DO;                                                                12410001
       COMMAREA_LENGTH = EIBCALEN;                                      12420001
       EXEC CICS RETURN                                                 12430001
          TRANSID('RC04')                                               12440001
          COMMAREA(COMMAREA)                                            12450001
          LENGTH(COMMAREA_LENGTH);                                      12460001
     END;                                                               12470001
     OTHERWISE                                                          12480001
     DO;                                                                12490001
       PIC_EXPLAIN = RESPONSE;                                          12500001
       SUB_CODE = PIC_EXPLAIN;                                          12510001
       PIC_EXPLAIN = CODE_EXPLAIN;                                      12520001
       RET_CODE = PIC_EXPLAIN;                                          12530001
       RCBM04O.MSG_LINEO = ERR_MESSAGE13                                12540001
                         || ' ' || SUB_CODE || ' ' || RET_CODE;         12550001
       CALL RCBC04M_SEND_MAP;                                           12560036
     END;                                                               12570001
   END;                                                                 12580001
                                                                        12590001
0END RCBC04M_GET_RCBC07M;                                               12600002
1/********************************************************************/ 12610001
 /*      CASE A CURSOR PROCESSING                                    */ 12620002
 /********************************************************************/ 12630001
0RCBC04M_CURSOR_A: PROC;                                                12640002
                                                                        12650002
 OK_FLAG = TRUE;                                                        12660002
 EXEC SQL  OPEN CSR_A;                                                  12670002
                                                                        12680015
 SELECT(SQLCA.SQLCODE);                                                 12690015
   WHEN(0);                                                             12700015
   OTHERWISE                                                            12710015
   DO;                                                                  12720015
     RCBM04O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   12730015
     CALL RCBC04M_SEND_MAP_CSR;                                         12740033
   END;                                                                 12750015
 END;                                                                   12760015
                                                                        12770002
 DO WHILE (OK_FLAG = TRUE);                                             12780002
   EXEC SQL  FETCH CSR_A                                                12790002
             INTO :RCB170S.ORIGIN                                       12800002
                 ,:RCB170S.SEQUENCE_NUMBER                              12810002
                 ,:RCB170S.EFFECTIVE_DATE                               12820002
                 ,:RCB170S.END_DATE                                     12830002
                 ,:RCB190S.EFFECTIVE_DATE                               12840002
                 ,:RCB190S.END_DATE;                                    12850002
                                                                        12860002
   IF SQLCA.SQLCODE = 0 THEN                                            12870002
   DO;                                                                  12880002
     RCB170S.PRODUCT_TYPE = WRK_PRODUCT_TYPE;                           12890002
     CALL RCBC04M_CHECK_T110;                                           12900002
                                                                        12910002
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        12920002
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             12930002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 12940002
     IF WRK_EFFECTIVE_DATE_OU < RCB190S.EFFECTIVE_DATE THEN             12950002
        WRK_EFFECTIVE_DATE_OU = RCB190S.EFFECTIVE_DATE;                 12960002
                                                                        12970002
     WRK_END_DATE_OU = WRK_END_DATE;                                    12980002
     IF T110_FND_FLAG = TRUE THEN                                       12990015
     DO;                                                                13000015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       13010015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           13020015
     END;                                                               13030015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         13040015
        WRK_END_DATE_OU = RCB170S.END_DATE;                             13050015
     IF WRK_END_DATE_OU > RCB190S.END_DATE THEN                         13060015
        WRK_END_DATE_OU = RCB190S.END_DATE;                             13070015
                                                                        13080015
     CALL RCBC04M_UPDATE_OU;                                            13090015
                                                                        13100015
   END;                                                                 13110015
                                                                        13120015
   IF SQLCA.SQLCODE ¬= 0 THEN                                           13130015
   DO;                                                                  13140015
     OK_FLAG = FALSE;                                                   13150015
   END;                                                                 13160015
 END;                                                                   13170015
                                                                        13180015
0END RCBC04M_CURSOR_A;                                                  13190015
1/********************************************************************/ 13200015
 /*      CASE B CURSOR PROCESSING                                    */ 13210015
 /********************************************************************/ 13220015
0RCBC04M_CURSOR_B: PROC;                                                13230015
                                                                        13240015
 OK_FLAG = TRUE;                                                        13250015
 EXEC SQL  OPEN CSR_B;                                                  13260015
                                                                        13270015
 SELECT(SQLCA.SQLCODE);                                                 13280015
   WHEN(0);                                                             13290015
   OTHERWISE                                                            13300015
   DO;                                                                  13310015
     RCBM04O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   13320015
     CALL RCBC04M_SEND_MAP;                                             13330036
   END;                                                                 13340015
 END;                                                                   13350015
                                                                        13360015
 DO WHILE (OK_FLAG = TRUE);                                             13370015
   EXEC SQL  FETCH CSR_B                                                13380015
             INTO :RCB170S.PRODUCT_TYPE                                 13390015
                 ,:RCB170S.ORIGIN                                       13400015
                 ,:RCB170S.SEQUENCE_NUMBER                              13410015
                 ,:RCB170S.EFFECTIVE_DATE                               13420015
                 ,:RCB170S.END_DATE                                     13430015
                 ,:RCB190S.EFFECTIVE_DATE                               13440015
                 ,:RCB190S.END_DATE;                                    13450015
                                                                        13460015
   IF SQLCA.SQLCODE = 0 THEN                                            13470015
   DO;                                                                  13480015
     CALL RCBC04M_CHECK_T110;                                           13490015
                                                                        13500015
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        13510015
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             13520002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 13530002
     IF WRK_EFFECTIVE_DATE_OU < RCB190S.EFFECTIVE_DATE THEN             13540002
        WRK_EFFECTIVE_DATE_OU = RCB190S.EFFECTIVE_DATE;                 13550002
                                                                        13560002
     WRK_END_DATE_OU = WRK_END_DATE;                                    13570002
     IF T110_FND_FLAG = TRUE THEN                                       13580015
     DO;                                                                13590015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       13600015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           13610015
     END;                                                               13620015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         13630002
        WRK_END_DATE_OU = RCB170S.END_DATE;                             13640002
     IF WRK_END_DATE_OU > RCB190S.END_DATE THEN                         13650002
        WRK_END_DATE_OU = RCB190S.END_DATE;                             13660002
                                                                        13670002
     CALL RCBC04M_UPDATE_OU;                                            13680002
                                                                        13690002
   END;                                                                 13700002
                                                                        13710002
   IF SQLCA.SQLCODE ¬= 0 THEN                                           13720002
   DO;                                                                  13730002
     OK_FLAG = FALSE;                                                   13740002
   END;                                                                 13750002
 END;                                                                   13760002
                                                                        13770002
0END RCBC04M_CURSOR_B;                                                  13780002
1/********************************************************************/ 13790002
 /*      CASE C CURSOR PROCESSING                                    */ 13800002
 /********************************************************************/ 13810002
0RCBC04M_CURSOR_C: PROC;                                                13820002
                                                                        13830002
 OK_FLAG = TRUE;                                                        13840002
 EXEC SQL  OPEN CSR_C;                                                  13850002
                                                                        13860015
 SELECT(SQLCA.SQLCODE);                                                 13870015
   WHEN(0);                                                             13880015
   OTHERWISE                                                            13890015
   DO;                                                                  13900015
     RCBM04O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   13910015
     CALL RCBC04M_SEND_MAP;                                             13920036
   END;                                                                 13930015
 END;                                                                   13940015
                                                                        13950002
 DO WHILE (OK_FLAG = TRUE);                                             13960002
   EXEC SQL  FETCH CSR_C                                                13970002
             INTO :RCB170S.ORIGIN                                       13980002
                 ,:RCB170S.SEQUENCE_NUMBER                              13990002
                 ,:RCB170S.EFFECTIVE_DATE                               14000002
                 ,:RCB170S.END_DATE;                                    14010002
                                                                        14020002
   IF SQLCA.SQLCODE = 0 THEN                                            14030002
   DO;                                                                  14040002
     RCB170S.PRODUCT_TYPE = WRK_PRODUCT_TYPE;                           14050002
     CALL RCBC04M_CHECK_T110;                                           14060002
                                                                        14070002
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        14080002
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             14090002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 14100002
                                                                        14110002
     WRK_END_DATE_OU = WRK_END_DATE;                                    14120002
     IF T110_FND_FLAG = TRUE THEN                                       14130015
     DO;                                                                14140015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       14150015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           14160015
     END;                                                               14170015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         14180002
        WRK_END_DATE_OU = RCB170S.END_DATE;                             14190002
                                                                        14200002
     CALL RCBC04M_UPDATE_OU;                                            14210002
                                                                        14220002
   END;                                                                 14230002
                                                                        14240002
   IF SQLCA.SQLCODE ¬= 0 THEN                                           14250002
   DO;                                                                  14260002
     OK_FLAG = FALSE;                                                   14270002
   END;                                                                 14280002
 END;                                                                   14290002
                                                                        14300002
0END RCBC04M_CURSOR_C;                                                  14310002
1/********************************************************************/ 14320002
 /*      CASE D CURSOR PROCESSING                                    */ 14330002
 /********************************************************************/ 14340002
0RCBC04M_CURSOR_D: PROC;                                                14350002
                                                                        14360002
 OK_FLAG = TRUE;                                                        14370002
 EXEC SQL  OPEN CSR_D;                                                  14380002
                                                                        14390015
 SELECT(SQLCA.SQLCODE);                                                 14400015
   WHEN(0);                                                             14410015
   OTHERWISE                                                            14420015
   DO;                                                                  14430015
     RCBM04O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   14440015
     CALL RCBC04M_SEND_MAP;                                             14450036
   END;                                                                 14460015
 END;                                                                   14470015
                                                                        14480002
 DO WHILE (OK_FLAG = TRUE);                                             14490002
   EXEC SQL  FETCH CSR_D                                                14500002
             INTO :RCB170S.PRODUCT_TYPE                                 14510002
                 ,:RCB170S.ORIGIN                                       14520002
                 ,:RCB170S.SEQUENCE_NUMBER                              14530002
                 ,:RCB170S.EFFECTIVE_DATE                               14540002
                 ,:RCB170S.END_DATE;                                    14550002
                                                                        14560002
   IF SQLCA.SQLCODE = 0 THEN                                            14570002
   DO;                                                                  14580002
     CALL RCBC04M_CHECK_T110;                                           14590002
                                                                        14600002
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        14610002
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             14620002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 14630002
                                                                        14640002
     WRK_END_DATE_OU = WRK_END_DATE;                                    14650002
     IF T110_FND_FLAG = TRUE THEN                                       14660015
     DO;                                                                14670015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       14680015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           14690015
     END;                                                               14700015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         14710002
        WRK_END_DATE_OU = RCB170S.END_DATE;                             14720002
                                                                        14730002
     CALL RCBC04M_UPDATE_OU;                                            14740002
                                                                        14750002
   END;                                                                 14760002
                                                                        14770002
   IF SQLCA.SQLCODE ¬= 0 THEN                                           14780002
   DO;                                                                  14790002
     OK_FLAG = FALSE;                                                   14800002
   END;                                                                 14810002
 END;                                                                   14820002
                                                                        14830002
0END RCBC04M_CURSOR_D;                                                  14840002
1/********************************************************************/ 14850002
 /*      CASE E CURSOR PROCESSING                                    */ 14860002
 /********************************************************************/ 14870002
0RCBC04M_CURSOR_E: PROC;                                                14880002
                                                                        14890002
 OK_FLAG = TRUE;                                                        14900002
 EXEC SQL  OPEN CSR_E;                                                  14910002
                                                                        14920015
 SELECT(SQLCA.SQLCODE);                                                 14930015
   WHEN(0);                                                             14940015
   OTHERWISE                                                            14950015
   DO;                                                                  14960015
     RCBM04O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   14970015
     CALL RCBC04M_SEND_MAP;                                             14980036
   END;                                                                 14990015
 END;                                                                   15000015
                                                                        15010002
 DO WHILE (OK_FLAG = TRUE);                                             15020002
   EXEC SQL  FETCH CSR_E                                                15030002
             INTO :RCB170S.ORIGIN                                       15040002
                 ,:RCB170S.SEQUENCE_NUMBER                              15050002
                 ,:RCB170S.EFFECTIVE_DATE                               15060002
                 ,:RCB170S.END_DATE;                                    15070002
                                                                        15080002
   IF SQLCA.SQLCODE = 0 THEN                                            15090002
   DO;                                                                  15100002
     RCB170S.PRODUCT_TYPE = WRK_PRODUCT_TYPE;                           15110002
     CALL RCBC04M_CHECK_T110;                                           15120002
                                                                        15130002
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        15140002
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             15150002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 15160002
                                                                        15170002
     WRK_END_DATE_OU = WRK_END_DATE;                                    15180002
     IF T110_FND_FLAG = TRUE THEN                                       15190015
     DO;                                                                15200015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       15210015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           15220015
     END;                                                               15230015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         15240002
        WRK_END_DATE_OU = RCB170S.END_DATE;                             15250002
                                                                        15260002
     CALL RCBC04M_UPDATE_OU;                                            15270002
                                                                        15280002
   END;                                                                 15290002
                                                                        15300002
   IF SQLCA.SQLCODE ¬= 0 THEN                                           15310002
   DO;                                                                  15320002
     OK_FLAG = FALSE;                                                   15330002
   END;                                                                 15340002
 END;                                                                   15350002
                                                                        15360002
0END RCBC04M_CURSOR_E;                                                  15370002
1/********************************************************************/ 15380002
 /*      CASE F CURSOR PROCESSING                                    */ 15390002
 /********************************************************************/ 15400002
0RCBC04M_CURSOR_F: PROC;                                                15410002
                                                                        15420002
 OK_FLAG = TRUE;                                                        15430002
 EXEC SQL  OPEN CSR_F;                                                  15440002
                                                                        15450015
 SELECT(SQLCA.SQLCODE);                                                 15460015
   WHEN(0);                                                             15470015
   OTHERWISE                                                            15480015
   DO;                                                                  15490015
     RCBM04O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   15500015
     CALL RCBC04M_SEND_MAP;                                             15510036
   END;                                                                 15520015
 END;                                                                   15530015
                                                                        15540002
 DO WHILE (OK_FLAG = TRUE);                                             15550002
   EXEC SQL  FETCH CSR_F                                                15560002
             INTO :RCB170S.PRODUCT_TYPE                                 15570002
                 ,:RCB170S.ORIGIN                                       15580002
                 ,:RCB170S.SEQUENCE_NUMBER                              15590002
                 ,:RCB170S.EFFECTIVE_DATE                               15600002
                 ,:RCB170S.END_DATE;                                    15610002
                                                                        15620002
   IF SQLCA.SQLCODE = 0 THEN                                            15630002
   DO;                                                                  15640002
     CALL RCBC04M_CHECK_T110;                                           15650002
                                                                        15660002
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        15670002
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             15680002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 15690002
                                                                        15700002
     WRK_END_DATE_OU = WRK_END_DATE;                                    15710002
     IF T110_FND_FLAG = TRUE THEN                                       15720015
     DO;                                                                15730015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       15740015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           15750015
     END;                                                               15760015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         15770002
        WRK_END_DATE_OU = RCB170S.END_DATE;                             15780002
                                                                        15790002
     CALL RCBC04M_UPDATE_OU;                                            15800002
                                                                        15810002
   END;                                                                 15820002
                                                                        15830002
   IF SQLCA.SQLCODE ¬= 0 THEN                                           15840002
   DO;                                                                  15850002
     OK_FLAG = FALSE;                                                   15860002
   END;                                                                 15870002
 END;                                                                   15880002
                                                                        15890002
0END RCBC04M_CURSOR_F;                                                  15900002
1/********************************************************************/ 15910002
 /*      CASE G CURSOR PROCESSING                                    */ 15920002
 /********************************************************************/ 15930002
0RCBC04M_CURSOR_G: PROC;                                                15940002
                                                                        15950002
 OK_FLAG = TRUE;                                                        15960002
 EXEC SQL  OPEN CSR_G;                                                  15970002
                                                                        15980015
 SELECT(SQLCA.SQLCODE);                                                 15990015
   WHEN(0);                                                             16000015
   OTHERWISE                                                            16010015
   DO;                                                                  16020015
     RCBM04O.MSG_LINEO = 'DB2 ERROR ' || SQLCA.SQLCODE || ' OCCURED';   16030015
     CALL RCBC04M_SEND_MAP;                                             16040036
   END;                                                                 16050015
 END;                                                                   16060015
                                                                        16070002
 DO WHILE (OK_FLAG = TRUE);                                             16080002
   EXEC SQL  FETCH CSR_G                                                16090002
             INTO :RCB170S.PRODUCT_TYPE                                 16100002
                 ,:RCB170S.ORIGIN                                       16110002
                 ,:RCB170S.SEQUENCE_NUMBER                              16120002
                 ,:RCB170S.EFFECTIVE_DATE                               16130002
                 ,:RCB170S.END_DATE;                                    16140002
                                                                        16150002
   IF SQLCA.SQLCODE = 0 THEN                                            16160002
   DO;                                                                  16170002
     CALL RCBC04M_CHECK_T110;                                           16180002
                                                                        16190002
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        16200002
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             16210002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 16220002
                                                                        16230002
     WRK_END_DATE_OU = WRK_END_DATE;                                    16240002
     IF T110_FND_FLAG = TRUE THEN                                       16250015
     DO;                                                                16260015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       16270015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           16280015
     END;                                                               16290015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         16300002
        WRK_END_DATE_OU = RCB170S.END_DATE;                             16310002
                                                                        16320002
     CALL RCBC04M_UPDATE_OU;                                            16330002
                                                                        16340002
   END;                                                                 16350002
                                                                        16360002
   IF SQLCA.SQLCODE ¬= 0 THEN                                           16370002
   DO;                                                                  16380002
     OK_FLAG = FALSE;                                                   16390002
   END;                                                                 16400002
 END;                                                                   16410002
                                                                        16420002
0END RCBC04M_CURSOR_G;                                                  16430002
1/********************************************************************/ 16440002
 /*      CASE H CURSOR PROCESSING                                    */ 16450002
 /********************************************************************/ 16460002
0RCBC04M_CURSOR_H: PROC;                                                16470002
                                                                        16480002
 OK_FLAG = TRUE;                                                        16490002
 EXEC SQL  OPEN CSR_H;                                                  16500002
 IF SQLCA.SQLCODE ¬= 0 THEN RETURN;                                     16510002
                                                                        16520002
 DO WHILE (OK_FLAG = TRUE);                                             16530002
   EXEC SQL  FETCH CSR_H                                                16540002
             INTO :RCB170S.PRODUCT_TYPE                                 16550002
                 ,:RCB170S.ORIGIN                                       16560002
                 ,:RCB170S.SEQUENCE_NUMBER                              16570002
                 ,:RCB170S.EFFECTIVE_DATE                               16580002
                 ,:RCB170S.END_DATE;                                    16590002
                                                                        16600002
   IF SQLCA.SQLCODE = 0 THEN                                            16610002
   DO;                                                                  16620002
     CALL RCBC04M_CHECK_T110;                                           16630002
                                                                        16640002
     WRK_EFFECTIVE_DATE_OU = WRK_EFFECTIVE_DATE;                        16650002
     IF WRK_EFFECTIVE_DATE_OU < RCB170S.EFFECTIVE_DATE THEN             16660002
        WRK_EFFECTIVE_DATE_OU = RCB170S.EFFECTIVE_DATE;                 16670002
                                                                        16680002
     WRK_END_DATE_OU = WRK_END_DATE;                                    16690002
     IF T110_FND_FLAG = TRUE THEN                                       16700015
     DO;                                                                16710015
       IF WRK_END_DATE_OU > RCB110S.END_DATE THEN                       16720015
          WRK_END_DATE_OU = RCB110S.END_DATE;                           16730015
     END;                                                               16740015
     IF WRK_END_DATE_OU > RCB170S.END_DATE THEN                         16750002
        WRK_END_DATE_OU = RCB170S.END_DATE;                             16760002
                                                                        16770002
     CALL RCBC04M_UPDATE_OU;                                            16780002
                                                                        16790002
   END;                                                                 16800002
                                                                        16810002
   IF SQLCA.SQLCODE ¬= 0 THEN                                           16820002
   DO;                                                                  16830002
     OK_FLAG = FALSE;                                                   16840002
   END;                                                                 16850002
 END;                                                                   16860002
                                                                        16870002
0END RCBC04M_CURSOR_H;                                                  16880002
1/********************************************************************/ 16890002
 /*      UPDATE T170                                                 */ 16900002
 /********************************************************************/ 16910002
0RCBC04M_UPDATE_OU: PROC;                                               16920002
                                                                        16930002
 RCB170S.COUNTRY_NUMBER   = WRK_COUNTRY_NUMBER;                         16940046
 RCB170S.OU_CODE          = WRK_OU_CODE_NEW;                            16950002
 PARM_INT_AREA.RUN_DATE   = WRK_DATE;                                   16960002
 RCB170S.LAST_CHANGE_DATE = WRK_DATE;                                   16970002
 RCB170S.EFFECTIVE_DATE   = WRK_EFFECTIVE_DATE_OU;                      16980002
 RCB170S.END_DATE         = WRK_END_DATE_OU;                            16990002
                                                                        17000002
 CALL RCBFAQN (ADDR(RCB170S),                                           17010002
               ADDR(RCB170SI),                                          17020002
               ADDR(RCBZ02S),                                           17030002
               ADDR(PARM_INT_AREA));                                    17040002
                                                                        17050002
 SELECT (RCBZ02S.RETURN_CODE);                                          17060002
   WHEN (0)                                                             17070002
   DO;                                                                  17080002
     CALL RCBC04M_UPD_T560;                                             17090002
   END;                                                                 17100002
   OTHERWISE                                                            17110002
   DO;                                                                  17120002
     RCBM04O.MSG_LINEO = 'DB2 ERROR - RC FROM RCBFAQN = '               17130058
                       || RCBZ02S.RETURN_CODE || '    ';                17140064
     RCBM04O.ORIGINC   = DFHRED;                                        17150036
     RCBM04O.SEQNOC    = DFHRED;                                        17151036
     RCBM04I.ORIGINL   = -1;                                            17160036
     CALL RCBC04M_SEND_MAP_CSR;                                         17170033
   END;                                                                 17180015
 END;                                                                   17190015
                                                                        17200015
0END RCBC04M_UPDATE_OU;                                                 17210015
1/********************************************************************/ 17220015
 /*      VALIDATE DATE PROCESSING                                    */ 17230015
 /********************************************************************/ 17240015
0RCBC04M_VALID_DATE: PROC(A_DATE ) RETURNS(BIT(1));                     17250015
 DCL A_DATE         CHAR(*);                                            17260015
 DCL L_RET          BIT(1) INIT(TRUE);                                  17270015
                                                                        17280015
 DATE_AREA               = '';                                          17290015
 DATE_AREA.WD_IN_FORMAT  = 'ISO';                                       17300001
 DATE_AREA.WD_OUT_FORMAT = 'ISO';                                       17310001
 DATE_AREA.WD_FUNCTION   = 'V';  /*VALIDATE*/                           17320001
 DATE_AREA.WD_IN_DATE    = A_DATE;                                      17330001
 CALL RCB004N (ADDR(DATE_AREA));                                        17340061
 /* TEST RESULT FROM RCB004N */                                         17350001
 IF (DATE_AREA.WD_STATUS ¬= ' ') THEN                                   17360001
 DO;                                                                    17370001
   L_RET = FALSE;                                                       17380061
 END;                                                                   17390060
                                                                        17400060
 RETURN(L_RET);                                                         17410001
                                                                        17420001
0END RCBC04M_VALID_DATE;                                                17430001
1/********************************************************************/ 17452101
 /*      CLEAR PROCESSING                                            */ 17453001
 /*         CLEAR OUT WORK FIELDS                                    */ 17460001
 /********************************************************************/ 17470001
0RCBC04M_CLEAR_WORK: PROC;                                              17480001
                                                                        17490001
 HEADER.NEXT              = '00';                                       17500001
 WRK_ACTION               = '';                                         17510038
 WRK_OU_CODE_OLD          = '';                                         17520038
 WRK_OU_CODE_NEW          = '';                                         17530038
 WRK_EFFECTIVE_DATE       = '';                                         17540038
 WRK_END_DATE             = '';                                         17550038
 WRK_CUSTOMER_NUMBER      = '';                                         17560038
 WRK_PRODUCT_TYPE         = '';                                         17570038
 WRK_ORIGIN               = '';                                         17580038
 WRK_SEQUENCE_NUMBER      = '';                                         17590038
 PF4_FLAG                 = FALSE;                                      17600001
 PF5_FLAG                 = FALSE;                                      17610001
 NEW_OU_COUNTRY_FLAG      = FALSE;                                      17620023
 OLD_OU_COUNTRY_FLAG      = FALSE;                                      17630023
                                                                        17640001
0END RCBC04M_CLEAR_WORK;                                                17650001
1/********************************************************************/ 17660033
 /*      GET CURSOR POSITION                                         */ 17670033
 /*         FOR RETURN FROM HELP SCREENS                             */ 17680033
 /********************************************************************/ 17690033
0RCBC04M_GET_CSR_POS: PROC;                                             17700033
                                                                        17710033
 SELECT(CSR_POS);                                                       17720033
   WHEN(1)  RCBM04I.OU_CODE_NEWL               = -1;                    17730034
   WHEN(2)  RCBM04I.EFFECTIVE_DATEL            = -1;                    17740034
   WHEN(3)  RCBM04I.END_DATEL                  = -1;                    17750034
   WHEN(4)  RCBM04I.CUSTOMER_NUMBERL           = -1;                    17760034
   WHEN(5)  RCBM04I.OU_CODE_OLDL               = -1;                    17770034
   WHEN(6)  RCBM04I.PRODUCT_TYPEL              = -1;                    17780033
   WHEN(7)  RCBM04I.ORIGINL                    = -1;                    17790036
   WHEN(8)  RCBM04I.SEQNOL                     = -1;                    17800036
   OTHERWISE RCBM04I.OU_CODE_NEWL              = -1;                    17801037
 END;                                                                   17810033
                                                                        17820033
0END RCBC04M_GET_CSR_POS;                                               17830033
1/********************************************************************/ 17831038
 /*      SAVE MAP                                                    */ 17832038
 /********************************************************************/ 17834038
0RCBC04M_SAVE_MAP: PROC;                                                17835038
                                                                        17836038
 TMP_OU_CODE_NEW     = RCBM04I.OU_CODE_NEWI;                            17838038
 TMP_EFFECTIVE_DATE  = RCBM04I.EFFECTIVE_DATEI;                         17839038
 TMP_END_DATE        = RCBM04I.END_DATEI;                               17839138
 TMP_CUSTOMER_NUMBER = RCBM04I.CUSTOMER_NUMBERI;                        17839238
 TMP_OU_CODE_OLD     = RCBM04I.OU_CODE_OLDI;                            17839338
 TMP_PRODUCT_TYPE    = RCBM04I.PRODUCT_TYPEI;                           17839438
 TMP_ORIGIN          = RCBM04I.ORIGINI;                                 17839538
 TMP_SEQUENCE_NUMBER = RCBM04I.SEQNOI;                                  17839650
                                                                        17839938
0END RCBC04M_SAVE_MAP;                                                  17840038
1/********************************************************************/ 17840138
 /*      RESTORE MAP                                                 */ 17840238
 /********************************************************************/ 17840338
0RCBC04M_RESTORE_MAP: PROC;                                             17840438
                                                                        17840538
 RCBM04O.COUNTRY_NUMBERO  = WRK_COUNTRY_NUMBER;                         17840646
 RCBM04O.OU_CODE_NEWO     = TMP_OU_CODE_NEW;                            17840738
 RCBM04O.EFFECTIVE_DATEO  = TMP_EFFECTIVE_DATE;                         17840838
 RCBM04O.END_DATEO        = TMP_END_DATE;                               17840938
 RCBM04O.CUSTOMER_NUMBERO = TMP_CUSTOMER_NUMBER;                        17841038
 RCBM04O.OU_CODE_OLDO     = TMP_OU_CODE_OLD;                            17841138
 RCBM04O.PRODUCT_TYPEO    = TMP_PRODUCT_TYPE;                           17841238
 RCBM04O.ORIGINO          = TMP_ORIGIN;                                 17841338
 RCBM04O.SEQNOO           = TMP_SEQUENCE_NUMBER;                        17841450
                                                                        17841538
0END RCBC04M_RESTORE_MAP;                                               17841638
1/********************************************************************/ 17842038
 /*      SEND MAP                                                    */ 17850001
 /********************************************************************/ 17860001
0RCBC04M_SEND_MAP : PROC;                                               17870001
                                                                        17880001
0EXEC CICS SEND                                                         17890001
    MAP('RCBM04')                                                       17900001
    MAPSET('RCBM04')                                                    17910001
    FREEKB                                                              17920001
    ERASE                                                               17930001
    RESP(RESPONSE)                                                      17940001
    RESP2(CODE_EXPLAIN);                                                17950001
                                                                        17960001
0EXEC CICS RETURN                                                       17970001
    TRANSID('RC04')                                                     17980001
    COMMAREA(COMMAREA)                                                  17990001
    LENGTH(CSTG(COMMAREA))                                              18000001
    RESP(RESPONSE)                                                      18010001
    RESP2(CODE_EXPLAIN);                                                18020001
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 18030001
   WHEN(DFHRESP(NORMAL));                                               18040001
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  18050001
   DO;                                                                  18060001
     COMMAREA_LENGTH = EIBCALEN;                                        18070001
     EXEC CICS RETURN                                                   18080001
        TRANSID('RC04')                                                 18090001
        COMMAREA(COMMAREA)                                              18100001
        LENGTH(COMMAREA_LENGTH);                                        18110001
   END;                                                                 18120001
   OTHERWISE                                                            18130001
   DO;                                                                  18140001
     RCBM04O.MSG_LINEO = ERR_MESSAGE30;                                 18150001
     CALL RCBC04M_SEND_MAP_CSR;                                         18160033
   END;                                                                 18170001
 END;                                                                   18180001
                                                                        18190001
0END RCBC04M_SEND_MAP;                                                  18200001
1/********************************************************************/ 18210001
 /*      SEND HELP MAP                                               */ 18220001
 /********************************************************************/ 18230001
0RCBC04M_HELP_MAP : PROC;                                               18240001
                                                                        18250001
 HEADER.NEXT = 'H1';                                                    18260001
 HELP_FLAG   = FALSE;                                                   18270033
 CSR_POS     = 1;                                                       18280033
                                                                        18290033
 IF RCBM04I.OU_CODE_NEWF = CSR_HELP                                     18300035
  | RCBM04I.OU_CODE_NEWF = CSR_EOF THEN                                 18310035
 DO;                                                                    18320033
   CSR_POS   = 1;                                                       18330033
   HELP_FLAG = TRUE;                                                    18340033
   EXEC CICS SEND                                                       18350033
      MAP('NEWOU')                                                      18360034
      MAPSET('RCBHELP')                                                 18370033
      FREEKB                                                            18380033
      ERASE;                                                            18390033
 END;                                                                   18400033
                                                                        18410033
 IF RCBM04I.EFFECTIVE_DATEF = CSR_HELP                                  18420035
  | RCBM04I.EFFECTIVE_DATEF = CSR_EOF THEN                              18430035
 DO;                                                                    18440033
   CSR_POS   = 2;                                                       18450034
   HELP_FLAG = TRUE;                                                    18460033
   EXEC CICS SEND                                                       18470033
      MAP('EFFDATE')                                                    18480034
      MAPSET('RCBHELP')                                                 18490033
      FREEKB                                                            18500033
      ERASE;                                                            18510033
 END;                                                                   18520033
                                                                        18530033
 IF RCBM04I.END_DATEF = CSR_HELP                                        18540035
  | RCBM04I.END_DATEF = CSR_EOF THEN                                    18550035
 DO;                                                                    18560033
   CSR_POS   = 3;                                                       18570034
   HELP_FLAG = TRUE;                                                    18580033
   EXEC CICS SEND                                                       18590033
      MAP('ENDDATE')                                                    18600034
      MAPSET('RCBHELP')                                                 18610033
      FREEKB                                                            18620033
      ERASE;                                                            18630033
 END;                                                                   18640033
                                                                        18650033
 IF RCBM04I.CUSTOMER_NUMBERF = CSR_HELP                                 18660035
  | RCBM04I.CUSTOMER_NUMBERF = CSR_EOF THEN                             18670035
 DO;                                                                    18680033
   CSR_POS   = 4;                                                       18690034
   HELP_FLAG = TRUE;                                                    18700033
   EXEC CICS SEND                                                       18710033
      MAP('CUSTNO')                                                     18720034
      MAPSET('RCBHELP')                                                 18730033
      FREEKB                                                            18740033
      ERASE;                                                            18750033
 END;                                                                   18760033
                                                                        18770033
 IF RCBM04I.OU_CODE_OLDF = CSR_HELP                                     18780035
  | RCBM04I.OU_CODE_OLDF = CSR_EOF THEN                                 18790035
 DO;                                                                    18800033
   CSR_POS   = 5;                                                       18810034
   HELP_FLAG = TRUE;                                                    18820033
   EXEC CICS SEND                                                       18830033
      MAP('OLDOU')                                                      18840034
      MAPSET('RCBHELP')                                                 18850033
      FREEKB                                                            18860033
      ERASE;                                                            18870033
 END;                                                                   18880033
                                                                        18890033
 IF RCBM04I.PRODUCT_TYPEF = CSR_HELP                                    18900035
  | RCBM04I.PRODUCT_TYPEF = CSR_EOF THEN                                18910035
 DO;                                                                    18920033
   CSR_POS   = 6;                                                       18930034
   HELP_FLAG = TRUE;                                                    18940033
   EXEC CICS SEND                                                       18950033
      MAP('TOS')                                                        18960034
      MAPSET('RCBHELP')                                                 18970033
      FREEKB                                                            18980033
      ERASE;                                                            18990033
 END;                                                                   19000033
                                                                        19010033
 IF RCBM04I.ORIGINF = CSR_HELP                                          19020036
  | RCBM04I.ORIGINF = CSR_EOF THEN                                      19030036
 DO;                                                                    19040033
   CSR_POS   = 7;                                                       19050034
   HELP_FLAG = TRUE;                                                    19060033
   EXEC CICS SEND                                                       19070033
      MAP('TOS')                                                        19080034
      MAPSET('RCBHELP')                                                 19090033
      FREEKB                                                            19100033
      ERASE;                                                            19110033
 END;                                                                   19120033
                                                                        19130033
 IF RCBM04I.SEQNOF= CSR_HELP                                            19140036
  | RCBM04I.SEQNOF = CSR_EOF THEN                                       19150036
 DO;                                                                    19160036
   CSR_POS   = 8;                                                       19170036
   HELP_FLAG = TRUE;                                                    19180036
   EXEC CICS SEND                                                       19190036
      MAP('TOS')                                                        19200036
      MAPSET('RCBHELP')                                                 19210036
      FREEKB                                                            19220036
      ERASE;                                                            19230036
 END;                                                                   19240036
                                                                        19250036
 IF HELP_FLAG = FALSE THEN                                              19260036
 DO;                                                                    19270036
   EXEC CICS SEND                                                       19280036
      MAP('RCBH04')                                                     19290036
      MAPSET('RCBM04')                                                  19300036
      FREEKB                                                            19310036
      ERASE;                                                            19320036
 END;                                                                   19330036
                                                                        19340036
                                                                        19350036
0EXEC CICS RETURN                                                       19360001
    TRANSID('RC04')                                                     19370001
    COMMAREA(COMMAREA)                                                  19380001
    LENGTH(CSTG(COMMAREA))                                              19390001
    RESP(RESPONSE)                                                      19400001
    RESP2(CODE_EXPLAIN);                                                19410001
 SELECT(RESPONSE);                       /* CHECK RESPONSE           */ 19420001
   WHEN(DFHRESP(NORMAL));                                               19430001
   WHEN(DFHRESP(LENGERR))               /* LENGTH ERROR             */  19440001
   DO;                                                                  19450001
     COMMAREA_LENGTH = EIBCALEN;                                        19460001
     EXEC CICS RETURN                                                   19470001
        TRANSID('RC04')                                                 19480001
        COMMAREA(COMMAREA)                                              19490001
        LENGTH(COMMAREA_LENGTH);                                        19500001
   END;                                                                 19510001
   OTHERWISE                                                            19520001
   DO;                                                                  19530001
     RCBM04O.MSG_LINEO = ERR_MESSAGE30;                                 19540001
     CALL RCBC04M_SEND_MAP;                                             19550036
   END;                                                                 19560001
 END;                                                                   19570001
                                                                        19580001
0END RCBC04M_HELP_MAP;                                                  19590001
1/********************************************************************/ 19600001
 /*      SEND ERROR MAP - NO ERASE RCB04M                            */ 19610006
 /********************************************************************/ 19620001
 RCBC04M_SEND_MAP_CSR : PROC;                                           19630033
                                                                        19640001
 PF5_FLAG    = FALSE;                                                   19650001
 RCBM04O.COUNTRY_NUMBERO = WRK_COUNTRY_NUMBER;                          19660051
                                                                        19700001
 EXEC CICS SEND                                                         19710001
    MAP('RCBM04')                                                       19720001
    MAPSET('RCBM04')                                                    19730001
    CURSOR                                                              19740001
    ERASE                                                               19741041
    FREEKB;                                                             19750001
                                                                        19760001
 EXEC CICS RETURN                                                       19770001
    TRANSID('RC04')                                                     19780001
    COMMAREA(COMMAREA)                                                  19790001
    LENGTH(CSTG(COMMAREA));                                             19800001
                                                                        19810001
 END RCBC04M_SEND_MAP_CSR;                                              19820033
1/*******************************************************************/  19830001
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  19840001
 /*******************************************************************/  19850001
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  19860001
  $DAIMOD (RCBC04M);                     /* MODULE TO BE COMPILED   */  19870001
0/*******************************************************************/  19880001
 /* END OF ABR BLOCK '                                              */  19890001
 /*******************************************************************/  19900001
0 END RCBC04M;                                                          19910001