1/* RCBDR8U - RCMS CUSTOMER EXTRACT USER EXIT                        */ 00019213
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* MODULE NAME      : RCBDR8U                                       */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME     : RCBDRFP                                       */ 00060000
 /*                                                                  */ 00070000
 /* LANGUAGE         : PLISQL                                        */ 00080000
 /*                                                                  */ 00090000
 /* TYPE             : LINKABLE MODULE                               */ 00100000
 /*                                                                  */ 00110000
 /* DESCRIPTION      : USER EXIT IN ORDER TO CHANGE THE VALUE OF     */ 00120000
 /*                    FIELD SEDQMSI OF THE RCMS - CU EXTRACT        */ 00130000
 /*                                                                  */ 00140000
 /* NOTE             : IF A CUSTOMER HAS NO CONTRACT FOR ADDITIONAL  */ 00150000
 /*                    SERVICES THIS USER EXIT MUST NOT BE USED.     */ 00160000
 /*                                                                  */ 00170000
 /* NOTE 1           : IF YOU WANT TO USE THIS EXIT BE SURE TO SET   */ 00180000
 /*                    SWITCH_USER_EXIT TO TRUE                      */ 00190000
 /*                                                                  */ 00200000
 /* INPUT            : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00210000
 /*                    - DB2   :                                     */ 00220000
 /*                                                                  */ 00230000
 /* OUTPUT           : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00240000
 /*                  : - FILE : RCB0M10                              */ 00250000
 /*                                                                  */ 00260000
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00270000
 /*                                                                  */ 00280000
 /* MESSAGES         : ----                                          */ 00290000
 /*                                                                  */ 00300000
 /* DEPENDENCIES     : NONE                                          */ 00310000
 /*                                                                  */ 00320000
 /* FREQUENCY        : ----                                          */ 00330000
 /*                                                                  */ 00340000
 /*  MAINTENANCE LOG :                                               */ 00350000
 /*  ---------------                                                 */ 00360000
 /*                                                                  */ 00370000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00380000
 /*  --------------------------------------------------------------  */ 00390000
 /*  1994-12-09 | RA01120      | CEDS INITIAL DEVELOPMENT            */ 00400000
 /*             |              | CUSTOMER ADDITIONAL SERVICE         */ 00410000
 /*             |              | INDICATOR TO RCMS                   */ 00420000
 /*  1997-04-11 | PTM1036      | CORRECTED PROLOG                    */ 00430000
 /*  1997-04-29 | PTM0892      | REMOVE DECLARES UNUSED EXT.ENTRIES  */ 00440000
 /*                                                                  */ 00450000
 /*  1999-11-02 | RUN ONCE NORD| ADD NORDIC SPECIFIC CODE - BG       */ 00460000
 /*  1999-11-08 | RUN ONCE CNTL| ADD CENTRAL REGION CODE  - SG       */ 00470000
 /*  2000-02-29 | RUN ONCE CNTL| MAJOR CHANGES TO CODE    - BG       */ 00480000
 /*  2016-04-27 | PCEDSP-0610  | (L) CND : RCMS EXTRACT              */ 00490022
 /*                                                                  */ 00492017
 /********************************************************************/ 00500015
1RCBDR8U: PROC    (PTR_SWITCH_USER_EXIT,                                00510000
                   PTR_FILE_RCBDRFS,                                    00520000
                   PTR_INT_AREA)                                        00530000
          REORDER;                                                      00540000
0              @NFRDC3: ENTRY;     DCL @SCHFIRST BIT(1)                 00550000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00560000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00570000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00580000
               EDIT    ('RCBDR8U  VERSION 1999.09.01' ,                 00590000
               ' 09H13.18      MIT DEM VERSIONS-ENTRY',                 00600000
               ' @NFRDC3',' ')     (SKIP,A,A,A,SKIP,A);                 00610000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00620000
               END;     /* ENDE DER VERSIONS-GRUPPE  */                 00630000
 DEFAULT RANGE (*)        STATIC;                                       00640000
0/********************************************************************/ 00650000
 /*  TESTHILFEN-AKTIVIERUNG                                          */ 00660000
 /********************************************************************/ 00670000
 %DECLARE TEST CHARACTER;                                         /*%*/ 00680000
 %TEST = 'N';                                                     /*%*/ 00690000
1/********************************************************************/ 00700000
 /*  PARAMETERS                                                      */ 00710000
 /********************************************************************/ 00720000
 DCL PTR_SWITCH_USER_EXIT    PTR;                                       00730000
 DCL PTR_FILE_RCBDRFS        PTR;                                       00740000
 DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 00750000
1/********************************************************************/ 00760000
 /*  EXTERNAL ENTRIES                                                */ 00770000
 /********************************************************************/ 00780000
 DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 00790000
 /********************************************************************/ 00800000
 /* ON ERROR CONDITIONS                                              */ 00810000
 /********************************************************************/ 00820000
 %INCLUDE (RCB0E0M);                                                    00830000
  END;                                                                  00840000
 /********************************************************************/ 00850000
 /*                                                                  */ 00860000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 00870000
 /* AND CALL THE ERROR ROUTINE:                                      */ 00880000
 /*                                                                  */ 00890000
 /*                                                                  */ 00900000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 00910000
 /*                                                                  */ 00920000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 00930000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 00940000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 00950000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 00960000
 /*                                                                  */ 00970000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 00980000
 /*                                                                  */ 00990000
 /********************************************************************/ 01000000
 /********************************************************************/ 01010000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01020000
 /********************************************************************/ 01030000
 DCL SWITCH_USER_EXIT        BIT (1) BASED(PTR_SWITCH_USER_EXIT);       01040000
 DCL 1 PARM_FILE_RCBDRFS   BASED(PTR_FILE_RCBDRFS),                     01050000
       2 DATA,                                                          01060000
      %INCLUDE (RCBDRFS);;                                              01070000
 DCL 1 PARM_INT_AREA       BASED(PTR_INT_AREA),                         01080000
      %INCLUDE (RCBZ01S);;                                              01090000
1/********************************************************************/ 01100000
 /* DB2 TABLE STRUCTURES                                             */ 01110000
 /********************************************************************/ 01120000
 /*-------------------------------------------------------------------*/01130000
 /***       LOKALE DECLARES          CENTRAL REGION                 ***/01140000
 /*-------------------------------------------------------------------*/01150000
0DCL 1 TB_RCBV030,                                                      01160000
      %INCLUDE (RCB030S);;                                              01170000
 DCL 1 TB_RCBV030_I,                                                    01180000
      %INCLUDE (RCB030SI);;                                             01190000
0DCL 1 TB_RCBV035,                                                      01200000
      %INCLUDE (RCB035S);;                                              01210000
 DCL 1 TB_RCBV035_I,                                                    01220000
      %INCLUDE (RCB035SI);;                                             01230000
0/********************************************************************/ 01240000
 /* SELECT STRUCTURES                CENTRAL REGION                  */ 01250000
 /********************************************************************/ 01260000
 DCL 1 CURSOR_TC_V030,                                                  01270000
        %INCLUDE (RCB030S);;                                            01280000
 DCL 1 CURSOR_TC_V035,                                                  01290000
        %INCLUDE (RCB035S);;                                            01300000
 EXEC SQL                                                               01310000
   DECLARE CURSOR_TC CURSOR FOR                                         01320000
   SELECT A.TYPE_OF_CONTRACT                                            01330000
   FROM RCBV0030_CONTRACT A,                                            01340000
        RCBV0035_CUST_CTR B                                             01350000
   WHERE A.COUNTRY_NUMBER = :CURSOR_TC_V030.COUNTRY_NUMBER              01360000
   AND   A.TYPE_OF_CONTRACT IS NOT NULL                                 01370000
   AND   B.COUNTRY_NUMBER = :CURSOR_TC_V035.COUNTRY_NUMBER              01380000
   AND   A.COUNTRY_NUMBER = B.COUNTRY_NUMBER                            01390000
   AND   A.CONTRACT_NUMBER= B.CONTRACT_NUMBER                           01400000
   AND   B.CUSTOMER_NUMBER= :CURSOR_TC_V035.CUSTOMER_NUMBER             01410000
   AND   B.SA_CONTRACT_IND='Y'                                          01420000
   GROUP BY A.TYPE_OF_CONTRACT                                          01430000
   ORDER BY A.TYPE_OF_CONTRACT                                          01440000
 ;                                                                      01450000
1/********************************************************************/ 01460000
 /*  BIT SWITCHES                                                    */ 01470000
 /********************************************************************/ 01480000
 DCL TRUE     BIT (1) INIT ('1'B);                                      01490000
 DCL FALSE    BIT (1) INIT ('0'B);                                      01500000
 DCL SWITCH_END_OF_CURSOR_TC   BIT (1) INIT ('0'B);/* CENTRAL REGION*/  01510000
 /********************************************************************/ 01520000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01530000
 /********************************************************************/ 01540000
 DCL 1 WORK_FIELDS,                                                     01550000
       3 WRK_LEVEL      FIXED BIN (15),                                 01560000
       3 WRK_INDNULL    FIXED BIN (15);                                 01570000
                                                                        01580000
 /*-------------------------------------------------------------------*/01590000
 /***       LOKALE DECLARES          CENTRAL REGION                 ***/01600000
 /*-------------------------------------------------------------------*/01610000
                                                                        01620000
 DCL 1 WORK_FIELDS_LOCAL,                                               01630000
    3 WRK_SA_IND                        CHAR (01),                      01640000
    3 WRK_AS_IND                        CHAR (01);                      01650000
 DCL I                         BIN FIXED(15,0) INIT(0);                 01660000
                                  /* SCHALTERLEISTE PASSEND ZU       */ 01670000
                                  /* WRK_SA_IND_VALUE                */ 01680000
 DCL 1 SWITCH_IND_ARRAY(8)     BIT(1) BASED(ADDR(SWITCH_IND));          01690000
 DCL 1 SWITCH_IND,                                                      01700000
    5 ESA_IND                  BIT(1),                                  01710000
    5 SSA_IND                  BIT(1),                                  01720000
    5 SVN_IND                  BIT(1),                                  01730000
    5 SSU_IND                  BIT(1),                                  01740000
    5 SER_IND                  BIT(1),                                  01750000
    5 FU_IND6                  BIT(1),                                  01760000
    5 FU_IND7                  BIT(1),                                  01770000
    5 FU_IND8                  BIT(1);                                  01780000
                                  /* SA_IND WERTE                    */ 01790000
                                  /* 0  ->  WENN UNTERSCHIEDLICHE    */ 01800000
                                  /*        VERTRAGSARTEN VORHANDEN  */ 01810000
                                  /* 1  ->  ESA                      */ 01820000
                                  /* 2  ->  SSA                      */ 01830000
                                  /* 3  ->  SVN                      */ 01840000
                                  /* 4  ->  SSU                      */ 01850000
                                  /* 5  ->  SER                      */ 01860000
 DCL WRK_IND_ACTIVE            BIN FIXED(15,0) INIT(5);                 01870000
 DCL 1 WRK_IND_ARRAY(0:8)      CHAR(1) BASED(ADDR(WRK_SA_IND_VALUE));   01880000
 DCL WRK_SA_IND_VALUE          CHAR(9) INIT('MEESUP   ');               01890000
1/********************************************************************/ 01900000
 /*  BUILTIN FUNCTIONS                                               */ 01910000
 /********************************************************************/ 01920000
 DCL (ADDR,                                                             01930000
      SUBSTR,                                      /* CENTRAL REGION */ 01940000
      NULL)   BUILTIN;                                                  01950000
1/********************************************************************/ 01960000
 /* DB2/SQL SQLCA                                                    */ 01970000
 /********************************************************************/ 01980000
  EXEC SQL                                                              01990000
    INCLUDE SQLCA                                                       02000000
    ;                                                                   02010000
1/********************************************************************/ 02020000
 /*                 S T A R T   P R O C E S S I N G                  */ 02030000
 /********************************************************************/ 02040000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 02050000
 PUT SKIP EDIT ('RCBDR8U  POS. 01')(A);                           /*%*/ 02060000
 %END;                                                            /*%*/ 02070000
                                         /* SET LEVEL AND MOD NAME   */ 02080000
 WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            02090000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     02100000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBDR8U';                     02110000
                                         /* USER DEFINED PROCESS     */ 02120000
 SWITCH_USER_EXIT = TRUE;                                               02130000
                                                                        02140000
 SELECT (PARM_INT_AREA.COUNTRY_NUMBER) ;                                02150000
    WHEN ('846')      /*   SWEDEN   */                                  02160000
       DO ;                                                             02170000
          IF PARM_FILE_RCBDRFS.SEDQMSI = 'E '  THEN                     02180000
             DO;                                                        02190000
                PARM_FILE_RCBDRFS.SEDQMSI = 'E1';                       02200000
             END;                                                       02210000
                                                                        02220000
          IF PARM_FILE_RCBDRFS.SEDQMSI = ' S'  THEN                     02230000
             DO;                                                        02240000
                PARM_FILE_RCBDRFS.SEDQMSI = '1S';                       02250000
             END;                                                       02260000
       END ;                                                            02270000
    WHEN ('702')      /*   FINLAND  */                                  02280000
       DO ;                                                             02290000
          IF PARM_FILE_RCBDRFS.SEDQMSI = 'E '  THEN                     02300000
             DO;                                                        02310000
                PARM_FILE_RCBDRFS.SEDQMSI = 'E1';                       02320000
             END;                                                       02330000
                                                                        02340000
          IF PARM_FILE_RCBDRFS.SEDQMSI = ' S'  THEN                     02350000
             DO;                                                        02360000
                PARM_FILE_RCBDRFS.SEDQMSI = '1S';                       02370000
             END;                                                       02380000
       END ;                                                            02390000
    WHEN ('678')      /*   DENMARK  */                                  02400000
       DO ;                                                             02410000
          IF PARM_FILE_RCBDRFS.SEDQMSI = 'E '  THEN                     02420000
             DO;                                                        02430000
                PARM_FILE_RCBDRFS.SEDQMSI = 'E1';                       02440000
             END;                                                       02450000
                                                                        02460000
          IF PARM_FILE_RCBDRFS.SEDQMSI = ' S'  THEN                     02470000
             DO;                                                        02480000
                PARM_FILE_RCBDRFS.SEDQMSI = '1S';                       02490000
             END;                                                       02500000
       END ;                                                            02510000
    WHEN ('806')      /*   NORWAY   */                                  02520000
       DO ;                                                             02530000
          IF PARM_FILE_RCBDRFS.SEDQMSI = 'E '  THEN                     02540000
             DO;                                                        02550000
                PARM_FILE_RCBDRFS.SEDQMSI = 'E1';                       02560000
             END;                                                       02570000
                                                                        02580000
          IF PARM_FILE_RCBDRFS.SEDQMSI = ' S'  THEN                     02590000
             DO;                                                        02600000
                PARM_FILE_RCBDRFS.SEDQMSI = '1S';                       02610000
             END;                                                       02620000
       END ;                                                            02630000
                                                                        02660114
 /* WHEN ('838') DO ;       /* --- START COUNTRY "838" - 03/02/99 */    02664017
 /*     PARM_FILE_RCBDRFS.SEDQMSI = ' '             ;                   02665017
 /* END ;                   /* --- END COUNTRY "838" --- 03/02/99 */    02666017
 /* WHEN ('822') DO ;       /* --- START COUNTRY "822" - 03/02/99 */    02670000
 /*     PARM_FILE_RCBDRFS.SEDQMSI = ' '             ;                   02680000
 /* END ;                   /* --- END COUNTRY "822" --- 03/02/99 */    02690000
                                                                        02700000
 /* CENTRAL AND CRBN REGION START   */                                  02710021
 /* CENTRAL */               /**** START COUNTRY 724 = DEUTSCHLAND ****/02720021
                             /**** START COUNTRY 668 = TSCHECHEI   ****/02730000
                             /**** START COUNTRY 693 = SLOWAKEI    ****/02740000
                             /**** START COUNTRY 708 = SLOWENIEN   ****/02750000
                             /**** START COUNTRY 740 = UNGARN      ****/02760000
                             /**** START COUNTRY 821 = RUSSLAND    ****/02770000
                             /**** START COUNTRY 704 = CROATIEN    ****/02780000
                             /**** START COUNTRY 644 = BULGARIA    ****/02790000
                             /**** START COUNTRY 826 = ROMANIA     ****/02800000
                             /**** START COUNTRY 618 = AUSTRIA     ****/02810000
                             /**** START COUNTRY 820 = POLAND      ****/02820000
                             /**** START COUNTRY 848 = SWITZERLAND ****/02830000
 /* CRBN */                  /**** START COUNTRY 619 = BAHAMAS     ****/02831021
                             /**** START COUNTRY 621 = BARBADOS    ****/02832021
                             /**** START COUNTRY 627 = BERMUDA     ****/02833021
                             /**** START COUNTRY 640 = GUYANA      ****/02834021
                             /**** START COUNTRY 647 = CAYMAN ISLANDS**/02835021
                             /**** START COUNTRY 759 = JAMAICA     ****/02836021
                             /**** START COUNTRY 791 = CURACAO & ARUBA*/02837021
                             /**** START COUNTRY 839 = ST. LUCIA   ****/02838021
                             /**** START COUNTRY 843 = SURINAME    ****/02839021
                             /**** START COUNTRY 859 = TRINIDAD    ****/02839121
   WHEN ('724','668','693','708','740','821','704','644','826','618',   02840000
         '820','848','619','621','627','640','647','759','791','839',   02850021
         '843','859') DO;                              /* PCEDSP-0610 */02851021
      SWITCH_IND       = FALSE;                                         02860000
                                                                        02870000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 02880000
 PUT SKIP EDIT ('RCBDR8U  POS. 02')(A);                           /*%*/ 02890000
 %END;                                                            /*%*/ 02900000
                                                                        02910000
                                    /* SA_IND = 'E' D.H. AUFRUF USER- */02920000
                                    /* EXIT WEGEN SA_IND              */02930000
      IF SUBSTR(PARM_FILE_RCBDRFS.SEDQMSI,1,1) ¬= 'E'                   02940000
      THEN;                                                             02950000
      ELSE                          /* SA_IND 'E' GGFS. AENDERN       */02960000
        DO;                                                             02970000
                                                                        02980000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 02990000
 PUT SKIP EDIT ('RCBDR8U  POS. 03')(A);                           /*%*/ 03000000
 %END;                                                            /*%*/ 03010000
                                                                        03020000
                                    /* OPEN CURSOR FUER T&C DES KUNDEN*/03030000
          CURSOR_TC_V030.COUNTRY_NUMBER  = PARM_INT_AREA.COUNTRY_NUMBER;03040000
          CURSOR_TC_V035.COUNTRY_NUMBER  = PARM_INT_AREA.COUNTRY_NUMBER;03050000
          CURSOR_TC_V035.CUSTOMER_NUMBER = PARM_FILE_RCBDRFS.CUNOUSE;   03060000
          EXEC SQL                                                      03070000
            OPEN CURSOR_TC                                              03080000
          ;                                                             03090000
          IF SQLCODE ¬= 0                                               03100000
          THEN CALL RCBDR8U_ERROR (ADDR (SQLCA),                        03110000
                                   'DB2',                               03120000
                                   '#001');                             03130000
                                    /* 1. T&C DES KUNDEN HOLEN        */03140000
          CALL FETCH_CURSOR_TC;                                         03150000
                                    /* ANHAND T&C FESTSTELLEN, WELCHE */03160000
                                    /* VERTRAGSARTEN DER KUNDE HAT    */03170000
          DO WHILE (¬ SWITCH_END_OF_CURSOR_TC);                         03180000
            CALL ERM_VERTRAGSART;                                       03190000
            CALL FETCH_CURSOR_TC;   /* WEITERE T&C DES KUNDEN HOLEN  */ 03200000
          END; /*DO WHILE (¬ SWITCH_END_OF_CURSOR_TC)*/                 03210000
          EXEC SQL                                                      03220000
            CLOSE CURSOR_TC                                             03230000
          ;                                                             03240000
          IF SQLCODE ¬= 0                                               03250000
          THEN CALL RCBDR8U_ERROR (ADDR (SQLCA),                        03260000
                                   'DB2',                               03270000
                                   '#002');                             03280000
                                    /* ANHAND ERMITTELTER VERTRAGS-   */03290000
                                    /* ARTEN SA_INDICATOR SETZEN      */03300000
          WRK_SA_IND = '?';                                             03310000
          DO I=1 TO WRK_IND_ACTIVE;                                     03320000
            IF SWITCH_IND_ARRAY(I)                                      03330000
            THEN                                                        03340000
              DO;                                                       03350000
                                                                        03360000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 03370000
 PUT SKIP EDIT ('RCBDR8U  POS. 04')(A);                           /*%*/ 03380000
 %END;                                                            /*%*/ 03390000
                                                                        03400000
                                    /* INITIALISIERUNG MIT ERSTEM     */03410000
                                    /* ZUTREFFENDEM SA_INDICATOR      */03420000
                IF WRK_SA_IND = '?'                                     03430000
                THEN WRK_SA_IND = WRK_IND_ARRAY(I);                     03440000
                                    /* GGFS. UMSETZEN AUF SA_INDICATOR*/03450000
                                    /* FUER UNTERSCHIEDLICHE VERTRAGS-*/03460000
                                    /* ARTEN                          */03470000
                ELSE                                                    03480000
                  DO;                                                   03490000
                                                                        03500000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 03510000
 PUT SKIP EDIT ('RCBDR8U  POS. 05')(A);                           /*%*/ 03520000
 %END;                                                            /*%*/ 03530000
                                                                        03540000
                    IF WRK_SA_IND ¬= WRK_IND_ARRAY(I)                   03550000
                    THEN WRK_SA_IND = WRK_IND_ARRAY(0);                 03560000
                  END;                                                  03570000
              END;                                                      03580000
          END; /* DO I=1 TO WRK_IND_ACTIVE */                           03590000
                                    /* WENN WERT ERMITTELT,           */03600000
                                    /* UEBERNEHMEN                    */03610000
          IF WRK_SA_IND ¬= '?'                                          03620000
          THEN SUBSTR(PARM_FILE_RCBDRFS.SEDQMSI,1,1) = WRK_SA_IND;      03630000
                                                                        03640000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 03650000
 PUT SKIP EDIT ('RCBDR8U  POS. 06')(A);                           /*%*/ 03660000
 %END;                                                            /*%*/ 03670000
                                                                        03680000
        END; /* SUBSTR(PARM_FILE_RCBDRFS.SEDQMSI,1,1) = 'E' */          03690000
                                                                        03700000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 03710000
 PUT SKIP EDIT ('RCBDR8U  POS. 07')(A);                           /*%*/ 03720000
 %END;                                                            /*%*/ 03730000
   END;                      /**** END   COUNTRY 724 = DEUTSCHLAND ****/03740000
                             /**** END   COUNTRY 668 = TSCHECHEI   ****/03750000
                             /**** END   COUNTRY 693 = SLOWAKEI    ****/03760000
                             /**** END   COUNTRY 708 = SLOWENIEN   ****/03770000
                             /**** END   COUNTRY 740 = UNGARN      ****/03780000
                             /**** END   COUNTRY 821 = RUSSLAND    ****/03790000
                             /**** END   COUNTRY 704 = CROATIEN    ****/03800000
                             /**** END   COUNTRY 644 = BULGARIA    ****/03810000
                             /**** END   COUNTRY 826 = ROMANIA     ****/03820000
                             /**** END   COUNTRY 618 = AUSTRIA     ****/03830000
                             /**** END   COUNTRY 820 = POLAND      ****/03840000
                             /**** END   COUNTRY 848 = SWITZERLAND ****/03850000
  /* CENTRAL AND CRBN REGION END   */                    /*PCEDSP-0610*/03860021
                                                                        03870000
    OTHERWISE                                                           03880000
       DO ;                                                             03890000
       END ;                                                            03900000
 END ;   /*   SELECT COUNTRY NUMBER   */                                03910000
                                                                        03920000
 /*********************************************************************/03930000
1/*------------------------------------------------------------------*/ 03940000
 /* MODULE NAME      : ERM_VERTAGSART                                */ 03950000
 /*                                                                  */ 03960000
 /* DESCRIPTION      : TRANSLATE T&C IN TYPE OF CONTRACT             */ 03970000
 /*------------------------------------------------------------------*/ 03980000
 ERM_VERTRAGSART: PROC;                                                 03990000
                                                                        04000000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04010000
 PUT SKIP EDIT ('RCBDR8U  POS. 08')(A);                           /*%*/ 04020000
 %END;                                                            /*%*/ 04030000
                                                                        04040000
   SELECT;                                                              04050000
     WHEN(SUBSTR(TB_RCBV030.TYPE_OF_CONTRACT,1,5)='GM   ')              04060000
       SWITCH_IND.ESA_IND = TRUE;                                       04070000
     WHEN(SUBSTR(TB_RCBV030.TYPE_OF_CONTRACT,3,3)='ESA')                04080000
       SWITCH_IND.ESA_IND = TRUE;                                       04090000
     WHEN(SUBSTR(TB_RCBV030.TYPE_OF_CONTRACT,3,3)='SSA')                04100000
       SWITCH_IND.SSA_IND = TRUE;                                       04110000
     WHEN(SUBSTR(TB_RCBV030.TYPE_OF_CONTRACT,3,3)='SVN')                04120000
       SWITCH_IND.SVN_IND = TRUE;                                       04130000
     WHEN(SUBSTR(TB_RCBV030.TYPE_OF_CONTRACT,3,3)='SSU')                04140000
       SWITCH_IND.SSU_IND = TRUE;                                       04150000
     WHEN(SUBSTR(TB_RCBV030.TYPE_OF_CONTRACT,3,3)='SER')                04160000
       SWITCH_IND.SER_IND = TRUE;                                       04170000
     OTHERWISE;                                                         04180000
   END; /* SELECT */                                                    04190000
 END ERM_VERTRAGSART;                                                   04200000
1/*------------------------------------------------------------------*/ 04210000
 /* MODULE NAME      : FETCH_CURSOR_TC                               */ 04220000
 /*                                                                  */ 04230000
 /* DESCRIPTION      : READ NEXT T&C OF CUSTOMER                     */ 04240000
 /*------------------------------------------------------------------*/ 04250000
 FETCH_CURSOR_TC: PROC;                                                 04260000
                                                                        04270000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04280000
 PUT SKIP EDIT ('RCBDR8U  POS. 09')(A);                           /*%*/ 04290000
 %END;                                                            /*%*/ 04300000
                                                                        04310000
   TB_RCBV030 = '';                                                     04320000
   EXEC SQL                                                             04330000
     FETCH CURSOR_TC                                                    04340000
      INTO :TB_RCBV030.TYPE_OF_CONTRACT                                 04350000
        ;                                                               04360000
                                                                        04370000
   SELECT (SQLCODE);                                                    04380000
     WHEN (0)                                                           04390000
       DO;                                                              04400000
                                                                        04410000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04420000
 PUT SKIP EDIT ('RCBDR8U  POS. 10')(A);                           /*%*/ 04430000
 %END;                                                            /*%*/ 04440000
                                                                        04450000
         SWITCH_END_OF_CURSOR_TC = FALSE;                               04460000
       END;                                                             04470000
     WHEN (100)                                                         04480000
       DO;                                                              04490000
                                                                        04500000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04510000
 PUT SKIP EDIT ('RCBDR8U  POS. 11')(A);                           /*%*/ 04520000
 %END;                                                            /*%*/ 04530000
                                                                        04540000
         SWITCH_END_OF_CURSOR_TC = TRUE;                                04550000
       END;                                                             04560000
     OTHERWISE                                                          04570000
       DO;                                                              04580000
                                                                        04590000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04600000
 PUT SKIP EDIT ('RCBDR8U  POS. 12')(A);                           /*%*/ 04610000
 %END;                                                            /*%*/ 04620000
                                                                        04630000
          CALL RCBDR8U_ERROR (ADDR (SQLCA),                             04640000
                              'DB2',                                    04650000
                              '#003');                                  04660000
       END;                                                             04670000
   END; /* SELECT SQLCODE */                                            04680000
                                                                        04690000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04700000
 PUT SKIP EDIT ('RCBDR8U  POS. 13')(A);                           /*%*/ 04710000
 %END;                                                            /*%*/ 04720000
                                                                        04730000
 END FETCH_CURSOR_TC;                                                   04740000
1/*------------------------------------------------------------------*/ 04750000
 /* MODULE NAME      : RCBDR8U_ERROR                                 */ 04760000
 /*                                                                  */ 04770000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 04780000
 /*                    THE INPUT VARIABLES                           */ 04790000
 /*------------------------------------------------------------------*/ 04800000
 RCBDR8U_ERROR: PROC             (PTR_ERROR,                            04810000
                         ERR_TYPE,                                      04820000
                         CALL_ID);                                      04830000
                                                                        04840000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04850000
 PUT SKIP EDIT ('RCBDR8U  POS. 14')(A);                           /*%*/ 04860000
 %END;                                                            /*%*/ 04870000
                                                                        04880000
 DCL PTR_ERROR    PTR;                                                  04890000
 DCL ERR_TYPE      CHAR(8);                                             04900000
 DCL CALL_ID       CHAR(4);                                             04910000
 PARM_INT_AREA.PTR_ERROR          = PTR_ERROR;                          04920000
 PARM_INT_AREA.ERR_TYPE           = ERR_TYPE;                           04930000
 PARM_INT_AREA.CALL_ID            = CALL_ID;                            04940000
 CALL RCB0E1M (ADDR(PARM_INT_AREA));                                    04950000
 END RCBDR8U_ERROR;                                                     04960000
                                                                        04970000
 /*********************************************************************/04980000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 04990000
 PUT SKIP EDIT ('RCBDR8U  POS. 15')(A);                           /*%*/ 05000000
 %END;                                                            /*%*/ 05010000
                                                                        05020000
 /*********************************************************************/05030000
 /***       LOKALE AENDERUNG         ENDE                           ***/05040000
 /***       LOKALE AENDERUNG         ENDE                           ***/05050000
 /***       LOKALE AENDERUNG         ENDE                           ***/05060000
 /*********************************************************************/05070000
                                                                        05080000
                                         /* END USER DEFINED PROCESS */ 05090000
                                         /* RESET LEVEL              */ 05100000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            05110000
1/*******************************************************************/  05120000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  05130000
 /*******************************************************************/  05140000
  %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  05150000
 $DAIMOD (RCBDR8U);                      /* MODULE TO BE COMPILED   */  05160000
 /*******************************************************************/  05170000
 /* END OF ABR BLOCK                                                */  05180000
 /*******************************************************************/  05190000
                                                                        05200000
 %IF TEST = 'Y' %THEN %DO;                                        /*%*/ 05210000
 PUT SKIP EDIT ('RCBDR8U  POS. 16')(A);                           /*%*/ 05220000
 %END;                                                            /*%*/ 05230000
                                                                        05240000
 END RCBDR8U;                                                           05250000