1/* RCBDPBM - CPP/S HW: DELTA EXTRACT                                */ 00010000
 /********************************************************************/ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /********************************************************************/ 00060000
 /* PROGRAM          : RCBDPBM                                       */ 00070000
 /*                                                                  */ 00080000
 /* LANGUAGE         : PLISQL                                        */ 00090000
 /*                                                                  */ 00100000
 /* TYPE             : BATCH                                         */ 00110000
 /*                                                                  */ 00120000
 /* DESCRIPTION      : THE EXTRACT OF HW RELATED                     */ 00130000
 /*                    INFORMATION FOR THE COUNTRIES GIVEN           */ 00140000
 /*                    AND FOR WHICH INFORMATION HAS CHANGED         */ 00150000
 /*                    SINCE THE LAST PICOS/REOLS HW EXTRACT         */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : - DB2   : RCBV0040_OU                         */ 00180000
 /*                              RCBV0010_CUSTOMER           RB01289 */ 00190000
 /*                              RCBV0011_PI_CUST            RB01237 */ 00200000
 /*                              RCBV0051_PI_HW_PR           RB01237 */ 00210000
 /*                              RCBV0110_HW_STATUS                  */ 00220000
 /*                              RCBV0125_DMMY_REAL          RB01320 */ 00230000
 /*                              RCBV0150_CUST_ADDR (RA01138)        */ 00240000
 /*                              RCBV0190_HW_CUST                    */ 00250000
 /*                              RCBV0030_CONTRACT           RB01290 */ 00260000
 /*                              RCBV0220_SUPPL_CTR                  */ 00270000
 /*                              RCBV0240_SERV_CTR           RA01275 */ 00280000
 /*                              RCBV0241_PI_CTR             RB01237 */ 00290000
 /*                              RCBV0260_HW_IN_ORD                  */ 00300000
 /*                              RCBV0300_HW_REAL                    */ 00310000
 /*                              RCBV0340_HW_ADDR (RA01138)          */ 00320000
 /*                              RCBV0400_PO_MOD1            RB01278 */ 00330000
 /*                              RCBV0470_SERV_COND          RA01275 */ 00340000
 /*                              RCBV0500_PARM                       */ 00350000
 /*                              RCBV0725_PICOS_HW                   */ 00360000
 /*                                                                  */ 00370000
 /* OUTPUT           : - FILE  : RCBDPB1                             */ 00380000
 /*                              RCB0M10                             */ 00390000
 /*                                                                  */ 00400000
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00410000
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00420000
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00430000
 /*                    RCB018M   UPDATE HASH TOTAL                   */ 00440000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00450000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00460000
 /*                    RCBI50M   RETRIEVE PARAMETER                  */ 00470000
 /*                    RCBF50M   RETRIEVE PARAMETER                  */ 00480000
 /*                    RCBG50M   RETRIEVE PARAMETER                  */ 00490000
 /*                    RCBDP1U   USER EXIT TO FILL MABO WITH OU CODE */ 00500000
 /*                    RCBDP5U   USER EXIT TO CHECK OUTPUT   RB01237 */ 00510000
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00520000
 /*                    RCBISRM   RETRIEVE SERVICE LEVEL CODE RA01275 */ 00530000
 /*                                                                  */ 00540000
 /* MESSAGES         :                                               */ 00550000
 /*                                                                  */ 00560000
 /* DEPENDENCIES     : NONE                                          */ 00570000
 /*                                                                  */ 00580000
 /* FREQUENCY        : USER DEPENDENT                                */ 00590000
 /*                                                                  */ 00600000
 /* MAINTENANCE LOG  :                                               */ 00610000
 /* ---------------                                                  */ 00620000
 /*                                                                  */ 00630000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00640000
 /* --------------------------------------------------------------   */ 00650000
 /* 1993-04-01| ----         | CEDS INITIAL DEVELOPMENT              */ 00660000
 /* 1993-12-09| CED0014      | USER EXIT FOR MABO ADDED              */ 00670000
 /* 1994-06-23| RA01077      | REMOVED MEASUREMENT_VALUE             */ 00680000
 /* 1994-11-15| RC01116      | STORE TYPE OF WARRANTY                */ 00690000
 /* 1995-09-27| RA01138      | CPP/S INTERFACE                       */ 00700000
 /*           | RB01140      | IMPROVE PERFORMANCE, TABLE CHANGES    */ 00710000
 /*           | RC01141      | IMPROVE MESSAGES                      */ 00720000
 /* 1995-10-24| PTM0772      | ALTER ZIP CODE PROCESSING      (DG)   */ 00730000
 /* 1995-11-20| PTM0771      | SEE PTM DESCRIPTION            (PD)   */ 00740000
 /* 1996-05-14| PTM0925      | OBSOLETE ADDRESES USED                */ 00750000
 /* 1996-11-21| PTM0997      | ALTER USER EXIT PROCESSING            */ 00760000
 /* 1997-04-11| PTM1036      | CORRECTED PROLOG                      */ 00770000
 /* 1999-07-06| RC01219      | DORO                                  */ 00780000
 /* 2000-06-29| PTM1328      | DISCARD MES ORDER OO SELECTION        */ 00790000
 /* 2001-02-19| PTM1344      | PERFORMANCE IMPROVEMENT               */ 00800000
 /* 2001-12-13| RB01232      | REMOVE MES PROCESSING                 */ 00810000
 /* 2004-08-04| RB01237      | PRIME INPUT DATA IN PARTS INTERFACE   */ 00820000
 /* 2004-08-04| RB01242      | SEQUENCE NUMBER FROM 7 TO 28 CHAR.    */ 00830000
 /* 2006-08-10| RC01273      | CPPS 'PER-CALL' EXCLUSION FOR BAU,    */ 00840000
 /*           |              | CHANGES FOR CEDS 3.3                  */ 00850000
 /* 2006-08-10| RA01275      | NETWORK NEIGHBOURHOOD +               */ 00860000
 /*           |              | PRIME INPUT DATA IN PARTS INTERFACE   */ 00870000
 /*           |              | (ALREADY DEVELOPED FOR RB01237)+      */ 00880000
 /*           |              | 'PER-CALL' EXCLUSION FOR PI           */ 00890000
 /*           |              | CHANGES FOR CEDS 3.3                  */ 00900000
 /* 2006-11-08| CEDS00000314 | PPT CALCULATION HANDLING FOR BAU + PI */ 00910000
 /*           |              | MACHINES.                             */ 00920000
 /*           |              | SWITCH_PI,SWITCH_BAU CONDITIONS AND   */ 00930000
 /*           |              | STATEMENTS ARE SWAPPED                */ 00940000
 /* 2006-11-13| RB01278      | CEDS (LENOVO)VENDOR COST ASSIGNMENT + */ 00950000
 /*           |              | FETCH PERCALL AND PREFERENCE OF       */ 00960000
 /*           |              | MACHINE WHEN FOUND IN BOTH BAU AND PI.*/ 00970000
 /* 2007-01-22| CEDS00000321 | IBM & LENOVO CONTRACT TO BE TREATED   */ 00980000
 /*           |              | DIFFERENTLY                           */ 00990000
 /* 2007-04-12| RB01281      | CHANGES FOR FLEXIBLE WARRANTY MACHINES*/ 01000000
 /* 2008-02-04| CEDS00000322 | TO FIX WRONG SLC'S VIA CEDS TO CPPS   */ 01010000
 /*           |              | PROBLEM                               */ 01020000
 /* 2008-02-28| RB01289      | PRIME INPUT CUSTOMER NUMBER           */ 01030000
 /* 2008-05-20| RB01290      | ACCEPT CONTRACTS ON INTERNAL MACHINES */ 01040000
 /* 2008-07-15| CEDS00000415 | HANDLED THE USEREXIT FLAGS            */ 01050000
 /* 2009-01-23| RB01298      | ALIGNMENT/CHANGES DUE TO HARD BUNDLE  */ 01060000
 /*           |              | IMPACT AND CHANGES TO MA STATUS       */ 01070000
 /*           |              | AND SERVICE DETAILS AS PART           */ 01080000
 /*           |              | OF TREC 39-40 AND                     */ 01090000
 /*           |              | CHANGES TO RCB063/RCB064 PARAMETERS   */ 01100000
 /*           |              | AS PART OF PCR-0014                   */ 01110000
 /* 2009-05-26| CEDS00000468 | CURSOR_PI_HW IS RESTRICTED TO         */ 01120000
 /*           |              | TYPE_OF_RELATION AS 'U' IN T190       */ 01130000
 /* 2010-03-29| CEDS00000515 | MA & SLC PRIORITY RULES CORRECTED     */ 01140000
 /* 2010-11-09| RC01311      | USE CORRECT OU-CODE PCR P10-0208      */ 01150000
 /* 2011-05-04| RC01313      | PCEDSP-0064: SOLVE DESIGN ERROR OF    */ 01160000
 /*           |              | PCR 208 IN ALL DOWNSTREAMS            */ 01170000
 /* 2012-02-29| RB01320      | CEDS 3.3 A17 RELEASE: SUPPORT FOR     */ 01180000
 /*           |              | LONG SERIAL IN DOWNSTREAMS            */ 01190000
 /* 2015-04-24| CEDS00000738 | T081567 : PERFORMANCE ISSUE FOR DP01  */ 01200000
 /*           |              | AND DC01 REAL_ORIGIN, REAL_SEQ_NUM ARE*/ 01210000
 /*           |              | ADDED TO T724 AND T734                */ 01220000
 /* 2015-07-26| CEDS00000764 | T081596: CHANGED CURSOR_HW_PI TO      */ 01231015
 /*           |              | IMPROVE PERFORMANCE                   */ 01233012
 /* 2015-08-04| RC01362      | PCR 0472 - TO REMOVE ASSIGNING OF     */ 01233128
 /*           |              | TOM TO G WHEN RCB103 PARAMETER IS SET */ 01233226
 /*           |              | TO Y FOR LENOVO MACHINES              */ 01233326
 /* 2016-06-20| CEDS00000795 | TEMEA-T080774: TO AVOID UNEXPECTED    */ 01233432
 /*           |              | PER-CALLIN CPPS INTERFACE             */ 01233530
 /*           |              |                                       */ 01234016
 /********************************************************************/ 01240000
1RCBDPBM: PROC                                                          01250000
          OPTIONS (MAIN)                                                01260000
          REORDER;                                                      01270000
 DEFAULT RANGE (*)        STATIC;                                       01280000
0/********************************************************************/ 01290000
 /* EXTERNAL ENTRIES                                                 */ 01300000
 /********************************************************************/ 01310000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01320000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 01330000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 01340000
 DCL RCB018M   ENTRY  EXTERNAL;          /* UPDATE HASH TOTAL        */ 01350000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01360000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01370000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01380000
 DCL RCBF50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01390000
 DCL RCBG50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01400000
 DCL RCBDP1U   ENTRY  EXTERNAL;          /* USER EXIT MABO           */ 01410000
 DCL RCBDP5U   ENTRY  EXTERNAL;          /* USER EXIT        RB01237 */ 01420000
 DCL RCBISRM   ENTRY  EXTERNAL;          /* RETRIEVE SLC     RA01275 */ 01430000
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 01440000
 DCL RCB004M   ENTRY  EXTERNAL;          /* DATE CALC ROUTINE        */ 01450000
0/********************************************************************/ 01460000
 /*  FILE DECLARATIONS                                               */ 01470000
 /********************************************************************/ 01480000
 DCL RCBDPB1        FILE         /* EXTRACT (CEDS)                   */ 01490000
                    RECORD                                              01500000
                    OUTPUT                                              01510000
                    SEQUENTIAL                                          01520000
                    ENV (FB RECSIZE(73));  /* RA01138 LENGTH CHANGED */ 01530000
1/********************************************************************/ 01540000
 /*  PARAMETERS                                                      */ 01550000
 /********************************************************************/ 01560000
 DCL PTR_INT_AREA        PTR;          /* INTERFACE AREA             */ 01570000
 DCL PTR_RETURN_AREA_BB  PTR;          /* RETURN AREA FROM BB        */ 01580000
 DCL PTR_COUNTRY_AREA    PTR;          /* INTERFACE RCB019M          */ 01590000
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 01600000
                                                                        01610000
0DCL 1 PARM_INT_AREA,                         /* INTERFACE AREA      */ 01620000
       %INCLUDE (RCBZ01S);;                                             01630000
0DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 01640000
       %INCLUDE (RCBZ02S);;                                             01650000
0DCL 1 COUNTRY_AREA,                          /* COUNTRY AREA        */ 01660000
       %INCLUDE (RCBZ26S);;                                             01670000
0DCL 1 RUN_DATE_AREA,                         /* RUN DATE AREA       */ 01680000
       %INCLUDE (RCBZ28S);;                                             01690000
                                                      /* SOC RB01237 */ 01700000
0DCL 1 PARM_RCB005,                           /* PI EXTRACT PARM     */ 01710000
      %INCLUDE (RCBP05S);;                                              01720000
                                                      /* EOC RA01275 */ 01730000
0DCL 1 PARM_RCBP63S,                                /* SOC : RB01281 */ 01740000
      %INCLUDE (RCBP63S);;            /* FLEXIBLE WARRANTY GEO LEVEL */ 01750000
                                                                        01760000
0DCL 1 PARM_RCBP64S,                  /* FLEXIBLE WARRANTY CTRY LEVL */ 01770000
      %INCLUDE (RCBP64S);;                          /* EOC : RB01281 */ 01780000
                                                                        01790000
                                                      /* EOC RB01237 */ 01800000
0DCL 1 PARM_RCBP67S,                          /* TPMNT TO MA_STATUS  */ 01810000
       %INCLUDE (RCBP67S);;                                             01820000
                                                      /* SOC RB01278 */ 01830000
0DCL 1 PARM_RCBP103S,                 /* SERVICE ON BEHALF OF VENDOR */ 01840000
      %INCLUDE (RCBP103S);;                                             01850000
                                                      /* EOC RB01278 */ 01860000
0DCL 1 PARM_USER_INFO,                        /* INTERFACE TO EXIT   */ 01870000
       %INCLUDE (RCBDP1S);;                                             01880000
0DCL 1 PARM_RCB024M,                          /* RCB024M PARM        */ 01890000
       %INCLUDE (RCBZ33S);;                                             01900000
                                                                        01910000
 DCL 1 PARM_RCBP70S,      /* TPMNT FOR INTERNAL MACHINES SOC RB01290 */ 01920000
       %INCLUDE (RCBP70S);;                           /* EOC RB01290 */ 01930000
                                               /* SOC RB01298         */01940000
 DCL 1 PARM_RCBP71S,                           /* TPMNT TO CE STATUS  */01950000
       %INCLUDE (RCBP71S);;                    /* COUNTRY DEVIATION   */01960000
                                                                        01970000
 DCL 1 PARM_DATE_CALC,                        /* DATE CALCULATION    */ 01980000
       %INCLUDE (RCBZ03S);;                                             01990000
                                               /* EOC RB01298         */02000000
                                                                        02010000
1/********************************************************************/ 02020000
 /* DB2 TABLE STRUCTURES                                             */ 02030000
 /********************************************************************/ 02040000
                                                      /* SOC RB01237 */ 02050000
0DCL 1 TB_RCBV011,                                                      02060000
      %INCLUDE (RCB011S);;                                              02070000
0DCL 1 TB_RCBV040,                                                      02080000
      %INCLUDE (RCB040S);;                                              02090000
                                                      /* EOC RB01237 */ 02100000
 /*------------------ START RA01138 CHANGES -------------------------*/ 02110000
0DCL 1 TB_RCBV125,                                    /* SOC RB01320 */ 02120000
      %INCLUDE (RCB125S);;                            /* EOC RB01320 */ 02130000
0DCL 1 TB_RCBV150,                                                      02140000
      %INCLUDE (RCB150S);;                                              02150000
0DCL 1 TB_RCBV150_I,                                                    02160000
      %INCLUDE (RCB150SI);;                                             02170000
 DCL 1 TB_RCBV240,                                  /* SOC RA01275   */ 02180000
      %INCLUDE (RCB240S);;                                              02190000
 DCL 1 TB_RCBV240_I,                                                    02200000
      %INCLUDE (RCB240SI);;                                             02210000
 DCL 1 TB_RCBV241,                                                      02220000
      %INCLUDE (RCB241S);;                                              02230000
 DCL 1 TB_RCBV241_I,                                                    02240000
      %INCLUDE (RCB241SI);;                         /* EOC : RA01275 */ 02250000
0DCL 1 TB_RCBV340,                                                      02260000
      %INCLUDE (RCB340S);;                                              02270000
0DCL 1 TB_RCBV340_I,                                                    02280000
      %INCLUDE (RCB340SI);;                                             02290000
 /* COMMENTED OUT AS PART OF PCEDSP-0064                 SOC RC01313 */ 02300000
0/*DCL 1 TB_RCBV350,                               */ /* SOC RC01311 */ 02310000
 /*    %INCLUDE (RCB350S);;                        */ /* EOC RC01311 */ 02320000
 /*                                                      EOC RC01313 */ 02330000
 /*-------------------- END RA01138 CHANGES -------------------------*/ 02340000
                                                      /* SOC RC01362 */ 02350025
 /*DCL 1 TB_RCBV400,                                 /* SOC : RB01278 */02351022
 /*   %INCLUDE (RCB400S);;                                              02360023
 DCL 1 TB_RCBV400_I,                                                    02370000
      %INCLUDE (RCB400SI);;                         /* EOC : RB01278 */ 02380023
                                                      /* EOC RC01362 */ 02381025
 DCL 1 TB_RCBV470,                                    /* SOC RA01275 */ 02390000
      %INCLUDE (RCB470S);;                                              02400000
 DCL 1 TB_RCBV470_I,                                                    02410000
      %INCLUDE (RCB470SI);;                           /* EOC RA01275 */ 02420000
0DCL 1 TB_RCBV500,                                                      02430000
      %INCLUDE (RCB500S);;                                              02440000
0DCL 1 TB_RCBV500_I,                                                    02450000
      %INCLUDE (RCB500SI);;                                             02460000
                                                      /* SOC RB01237 */ 02470000
0DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  02480000
      %INCLUDE (RCBP05S);;                                              02490000
                                                      /* EOC RB01237 */ 02500000
0DCL 1 TB_RCBP24S            BASED (ADDR(TB_RCBV500)),                  02510000
      %INCLUDE (RCBP24S);;                                              02520000
0DCL 1 TB_RCBP63S            BASED (ADDR(TB_RCBV500)),/* SOC RB01281 */ 02530000
      %INCLUDE (RCBP63S);;                                              02540000
0DCL 1 TB_RCBP64S            BASED (ADDR(TB_RCBV500)),                  02550000
      %INCLUDE (RCBP64S);;                            /* EOC RB01281 */ 02560000
0DCL 1 TB_RCBP67S            BASED (ADDR(TB_RCBV500)),                  02570000
      %INCLUDE (RCBP67S);;                                              02580000
 DCL 1 TB_RCBP39S            BASED (ADDR(TB_RCBV500)),  /*   RC01273 */ 02590000
      %INCLUDE (RCBP39S);;                              /*   RC01273 */ 02600000
                                                      /* SOC RC01362 */ 02601025
 /*DCL 1 TB_RCBP103S           BASED (ADDR(TB_RCBV500)),/*   RB01278 */ 02610020
 /*   %INCLUDE (RCBP103S);;                             /*   RB01278 */ 02620020
                                                      /* EOC RC01362 */ 02621025
                                                      /* SOC RB01290 */ 02630000
 DCL 1 TB_RCBP70S            BASED (ADDR(TB_RCBV500)),                  02640000
      %INCLUDE (RCBP70S);;                           /* EOC RB01290 */  02650000
                                                      /* SOC RB01298 */ 02660000
 DCL 1 TB_RCBP71S            BASED (ADDR(TB_RCBV500)),                  02670000
      %INCLUDE (RCBP71S);;                                              02680000
                                                      /* EOC RB01298 */ 02690000
                                                                        02700000
1/********************************************************************/ 02710000
 /* SELECT STRUCTURES                                                */ 02720000
 /********************************************************************/ 02730000
                                                      /* SOC RB01237 */ 02740000
0DCL 1 CURSOR_HW_PI_V051,                                               02750000
        %INCLUDE (RCB051S);;                                            02760000
0DCL 1 CURSOR_HW_PI_V241,                                               02770000
        %INCLUDE (RCB241S);;                                            02780000
                                                      /* EOC RB01237 */ 02790000
1DCL 1 CURSOR_HW_O_V040,                                                02800000
        %INCLUDE (RCB040S);;                                            02810000
0DCL 1 CURSOR_HW_O_V260,                                                02820000
        %INCLUDE (RCB260S);;                                            02830000
                                                                        02840000
1DCL 1 CURSOR_HW_I_V040,                                                02850000
        %INCLUDE (RCB040S);;                                            02860000
0DCL 1 CURSOR_HW_I_V110,                                                02870000
        %INCLUDE (RCB110S);;                                            02880000
0DCL 1 CURSOR_HW_I_V190,                                                02890000
        %INCLUDE (RCB190S);;                                            02900000
0DCL 1 CURSOR_HW_I_V220,                                                02910000
        %INCLUDE (RCB220S);;                                            02920000
0DCL 1 CURSOR_HW_I_V300,                                                02930000
        %INCLUDE (RCB300S);;                                            02940000
                                                                        02950000
1DCL 1 CURSOR_CUST_I_V150,                               /* PTM 0772 */ 02960000
      %INCLUDE (RCB150S);;                                              02970000
1/********************************************************************/ 02980000
 /*  RECORD STRUCTURES                                               */ 02990000
 /********************************************************************/ 03000000
 DCL 1 FILE_RCBDPB1,                                                    03010000
      3 PRODUCT_TYPE           CHAR(04),                                03020000
      3 ORIGIN                 CHAR(02),                                03030000
      3 SEQUENCE_NUMBER        CHAR(05),                                03040000
     2 RECORD_INFO,                                                     03050000
      %INCLUDE (RCBDPBS);;                                              03060000
                                                                        03070000
 DCL 1 USER_FILE_RCBDPB1 LIKE FILE_RCBDPB1;                             03080000
                                                      /* SOC RB01237 */ 03090000
 DCL 1 USER_FILE_BAU     LIKE FILE_RCBDPB1;                             03100000
 DCL 1 USER_FILE_PI      LIKE FILE_RCBDPB1;                             03110000
                                                      /* EOC RB01237 */ 03120000
 DCL 1 FILE_RCBDPB1_COPY,                                               03130000
      3 PRODUCT_TYPE           CHAR(04),                                03140000
      3 ORIGIN                 CHAR(02),                                03150000
      3 SEQUENCE_NUMBER        CHAR(05),                                03160000
     2 RECORD_INFO,                                                     03170000
      %INCLUDE (RCBDPBS);;                                              03180000
 DCL 1 FILE_RCBDPB1_H BASED(ADDR(FILE_RCBDPB1)),                        03190000
      %INCLUDE (RCBD01S);;                                              03200000
                                                                        03210000
1/********************************************************************/ 03220000
 /*  BIT SWITCHES                                                    */ 03230000
 /********************************************************************/ 03240000
 DCL 1 SWITCHES,                                                        03250000
                                                      /* SOC RB01237 */ 03260000
     3 SWITCH_BAU                BIT (1)   INIT ('0'B),                 03270000
     3 SWITCH_PI                 BIT (1)   INIT ('0'B),                 03280000
                                                      /* EOC RB01237 */ 03290000
     3 TRUE                      BIT (1)   INIT ('1'B),                 03300000
     3 FALSE                     BIT (1)   INIT ('0'B),                 03310000
     3 SWITCH_EOC_CURSOR_HW_O    BIT (1)   INIT ('0'B),                 03320000
     3 SWITCH_EOC_CURSOR_HW_I    BIT (1)   INIT ('0'B),                 03330000
     3 SWITCH_EOC_CURSOR_HW_PI   BIT (1)   INIT ('0'B),  /* RB01237 */  03340000
                                                    /* SOC : RC01273 */ 03350000
     3 EXCLUDE_PER_CALL          BIT (1)   INIT ('0'B),                 03360000
     3 PERCALL_TYPE_INST         BIT (1)   INIT ('0'B),                 03370000
                                                    /* EOC : RC01273 */ 03380000
                                                    /* SOC : RA01275 */ 03390000
     3 PERCALL_TYPE_PI           BIT (1)   INIT ('0'B),                 03400000
     3 SWITCH_NNHOOD             BIT (1)   INIT ('0'B),                 03410000
                                                    /* EOC : RA01275 */ 03420000
                                                    /* SOC : RB01289 */ 03430000
     3 SWITCH_CUST_NO_T190       BIT (1)   INIT ('0'B),                 03440000
     3 SWITCH_CUST_NO_T10        BIT (1)   INIT ('0'B),                 03450000
                                                    /* EOC : RB01289 */ 03460000
                                                      /* SOC RC01362 */ 03461025
 /*  3 SWITCH_VENDOR_SERVICE     BIT (1)   INIT ('0'B), /* RB01278 */   03470024
                                                      /* EOC RC01362 */ 03471025
     3 F_WARRANTY_MA_STATUS      BIT (1)   INIT ('0'B), /* RB01281 */   03480000
     3 F_WARRANTY_MA_STATUS_GEO  BIT (1)   INIT ('0'B), /* RB01281 */   03490000
     3 FLEXIBLE_WARRANTY_BAU     BIT (1)   INIT ('0'B), /* RB01281 */   03500000
                                                      /* SOC RB01298 */ 03510000
 /*  3 FLEXIBLE_WARRANTY_PI      BIT (1)   INIT ('0'B), /* RB01281 */   03520000
     3 SWITCH_MA_ST_COUNTRY              BIT (1)   INIT ('0'B),         03530000
     3 SWITCH_BRAND_BAU                  BIT (1)   INIT ('0'B),         03540000
     3 SWITCH_BRAND_PI                   BIT (1)   INIT ('0'B),         03550000
     3 SWITCH_FW_PI                      BIT (1)   INIT ('0'B),         03560000
     3 SWITCH_PERCALL_PI                 BIT (1)   INIT ('0'B),         03570000
     3 SWITCH_PERCALL_BAU                BIT (1)   INIT ('0'B),         03580000
     3 SWITCH_CONSIDER_PRT               BIT (1)   INIT ('0'B),         03590000
     3 PI_WARRANTY                       BIT (1)   INIT ('0'B),         03600000
     3 PI_CONTRACT                       BIT (1)   INIT ('0'B),         03610000
     3 BAU_INS_CONTRACT                  BIT (1)   INIT ('0'B),         03620000
     3 BAU_INS_WARRANTY                  BIT (1)   INIT ('0'B),         03630000
     3 BAU_ORD_CONTRACT                  BIT (1)   INIT ('0'B),         03640000
     3 PI_PPT                            BIT (1)   INIT ('0'B),         03650000
     3 BAU_PPT                           BIT (1)   INIT ('0'B),         03660000
                                                      /* EOC RB01298 */ 03670000
     3 SWITCH_TOM_INTERNAL_MACHINE BIT (1)   INIT ('0'B), /* RB01290 */ 03680000
     3 SWITCH_INTERNAL_MACHINE_CTR BIT (1)   INIT ('0'B); /* RB01290 */ 03690000
                                                                        03700000
 DCL 1 SWITCH_USER_EXIT          BIT (1)   ALIGNED   INIT ('1'B);       03710000
                                                    /* CEDS00000322  */ 03720000
 DCL 1 SWITCH_TO_T220_SLC        BIT (1)             INIT ('0'B);       03730000
                                                    /* CEDS00000322  */ 03740000
                                                                        03750000
                                                      /* SOC RB01237 */ 03760000
 DCL 1 SWITCH_USER_EXIT5         BIT (1)   INIT ('1'B);                 03770000
 DCL 1 DATA_ORIGIN               CHAR(1)   INIT ('');                   03780000
                                                      /* EOC RB01237 */ 03790000
0/********************************************************************/ 03800000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 03810000
 /********************************************************************/ 03820000
 DCL 1 WORK_FIELDS,                                                     03830000
    3 WRK_MOD_NAME                      CHAR (08)  INIT ('RCBDPBM'),    03840000
    3 WRK_PRG_NAME                      CHAR (08)  INIT ('RCBDPBP'),    03850000
    3 WRK_FILE_NAME                     CHAR (07)  INIT ('RCBDPB1'),    03860000
    3 WRK_SYSTEM_TYPE                   CHAR (01)  INIT ('B'),          03870000
    3 WRK_PROC_ID                       CHAR (04),                      03880000
    3 WRK_CTRYNO                        CHAR (03),                      03890000
    3 WRK_CTRYNO_NO                     FIXED BIN(15) INIT(1),          03900000
    3 WRK_PGR_TYPE                      CHAR (03),                      03910000
    3 WRK_RUN_DATE                      CHAR (10),                      03920000
    3 WRK_INDNULL                       FIXED BIN(15),                  03930000
    3 WRK_PRODUCT_TYPE                  CHAR(04),        /* RB01278 */  03940000
    3 WRK_ORIGIN                        CHAR(02) INIT(''),/* RB01320 */ 03950000
    3 WRK_SEQ_NO                        CHAR(28) INIT(''),/* RB01320 */ 03960000
                                                      /* SOC RA01275 */ 03970000
    3 WRK_NNHOOD_VALUE                  CHAR (01),                      03980000
    3 WRK_COMMENT_TEXT                  CHAR (60),                      03990000
    3 WRK_PRT_ONS_TIME_COM_1            CHAR (01),                      04000000
    3 WRK_FIX_TIME_COM_1                CHAR (01),                      04010000
 /* 3 WRK_CTRYUSE_TIME_COM_1            CHAR (01), */      /* RA01275 */04020000
    3 WRK_TURN_AROUND_COM_1             CHAR (01),         /* RA01275 */04030000
 /* 3 WRK_PPT_INDX                      PIC  '99',*/  /* CEDS00000314 */04040000
    3 WRK_PPT_INDX                      FIXED BIN(31) INIT(0),          04050000
                                                      /* CEDS00000314 */04060000
    3 WRK_PPT                           CHAR (02),                      04070000
    3 WRK_T051_SLC1_IND                 FIXED BIN(15),                  04080000
    3 WRK_T051_SLC2_IND                 FIXED BIN(15),                  04090000
    3 WRK_T051_SLCC_IND                 FIXED BIN(15),                  04100000
    3 WRK_T241_SLC_IND                  FIXED BIN(15),                  04110000
    3 WRK_IND_SPLT_DATE                 FIXED BIN(15),                  04120000
                                                      /* EOC RA01275 */ 04130000
                                                      /* SOC RB01237 */ 04140000
    3 WRK_IND_INST_DATE                 FIXED BIN(15),                  04150000
    3 WRK_IND_EXP_DATE                  FIXED BIN(15),                  04160000
    3 WRK_IND_OU                        FIXED BIN(15),                  04170000
    3 WRK_IND_TOW                       FIXED BIN(15),                  04180000
    3 WRK_IND_CUST                      FIXED BIN(15),                  04190000
    3 WRK_IND_EFF_DATE                  FIXED BIN(15),                  04200000
    3 WRK_IND_END_DATE                  FIXED BIN(15),                  04210000
    3 WRK_PI_ORIGIN                     CHAR (04),                      04220000
    3 WRK_PI_ORIGIN_TEMP                CHAR (04),        /* RB01289 */ 04230000
    3 WRK_SAV_CONTR_NR                  CHAR (15),                      04240000
                                                      /* EOC RB01237 */ 04250000
    3 WRK_HASH_TOTAL                    FIXED DEC(15) INIT(0),          04260000
    3 WRK_ORDER_NO                      CHAR (06),                      04270000
    3 WRK_TIME_STAMP                    CHAR (20),                      04280000
    3 WRK_CNT_COUNTRY                   FIXED BIN(31) INIT(0),          04290000
    3 WRK_CNT_RCBDPB1                   FIXED BIN(31) INIT(0),          04300000
    3 WRK_TPMNT_VAL,                                                    04310000
      %INCLUDE (RCBZ99S);,                                              04320000
    3 WRK_PIC_10                        PIC 'Z,ZZZ,ZZZ,ZZ9',            04330000
 /*------------------ START RA01138 CHANGES -------------------------*/ 04340000
    3 WRK_CUST_NUM_SAVE                 CHAR (08),                      04350000
 /*-------------------- END RA01138 CHANGES -------------------------*/ 04360000
 /*------------------ START PTM0772 CHANGES -------------------------*/ 04370000
    3 WRK_CUST_INST_SAVE                CHAR (08),                      04380000
    3 WRK_CUST_ORD_SAVE                 CHAR (08),                      04390000
 /*-------------------- END PTM0772 CHANGES -------------------------*/ 04400000
    3 WRK_CUSTOMER_NUMBER_V10           CHAR (08),     /*SOC RB01289 */ 04410000
    3 WRK_CUSTNO_V10_IND                FIXED BIN(15),                  04420000
    3 WRK_CUSTOMER_NUMBER_V11           CHAR (08),                      04430000
    3 WRK_CUSTNO_V11_IND                FIXED BIN(15),                  04440000
    3 WRK_CUSTOMER_NUMBER_V190          CHAR (08),                      04450000
    3 WRK_CUSTNO_V190_IND               FIXED BIN(15),                  04460000
    3 WRK_OU_CODE_V170                  CHAR (07),     /* SOC RC01311*/ 04470000
    3 WRK_OU_CODE_V170_IND              FIXED BIN(15),                  04480000
    3 WRK_REAL_BAU_INDNULL              FIXED BIN(15),/* SOC RB01320 */ 04490000
    3 WRK_REAL_PI_INDNULL               FIXED BIN(15),                  04500000
    3 WRK_REAL_ORD_INDNULL              FIXED BIN(15),/* EOC RB01320 */ 04510000
    3 WRK_PI_BAU_OU_CODE                CHAR (07),                      04520000
    3 WRK_PI_BAU_T040_MABO              CHAR (04),     /* EOC RC01311*/ 04530000
    3 WRK_V051_SOUR_IND                 FIXED BIN(15), /*EOC RB01289 */ 04540000
    3 WRK_OPEN_DATE_CH6                CHAR (06)  INIT ('999999'),      04550000
                                                      /* SOC RB01320 */ 04560000
 /* 3 WRK_OPEN_DATE_CH10               CHAR (10)  INIT ('9999-12-31');*/04570000
    3 WRK_OPEN_DATE_CH10               CHAR (10)  INIT ('9999-12-31'),  04580000
    3 WRK_REAL_SERIAL_NUM_BAU          CHAR (30)  INIT (''),            04590000
    3 WRK_REAL_SERIAL_NUM_PI           CHAR (30)  INIT (''),            04600000
    3 WRK_REAL_SERIAL_NUM_ORD          CHAR (30)  INIT ('');            04610000
                                                      /* EOC RB01320 */ 04620000
                                                      /* SOC RB01237 */ 04630000
 DCL 1 WRK_SAVE,                                                        04640000
      5 PRODUCT_TYPE                    CHAR(04),                       04650000
      5 ORIGIN                          CHAR(02),                       04660000
      5 SEQUENCE_NUMBER                 CHAR(05);                       04670000
                                                      /* EOC RB01237 */ 04680000
 DCL 1 SK_CURRENT_HW,                                                   04690000
      5 EOF                             CHAR(01),                       04700000
      5 PRODUCT_TYPE                    CHAR(04),                       04710000
      5 ORIGIN                          CHAR(02),                       04720000
      5 SEQUENCE_NUMBER                 CHAR(28),         /* RB01242 */ 04730000
      5 MODEL_NUMBER                    CHAR(03);                       04740000
 DCL 1 SK_CURRENT_HW_1   BASED(ADDR(SK_CURRENT_HW)) CHAR(35);           04750000
                                                                        04760000
 DCL 1 SK_HW_I LIKE SK_CURRENT_HW;                                      04770000
 DCL 1 SK_HW_I_1   BASED(ADDR(SK_HW_I)) CHAR(35);         /* RB01242 */ 04780000
                                                                        04790000
 DCL 1 SK_HW_O LIKE SK_CURRENT_HW;                                      04800000
 DCL 1 SK_HW_O_1   BASED(ADDR(SK_HW_O)) CHAR(35);         /* RB01242 */ 04810000
                                                      /* SOC RB01237 */ 04820000
 DCL 1 SK_HW_PI LIKE SK_CURRENT_HW;                                     04830000
 DCL 1 SK_HW_PI_1  BASED(ADDR(SK_HW_PI)) CHAR(35);        /* RB01242 */ 04840000
                                                      /* EOC RB01237 */ 04850000
                                                      /* SOC RB01290 */ 04860000
 DCL 1 WRK_TYPE_OF_CONTRACT            CHAR(10);                        04870000
 DCL 1 WRK_CONTRACT_NUMBER             CHAR(15);                        04880000
 DCL 1 WRK_TYPE_OF_CONTRACT_INDNULL    FIXED BIN(15);                   04890000
 DCL 1 WRK_CONTRACT_NUMBER_INDNULL     FIXED BIN(15);                   04900000
                                                      /* EOC RB01290 */ 04910000
 DCL 1 WRK_FWTOW           CHAR (01);                     /* RB01298 */ 04920000
1/********************************************************************/ 04930000
 /*  BUILTIN FUNCTIONS                                               */ 04940000
 /********************************************************************/ 04950000
 DCL (ADDR,                                                             04960000
     DATE,                                                              04970000
     NULL,                                                              04980000
     STRING,                                                            04990000
     SUBSTR,                                                            05000000
     STG,                                                               05010000
     TRANSLATE,                                                         05020000
     VERIFY,                                              /* RA01275 */ 05030000
     INDEX,                                               /* RA01275 */ 05040000
     TIME)                   BUILTIN;                                   05050000
0/********************************************************************/ 05060000
 /* ON ERROR CONDITIONS                                              */ 05070000
 /********************************************************************/ 05080000
  %INCLUDE (RCB0E0M);                                                   05090000
  END;                                                                  05100000
0/********************************************************************/ 05110000
 /* DB2/SQL SQLCA                                                    */ 05120000
 /********************************************************************/ 05130000
  EXEC SQL                                                              05140000
    INCLUDE SQLCA                                                       05150000
    ;                                                                   05160000
1/********************************************************************/ 05170000
 /* DB2/SQL CURSORS                                                  */ 05180000
 /********************************************************************/ 05190000
                                                      /* SOC RB01237 */ 05200000
                            /* CURSOR_HW_PI                          */ 05210000
                            /* RETRIEVE ALL CHANGED HW PRIME INPUT   */ 05220000
     /* DATES '3999-12-31' ARE PLACE-HOLDERS. A DATE FORMAT MUST BE  */ 05230000
     /* SELECTED FOR CERTAIN FIELDS. WHEN A ROW IS RETRIEVED, WITH   */ 05240000
     /* DATE '3999-12-31' THIS WILL BE BLANKED AND SET TO DB2 NULL.  */ 05250000
 EXEC SQL                                                               05260000
   DECLARE CURSOR_HW_PI CURSOR FOR                                      05270000
   SELECT                                                               05280000
          B.PRODUCT_TYPE                                                05290000
                                                      /* SOC RB01320 */ 05300000
       /*,B.ORIGIN                                                      05310000
         ,B.SEQUENCE_NUMBER  */                                         05320000
                                                 /* SOC CEDS00000764 */ 05321015
       /*,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   05330002
         ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM*/ 05340002
         ,A.ORIGIN                                                      05341002
         ,A.SEQUENCE_NUMBER                      /* EOC CEDS00000764 */ 05342015
                                                      /* EOC RB01320 */ 05350000
         ,'BOTH'                                                        05360000
         ,B.MODEL_NUMBER                                                05370000
         ,B.INSTALL_DATE                                                05380000
         ,B.TYPE_OF_MAINT                                               05390000
         ,B.TYPE_OF_WARRANTY                                            05400000
         ,B.WARRANTY_EXP_DATE                                           05410000
         ,B.SERVICE_LVL_CODE_1                        /* SOC RA01275 */ 05420000
         ,B.WARRANTY_SPLT_DATE                                          05430000
         ,B.SERVICE_LVL_CODE_2                                          05440000
         ,B.SERVICE_LVL_CODE_C                        /* EOC RA01275 */ 05450000
         ,B.CUSTOMER_NUMBER                                             05460000
         ,B.CUSTOMER_NR_EXTEND                                          05470000
         ,B.OU_CODE                                                     05480000
         ,B.SOURCE_INDICATOR                              /* RB01289 */ 05490000
         ,B.F_TYPE_OF_WARRANTY                            /* RB01281 */ 05500000
         ,C.CONTRACT_NUMBER                                             05510000
         ,C.AUTHORISATION_CODE                        /* CEDS00000321*/ 05520000
         ,C.SERVICE_LVL_CODE                           /* RA01275    */ 05530000
         ,C.EFFECTIVE_DATE                                              05540000
         ,C.END_DATE                                                    05550000
         ,D.CUSTOMER_NUMBER                           /* SOC RB01289 */ 05560000
         ,E.CUSTOMER_NUMBER                                             05570000
         ,F.CUSTOMER_NUMBER                                             05580000
         ,G.OU_CODE                                       /* RC01311 */ 05590000
                                                 /* SOC CEDS00000764 */ 05591015
      /* ,H.REAL_SERIAL_NUMBER                            /* RB01320 */ 05600004
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM          /* EOC CEDS00000764 */ 05601015
   FROM RCBV0725_PICOS_HW               A                               05610000
                                                      /* SOC RB01320 */ 05620000
                                                 /* SOC CEDS00000764 */ 05621015
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL H                                 05630002
     ON    A.PRODUCT_TYPE               = H.PRODUCT_TYPE                05640000
     AND   A.ORIGIN                     = H.DUMMY_ORIGIN                05650000
     AND   A.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM          05660000
     AND   A.COUNTRY_NUMBER             = H.COUNTRY_NUMBER */           05670002
                                                 /* EOC CEDS00000764 */ 05671015
                                                      /* EOC RB01320 */ 05680000
   INNER JOIN RCBV0051_PI_HW_PR         B                               05690000
                                                      /* SOC RB01320 */ 05700000
  /* ON  B.PRODUCT_TYPE         = A.PRODUCT_TYPE                        05710000
     AND B.ORIGIN               = A.ORIGIN                              05720000
     AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER */                  05730000
     ON    B.PRODUCT_TYPE               = A.PRODUCT_TYPE                05740003
                                                 /* SOC CEDS00000764 */ 05741015
  /* AND ((B.ORIGIN                     = A.ORIGIN                      05750003
     AND   B.SEQUENCE_NUMBER            = A.SEQUENCE_NUMBER)            05760000
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              05770000
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                05780000
     AND ((B.ORIGIN||B.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         05790000
     AND  (A.ORIGIN                     = H.DUMMY_ORIGIN                05800000
     AND   A.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))) */   05810002
     AND B.ORIGIN               = A.ORIGIN                              05811008
     AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER                     05812011
                                                 /* EOC CEDS00000764 */ 05813015
                                                      /* EOC RB01320 */ 05820000
     AND B.COUNTRY_NUMBER       = A.COUNTRY_NUMBER                      05830000
   INNER JOIN RCBV0241_PI_CTR           C                               05840000
     ON  B.PRODUCT_TYPE         = C.PRODUCT_TYPE                        05850009
     AND B.ORIGIN               = C.ORIGIN                              05860000
     AND B.SEQUENCE_NUMBER      = C.SEQUENCE_NUMBER                     05870000
     AND B.COUNTRY_NUMBER = C.COUNTRY_NUMBER                            05880009
   LEFT OUTER JOIN RCBV0010_CUSTOMER    D                               05890000
     ON  B.COUNTRY_NUMBER       = D.COUNTRY_NUMBER                      05900000
     AND B.CUSTOMER_NUMBER      = D.CUSTOMER_NUMBER                     05910000
     AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE          05920000
   LEFT OUTER JOIN RCBV0011_PI_CUST     E                               05930000
     ON  B.COUNTRY_NUMBER       = E.COUNTRY_NUMBER                      05940000
     AND B.CUSTOMER_NUMBER      = E.CUSTOMER_NUMBER                     05950000
     AND B.CUSTOMER_NR_EXTEND   = E.CUSTOMER_NR_EXTEND                  05960000
   LEFT OUTER JOIN RCBV0190_HW_CUST     F                               05970000
                                                       /* SOC RB01320 */05980000
 /*  ON  B.PRODUCT_TYPE         = F.PRODUCT_TYPE                        05990000
     AND B.ORIGIN               = F.ORIGIN                              06000000
     AND B.SEQUENCE_NUMBER      = F.SEQUENCE_NUMBER */                  06010000
                                                 /* SOC CEDS00000764 */ 06011015
 /*  ON    B.PRODUCT_TYPE               = F.PRODUCT_TYPE                06020002
     AND ((B.ORIGIN                     = F.ORIGIN                      06030000
     AND   B.SEQUENCE_NUMBER            = F.SEQUENCE_NUMBER)            06040000
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              06050000
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                06060000
     AND ((F.ORIGIN||F.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         06070000
     AND  (B.ORIGIN                     = H.DUMMY_ORIGIN                06080000
     AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))) */   06090002
     ON  F.PRODUCT_TYPE       = A.PRODUCT_TYPE                          06091002
     AND F.ORIGIN             = A.ORIGIN                                06092009
     AND F.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       06093009
     AND F.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                        06094002
                                                      /* EOC RB01320 */ 06100000
 /*  AND B.COUNTRY_NUMBER       = F.COUNTRY_NUMBER                      06110002
                                                 /* EOC CEDS00000764 */ 06111015
     AND F.TYPE_OF_RELATION     = 'U'                /* CEDS00000468 */ 06120000
     AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE          06130000
                                                                        06140000
   LEFT OUTER JOIN RCBV0170_OU_HW     G               /* SOC RC01311 */ 06150000
                                                      /* SOC RB01320 */ 06160000
   /*ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                          06170000
     AND B.ORIGIN             = G.ORIGIN                                06180000
     AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER */                    06190000
                                                 /* SOC CEDS00000764 */ 06191015
   /*ON    B.PRODUCT_TYPE               = G.PRODUCT_TYPE                06200002
     AND ((B.ORIGIN                     = G.ORIGIN                      06210000
     AND   B.SEQUENCE_NUMBER            = G.SEQUENCE_NUMBER)            06220000
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              06230000
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                06240000
     AND ((G.ORIGIN||G.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         06250000
     AND  (B.ORIGIN                     = H.DUMMY_ORIGIN                06260000
     AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))) */   06270002
                                                       /* EOC RB01320 */06280000
     ON  G.PRODUCT_TYPE       = A.PRODUCT_TYPE                          06281002
     AND G.ORIGIN             = A.ORIGIN                                06282009
     AND G.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       06283009
     AND G.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                        06284002
  /* AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                        06290002
                                                 /* EOC CEDS00000764 */ 06291015
     AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE          06300000
                                                      /* EOC RC01311 */ 06310000
   WHERE A.COUNTRY_NUMBER       = :WRK_CTRYNO                           06320000
     AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE          06330000
                                                      /* EOC RB01289 */ 06340000
 /*FROM RCBV0725_PICOS_HW    A                        /* SOC RB01289 */ 06350000
 /*    ,RCBV0051_PI_HW_PR    B                                          06360000
       ,RCBV0241_PI_CTR      C                                          06370000
   WHERE A.COUNTRY_NUMBER    = :WRK_CTRYNO                              06380000
                                                                        06390000
     AND B.COUNTRY_NUMBER    = A.COUNTRY_NUMBER                         06400000
     AND B.PRODUCT_TYPE      = A.PRODUCT_TYPE                           06410000
     AND B.ORIGIN            = A.ORIGIN                                 06420000
     AND B.SEQUENCE_NUMBER   = A.SEQUENCE_NUMBER                        06430000
                                                                        06440000
     AND C.COUNTRY_NUMBER    = B.COUNTRY_NUMBER                         06450000
     AND C.PRODUCT_TYPE      = B.PRODUCT_TYPE                           06460000
     AND C.ORIGIN            = B.ORIGIN                                 06470000
     AND C.SEQUENCE_NUMBER   = B.SEQUENCE_NUMBER                        06480000
     AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE                         06490000
                           AND C.END_DATE             /* EOC RB01289 */ 06500000
                                                                        06510000
   UNION                                                                06520000
                                                                        06530000
   SELECT                                                               06540000
          B.PRODUCT_TYPE                                                06550000
                                                       /* SOC RB01320 */06560000
       /*,B.ORIGIN                                                      06570000
         ,B.SEQUENCE_NUMBER  */                                         06580000
                                                 /* SOC CEDS00000764 */ 06581015
       /*,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   06590002
         ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM*/ 06600002
         ,A.ORIGIN                                                      06601002
         ,A.SEQUENCE_NUMBER                      /* EOC CEDS00000764 */ 06602015
                                                       /* EOC RB01320 */06610000
         ,'T051'                                                        06620000
         ,B.MODEL_NUMBER                                                06630000
         ,B.INSTALL_DATE                                                06640000
         ,B.TYPE_OF_MAINT                                               06650000
         ,B.TYPE_OF_WARRANTY                                            06660000
         ,B.WARRANTY_EXP_DATE                                           06670000
         ,B.SERVICE_LVL_CODE_1                         /* SOC RA01275 */06680000
         ,B.WARRANTY_SPLT_DATE                                          06690000
         ,B.SERVICE_LVL_CODE_2                                          06700000
         ,B.SERVICE_LVL_CODE_C                         /* EOC RA01275 */06710000
         ,B.CUSTOMER_NUMBER                                             06720000
         ,B.CUSTOMER_NR_EXTEND                                          06730000
         ,B.OU_CODE                                                     06740000
         ,B.SOURCE_INDICATOR                          /* RB01289 */     06750000
         ,B.F_TYPE_OF_WARRANTY                        /* RB01281 */     06760000
         ,''                                                            06770000
         ,''                                          /* CEDS00000321 */06780000
         ,''                                                            06790000
         ,DATE('3999-12-31')                                            06800000
         ,DATE('3999-12-31')                                            06810000
         ,D.CUSTOMER_NUMBER                            /* SOC RB01289 */06820000
         ,E.CUSTOMER_NUMBER                                             06830000
         ,F.CUSTOMER_NUMBER                                             06840000
         ,G.OU_CODE                                        /* RC01311 */06850000
                                                 /* SOC CEDS00000764 */ 06851015
      /* ,H.REAL_SERIAL_NUMBER                             /* RB01320 */06860005
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM          /* EOC CEDS00000764 */ 06861015
   FROM RCBV0725_PICOS_HW               A                               06870000
                                                       /* SOC RB01320 */06880000
                                                  /* SOC CEDS00000764 */06881015
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL H                                 06890002
     ON    A.PRODUCT_TYPE               = H.PRODUCT_TYPE                06900000
     AND   A.ORIGIN                     = H.DUMMY_ORIGIN                06910000
     AND   A.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM          06920000
     AND   A.COUNTRY_NUMBER             = H.COUNTRY_NUMBER */           06930002
                                                  /* EOC CEDS00000764 */06931015
                                                       /* EOC RB01320 */06940000
   INNER JOIN RCBV0051_PI_HW_PR         B                               06950000
                                                       /* SOC RB01320 */06960000
  /* ON  B.PRODUCT_TYPE         = A.PRODUCT_TYPE                        06970000
     AND B.ORIGIN               = A.ORIGIN                              06980000
     AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER  */                 06990000
     ON    B.PRODUCT_TYPE              = A.PRODUCT_TYPE                 07000003
                                                 /* SOC CEDS00000764 */ 07001015
  /* AND ((B.ORIGIN                    = A.ORIGIN                       07010003
     AND   B.SEQUENCE_NUMBER           = A.SEQUENCE_NUMBER)             07020000
     OR   (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER               07030000
     AND   B.PRODUCT_TYPE              = H.PRODUCT_TYPE                 07040000
     AND  (B.ORIGIN||B.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER           07050000
     AND  (A.ORIGIN                    = H.DUMMY_ORIGIN                 07060000
     AND   A.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM)))) */    07070002
     AND B.ORIGIN             = A.ORIGIN                                07071009
     AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER/* EOC CEDS00000764 */ 07072015
                                                       /* EOC RB01320 */07080000
     AND B.COUNTRY_NUMBER       = A.COUNTRY_NUMBER                      07090000
   LEFT OUTER JOIN RCBV0010_CUSTOMER    D                               07100000
     ON  B.COUNTRY_NUMBER       = D.COUNTRY_NUMBER                      07110000
     AND B.CUSTOMER_NUMBER      = D.CUSTOMER_NUMBER                     07120000
     AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE          07130000
   LEFT OUTER JOIN RCBV0011_PI_CUST     E                               07140000
     ON  B.COUNTRY_NUMBER       = E.COUNTRY_NUMBER                      07150000
     AND B.CUSTOMER_NUMBER      = E.CUSTOMER_NUMBER                     07160000
     AND B.CUSTOMER_NR_EXTEND   = E.CUSTOMER_NR_EXTEND                  07170000
   LEFT OUTER JOIN RCBV0190_HW_CUST     F                               07180000
                                                       /* SOC RB01320 */07190000
   /*ON  B.PRODUCT_TYPE         = F.PRODUCT_TYPE                        07200000
     AND B.ORIGIN               = F.ORIGIN                              07210000
     AND B.SEQUENCE_NUMBER      = F.SEQUENCE_NUMBER */                  07220000
                                                 /* SOC CEDS00000764 */ 07221015
  /* ON    B.PRODUCT_TYPE              = F.PRODUCT_TYPE                 07230002
     AND ((B.ORIGIN                    = F.ORIGIN                       07240000
     AND   B.SEQUENCE_NUMBER           = F.SEQUENCE_NUMBER)             07250000
     OR   (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER               07260000
     AND   B.PRODUCT_TYPE              = H.PRODUCT_TYPE                 07270000
     AND ((F.ORIGIN||F.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)          07280000
     AND  (B.ORIGIN                    = H.DUMMY_ORIGIN                 07290000
     AND   B.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM)))) */    07300002
     ON  F.PRODUCT_TYPE       = A.PRODUCT_TYPE                          07301002
     AND F.ORIGIN             = A.ORIGIN                                07302009
     AND F.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       07303009
     AND F.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                        07304002
                                                       /* EOC RB01320 */07310000
  /* AND B.COUNTRY_NUMBER       = F.COUNTRY_NUMBER                      07320002
                                                 /* EOC CEDS00000764 */ 07321015
     AND F.TYPE_OF_RELATION     = 'U'                 /* CEDS00000468 */07330000
     AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE          07340000
                                                                        07350000
   LEFT OUTER JOIN RCBV0170_OU_HW     G                /* SOC RC01311 */07360000
                                                       /* SOC RB01320 */07370000
  /* ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                          07380000
     AND B.ORIGIN             = G.ORIGIN                                07390000
     AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER */                    07400000
                                                 /* SOC CEDS00000764 */ 07401015
  /* ON    B.PRODUCT_TYPE              = G.PRODUCT_TYPE                 07410002
     AND ((B.ORIGIN                    = G.ORIGIN                       07420000
     AND   B.SEQUENCE_NUMBER           = G.SEQUENCE_NUMBER)             07430000
     OR   (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER               07440000
     AND   B.PRODUCT_TYPE              = H.PRODUCT_TYPE                 07450000
     AND ((G.ORIGIN||G.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)          07460000
     AND  (B.ORIGIN                    = H.DUMMY_ORIGIN                 07470000
     AND   B.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM))))*/     07480002
     ON  G.PRODUCT_TYPE       = A.PRODUCT_TYPE                          07481002
     AND G.ORIGIN             = A.ORIGIN                                07482009
     AND G.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       07483009
     AND G.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                        07484002
                                                       /* EOC RB01320 */07490000
  /* AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                        07500002
                                                 /* EOC CEDS00000764 */ 07501015
     AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE          07510000
                                                       /* EOC RC01311 */07520000
   WHERE A.COUNTRY_NUMBER       = :WRK_CTRYNO                           07530000
     AND (B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE OR                       07540000
         (B.TYPE_OF_MAINT IN ('3', '4', '5') AND                        07550000
          B.WARRANTY_EXP_DATE <= :WRK_RUN_DATE))       /* EOC RB01289 */07560000
                                                                        07570000
 /*FROM RCBV0725_PICOS_HW     A                        /* SOC RB01289 */07580000
 /*    ,RCBV0051_PI_HW_PR     B                                         07590000
   WHERE A.COUNTRY_NUMBER       = :WRK_CTRYNO                           07600000
                                                                        07610000
     AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                        07620000
     AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                          07630000
     AND B.ORIGIN             = A.ORIGIN                                07640000
     AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       07650000
 /*  AND B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE                 RB01278 */07660000
 /*  AND (B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE OR      /* SOC RB01278 */07670000
 /*      (B.TYPE_OF_MAINT IN ('3', '4', '5') AND                        07680000
          B.WARRANTY_EXP_DATE <= :WRK_RUN_DATE))       /* EOC RB01278 */07690000
                                                       /* EOC RB01289 */07700000
     AND NOT EXISTS                                                     07710000
        (SELECT *                                                       07720000
         FROM RCBV0241_PI_CTR      C                                    07730000
         WHERE C.COUNTRY_NUMBER    = :WRK_CTRYNO                        07740000
           AND C.PRODUCT_TYPE      = B.PRODUCT_TYPE                     07750000
           AND C.ORIGIN            = B.ORIGIN                           07760000
           AND C.SEQUENCE_NUMBER   = B.SEQUENCE_NUMBER                  07770000
                                                                        07780000
           AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE                   07790000
                                 AND C.END_DATE                         07800000
        )                                                               07810000
                                                                        07820000
   UNION                                                                07830000
                                                                        07840000
   SELECT                                                               07850000
          C.PRODUCT_TYPE                                                07860000
                                                     /* SOC RB01320 */  07870000
       /*,C.ORIGIN                                                      07880000
         ,C.SEQUENCE_NUMBER */                                          07890000
                                                 /* SOC CEDS00000764 */ 07891015
       /*,COALESCE(D.DUMMY_ORIGIN,C.ORIGIN) AS ORIGIN                   07900002
         ,COALESCE(D.DUMMY_SEQUENCE_NUM,C.SEQUENCE_NUMBER) AS SEQ_NUM*/ 07910002
         ,A.ORIGIN                                                      07911002
         ,A.SEQUENCE_NUMBER                      /* EOC CEDS00000764 */ 07912015
                                                     /* EOC RB01320 */  07920000
         ,'T241'                                                        07930000
         ,''                                                            07940000
         ,DATE('3999-12-31')                                            07950000
         ,''                                                            07960000
         ,''                                                            07970000
         ,DATE('3999-12-31')                                            07980000
         ,''                                                            07990000
         ,DATE('3999-12-31')                                            08000000
         ,''                                                            08010000
         ,''                                                            08020000
         ,C.CUSTOMER_NUMBER                                /* RB01289 */08030000
         ,''                                                            08040000
         ,''                                                            08050000
         ,''                                               /* RB01289 */08060000
         ,''                                                 /*RB01281*/08070000
         ,C.CONTRACT_NUMBER                                             08080000
         ,C.AUTHORISATION_CODE                        /* CEDS00000321 */08090000
         ,C.SERVICE_LVL_CODE                           /* RA01275    */ 08100000
         ,C.EFFECTIVE_DATE                                              08110000
         ,C.END_DATE                                                    08120000
         ,''                                           /* SOC RB01289 */08130000
         ,''                                                            08140000
         ,''                                           /* EOC RB01289 */08150000
         ,''                                               /* RC01311 */08160000
                                                 /* SOC CEDS00000764 */ 08161015
      /* ,D.REAL_SERIAL_NUMBER                             /* RB01320 */08170006
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM          /* EOC CEDS00000764 */ 08171015
 /*FROM RCBV0725_PICOS_HW    A                                          08180000
       ,RCBV0241_PI_CTR      C */                                       08190000
   FROM RCBV0241_PI_CTR      C                                          08200000
       ,RCBV0725_PICOS_HW    A                                          08210000
                                                 /* SOC CEDS00000764 */ 08220015
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL D                                 08230002
     ON    A.PRODUCT_TYPE    = D.PRODUCT_TYPE                           08240000
     AND   A.ORIGIN          = D.DUMMY_ORIGIN                           08250000
     AND   A.SEQUENCE_NUMBER = D.DUMMY_SEQUENCE_NUM                     08260000
     AND   A.COUNTRY_NUMBER  = D.COUNTRY_NUMBER */                      08270002
                                                 /* EOC CEDS00000764 */ 08271015
                                                       /* EOC RB01320 */08280000
   WHERE A.COUNTRY_NUMBER    = :WRK_CTRYNO                              08290000
                                                                        08300000
     AND C.COUNTRY_NUMBER    = A.COUNTRY_NUMBER                         08310000
     AND C.PRODUCT_TYPE      = A.PRODUCT_TYPE                           08320000
                                                       /* SOC RB01320 */08330000
  /* AND C.ORIGIN            = A.ORIGIN                                 08340000
     AND C.SEQUENCE_NUMBER   = A.SEQUENCE_NUMBER */                     08350000
                                                 /* SOC CEDS00000764 */ 08351015
  /* AND ((C.ORIGIN                = A.ORIGIN                           08360002
     AND   C.SEQUENCE_NUMBER       = A.SEQUENCE_NUMBER)                 08370000
     OR   (D.COUNTRY_NUMBER        = A.COUNTRY_NUMBER                   08380000
     AND   D.PRODUCT_TYPE          = C.PRODUCT_TYPE                     08390000
     AND  (D.REAL_SERIAL_NUMBER    = C.ORIGIN||C.SEQUENCE_NUMBER        08400000
     AND  (D.DUMMY_ORIGIN          = A.ORIGIN                           08410000
     AND   D.DUMMY_SEQUENCE_NUM    = A.SEQUENCE_NUMBER)))) */           08420002
     AND C.ORIGIN             = A.ORIGIN                                08421009
     AND C.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       08422009
                                                 /* EOC CEDS00000764 */ 08423015
                                                       /* EOC RB01320 */08430000
     AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE                         08440000
                           AND C.END_DATE                               08450000
                                                                        08460000
     AND NOT EXISTS                                                     08470000
        (SELECT *                                                       08480000
         FROM RCBV0051_PI_HW_PR    B                                    08490000
         WHERE B.COUNTRY_NUMBER    = :WRK_CTRYNO                        08500000
           AND B.PRODUCT_TYPE      = C.PRODUCT_TYPE                     08510000
           AND B.ORIGIN            = C.ORIGIN                           08520000
           AND B.SEQUENCE_NUMBER   = C.SEQUENCE_NUMBER                  08530000
        )                                                               08540000
                                                                        08550000
   ORDER BY 1                                                           08560000
           ,2                                                           08570000
           ,3                                                           08580000
   FOR FETCH ONLY                                                       08590000
           ;                                                            08600000
                                                      /* EOC RB01237 */ 08610000
0/********************************************************************/ 08620000
                            /* CURSOR_HW_O                           */ 08630000
                            /* RETRIEVE ALL CHANGED HW ON ORDER      */ 08640000
 EXEC SQL                                                               08650000
   DECLARE CURSOR_HW_O CURSOR FOR                                       08660000
   SELECT DISTINCT                                                      08670000
          B.PRODUCT_TYPE                                                08680000
                                                      /* SOC RB01320 */ 08690000
         ,COALESCE(D.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   08700000
         ,COALESCE(D.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   08710000
       /*,B.ORIGIN                                                      08720000
         ,B.SEQUENCE_NUMBER */                                          08730000
                                                      /* EOC RB01320 */ 08740000
         ,B.MODEL_NUMBER                                                08750000
         ,B.CUSTOMER_USER                                               08760000
         ,B.ORDER_REF_NUMBER                                            08770000
         ,B.DP_SYSTEM_NUMBER                                            08780000
         ,B.OU_CODE                                                     08790000
         ,B.SCHED_COMPL_DATE                                            08800000
         ,B.TYPE_OF_MAINT                                               08810000
         ,B.TYPE_OF_WARRANTY                                            08820000
         ,B.ORDER_DATE                                                  08830000
         ,B.END_DATE                                                    08840000
         ,C.MABO                                                        08850000
         ,D.REAL_SERIAL_NUMBER                             /* RB01320 */08860000
 /*FROM RCBV0725_PICOS_HW    A                                          08870000
       ,RCBV0260_HW_IN_ORD   B  */                                      08880000
   FROM RCBV0260_HW_IN_ORD   B                         /* EOC RB01320 */08890000
       ,RCBV0040_OU          C                                          08900000
       ,RCBV0725_PICOS_HW    A                         /* SOC RB01320 */08910000
                                                                        08920000
   LEFT OUTER JOIN RCBV0125_DMMY_REAL D                                 08930000
     ON    A.PRODUCT_TYPE       = D.PRODUCT_TYPE                        08940000
     AND   A.ORIGIN             = D.DUMMY_ORIGIN                        08950000
     AND   A.SEQUENCE_NUMBER    = D.DUMMY_SEQUENCE_NUM                  08960000
     AND   A.COUNTRY_NUMBER     = D.COUNTRY_NUMBER     /* EOC RB01320 */08970000
                                                                        08980000
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            08990000
                                                                        09000000
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       09010000
     AND B.ORDER_REF_NUMBER    = A.ORDER_REF_NUMBER                     09020000
     AND B.END_DATE           >= :WRK_RUN_DATE                          09030000
                                                                        09040000
     AND C.COUNTRY_NUMBER      = B.COUNTRY_NUMBER                       09050000
     AND C.OU_CODE             = B.OU_CODE                              09060000
                                                                        09070000
   ORDER BY B.PRODUCT_TYPE     ASC                                      09080000
                                                       /* SOC RB01320 */09090000
           ,ORIGIN             ASC                                      09100000
           ,SEQ_NUM            ASC                                      09110000
       /*  ,B.ORIGIN           ASC                                      09120000
           ,B.SEQUENCE_NUMBER  ASC */                 /* EOC RB01320 */ 09130000
           ,B.MODEL_NUMBER     ASC                                      09140000
           ,B.ORDER_REF_NUMBER ASC                                      09150000
   FOR FETCH ONLY                                         /* RC01219 */ 09160000
           ;                                                            09170000
0/********************************************************************/ 09180000
                                         /* CURSOR_HW_I              */ 09190000
                            /* RETRIEVE ALL CHANGED HW INSTALLED     */ 09200000
 EXEC SQL                                                               09210000
   DECLARE CURSOR_HW_I CURSOR FOR                                       09220000
   SELECT DISTINCT                                                      09230000
          B.PRODUCT_TYPE                                                09240000
                                                      /* SOC RB01320 */ 09250000
         ,A.ORIGIN                               /* SOC CEDS00000738 */ 09260000
         ,A.SEQUENCE_NUMBER                                             09270000
      /* ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   09280000
      /* ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   09290000
                                                 /* EOC CEDS00000738 */ 09300000
      /* ,B.ORIGIN                                                      09310000
         ,B.SEQUENCE_NUMBER */                                          09320000
                                                      /* EOC RB01320 */ 09330000
         ,B.MODEL_NUMBER                                                09340000
         ,C.CUSTOMER_NUMBER                                             09350000
         ,C.MARKETING_INSTDAT                                           09360000
         ,D.STATUS                                                      09370000
         ,F.OU_CODE                                                     09380000
         ,F.MABO                                                        09390000
         ,G.TYPE_OF_MAINT                                               09400000
         ,G.TYPE_OF_WARRANTY                                            09410000
         ,G.SERVICE_LVL_CODE                              /* RA01275 */ 09420000
         ,G.WARRANTY_EXP_DATE                             /* RB01281 */ 09430000
         ,G.F_TYPE_OF_WARRANTY                            /* RB01281 */ 09440000
         ,G.F_SPLT_DATE                                   /* RB01281 */ 09450000
         ,G.SOURCE_INDICATOR                              /* RB01290 */ 09460000
         ,G.SERVICE_LVL_CODE_2                            /* RB01298 */ 09470000
                                                 /* SOC CEDS00000738 */ 09480000
      /* ,H.REAL_SERIAL_NUMBER                            /* RB01320 */ 09490000
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM          /* EOC CEDS00000738 */ 09500014
                                                                        09510000
 /*FROM RCBV0725_PICOS_HW    A                                          09520000
       ,RCBV0300_HW_REAL     B */                                       09530000
                                                 /* SOC CEDS00000738 */ 09540000
 /*FROM RCBV0300_HW_REAL     B                        /* EOC RB01320 */ 09550000
 /*    ,RCBV0190_HW_CUST     C                                          09560000
 /*    ,RCBV0110_HW_STATUS   D                                          09570000
 /*    ,RCBV0170_OU_HW       E                                          09580000
 /*    ,RCBV0040_OU          F                                          09590000
 /*    ,RCBV0220_SUPPL_CTR   G                                          09600000
 /*    ,RCBV0725_PICOS_HW    A                        /* SOC RB01320 */ 09610000
   FROM RCBV0725_PICOS_HW    A                                          09620000
                                                                        09630000
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL H                                 09640000
 /*  ON    A.PRODUCT_TYPE       = H.PRODUCT_TYPE                        09650000
 /*  AND   A.ORIGIN             = H.DUMMY_ORIGIN                        09660000
 /*  AND   A.SEQUENCE_NUMBER    = H.DUMMY_SEQUENCE_NUM                  09670000
 /*  AND   A.COUNTRY_NUMBER     = H.COUNTRY_NUMBER    /* EOC RB01320 */ 09680000
                                                                        09690000
 /*WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            09700000
 /*  AND A.ORDER_REF_NUMBER    = '      '        /* EOC CEDS00000738 */ 09710000
                                                                        09720000
                                                       /* SOC RB01320 */09730000
  /* AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE                         09740000
     AND B.ORIGIN              = A.ORIGIN                               09750000
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER */                   09760000
     INNER JOIN RCBV0300_HW_REAL     B           /* SOC CEDS00000738 */ 09770000
  /* AND   B.PRODUCT_TYPE       = A.PRODUCT_TYPE */                     09780000
     ON    B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        09790000
  /* AND ((B.ORIGIN             = A.ORIGIN                              09800000
  /* AND   B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    09810000
  /* OR   (H.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      09820000
  /* AND   H.PRODUCT_TYPE       = B.PRODUCT_TYPE                        09830000
  /* AND  (H.REAL_SERIAL_NUMBER = B.ORIGIN||B.SEQUENCE_NUMBER           09840000
  /* AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              09850000
  /* AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              09860000
     AND B.ORIGIN             = A.REAL_ORIGIN                           09870000
     AND B.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM   /* EOC CEDS00000738 */ 09880000
                                                       /* EOC RB01320 */09890000
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       09900000
     AND :WRK_RUN_DATE         BETWEEN B.EFFECTIVE_DATE                 09910000
                                   AND B.END_DATE                       09920000
                                                                        09930000
     INNER JOIN RCBV0190_HW_CUST     C           /* SOC CEDS00000738 */ 09940000
  /* AND C.PRODUCT_TYPE        = A.PRODUCT_TYPE */                      09950000
     ON  C.PRODUCT_TYPE        = A.PRODUCT_TYPE  /* EOC CEDS00000738 */ 09960000
                                                       /* SOC RB01320 */09970000
  /* AND C.ORIGIN              = A.ORIGIN                               09980000
     AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER */                   09990000
  /* AND ((C.ORIGIN             = A.ORIGIN */    /* SOC CEDS00000738 */ 10000000
  /* AND   C.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    10010000
  /* OR   (H.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      10020000
  /* AND   H.PRODUCT_TYPE       = C.PRODUCT_TYPE                        10030000
  /* AND  (H.REAL_SERIAL_NUMBER = C.ORIGIN||C.SEQUENCE_NUMBER           10040000
  /* AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              10050000
  /* AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              10060000
     AND C.ORIGIN             = A.REAL_ORIGIN                           10070000
     AND C.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM    /* EOC CEDS00000738 */10080000
                                                       /* EOC RB01320 */10090000
     AND C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       10100000
     AND C.TYPE_OF_RELATION    = 'U'                                    10110000
     AND :WRK_RUN_DATE         BETWEEN C.EFFECTIVE_DATE                 10120000
                                   AND C.END_DATE                       10130000
                                                                        10140000
     INNER JOIN RCBV0110_HW_STATUS   D            /* SOC CEDS00000738 */10150000
  /* AND D.PRODUCT_TYPE        = A.PRODUCT_TYPE */                      10160000
     ON  D.PRODUCT_TYPE        = A.PRODUCT_TYPE   /* EOC CEDS00000738 */10170000
                                                       /* SOC RB01320 */10180000
  /* AND D.ORIGIN              = A.ORIGIN                               10190000
     AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER */                   10200000
  /* AND ((D.ORIGIN             = A.ORIGIN  */    /* SOC CEDS00000738 */10210000
  /* AND   D.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    10220000
  /* OR   (H.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      10230000
  /* AND   H.PRODUCT_TYPE       = D.PRODUCT_TYPE                        10240000
  /* AND  (H.REAL_SERIAL_NUMBER = D.ORIGIN||D.SEQUENCE_NUMBER           10250000
  /* AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              10260000
  /* AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              10270000
     AND D.ORIGIN             = A.REAL_ORIGIN                           10280000
     AND D.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM    /* EOC CEDS00000738 */10290000
                                                       /* EOC RB01320 */10300000
     AND D.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       10310000
     AND :WRK_RUN_DATE         BETWEEN D.EFFECTIVE_DATE                 10320000
                                   AND D.END_DATE                       10330000
                                                                        10340000
     INNER JOIN RCBV0170_OU_HW       E            /* SOC CEDS00000738 */10350000
  /* AND E.PRODUCT_TYPE        = A.PRODUCT_TYPE */                      10360000
     ON  E.PRODUCT_TYPE        = A.PRODUCT_TYPE   /* EOC CEDS00000738 */10370000
                                                       /* SOC RB01320 */10380000
 /*  AND E.ORIGIN              = A.ORIGIN                               10390000
     AND E.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER */                   10400000
 /*  AND ((E.ORIGIN             = A.ORIGIN */     /* SOC CEDS00000738 */10410000
 /*  AND   E.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    10420000
 /*  OR   (H.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      10430000
 /*  AND   H.PRODUCT_TYPE       = E.PRODUCT_TYPE                        10440000
 /*  AND  (H.REAL_SERIAL_NUMBER = E.ORIGIN||E.SEQUENCE_NUMBER           10450000
 /*  AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              10460000
 /*  AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER))))*/               10470000
     AND E.ORIGIN             = A.REAL_ORIGIN                           10480000
     AND E.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM    /* EOC CEDS00000738 */10490000
                                                       /* EOC RB01320 */10500000
     AND E.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       10510000
     AND :WRK_RUN_DATE         BETWEEN E.EFFECTIVE_DATE                 10520000
                                   AND E.END_DATE                       10530000
                                                                        10540000
     INNER JOIN RCBV0040_OU          F            /* SOC CEDS00000738 */10550000
  /* AND F.COUNTRY_NUMBER      = E.COUNTRY_NUMBER */                    10560000
     ON  F.COUNTRY_NUMBER      = E.COUNTRY_NUMBER /* EOC CEDS00000738 */10570000
     AND F.OU_CODE             = E.OU_CODE                              10580000
     INNER JOIN RCBV0220_SUPPL_CTR   G            /* SOC CEDS00000738 */10590000
  /* AND G.PRODUCT_TYPE        = A.PRODUCT_TYPE  */                     10600000
     ON  G.PRODUCT_TYPE        = A.PRODUCT_TYPE   /* EOC CEDS00000738 */10610000
                                                       /* SOC RB01320 */10620000
  /* AND G.ORIGIN              = A.ORIGIN                               10630000
     AND G.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER */                   10640000
  /* AND ((G.ORIGIN             = A.ORIGIN */     /* SOC CEDS00000738 */10650000
  /* AND   G.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    10660000
  /* OR   (H.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      10670000
  /* AND   H.PRODUCT_TYPE       = G.PRODUCT_TYPE                        10680000
  /* AND  (H.REAL_SERIAL_NUMBER = G.ORIGIN||G.SEQUENCE_NUMBER           10690000
  /* AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              10700000
  /* AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              10710000
     AND G.ORIGIN             = A.REAL_ORIGIN                           10720000
     AND G.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM    /* EOC CEDS00000738 */10730000
                                                       /* EOC RB01320 */10740000
     AND G.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       10750000
     AND :WRK_RUN_DATE         BETWEEN G.EFFECTIVE_DATE                 10760000
                                   AND G.END_DATE                       10770000
                                                  /* SOC CEDS00000738 */10780000
     WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                          10790000
       AND A.ORDER_REF_NUMBER    = '      '       /* EOC CEDS00000738 */10800000
                                                                        10810000
   ORDER BY B.PRODUCT_TYPE                                              10820000
                                                       /* SOC RB01320 */10830000
        /* ,ORIGIN   */                           /* SOC CEDS00000738 */10840000
        /* ,SEQ_NUM  */                                                 10850000
           ,A.ORIGIN                                                    10860000
           ,A.SEQUENCE_NUMBER                     /* EOC CEDS00000738 */10870000
        /* ,B.ORIGIN                                                    10880000
           ,B.SEQUENCE_NUMBER */                                        10890000
                                                       /* EOC RB01320 */10900000
           ,B.MODEL_NUMBER                                              10910000
   FOR FETCH ONLY                                         /* RC01219 */ 10920000
           ;                                                            10930000
0/********************************************************************/ 10940000
                            /* CURSOR_CUST_I          PTM 0772       */ 10950000
                            /* RETRIEVE ZIP CODE FOR CUSTOMER        */ 10960000
 EXEC SQL                                                               10970000
   DECLARE CURSOR_CUST_I CURSOR FOR                                     10980000
         SELECT ZIP_CODE                                                10990000
               ,CUSTOMER_NUMBER                                         11000000
               ,ADDRESS_NUMBER                                          11010000
         FROM RCBV0150_CUST_ADDR                                        11020000
         WHERE CUSTOMER_NUMBER     = :WRK_CUST_NUM_SAVE                 11030000
           AND ADDRESS_MASK        LIKE '__1%'                          11040000
           AND COUNTRY_NUMBER      = :WRK_CTRYNO                        11050000
           AND END_DATE            >= :WRK_RUN_DATE                     11060000
   ORDER BY CUSTOMER_NUMBER                                             11070000
           ,ADDRESS_NUMBER                                              11080000
   FOR FETCH ONLY                                         /* RC01219 */ 11090000
                 ;                                                      11100000
1/********************************************************************/ 11110000
 /*                 S T A R T   P R O C E S S I N G                  */ 11120000
 /********************************************************************/ 11130000
                                                                        11140000
 CALL R900_INIT_PROGRAM;                                                11150000
                                  /***********************************/ 11160000
                                  /* PROCESS ALL COUNTRIES ASKED FOR */ 11170000
                                  /***********************************/ 11180000
 DO WHILE (WRK_CTRYNO_NO <= COUNTRY_AREA.COUNT_CTRY);                   11190000
                                                                        11200000
   CALL R700_INIT_COUNTRY;                                              11210000
                                  /***********************************/ 11220000
                                  /* PROCESS ALL CHANGED HW FOR CTRY */ 11230000
                                  /***********************************/ 11240000
                                                      /* SOC RB01237 */ 11250000
   DO WHILE ( ¬SWITCH_EOC_CURSOR_HW_I                                   11260000
            | ¬SWITCH_EOC_CURSOR_HW_O                                   11270000
            | ¬SWITCH_EOC_CURSOR_HW_PI);                                11280000
                                                                        11290000
     CALL R600_INIT_CURR_HW;            /* INITIALIZE CURRENT  KEY   */ 11300000
    /*  SELECT; */                                                      11310000
                                                                        11320000
     IF SK_HW_I_1 < SK_HW_O_1          /* INSTAL. SMALLER ON-ORDER  */  11330000
     THEN DO;                                                           11340000
       IF SK_HW_I_1 < SK_HW_PI_1 THEN   /* INSTALLED IS SMALLEST KEY*/  11350000
         DO;                                             /* RA01275 */  11360000
           CALL R102_PROC_HW_I;          /* PROCESS HW INSTALLED    */  11370000
           CALL R699_END_CURR_HW;                    /* SOC RA01275 */  11380000
           CALL R204_FETCH_CURSOR_HW_I;                                 11390000
         END;                                        /* EOC RA01275 */  11400000
       ELSE DO;                                                         11410000
         IF SK_HW_PI_1 < SK_HW_I_1 THEN /* PRIM.INP. IS SMALLEST KEY*/  11420000
           DO;                                                          11430000
            CALL R106_PROC_HW_PI;        /* PROCESS HW PRIME INPUT  */  11440000
            CALL R699_END_CURR_HW;                   /* SOC RA01275 */  11450000
            CALL R224_FETCH_CURSOR_HW_PI;                               11460000
           END;                                      /* EOC RA01275 */  11470000
         ELSE DO;                       /* INST. AND PI IS SAME KEY  */ 11480000
           CALL R102_PROC_HW_I;         /* PROCESS HW INSTALLED      */ 11490000
           CALL R106_PROC_HW_PI;        /* PROCESS HW PRIME INPUT    */ 11500000
           CALL R699_END_CURR_HW;                     /* SOC RA01275 */ 11510000
           CALL R204_FETCH_CURSOR_HW_I;                                 11520000
           CALL R224_FETCH_CURSOR_HW_PI;              /* EOC RA01275 */ 11530000
         END;                                                           11540000
       END;                                                             11550000
     END;                                                               11560000
     ELSE DO;                                                           11570000
       IF SK_HW_O_1 < SK_HW_I_1         /* ON-ORDER SMALLER INSTAL.  */ 11580000
       THEN DO;                                                         11590000
         IF SK_HW_O_1 < SK_HW_PI_1 THEN /* ON-ORDER  IS SMALLEST KEY */ 11600000
           DO;                                            /* RA01275 */ 11610000
            CALL R104_PROC_HW_O;         /* PROCESS HW ON-ORDER      */ 11620000
            CALL R699_END_CURR_HW;                    /* SOC RA01275 */ 11630000
            CALL R214_FETCH_CURSOR_HW_O;                                11640000
           END;                                       /* EOC RA01275 */ 11650000
         ELSE DO;                                                       11660000
           IF SK_HW_PI_1 < SK_HW_O_1 THEN     /* PI. IS SMALLEST KEY */ 11670000
             DO;                                          /* RA01275 */ 11680000
              CALL R106_PROC_HW_PI;     /* PROCESS HW PRIME INPUT    */ 11690000
              CALL R699_END_CURR_HW;                  /* SOC RA01275 */ 11700000
              CALL R224_FETCH_CURSOR_HW_PI;                             11710000
             END;                                     /* EOC RA01275 */ 11720000
           ELSE DO;                     /* ON-ORD.AND PI IS SAME KEY */ 11730000
             CALL R104_PROC_HW_O;       /* PROCESS HW ON-ORDER       */ 11740000
             CALL R106_PROC_HW_PI;      /* PROCESS HW PRIME INPUT    */ 11750000
             CALL R699_END_CURR_HW;                   /* SOC RA01275 */ 11760000
             CALL R214_FETCH_CURSOR_HW_O;                               11770000
             CALL R224_FETCH_CURSOR_HW_PI;            /* EOC RA01275 */ 11780000
           END;                                                         11790000
         END;                                                           11800000
       END;                                                             11810000
       ELSE DO;                         /* INST.AND ON-ORD. SAME KEY */ 11820000
         IF SK_HW_PI_1 = SK_HW_I_1      /* PRIME INPUT ALSO SAME KEY */ 11830000
         THEN DO;                       /* ALL KEYS THE SAME         */ 11840000
           CALL R102_PROC_HW_I;         /* PROCESS BOTH HW INST/ORD. */ 11850000
           CALL R106_PROC_HW_PI;        /* PROCESS HW PRIME INPUT    */ 11860000
           CALL R699_END_CURR_HW;                     /* SOC RA01275 */ 11870000
           CALL R204_FETCH_CURSOR_HW_I;                                 11880000
           CALL R224_FETCH_CURSOR_HW_PI;              /* EOC RA01275 */ 11890000
         END;                                                           11900000
         ELSE DO;                                                       11910000
           IF SK_HW_PI_1 < SK_HW_I_1                                    11920000
           THEN                               /* PI. IS SMALLEST KEY */ 11930000
           DO;                                            /* RA01275 */ 11940000
             CALL R106_PROC_HW_PI;      /* PROCESS HW PRIME INPUT    */ 11950000
             CALL R699_END_CURR_HW;                   /* SOC RA01275 */ 11960000
             CALL R224_FETCH_CURSOR_HW_PI;                              11970000
           END;                                       /* EOC RA01275 */ 11980000
           ELSE                         /* INST. AND ORDER SMALL KEY */ 11990000
           DO;                                            /* RA01275 */ 12000000
             CALL R102_PROC_HW_I;       /* PROCESS BOTH HW INST/ORD. */ 12010000
             CALL R699_END_CURR_HW;                   /* SOC RA01275 */ 12020000
             CALL R204_FETCH_CURSOR_HW_I;                               12030000
           END;                                       /* EOC RA01275 */ 12040000
         END;                                                           12050000
       END;                                                             12060000
     END;                                                               12070000
                                                      /* EOC RB01237 */ 12080000
   END;                                                                 12090000
                                                                        12100000
   CALL R799_END_COUNTRY;                                               12110000
                                                                        12120000
 END;                                                                   12130000
                                                                        12140000
 CALL R999_END_PROGRAM;                                                 12150000
                                                                        12160000
1/********************************************************************/ 12170000
 /*                                                      SOC RB01327 */ 12180000
 /* MODULE NAME      :  R102_PROC_HW_I                               */ 12190000
 /*                                                                  */ 12200000
 /* DESCRIPTION      : PROCESS HARDWARE INSTALLED                    */ 12210000
 /*                                                                  */ 12220000
 /********************************************************************/ 12230000
 R102_PROC_HW_I: PROC;                                                  12240000
                                                                        12250000
 IF ¬ PERCALL_TYPE_INST THEN                          /*  RC01273    */ 12260000
   DO;                                                /*  RC01273    */ 12270000
                                                      /* SOC RA01138 */ 12280000
    WRK_CUST_NUM_SAVE = WRK_CUST_INST_SAVE;           /*   PTM 0772  */ 12290000
                                                      /* SOC RB01320 */ 12300000
    IF WRK_REAL_BAU_INDNULL = -1 THEN                                   12310000
    DO;                                                                 12320000
      WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                               12330000
      WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                      12340000
    END;                                                                12350000
    ELSE                                                                12360000
    DO;                                                                 12370000
      WRK_ORIGIN  = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,1,2);                12380000
      WRK_SEQ_NO  = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,3);                  12390000
    END;                                              /* EOC RB01320 */ 12400000
    CALL R252_RETR_ADD_ADDR_INFO;                     /* EOC RA01138 */ 12410000
    CALL R202_FILL_RCBDPB1_I;                                           12420000
   END;                                               /*  RC01273    */ 12430000
                                                                        12440000
 DO WHILE (SK_HW_O_1 = SK_HW_I_1);         /* BYPASS ORDERS SAME KEY */ 12450000
   CALL R214_FETCH_CURSOR_HW_O;                                         12460000
 END;                                                                   12470000
                                                                        12480000
 END R102_PROC_HW_I;                                                    12490000
                                                      /* EOC RB01237 */ 12500000
1/********************************************************************/ 12510000
 /*                                                      SOC RB01327 */ 12520000
 /* MODULE NAME      :  R104_PROC_HW_O                               */ 12530000
 /*                                                                  */ 12540000
 /* DESCRIPTION      : PROCESS HARDWARE ON ORDER                     */ 12550000
 /*                                                                  */ 12560000
 /********************************************************************/ 12570000
 R104_PROC_HW_O: PROC;                                                  12580000
                                                      /* SOC RA01138 */ 12590000
 WRK_CUST_NUM_SAVE = WRK_CUST_ORD_SAVE;                 /* PTM 0772  */ 12600000
                                                                        12610000
                                                      /* SOC RB01320 */ 12620000
 IF WRK_REAL_ORD_INDNULL = -1 THEN                                      12630000
 DO;                                                                    12640000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 12650000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        12660000
 END;                                                                   12670000
 ELSE                                                                   12680000
 DO;                                                                    12690000
    WRK_ORIGIN  = SUBSTR(WRK_REAL_SERIAL_NUM_ORD,1,2);                  12700000
    WRK_SEQ_NO  = SUBSTR(WRK_REAL_SERIAL_NUM_ORD,3);                    12710000
 END;                                                 /* EOC RB01320 */ 12720000
 CALL R252_RETR_ADD_ADDR_INFO;                                          12730000
                                                      /* EOC RA01138 */ 12740000
 CALL R212_FILL_RCBDPB1_O;                                              12750000
                                                                        12760000
 END R104_PROC_HW_O;                                                    12770000
                                                      /* EOC RB01237 */ 12780000
1/********************************************************************/ 12790000
 /*                                                      SOC RB01327 */ 12800000
 /* MODULE NAME      :  R106_PROC_HW_PI                              */ 12810000
 /*                                                                  */ 12820000
 /* DESCRIPTION      : PROCESS HARDWARE PRIME INPUT                  */ 12830000
 /*                                                                  */ 12840000
 /********************************************************************/ 12850000
 R106_PROC_HW_PI: PROC;                                                 12860000
 IF ¬ PERCALL_TYPE_PI THEN                            /*  RA01275    */ 12870000
   DO;                                                /*  RA01275    */ 12880000
     CALL R254_RETR_ADD_PI_DATA;                                        12890000
                                                                        12900000
     CALL R222_FILL_RCBDPB1_PI;                                         12910000
                                                                        12920000
   END;                                               /*  RA01275    */ 12930000
                                                                        12940000
 END R106_PROC_HW_PI;                                                   12950000
                                                      /* EOC RB01237 */ 12960000
1/********************************************************************/ 12970000
 /*                                                      SOC RB01298 */ 12980000
 /* MODULE NAME      : R014_DATE_CALC                                */ 12990000
 /*                                                                  */ 13000000
 /* DESCRIPTION      :                                               */ 13010000
 /*                                                                  */ 13020000
 /********************************************************************/ 13030000
 R014_DATE_CALC: PROC (DB2_DATE_IN                                      13040000
                      ,WRK_AMOUNT)                                      13050000
                       RETURNS (CHAR(10));                              13060000
                                                                        13070000
 DCL DB2_DATE_IN         CHAR(10);                                      13080000
 DCL WRK_AMOUNT          FIXED BIN (31);                                13090000
                                                                        13100000
 IF DB2_DATE_IN = '9999-12-31' THEN   /* DO NOT CHANGE OPEN END DATE */ 13110000
     RETURN(DB2_DATE_IN);                                               13120000
 ELSE                                                                   13130000
   DO;                                                                  13140000
     PARM_DATE_CALC = '';                                               13150000
     PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                             13160000
     PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                             13170000
     PARM_DATE_CALC.WD_FUNCTION    = 'C';                               13180000
     PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                               13190000
     PARM_DATE_CALC.WD_PERIOD      = WRK_AMOUNT;                        13200000
     PARM_DATE_CALC.WD_IN_DATE     = DB2_DATE_IN;                       13210000
                                                                        13220000
     CALL RCB004M (ADDR(PARM_DATE_CALC));                               13230000
                                                                        13240000
     IF PARM_DATE_CALC.WD_STATUS ¬= '' THEN                             13250000
       CALL RCBDPBM_ERROR (NULL, 'OTHER', '#064');                      13260000
                                                                        13270000
     RETURN(PARM_DATE_CALC.WD_OUT_DATE);                                13280000
   END;                                                                 13290000
                                                                        13300000
 END R014_DATE_CALC;                                  /* EOC RB01298 */ 13310000
                                                                        13320000
1/********************************************************************/ 13330000
1/********************************************************************/ 13340000
 /*                                                                  */ 13350000
 /* MODULE NAME      :  R202_FILL_RCBDPB1_I                          */ 13360000
 /*                     (NEW LAYOUT SINCE CEDS 2.3 : RA01138)        */ 13370000
 /*                                                                  */ 13380000
 /* DESCRIPTION      :                                               */ 13390000
 /*                                                                  */ 13400000
 /********************************************************************/ 13410000
 R202_FILL_RCBDPB1_I: PROC;                                             13420000
                                                                        13430000
 SWITCH_BAU     = TRUE;                                   /* RB01237 */ 13440000
 FILE_RCBDPB1   = '';                                                   13450000
 PARM_USER_INFO = '';                                                   13460000
 BAU_INS_CONTRACT = FALSE;                                              13470000
 BAU_INS_WARRANTY = FALSE;                                              13480000
                                                                        13490000
 FILE_RCBDPB1.PRODUCT_TYPE    = CURSOR_HW_I_V300.PRODUCT_TYPE;          13500000
 FILE_RCBDPB1.ORIGIN          = CURSOR_HW_I_V300.ORIGIN;                13510000
 FILE_RCBDPB1.SEQUENCE_NUMBER =                                         13520000
                          SUBSTR(CURSOR_HW_I_V300.SEQUENCE_NUMBER,3,5); 13530000
                                                                        13540000
 FILE_RCBDPB1.CTRYNO     = WRK_CTRYNO;                                  13550000
 FILE_RCBDPB1.REC_TYPE   = 'M';                                         13560000
 FILE_RCBDPB1.MABO       = CURSOR_HW_I_V040.MABO;                       13570000
 FILE_RCBDPB1.MA_TYPE    = CURSOR_HW_I_V300.PRODUCT_TYPE;               13580000
 FILE_RCBDPB1.MA_ORIGIN  = CURSOR_HW_I_V300.ORIGIN;                     13590000
 FILE_RCBDPB1.MA_SER_NO  =                                              13600000
                          SUBSTR(CURSOR_HW_I_V300.SEQUENCE_NUMBER,3,5); 13610000
 FILE_RCBDPB1.CUST_NO    =                                              13620000
                          SUBSTR(CURSOR_HW_I_V190.CUSTOMER_NUMBER,3,6); 13630000
                                                                        13640000
 IF ((SK_HW_I_1 = SK_HW_O_1) &            /* HW COINCIDES WITH ORDER */ 13650000
     (CURSOR_HW_O_V260.CUSTOMER_USER =    /* AND SAME CUSTOMER       */ 13660000
      CURSOR_HW_I_V190.CUSTOMER_NUMBER))                                13670000
 THEN                                                                   13680000
  DO;                                                                   13690000
   FILE_RCBDPB1.ORDER_NO = CURSOR_HW_O_V260.ORDER_REF_NUMBER;           13700000
  END;                                                                  13710000
 FILE_RCBDPB1.MA_MODEL   = CURSOR_HW_I_V300.MODEL_NUMBER;               13720000
 FILE_RCBDPB1.DPIS       = CURSOR_HW_I_V110.STATUS;                     13730000
 FILE_RCBDPB1.INST_DATE  =                                              13740000
                    R504_TRANS_DATE(CURSOR_HW_I_V190.MARKETING_INSTDAT);13750000
 SELECT;                                                                13760000
   WHEN (CURSOR_HW_I_V220.TYPE_OF_MAINT ¬= '')                          13770000
   DO;                                                    /* RB01298 */ 13780000
     FILE_RCBDPB1.TYPE_MNT = CURSOR_HW_I_V220.TYPE_OF_MAINT;            13790000
                                                      /* SOC RB01298 */ 13800000
     IF ((VERIFY(R502_TRANS_TPMNT(FILE_RCBDPB1.TYPE_MNT),'2') = 0) |    13810000
         (VERIFY(FILE_RCBDPB1.TYPE_MNT,'G') = 0))                       13820000
      THEN BAU_INS_CONTRACT = TRUE;                                     13830000
   END;                                               /* EOC RB01298 */ 13840000
                                                                        13850000
                                  /* IN CASE OF SERVICE CONTRACT     */ 13860000
   WHEN (CURSOR_HW_I_V220.TYPE_OF_WARRANTY ¬= '')          /* RC01116*/ 13870000
   DO;                                              /* SOC : RB01281 */ 13880000
  /* FILL TYPE_MNT FROM F_TYPE_OF_WARRANTY WHEN THE MACHINE IS */       13890000
  /* UNDER FLEXIBLE WARANTY                                    */       13900000
                                                      /* SOC RB01298 */ 13910000
  /*   IF (FLEXIBLE_WARRANTY_BAU &                                   */ 13920000
  /*       WRK_RUN_DATE > CURSOR_HW_I_V220.F_SPLT_DATE &             */ 13930000
  /*       WRK_RUN_DATE <= CURSOR_HW_I_V220.WARRANTY_EXP_DATE)       */ 13940000
      IF CURSOR_HW_I_V220.F_SPLT_DATE ¬= '' THEN                        13950000
         DO;                                                            13960000
           IF ((FLEXIBLE_WARRANTY_BAU) | (SWITCH_BRAND_BAU))            13970000
           THEN BAU_INS_WARRANTY = TRUE;                                13980000
         END;                                                           13990000
      ELSE BAU_INS_WARRANTY = TRUE;                                     14000000
      IF FLEXIBLE_WARRANTY_BAU = TRUE                 /* EOC RB01298 */ 14010000
      THEN                                                              14020000
        FILE_RCBDPB1.TYPE_MNT = CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY;    14030000
      ELSE                                                              14040000
        FILE_RCBDPB1.TYPE_MNT = CURSOR_HW_I_V220.TYPE_OF_WARRANTY;      14050000
                                                    /* EOC : RB01281 */ 14060000
   END;                                                                 14070000
   OTHERWISE;                                                           14080000
 END;                                                                   14090000
                                                    /* SOC : RA01275 */ 14100000
 IF SWITCH_NNHOOD  THEN                                                 14110000
   DO;                                                                  14120000
     SELECT;                                                            14130000
       WHEN (CURSOR_HW_I_V220.TYPE_OF_MAINT = '3' |                     14140000
             CURSOR_HW_I_V220.TYPE_OF_MAINT = '4' |                     14150000
             CURSOR_HW_I_V220.TYPE_OF_MAINT = '5' )                     14160000
           FILE_RCBDPB1.SLC     = CURSOR_HW_I_V220.SERVICE_LVL_CODE;    14170000
       WHEN(CURSOR_HW_I_V220.TYPE_OF_MAINT ¬= '')                       14180000
           CALL R205_TB_RCBV240_SLC ;                                   14190000
                                                   /*SOC CEDS00000322 */14200000
       WHEN(CURSOR_HW_I_V220.TYPE_OF_WARRANTY ¬= '')                    14210000
        DO;                                                             14220000
          CALL R205_TB_RCBV240_SLC ;                                    14230000
          IF SWITCH_TO_T220_SLC THEN                                    14240000
          FILE_RCBDPB1.SLC    = CURSOR_HW_I_V220.SERVICE_LVL_CODE;      14250000
        END;                                                            14260000
                                                                        14270000
      /* WHEN(CURSOR_HW_I_V220.TYPE_OF_WARRANTY ¬= '')                */14280000
      /* FILE_RCBDPB1.SLC    = CURSOR_HW_I_V220.SERVICE_LVL_CODE;     */14290000
                                                   /*EOC CEDS00000322 */14300000
     END;                                                               14310000
                                                                        14320000
     CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);                      14330000
   END;                                                                 14340000
                                                    /* EOC : RA01275 */ 14350000
   IF ((SWITCH_INTERNAL_MACHINE_CTR)&                 /* SOC RB01290 */ 14360000
       (SWITCH_TOM_INTERNAL_MACHINE)) THEN                              14370000
    DO;                                                                 14380000
     FILE_RCBDPB1.MA_STATUS  = PARM_RCBP70S.MACHINE_STATUS;             14390000
    END;                                                                14400000
   ELSE                                               /* EOC RB01290 */ 14410000
    FILE_RCBDPB1.MA_STATUS  = R502_TRANS_TPMNT(FILE_RCBDPB1.TYPE_MNT);  14420000
 /*------------------ START RA01138 CHANGES -------------------------*/ 14430000
 FILE_RCBDPB1.ZIPCODE    = TB_RCBV150.ZIP_CODE;                         14440000
 /*-------------------- END RA01138 CHANGES -------------------------*/ 14450000
                                                                        14460000
 IF SWITCH_USER_EXIT                                                    14470000
 THEN DO;                                                               14480000
   PARM_USER_INFO.OU_CODE = CURSOR_HW_I_V040.OU_CODE;                   14490000
   FILE_RCBDPB1_COPY      = FILE_RCBDPB1 , BY NAME;                     14500000
                                                                        14510000
   CALL RCBDP1U (ADDR (SWITCH_USER_EXIT),                               14520000
                 ADDR (PARM_USER_INFO),                                 14530000
                 ADDR (FILE_RCBDPB1_COPY),                              14540000
                 PTR_INT_AREA);                                         14550000
                                                                        14560000
   IF SWITCH_USER_EXIT                        /* IS USER EXIT USED ? */ 14570000
   THEN DO;                                                             14580000
     FILE_RCBDPB1.MABO    = FILE_RCBDPB1_COPY.MABO;                     14590000
     FILE_RCBDPB1.ZIPCODE = FILE_RCBDPB1_COPY.ZIPCODE; /* PTM0997 */    14600000
   END;                                                                 14610000
 END;                                                                   14620000
                                                                        14630000
 END R202_FILL_RCBDPB1_I;                                               14640000
                                                                        14650000
1/********************************************************************/ 14660000
 /*                                                                  */ 14670000
 /* MODULE NAME      :  R204_FETCH_CURSOR_HW_I                       */ 14680000
 /*                                                                  */ 14690000
 /* DESCRIPTION      :                                               */ 14700000
 /*                                                                  */ 14710000
 /********************************************************************/ 14720000
 R204_FETCH_CURSOR_HW_I: PROC;                                          14730000
                                                                        14740000
 PERCALL_TYPE_INST = FALSE;                              /*  RC01273 */ 14750000
 SWITCH_INTERNAL_MACHINE_CTR = FALSE;                                   14760000
 SWITCH_BRAND_BAU = FALSE;                               /* RB01298 */  14770000
 FLEXIBLE_WARRANTY_BAU = FALSE;                          /* RB01298 */  14780000
 SWITCH_PERCALL_BAU = FALSE;                             /* RB01298 */  14790000
 WRK_REAL_SERIAL_NUM_BAU = '';                           /* RB01320 */  14800000
 WRK_REAL_BAU_INDNULL    = '';                           /* RB01320 */  14810000
                                                                        14820000
 CURSOR_HW_I_V040 = '';                                                 14830000
 CURSOR_HW_I_V110 = '';                                                 14840000
 CURSOR_HW_I_V190 = '';                                                 14850000
 CURSOR_HW_I_V220 = '';                                                 14860000
 CURSOR_HW_I_V300 = '';                                                 14870000
                                                                        14880000
 EXEC SQL                                                               14900000
   FETCH CURSOR_HW_I                                                    14910000
     INTO :CURSOR_HW_I_V300.PRODUCT_TYPE          :WRK_INDNULL          14920000
         ,:CURSOR_HW_I_V300.ORIGIN                :WRK_INDNULL          14930000
         ,:CURSOR_HW_I_V300.SEQUENCE_NUMBER       :WRK_INDNULL          14940000
         ,:CURSOR_HW_I_V300.MODEL_NUMBER          :WRK_INDNULL          14950000
         ,:CURSOR_HW_I_V190.CUSTOMER_NUMBER       :WRK_INDNULL          14960000
         ,:CURSOR_HW_I_V190.MARKETING_INSTDAT     :WRK_INDNULL          14970000
         ,:CURSOR_HW_I_V110.STATUS                :WRK_INDNULL          14980000
         ,:CURSOR_HW_I_V040.OU_CODE               :WRK_INDNULL          14990000
         ,:CURSOR_HW_I_V040.MABO                  :WRK_INDNULL          15000000
         ,:CURSOR_HW_I_V220.TYPE_OF_MAINT         :WRK_INDNULL          15010000
         ,:CURSOR_HW_I_V220.TYPE_OF_WARRANTY      :WRK_INDNULL          15020000
                                                          /* RA01275 */ 15030000
         ,:CURSOR_HW_I_V220.SERVICE_LVL_CODE      :WRK_INDNULL          15040000
                                                          /* RA01275 */ 15050000
                                                      /* SOC RB01281 */ 15060000
         ,:CURSOR_HW_I_V220.WARRANTY_EXP_DATE     :WRK_INDNULL          15070000
         ,:CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY    :WRK_INDNULL          15080000
         ,:CURSOR_HW_I_V220.F_SPLT_DATE           :WRK_INDNULL          15090000
                                                      /* EOC RB01281 */ 15100000
                                                      /* SOC RB01290 */ 15110000
         ,:CURSOR_HW_I_V220.SOURCE_INDICATOR      :WRK_INDNULL          15120000
                                                      /* EOC RB01290 */ 15130000
                                                      /* SOC RB01298 */ 15140000
         ,:CURSOR_HW_I_V220.SERVICE_LVL_CODE_2    :WRK_INDNULL          15150000
                                                      /* EOC RB01298 */ 15160000
                                                      /* SOC RB01320 */ 15170000
         ,:WRK_REAL_SERIAL_NUM_BAU                :WRK_REAL_BAU_INDNULL 15180000
                                                      /* EOC RB01320 */ 15190000
       ;                                                                15200000
                                                                        15210000
 SELECT (SQLCODE);                                                      15230000
   WHEN (0) DO;                                                         15240000
     SWITCH_EOC_CURSOR_HW_I  = FALSE;                                   15250000
                                                                        15260000
     IF (EXCLUDE_PER_CALL &                        /* SOC : RC01273 */  15270000
        (CURSOR_HW_I_V220.TYPE_OF_MAINT = '3' |                         15280000
         CURSOR_HW_I_V220.TYPE_OF_MAINT = '4' |                         15290000
         CURSOR_HW_I_V220.TYPE_OF_MAINT = '5'    ) ) THEN               15300000
         PERCALL_TYPE_INST = TRUE;                 /* EOC : RC01273 */  15310000
                                                    /* SOC : RB01281 */ 15320000
   /* SELECTING FLEXIBLE WARRANTY MACHINES FOR PASSING MA STATUS */     15330000
                                                      /* SOC RB01298 */ 15340000
     IF VERIFY(CURSOR_HW_I_V220.TYPE_OF_MAINT,                          15350000
                  WRK_TPMNT_VAL.TPMNT_ST3) = '0'                        15360000
      THEN SWITCH_PERCALL_BAU =  TRUE;                                  15370000
                                                      /* EOC RB01298 */ 15380000
      IF (CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY ¬= '' &                   15390000
          CURSOR_HW_I_V220.F_SPLT_DATE ¬= '') THEN                      15400000
      DO;                                             /* SOC RB01298 */ 15410000
       IF (WRK_RUN_DATE >= CURSOR_HW_I_V220.F_SPLT_DATE)                15420000
       THEN DO;                                                         15430000
          IF (WRK_RUN_DATE <= CURSOR_HW_I_V220.WARRANTY_EXP_DATE) THEN  15440000
                                                      /* EOC RB01298 */ 15450000
              FLEXIBLE_WARRANTY_BAU = TRUE;                             15460000
          ELSE  FLEXIBLE_WARRANTY_BAU = FALSE;           /* RB01298 */  15470000
        END;                                             /* RB01298 */  15480000
       ELSE                                                             15490000
          DO;                                                           15500000
            SWITCH_BRAND_BAU = TRUE;                     /* RB01298 */  15510000
            FLEXIBLE_WARRANTY_BAU = FALSE;                              15520000
          END;                                                          15530000
      END;                                                /* RB01298 */ 15540000
                                                    /* EOC : RB01281 */ 15550000
                                                                        15560000
     SK_HW_I.EOF             = '0';                                     15570000
     SK_HW_I.PRODUCT_TYPE    = CURSOR_HW_I_V300.PRODUCT_TYPE;           15580000
     SK_HW_I.MODEL_NUMBER    = CURSOR_HW_I_V300.MODEL_NUMBER;           15590000
     SK_HW_I.ORIGIN          = CURSOR_HW_I_V300.ORIGIN;                 15600000
     SK_HW_I.SEQUENCE_NUMBER = CURSOR_HW_I_V300.SEQUENCE_NUMBER;        15610000
 /*------------------ START RA01138 / PTM 0772 CHANGES --------------*/ 15620000
     WRK_CUST_INST_SAVE = CURSOR_HW_I_V190.CUSTOMER_NUMBER;             15630000
 /*-------------------- END RA01138 / PTM 0772 CHANGES --------------*/ 15640000
                                                                        15650000
     IF (((CURSOR_HW_I_V220.TYPE_OF_MAINT = '2') |    /* SOC RB01290 */ 15660000
          (CURSOR_HW_I_V220.TYPE_OF_MAINT = 'A') |                      15670000
          (CURSOR_HW_I_V220.TYPE_OF_MAINT = 'B'))&                      15680000
          (CURSOR_HW_I_V220.SOURCE_INDICATOR = 'C')) THEN               15690000
      DO;                                                               15700000
      SWITCH_INTERNAL_MACHINE_CTR = TRUE;                               15710000
                                                                        15720000
       SK_CURRENT_HW               = SK_HW_I;                           15730000
       PARM_INT_AREA.SEQUENCE_KEY  = STRING(SK_CURRENT_HW);             15740000
                                                                        15750000
       CALL R207_INFO_TO_CHECK_INTERNAL_MACHINE;                        15760000
       IF ((WRK_TYPE_OF_CONTRACT_INDNULL ¬= -1)&                        15770000
           (WRK_TYPE_OF_CONTRACT ¬= '')) THEN                           15780000
      DO;                                                               15790000
                                       /* RETRIEVE PARAMETER RCB070   */15800000
       TB_RCBV500           = '';                                       15810000
       TB_RCBV500_I         = '';                                       15820000
       TB_RCBP70S.NUMBER    = 'RCB070';                                 15830000
       TB_RCBP70S.CTRYNO    = WRK_CTRYNO;                               15840000
       TB_RCBP70S.TYPE_OF_CONTRACT = WRK_TYPE_OF_CONTRACT;              15850000
                                                                        15860000
          CALL RCBI50M ('U',                                            15870000
                         ADDR(TB_RCBV500),                              15880000
                         ADDR(TB_RCBV500_I),                            15890000
                         PTR_RETURN_AREA_BB,                            15900000
                         PTR_INT_AREA);                                 15910000
                                                                        15920000
          SELECT(RETURN_AREA_BB.RETURN_CODE);                           15930000
          WHEN(0)                                                       15940000
            DO;                                                         15950000
               PARM_RCBP70S = TB_RCBP70S, BY NAME;                      15960000
               SWITCH_TOM_INTERNAL_MACHINE = TRUE;                      15970000
               CURSOR_HW_I_V220.TYPE_OF_MAINT =                         15980000
                      PARM_RCBP70S.TOM_INTERNAL_CONTRACT;               15990000
                                                                        16000000
            END;                                                        16010000
          WHEN(4)                                /* NO RECORD FOUND */  16020000
            DO;                                                         16030000
               SWITCH_TOM_INTERNAL_MACHINE = FALSE;                     16040000
            END;                                                        16050000
         WHEN(100)                                                      16060000
            DO;                                                         16070000
               SWITCH_TOM_INTERNAL_MACHINE = FALSE;                     16080000
            END;                                                        16090000
         OTHERWISE                                                      16100000
            DO;                                                         16110000
            CALL RCBDPBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),         16120000
                              'DB2',                                    16130000
                              '#058');                                  16140000
            END;                                                        16150000
       END;                                                             16160000
      END;                                                              16170000
     END;                                            /* EOC RB01290 */  16180000
   END;                                                                 16190000
   WHEN (100) DO;                                                       16200000
     SWITCH_EOC_CURSOR_HW_I = TRUE;                                     16210000
     FLEXIBLE_WARRANTY_BAU = FALSE;                      /* RB01281 */  16220000
     SK_HW_I.EOF            = '1';                                      16230000
   END;                                                                 16240000
   OTHERWISE                                                            16250000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#001');                    16260000
 END;                                                                   16270000
                                                                        16280000
 END R204_FETCH_CURSOR_HW_I;                                            16290000
                                                                        16300000
1/********************************************************************/ 16310000
 /*                                                                  */ 16320000
 /* MODULE NAME      :  R212_FILL_RCBDPB1_O                          */ 16330000
 /*                     (NEW LAYOUT SINCE CEDS 2.3 : RA01138)        */ 16340000
 /*                                                                  */ 16350000
 /* DESCRIPTION      :                                               */ 16360000
 /*                                                                  */ 16370000
 /********************************************************************/ 16380000
 R212_FILL_RCBDPB1_O: PROC;                                             16390000
 BAU_ORD_WARRANTY = FALSE;                                /* RB01298 */ 16400000
 BAU_ORD_CONTRACT = FALSE;                                /* RB01298 */ 16410000
                                                                        16420000
 SWITCH_BAU     = TRUE;                                   /* RB01237 */ 16430000
 FILE_RCBDPB1   = '';                                                   16440000
 PARM_USER_INFO = '';                                                   16450000
 FILE_RCBDPB1.PRODUCT_TYPE    = CURSOR_HW_O_V260.PRODUCT_TYPE;          16460000
 FILE_RCBDPB1.ORIGIN          = CURSOR_HW_O_V260.ORIGIN;                16470000
 FILE_RCBDPB1.SEQUENCE_NUMBER =                                         16480000
                          SUBSTR(CURSOR_HW_O_V260.SEQUENCE_NUMBER,3,5); 16490000
 FILE_RCBDPB1.CTRYNO     = WRK_CTRYNO;                                  16500000
 FILE_RCBDPB1.REC_TYPE   = 'M';                                         16510000
 FILE_RCBDPB1.MABO       = CURSOR_HW_O_V040.MABO;                       16520000
 FILE_RCBDPB1.MA_TYPE    = CURSOR_HW_O_V260.PRODUCT_TYPE;               16530000
 FILE_RCBDPB1.MA_ORIGIN  = CURSOR_HW_O_V260.ORIGIN;                     16540000
 FILE_RCBDPB1.MA_SER_NO  =                                              16550000
                          SUBSTR(CURSOR_HW_O_V260.SEQUENCE_NUMBER,3,5); 16560000
 FILE_RCBDPB1.CUST_NO    = SUBSTR(CURSOR_HW_O_V260.CUSTOMER_USER,3,6);  16570000
 FILE_RCBDPB1.ORDER_NO   = CURSOR_HW_O_V260.ORDER_REF_NUMBER;           16580000
 WRK_ORDER_NO            = CURSOR_HW_O_V260.ORDER_REF_NUMBER;           16590000
 FILE_RCBDPB1.MA_MODEL   = CURSOR_HW_O_V260.MODEL_NUMBER;               16600000
 FILE_RCBDPB1.DPIS       = '0';                           /* PTM0771 */ 16610000
 FILE_RCBDPB1.INST_DATE  =                                              16620000
                    R504_TRANS_DATE(CURSOR_HW_O_V260.SCHED_COMPL_DATE); 16630000
 SELECT;                                                                16640000
   WHEN (CURSOR_HW_O_V260.TYPE_OF_MAINT ¬= '')                          16650000
   DO;                                                    /* RB01298 */ 16660000
     FILE_RCBDPB1.TYPE_MNT = CURSOR_HW_O_V260.TYPE_OF_MAINT;            16670000
                                                      /* SOC RB01298 */ 16680000
     IF ((VERIFY(R502_TRANS_TPMNT(FILE_RCBDPB1.TYPE_MNT),'2') = 0) |    16690000
         (VERIFY(FILE_RCBDPB1.TYPE_MNT,'G') = 0))                       16700000
     THEN                                                               16710000
       BAU_ORD_CONTRACT = TRUE;                           /* RB01298 */ 16720000
     ELSE                                                               16730000
       BAU_ORD_CONTRACT = FALSE;                                        16740000
   END;                                               /* EOC RB01298 */ 16750000
   WHEN (CURSOR_HW_O_V260.TYPE_OF_WARRANTY ¬= '')         /* RC01116 */ 16760000
   DO;                                                    /* RB01298 */ 16770000
     FILE_RCBDPB1.TYPE_MNT = CURSOR_HW_O_V260.TYPE_OF_WARRANTY;         16780000
     BAU_ORD_WARRANTY = TRUE;                             /* RB01298 */ 16790000
   END;                                                   /* RB01298 */ 16800000
   OTHERWISE                                                            16810000
     CALL RCBDPBM_ERROR (NULL,'OTHER','#002');                          16820000
 END;                                                                   16830000
                                                                        16840000
 FILE_RCBDPB1.MA_STATUS  = R502_TRANS_TPMNT(FILE_RCBDPB1.TYPE_MNT);     16850000
 /*------------------ START RA01138 CHANGES -------------------------*/ 16860000
 FILE_RCBDPB1.ZIPCODE    = TB_RCBV150.ZIP_CODE;                         16870000
 /*-------------------- END RA01138 CHANGES -------------------------*/ 16880000
                                                                        16890000
 IF SWITCH_USER_EXIT                                                    16900000
 THEN DO;                                                               16910000
   PARM_USER_INFO.OU_CODE = CURSOR_HW_O_V260.OU_CODE;                   16920000
   FILE_RCBDPB1_COPY      = FILE_RCBDPB1 , BY NAME;                     16930000
                                                                        16940000
   CALL RCBDP1U (ADDR (SWITCH_USER_EXIT),                               16950000
                 ADDR (PARM_USER_INFO),                                 16960000
                 ADDR (FILE_RCBDPB1_COPY),                              16970000
                 PTR_INT_AREA);                                         16980000
                                                                        16990000
   IF SWITCH_USER_EXIT    /* IS USER EXIT USED ? */                     17000000
   THEN DO;                                                             17010000
     FILE_RCBDPB1.MABO = FILE_RCBDPB1_COPY.MABO;                        17020000
     FILE_RCBDPB1.ZIPCODE = FILE_RCBDPB1_COPY.ZIPCODE; /* PTM0997 */    17030000
   END;                                                                 17040000
 END;                                                                   17050000
                                                                        17060000
 END R212_FILL_RCBDPB1_O;                                               17070000
                                                                        17080000
1/********************************************************************/ 17090000
 /*                                                                  */ 17100000
 /* MODULE NAME      :  R214_FETCH_CURSOR_HW_O                       */ 17110000
 /*                                                                  */ 17120000
 /* DESCRIPTION      :                                               */ 17130000
 /*                                                                  */ 17140000
 /********************************************************************/ 17150000
 R214_FETCH_CURSOR_HW_O: PROC;                                          17160000
                                                                        17170000
 CURSOR_HW_O_V260 = '';                                                 17180000
 CURSOR_HW_O_V040 = '';                                                 17190000
 WRK_REAL_SERIAL_NUM_ORD = '';                           /* RB01320 */  17200000
 WRK_REAL_ORD_INDNULL    = '';                           /* RB01320 */  17210000
                                                                        17220000
 EXEC SQL                                                               17230000
   FETCH CURSOR_HW_O                                                    17240000
     INTO :CURSOR_HW_O_V260.PRODUCT_TYPE          :WRK_INDNULL          17250000
         ,:CURSOR_HW_O_V260.ORIGIN                :WRK_INDNULL          17260000
         ,:CURSOR_HW_O_V260.SEQUENCE_NUMBER       :WRK_INDNULL          17270000
         ,:CURSOR_HW_O_V260.MODEL_NUMBER          :WRK_INDNULL          17280000
         ,:CURSOR_HW_O_V260.CUSTOMER_USER         :WRK_INDNULL          17290000
         ,:CURSOR_HW_O_V260.ORDER_REF_NUMBER      :WRK_INDNULL          17300000
         ,:CURSOR_HW_O_V260.DP_SYSTEM_NUMBER      :WRK_INDNULL          17310000
         ,:CURSOR_HW_O_V260.OU_CODE               :WRK_INDNULL          17320000
         ,:CURSOR_HW_O_V260.SCHED_COMPL_DATE      :WRK_INDNULL          17330000
         ,:CURSOR_HW_O_V260.TYPE_OF_MAINT         :WRK_INDNULL          17340000
         ,:CURSOR_HW_O_V260.TYPE_OF_WARRANTY      :WRK_INDNULL          17350000
         ,:CURSOR_HW_O_V260.ORDER_DATE            :WRK_INDNULL          17360000
         ,:CURSOR_HW_O_V260.END_DATE              :WRK_INDNULL          17370000
         ,:CURSOR_HW_O_V040.MABO                  :WRK_INDNULL          17380000
                                                       /* SOC RB01320 */17390000
         ,:WRK_REAL_SERIAL_NUM_ORD                :WRK_REAL_ORD_INDNULL 17400000
                                                       /* EOC RB01320 */17410000
       ;                                                                17420000
                                                                        17430000
 SELECT (SQLCODE);                                                      17440000
   WHEN (0) DO;                                                         17450000
     SWITCH_EOC_CURSOR_HW_O  = FALSE;                                   17460000
     SK_HW_O.EOF             = '0';                                     17470000
     SK_HW_O.PRODUCT_TYPE    = CURSOR_HW_O_V260.PRODUCT_TYPE;           17480000
     SK_HW_O.MODEL_NUMBER    = CURSOR_HW_O_V260.MODEL_NUMBER;           17490000
     SK_HW_O.ORIGIN          = CURSOR_HW_O_V260.ORIGIN;                 17500000
     SK_HW_O.SEQUENCE_NUMBER = CURSOR_HW_O_V260.SEQUENCE_NUMBER;        17510000
 /*------------------ START RA01138 / PTM 0772 CHANGES -------------*/  17520000
     WRK_CUST_ORD_SAVE = CURSOR_HW_O_V260.CUSTOMER_USER;                17530000
 /*-------------------- END RA01138 / PTM 0772 CHANGES -------------*/  17540000
   END;                                                                 17550000
   WHEN (100) DO;                                                       17560000
     SWITCH_EOC_CURSOR_HW_O = TRUE;                                     17570000
     SK_HW_O.EOF            = '1';                                      17580000
   END;                                                                 17590000
   OTHERWISE                                                            17600000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#003');                    17610000
 END;                                                                   17620000
                                                                        17630000
 END R214_FETCH_CURSOR_HW_O;                                            17640000
                                                                        17650000
1/********************************************************************/ 17660000
 /*                                                      SOC RB01237 */ 17670000
 /* MODULE NAME      :  R222_FILL_RCBDPB1_PI                         */ 17680000
 /*                                                                  */ 17690000
 /* DESCRIPTION      : FILL THE HW PRIME INPUT RECORD                */ 17700000
 /*                                                                  */ 17710000
 /********************************************************************/ 17720000
 R222_FILL_RCBDPB1_PI: PROC;                                            17730000
                                                                        17740000
 SWITCH_PI      = TRUE;                                                 17750000
 USER_FILE_PI   = '';                                                   17760000
 PARM_USER_INFO = '';                                                   17770000
 WRK_PI_ORIGIN_TEMP = '';                                 /* RB01289 */ 17780000
 SWITCH_CUST_NO_T190 = FALSE;                             /* RB01289 */ 17790000
 SWITCH_CUST_NO_T10  = FALSE;                             /* RB01289 */ 17800000
 WRK_PI_BAU_OU_CODE   = '';                           /* SOC RC01311 */ 17810000
 WRK_PI_BAU_T040_MABO = '';                           /* EOC RC01311 */ 17820000
                                                                        17830000
 IF WRK_PI_ORIGIN = 'T051' THEN                 /* NO T241 AVAILABLE */ 17840000
   WRK_SAV_CONTR_NR = '';                                               17850000
 ELSE                                                                   17860000
   WRK_SAV_CONTR_NR = CURSOR_HW_PI_V241.CONTRACT_NUMBER;                17870000
                                                                        17880000
 USER_FILE_PI.CTRYNO          = WRK_CTRYNO;                             17890000
 USER_FILE_PI.REC_TYPE        = 'M';                                    17900000
                                                                        17910000
 IF WRK_PI_ORIGIN = 'T241'                                              17920000
 THEN DO;                                       /* NO T051 AVAILABLE */ 17930000
                                                      /* SOC RB01278 */ 17940000
   USER_FILE_PI.MA_TYPE       = CURSOR_HW_PI_V051.PRODUCT_TYPE;         17950000
   USER_FILE_PI.MA_ORIGIN     = CURSOR_HW_PI_V051.ORIGIN;               17960000
   USER_FILE_PI.MA_SER_NO     =                                         17970000
                         SUBSTR(CURSOR_HW_PI_V051.SEQUENCE_NUMBER,3,5); 17980000
                                                      /* EOC RB01278 */ 17990000
   IF (WRK_IND_CUST ¬= -1) THEN                       /* SOC RB01289 */ 18000000
     USER_FILE_PI.CUST_NO     =                                         18010000
                         SUBSTR(CURSOR_HW_PI_V051.CUSTOMER_NUMBER,3,6); 18020000
   ELSE                                                                 18030000
     USER_FILE_PI.CUST_NO     = '';                   /* EOC RB01289 */ 18040000
 END;                                                                   18050000
 ELSE DO;                                       /* T051 ENTRY FOUND  */ 18060000
   USER_FILE_PI.MA_TYPE       = CURSOR_HW_PI_V051.PRODUCT_TYPE;         18070000
   USER_FILE_PI.MA_ORIGIN     = CURSOR_HW_PI_V051.ORIGIN;               18080000
   USER_FILE_PI.MA_SER_NO     =                                         18090000
                         SUBSTR(CURSOR_HW_PI_V051.SEQUENCE_NUMBER,3,5); 18100000
   USER_FILE_PI.CUST_NO       =                                         18110000
                         SUBSTR(CURSOR_HW_PI_V051.CUSTOMER_NUMBER,3,6); 18120000
   USER_FILE_PI.ORDER_NO      = ' ';                                    18130000
   USER_FILE_PI.MA_MODEL      = CURSOR_HW_PI_V051.MODEL_NUMBER;         18140000
   USER_FILE_PI.INST_DATE     =                                         18150000
                R504_TRANS_DATE(CURSOR_HW_PI_V051.INSTALL_DATE);        18160000
 END;                                                                   18170000
                                                                        18180000
                                                       /* SOC RB01289 */18190000
 IF ((WRK_PI_ORIGIN = 'BOTH') | (WRK_PI_ORIGIN = 'T051'))               18200000
 THEN DO;                                                               18210000
   SELECT(CURSOR_HW_PI_V051.SOURCE_INDICATOR);                          18220000
     WHEN('O')                                                          18230000
     DO;                                                                18240000
       IF (WRK_CUSTNO_V10_IND ¬= -1)                                    18250000
       THEN DO;                                                         18260000
         USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V10,3,6);    18270000
         WRK_CUST_NUM_SAVE    = WRK_CUSTOMER_NUMBER_V10;                18280000
         SWITCH_CUST_NO_T10   = TRUE;                                   18290000
         IF (WRK_OU_CODE_V170_IND ¬= -1) THEN          /* SOC RC01311*/ 18300000
           WRK_PI_BAU_OU_CODE = WRK_OU_CODE_V170;                       18310000
 /* COMMENTED OUT AS PART OF PCEDSP-0064                 SOC RC01313 */ 18320000
 /*      ELSE DO;                                                    */ 18330000
 /*        CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUST_NO);          */ 18340000
 /*        IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN                */ 18350000
 /*         WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;       */ 18360000
 /*      END;                                     */   /* EOC RC01311*/ 18370000
 /*                                                      EOC RC01313 */ 18380000
       END;                                                             18390000
       ELSE DO;                                                         18400000
         IF (WRK_CUSTNO_V190_IND ¬= -1)                                 18410000
         THEN DO;                                                       18420000
           USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V190,3,6); 18430000
           WRK_CUST_NUM_SAVE    = WRK_CUSTOMER_NUMBER_V190;             18440000
           SWITCH_CUST_NO_T190  = TRUE;                                 18450000
           IF (WRK_OU_CODE_V170_IND ¬= -1) THEN        /* SOC RC01311*/ 18460000
             WRK_PI_BAU_OU_CODE = WRK_OU_CODE_V170;                     18470000
 /* COMMENTED OUT AS PART OF PCEDSP-0064                 SOC RC01313 */ 18480000
 /*        ELSE DO;                                                  */ 18490000
 /*          CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUST_NO);        */ 18500000
 /*          IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN              */ 18510000
 /*           WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;     */ 18520000
 /*        END;                                   */   /* EOC RC01311*/ 18530000
 /*                                                      EOC RC01313 */ 18540000
         END;                                                           18550000
         ELSE DO;                                                       18560000
           IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                           18570000
             USER_FILE_PI.CUST_NO =                                     18580000
                                  SUBSTR(WRK_CUSTOMER_NUMBER_V11,3,6);  18590000
         END;                                                           18600000
       END;                                                             18610000
     END;                                                               18620000
     WHEN('S')                                                          18630000
     DO;                                                                18640000
       IF (WRK_CUSTNO_V190_IND ¬= -1)                                   18650000
       THEN DO;                                                         18660000
         USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V190,3,6);   18670000
         WRK_CUST_NUM_SAVE    = WRK_CUSTOMER_NUMBER_V190;               18680000
         SWITCH_CUST_NO_T190  = TRUE;                                   18690000
         IF (WRK_OU_CODE_V170_IND ¬= -1) THEN          /* SOC RC01311*/ 18700000
           WRK_PI_BAU_OU_CODE = WRK_OU_CODE_V170;                       18710000
  /* COMMENTED OUT AS PART OF PCEDSP-0064                SOC RC01313 */ 18720000
  /*     ELSE DO;                                                    */ 18730000
  /*       CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUST_NO);          */ 18740000
  /*       IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN                */ 18750000
  /*        WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;       */ 18760000
  /*     END;                                     */   /* EOC RC01311*/ 18770000
  /*                                                     EOC RC01313 */ 18780000
       END;                                                             18790000
       ELSE DO;                                                         18800000
         IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                             18810000
           USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V11,3,6);  18820000
       END;                                                             18830000
     END;                                                               18840000
     OTHERWISE                                                          18850000
     DO;                                                                18860000
       IF (WRK_CUSTNO_V190_IND ¬= -1)                                   18870000
       THEN DO;                                                         18880000
         USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V190,3,6);   18890000
         WRK_CUST_NUM_SAVE    = WRK_CUSTOMER_NUMBER_V190;               18900000
         SWITCH_CUST_NO_T190  = TRUE;                                   18910000
         IF (WRK_OU_CODE_V170_IND ¬= -1) THEN          /* SOC RC01311*/ 18920000
           WRK_PI_BAU_OU_CODE = WRK_OU_CODE_V170;                       18930000
  /* COMMENTED OUT AS PART OF PCEDSP-0064                SOC RC01313 */ 18940000
  /*     ELSE DO;                                                    */ 18950000
  /*       CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUST_NO);          */ 18960000
  /*       IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN                */ 18970000
  /*        WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;       */ 18980000
  /*     END;                                      */  /* EOC RC01311*/ 18990000
  /*                                                     EOC RC01313 */ 19000000
       END;                                                             19010000
       ELSE DO;                                                         19020000
         IF (WRK_CUSTNO_V10_IND ¬= -1)                                  19030000
         THEN DO;                                                       19040000
           USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V10,3,6);  19050000
           WRK_CUST_NUM_SAVE    = WRK_CUSTOMER_NUMBER_V10;              19060000
           SWITCH_CUST_NO_T10   = TRUE;                                 19070000
         END;                                                           19080000
  /* COMMENTED OUT AS PART OF PCEDSP-0064                SOC RC01313 */ 19090000
  /*       IF (WRK_OU_CODE_V170_IND ¬= -1) THEN      *//* SOC RC01311*/ 19100000
  /*         WRK_PI_BAU_OU_CODE = WRK_OU_CODE_V170;                  */ 19110000
  /*       ELSE DO;                                                  */ 19120000
  /*         CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUST_NO);        */ 19130000
  /*         IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN              */ 19140000
  /*          WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;     */ 19150000
  /*       END;                                    */  /* EOC RC01311*/ 19160000
  /*                                                     EOC RC01313 */ 19170000
       END;                                                             19180000
     END;                                                               19190000
   END;                                                                 19200000
 END;                                                  /* EOC RB01289 */19210000
                                                                        19220000
 USER_FILE_PI.PRODUCT_TYPE    = USER_FILE_PI.MA_TYPE;                   19230000
 USER_FILE_PI.ORIGIN          = USER_FILE_PI.MA_ORIGIN;                 19240000
 USER_FILE_PI.SEQUENCE_NUMBER = USER_FILE_PI.MA_SER_NO;                 19250000
                                                                        19260000
 IF WRK_PI_BAU_OU_CODE ¬= '' THEN                      /* SOC RC01311 */19270000
  DO;                                                                   19280000
   CALL R255_RETR_MABO_FOR_BAU_OUCODE;                                  19290000
    IF WRK_PI_BAU_T040_MABO ¬= '' THEN                                  19300000
     DO;                                                                19310000
      TB_RCBV040.MABO = WRK_PI_BAU_T040_MABO;                           19320000
      CURSOR_HW_PI_V051.OU_CODE = WRK_PI_BAU_OU_CODE;                   19330000
      CURSOR_HW_PI_V051.CUSTOMER_NR_EXTEND = '000';                     19340000
     END;                                                               19350000
  END;                                                 /* EOC RC01311 */19360000
                                                                        19370000
 IF WRK_PI_ORIGIN = 'T051'                                              19380000
 THEN DO;                                       /* NO T241 AVAILABLE */ 19390000
   IF WRK_IND_TOW ¬= -1 THEN                                            19400000
    DO;                                                /* SOC RB01281 */19410000
 /*   IF FLEXIBLE_WARRANTY_PI                             /* RB01298 */ 19420000
      IF  (SWITCH_FW_PI = TRUE)                           /* RB01298 */ 19430000
      THEN                                                              19440000
         USER_FILE_PI.TYPE_MNT  = CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY; 19450000
      ELSE                                                              19460000
         USER_FILE_PI.TYPE_MNT  = CURSOR_HW_PI_V051.TYPE_OF_WARRANTY;   19470000
                                                      /* EOC RB01281 */ 19480000
                                                    /* SOC : RA01275 */ 19490000
         IF SWITCH_NNHOOD THEN                                          19500000
           DO;                                                          19510000
            IF ((CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE > WRK_RUN_DATE)|  19520000
                (WRK_IND_SPLT_DATE = -1)) THEN                          19530000
              USER_FILE_PI.SLC = CURSOR_HW_PI_V051.SERVICE_LVL_CODE_1;  19540000
            ELSE                                                        19550000
              USER_FILE_PI.SLC = CURSOR_HW_PI_V051.SERVICE_LVL_CODE_2;  19560000
           END;                                                         19570000
    END;                                                                19580000
                                                    /* EOC : RA01275 */ 19590000
   ELSE                                                                 19600000
     USER_FILE_PI.TYPE_MNT    = CURSOR_HW_PI_V051.TYPE_OF_MAINT;        19610000
 END;                                                                   19620000
 /* ELSE                                         /* T241 ENTRY FOUND  */19630000
 /*  DO;                                                   /* RA01275 */19640000
 /*    USER_FILE_PI.TYPE_MNT      = '2';                              */19650000
 /*                                                  /* SOC : RA01275 */19660000
 /*    IF SWITCH_NNHOOD  THEN                                         */19670000
 /*       USER_FILE_PI.SLC  =  CURSOR_HW_PI_V241.SERVICE_LVL_CODE;    */19680000
 /*  END;                                                             */19690000
                                                     /* SOC : RB01278 */19700000
 ELSE IF WRK_PI_ORIGIN = 'T241' THEN         /* ONLY T241 ENTRY FOUND */19710000
   DO;                                                                  19720000
  /* IF SWITCH_VENDOR_SERVICE THEN                    /* SOC RC01362 */ 19730025
  /*   DO;                                                              19740017
         CALL R234_PROD_REVENUE_DIV;                                    19750000
         IF ( SUBSTR (CURSOR_HW_PI_V051.ORIGIN, 1, 1) = 'L' &           19760000
              TB_RCBV400.PROD_REVENUE_DIV = '44')           &           19770000
         SUBSTR(CURSOR_HW_PI_V241.AUTHORISATION_CODE,1,3) = 'LEN' THEN  19780000
                                                      /* CEDS00000321 */19790000
  /*        USER_FILE_PI.TYPE_MNT      = 'G';                           19800017
         ELSE                                                           19810000
            USER_FILE_PI.TYPE_MNT      = '2';                           19820000
       END;                                                             19830000
     ELSE                                             /* EOC RC01362 */ 19840025
       USER_FILE_PI.TYPE_MNT      = '2';                                19850000
                                                                        19860000
      IF SWITCH_NNHOOD  THEN                                            19870000
        USER_FILE_PI.SLC  =  CURSOR_HW_PI_V241.SERVICE_LVL_CODE;        19880000
    END;                                                                19890000
  ELSE IF WRK_PI_ORIGIN = 'BOTH' THEN     /* T051 & T241 ENTRY FOUND */ 19900000
                                                                        19910000
    DO;                                                                 19920000
      IF CURSOR_HW_PI_V051.TYPE_OF_MAINT = 'G' THEN                     19930000
         USER_FILE_PI.TYPE_MNT      = 'G';                              19940000
      ELSE                                                              19950000
         USER_FILE_PI.TYPE_MNT      = '2';                              19960000
      IF SWITCH_NNHOOD  THEN                                            19970000
        USER_FILE_PI.SLC  =  CURSOR_HW_PI_V241.SERVICE_LVL_CODE;        19980000
                                                        /*SOC RB01298 */19990000
      IF ((PI_WARRANTY = TRUE) & (PI_CONTRACT = TRUE))                  20000000
       THEN DO;                                                         20010000
                IF SWITCH_FW_PI THEN                                    20020000
                   USER_FILE_PI.TYPE_MNT =                              20030000
                               CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY;    20040000
                ELSE                                                    20050000
                   USER_FILE_PI.TYPE_MNT =                              20060000
                               CURSOR_HW_PI_V051.TYPE_OF_WARRANTY;      20070000
            USER_FILE_PI.MA_STATUS   =                                  20080000
                        R502_TRANS_TPMNT(USER_FILE_PI.TYPE_MNT);        20090000
            IF SWITCH_NNHOOD  THEN                                      20100000
               USER_FILE_PI.SLC  =                                      20110000
                        CURSOR_HW_PI_V241.SERVICE_LVL_CODE;             20120000
            END;                                        /*EOC RB01298 */20130000
    END;                                                                20140000
                                                                        20150000
   IF (WRK_PI_ORIGIN = 'T051'                  &                        20160000
       CURSOR_HW_PI_V051.WARRANTY_EXP_DATE <= WRK_RUN_DATE &            20170000
      (CURSOR_HW_PI_V051.TYPE_OF_MAINT = '3' |                          20180000
       CURSOR_HW_PI_V051.TYPE_OF_MAINT = '4' |                          20190000
       CURSOR_HW_PI_V051.TYPE_OF_MAINT = '5' )) THEN                    20200000
       USER_FILE_PI.TYPE_MNT  = CURSOR_HW_PI_V051.TYPE_OF_MAINT;        20210000
                                                      /* EOC RB01278 */ 20220000
                                                                        20230000
 IF SWITCH_NNHOOD  THEN                                                 20240000
    DO;                                                                 20250000
     IF (WRK_PI_ORIGIN = 'T051' &                         /* RB01278 */ 20260000
         CURSOR_HW_PI_V051.WARRANTY_EXP_DATE <= WRK_RUN_DATE &          20270000
                                                          /* RB01278 */ 20280000
        (CURSOR_HW_PI_V051.TYPE_OF_MAINT = '3' |                        20290000
         CURSOR_HW_PI_V051.TYPE_OF_MAINT = '4' |                        20300000
         CURSOR_HW_PI_V051.TYPE_OF_MAINT = '5' )) THEN                  20310000
        USER_FILE_PI.SLC  = CURSOR_HW_PI_V051.SERVICE_LVL_CODE_C;       20320000
      CALL R206_PROCUREMENT_TIME(USER_FILE_PI.SLC);                     20330000
    END;                                                                20340000
                                                    /* EOC : RA01275 */ 20350000
 USER_FILE_PI.MA_STATUS       = R502_TRANS_TPMNT(USER_FILE_PI.TYPE_MNT);20360000
 USER_FILE_PI.DPIS            = '3';                                    20370000
 USER_FILE_PI.MABO            = TB_RCBV040.MABO;                        20380000
 USER_FILE_PI.ZIPCODE         = TB_RCBV011.ZIP_CODE;                    20390000
                                                      /* SOC RB01289 */ 20400000
 IF ((SWITCH_CUST_NO_T10 = TRUE) | (SWITCH_CUST_NO_T190 = TRUE))        20410000
 THEN DO;                                                               20420000
   CALL R253_RETR_ADD_ADDR_INFO_PI;                  /* SOC RC01313 */  20430000
   IF TB_RCBV150.ZIP_CODE = '' THEN                                     20440000
   DO;                                               /* EOC RC01313 */  20450000
     CALL R402_INIT_CUST_I;                                             20460000
     CALL R404_FETCH_CUST_I;                                            20470000
     CALL R406_END_CUST_I;                                              20480000
   END;                                                   /* RC01313 */ 20490000
     USER_FILE_PI.ZIPCODE    =   TB_RCBV150.ZIP_CODE;     /* RC01313 */ 20500000
 END;                                                 /* EOC RB01289 */ 20510000
                                                                        20520000
 IF SWITCH_USER_EXIT                                                    20530000
 THEN DO;                                                               20540000
   IF WRK_PI_ORIGIN = 'T241' THEN               /* NO T051 AVAILABLE */ 20550000
     PARM_USER_INFO.OU_CODE = '';                                       20560000
   ELSE                                                                 20570000
     PARM_USER_INFO.OU_CODE = CURSOR_HW_PI_V051.OU_CODE;                20580000
                                                                        20590000
   USER_FILE_RCBDPB1 = USER_FILE_PI , BY NAME;                          20600000
                                                                        20610000
   CALL RCBDP1U (ADDR (SWITCH_USER_EXIT),                               20620000
                 ADDR (PARM_USER_INFO),                                 20630000
                 ADDR (USER_FILE_RCBDPB1),                              20640000
                 PTR_INT_AREA);                                         20650000
                                                                        20660000
   IF SWITCH_USER_EXIT                           /* USER EXIT USED ? */ 20670000
   THEN DO;                                                             20680000
     USER_FILE_PI.MABO        = USER_FILE_RCBDPB1.MABO;                 20690000
     USER_FILE_PI.ZIPCODE     = USER_FILE_RCBDPB1.ZIPCODE;              20700000
   END;                                                                 20710000
 END;                                                                   20720000
                                                                        20730000
 WRK_PI_ORIGIN_TEMP = WRK_PI_ORIGIN;                        /*RB01289 */20740000
                                                                        20750000
 END R222_FILL_RCBDPB1_PI;                                              20760000
                                                       /* EOC RB01237 */20770000
                                                     /* SOC : RB01278 */20780000
 /*********************************************************************/20790000
 /*                                                                   */20800000
 /* MODULE NAME      :  R234_PROD_REVENUE_DIV                         */20810000
 /*                                                                   */20820000
 /* DESCRIPTION      :                                                */20830000
 /*                                                                   */20840000
 /*********************************************************************/20850000
 /*R234_PROD_REVENUE_DIV: PROC;                        /* SOC RC01362 */20860025
 /*                                                                     20870025
 TB_RCBV400           = '';                                             20880000
 WRK_PRODUCT_TYPE     = USER_FILE_PI.PRODUCT_TYPE;                      20890000
                                                                        20900000
 EXEC SQL                                                               20910000
   SELECT PROD_REVENUE_DIV                                              20920000
    INTO :TB_RCBV400.PROD_REVENUE_DIV                                   20930000
         :WRK_INDNULL                                                   20940000
    FROM  RCBV0400_PO_MOD1 T400                                         20950000
   WHERE  T400.COUNTRY_NUMBER   = :WRK_CTRYNO                           20960000
    AND   T400.PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                     20970000
    AND   T400.MODEL_NUMBER     = ''                                    20980000
    AND   :WRK_RUN_DATE BETWEEN                                         20990000
          T400.EFFECTIVE_DATE AND T400.END_DATE;                        21000000
  SELECT(SQLCODE);                                                      21010000
    WHEN(0);                                                            21020000
    WHEN(100);                                                          21030000
    OTHERWISE                                                           21040000
      DO;                                                               21050000
        CALL RCBDPBM_ERROR (ADDR (SQLCA),                               21060000
                            'DB2',                                      21070000
                            '#004');                                    21080000
      END;                                                              21090000
  END;                                                                  21100000
  END R234_PROD_REVENUE_DIV;                        /* EOC : RB01278 */ 21110000
                                                      /* EOC RC01362 */ 21120025
1/********************************************************************/ 21130000
 /*                                                      SOC RB01237 */ 21140000
 /* MODULE NAME      :  R224_FETCH_CURSOR_HW_PI                      */ 21150000
 /*                                                                  */ 21160000
 /* DESCRIPTION      :                                               */ 21170000
 /*                                                                  */ 21180000
 /********************************************************************/ 21190000
 R224_FETCH_CURSOR_HW_PI: PROC;                                         21200000
                                                                        21210000
 PERCALL_TYPE_PI = FALSE;                                 /* RA01275 */ 21220000
 CURSOR_HW_PI_V051 = '';                                                21230000
 CURSOR_HW_PI_V241 = '';                                                21240000
 WRK_PI_ORIGIN     = '';                                                21250000
 WRK_CUSTOMER_NUMBER_V10 = '';                         /* SOC RB01289*/ 21260000
 WRK_CUSTOMER_NUMBER_V11 = '';                                          21270000
 WRK_CUSTOMER_NUMBER_V190 = '';                        /* EOC RB01289*/ 21280000
 WRK_OU_CODE_V170         = '';                           /* RC01311 */ 21290000
 PI_WARRANTY       = FALSE;                           /* SOC RB01298 */ 21300000
 PI_CONTRACT       = FALSE;                                             21310000
 SWITCH_FW_PI      = FALSE;                                             21320000
 SWITCH_PERCALL_PI = FALSE;                                             21330000
 SWITCH_BRAND_PI   = FALSE;                           /* EOC RB01298 */ 21340000
 WRK_REAL_SERIAL_NUM_PI = '';                             /* RB01320 */ 21350000
 WRK_REAL_PI_INDNULL    = '';                             /* RB01320 */ 21360000
                                                                        21370000
 EXEC SQL                                                               21390000
   FETCH CURSOR_HW_PI                                                   21400000
     INTO :CURSOR_HW_PI_V051.PRODUCT_TYPE         :WRK_INDNULL          21410000
         ,:CURSOR_HW_PI_V051.ORIGIN               :WRK_INDNULL          21420000
         ,:CURSOR_HW_PI_V051.SEQUENCE_NUMBER      :WRK_INDNULL          21430000
         ,:WRK_PI_ORIGIN                          :WRK_INDNULL          21440000
         ,:CURSOR_HW_PI_V051.MODEL_NUMBER         :WRK_INDNULL          21450000
         ,:CURSOR_HW_PI_V051.INSTALL_DATE         :WRK_IND_INST_DATE    21460000
         ,:CURSOR_HW_PI_V051.TYPE_OF_MAINT        :WRK_INDNULL          21470000
         ,:CURSOR_HW_PI_V051.TYPE_OF_WARRANTY     :WRK_IND_TOW          21480000
         ,:CURSOR_HW_PI_V051.WARRANTY_EXP_DATE    :WRK_IND_EXP_DATE     21490000
                                                    /* SOC : RA01275 */ 21500000
         ,:CURSOR_HW_PI_V051.SERVICE_LVL_CODE_1   :WRK_T051_SLC1_IND    21510000
         ,:CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE   :WRK_IND_SPLT_DATE    21520000
         ,:CURSOR_HW_PI_V051.SERVICE_LVL_CODE_2   :WRK_T051_SLC2_IND    21530000
         ,:CURSOR_HW_PI_V051.SERVICE_LVL_CODE_C   :WRK_T051_SLCC_IND    21540000
                                                    /* EOC : RA01275 */ 21550000
         ,:CURSOR_HW_PI_V051.CUSTOMER_NUMBER      :WRK_IND_CUST         21560000
         ,:CURSOR_HW_PI_V051.CUSTOMER_NR_EXTEND   :WRK_INDNULL          21570000
         ,:CURSOR_HW_PI_V051.OU_CODE              :WRK_IND_OU           21580000
         ,:CURSOR_HW_PI_V051.SOURCE_INDICATOR     :WRK_V051_SOUR_IND    21590000
                                                           /* RB01289 */21600000
         ,:CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY   :WRK_INDNULL          21610000
                                                           /* RB01281 */21620000
         ,:CURSOR_HW_PI_V241.CONTRACT_NUMBER      :WRK_INDNULL          21630000
                                                    /* SOC : RA01275 */ 21640000
         ,:CURSOR_HW_PI_V241.AUTHORISATION_CODE   :WRK_INDNULL          21650000
                                                      /* CEDS00000321 */21660000
         ,:CURSOR_HW_PI_V241.SERVICE_LVL_CODE     :WRK_T241_SLC_IND     21670000
                                                    /* EOC : RA01275 */ 21680000
         ,:CURSOR_HW_PI_V241.EFFECTIVE_DATE       :WRK_IND_EFF_DATE     21690000
         ,:CURSOR_HW_PI_V241.END_DATE             :WRK_IND_END_DATE     21700000
                                                      /* SOC RB01289 */ 21710000
         ,:WRK_CUSTOMER_NUMBER_V10                :WRK_CUSTNO_V10_IND   21720000
         ,:WRK_CUSTOMER_NUMBER_V11                :WRK_CUSTNO_V11_IND   21730000
         ,:WRK_CUSTOMER_NUMBER_V190               :WRK_CUSTNO_V190_IND  21740000
                                                      /* EOC RB01289 */ 21750000
                                                       /* SOC RC01311 */21760000
         ,:WRK_OU_CODE_V170                       :WRK_OU_CODE_V170_IND 21770000
                                                       /* EOC RC01311 */21780000
                                                       /* SOC RC01320 */21790000
         ,:WRK_REAL_SERIAL_NUM_PI                 :WRK_REAL_PI_INDNULL  21800000
                                                       /* EOC RC01320 */21810000
       ;                                                                21820000
                                                                        21840000
 SELECT (SQLCODE);                                                      21850000
   WHEN (0) DO;                                                         21860000
     SWITCH_EOC_CURSOR_HW_PI  = FALSE;                                  21870000
                                                    /* SOC : RA01275 */ 21880000
     IF (EXCLUDE_PER_CALL &                                             21890000
        WRK_PI_ORIGIN = 'T051' &                          /* RB01278 */ 21900000
        CURSOR_HW_PI_V051.WARRANTY_EXP_DATE <= WRK_RUN_DATE &           21910000
                                                          /* RB01278 */ 21920000
        (CURSOR_HW_PI_V051.TYPE_OF_MAINT = '3' |                        21930000
         CURSOR_HW_PI_V051.TYPE_OF_MAINT = '4' |                        21940000
         CURSOR_HW_PI_V051.TYPE_OF_MAINT = '5' ) ) THEN                 21950000
         PERCALL_TYPE_PI = TRUE;                                        21960000
                                                    /* EOC : RA01275 */ 21970000
     SK_HW_PI.EOF             = '0';                                    21980000
     SK_HW_PI.PRODUCT_TYPE    = CURSOR_HW_PI_V051.PRODUCT_TYPE;         21990000
     SK_HW_PI.ORIGIN          = CURSOR_HW_PI_V051.ORIGIN;               22000000
     SK_HW_PI.SEQUENCE_NUMBER = CURSOR_HW_PI_V051.SEQUENCE_NUMBER;      22010000
     SK_HW_PI.MODEL_NUMBER    = CURSOR_HW_PI_V051.MODEL_NUMBER;         22020000
                                                                        22030000
     IF CURSOR_HW_PI_V051.WARRANTY_EXP_DATE = '3999-12-31'              22040000
     THEN DO;                                                           22050000
       CURSOR_HW_PI_V051.WARRANTY_EXP_DATE = '';                        22060000
       WRK_IND_EXP_DATE = -1;                                           22070000
     END;                                                               22080000
     IF CURSOR_HW_PI_V051.INSTALL_DATE = '3999-12-31'                   22090000
     THEN DO;                                                           22100000
       CURSOR_HW_PI_V051.INSTALL_DATE = '';                             22110000
       WRK_IND_INST_DATE = -1;                                          22120000
     END;                                                               22130000
     IF CURSOR_HW_PI_V241.EFFECTIVE_DATE = '3999-12-31'                 22140000
     THEN DO;                                                           22150000
       CURSOR_HW_PI_V241.EFFECTIVE_DATE = '';                           22160000
       WRK_IND_EFF_DATE = -1;                                           22170000
       CURSOR_HW_PI_V241.END_DATE = '';                                 22180000
       WRK_IND_END_DATE = -1;                                           22190000
     END;                                                               22200000
                                                      /* SOC RB01298 */ 22210000
     IF VERIFY(CURSOR_HW_PI_V051.TYPE_OF_MAINT,                         22220000
             WRK_TPMNT_VAL.TPMNT_ST3) = '0'                             22230000
             THEN DO;                                                   22240000
             IF WRK_RUN_DATE > CURSOR_HW_PI_V051.WARRANTY_EXP_DATE      22250000
                 THEN SWITCH_PERCALL_PI =  TRUE;                        22260000
             ELSE SWITCH_PERCALL_PI = FALSE;                            22270000
             END;                                     /* EOC RB01298 */ 22280000
                                                    /* SOC : RB01281 */ 22290000
     IF (CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY ¬= '' &                   22300000
         CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE ¬= '' &                   22310000
         CURSOR_HW_PI_V051.TYPE_OF_WARRANTY ¬=                          22320000
           CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY ) THEN /* SOC RB01298*/ 22330000
 /*                 CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY &           */ 22340000
 /*      WRK_RUN_DATE > CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE &       */ 22350000
 /*      WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE)        */ 22360000
 /*  THEN                                                            */ 22370000
 /*         FLEXIBLE_WARRANTY_PI  = TRUE;                            */ 22380000
 /*  ELSE                                                            */ 22390000
 /*         FLEXIBLE_WARRANTY_PI  = FALSE;          /* EOC : RB01281 */ 22400000
       DO;                                                              22410000
        IF ((WRK_RUN_DATE >= CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE) &    22420000
           (WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE)) THEN  22430000
          DO;                                                           22440000
           IF (CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY = WRK_FWTOW) THEN   22450000
                SWITCH_FW_PI = TRUE;                                    22460000
           ELSE SWITCH_FW_PI = FALSE;                                   22470000
          END;                                                          22480000
        ELSE                                                            22490000
          DO;                                                           22500000
           IF(WRK_RUN_DATE < CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE)      22510000
             THEN SWITCH_BRAND_PI = TRUE;                               22520000
           SWITCH_FW_PI = FALSE;                                        22530000
          END;                                                          22540000
       END;                                                             22550000
     ELSE                                                               22560000
       DO;                                                              22570000
             SWITCH_BRAND_PI = FALSE;                                   22580000
             SWITCH_FW_PI = FALSE;                                      22590000
       END;                                                             22600000
                                                                        22610000
                                                                        22620000
     IF (VERIFY(CURSOR_HW_PI_V051.TYPE_OF_WARRANTY,                     22630000
                  WRK_TPMNT_VAL.TPMNT_WAR) = '0') THEN                  22640000
      DO;                                                               22650000
        IF WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE THEN     22660000
         DO;                                                            22670000
           IF CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE = '' THEN            22680000
              PI_WARRANTY = TRUE;                                       22690000
           ELSE                                                         22700000
              DO;                                                       22710000
               IF ((WRK_RUN_DATE <=                                     22720000
             R014_DATE_CALC(CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE,-1))|  22730000
                                                  (SWITCH_FW_PI)) THEN  22740000
                    PI_WARRANTY = TRUE;                                 22750000
               ELSE PI_WARRANTY = FALSE;                                22760000
              END;                                                      22770000
         END;                                                           22780000
      END;                                                              22790000
      IF ((WRK_PI_ORIGIN = 'BOTH') | (WRK_PI_ORIGIN = 'T241')) THEN     22800000
      DO;                                                               22810000
         IF ((WRK_RUN_DATE >= CURSOR_HW_PI_V241.EFFECTIVE_DATE) &       22820000
             (WRK_RUN_DATE <= CURSOR_HW_PI_V241.END_DATE))              22830000
           THEN DO;                                                     22840000
                  PI_CONTRACT = TRUE;                                   22850000
                END;                                                    22860000
         ELSE PI_CONTRACT = FALSE;                                      22870000
      END;                                                              22880000
                                                                        22890000
                                                        /*EOC RB01298*/ 22900000
   END;                                                                 22910000
   WHEN (100) DO;                                                       22920000
     SWITCH_EOC_CURSOR_HW_PI = TRUE;                                    22930000
     SK_HW_PI.EOF            = '1';                                     22940000
                                                       /* SOC RB01298 */22950000
 /*  FLEXIBLE_WARRANTY_PI  = FALSE;                        /* RB01281 */22960000
     SWITCH_FW_PI = FALSE;                             /* EOC RB01298 */22970000
   END;                                                                 22980000
   OTHERWISE                                                            22990000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#005');                    23000000
 END;                                                                   23010000
                                                                        23020000
 END R224_FETCH_CURSOR_HW_PI;                                           23030000
                                                      /* EOC RB01237 */ 23040000
1/*------------------ START RA01138 CHANGES -------------------------*/ 23050000
 /********************************************************************/ 23060000
 /*                                                                  */ 23070000
 /* MODULE NAME      :  R252_RETR_ADD_ADDR_INFO                      */ 23080000
 /*                                                                  */ 23090000
 /* DESCRIPTION      :                                               */ 23100000
 /*                                                                  */ 23110000
 /********************************************************************/ 23120000
 R252_RETR_ADD_ADDR_INFO: PROC;                                         23130000
                                                                        23140000
 TB_RCBV150 = '';                                                       23150000
 TB_RCBV340 = '';                                                       23160000
                                                                        23170000
 EXEC SQL                                                               23180000
   SELECT ADDRESS_NUMBER                                                23190000
         ,CUSTOMER_USER                                                 23200000
     INTO :TB_RCBV340.ADDRESS_NUMBER    :WRK_INDNULL                    23210000
         ,:TB_RCBV340.CUSTOMER_USER     :WRK_INDNULL                    23220000
                                                                        23230000
   FROM RCBV0340_HW_ADDR                                                23240000
   WHERE PRODUCT_TYPE        = :SK_CURRENT_HW.PRODUCT_TYPE              23250000
                                                       /* SOC RB01320 */23260000
   /*AND ORIGIN              = :SK_CURRENT_HW.ORIGIN                    23270000
     AND SEQUENCE_NUMBER     = :SK_CURRENT_HW.SEQUENCE_NUMBER */        23280000
                                                                        23290000
     AND ORIGIN              = :WRK_ORIGIN                              23300000
     AND SEQUENCE_NUMBER     = :WRK_SEQ_NO             /* EOC RB01320 */23310000
     AND COUNTRY_NUMBER      = :WRK_CTRYNO                              23320000
     AND :WRK_RUN_DATE       BETWEEN EFFECTIVE_DATE                     23330000
                                 AND END_DATE                           23340000
           ;                                                            23350000
                                                                        23360000
 SELECT (SQLCODE);                                                      23370000
                                          /* CUSTOMER HAS AN ADDRESS */ 23380000
                                          /* STORED IN RCBT0340      */ 23390000
   WHEN (0) DO;                                                         23400000
     EXEC SQL                                                           23410000
       SELECT ZIP_CODE                                                  23420000
         INTO :TB_RCBV150.ZIP_CODE    :WRK_INDNULL                      23430000
       FROM RCBV0150_CUST_ADDR                                          23440000
       WHERE ADDRESS_NUMBER      = :TB_RCBV340.ADDRESS_NUMBER           23450000
         AND CUSTOMER_NUMBER     = :TB_RCBV340.CUSTOMER_USER            23460000
         AND COUNTRY_NUMBER      = :WRK_CTRYNO                          23470000
               ;                                                        23480000
                                                                        23490000
     SELECT (SQLCODE);                                                  23500000
       WHEN (0);                                                        23510000
       WHEN (100) TB_RCBV150.ZIP_CODE = '';                             23520000
       OTHERWISE                                                        23530000
         CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#006');                23540000
     END;                                                               23550000
   END;                                                                 23560000
                                          /* CUSTOMER HAS NO ADDRESS */ 23570000
                                          /* STORED IN RCBT0340,     */ 23580000
                                          /* THE ZIP_CODE HAS TO BE  */ 23590000
                                          /* RETRIEVED VIA THE SAVED */ 23600000
                                          /* CUSTOMER_NUMBER OF      */ 23610000
                                          /* RCBT0190 OR RCBT0260    */ 23620000
   WHEN (100) DO;                                                       23630000
     CALL R402_INIT_CUST_I;                                             23640000
     CALL R404_FETCH_CUST_I;                                            23650000
     CALL R406_END_CUST_I;                                              23660000
   END;                                                                 23670000
   OTHERWISE                                                            23680000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#007');                    23690000
 END;                                                                   23700000
                                                                        23710000
 END R252_RETR_ADD_ADDR_INFO;                                           23720000
                                                                        23730000
 /*-------------------- END RA01138 CHANGES -------------------------*/ 23740000
 /********************************************************************/ 23750000
 /*                                                   SOC RC01313    */ 23760000
 /* MODULE NAME      :  R253_RETR_ADD_ADDR_INFO_PI                   */ 23770000
 /*                                                                  */ 23780000
 /* DESCRIPTION      :  CALCULATE ZIPCODE FROM T340 ADDRESS NUMBER   */ 23790000
 /*                                                                  */ 23800000
 /********************************************************************/ 23810000
 R253_RETR_ADD_ADDR_INFO_PI: PROC;                                      23820000
                                                                        23830000
 TB_RCBV150 = '';                                                       23840000
 TB_RCBV340 = '';                                                       23850000
 IF WRK_REAL_PI_INDNULL = -1 THEN                     /* SOC RB01320 */ 23860000
 DO;                                                                    23870000
    WRK_ORIGIN  = CURSOR_HW_PI_V051.ORIGIN;                             23880000
    WRK_SEQ_NO  = CURSOR_HW_PI_V051.SEQUENCE_NUMBER;                    23890000
 END;                                                                   23900000
 ELSE                                                                   23910000
 DO;                                                                    23920000
    WRK_ORIGIN  = SUBSTR(WRK_REAL_SERIAL_NUM_PI,1,2);                   23930000
    WRK_SEQ_NO  = SUBSTR(WRK_REAL_SERIAL_NUM_PI,3);                     23940000
 END;                                                 /* EOC RB01320 */ 23950000
                                                                        23960000
 EXEC SQL                                                               23970000
   SELECT ADDRESS_NUMBER                                                23980000
         ,CUSTOMER_USER                                                 23990000
     INTO :TB_RCBV340.ADDRESS_NUMBER    :WRK_INDNULL                    24000000
         ,:TB_RCBV340.CUSTOMER_USER     :WRK_INDNULL                    24010000
   FROM RCBV0340_HW_ADDR T340                                           24020000
   WHERE T340.PRODUCT_TYPE        = :CURSOR_HW_PI_V051.PRODUCT_TYPE     24030000
                                                      /* SOC RB01320 */ 24040000
  /*                                                                    24050000
     AND T340.ORIGIN              = :CURSOR_HW_PI_V051.ORIGIN           24060000
     AND T340.SEQUENCE_NUMBER     = :CURSOR_HW_PI_V051.SEQUENCE_NUMBER  24070000
  */                                                                    24080000
     AND T340.ORIGIN              = :WRK_ORIGIN                         24090000
     AND T340.SEQUENCE_NUMBER     = :WRK_SEQ_NO       /* EOC RB01320 */ 24100000
     AND T340.COUNTRY_NUMBER      = :WRK_CTRYNO                         24110000
     AND T340.CUSTOMER_USER       = :WRK_CUST_NUM_SAVE                  24120000
     AND :WRK_RUN_DATE       BETWEEN T340.EFFECTIVE_DATE                24130000
                                 AND T340.END_DATE                      24140000
           ;                                                            24150000
                                                                        24160000
 SELECT (SQLCODE);                                                      24170000
                                        /* CUSTOMER HAS AN ADDRESS */   24180000
                                        /* STORED IN RCBT0340      */   24190000
   WHEN (0) DO;                                                         24200000
     EXEC SQL                                                           24210000
       SELECT ZIP_CODE                                                  24220000
         INTO :TB_RCBV150.ZIP_CODE    :WRK_INDNULL                      24230000
       FROM RCBV0150_CUST_ADDR                                          24240000
       WHERE ADDRESS_NUMBER      = :TB_RCBV340.ADDRESS_NUMBER           24250000
         AND CUSTOMER_NUMBER     = :TB_RCBV340.CUSTOMER_USER            24260000
         AND COUNTRY_NUMBER      = :WRK_CTRYNO                          24270000
               ;                                                        24280000
                                                                        24290000
     SELECT (SQLCODE);                                                  24300000
       WHEN (0);                                                        24310000
       WHEN (100) TB_RCBV150.ZIP_CODE = '';                             24320000
       OTHERWISE                                                        24330000
         CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#067');                24340000
     END;                                                               24350000
   END;                                                                 24360000
    WHEN (100);                                                         24370000
    OTHERWISE                                                           24380000
      CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#068');                   24390000
 END;                                                                   24400000
                                                                        24410000
 END R253_RETR_ADD_ADDR_INFO_PI;                      /* EOC RC01313 */ 24420000
1/********************************************************************/ 24430000
 /*                                                        RB012137  */ 24440000
 /* MODULE NAME      :  R254_RETR_ADD_PI_DATA                        */ 24450000
 /*                                                                  */ 24460000
 /* DESCRIPTION      : RETRIEVE ADDITIONAL PRIME INPUT DATA          */ 24470000
 /*                                                                  */ 24480000
 /********************************************************************/ 24490000
 R254_RETR_ADD_PI_DATA: PROC;                                           24500000
                                            /*************************/ 24510000
                                            /* GET BRANCH OFFICE     */ 24520000
                                            /*************************/ 24530000
 TB_RCBV040       = '';                                                 24540000
 IF WRK_PI_ORIGIN = 'BOTH'                  /* T051 AVAILABLE        */ 24550000
  | WRK_PI_ORIGIN = 'T051'                  /* T051 AVAILABLE        */ 24560000
 THEN DO;                                                               24570000
   IF WRK_IND_OU ¬= -1                      /* OU-CODE AVAILABLE     */ 24580000
   THEN DO;                                                             24590000
     EXEC SQL                                                           24600000
       SELECT MABO                                                      24610000
         INTO :TB_RCBV040.MABO    :WRK_INDNULL                          24620000
       FROM RCBV0040_OU                                                 24630000
       WHERE COUNTRY_NUMBER     = :WRK_CTRYNO                           24640000
         AND OU_CODE            = :CURSOR_HW_PI_V051.OU_CODE            24650000
     ;                                                                  24660000
                                                                        24670000
     SELECT (SQLCODE);                                                  24680000
       WHEN (0);                                                        24690000
       WHEN (100) TB_RCBV040.MABO = '';                                 24700000
       OTHERWISE                                                        24710000
         CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#008');                24720000
     END;                                                               24730000
   END;                                                                 24740000
 END;                                                                   24750000
                                            /*************************/ 24760000
                                            /* GET ZIP-CODE          */ 24770000
                                            /*************************/ 24780000
 TB_RCBV011       = '';                                                 24790000
 IF WRK_PI_ORIGIN = 'BOTH'                  /* T051 AVAILABLE        */ 24800000
  | WRK_PI_ORIGIN = 'T051'                  /* T051 AVAILABLE        */ 24810000
 THEN DO;                                                               24820000
   IF WRK_IND_CUST ¬= -1                  /* CUST.NUMBER AVAILABLE */   24830000
   THEN DO;                                                             24840000
     EXEC SQL                                                           24850000
       SELECT ZIP_CODE                                                  24860000
         INTO :TB_RCBV011.ZIP_CODE    :WRK_INDNULL                      24870000
       FROM RCBV0011_PI_CUST                                            24880000
       WHERE COUNTRY_NUMBER     = :WRK_CTRYNO                           24890000
         AND CUSTOMER_NUMBER    = :CURSOR_HW_PI_V051.CUSTOMER_NUMBER    24900000
         AND CUSTOMER_NR_EXTEND = :CURSOR_HW_PI_V051.CUSTOMER_NR_EXTEND 24910000
     ;                                                                  24920000
                                                                        24930000
     SELECT (SQLCODE);                                                  24940000
       WHEN (0);                                                        24950000
       WHEN (100) TB_RCBV011.ZIP_CODE = '';                             24960000
       OTHERWISE                                                        24970000
         CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#009');                24980000
     END;                                                               24990000
   END;                                                                 25000000
 END;                                                                   25010000
 END R254_RETR_ADD_PI_DATA;                                             25020000
                                                      /* EOC RB01237 */ 25030000
1/********************************************************************/ 25040000
 /*                                                      SOC RC01311 */ 25050000
 /* MODULE NAME      : R255_RETR_MABO_FOR_BAU_OUCODE                 */ 25060000
 /*                                                                  */ 25070000
 /* DESCRIPTION      : RETRIEVE MABO FOR THE BAU OU_CODE WHEN THE    */ 25080000
 /*                    PI TOS AVAILABLE IN BAU CUSTOMER INVENTORY    */ 25090000
 /********************************************************************/ 25100000
 R255_RETR_MABO_FOR_BAU_OUCODE : PROC;                                  25110000
                                            /*************************/ 25120000
                                            /* GET BRANCH OFFICE     */ 25130000
                                            /*************************/ 25140000
 WRK_PI_BAU_T040_MABO = '';                                             25150000
                                                                        25160000
 IF WRK_PI_ORIGIN = 'BOTH'                  /* T051 AVAILABLE        */ 25170000
  | WRK_PI_ORIGIN = 'T051'                  /* T051 AVAILABLE        */ 25180000
 THEN DO;                                                               25190000
   EXEC SQL                                                             25200000
     SELECT MABO                                                        25210000
       INTO :WRK_PI_BAU_T040_MABO :WRK_INDNULL                          25220000
     FROM RCBV0040_OU                                                   25230000
     WHERE COUNTRY_NUMBER     = :WRK_CTRYNO                             25240000
       AND OU_CODE            = :WRK_PI_BAU_OU_CODE                     25250000
   ;                                                                    25260000
                                                                        25270000
   SELECT (SQLCODE);                                                    25280000
     WHEN (0);                                                          25290000
     WHEN (100) WRK_PI_BAU_T040_MABO = '';                              25300000
     OTHERWISE                                                          25310000
       CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#065');                  25320000
   END;                                                                 25330000
 END;                                                                   25340000
 END R255_RETR_MABO_FOR_BAU_OUCODE;                    /* EOC RC01311 */25350000
                                                                        25360000
 /*********************************************************************/25370000
 /* THIS PROC IS COMMENTED OUT AS PART OF PCEDSP-0064     SOC RC01313 */25380000
 /*                                                       SOC RC01311 */25390000
 /* MODULE NAME      : R350_RETR_CU_ENGG_OU                           */25400000
 /*                                                                   */25410000
 /* DESCRIPTION      : RETRIEVE CU ENGINEERING OU CODE FROM TABLE     */25420000
 /*                    RCBT0350_CUST_MOD WHEN OU CODE COULD NOT BE    */25430000
 /*                    DETERMINED FROM TABLE RCBT0170_OU_HW           */25440000
 /*                                                                   */25450000
 /*********************************************************************/25460000
 /*R350_RETR_CU_ENGG_OU: PROC(CUSTOMER_NO);                           */25470000
 /*                                                                   */25480000
 /*                                  */  /* RETRIEVE CU ENGINEERING OU*/25490000
 /*TB_RCBV350 = '';                                                   */25500000
 /*DCL CUSTOMER_NO CHAR(08);                                          */25510000
 /*                                                                   */25520000
 /*EXEC SQL                                                           */25530000
 /*  SELECT CU_ENGINEERING_OU                                         */25540000
 /*  INTO :TB_RCBV350.CU_ENGINEERING_OU      :WRK_INDNULL             */25550000
 /*  FROM RCBV0350_CUST_MOD                                           */25560000
 /*  WHERE COUNTRY_NUMBER      = :WRK_CTRYNO                          */25570000
 /*  AND CUSTOMER_NUMBER       = :CUSTOMER_NO                         */25580000
 /*  AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                       */25590000
 /*                      AND END_DATE                                 */25600000
 /* ;                                                                 */25610000
 /*SELECT(SQLCODE);                                                   */25620000
 /*  WHEN(0);                                                         */25630000
 /*  WHEN(100);                                                       */25640000
 /*  OTHERWISE                                                        */25650000
 /*    DO;                                                            */25660000
 /*      CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#066');              */25670000
 /*    END;                                                           */25680000
 /*END;                                                               */25690000
 /*END R350_RETR_CU_ENGG_OU;                        */ /* EOC RC01311 */25700000
 /*                                                       EOC RC01313 */25710000
                                                                        25720000
1/********************************************************************/ 25730000
 /*                                                                  */ 25740000
 /* MODULE NAME      :  R300_WRITE_RCBDPB1                           */ 25750000
 /*                                                                  */ 25760000
 /* DESCRIPTION      :                                               */ 25770000
 /*                                                                  */ 25780000
 /********************************************************************/ 25790000
 R300_WRITE_RCBDPB1: PROC;                                              25800000
                                            /* UPDATE HASH_TOTAL     */ 25810000
 CALL RCB018M (SUBSTR(FILE_RCBDPB1.MA_SER_NO,1,4),                      25820000
               WRK_HASH_TOTAL,                                          25830000
               PTR_INT_AREA);                                           25840000
                                                                        25850000
 WRITE FILE(RCBDPB1) FROM (FILE_RCBDPB1);                               25860000
                                                                        25870000
 WRK_CNT_COUNTRY = WRK_CNT_COUNTRY + 1;                                 25880000
                                                                        25890000
 END R300_WRITE_RCBDPB1;                                                25900000
                                                    /* SOC : RA01275 */ 25910000
1/********************************************************************/ 25920000
 /*                                                                  */ 25930000
 /* MODULE NAME      :  R205_TB_RCBV240_SLC                          */ 25940000
 /*                                                                  */ 25950000
 /* DESCRIPTION      :  GET THE SERVICE LEVEL CODE FROM 240 TABLE    */ 25960000
 /*                                                                  */ 25970000
 /********************************************************************/ 25980000
 R205_TB_RCBV240_SLC: PROC;                                             25990000
                                                                        26000000
 TB_RCBV240                  = '';                                      26010000
 TB_RCBV240_I                = '';                                      26020000
 SWITCH_TO_T220_SLC          = FALSE;                 /* CEDS00000322*/ 26030000
                                                                        26040000
                                                      /* SOC RB01320 */ 26050000
 IF WRK_REAL_BAU_INDNULL = -1 THEN                                      26060000
 DO;                                                                    26070000
    WRK_ORIGIN  = FILE_RCBDPB1.ORIGIN;                                  26080000
    WRK_SEQ_NO  = CURSOR_HW_I_V300.SEQUENCE_NUMBER;                     26090000
 END;                                                                   26100000
 ELSE                                                                   26110000
 DO;                                                                    26120000
    WRK_ORIGIN  = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,1,2);                  26130000
    WRK_SEQ_NO  = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,3);                    26140000
 END;                                                 /* EOC RB01320 */ 26150000
                                                                        26160000
 EXEC SQL                                                               26170000
      SELECT SERVICE_LVL_CODE                                           26180000
      INTO   :TB_RCBV240.SERVICE_LVL_CODE :WRK_INDNULL                  26190000
      FROM   RCBV0240_SERV_CTR                                          26200000
      WHERE  COUNTRY_NUMBER  = :WRK_CTRYNO                              26210000
      AND    PRODUCT_TYPE    = :FILE_RCBDPB1.PRODUCT_TYPE               26220000
                                                       /* SOC RB01320 */26230000
   /* AND    ORIGIN          = :FILE_RCBDPB1.ORIGIN                     26240000
      AND    SEQUENCE_NUMBER = :CURSOR_HW_I_V300.SEQUENCE_NUMBER */     26250000
      AND    ORIGIN          = :WRK_ORIGIN                              26260000
      AND    SEQUENCE_NUMBER = :WRK_SEQ_NO             /* EOC RB01320 */26270000
      AND   :WRK_RUN_DATE    BETWEEN EFFECTIVE_DATE                     26280000
                                 AND END_DATE                           26290000
 ;                                                                      26300000
 SELECT(SQLCODE);                                                       26310000
   WHEN(0)                                                              26320000
     DO;                                                                26330000
         FILE_RCBDPB1.SLC = TB_RCBV240.SERVICE_LVL_CODE;                26340000
         BAU_INS_CONTRACT = TRUE;                    /* CEDS00000515 */ 26350000
     END;                                                               26360000
   WHEN(100)                                                            26370000
     DO;                                                                26380000
         SWITCH_TO_T220_SLC  = TRUE;                  /* CEDS00000322*/ 26390000
     END;                                                               26400000
   OTHERWISE                                                            26410000
     DO;                                                                26420000
       CALL RCBDPBM_ERROR (ADDR(SQLCA),                                 26430000
                         'DB2',                                         26440000
                         '#010');                                       26450000
     END;                                                               26460000
 END;                                                                   26470000
                                                                        26480000
 END R205_TB_RCBV240_SLC;                                               26490000
                                                    /* EOC : RA01275 */ 26500000
                                                    /* SOC : RA01275 */ 26510000
 /********************************************************************/ 26520000
 /*                                                                  */ 26530000
 /* MODULE NAME      :  R206_PROCUREMENT_TIME                        */ 26540000
 /*                                                                  */ 26550000
 /* DESCRIPTION      :  CALCULATION OF TIME PROCUREMENT FOR BAU AND  */ 26560000
 /*                     PRIME INPUT DATA                             */ 26570000
 /********************************************************************/ 26580000
 R206_PROCUREMENT_TIME: PROC(SERVICE_LVL_CODE);                         26590000
                                                                        26600000
 DCL SERVICE_LVL_CODE   CHAR(03);                                       26610000
                                                                        26620000
 TB_RCBV470                  = '';                                      26630000
 TB_RCBV470_I                = '';                                      26640000
 TB_RCBV470.SERVICE_LVL_CODE = SERVICE_LVL_CODE;                        26650000
                                                                        26660000
 CALL RCBISRM (ADDR(TB_RCBV470),                                        26670000
               ADDR(TB_RCBV470_I),                                      26680000
               ADDR(RETURN_AREA_BB),                                    26690000
               PTR_INT_AREA);                                           26700000
                                                                        26710000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    26720000
 WHEN(0)                                                                26730000
   DO;                                                                  26740000
     WRK_COMMENT_TEXT       = TB_RCBV470.COMMENT_TEXT;                  26750000
     WRK_PRT_ONS_TIME_COM_1 = TB_RCBV470.PRT_ONS_TIME_COM_1;            26760000
     WRK_FIX_TIME_COM_1     = TB_RCBV470.FIX_TIME_COM_1;                26770000
 /*  WRK_CTRYUSE_TIME_COM_1 = TB_RCBV470.TURN_AROUND_COM_1;           */26780000
                                                           /* RA01275 */26790000
     WRK_TURN_AROUND_COM_1  = TB_RCBV470.TURN_AROUND_COM_1;/* RA01275 */26800000
     WRK_PPT_INDX           = INDEX(WRK_COMMENT_TEXT,'PPT');            26810000
                                                                        26820000
     IF WRK_PPT_INDX ¬= 0 THEN                                          26830000
       DO;                                                              26840000
         WRK_PPT_INDX = WRK_PPT_INDX + 4;                               26850000
         WRK_PPT      = SUBSTR(WRK_COMMENT_TEXT,WRK_PPT_INDX,2);        26860000
         IF VERIFY(WRK_PPT,'0123456789') = 0 THEN                       26870000
           DO;                                                          26880000
             IF SWITCH_PI THEN                        /* CEDS00000314 */26890000
               USER_FILE_PI.PPT_TIME_QTY = WRK_PPT;                     26900000
             ELSE IF SWITCH_BAU THEN                  /* CEDS00000314 */26910000
               FILE_RCBDPB1.PPT_TIME_QTY = WRK_PPT;                     26920000
                                                                        26930000
             IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN /*RB01298 */ 26940000
               FILE_RCBDPB1.PPT_TIME_QTY = WRK_PPT;       /* RB01298 */ 26950000
                                                                        26960000
             WRK_PPT_INDX = WRK_PPT_INDX + 2;                           26970000
                                                                        26980000
             IF SWITCH_PI THEN                        /* CEDS00000314 */26990000
               USER_FILE_PI.PPT_TIME_UNT = SUBSTR(WRK_COMMENT_TEXT,     27000000
                                                WRK_PPT_INDX,1);        27010000
             ELSE IF SWITCH_BAU THEN                  /* CEDS00000314 */27020000
               FILE_RCBDPB1.PPT_TIME_UNT = SUBSTR(WRK_COMMENT_TEXT,     27030000
                                                WRK_PPT_INDX,1);        27040000
                                                      /* SOC RB01298 */ 27050000
             IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN              27060000
               FILE_RCBDPB1.PPT_TIME_UNT = SUBSTR(WRK_COMMENT_TEXT,     27070000
                                                WRK_PPT_INDX,1);        27080000
                                                      /* EOC RB01298 */ 27090000
           END;                                                         27100000
         ELSE DO;                                                       27110000
                IF SWITCH_PI THEN                     /* CEDS00000314 */27120000
                  USER_FILE_PI.PPT_TIME_QTY = SUBSTR(WRK_COMMENT_TEXT,  27130000
                                                     WRK_PPT_INDX,1);   27140000
                ELSE IF SWITCH_BAU THEN               /* CEDS00000314 */27150000
                  FILE_RCBDPB1.PPT_TIME_QTY = SUBSTR(WRK_COMMENT_TEXT,  27160000
                                                     WRK_PPT_INDX,1);   27170000
                                                      /* SOC RB01298 */ 27180000
             IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN              27190000
               FILE_RCBDPB1.PPT_TIME_QTY = SUBSTR(WRK_COMMENT_TEXT,     27200000
                                                WRK_PPT_INDX,1);        27210000
                                                      /* EOC RB01298 */ 27220000
                WRK_PPT_INDX = WRK_PPT_INDX + 1;                        27230000
                                                                        27240000
                IF SWITCH_PI THEN                     /* CEDS00000314 */27250000
                   USER_FILE_PI.PPT_TIME_UNT = SUBSTR(WRK_COMMENT_TEXT, 27260000
                                                     WRK_PPT_INDX,1);   27270000
                ELSE IF SWITCH_BAU THEN               /* CEDS00000314 */27280000
                  FILE_RCBDPB1.PPT_TIME_UNT = SUBSTR(WRK_COMMENT_TEXT,  27290000
                                                     WRK_PPT_INDX,1);   27300000
                                                      /* SOC RB01298 */ 27310000
             IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN              27320000
               FILE_RCBDPB1.PPT_TIME_UNT = SUBSTR(WRK_COMMENT_TEXT,     27330000
                                                WRK_PPT_INDX,1);        27340000
                                                      /* EOC RB01298 */ 27350000
              END;                                                      27360000
       END;                                                             27370000
     ELSE DO;                                                           27380000
            IF SWITCH_PI THEN                         /* CEDS00000314 */27390000
              DO;                                                       27400000
                USER_FILE_PI.PPT_TIME_QTY = 0;                          27410000
                USER_FILE_PI.PPT_TIME_UNT = ' ';                        27420000
              END;                                                      27430000
            ELSE IF SWITCH_BAU THEN                   /* CEDS00000314 */27440000
              DO;                                                       27450000
                FILE_RCBDPB1.PPT_TIME_QTY = 0;                          27460000
                FILE_RCBDPB1.PPT_TIME_UNT = ' ';                        27470000
              END;                                                      27480000
                                                      /* SOC RB01298 */ 27490000
            IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN               27500000
              DO;                                                       27510000
                FILE_RCBDPB1.PPT_TIME_QTY = 0;                          27520000
                FILE_RCBDPB1.PPT_TIME_UNT = ' ';                        27530000
              END;                                    /* EOC RB01298 */ 27540000
          END;                                                          27550000
                                                                        27560000
   IF WRK_PRT_ONS_TIME_COM_1 = 'C' |                                    27570000
      WRK_FIX_TIME_COM_1     = 'C' |                                    27580000
 /*   WRK_CTRYUSE_TIME_COM_1 = 'C' THEN */                 /* RA01275 */27590000
      WRK_TURN_AROUND_COM_1  = 'C' THEN                    /* RA01275 */27600000
     DO;                                                                27610000
       IF SWITCH_PI THEN                              /* CEDS00000314 */27620000
         USER_FILE_PI.PPT_TIME_COM = 'C';                               27630000
       ELSE IF SWITCH_BAU THEN                        /* CEDS00000314 */27640000
         FILE_RCBDPB1.PPT_TIME_COM = 'C';                               27650000
       IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN      /* RB01298 */ 27660000
         FILE_RCBDPB1.PPT_TIME_COM = 'C';                 /* RB01298 */ 27670000
     END;                                                               27680000
   ELSE IF (VERIFY(WRK_PRT_ONS_TIME_COM_1,'EPT') = 0 &                  27690000
            TB_RCBV470_I.INDNULL(56) ¬= -1)            |                27700000
           (VERIFY(WRK_FIX_TIME_COM_1    ,'EPT') = 0 &                  27710000
            TB_RCBV470_I.INDNULL(38) ¬= -1)            |                27720000
 /*        (VERIFY(WRK_CTRYUSE_TIME_COM_1,'EPT') = 0 & */  /* RA01275 */27730000
           (VERIFY(WRK_TURN_AROUND_COM_1 ,'EPT') = 0 &     /* RA01275 */27740000
            TB_RCBV470_I.INDNULL(47) ¬= -1)            THEN             27750000
          DO;                                                           27760000
            IF SWITCH_PI THEN                         /* CEDS00000314 */27770000
              USER_FILE_PI.PPT_TIME_COM = 'T';                          27780000
            ELSE IF SWITCH_BAU THEN                   /* CEDS00000314 */27790000
              FILE_RCBDPB1.PPT_TIME_COM = 'T';                          27800000
            IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN /* RB01298 */ 27810000
              FILE_RCBDPB1.PPT_TIME_COM = 'T';            /* RB01298 */ 27820000
          END;                                                          27830000
   ELSE IF WRK_PRT_ONS_TIME_COM_1       = 'I' |                         27840000
           WRK_FIX_TIME_COM_1           = 'I' |                         27850000
 /*        WRK_CTRYUSE_TIME_COM_1       = 'I' THEN */      /* RA01275 */27860000
           WRK_TURN_AROUND_COM_1        = 'I' THEN         /* RA01275 */27870000
          DO;                                                           27880000
            IF SWITCH_PI THEN                         /* CEDS00000314 */27890000
              USER_FILE_PI.PPT_TIME_COM = 'I';                          27900000
            ELSE IF SWITCH_BAU THEN                   /* CEDS00000314 */27910000
              FILE_RCBDPB1.PPT_TIME_COM = 'I';                          27920000
           IF ((PI_PPT = TRUE ) | (BAU_PPT = TRUE)) THEN   /* RB01298 */27930000
              FILE_RCBDPB1.PPT_TIME_COM = 'I';             /* RB01298 */27940000
          END;                                                          27950000
   END;                                                                 27960000
 OTHERWISE                                                              27970000
   DO;                                                                  27980000
     CALL RCBDPBM_ERROR (ADDR(RETURN_AREA_BB.RETURN_SQL),               27990000
                         'DB2',                                         28000000
                         '#011');                                       28010000
   END;                                                                 28020000
                                                                        28030000
 END;                                                                   28040000
                                                                        28050000
 END R206_PROCUREMENT_TIME;                                             28060000
                                                    /* EOC : RA01275 */ 28070000
 /********************************************************************/ 28080000
 /* MODULE NAME      :  R402_INIT_CUST_I           PTM 0772          */ 28090000
 /*                                                                  */ 28100000
 /* DESCRIPTION      :                                               */ 28110000
 /*                                                                  */ 28120000
 /********************************************************************/ 28130000
 R402_INIT_CUST_I: PROC;                                                28140000
                                        /* INIT CURSOR CURSOR_CUST_I */ 28150000
 EXEC SQL                                                               28160000
   OPEN CURSOR_CUST_I;                                                  28170000
                                                                        28180000
 SELECT (SQLCODE);                                                      28190000
   WHEN (0);                                                            28200000
   OTHERWISE                                                            28210000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#012');                    28220000
 END;                                                                   28230000
                                                                        28240000
 END R402_INIT_CUST_I;                                                  28250000
                                                                        28260000
1/********************************************************************/ 28270000
 /*                                                                  */ 28280000
 /* MODULE NAME      :  R404_FETCH_CUST_I             PTM 0772       */ 28290000
 /*                                                                  */ 28300000
 /* DESCRIPTION      :                                               */ 28310000
 /*                                                                  */ 28320000
 /********************************************************************/ 28330000
 R404_FETCH_CUST_I: PROC;                                               28340000
                                                                        28350000
 CURSOR_CUST_I_V150 = '';                                               28360000
                                                                        28370000
 EXEC SQL                                                               28380000
   FETCH CURSOR_CUST_I                                                  28390000
     INTO :TB_RCBV150.ZIP_CODE                 :WRK_INDNULL             28400000
         ,:CURSOR_CUST_I_V150.CUSTOMER_NUMBER  :WRK_INDNULL             28410000
         ,:CURSOR_CUST_I_V150.ADDRESS_NUMBER   :WRK_INDNULL             28420000
       ;                                                                28430000
                                                                        28440000
 SELECT (SQLCODE);                                                      28450000
   WHEN (0);                                                            28460000
   WHEN (100)                                                           28470000
   DO;                                                                  28480000
     TB_RCBV150.ZIP_CODE = ' ';                                         28490000
   END;                                                                 28500000
   OTHERWISE                                                            28510000
      CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#013');                   28520000
 END;                                                                   28530000
                                                                        28540000
 END R404_FETCH_CUST_I;                                                 28550000
1/********************************************************************/ 28560000
 /*                                                                  */ 28570000
 /* MODULE NAME      :  R406_END_CUST_I           PTM 0772           */ 28580000
 /*                                                                  */ 28590000
 /* DESCRIPTION      :                                               */ 28600000
 /*                                                                  */ 28610000
 /********************************************************************/ 28620000
 R406_END_CUST_I: PROC;                                                 28630000
                                       /* CLOSE CURSOR CURSOR_CUST_I */ 28640000
 EXEC SQL                                                               28650000
   CLOSE CURSOR_CUST_I;                                                 28660000
                                                                        28670000
 SELECT (SQLCODE);                                                      28680000
   WHEN (0);                                                            28690000
   OTHERWISE                                                            28700000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#014');                    28710000
 END;                                                                   28720000
                                                                        28730000
 END R406_END_CUST_I;                                                   28740000
                                                                        28750000
 /********************************************************************/ 28760000
 /*                                                                  */ 28770000
 /* MODULE NAME      :  R207_INFO_TO_CHECK_INTERNAL_MACHINE          */ 28780000
 /*                                                                  */ 28790000
 /* DESCRIPTION      :  USED TO RETRIEVE CONTRACT NO AND TYPE OF CONT*/ 28800000
 /*                                                                  */ 28810000
 /********************************************************************/ 28820000
 R207_INFO_TO_CHECK_INTERNAL_MACHINE: PROC;           /* SOC RB01290 */ 28830000
                                                                        28840000
   WRK_CONTRACT_NUMBER = '';                                            28850000
   WRK_TYPE_OF_CONTRACT = '';                                           28860000
                                                                        28870000
                                                      /* SOC RB01320 */ 28880000
 IF WRK_REAL_BAU_INDNULL = -1 THEN                                      28890000
 DO;                                                                    28900000
    WRK_ORIGIN  = CURSOR_HW_I_V300.ORIGIN;                              28910000
    WRK_SEQ_NO  = CURSOR_HW_I_V300.SEQUENCE_NUMBER;                     28920000
 END;                                                                   28930000
 ELSE                                                                   28940000
 DO;                                                                    28950000
    WRK_ORIGIN  = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,1,2);                  28960000
    WRK_SEQ_NO  = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,3);                    28970000
 END;                                                 /* EOC RB01320 */ 28980000
 EXEC SQL                                                               28990000
   SELECT A.CONTRACT_NUMBER                                             29000000
     INTO :WRK_CONTRACT_NUMBER  :WRK_CONTRACT_NUMBER_INDNULL            29010000
     FROM RCBV0240_SERV_CTR A                                           29020000
    WHERE A.PRODUCT_TYPE      = :CURSOR_HW_I_V300.PRODUCT_TYPE          29030000
                                                       /* SOC RB01320 */29040000
   /* AND A.ORIGIN            = :CURSOR_HW_I_V300.ORIGIN                29050000
      AND A.SEQUENCE_NUMBER   = :CURSOR_HW_I_V300.SEQUENCE_NUMBER */    29060000
      AND A.ORIGIN            = :WRK_ORIGIN                             29070000
      AND A.SEQUENCE_NUMBER   = :WRK_SEQ_NO            /* EOC RB01320 */29080000
      AND A.COUNTRY_NUMBER    = :WRK_CTRYNO                             29090000
      AND :WRK_RUN_DATE BETWEEN A.EFFECTIVE_DATE AND A.END_DATE         29100000
   ;                                                                    29110000
   SELECT (SQLCODE);                                                    29120000
   WHEN(0)                                                              29130000
   DO;                                                                  29140000
      IF ((WRK_CONTRACT_NUMBER_INDNULL ¬= -1)&                          29150000
          (WRK_CONTRACT_NUMBER ¬= '')) THEN                             29160000
      DO;                                                               29170000
       EXEC SQL                                                         29180000
       SELECT B.TYPE_OF_CONTRACT                                        29190000
         INTO :WRK_TYPE_OF_CONTRACT :WRK_TYPE_OF_CONTRACT_INDNULL       29200000
         FROM RCBV0030_CONTRACT B                                       29210000
        WHERE B.CONTRACT_NUMBER = :WRK_CONTRACT_NUMBER                  29220000
          AND B.COUNTRY_NUMBER = :WRK_CTRYNO                            29230000
       ;                                                                29240000
       SELECT (SQLCODE);                                                29250000
       WHEN(0);                                                         29260000
       WHEN(100);                                                       29270000
       OTHERWISE                                                        29280000
       DO;                                                              29290000
        CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#059');                 29300000
       END;                                                             29310000
       END;                                                             29320000
     END;                                                               29330000
    END;                                                                29340000
    WHEN(100)                                                           29350000
         DO;                       /* IF NO SERV CTR FOUND: ABEND */    29360000
      PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                    29370000
      PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0186';                  29380000
      PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                     29390000
      CALL RCB0M1M (PTR_INT_AREA);                                      29400000
      CALL RCBDPBM_ERROR (NULL, 'OTHER', '#060');                       29410000
         END;                                                           29420000
    OTHERWISE                                                           29430000
           DO;                                                          29440000
            CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#061');             29450000
           END;                                                         29460000
    END;                                                                29470000
                                                                        29480000
 END R207_INFO_TO_CHECK_INTERNAL_MACHINE;             /* EOC RB01290 */ 29490000
1/********************************************************************/ 29500000
 /*                                                                  */ 29510000
 /* MODULE NAME      : R502_TRANS_TPMNT                              */ 29520000
 /*                                                                  */ 29530000
 /* DESCRIPTION      : TRANSLATE TYPE_OF_MAINT TO MACHINE STATUS     */ 29540000
 /*                                                                  */ 29550000
 /********************************************************************/ 29560000
 R502_TRANS_TPMNT : PROC    (TYPE_OF_MAINT)                             29570000
                    RETURNS (CHAR(01));                                 29580000
 DCL TYPE_OF_MAINT  CHAR(01);                                           29590000
 DCL MA_ST          CHAR(01);                                           29600000
 DCL I              FIXED BIN(15);                                      29610000
                                                                        29620000
 MA_ST = '';                                                            29630000
                                                                        29640000
 DO I = 1 TO PARM_RCBP67S.NUMBER_OF_TPMNT;                              29650000
   IF TYPE_OF_MAINT = PARM_RCBP67S.TPMNT_TABLE.TYPE_MNT(I)              29660000
   THEN DO;                                                             29670000
     MA_ST = PARM_RCBP67S.TPMNT_TABLE.MA_ST(I);                         29680000
     I     = 999;                                                       29690000
   END;                                                                 29700000
 END;                                                 /* SOC RB01298 */ 29710000
                                                    /* SOC : RB01281 */ 29720000
 /* WHEN MACHINE IS UNDER FLEXIBLE WARRANTY GET MA STATUS FROM */       29730000
 /* RCB064 PARAMETER, IF RCB064 MA STATUS IS BLANK THEN GET    */       29740000
 /* MA STATUS FROM RCB063 PARAMETER AT GEO LEVEL               */       29750000
                                                                        29760000
 /*IF (FLEXIBLE_WARRANTY_BAU | FLEXIBLE_WARRANTY_PI)                 */ 29770000
 /*THEN                                                              */ 29780000
 /*DO;                                                               */ 29790000
 /* IF F_WARRANTY_MA_STATUS                                          */ 29800000
 /*  THEN                                                            */ 29810000
 /*    DO;                                                           */ 29820000
 /*    IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,1,1)*/ 29830000
 /*   THEN                                                           */ 29840000
 /*      MA_ST = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,2,1);        */ 29850000
 /*   ELSE                                                           */ 29860000
 /*     DO;                                                          */ 29870000
 /*    IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,1,1)*/ 29880000
 /*      THEN                                                        */ 29890000
 /*      MA_ST = SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,2,1);        */ 29900000
 /*     END;                                                         */ 29910000
 /*  END;                                                            */ 29920000
 /*END;                                                              */ 29930000
                                                      /* EOC RB01281 */ 29940000
  IF (FLEXIBLE_WARRANTY_BAU | SWITCH_FW_PI)                             29950000
                                                                        29960000
     THEN DO;                                                           29970000
       IF SWITCH_MA_ST_COUNTRY = TRUE                                   29980000
          THEN DO I = 1 TO PARM_RCBP71S.NUMBER_OF_TPMNT;                29990000
                IF TYPE_OF_MAINT = PARM_RCBP71S.TPMNT_TABLE.TYPE_MNT(I) 30000000
                   THEN DO;                                             30010000
                       MA_ST = PARM_RCBP71S.TPMNT_TABLE.MA_ST(I);       30020000
                       I     = 999;                                     30030000
                        END;                                            30040000
               END;                                                     30050000
     END;                                                               30060000
                                                      /* EOC RB01298 */ 30070000
                                                                        30080000
 RETURN(MA_ST);                                                         30090000
                                                                        30100000
 END R502_TRANS_TPMNT;                                                  30110000
                                                                        30120000
1/********************************************************************/ 30130000
 /*                                                                  */ 30140000
 /* MODULE NAME      : R504_TRANS_DATE                               */ 30150000
 /*                                                                  */ 30160000
 /* DESCRIPTION      : TRANSLATE DB2 DATE FORMAT TO EXTRACT FILE     */ 30170000
 /*                    DATE FORMAT WITH RESPECT FOR OPEN END DATES   */ 30180000
 /*                                                                  */ 30190000
 /********************************************************************/ 30200000
 R504_TRANS_DATE: PROC    (DB2_DATE_IN)                                 30210000
                  RETURNS (CHAR(06));                                   30220000
                                                                        30230000
 DCL DB2_DATE_IN  CHAR(10);                                             30240000
                                                                        30250000
 IF DB2_DATE_IN = WRK_OPEN_DATE_CH10                                    30260000
 THEN                                                                   30270000
   RETURN(WRK_OPEN_DATE_CH6);                                           30280000
 ELSE                                                                   30290000
   RETURN(TRANSLATE('YRMNDA',DB2_DATE_IN ,'CEYR-MN-DA'));               30300000
                                                                        30310000
 END R504_TRANS_DATE;                                                   30320000
                                                                        30330000
1/********************************************************************/ 30340000
 /*                                                                  */ 30350000
 /* MODULE NAME      :  R600_INIT_CURR_HW                            */ 30360000
 /*                                                                  */ 30370000
 /* DESCRIPTION      : INITIALIZE KEY FIELDS                         */ 30380000
 /*                                                                  */ 30390000
 /********************************************************************/ 30400000
 R600_INIT_CURR_HW: PROC;                                               30410000
                                                      /* SOC RB01237 */ 30420000
 SWITCH_BAU        = FALSE;                                             30430000
 SWITCH_PI         = FALSE;                                             30440000
 FILE_RCBDPB1      = '';                                                30450000
 USER_FILE_RCBDPB1 = '';                                                30460000
 USER_FILE_BAU     = '';                                                30470000
 USER_FILE_PI      = '';                                                30480000
                                                                        30490000
                                       /* DETERMINE SMALLEST KEY     */ 30500000
 IF SK_HW_I_1 < SK_HW_O_1                                               30510000
 THEN DO;                                                               30520000
   IF SK_HW_I_1 < SK_HW_PI_1 THEN      /* INST. HW SMALLEST KEY      */ 30530000
     SK_CURRENT_HW = SK_HW_I;                                           30540000
   ELSE                                                                 30550000
     SK_CURRENT_HW = SK_HW_PI;         /* PI HW SMALLEST KEY         */ 30560000
 END;                                                                   30570000
 ELSE DO;                                                               30580000
   IF SK_HW_O_1 < SK_HW_I_1                                             30590000
   THEN DO;                                                             30600000
     IF SK_HW_O_1 < SK_HW_PI_1 THEN                                     30610000
       SK_CURRENT_HW = SK_HW_O;        /* ON-ORDER HW SMALLEST KEY   */ 30620000
     ELSE                                                               30630000
       SK_CURRENT_HW = SK_HW_PI;       /* PI HW SMALLEST KEY         */ 30640000
   END;                                                                 30650000
   ELSE DO;                            /* INST. AND ON-ORDER SAME KEY*/ 30660000
     IF SK_HW_PI_1 < SK_HW_I_1 THEN                                     30670000
       SK_CURRENT_HW = SK_HW_PI;       /* PI HW SMALLEST KEY         */ 30680000
     ELSE                                                               30690000
       SK_CURRENT_HW = SK_HW_I;        /* INST/ON-ORDER SMALLEST KEY */ 30700000
   END;                                                                 30710000
 END;                                                                   30720000
                                                      /* EOC RB01237 */ 30730000
 /*------------------ START RC01141 CHANGES -------------------------*/ 30740000
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_CURRENT_HW);                    30750000
 /*-------------------- END RC01141 CHANGES -------------------------*/ 30760000
                                                                        30770000
 END R600_INIT_CURR_HW;                                                 30780000
                                                                        30790000
1/********************************************************************/ 30800000
 /*                                                      SOC RB01237 */ 30810000
 /* MODULE NAME      :  R620_PROC_USER_EXIT5                         */ 30820000
 /*                                                                  */ 30830000
 /* DESCRIPTION      : INVOKE USER EXIT ROUTINE RCBDP5U              */ 30840000
 /*                                                                  */ 30850000
 /********************************************************************/ 30860000
 R620_PROC_USER_EXIT5: PROC;                                            30870000
 IF SWITCH_USER_EXIT5 = TRUE                                            30880000
 THEN DO;                                                               30890000
   WRK_SAVE.PRODUCT_TYPE    = FILE_RCBDPB1.PRODUCT_TYPE;                30900000
   WRK_SAVE.ORIGIN          = FILE_RCBDPB1.ORIGIN;                      30910000
   WRK_SAVE.SEQUENCE_NUMBER = FILE_RCBDPB1.SEQUENCE_NUMBER;             30920000
                                                                        30930000
   USER_FILE_RCBDPB1 = FILE_RCBDPB1, BY NAME;                           30940000
                                                                        30950000
   IF DATA_ORIGIN = '2'                                                 30960000
   THEN DO;                                                             30970000
               /*****************************************************/  30980000
               /* PREFER PI IF BAU HAS STATUS 3 AND PI NOT          */  30990000
               /*****************************************************/  31000000
  /* IF VERIFY(USER_FILE_RCBDPB1.TYPE_MNT,              SOC RB01298 */  31010000
  /*              WRK_TPMNT_VAL.TPMNT_ST3) = '0'                    */  31020000
  /* THEN DO;                                                       */  31030000
  /*   IF VERIFY(USER_FILE_PI.TYPE_MNT,                             */  31040000
  /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0'                      */  31050000
  /*   THEN                                                         */  31060000
  /*     USER_FILE_RCBDPB1= USER_FILE_PI, BY NAME ;                 */  31070000
  /* END;                                                           */  31080000
                /*****************************************************/ 31090000
                /* PREFER PI IF BAU HAS CONTRACT AND PI A WARRANTY   */ 31100000
                /*****************************************************/ 31110000
 /*  ELSE DO;                                            EOC RB01298 */ 31120000
 /*  IF VERIFY(USER_FILE_RCBDPB1.TYPE_MNT,               SOC RB01278 */ 31130000
 /*                 WRK_TPMNT_VAL.TPMNT_WAR) = '0'                   */ 31140000
 /*    THEN DO;                                                      */ 31150000
 /*      IF WRK_SAV_CONTR_NR ¬= ''                                   */ 31160000
 /*      THEN                                                        */ 31170000
 /*      USER_FILE_RCBDPB1 = USER_FILE_PI, BY NAME ;                 */ 31180000
 /*         END;                                                     */ 31190000
 /*  END;                                                 EOC RB01278*/ 31200000
 /*    IF (VERIFY(USER_FILE_RCBDPB1.TYPE_MNT,             SOC RB01298*/ 31210000
 /*                WRK_TPMNT_VAL.TPMNT_WAR) ¬= '0' |                 */ 31220000
 /*       VERIFY(USER_FILE_RCBDPB1.TYPE_MNT,          /* SOC RB01281 */ 31230000
 /*       SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,1,1)) ¬= '0')       */ 31240000
 /*        THEN DO;                                                  */ 31250000
 /*          IF (VERIFY(USER_FILE_PI.TYPE_MNT,                       */ 31260000
 /*                    WRK_TPMNT_VAL.TPMNT_WAR) = '0' |              */ 31270000
 /*       VERIFY(USER_FILE_PI.TYPE_MNT,                              */ 31280000
 /*       SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,1,1)) = '0') THEN   */ 31290000
 /*             USER_FILE_RCBDPB1 = USER_FILE_PI,BY NAME;            */ 31300000
 /*        END;                                       /* EOC RB01281 */ 31310000
 /*    END;                                           /* EOC RB01278 */ 31320000
                                                      /* EOC RB01298 */ 31330000
                                                                        31340000
     IF SUBSTR(FILE_RCBDPB1.CUST_NO,1,2) = 'CI'                         31350000
     THEN DO;                                                           31360000
       USER_FILE_RCBDPB1.CUST_NO = USER_FILE_BAU.CUST_NO;               31370000
     END;                                                               31380000
   END;                                                                 31390000
                                                                        31400000
   CALL RCBDP5U (ADDR(SWITCH_USER_EXIT5)                                31410000
                ,ADDR(DATA_ORIGIN)                                      31420000
                ,ADDR(USER_FILE_RCBDPB1)                                31430000
                ,ADDR(USER_FILE_PI)                                     31440000
                ,ADDR(USER_FILE_BAU)                                    31450000
                ,PTR_INT_AREA);                                         31460000
                                                                        31470000
   IF SWITCH_USER_EXIT5 = TRUE                                          31480000
   THEN DO;                                                             31490000
     FILE_RCBDPB1 = USER_FILE_RCBDPB1, BY NAME;                         31500000
                       /* THE TOS IS NOT ALLOWED TO BE OVERWRITTEN ! */ 31510000
     FILE_RCBDPB1.CTRYNO          = WRK_CTRYNO;                         31520000
     FILE_RCBDPB1.PRODUCT_TYPE    = WRK_SAVE.PRODUCT_TYPE;              31530000
     FILE_RCBDPB1.ORIGIN          = WRK_SAVE.ORIGIN;                    31540000
     FILE_RCBDPB1.SEQUENCE_NUMBER = WRK_SAVE.SEQUENCE_NUMBER;           31550000
     FILE_RCBDPB1.MA_TYPE         = WRK_SAVE.PRODUCT_TYPE;              31560000
     FILE_RCBDPB1.MA_ORIGIN       = WRK_SAVE.ORIGIN;                    31570000
     FILE_RCBDPB1.MA_SER_NO       = WRK_SAVE.SEQUENCE_NUMBER;           31580000
   END;                                                                 31590000
 END;                                                                   31600000
                                                                        31610000
 END R620_PROC_USER_EXIT5;                                              31620000
                                                      /* EOC RB01237 */ 31630000
1/********************************************************************/ 31640000
 /*                                                      SOC RB01237 */ 31650000
 /* MODULE NAME      :  R699_END_CURR_HW                             */ 31660000
 /*                                                                  */ 31670000
 /* DESCRIPTION      : END PROCESSING FOR CURRENT HW KEY             */ 31680000
 /*                                                                  */ 31690000
 /********************************************************************/ 31700000
 R699_END_CURR_HW: PROC;                                                31710000
 SWITCH_CONSIDER_PRT = FALSE;                             /* RB01298 */ 31720000
                                                                        31730000
 IF SWITCH_BAU = TRUE THEN                                              31740000
   DO;                                                                  31750000
     IF SWITCH_PI = TRUE THEN                                           31760000
       DO;                   /* BOTH BAU AND PI PRESENTED TO RCBDP5U */ 31770000
                                                          /* RB01289 */ 31780000
 /*      IF USER_FILE_PI.CUST_NO = ''            /* ONLY T241 ENTRY  */ 31790000
 /*          USER_FILE_PI.CUST_NO   = FILE_RCBDPB1.CUST_NO; /*RB01289*/ 31800000
         IF (WRK_PI_ORIGIN_TEMP = 'T241')                 /* RB01289 */ 31810000
           THEN DO;                                                     31820000
             IF USER_FILE_PI.CUST_NO = '' THEN DO;                      31830000
               USER_FILE_PI.CUST_NO   = FILE_RCBDPB1.CUST_NO;           31840000
               USER_FILE_PI.ZIPCODE   = FILE_RCBDPB1.ZIPCODE;           31850000
             END;                                        /* RB01289 */  31860000
             USER_FILE_PI.MABO      = FILE_RCBDPB1.MABO;                31870000
             USER_FILE_PI.MA_MODEL  = FILE_RCBDPB1.MA_MODEL;            31880000
             USER_FILE_PI.INST_DATE = FILE_RCBDPB1.INST_DATE;           31890000
         END;                                                           31900000
                                                                        31910000
         DATA_ORIGIN   = '2';             /* ORIGIN OF DATA: BOTH   */  31920000
                                                     /* SOC RB01298 */  31930000
     /* IMPLEMETATION OF CHANGES TO MACHINE STATUS AND SERVICE DETAILS  31940000
                                            AS PART OF TREC 39-40   */  31950000
      IF (FILE_RCBDPB1.ZIPCODE  = '')|                                  31960000
         (FILE_RCBDPB1.MA_MODEL = '')|                                  31970000
         (FILE_RCBDPB1.CUST_NO  = '') THEN                              31980000
         DO;                                                            31990000
                        /*  IF THE SWITCH IS FALSE THEN BAU IS SENT */  32000000
            SWITCH_CONSIDER_PRT = TRUE;                                 32010000
         END;                                                           32020000
   /* IF (SWITCH_CONSIDER_PRT & SWITCH_NNHOOD) THEN   SOC CEDS00000515  32030000
       DO;                                                              32040000
         IF (BAU_INS_WARRANTY = TRUE & PI_CONTRACT = TRUE)              32050000
           THEN DO;                                                     32060000
                 FILE_RCBDPB1.SLC = USER_FILE_PI.SLC;                   32070000
                 PI_PPT = TRUE;                                         32080000
                 CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);          32090000
                END;                                                    32100000
         IF (BAU_INS_WARRANTY = TRUE & PI_WARRANTY = TRUE)              32110000
           THEN DO;                                                     32120000
                 BAU_PPT = TRUE;                                        32130000
                 CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);          32140000
                END;                                                    32150000
         IF (BAU_INS_CONTRACT = TRUE & PI_WARRANTY = TRUE)              32160000
           THEN DO;                                                     32170000
                 FILE_RCBDPB1.TYPE_MNT = USER_FILE_PI.TYPE_MNT;         32180000
                 FILE_RCBDPB1.MA_STATUS = USER_FILE_PI.MA_STATUS;       32190000
                 BAU_PPT = TRUE;                                        32200000
                 CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);          32210000
                END;                                                    32220000
         IF (BAU_INS_CONTRACT = TRUE & PI_CONTRACT = TRUE)              32230000
           THEN DO;                                                     32240000
                 BAU_PPT = TRUE;                                        32250000
                 CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);          32260000
                END;                                                    32270000
         IF (SWITCH_PERCALL_BAU = TRUE & SWITCH_PERCALL_PI = FALSE)     32280000
           THEN DO;                                                     32290000
                  FILE_RCBDPB1 = USER_FILE_PI, BY NAME ;                32300000
                END;                                                    32310000
         IF (BAU_ORD_WARRANTY = TRUE & PI_CONTRACT = TRUE)              32320000
           THEN DO;                                                     32330000
                 FILE_RCBDPB1.SLC = USER_FILE_PI.SLC;                   32340000
                 PI_PPT = TRUE;                                         32350000
                 CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);          32360000
                END;                                                    32370000
         IF (BAU_ORD_CONTRACT= TRUE & PI_WARRANTY = TRUE)               32380000
           THEN DO;                                                     32390000
                 FILE_RCBDPB1.TYPE_MNT = USER_FILE_PI.TYPE_MNT;         32400000
                 FILE_RCBDPB1.MA_STATUS = USER_FILE_PI.MA_STATUS;       32410000
                END;                                                    32420000
                    /* END OF CHANGES TO CODE AS PART OF TREC 39-40  */ 32430000
                                                      /* EOC RB01298 */ 32440000
   /* END;                                          EOC CEDS00000515 */ 32450000
                                                                        32460000
       SELECT;     /*  FOR MA STATUS DETERMINATION  SOC CEDS00000515*/  32470000
         WHEN(BAU_INS_WARRANTY);                                        32480000
         WHEN(BAU_ORD_WARRANTY);                                        32490000
         WHEN(PI_WARRANTY) DO;                                          32500000
           FILE_RCBDPB1.TYPE_MNT  = USER_FILE_PI.TYPE_MNT;              32510000
           FILE_RCBDPB1.MA_STATUS = USER_FILE_PI.MA_STATUS;             32520000
         END;                                                           32530000
         WHEN(BAU_INS_CONTRACT);                                        32540000
         WHEN(BAU_ORD_CONTRACT);                                        32550000
         WHEN(PI_CONTRACT) DO;                                          32560000
           FILE_RCBDPB1.TYPE_MNT  = USER_FILE_PI.TYPE_MNT;              32570000
           FILE_RCBDPB1.MA_STATUS = USER_FILE_PI.MA_STATUS;             32580000
         END;                                                           32590000
         WHEN(SWITCH_PERCALL_BAU);                                      32600000
         WHEN(SWITCH_PERCALL_PI) DO;                                    32610000
           FILE_RCBDPB1.TYPE_MNT  = USER_FILE_PI.TYPE_MNT;              32620000
           FILE_RCBDPB1.MA_STATUS = USER_FILE_PI.MA_STATUS;             32630000
         END;                                                           32640000
         OTHERWISE;                                                     32650000
       END;                                                             32660000
                                                                        32670000
       SELECT;    /* FOR SLC DETERMINATION  */                          32680000
         WHEN(BAU_INS_CONTRACT);                                        32690000
         WHEN(PI_CONTRACT) DO;                                          32700000
          IF SWITCH_NNHOOD THEN DO;                                     32710000
           FILE_RCBDPB1.SLC = USER_FILE_PI.SLC;                         32720000
           PI_PPT = TRUE;                                               32730000
           CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);                32740000
          END;                                                          32750000
         END;                                                           32760000
         WHEN(BAU_INS_WARRANTY);                                        32770000
         WHEN(PI_WARRANTY) DO;                                          32780000
          IF SWITCH_NNHOOD THEN DO;                                     32790000
           FILE_RCBDPB1.SLC = USER_FILE_PI.SLC;                         32800000
           PI_PPT = TRUE;                                               32810000
           CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);                32820000
          END;                                                          32830000
         END;                                                           32840000
         WHEN(SWITCH_PERCALL_BAU);                                      32850000
         WHEN(SWITCH_PERCALL_PI) DO;                                    32860000
          IF SWITCH_NNHOOD THEN DO;                                     32870000
           FILE_RCBDPB1.SLC = USER_FILE_PI.SLC;                         32880000
           PI_PPT = TRUE;                                               32890000
           CALL R206_PROCUREMENT_TIME(FILE_RCBDPB1.SLC);                32900000
          END;                                                          32910000
         END;                                                           32920000
         OTHERWISE;                                                     32930000
       END;                                                             32940000
                                                                        32950000
       IF (SWITCH_PERCALL_BAU = TRUE & SWITCH_PERCALL_PI = FALSE)       32960000
         THEN DO;                                                       32970000
                FILE_RCBDPB1 = USER_FILE_PI, BY NAME ;                  32980000
              END;                                                      32990000
                                                 /* EOC CEDS00000515 */ 33000000
         USER_FILE_BAU = FILE_RCBDPB1, BY NAME;                         33010000
         CALL R620_PROC_USER_EXIT5;                                     33020000
                                                                        33030000
         IF ¬ PERCALL_TYPE_INST THEN                      /* RA01275 */ 33040000
           CALL R300_WRITE_RCBDPB1;                                     33050000
      PI_PPT = FALSE;                                     /* RB01298 */ 33060000
      BAU_PPT = FALSE;                                    /* RB01298 */ 33070000
     END;                                                               33080000
   ELSE DO;                              /* BAU PRESENTED TO RCBDP5U */ 33090000
                                                                        33100000
         DATA_ORIGIN   = '0';           /* ORIGIN OF DATA: BAU CEDS  */ 33110000
         USER_FILE_PI  = '';                                            33120000
         USER_FILE_BAU = FILE_RCBDPB1, BY NAME;                         33130000
                                                                        33140000
         CALL R620_PROC_USER_EXIT5;                                     33150000
                                                                        33160000
         IF ¬ PERCALL_TYPE_INST THEN                      /* RA01275 */ 33170000
           CALL R300_WRITE_RCBDPB1;                                     33180000
   END;                                                                 33190000
 END;                                                                   33200000
 ELSE DO;                                                               33210000
   IF ((SWITCH_PI = TRUE) &           /* ONLY PI PRESENTED TO RCBDP5U */33220000
                                                       /* SOC RB01289 */33230000
      ((WRK_PI_ORIGIN_TEMP = 'BOTH') | (WRK_PI_ORIGIN_TEMP = 'T051'))   33240000
 /*  & USER_FILE_PI.CUST_NO ¬= ''              /* T051 ENTRY PRESENT  */33250000
                                                       /* EOC RB01289 */33260000
                                                    /* SOC : RA01275 */ 33270000
    & (WRK_NNHOOD_VALUE ¬= '2' |                                        33280000
      (WRK_NNHOOD_VALUE  = '2' & USER_FILE_PI.PPT_TIME_COM ='C')))      33290000
                                                    /* EOC : RA01275 */ 33300000
   THEN DO;                                                             33310000
     DATA_ORIGIN   = '1';             /* ORIGIN OF DATA: PRIME INPUT */ 33320000
     FILE_RCBDPB1  = USER_FILE_PI, BY NAME;                             33330000
     USER_FILE_BAU = '';                                                33340000
                                                                        33350000
     CALL R620_PROC_USER_EXIT5;                                         33360000
     IF ¬ PERCALL_TYPE_PI THEN                            /* RA01275 */ 33370000
       CALL R300_WRITE_RCBDPB1;                                         33380000
   END;                                                                 33390000
 END;                                                                   33400000
                                                                        33410000
 SWITCH_PERCALL_BAU = FALSE;                     /* SOC CEDS00000515 */ 33420000
 /*PERCALL_TYPE_INST = FALSE;*/                      /* CEDS00000795 */ 33430033
 BAU_INS_WARRANTY  = FALSE;                                             33440000
 BAU_ORD_WARRANTY  = FALSE;                                             33450000
 BAU_INS_CONTRACT  = FALSE;                                             33460000
 BAU_ORD_CONTRACT  = FALSE;                                             33470000
                                                 /* EOC CEDS00000515 */ 33480000
 END R699_END_CURR_HW;                                                  33490000
                                                      /* EOC RB01237 */ 33500000
1/********************************************************************/ 33510000
 /*                                                                  */ 33520000
 /* MODULE NAME      : R700_INIT_COUNTRY                             */ 33530000
 /*                                                                  */ 33540000
 /* DESCRIPTION      : OPEN AND INTITIAL FETCH CURSORS               */ 33550000
 /*                                                                  */ 33560000
 /********************************************************************/ 33570000
 R700_INIT_COUNTRY:    PROC;                                            33580000
                                                      /* SOC RB01237 */ 33590000
 /* SWITCH_USER_EXIT  = FALSE;                          CEDS00000415 */ 33600000
 /* SWITCH_USER_EXIT5 = FALSE;                          CEDS00000415 */ 33610000
                                                      /* EOC RB01237 */ 33620000
                                             /* FILL CURRENT COUNTRY */ 33630000
 WRK_PROC_ID     = COUNTRY_AREA.PROC_ID;                                33640000
 WRK_CTRYNO      = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).CTRYNO;       33650000
 WRK_PGR_TYPE    = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).PGR_TYPE;     33660000
 WRK_CNT_COUNTRY = 0;                                                   33670000
 SWITCH_MA_ST_COUNTRY = FALSE;                            /* RB01298 */ 33680000
                                                    /* SOC : RC01273 */ 33690000
                                        /* RETRIEVE PARAMETER RCB039 */ 33700000
 TB_RCBV500                 = '';                                       33710000
 TB_RCBV500_I               = '';                                       33720000
 TB_RCBP39S.NUMBER          = 'RCB039';                                 33730000
 TB_RCBP39S.EXTRA_KEY       = WRK_PROC_ID || WRK_CTRYNO;                33740000
 EXCLUDE_PER_CALL           = FALSE;                                    33750000
 SWITCH_NNHOOD              = FALSE;                      /* RA01275 */ 33760000
 WRK_NNHOOD_VALUE           = '0';                        /* RA01275 */ 33770000
                                                                        33780000
 CALL RCBI50M ('U',                                                     33790000
               ADDR (TB_RCBV500),                                       33800000
               ADDR (TB_RCBV500_I),                                     33810000
               PTR_RETURN_AREA_BB,                                      33820000
               PTR_INT_AREA);                                           33830000
                                                                        33840000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    33850000
   WHEN (0)                                                             33860000
       DO;                                                              33870000
          IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,1,1) = 'Y' THEN          33880000
            EXCLUDE_PER_CALL = TRUE;                                    33890000
                                                    /* SOC : RA01275 */ 33900000
          IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1)  = ' ' THEN         33910000
            WRK_NNHOOD_VALUE = '0';                                     33920000
          ELSE IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1) ¬= '0' THEN    33930000
            DO;                                                         33940000
              SWITCH_NNHOOD    = TRUE;                                  33950000
              WRK_NNHOOD_VALUE = SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1);33960000
            END;                                                        33970000
                                                    /* EOC : RA01275 */ 33980000
       END;                                                             33990000
     WHEN (4)                                                           34000000
       DO;                                                              34010000
                               /* INSERT THE PARAMETER INTO 500_PARM */ 34020000
         TB_RCBV500.PARAMETER_VALUE  = 'N0' ;             /* RA01275 */ 34030000
         CALL RCBF50M (ADDR (TB_RCBV500),                               34040000
                       ADDR (TB_RCBV500_I),                             34050000
                       PTR_RETURN_AREA_BB,                              34060000
                       PTR_INT_AREA);                                   34070000
         SELECT (RETURN_AREA_BB.RETURN_CODE);                           34080000
           WHEN (0);                                                    34090000
           OTHERWISE                                                    34100000
             CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),      34110000
                                 'DB2','#015');                         34120000
         END;                                                           34130000
       END;                                                             34140000
    OTHERWISE                                                           34150000
      DO;                                                               34160000
         CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          34170000
                     'DB2',                                             34180000
                     '#016');                                           34190000
      END;                                                              34200000
  END;                                                                  34210000
                                                    /* EOC : RC01273 */ 34220000
                                                /* LOCK TABLES       */ 34230000
 CALL R702_LOCK_TABLES;                                                 34240000
                                                /* RETRIEVE RUN DATE */ 34250000
 RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                       34260000
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 34270000
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               34280000
                                                                        34290000
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       34300000
               PTR_INT_AREA);                                           34310000
                                                                        34320000
 IF RUN_DATE_AREA.RUN_DATE = ''       /* NO RUN DATE RCB001 FOUND    */ 34330000
 THEN                                                                   34340000
   WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                            34350000
 ELSE                                                                   34360000
   WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                               34370000
                                                                        34380000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           34390000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 34400000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               34410000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   34420000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 34430000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         34440000
 CALL RCB0M1M (PTR_INT_AREA);                                           34450000
                                                    /* SOC : RB01278 */ 34460000
                                                      /* SOC RC01362 */ 34461025
 /*TB_RCBV500           = '';                  /* RETRIEVE PARAMETER */ 34470019
 /*TB_RCBV500_I         = '';                                           34480019
 TB_RCBP103S.NUMBER   = 'RCB103';                                       34490000
 TB_RCBP103S.CTRYNO   = WRK_CTRYNO;                                     34500000
 TB_RCBP103S.PGR_TYPE = WRK_PGR_TYPE;                                   34510000
                                                                        34520000
 CALL RCBI50M ('U',                                                     34530000
               ADDR(TB_RCBV500),                                        34540000
               ADDR(TB_RCBV500_I),                                      34550000
               PTR_RETURN_AREA_BB,                                      34560000
               PTR_INT_AREA);                                           34570000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    34580000
   WHEN(0)                                                              34590000
     DO;                                                                34600000
       PARM_RCBP103S =  TB_RCBP103S, BY NAME;                           34610000
       IF PARM_RCBP103S.SRV_ON_BEHF_OF_VENDOR = 'Y' THEN                34620000
          SWITCH_VENDOR_SERVICE = TRUE;                                 34630000
       ELSE                                                             34640000
          SWITCH_VENDOR_SERVICE = FALSE;                                34650000
     END;                                                               34660000
   WHEN(4)                                        /* NO RECORD FOUND */ 34670000
 /*  DO;                                                                34680019
       SWITCH_VENDOR_SERVICE = FALSE;                                   34690000
     END;                                                               34700000
   OTHERWISE                                                            34710000
     DO;                                                                34720000
       CALL RCBDPBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),              34730000
                          'DB2',                                        34740000
                          '#017');                                      34750000
     END;                                                               34760000
 END;                                               /* EOC : RB01278 */ 34770000
                                                      /* EOC RC01362 */ 34771025
                                                    /* SOC : RB01281 */ 34780000
                                        /* RETRIEVE PARAMETER RCB064 */ 34790000
 /* GET MA_STATUS FROM RCB064 AT COUNTRY LEVEL THAT WILL BE  */         34800000
 /* APPLIED FOR FLEXIBLE WARRANTY MACHINES OF THAT COUNTRY   */         34810000
                                                                        34820000
 TB_RCBV500                 = '';                                       34830000
 TB_RCBV500_I               = '';                                       34840000
 TB_RCBP64S.NUMBER          = 'RCB064';                                 34850000
 TB_RCBP64S.CTRYNO          = WRK_CTRYNO;                               34860000
                                                                        34870000
 CALL RCBI50M ('U',                                                     34880000
               ADDR (TB_RCBV500),                                       34890000
               ADDR (TB_RCBV500_I),                                     34900000
               PTR_RETURN_AREA_BB,                                      34910000
               PTR_INT_AREA);                                           34920000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   34930000
   WHEN(0)                                                              34940000
     DO;                                                                34950000
      PARM_RCBP64S = TB_RCBP64S, BY NAME;                               34960000
                                                      /* SOC RB01298 */ 34970000
     /* IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1) ¬= ' ' |           */ 34980000
     /*    F_WARRANTY_MA_STATUS_GEO THEN                             */ 34990000
     /*    F_WARRANTY_MA_STATUS                    = TRUE;           */ 35000000
                                                                        35010000
        WRK_FWTOW = PARM_RCBP64S.F_WARRANTY_MACHINE;                    35020000
                                                      /* EOC RB01298 */ 35030000
     END;                                                               35040000
   WHEN(4)                                                              35050000
     DO;                                                                35060000
     /* IF F_WARRANTY_MA_STATUS_GEO THEN              /* SOC RB01298 */ 35070000
     /*    F_WARRANTY_MA_STATUS                    = TRUE;           */ 35080000
      WRK_FWTOW = PARM_RCBP63S.F_WARRANTY_MACHINE;    /* EOC RB01298 */ 35090000
     END;                                                               35100000
 END;                                                                   35110000
                                                    /* EOC : RB01281 */ 35120000
                                                      /* SOC RB01298 */ 35130000
 TB_RCBV500                 = '';                                       35140000
 TB_RCBV500_I               = '';                                       35150000
 TB_RCBP71S.NUMBER          = 'RCB071';                                 35160000
 TB_RCBP71S.CTRYNO          = WRK_CTRYNO;                               35170000
                                                                        35180000
 CALL RCBI50M ('U',                                                     35190000
               ADDR (TB_RCBV500),                                       35200000
               ADDR (TB_RCBV500_I),                                     35210000
               PTR_RETURN_AREA_BB,                                      35220000
               PTR_INT_AREA);                                           35230000
                                                                        35240000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   35250000
   WHEN(0)                                                              35260000
     DO;                                                                35270000
      PARM_RCBP71S = TB_RCBP71S, BY NAME;                               35280000
      IF SUBSTR (TB_RCBV500.PARAMETER_VALUE, 2, 1) ¬= ' ' THEN          35290000
              SWITCH_MA_ST_COUNTRY = TRUE;                              35300000
     END;                                                               35310000
   OTHERWISE                                                            35320000
              SWITCH_MA_ST_COUNTRY = FALSE;                             35330000
 END;                                                                   35340000
                                                      /* EOC RB01298 */ 35350000
                                                      /* SOC RB01237 */ 35360000
 TB_RCBV500          = '';                  /* RETRIEVE EXTRACT PARM */ 35370000
 TB_RCBV500_I        = '';                                              35380000
 TB_RCBP05S.NUMBER   = 'RCB005';                                        35390000
 TB_RCBP05S.CTRYNO   = WRK_CTRYNO;                                      35400000
 TB_RCBP05S.PGR_TYPE = WRK_PGR_TYPE;                                    35410000
                                                                        35420000
 CALL RCBI50M ('U',                                                     35430000
               ADDR(TB_RCBV500),                                        35440000
               ADDR(TB_RCBV500_I),                                      35450000
               PTR_RETURN_AREA_BB,                                      35460000
               PTR_INT_AREA);                                           35470000
                                                                        35480000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    35490000
   WHEN (0)                                                             35500000
     PARM_RCB005 = TB_RCBP05S, BY NAME;                                 35510000
   WHEN (4)                               /* NO EXTRACT PARM FOUND   */ 35520000
     PARM_RCB005.PI_TO_CEREOLS = 'N';                                   35530000
   OTHERWISE                                                            35540000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              35550000
                         'DB2','#018');                                 35560000
 END;                                                                   35570000
 IF PARM_RCB005.PI_TO_CEREOLS = 'Y'    /* PRIME INPUT IN INTERFACE ? */ 35580000
 THEN DO;                                                               35590000
   EXEC SQL                              /* INIT CURSOR CURSOR_HW_PI */ 35610000
     OPEN CURSOR_HW_PI;                                                 35620000
                                                                        35640000
   SELECT (SQLCODE);                                                    35650000
     WHEN (0);                                                          35660000
     OTHERWISE                                                          35670000
       CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#019');                  35680000
   END;                                                                 35690000
                            /* FETCH FIRST OCCURENCE OF CURSOR_HW_PI */ 35700000
   CALL R224_FETCH_CURSOR_HW_PI;                                        35710000
 END;                                                                   35720000
 ELSE DO;                                /* NO PRIME INPUT           */ 35730000
   SWITCH_EOC_CURSOR_HW_PI = TRUE;                                      35740000
   SK_HW_PI.EOF            = '1';                                       35750000
 END;                                                                   35760000
                                                      /* EOC RB01237 */ 35770000
                                         /* INIT CURSOR CURSOR_HW_I  */ 35780000
 EXEC SQL                                                               35800000
   OPEN CURSOR_HW_I;                                                    35810000
                                                                        35830000
 SELECT (SQLCODE);                                                      35840000
   WHEN (0);                                                            35850000
   OTHERWISE                                                            35860000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#020');                    35870000
 END;                                                                   35880000
                            /* FETCH FIRST OCCURENCE OF CURSOR_HW_I  */ 35890000
 CALL R204_FETCH_CURSOR_HW_I;                                           35900000
                                         /* INIT CURSOR CURSOR_HW_O  */ 35910000
 EXEC SQL                                                               35920000
   OPEN CURSOR_HW_O;                                                    35930000
                                                                        35940000
 SELECT (SQLCODE);                                                      35950000
   WHEN (0);                                                            35960000
   OTHERWISE                                                            35970000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#021');                    35980000
 END;                                                                   35990000
                            /* FETCH FIRST OCCURENCE OF CURSOR_HW_O  */ 36000000
 CALL R214_FETCH_CURSOR_HW_O;                                           36010000
                                                                        36020000
 END R700_INIT_COUNTRY;                                                 36030000
1/********************************************************************/ 36040000
 /*                                                                  */ 36050000
 /* MODULE NAME      : R702_LOCK_TABLES                              */ 36060000
 /*                                                                  */ 36070000
 /* DESCRIPTION      :                                               */ 36080000
 /*                                                                  */ 36090000
 /********************************************************************/ 36100000
 R702_LOCK_TABLES: PROC;                                                36110000
                                                                        36120000
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 36130000
                                                      /* SOC RB01290 */ 36140000
 /********************************************************************/ 36150000
                                                                        36160000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0030_CONTRACT';                     36170000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36180000
                                                                        36190000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36200000
               PTR_RETURN_AREA_BB,                                      36210000
               PTR_INT_AREA);                                           36220000
                                                                        36230000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36240000
   WHEN (0);                                                            36250000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36260000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#062');                        36270000
   OTHERWISE                                                            36280000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36290000
                           'DB2','#063');                               36300000
 END;                                                                   36310000
                                                      /* EOC RB01290 */ 36320000
                                                                        36330000
 /********************************************************************/ 36340000
                                                                        36350000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0040_OU';                           36360000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36370000
                                                                        36380000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36390000
               PTR_RETURN_AREA_BB,                                      36400000
               PTR_INT_AREA);                                           36410000
                                                                        36420000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36430000
   WHEN (0);                                                            36440000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36450000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#022');                        36460000
   OTHERWISE                                                            36470000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36480000
                           'DB2','#023');                               36490000
 END;                                                                   36500000
                                                      /* SOC RB01237 */ 36510000
 /********************************************************************/ 36520000
                                                                        36530000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0051_PI_HW_PR';                     36540000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36550000
                                                                        36560000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36570000
               PTR_RETURN_AREA_BB,                                      36580000
               PTR_INT_AREA);                                           36590000
                                                                        36600000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36610000
   WHEN (0);                                                            36620000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36630000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#024');                        36640000
   OTHERWISE                                                            36650000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36660000
                           'DB2','#025');                               36670000
 END;                                                                   36680000
                                                      /* EOC RB01237 */ 36690000
 /********************************************************************/ 36700000
                                                                        36710000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0110_HW_STATUS';                    36720000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36730000
                                                                        36740000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36750000
               PTR_RETURN_AREA_BB,                                      36760000
               PTR_INT_AREA);                                           36770000
                                                                        36780000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36790000
   WHEN (0);                                                            36800000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36810000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#026');                        36820000
   OTHERWISE                                                            36830000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36840000
                           'DB2','#027');                               36850000
 END;                                                                   36860000
                                                                        36870000
 /********************************************************************/ 36880000
                                                      /* SOC RB01320 */ 36890000
                                                                        36900000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0125_DMMY_REAL';                    36910000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36920000
                                                                        36930000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36940000
               PTR_RETURN_AREA_BB,                                      36950000
               PTR_INT_AREA);                                           36960000
                                                                        36970000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36980000
   WHEN (0);                                                            36990000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37000000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#069');                        37010000
   OTHERWISE                                                            37020000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37030000
                           'DB2','#070');                               37040000
 END;                                                                   37050000
                                                      /* EOC RB01320 */ 37060000
 /********************************************************************/ 37070000
                                                                        37080000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0150_CUST_ADDR';                    37090000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37100000
                                                                        37110000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37120000
               PTR_RETURN_AREA_BB,                                      37130000
               PTR_INT_AREA);                                           37140000
                                                                        37150000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37160000
   WHEN (0);                                                            37170000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37180000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#028');                        37190000
   OTHERWISE                                                            37200000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37210000
                           'DB2','#029');                               37220000
 END;                                                                   37230000
                                                                        37240000
 /********************************************************************/ 37250000
                                                                        37260000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0170_OU_HW';                        37270000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37280000
                                                                        37290000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37300000
               PTR_RETURN_AREA_BB,                                      37310000
               PTR_INT_AREA);                                           37320000
                                                                        37330000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37340000
   WHEN (0);                                                            37350000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37360000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#030');                        37370000
   OTHERWISE                                                            37380000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37390000
                           'DB2','#031');                               37400000
 END;                                                                   37410000
                                                                        37420000
 /********************************************************************/ 37430000
                                                                        37440000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      37450000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37460000
                                                                        37470000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37480000
               PTR_RETURN_AREA_BB,                                      37490000
               PTR_INT_AREA);                                           37500000
                                                                        37510000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37520000
   WHEN (0);                                                            37530000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37540000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#032');                        37550000
   OTHERWISE                                                            37560000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37570000
                           'DB2','#033');                               37580000
 END;                                                                   37590000
                                                                        37600000
 /********************************************************************/ 37610000
                                                                        37620000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0220_SUPPL_CTR';                    37630000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37640000
                                                                        37650000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37660000
               PTR_RETURN_AREA_BB,                                      37670000
               PTR_INT_AREA);                                           37680000
                                                                        37690000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37700000
   WHEN (0);                                                            37710000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37720000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#034');                        37730000
   OTHERWISE                                                            37740000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37750000
                           'DB2','#035');                               37760000
 END;                                                                   37770000
                                                      /* SOC RB01237 */ 37780000
 /********************************************************************/ 37790000
                                                                        37800000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0241_PI_CTR';                       37810000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37820000
                                                                        37830000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37840000
               PTR_RETURN_AREA_BB,                                      37850000
               PTR_INT_AREA);                                           37860000
                                                                        37870000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37880000
   WHEN (0);                                                            37890000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37900000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#036');                        37910000
   OTHERWISE                                                            37920000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37930000
                           'DB2','#037');                               37940000
 END;                                                                   37950000
                                                      /* EOC RB01237 */ 37960000
 /********************************************************************/ 37970000
                                                                        37980000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0260_HW_IN_ORD';                    37990000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 38000000
                                                                        38010000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      38020000
               PTR_RETURN_AREA_BB,                                      38030000
               PTR_INT_AREA);                                           38040000
                                                                        38050000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    38060000
   WHEN (0);                                                            38070000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 38080000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#038');                        38090000
   OTHERWISE                                                            38100000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              38110000
                           'DB2','#039');                               38120000
 END;                                                                   38130000
                                                                        38140000
 /********************************************************************/ 38150000
                                                                        38160000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0300_HW_REAL';                      38170000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 38180000
                                                                        38190000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      38200000
               PTR_RETURN_AREA_BB,                                      38210000
               PTR_INT_AREA);                                           38220000
                                                                        38230000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    38240000
   WHEN (0);                                                            38250000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 38260000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#040');                        38270000
   OTHERWISE                                                            38280000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              38290000
                           'DB2','#041');                               38300000
 END;                                                                   38310000
                                                                        38320000
 /********************************************************************/ 38330000
                                                                        38340000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0340_HW_ADDR';                      38350000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 38360000
                                                                        38370000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      38380000
               PTR_RETURN_AREA_BB,                                      38390000
               PTR_INT_AREA);                                           38400000
                                                                        38410000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    38420000
   WHEN (0);                                                            38430000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 38440000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#042');                        38450000
   OTHERWISE                                                            38460000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              38470000
                           'DB2','#043');                               38480000
 END;                                                                   38490000
                                                                        38500000
 /********************************************************************/ 38510000
                                                                        38520000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0725_PICOS_HW';                     38530000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 38540000
                                                                        38550000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      38560000
               PTR_RETURN_AREA_BB,                                      38570000
               PTR_INT_AREA);                                           38580000
                                                                        38590000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    38600000
   WHEN (0);                                                            38610000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 38620000
     CALL RCBDPBM_ERROR (NULL, 'OTHER', '#044');                        38630000
   OTHERWISE                                                            38640000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              38650000
                           'DB2','#045');                               38660000
 END;                                                                   38670000
                                                                        38680000
 END R702_LOCK_TABLES;                                                  38690000
                                                                        38700000
1/********************************************************************/ 38710000
 /*                                                                  */ 38720000
 /* MODULE NAME      :  R799_END_COUNTRY                             */ 38730000
 /*                                                                  */ 38740000
 /* DESCRIPTION      :                                               */ 38750000
 /*                                                                  */ 38760000
 /********************************************************************/ 38770000
 R799_END_COUNTRY: PROC;                                                38780000
                                         /* CLOSE CURSOR CURSOR_HW_I */ 38790000
 EXEC SQL                                                               38800000
   CLOSE CURSOR_HW_I;                                                   38810000
                                                                        38820000
 SELECT (SQLCODE);                                                      38830000
   WHEN (0);                                                            38840000
   OTHERWISE                                                            38850000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#046');                    38860000
 END;                                                                   38870000
                                         /* CLOSE CURSOR CURSOR_HW_O */ 38880000
 EXEC SQL                                                               38890000
   CLOSE CURSOR_HW_O;                                                   38900000
                                                                        38910000
 SELECT (SQLCODE);                                                      38920000
   WHEN (0);                                                            38930000
   OTHERWISE                                                            38940000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#047');                    38950000
 END;                                                                   38960000
                                                      /* SOC RB01237 */ 38970000
 IF PARM_RCB005.PI_TO_CEREOLS = 'Y'    /* PRIME INPUT IN INTERFACE ? */ 38980000
 THEN DO;                                                               38990000
   EXEC SQL                              /*CLOSE CURSOR CURSOR_HW_PI */ 39000000
     CLOSE CURSOR_HW_PI;                                                39010000
                                                                        39020000
   SELECT (SQLCODE);                                                    39030000
     WHEN (0);                                                          39040000
     OTHERWISE                                                          39050000
       CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#048');                  39060000
   END;                                                                 39070000
 END;                                                                   39080000
                                                      /* EOC RB01237 */ 39090000
                             /* WRITE COUNT MESSAGE FOR COUNTRY      */ 39100000
 PARM_INT_AREA.MESSAGE_TYPE         = 'IS';                             39110000
 PARM_INT_AREA.MESSAGE_NUMBER       = '0004';                           39120000
 PARM_INT_AREA.MSG_VAR_CODES        = ' ';                              39130000
 PARM_INT_AREA.MSG_VAR_CODE_6       = 'FL';                             39140000
 PARM_INT_AREA.MSG_VAR_VALUE_6      = WRK_FILE_NAME;                    39150000
 PARM_INT_AREA.MSG_VAR_CODE_7       = 'C6';                             39160000
 WRK_PIC_10 = WRK_CNT_COUNTRY;                                          39170000
 PARM_INT_AREA.MSG_VAR_VALUE_7      = WRK_PIC_10;                       39180000
 CALL RCB0M1M (PTR_INT_AREA);                                           39190000
                                      /* ADD CNT_COUNTRY TO TOTAL    */ 39200000
 WRK_CNT_RCBDPB1 = WRK_CNT_RCBDPB1 + WRK_CNT_COUNTRY;                   39210000
                                      /* INCREASE FOR NEXT CTRYNO    */ 39220000
 WRK_CTRYNO_NO = WRK_CTRYNO_NO + 1;                                     39230000
                          /* COMMIT TO RELEASE LOCK FOR THIS COUNTRY */ 39240000
 EXEC SQL COMMIT;                                                       39250000
                                                                        39260000
 SELECT (SQLCODE);                                                      39270000
   WHEN (0);                                                            39280000
   OTHERWISE                                                            39290000
     CALL RCBDPBM_ERROR (ADDR (SQLCA),'DB2','#049');                    39300000
 END;                                                                   39310000
                                                                        39320000
 END R799_END_COUNTRY;                                                  39330000
                                                                        39340000
1/********************************************************************/ 39350000
 /*                                                                  */ 39360000
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 39370000
 /*                                                                  */ 39380000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 39390000
 /*                                                                  */ 39400000
 /********************************************************************/ 39410000
 R900_INIT_PROGRAM: PROC;                                               39420000
                                             /* INITIALISE POINTERS  */ 39430000
 PTR_INT_AREA       = ADDR(PARM_INT_AREA);                              39440000
 PTR_RETURN_AREA_BB = ADDR(RETURN_AREA_BB);                             39450000
 PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA);                              39460000
 PTR_RUN_DATE_AREA  = ADDR (RUN_DATE_AREA);                             39470000
                                             /* INITIALISE VARIABLES */ 39480000
 PARM_INT_AREA.MSG_AREA       = '';                                     39490000
 PARM_INT_AREA.ERR_AREA       = ' ';                                    39500000
 PARM_INT_AREA.MSG_REQUEST    = 'O';                                    39510000
 PARM_INT_AREA.MSG_TARGET     = 'F';                                    39520000
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                  39530000
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                           39540000
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           39550000
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      39560000
 PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                        39570000
 PARM_INT_AREA.TXN_CODE       = '';                                     39580000
 PARM_INT_AREA.VERSION        = '';                                     39590000
 PARM_INT_AREA.PTR_PCB_IO     = NULL;                                   39600000
 PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                   39610000
                                              /* OPEN MESSAGE FILE   */ 39620000
 CALL RCB0M1M(PTR_INT_AREA);                                            39630000
                                              /* RETR. SYSTEM DATE   */ 39640000
 CALL RCB0T1M(PTR_INT_AREA);                                            39650000
                                              /* RETRIEVE COUNTRIES  */ 39660000
 CALL RCB019M (PTR_COUNTRY_AREA,                                        39670000
               PTR_INT_AREA);                                           39680000
                                              /* NO COUNTRIES FOUND  */ 39690000
 IF COUNTRY_AREA.COUNT_CTRY = 0                                         39700000
 THEN DO;                                                               39710000
   PARM_INT_AREA.COUNTRY_NUMBER = '';                                   39720000
   PARM_INT_AREA.MSG_VAR_CODES  = '';                                   39730000
   PARM_INT_AREA.MESSAGE_TYPE   = 'IS';                                 39740000
   PARM_INT_AREA.MESSAGE_NUMBER = '0005';                               39750000
   CALL RCB0M1M (PTR_INT_AREA);                                         39760000
   CALL RCBDPBM_ERROR (NULL, 'OTHER', '#050');                          39770000
 END;                                                                   39780000
                           /* DETERMINE TIMESTAMP FOR HEADER + HASH  */ 39790000
 WRK_TIME_STAMP = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();           39800000
                                                                        39810000
                                      /* RETRIEVE PARAMETER RCB067   */ 39820000
                                      /* TRANS TABLE TPMNT --> MA_ST */ 39830000
 TB_RCBV500          = '';                                              39840000
 TB_RCBV500_I        = '';                                              39850000
 TB_RCBP67S.NUMBER   = 'RCB067';                                        39860000
                                                                        39870000
 CALL RCBI50M ('U',                                       /* RC01219 */ 39880000
               ADDR (TB_RCBV500),                                       39890000
               ADDR (TB_RCBV500_I),                                     39900000
               PTR_RETURN_AREA_BB,                                      39910000
               PTR_INT_AREA);                                           39920000
                                                                        39930000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    39940000
   WHEN (0)                                                             39950000
     PARM_RCBP67S = TB_RCBP67S;                                         39960000
   WHEN (4) DO;                                                         39970000
     PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                     39980000
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = 'I050';                   39990000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                      40000000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                     40010000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                           40020000
                                    TB_RCBV500.PARAMETER_NUMBER;        40030000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'PK';                     40040000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                           40050000
                                    TB_RCBV500.PARAMETER_KEY;           40060000
     CALL RCB0M1M (PTR_INT_AREA);                                       40070000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              40080000
                         'DB2','#051');                                 40090000
   END;                                                                 40100000
   OTHERWISE                                                            40110000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              40120000
                         'DB2','#052');                                 40130000
 END;                                                                   40140000
                                        /* OPEN RCBDPB1              */ 40150000
                                                    /* SOC : RB01281 */ 40160000
                                        /* RETRIEVE PARAMETER RCB063 */ 40170000
 /* GET MA_STATUS FROM RCB063 AT GEO INSTALLATION LEVEL THAT WILL BE */ 40180000
 /* APPLIED FOR FLEXIBLE WARRANTY MACHINES WHEN RCB064 IS UNAVAILABLE*/ 40190000
                                                                        40200000
 TB_RCBV500                   = '';                                     40210000
 TB_RCBV500_I                 = '';                                     40220000
 TB_RCBP63S.NUMBER            = 'RCB063';                               40230000
                                                                        40240000
 CALL RCBI50M ('U',                                                     40250000
               ADDR (TB_RCBV500),                                       40260000
               ADDR (TB_RCBV500_I),                                     40270000
               PTR_RETURN_AREA_BB,                                      40280000
               PTR_INT_AREA);                                           40290000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   40300000
   WHEN(0)                                                              40310000
     DO;                                                                40320000
      PARM_RCBP63S = TB_RCBP63S;                                        40330000
                                                                        40340000
     /* WHEN RCB063 PARAMETER VALUE IS BLANK THEN ABEND THE PROGRAM */  40350000
                                                                        40360000
                                                      /* SOC RB01298 */ 40370000
     /* F_WARRANTY_MA_STATUS_GEO                   = TRUE;          */  40380000
        WRK_FWTOW = PARM_RCBP63S.F_WARRANTY_MACHINE;                    40390000
                                                                        40400000
   /* IF TB_RCBV500.PARAMETER_VALUE              = ' '             */   40410000
   /* THEN                                                         */   40420000
   /*   DO;                                                        */   40430000
   /*     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';             */   40440000
   /*     PARM_INT_AREA.MESSAGE_TYPE             = 'BU';           */   40450000
   /*     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0217';         */   40460000
   /*     PARM_INT_AREA.MSG_VAR_CODE_6           = 'PN';           */   40470000
   /*     PARM_INT_AREA.MSG_VAR_VALUE_6          =                 */   40480000
   /*                                 TB_RCBV500.PARAMETER_NUMBER; */   40490000
   /*     PARM_INT_AREA.MSG_VAR_CODE_8           = 'PV';           */   40500000
   /*     PARM_INT_AREA.MSG_VAR_VALUE_8          =                 */   40510000
   /*                                 'RCB063 VALUE NOT FOUND  ';  */   40520000
   /*     CALL RCB0M1M (PTR_INT_AREA);                             */   40530000
   /*     CALL RCBDPBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),      */   40540000
   /*                      'DB2',                                  */   40550000
   /*                      '#053');                                */   40560000
   /*   END;                                                       */   40570000
                                                    /* EOC RB01298 */   40580000
     END;                                                               40590000
   WHEN(4)                                                              40600000
     DO;                                                                40610000
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                40620000
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              40630000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 40640000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                40650000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      40660000
                                       TB_RCBV500.PARAMETER_NUMBER;     40670000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                40680000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      40690000
                                       TB_RCBV500.PARAMETER_KEY;        40700000
        CALL RCB0M1M (PTR_INT_AREA);                                    40710000
        CALL RCBDPBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),             40720000
                         'DB2',                                         40730000
                        '#054');                                        40740000
     END;                                                               40750000
   OTHERWISE                                                            40760000
     DO;                                                                40770000
        CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           40780000
                    'DB2',                                              40790000
                    '#055');                                            40800000
     END;                                                               40810000
 END;                                                                   40820000
                                                    /* EOC : RB01281 */ 40830000
 OPEN FILE(RCBDPB1);                                                    40840000
                                        /* INIT AND FILL HEADER REC  */ 40850000
 FILE_RCBDPB1 = '';                                                     40860000
 FILE_RCBDPB1_H.KEY                     = '';                           40870000
 FILE_RCBDPB1_H.PROCESS_NAME            = 'PICOS HW';                   40880000
 FILE_RCBDPB1_H.FILE_TYPE               = 'DELTA EXTR';                 40890000
 FILE_RCBDPB1_H.TIME_STAMP              = WRK_TIME_STAMP;               40900000
                                        /* WRITE HEADER REC          */ 40910000
 WRITE FILE(RCBDPB1) FROM(FILE_RCBDPB1);                                40920000
                                                                        40930000
 END R900_INIT_PROGRAM;                                                 40940000
1/********************************************************************/ 40950000
 /*                                                                  */ 40960000
 /* MODULE NAME      : R999_END_PROGRAM                              */ 40970000
 /*                                                                  */ 40980000
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 40990000
 /*                                                                  */ 41000000
 /********************************************************************/ 41010000
 R999_END_PROGRAM:  PROC;                                               41020000
                                        /* INIT AND FILL TRAILER REC */ 41030000
 FILE_RCBDPB1 = '';                                                     41040000
 FILE_RCBDPB1_H.KEY                     = (20)'9';                      41050000
 FILE_RCBDPB1_H.PROCESS_NAME            = 'PICOS HW';                   41060000
 FILE_RCBDPB1_H.FILE_TYPE               = 'DELTA EXTR';                 41070000
 FILE_RCBDPB1_H.TIME_STAMP              = '';                           41080000
                                        /* WRITE TRAILER REC         */ 41090000
 WRITE FILE(RCBDPB1) FROM(FILE_RCBDPB1);                                41100000
                                            /* CLOSE FILE RCBDPB1    */ 41110000
 CLOSE FILE(RCBDPB1);                                                   41120000
                              /* SAVE HASH TOTAL IN PARAMETER RCB024 */ 41130000
 TB_RCBV500 = '';                                                       41140000
 TB_RCBV500_I = '';                                                     41150000
 TB_RCBP24S.NUMBER     = 'RCB024';                                      41160000
 TB_RCBP24S.PROC_ID    = WRK_PROC_ID;                                   41170000
 TB_RCBP24S.CTRYNO     = COUNTRY_AREA.CTRY_SET_ID;        /* RC01219 */ 41180000
 TB_RCBP24S.FILE_NAME  = WRK_FILE_NAME;                                 41190000
 TB_RCBP24S.TIME_STAMP = WRK_TIME_STAMP;                                41200000
 TB_RCBP24S.HASH_TOTAL = WRK_HASH_TOTAL;                                41210000
 TB_RCBP24S.LENGTH_PARM = STG(TB_RCBP24S.TIME_STAMP) +                  41220000
                          STG(TB_RCBP24S.HASH_TOTAL);                   41230000
                                                                        41240000
 CALL RCBG50M (ADDR(TB_RCBV500),                                        41250000
               ADDR(TB_RCBV500_I),                                      41260000
               PTR_RETURN_AREA_BB,                                      41270000
               PTR_INT_AREA);                                           41280000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    41290000
   WHEN (0);                                                            41300000
   WHEN (4) DO;                    /* WHEN NOT FOUND THEN INSERT  */    41310000
     CALL RCBF50M (ADDR(TB_RCBV500),                                    41320000
                   ADDR(TB_RCBV500_I),                                  41330000
                   PTR_RETURN_AREA_BB,                                  41340000
                   PTR_INT_AREA);                                       41350000
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                41360000
       WHEN (0);                                                        41370000
       OTHERWISE                                                        41380000
         CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          41390000
                               'DB2','#056');                           41400000
     END;                                                               41410000
   END;                                                                 41420000
   OTHERWISE                                                            41430000
     CALL RCBDPBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              41440000
                         'DB2','#057');                                 41450000
 END;                                                                   41460000
                                    /* WRITE COUNT MESSAGE           */ 41470000
                                   /* RCBDPB1 WRITTEN                */ 41480000
 PARM_INT_AREA.COUNTRY_NUMBER               = '';                       41490000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     41500000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     41510000
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0004';                   41520000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       41530000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'FL';                     41540000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = WRK_FILE_NAME;            41550000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C6';                     41560000
 WRK_PIC_10 = WRK_CNT_RCBDPB1;                                          41570000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = WRK_PIC_10;               41580000
 CALL RCB0M1M (PTR_INT_AREA);                                           41590000
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 41600000
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  41610000
 PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                                41620000
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    41630000
 CALL RCB0M1M (PTR_INT_AREA);                                           41640000
                                    /* CLOSE MESSAGE FILE            */ 41650000
 PARM_INT_AREA.MSG_REQUEST = 'C';                                       41660000
 CALL RCB0M1M (PTR_INT_AREA);                                           41670000
                                                                        41680000
 END R999_END_PROGRAM;                                                  41690000
1/********************************************************************/ 41700000
 /*                                                                  */ 41710000
 /* MODULE NAME      : RCBDPBM_ERROR                                 */ 41720000
 /*                                                                  */ 41730000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 41740000
 /*                    THE INPUT VARIABLES                           */ 41750000
 /*                                                                  */ 41760000
 /********************************************************************/ 41770000
 RCBDPBM_ERROR: PROC    (PTR_ERROR,                                     41780000
                         ERR_TYPE,                                      41790000
                         CALL_ID);                                      41800000
 DCL PTR_ERROR    PTR;                                                  41810000
 DCL ERR_TYPE      CHAR(8);                                             41820000
 DCL CALL_ID       CHAR(4);                                             41830000
                                                                        41840000
 PARM_INT_AREA.PTR_ERROR          = PTR_ERROR;                          41850000
 PARM_INT_AREA.ERR_TYPE           = ERR_TYPE;                           41860000
 PARM_INT_AREA.CALL_ID            = CALL_ID;                            41870000
                                                                        41880000
 CALL RCB0E1M (ADDR(PARM_INT_AREA));                                    41890000
 END RCBDPBM_ERROR;                                                     41900000
1/*******************************************************************/  41910000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  41920000
 /*******************************************************************/  41930000
 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP  */  41940000
 $DAIMOD (RCBDPBM);                     /*  MODULE TO BE COMPILED   */  41950000
 /*******************************************************************/  41960000
 /* END OF ABR BLOCK                                                */  41970000
 /*******************************************************************/  41980000
 END RCBDPBM;                                                           41990000