1/* RCBDS4U - CCMS CONTRACT INTERFACE USER EXIT FOR ADDRESS          */ 00019116
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* MODULE NAME      : RCBDS4U                                       */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME     : RCBDSBP                                       */ 00060000
 /*                                                                  */ 00070000
 /* LANGUAGE         : PLISQL                                        */ 00080000
 /*                                                                  */ 00090000
 /* TYPE             : LINKABLE MODULE                               */ 00100000
 /*                                                                  */ 00110000
 /* DESCRIPTION      : USER EXIT FOR CONTRACT ADDRESS INFORMATION    */ 00120000
 /*                    TO BE USED IN THE CCMS CUSTOMER INTERFACE     */ 00130000
 /*                                                                  */ 00140000
 /* NOTE 1           : IF YOU WANT TO USE THIS EXIT BE SURE TO SET   */ 00150000
 /*                    SWITCH_USER_EXIT TO TRUE                      */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00180000
 /*                                                                  */ 00190000
 /*                      - FILE RCBDSB0                              */ 00200000
 /*                      - ADDRESS LINES (MAXIMUM 9), FOR            */ 00210000
 /*                        INSTALLING ADDRESS                        */ 00220000
 /*                                                                  */ 00230000
 /*                                                                  */ 00240000
 /* OUTPUT           : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00250000
 /*                  : - FILE : RCB0M10                              */ 00260000
 /*                                                                  */ 00270000
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00280000
 /*                                                                  */ 00290000
 /* MESSAGES         : ----                                          */ 00300000
 /*                                                                  */ 00310000
 /* DEPENDENCIES     : NONE                                          */ 00320000
 /*                                                                  */ 00330000
 /* FREQUENCY        : ----                                          */ 00340000
 /*                                                                  */ 00350000
 /*  MAINTENANCE LOG :                                               */ 00360000
 /*  ---------------                                                 */ 00370000
 /*                                                                  */ 00380000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00390000
 /*  --------------------------------------------------------------  */ 00400000
 /*  1998-10-13 | RA01214      | CCMS EXTRACT                        */ 00410000
 /*                                                                  */ 00420000
 /*  1999-11-02 |LOCAL CHANGES | NORDIC REGION                  BG   */ 00430000
 /*  1999-11-08 |RUN ONCE CNTL | ADD CENTRAL REGION RO CODE     SG   */ 00440000
 /*  1999-11-09 |RONORTH       | ADD REGION NORTH RO CODE       SG   */ 00450000
 /*  2000-08-24 |RONORD        | MODIFY NORDIC CODE             BG   */ 00460000
 /*  2001-03-20 |ROCNTL - 644, | CHANGE NO. C0005-0301          SR   */ 00470000
 /*             |668, 693, 704,|                                     */ 00480000
 /*             |708, 740, 820,|                                     */ 00490000
 /*             |821 AND 826   |                                     */ 00500000
 /*             |RONORTH - 788 |                                     */ 00510000
 /*  2001-08-07 |RONORTH - 864 | CHANGE NO. C0030-0601    - SR       */ 00520000
 /*  2011-08-10 |CEEMEA16      | CEEMEA16-R09-0221                   */ 00521019
 /********************************************************************/ 00530000
1RCBDS4U: PROC    (PTR_SWITCH_USER_EXIT,                                00540000
                   PTR_FILE_RCBDSB0,                                    00550000
                   PTR_FILE_EXTRA_INFO,                                 00560000
                   PTR_INT_AREA)                                        00570000
          REORDER;                                                      00580000
0              @JJD1O2: ENTRY;     DCL @SCHFIRST BIT(1)                 00590000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00600000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00610000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00620000
               EDIT    ('RCBDS4U  VERSION 1999.07.22' ,                 00630000
               ' 14H04.46      MIT DEM VERSIONS-ENTRY',                 00640000
               ' @JJD1O2',' ')     (SKIP,A,A,A,SKIP,A);                 00650000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00660000
               END;     /* ENDE DER VERSIONS-GRUPPE  */                 00670000
0DEFAULT RANGE (*)        STATIC;                                       00680000
1/********************************************************************/ 00690000
 /*  PARAMETERS                                                      */ 00700000
 /********************************************************************/ 00710000
0DCL PTR_SWITCH_USER_EXIT    PTR;                                       00720000
 DCL PTR_FILE_RCBDSB0        PTR;                                       00730000
 DCL PTR_FILE_EXTRA_INFO     PTR;                                       00740000
0DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 00750000
0/********************************************************************/ 00760000
 /*  ROSOUTH ROSOUTH ROSOUTH ROSOUTH ROSOUTH                         */ 00770000
 /********************************************************************/ 00780000
 DCL K FIXED BIN(15);                                                   00790000
0/********************************************************************/ 00800000
 /*  ROSOUTH ROSOUTH ROSOUTH ROSOUTH ROSOUTH                         */ 00810000
 /********************************************************************/ 00820000
                                                                        00830000
1/********************************************************************/ 00840000
 /*  EXTERNAL ENTRIES                                                */ 00850000
 /********************************************************************/ 00860000
0DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 00870000
0/********************************************************************/ 00880000
 /* ON ERROR CONDITIONS                                              */ 00890000
 /********************************************************************/ 00900000
0%INCLUDE (RCB0E0M);                                                    00910000
  END;                                                                  00920000
 /********************************************************************/ 00930000
 /*                                                                  */ 00940000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 00950000
 /* AND CALL THE ERROR ROUTINE:                                      */ 00960000
 /*                                                                  */ 00970000
 /*                                                                  */ 00980000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 00990000
 /*                                                                  */ 01000000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 01010000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 01020000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 01030000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 01040000
 /*                                                                  */ 01050000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 01060000
 /*                                                                  */ 01070000
 /********************************************************************/ 01080000
0/********************************************************************/ 01090000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01100000
 /********************************************************************/ 01110000
0DCL SWITCH_USER_EXIT BIT (1) BASED (PTR_SWITCH_USER_EXIT);             01120000
0DCL 1 PARM_FILE_RCBDSB0      BASED (PTR_FILE_RCBDSB0),                 01130000
      %INCLUDE (RCBDSBS);,                                              01140000
      3 FILLER         CHAR(45);                                        01150000
0DCL 1 FILE_EXTRA_INFO        BASED (PTR_FILE_EXTRA_INFO),              01160000
      3 INSTALL_ADDRESS,                                                01170000
        5 ICUS1AD      CHAR(30),                  /* ADDRESS LINE 1 */  01180000
        5 ICUS2AD      CHAR(30),                  /* ADDRESS LINE 2 */  01190000
        5 ICUS3AD      CHAR(30),                  /* ADDRESS LINE 3 */  01200000
        5 ICUS4AD      CHAR(30),                  /* ADDRESS LINE 4 */  01210000
        5 ICUS5AD      CHAR(30),                  /* ADDRESS LINE 5 */  01220000
        5 ICUS6AD      CHAR(30),                  /* ADDRESS LINE 6 */  01230000
        5 ICUS7AD      CHAR(30),                  /* ADDRESS LINE 7 */  01240000
        5 ICUS8AD      CHAR(30),                  /* ADDRESS LINE 8 */  01250000
        5 ICUS9AD      CHAR(30);                  /* ADDRESS LINE 9 */  01260000
0DCL 1 PARM_INT_AREA          BASED (PTR_INT_AREA),                     01270000
      %INCLUDE (RCBZ01S);;                                              01280000
1/********************************************************************/ 01290000
 /* DB2 TABLE STRUCTURES                                             */ 01300000
 /********************************************************************/ 01310000
0DCL 1 TB_RCBV150,                                                      01320000
      %INCLUDE (RCB150S);;                                              01330000
 DCL 1 TB_RCBV150_I,                                                    01340000
      %INCLUDE (RCB150SI);;                                             01350000
0DCL 1 TB_RCBV280,                                                      01360000
      %INCLUDE (RCB280S);;                                              01370000
 DCL 1 TB_RCBV280_I,                                                    01380000
      %INCLUDE (RCB280SI);;                                             01390000
1/********************************************************************/ 01400000
 /* DB2 TABLE STRUCTURES ROSOUTH                                     */ 01410000
 /********************************************************************/ 01420000
0DCL 1 TB_RCBV011,                                                      01430000
      %INCLUDE (RCB011S);;                                              01440000
 DCL 1 TB_RCBV011I,                                                     01450000
      %INCLUDE (RCB011SI);;                                             01460000
1/********************************************************************/ 01470000
 /* DB2 TABLE STRUCTURES ROSOUTH                                     */ 01480000
 /********************************************************************/ 01490000
1/********************************************************************/ 01500000
 /*  BIT SWITCHES                                                    */ 01510000
 /********************************************************************/ 01520000
0DCL TRUE     BIT (1) INIT ('1'B);                                      01530000
 DCL FALSE    BIT (1) INIT ('0'B);                                      01540000
 DCL INSTALL_ZIP_FOUND  BIT(1) INIT('0'B);              /*C0005-0301 */ 01550000
0/********************************************************************/ 01560000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01570000
 /********************************************************************/ 01580000
0DCL 1 WORK_FIELDS,                                                     01590000
       3 WRK_LEVEL      FIXED BIN (15),                                 01600000
       3 WRK_INDNULL    FIXED BIN (15);                                 01610000
 /*---------------------------------------- USER DEFINED PROCESS     */ 01620000
 DCL (DATE,MULTIPLY,DIVIDE,ROUND,TIME,TRANSLATE) BUILTIN;               01630000
 DCL NORD_COUNTRY_DK                CHAR (03) INIT ('678');             01640000
 DCL NORD_COUNTRY_FI                CHAR (03) INIT ('702');             01650000
 DCL NORD_COUNTRY_NO                CHAR (03) INIT ('806');             01660000
 DCL NORD_COUNTRY_SW                CHAR (03) INIT ('846');             01670000
 DCL NORD_COUNTRY_LINE              CHAR (09) INIT ('');                01680000
 DCL 1 NORD_ADDR_LINES,                                                 01690000
       3 RAD(9)                     CHAR (30) INIT ('');                01700000
 DCL 1 NORD_WRK_LINES,                                                  01710000
       3 RAD(9)                     CHAR (30) INIT (' ');               01720000
 DCL NORD_STREET_ADDR_OK            CHAR (01) INIT ('0');               01730000
 DCL NORD_WRK_EDIT_LINE             CHAR (30) INIT ('');                01740000
 DCL NORD_ZIP_LENGTH                PIC '99';                           01750000
 DCL NORD_CITY_LENGTH               PIC '99';                           01760000
 DCL J                              FIXED BIN(15);                      01770000
0DCL FRLETTER  CHAR (7) INIT ('@{}¦\âêîôûäëïöü') ;                      01780000
0DCL GNLLETTER CHAR (7) INIT ('AEEUCAEIOUAEIUO') ;                      01790000
1/********************************************************************/ 01800000
 /*  BUILTIN FUNCTIONS                                               */ 01810000
 /********************************************************************/ 01820000
0DCL (ADDR, LENGTH, /* ROSOUTH */                                       01830000
      NULL) BUILTIN;                                                    01840000
1/********************************************************************/ 01850000
 /* DB2/SQL SQLCA                                                    */ 01860000
 /********************************************************************/ 01870000
0 EXEC SQL                                                              01880000
    INCLUDE SQLCA                                                       01890000
    ;                                                                   01900000
 /*******************************************************************/  01910000
 /**** LOKALE DECLARATIONS - CENTRAL REGION                     *****/  01920000
 /*******************************************************************/  01930000
                               /* ALTERNATE DCL FOR FILE_EXTRA_INFO */  01940000
0DCL 1 FILE_EXTRA_INFO_X      BASED (PTR_FILE_EXTRA_INFO),              01950000
      3 INSTALL_A(9)   CHAR(30);                                        01960000
                                                                        01970000
 DCL SYSPRINT FILE PRINT;                                               01980000
                                                                        01990000
 DCL I BINARY FIXED(31) INITIAL(0);                 /* LOOP VARIABLE */ 02000000
                                                                        02010000
 DCL (SUBSTR,                                                           02020000
      VERIFY) BUILTIN;                                                  02030000
1/********************************************************************/ 02040000
 /*                 S T A R T   P R O C E S S I N G                  */ 02050000
 /********************************************************************/ 02060000
0                                        /* SET LEVEL AND MOD NAME   */ 02070000
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            02080000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     02090000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBDS4U';                     02100000
0                                        /* USER DEFINED PROCESS     */ 02110000
 /*  SWITCH_USER_EXIT = FALSE;   */                                     02120000
 SWITCH_USER_EXIT = TRUE;                                               02130000
                                                                        02140000
1/*******************************************************************/  02150000
 /* BEGIN COUNTRY SPECIFIC CODE                                     */  02160000
 /*******************************************************************/  02170000
                                                                        02180000
 SELECT (PARM_INT_AREA.COUNTRY_NUMBER) ;                                02190000
    WHEN ('706') DO ; /* START COUNTRY 706 */                           02200000
      /*----------------- INSTALL ADDRESS ----------------------*/      02210000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =              02220000
            FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS3AD;                    02230000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(2) =              02240000
            FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS4AD;                    02250000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(3) =              02260000
            SUBSTR(FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS6AD,7,24);       02270000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4) = '' ;         02280000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '' ;         02290000
      /* CALL ADDRESS TRANSLATOR */                                     02300000
      CALL WEST_ADDR_TRANSLATE ;                                        02310000
    END ;  /* COUNTRY 706 */                                            02320000
                                                                        02330000
    WHEN ('624') DO ; /* START COUNTRY 624 */                           02340000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =              02350000
            FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS1AD;                    02360000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(2) =              02370000
            FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS2AD;                    02380000
      IF SUBSTR(FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS3AD,1,1) = 'L'      02390000
      THEN PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(3) =         02400000
            SUBSTR(FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS3AD,8);          02410000
      ELSE PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(3) =         02420000
            SUBSTR(FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS3AD,6);          02430000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4) = '' ;         02440000
      PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '' ;         02450000
      /* CALL ADDRESS TRANSLATOR */                                     02460000
      CALL WEST_ADDR_TRANSLATE ;                                        02470000
    END ;                                                               02480000
  /*-END ROWEST USER EXITS-------------------------------------*/       02490000
    WHEN ('758')      /*ITALY ROSOUTH*/                                 02500000
       DO ;                                                             02510000
          CALL C758_PROCEDURE ;                                         02520000
       END ;                                                            02530000
    WHEN ('846')      /*   SWEDEN   */                                  02540000
       DO ;                                                             02550000
          DO I = 1 TO 9;                                                02560000
             NORD_WRK_LINES.RAD(I) = '';                                02570000
          END;                                                          02580000
          DO I = 1 TO 9;                                                02590000
             NORD_ADDR_LINES.RAD(I) = '';                               02600000
          END;                                                          02610000
          CALL NORD_REDIGERA_ADDR;                                      02620000
       END ;                                                            02630000
    WHEN ('702')      /*   FINLAND  */                                  02640000
       DO ;                                                             02650000
          DO I = 1 TO 9;                                                02660000
             NORD_WRK_LINES.RAD(I) = '';                                02670000
          END;                                                          02680000
          DO I = 1 TO 9;                                                02690000
             NORD_ADDR_LINES.RAD(I) = '';                               02700000
          END;                                                          02710000
          CALL NORD_REDIGERA_ADDR;                                      02720000
       END ;                                                            02730000
    WHEN ('678')      /*   DENMARK  */                                  02740000
       DO ;                                                             02750000
          DO I = 1 TO 9;                                                02760000
             NORD_WRK_LINES.RAD(I) = '';                                02770000
          END;                                                          02780000
          DO I = 1 TO 9;                                                02790000
             NORD_ADDR_LINES.RAD(I) = '';                               02800000
          END;                                                          02810000
          CALL NORD_REDIGERA_ADDR;                                      02820000
       END ;                                                            02830000
    WHEN ('806')      /*   NORWAY   */                                  02840000
       DO ;                                                             02850000
          DO I = 1 TO 9;                                                02860000
             NORD_WRK_LINES.RAD(I) = '';                                02870000
          END;                                                          02880000
          DO I = 1 TO 9;                                                02890000
             NORD_ADDR_LINES.RAD(I) = '';                               02900000
          END;                                                          02910000
          CALL NORD_REDIGERA_ADDR;                                      02920000
       END ;                                                            02930000
                                                                        02940000
 /* CENTRAL REGION START   */                                           02950000
                                                                        02960000
    WHEN ('724') DO;           /**** WHEN ('724') - START         ****/ 02970000
                                                                        02980000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          02990000
                                                                        03000000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 03010000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 03020000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 03030000
          DO I = 1 TO 3;                                                03040000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       03050000
                                                        INSTALL_A(I);   03060000
          END;                                                          03070000
                                         /* SET LINES 4 AND 5 TO     */ 03080000
                                         /* BLANK, SO NO CRAP IN THEM*/ 03090000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           03100000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    03110000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 03120000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 03130000
                              /*   CALLING PROGRAM.                  */ 03140000
          END;                /**** HVP CUSTOMER - END            ****/ 03150000
                                                                        03160000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 03170000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 03180000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 03190000
                /* ALSO THE ZIP-CODE.                                */ 03200000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 03210000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 03220000
 /****                                                                  03230000
             DO I = 1 TO 5:                                             03240000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =    03250000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                03260000
             END;                                                       03270000
                                                                        03280000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               03290000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      03300000
  ****/                                                                 03310000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */03320000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */03330000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */03340000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */03350000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */03360000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/03370000
                           /* GOES TO CCMS ADDRESSLINE 1.             */03380000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */03390000
  LOOPAA:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */03400000
                IF INSTALL_A(I) ¬= ' ' THEN                             03410000
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 | 03420000
                    SUBSTR(INSTALL_A(I),3,2) = '  '                     03430000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */03440000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              03450000
                                      INSTALL_A(I);                     03460000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              03470000
                                      INSTALL_A(I-1);                   03480000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              03490000
                                      INSTALL_A(1);                     03500000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               03510000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         03520000
                        LEAVE LOOPAA;                                   03530000
                        END;                                            03540000
             END;                                                       03550000
                                                                        03560000
          END;                /**** BAU CUSTOMER - END            ****/ 03570000
    END;                       /**** WHEN ('724') - END           ****/ 03580000
0/********************************************************************/ 03590000
   WHEN ('618') DO;          /**** START COUNTRY 618 = AUSTRIA     ****/03600000
                                                                        03610000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          03620000
                                                                        03630000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 03640000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 03650000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 03660000
          DO I = 1 TO 3;                                                03670000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       03680000
                                                        INSTALL_A(I);   03690000
          END;                                                          03700000
                                         /* SET LINES 4 AND 5 TO     */ 03710000
                                         /* BLANK, SO NO CRAP IN THEM*/ 03720000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           03730000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    03740000
                                                                        03750000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 03760000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 03770000
                              /*   CALLING PROGRAM.                  */ 03780000
          END;                /**** HVP CUSTOMER - END            ****/ 03790000
                                                                        03800000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 03810000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 03820000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 03830000
                /* ALSO THE ZIP-CODE.                                */ 03840000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 03850000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 03860000
 /****                                                                  03870000
             DO I = 1 TO 5:                                             03880000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =    03890000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                03900000
             END;                                                       03910000
                                                                        03920000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               03930000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      03940000
  ****/                                                                 03950000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */03960000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */03970000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */03980000
                           /* IF FOUND THEN COPY THIS LINE CONCATENATE*/03990000
                           /* WITH NEXT LINE (REDUCED BLANKS) TO CCMS */04000000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */04010000
                           /* GOES TO CCMS ADDRESSLINE 2. INPUT LINE 1*/04020000
                           /* PLUS 2 GOES TO CCMS ADDRESSLINE 1.      */04030000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */04040000
  LOOPBA:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */04050000
                IF VERIFY(SUBSTR(INSTALL_A(I),1,4),'0123456789') = 0    04060000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */04070000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              04080000
                            SHORTEN(INSTALL_A(I) || INSTALL_A(I+1));    04090000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              04100000
                                      INSTALL_A(I-1);                   04110000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              04120000
                            SHORTEN(INSTALL_A(1) || INSTALL_A(2));      04130000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               04140000
                           INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';      04150000
                        LEAVE LOOPBA;                                   04160000
                        END;                                            04170000
             END;                                                       04180000
                                                                        04190000
          END;                /**** BAU CUSTOMER - END            ****/ 04200000
   END;                      /**** END   COUNTRY 618 = AUSTRIA     ****/04210000
 /********************************************************************/ 04220000
   WHEN ('848') DO;          /**** START COUNTRY 848 = SCHWEIZ    ****/ 04230000
                                                                        04240000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          04250000
                                                                        04260000
          THEN DO;  /********************START************************/ 04270000
                    /**** HVP CUSTOMER - / ODER PRIME INPUT KUNDE ****/ 04280000
                    /*************************************************/ 04290000
                              /* COPY CUSTOMER_NAME AND              */ 04300000
                              /*   INSTALL LINES 1,2,3 TO            */ 04310000
                              /*                INSTALL-LINES 1,2,3  */ 04320000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =          04330000
                                           INSTALL_ADDRESS.ICUS1AD;     04340000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(2) =          04350000
                                           INSTALL_ADDRESS.ICUS2AD;     04360000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(3) =          04370000
                                           INSTALL_ADDRESS.ICUS3AD;     04380000
                                         /* SET LINES 4 AND 5 TO     */ 04390000
                                         /* BLANK, SO NO CRAP IN THEM*/ 04400000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    04410000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 04420000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 04430000
                              /*   CALLING PROGRAM.                  */ 04440000
          END;                /**** HVP CUSTOMER - END            ****/ 04450000
                                                                        04460000
          ELSE DO;  /********************START************************/ 04470000
                    /**** BAU CUSTOMER - / ODER CUSTOMER-RD KUNDE ****/ 04480000
                    /*************************************************/ 04490000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 04500000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 04510000
                /* ALSO THE ZIP-CODE.                                */ 04520000
            /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */ 04530000
            /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */ 04540000
                          /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */ 04550000
                          /* IF FOUND THEN COPY THIS LINE TO         */ 04560000
                          /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */ 04570000
                          /* GOES TO CCMS ADDRESSLINE 2. INPUT LINE 1*/ 04580000
                          /* GOES TO CCMS ADDRESSLINE 1.             */ 04590000
                          /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */ 04600000
  LOOPBC:    DO I = 9 TO 3 BY -1;   /* 3 IS LATEST LINE FOR ZIP-CODE */ 04610000
                IF VERIFY(SUBSTR(INSTALL_A(I),1,4),'0123456789') = 0    04620000
                   THEN DO;                  /* ZIP-CODE LINE FOUND. */ 04630000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              04640000
                                                        INSTALL_A(I);   04650000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              04660000
                                                        INSTALL_A(I-1); 04670000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              04680000
                                                        INSTALL_A(1);   04690000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               04700000
                           INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';      04710000
                        LEAVE LOOPBC;                                   04720000
                        END;                                            04730000
             END;                                                       04740000
                                                                        04750000
                                                                        04760000
          END;                /**** BAU CUSTOMER - END            ****/ 04770000
   END;                      /**** END   COUNTRY 848 = SCHWEIZ     ****/04780000
                                                                        04790000
    WHEN ('644') DO;         /**** WHEN ('644' ) - START           ****/04800000
                                                                        04810000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          04820000
                                                                        04830000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 04840000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 04850000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 04860000
          DO I = 1 TO 3;                                                04870000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       04880000
                                                        INSTALL_A(I);   04890000
          END;                                                          04900000
                                         /* SET LINES 4 AND 5 TO     */ 04910000
                                         /* BLANK, SO NO CRAP IN THEM*/ 04920000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           04930000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    04940000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 04950000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 04960000
                              /*   CALLING PROGRAM.                  */ 04970000
          END;                /**** HVP CUSTOMER - END            ****/ 04980000
                                                                        04990000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 05000000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 05010000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 05020000
                /* ALSO THE ZIP-CODE.                                */ 05030000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 05040000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 05050000
 /****                                                                  05060000
             DO I = 1 TO 5:                                             05070000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    05080000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                05090000
             END;                                                       05100000
                                                                        05110000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               05120000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      05130000
  ****/                                                                 05140000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */05150000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */05160000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */05170000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */05180000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */05190000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/05200000
                           /* GOES TO CCMS ADDRESSLINE 1.             */05210000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */05220000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */05230000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */05240000
                           /* GOES TO CCMS ADDRESSLINE 3              */05250000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */05260000
                           /* IN ANY CASE.                            */05270000
             INSTALL_ZIP_FOUND = '0'B;                                  05280000
  LOOPCA:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */05290000
                IF INSTALL_A(I) ¬= ' ' THEN                             05300000
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,4),'0123456789') = 0 & 05310000
                    SUBSTR(INSTALL_A(I),5,1) = ' '                      05320000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */05330000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              05340000
                                      INSTALL_A(I);                     05350000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              05360000
                                      INSTALL_A(I-1);                   05370000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              05380000
                                      INSTALL_A(1);                     05390000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               05400000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         05410000
                        INSTALL_ZIP_FOUND = '1'B;                       05420000
                        LEAVE LOOPCA;                                   05430000
                        END;                                            05440000
             END;                                                       05450000
             IF ¬INSTALL_ZIP_FOUND                                      05460000
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 05470000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              05480000
                                      INSTALL_A(3);                     05490000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              05500000
                                      INSTALL_A(2);                     05510000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              05520000
                                      INSTALL_A(1);                     05530000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               05540000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         05550000
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 05560000
          END;                /**** BAU CUSTOMER - END            ****/ 05570000
    END;                       /**** WHEN ('644') - END           ****/ 05580000
 /********************************************************************/ 05590000
    WHEN ('668', '693') DO;    /**** WHEN ('668' OR '693') - START****/ 05600000
                                                                        05610000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          05620000
                                                                        05630000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 05640000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 05650000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 05660000
          DO I = 1 TO 3;                                                05670000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       05680000
                                                        INSTALL_A(I);   05690000
          END;                                                          05700000
                                         /* SET LINES 4 AND 5 TO     */ 05710000
                                         /* BLANK, SO NO CRAP IN THEM*/ 05720000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           05730000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    05740000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 05750000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 05760000
                              /*   CALLING PROGRAM.                  */ 05770000
          END;                /**** HVP CUSTOMER - END            ****/ 05780000
                                                                        05790000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 05800000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 05810000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 05820000
                /* ALSO THE ZIP-CODE.                                */ 05830000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 05840000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 05850000
 /****                                                                  05860000
             DO I = 1 TO 5:                                             05870000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    05880000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                05890000
             END;                                                       05900000
                                                                        05910000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               05920000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      05930000
  ****/                                                                 05940000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */05950000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */05960000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */05970000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */05980000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */05990000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/06000000
                           /* GOES TO CCMS ADDRESSLINE 1.             */06010000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */06020000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */06030000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */06040000
                           /* GOES TO CCMS ADDRESSLINE 3              */06050000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */06060000
                           /* IN ANY CASE.                            */06070000
             INSTALL_ZIP_FOUND = '0'B;                                  06080000
  LOOPCB:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */06090000
                IF INSTALL_A(I) ¬= ' ' THEN                             06100000
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,3),'0123456789') = 0 & 06110000
                    VERIFY(SUBSTR(INSTALL_A(I),5,2),'0123456789') = 0 & 06120000
                    SUBSTR(INSTALL_A(I),4,1) = ' '                      06130000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */06140000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              06150000
                                      INSTALL_A(I);                     06160000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              06170000
                                      INSTALL_A(I-1);                   06180000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              06190000
                                      INSTALL_A(1);                     06200000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               06210000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         06220000
                        INSTALL_ZIP_FOUND = '1'B;                       06230000
                        LEAVE LOOPCB;                                   06240000
                        END;                                            06250000
             END;                                                       06260000
                                                                        06270000
             IF ¬INSTALL_ZIP_FOUND                                      06280000
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 06290000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              06300000
                                      INSTALL_A(3);                     06310000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              06320000
                                      INSTALL_A(2);                     06330000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              06340000
                                      INSTALL_A(1);                     06350000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               06360000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         06370000
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 06380000
          END;                /**** BAU CUSTOMER - END            ****/ 06390000
    END;                       /**** WHEN ('668' , '693') - END   ****/ 06400000
    /*****************************************************************/ 06410000
 /* WHEN ('704','826','620','808', */ /*** START OF CHG008C ***/        06420017
  /*      '358','363','603','607',                                      06421017
          '626','694','695','699',                                      06422014
          '705','707','741','787',                                      06423014
          '889','610','636','645',                                      06424014
          '669','698','725','762',                                      06425014
          '764','768','769','770',                                      06426014
          '780','804','832','825',                                      06427014
          '831','849','851','857',                                      06428014
          '865','883','642','677',                                      06429014
          '767','805','823','726',                                      06429114
          '862','666','359','651') */                                   06429217
                                                                        06429317
                                                                        06429417
    WHEN ('704','826','620','607',  /*** REMOVED  CEEMEA16 COUNTRIES **/06429519
          '358','363','603','699',                                      06429617
          '626','694','695','762',                                      06429717
          '705','741','787','770',                                      06429817
          '636','645','768','769',                                      06429917
          '669','698','780','825',                                      06430017
          '831','849','805','726',                                      06430317
          '862','666','359','651')                                      06430617
       DO;   /**** WHEN ('704','826','620','808') - START   ****/       06431013
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          06440000
                                                                        06450000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 06460000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 06470000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 06480000
          DO I = 1 TO 3;                                                06490000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       06500000
                                                        INSTALL_A(I);   06510000
          END;                                                          06520000
                                         /* SET LINES 4 AND 5 TO     */ 06530000
                                         /* BLANK, SO NO CRAP IN THEM*/ 06540000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           06550000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    06560000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 06570000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 06580000
                              /*   CALLING PROGRAM.                  */ 06590000
          END;                /**** HVP CUSTOMER - END            ****/ 06600000
                                                                        06610000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 06620000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 06630000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 06640000
                /* ALSO THE ZIP-CODE.                                */ 06650000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 06660000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 06670000
 /****                                                                  06680000
             DO I = 1 TO 5:                                             06690000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    06700000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                06710000
             END;                                                       06720000
                                                                        06730000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               06740000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      06750000
  ****/                                                                 06760000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */06770000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */06780000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */06790000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */06800000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */06810000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/06820000
                           /* GOES TO CCMS ADDRESSLINE 1.             */06830000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */06840000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */06850000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */06860000
                           /* GOES TO CCMS ADDRESSLINE 3              */06870000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */06880000
                           /* IN ANY CASE.                            */06890000
             INSTALL_ZIP_FOUND = '0'B;                                  06900000
  LOOPCC:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */06910000
                IF INSTALL_A(I) ¬= ' ' THEN                             06920000
                 IF (VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 &06930000
                    SUBSTR(INSTALL_A(I),6,1) = ' ') |                   06940000
                    (VERIFY(SUBSTR(INSTALL_A(I),1,4),'0123456789') = 0 &06950000
                    SUBSTR(INSTALL_A(I),5,1) = ' ')                     06960000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */06970000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              06980000
                                      INSTALL_A(I);                     06990000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              07000000
                                      INSTALL_A(I-1);                   07010000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              07020000
                                      INSTALL_A(1);                     07030000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               07040000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         07050000
                        INSTALL_ZIP_FOUND = '1'B;                       07060000
                        LEAVE LOOPCC;                                   07070000
                        END;                                            07080000
             END;                                                       07090000
                                                                        07100000
             IF ¬INSTALL_ZIP_FOUND                                      07110000
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 07120000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              07130000
                                      INSTALL_A(3);                     07140000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              07150000
                                      INSTALL_A(2);                     07160000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              07170000
                                      INSTALL_A(1);                     07180000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               07190000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         07200000
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 07210000
          END;                /**** BAU CUSTOMER - END            ****/ 07220000
    END;               /**** WHEN ('704','826','620','808')- END   ****/07230013
                               /***END OF CHG008C ***/                  07231012
    /*****************************************************************/ 07240000
    WHEN ('708') DO;           /**** WHEN ('708') - START         ****/ 07250000
                                                                        07260000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          07270000
                                                                        07280000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 07290000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 07300000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 07310000
          DO I = 1 TO 3;                                                07320000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       07330000
                                                        INSTALL_A(I);   07340000
          END;                                                          07350000
                                         /* SET LINES 4 AND 5 TO     */ 07360000
                                         /* BLANK, SO NO CRAP IN THEM*/ 07370000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           07380000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    07390000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 07400000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 07410000
                              /*   CALLING PROGRAM.                  */ 07420000
          END;                /**** HVP CUSTOMER - END            ****/ 07430000
                                                                        07440000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 07450000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 07460000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 07470000
                /* ALSO THE ZIP-CODE.                                */ 07480000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 07490000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 07500000
 /****                                                                  07510000
             DO I = 1 TO 5:                                             07520000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    07530000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                07540000
             END;                                                       07550000
                                                                        07560000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               07570000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      07580000
  ****/                                                                 07590000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */07600000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */07610000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */07620000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */07630000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */07640000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/07650000
                           /* GOES TO CCMS ADDRESSLINE 1.             */07660000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */07670000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */07680000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */07690000
                           /* GOES TO CCMS ADDRESSLINE 3              */07700000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */07710000
                           /* IN ANY CASE.                            */07720000
             INSTALL_ZIP_FOUND = '0'B;                                  07730000
  LOOPCD:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */07740000
                IF INSTALL_A(I) ¬= ' ' THEN                             07750000
                 IF (VERIFY(SUBSTR(INSTALL_A(I),1,4),'0123456789') = 0 &07760000
                    SUBSTR(INSTALL_A(I),5,1) = ' ')|                    07770000
                    (VERIFY(SUBSTR(INSTALL_A(I),3,4),'0123456789') = 0 &07780000
                    SUBSTR(INSTALL_A(I),7,1) = ' ')                     07790000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */07800000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              07810000
                                      INSTALL_A(I);                     07820000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              07830000
                                      INSTALL_A(I-1);                   07840000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              07850000
                                      INSTALL_A(1);                     07860000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               07870000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         07880000
                        INSTALL_ZIP_FOUND = '1'B;                       07890000
                        LEAVE LOOPCD;                                   07900000
                        END;                                            07910000
             END;                                                       07920000
                                                                        07930000
             IF ¬INSTALL_ZIP_FOUND                                      07940000
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 07950000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              07960000
                                      INSTALL_A(3);                     07970000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              07980000
                                      INSTALL_A(2);                     07990000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              08000000
                                      INSTALL_A(1);                     08010000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               08020000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         08030000
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 08040000
          END;                /**** BAU CUSTOMER - END            ****/ 08050000
    END;                       /**** WHEN ('708') - END           ****/ 08060000
    /*****************************************************************/ 08070000
    WHEN ('740') DO;           /**** WHEN ('740') - START         ****/ 08080000
                                                                        08090000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          08100000
                                                                        08110000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 08120000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 08130000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 08140000
          DO I = 1 TO 3;                                                08150000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       08160000
                                                        INSTALL_A(I);   08170000
          END;                                                          08180000
                                         /* SET LINES 4 AND 5 TO     */ 08190000
                                         /* BLANK, SO NO CRAP IN THEM*/ 08200000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           08210000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    08220000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 08230000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 08240000
                              /*   CALLING PROGRAM.                  */ 08250000
          END;                /**** HVP CUSTOMER - END            ****/ 08260000
                                                                        08270000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 08280000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 08290000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 08300000
                /* ALSO THE ZIP-CODE.                                */ 08310000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 08320000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 08330000
 /****                                                                  08340000
             DO I = 1 TO 5:                                             08350000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    08360000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                08370000
             END;                                                       08380000
                                                                        08390000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               08400000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      08410000
  ****/                                                                 08420000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */08430000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */08440000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */08450000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */08460000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */08470000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/08480000
                           /* GOES TO CCMS ADDRESSLINE 1.             */08490000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */08500000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */08510000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */08520000
                           /* GOES TO CCMS ADDRESSLINE 3              */08530000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */08540000
                           /* IN ANY CASE.                            */08550000
             INSTALL_ZIP_FOUND = '0'B;                                  08560000
  LOOPCE:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */08570000
                IF INSTALL_A(I) ¬= ' ' THEN                             08580000
                 IF (SUBSTR(INSTALL_A(I),1,2) = 'H-' &                  08590000
                     SUBSTR(INSTALL_A(I),7,1) = ' ' )|                  08600000
                    (VERIFY(SUBSTR(INSTALL_A(I),1,4),'0123456789') = 0 &08610000
                     SUBSTR(INSTALL_A(I),5,1) = ' ')                    08620000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */08630000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              08640000
                                      INSTALL_A(I);                     08650000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              08660000
                                      INSTALL_A(I-1);                   08670000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              08680000
                                      INSTALL_A(1);                     08690000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               08700000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         08710000
                        INSTALL_ZIP_FOUND = '1'B;                       08720000
                        LEAVE LOOPCE;                                   08730000
                        END;                                            08740000
             END;                                                       08750000
                                                                        08760000
             IF ¬INSTALL_ZIP_FOUND                                      08770000
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 08780000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              08790000
                                      INSTALL_A(3);                     08800000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              08810000
                                      INSTALL_A(2);                     08820000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              08830000
                                      INSTALL_A(1);                     08840000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               08850000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         08860000
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 08870000
          END;                /**** BAU CUSTOMER - END            ****/ 08880000
    END;                       /**** WHEN ('740') - END           ****/ 08890000
    /*****************************************************************/ 08900000
    WHEN ('820') DO;           /**** WHEN ('820') - START         ****/ 08910000
                                                                        08920000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          08930000
                                                                        08940000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 08950000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 08960000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 08970000
          DO I = 1 TO 3;                                                08980000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       08990000
                                                        INSTALL_A(I);   09000000
          END;                                                          09010000
                                         /* SET LINES 4 AND 5 TO     */ 09020000
                                         /* BLANK, SO NO CRAP IN THEM*/ 09030000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           09040000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    09050000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 09060000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 09070000
                              /*   CALLING PROGRAM.                  */ 09080000
          END;                /**** HVP CUSTOMER - END            ****/ 09090000
                                                                        09100000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 09110000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 09120000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 09130000
                /* ALSO THE ZIP-CODE.                                */ 09140000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 09150000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 09160000
 /****                                                                  09170000
             DO I = 1 TO 5:                                             09180000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    09190000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                09200000
             END;                                                       09210000
                                                                        09220000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               09230000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      09240000
  ****/                                                                 09250000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */09260000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */09270000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */09280000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */09290000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */09300000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/09310000
                           /* GOES TO CCMS ADDRESSLINE 1.             */09320000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */09330000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */09340000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */09350000
                           /* GOES TO CCMS ADDRESSLINE 3              */09360000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */09370000
                           /* IN ANY CASE.                            */09380000
             INSTALL_ZIP_FOUND = '0'B;                                  09390000
  LOOPCF:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */09400000
                IF INSTALL_A(I) ¬= ' ' THEN                             09410000
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,2),'0123456789') = 0 & 09420000
                    VERIFY(SUBSTR(INSTALL_A(I),4,3),'0123456789') = 0 & 09430000
                    SUBSTR(INSTALL_A(I),3,1) = '-'                      09440000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */09450000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              09460000
                                      INSTALL_A(I);                     09470000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              09480000
                                      INSTALL_A(I-1);                   09490000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              09500000
                                      INSTALL_A(1);                     09510000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               09520000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         09530000
                        INSTALL_ZIP_FOUND = '1'B;                       09540000
                        LEAVE LOOPCF;                                   09550000
                        END;                                            09560000
             END;                                                       09570000
                                                                        09580000
             IF ¬INSTALL_ZIP_FOUND                                      09590000
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 09600000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              09610000
                                      INSTALL_A(3);                     09620000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              09630000
                                      INSTALL_A(2);                     09640000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              09650000
                                      INSTALL_A(1);                     09660000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               09670000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         09680000
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 09690000
          END;                /**** BAU CUSTOMER - END            ****/ 09700000
    END;                       /**** WHEN ('820') - END           ****/ 09710000
    /*****************************************************************/ 09720000
    WHEN ('821') DO;           /**** WHEN ('821') - START         ****/ 09730000
                                                                        09740000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          09750000
                                                                        09760000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 09770000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 09780000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 09790000
          DO I = 1 TO 3;                                                09800000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       09810000
                                                        INSTALL_A(I);   09820000
          END;                                                          09830000
                                         /* SET LINES 4 AND 5 TO     */ 09840000
                                         /* BLANK, SO NO CRAP IN THEM*/ 09850000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           09860000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    09870000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 09880000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 09890000
                              /*   CALLING PROGRAM.                  */ 09900000
          END;                /**** HVP CUSTOMER - END            ****/ 09910000
                                                                        09920000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 09930000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 09940000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 09950000
                /* ALSO THE ZIP-CODE.                                */ 09960000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 09970000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 09980000
 /****                                                                  09990000
             DO I = 1 TO 5:                                             10000000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    10010000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                10020000
             END;                                                       10030000
                                                                        10040000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               10050000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      10060000
  ****/                                                                 10070000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */10080000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */10090000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */10100000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */10110000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */10120000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/10130000
                           /* GOES TO CCMS ADDRESSLINE 1.             */10140000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */10150000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */10160000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */10170000
                           /* GOES TO CCMS ADDRESSLINE 3              */10180000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */10190000
                           /* IN ANY CASE.                            */10200000
             INSTALL_ZIP_FOUND = '0'B;                                  10210000
  LOOPCG:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */10220000
                IF INSTALL_A(I) ¬= ' ' THEN                             10230000
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,6),'0123456789') = 0   10240000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */10250000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10260000
                                      INSTALL_A(I);                     10270000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10280000
                                      INSTALL_A(I-1);                   10290000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10300000
                                      INSTALL_A(1);                     10310000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10320000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10330000
                        INSTALL_ZIP_FOUND = '1'B;                       10340000
                        LEAVE LOOPCG;                                   10350000
                        END;                                            10360000
             END;                                                       10370000
                                                                        10380000
             IF ¬INSTALL_ZIP_FOUND                                      10390000
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 10400000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10410000
                                      INSTALL_A(3);                     10420000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10430000
                                      INSTALL_A(2);                     10440000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10450000
                                      INSTALL_A(1);                     10460000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10470000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10480000
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 10490000
          END;                /**** BAU CUSTOMER - END            ****/ 10500000
    END;                       /**** WHEN ('821') - END           ****/ 10510000
    /*****************************************************************/ 10520000
    /* CENTRAL REGION END   */                                          10530000
    /*****************************************************************/ 10540000
                                                                        10540117
    /*****************************************************************/ 10541017
    /* CEEMEA16 REGION START */                                         10542019
    /*****************************************************************/ 10543017
                                                                        10550000
      /**** CEEMEA16 COUNTRIES WITHOUT ZIPCODE START ****/              10551019
                                                                        10552017
    WHEN ('610','635','677','725','764','782','804','823','832',        10552117
           '851','857','883')  DO;                                      10552217
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          10553017
                                                                        10554017
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 10555017
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 10556017
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 10557017
          DO I = 1 TO 3;                                                10558017
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       10559017
                                                        INSTALL_A(I);   10559117
          END;                                                          10559217
                                         /* SET LINES 4 AND 5 TO     */ 10559317
                                         /* BLANK, SO NO CRAP IN THEM*/ 10559417
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           10559517
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    10559617
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 10559717
                              /*   THE CCMS CUSTOMER RECORD BY       */ 10559817
                              /*   CALLING PROGRAM.                  */ 10559917
          END;                /**** HVP CUSTOMER - END            ****/ 10560017
                                                                        10560117
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 10560217
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 10560317
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 10560417
                /* ALSO THE ZIP-CODE.                                */ 10560517
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 10560617
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 10560717
 /****                                                                  10560817
             DO I = 1 TO 5:                                             10560917
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    10561017
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                10561117
             END;                                                       10561224
                                                                        10561317
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               10561417
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      10561517
  ****/                                                                 10561617
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */10561717
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */10561817
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */10561917
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */10562017
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */10562117
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/10562217
                           /* GOES TO CCMS ADDRESSLINE 1.             */10562317
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */10562417
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */10562517
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */10562617
                           /* GOES TO CCMS ADDRESSLINE 3              */10562717
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */10562817
                           /* IN ANY CASE.                            */10562917
             INSTALL_ZIP_FOUND = '0'B;                                  10563017
  LOOPAL:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */10563117
                IF INSTALL_A(I) ¬= ' ' THEN                             10563217
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,2),'0123456789') = 0 & 10563317
                    VERIFY(SUBSTR(INSTALL_A(I),4,3),'0123456789') = 0 & 10563417
                    SUBSTR(INSTALL_A(I),3,1) = '-'                      10563517
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */10563617
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10563717
                                      INSTALL_A(I);                     10563817
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10563917
                                      INSTALL_A(I-1);                   10564017
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10564117
                                      INSTALL_A(1);                     10564217
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10564317
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10564417
                        INSTALL_ZIP_FOUND = '1'B;                       10564517
                        LEAVE LOOPAL;                                   10564617
                        END;                                            10564717
             END;                                                       10564817
                                                                        10564917
             IF ¬INSTALL_ZIP_FOUND                                      10565017
                   THEN DO;               /* ZIP-CODE LINE NOT FOUND */ 10565117
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10565217
                                      INSTALL_A(3);                     10565317
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10565417
                                      INSTALL_A(2);                     10565517
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10565617
                                      INSTALL_A(1);                     10565717
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10565817
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10565917
             END;             /*  ZIP-CODE LINE NOT FOOND - END      */ 10566017
          END;                /**** BAU CUSTOMER - END            ****/ 10566117
    END;   /**** CEEMEA16 COUNTRIES WITHOUT ZIPCODE END ****/           10566219
                                                                        10566317
 /**** CEEMEA16 COUNTRIES WITH ZIPCODE START ****/                      10566419
                                                                        10566517
    WHEN ('729') DO;                                                    10566617
                                                                        10566717
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = '00'          10566817
                                                                        10566917
          THEN DO;                                                      10567017
                                                                        10567117
        IF (PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =                10567517
              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,4)) THEN DO;             10567617
                                                                        10567719
             DO I = 9 TO 3 BY -1;                                       10567819
                IF INSTALL_A(I) ¬= ' ' THEN                             10567919
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 | 10568019
                    SUBSTR(INSTALL_A(I),3,2) = '  '                     10568119
                   THEN DO;                                             10568219
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10568319
                                      INSTALL_A(I);                     10568419
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10568519
                                      INSTALL_A(I-1);                   10568619
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10568719
                                      INSTALL_A(1);                     10568819
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10568919
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10569019
                        END;                                            10569219
             END;                                                       10569319
          END;                                                          10570217
          END;                                                          10570317
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 10570417
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 10570517
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 10570617
                /* ALSO THE ZIP-CODE.                                */ 10570717
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 10570817
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 10570917
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */10571017
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */10571117
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */10571217
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */10571317
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */10571417
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/10571517
                           /* GOES TO CCMS ADDRESSLINE 1.             */10571617
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */10571717
  LOOPZZ:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */10571817
                IF INSTALL_A(I) ¬= ' ' THEN                             10571917
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 | 10572017
                    SUBSTR(INSTALL_A(I),3,2) = '  '                     10572117
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */10572217
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10572317
                                      INSTALL_A(I);                     10572417
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10572517
                                      INSTALL_A(I-1);                   10572617
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10572717
                                      INSTALL_A(1);                     10572817
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10572917
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10573017
                        LEAVE LOOPZZ;                                   10573117
                        END;                                            10573217
             END;                                                       10573317
                                                                        10573417
              IF ¬INSTALL_ZIP_FOUND                                     10573517
                    THEN DO;               /* ZIP-CODE LINE NOT FOUND */10573617
                         INSTALL_ADDRESS.ADDRESS_LINES(3) =             10573717
                                       INSTALL_A(3);                    10573817
                         INSTALL_ADDRESS.ADDRESS_LINES(2) =             10573917
                                       INSTALL_A(2);                    10574017
                         INSTALL_ADDRESS.ADDRESS_LINES(1) =             10574117
                                       INSTALL_A(1);                    10574217
                         INSTALL_ADDRESS.ADDRESS_LINES(4),              10574317
                         INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';        10574417
              END;             /*  ZIP-CODE LINE NOT FOOND - END      */10574517
           END;                /**** BAU CUSTOMER - END            ****/10574617
        END;                                                            10574717
                                                                        10574817
    WHEN ('642','707','808','865') DO;                                  10574917
                                                                        10575017
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = '00'          10575117
                                                                        10575217
          THEN DO;                                                      10575317
                                                                        10575417
        IF (PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =                10575517
              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5)) THEN DO;             10575617
                                                                        10575717
             DO I = 9 TO 3 BY -1;                                       10575819
                IF INSTALL_A(I) ¬= ' ' THEN                             10575919
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 | 10576019
                    SUBSTR(INSTALL_A(I),3,2) = '  '                     10576119
                   THEN DO;                                             10576219
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10576319
                                      INSTALL_A(I);                     10576419
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10576519
                                      INSTALL_A(I-1);                   10576619
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10576719
                                      INSTALL_A(1);                     10576819
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10576919
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10577019
                        END;                                            10577119
          END;                                                          10578117
          END;                                                          10578219
          END;                                                          10578319
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 10578419
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 10578519
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 10578619
                /* ALSO THE ZIP-CODE.                                */ 10578719
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 10578819
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 10578919
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */10579019
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */10579119
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */10579219
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */10579319
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */10579419
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/10579519
                           /* GOES TO CCMS ADDRESSLINE 1.             */10579619
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */10579719
  LOOPXX:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */10579819
                IF INSTALL_A(I) ¬= ' ' THEN                             10579919
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 | 10580019
                    SUBSTR(INSTALL_A(I),3,2) = '  '                     10580119
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */10580219
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10580319
                                      INSTALL_A(I);                     10580419
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10580519
                                      INSTALL_A(I-1);                   10580619
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10580719
                                      INSTALL_A(1);                     10580819
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10580919
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10581019
                        LEAVE LOOPXX;                                   10581119
                        END;                                            10581219
             END;                                                       10581319
                                                                        10581419
              IF ¬INSTALL_ZIP_FOUND                                     10581519
                    THEN DO;               /* ZIP-CODE LINE NOT FOUND */10581619
                         INSTALL_ADDRESS.ADDRESS_LINES(3) =             10581719
                                       INSTALL_A(3);                    10581819
                         INSTALL_ADDRESS.ADDRESS_LINES(2) =             10581919
                                       INSTALL_A(2);                    10582019
                         INSTALL_ADDRESS.ADDRESS_LINES(1) =             10582119
                                       INSTALL_A(1);                    10582219
                         INSTALL_ADDRESS.ADDRESS_LINES(4),              10582319
                         INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';        10582419
              END;             /*  ZIP-CODE LINE NOT FOOND - END      */10582519
           END;                /**** BAU CUSTOMER - END            ****/10582619
        END;                                                            10582719
                                                                        10582819
    WHEN ('889') DO;                                                    10582919
                                                                        10583019
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = '00'          10583119
                                                                        10583219
          THEN DO;                                                      10583319
                                                                        10583419
        IF (PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =                10583519
              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,6)) THEN DO;             10583619
                                                                        10583719
             DO I = 9 TO 3 BY -1;                                       10583819
                IF INSTALL_A(I) ¬= ' ' THEN                             10583919
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 | 10584019
                    SUBSTR(INSTALL_A(I),3,2) = '  '                     10584119
                   THEN DO;                                             10584219
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10584319
                                      INSTALL_A(I);                     10584419
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10584519
                                      INSTALL_A(I-1);                   10584619
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10584719
                                      INSTALL_A(1);                     10584819
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10584919
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10585019
                        END;                                            10585119
          END;                                                          10586119
          END;                                                          10586219
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 10586319
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 10586419
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 10586519
                /* ALSO THE ZIP-CODE.                                */ 10586619
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 10586719
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 10586819
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */10586919
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */10587019
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */10587119
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */10587219
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */10587319
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/10587419
                           /* GOES TO CCMS ADDRESSLINE 1.             */10587519
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */10587619
  LOOPYY:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */10587719
                IF INSTALL_A(I) ¬= ' ' THEN                             10587819
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 | 10587919
                    SUBSTR(INSTALL_A(I),3,2) = '  '                     10588019
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */10588119
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              10588219
                                      INSTALL_A(I);                     10588319
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              10588419
                                      INSTALL_A(I-1);                   10588519
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              10588619
                                      INSTALL_A(1);                     10588719
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               10588819
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         10588919
                        LEAVE LOOPYY;                                   10589019
                        END;                                            10589119
             END;                                                       10589219
                                                                        10589319
              IF ¬INSTALL_ZIP_FOUND                                     10589419
                    THEN DO;               /* ZIP-CODE LINE NOT FOUND */10589519
                         INSTALL_ADDRESS.ADDRESS_LINES(3) =             10589619
                                       INSTALL_A(3);                    10589719
                         INSTALL_ADDRESS.ADDRESS_LINES(2) =             10589819
                                       INSTALL_A(2);                    10589919
                         INSTALL_ADDRESS.ADDRESS_LINES(1) =             10590019
                                       INSTALL_A(1);                    10590119
                         INSTALL_ADDRESS.ADDRESS_LINES(4),              10590219
                         INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';        10590319
              END;             /*  ZIP-CODE LINE NOT FOOND - END      */10590419
           END;                /**** BAU CUSTOMER - END            ****/10590519
      END;                                                              10590627
      END;                                                              10590729
 /***************************************************************/      10590819
 /* CEEMEA16 REGION END  */                                             10590919
 /***************************************************************/      10591019
                                                                        10591119
 /* REGION NORTH START   */                                             10591219
                                                                        10591319
    WHEN ('866') DO;           /**** WHEN ('866') - START         ****/ 10591419
                                                                        10592000
      IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'           10600024
                                                                        10610000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 10620000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 10630000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 10640000
          DO I = 1 TO 3;                                                10650000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       10660000
                                                        INSTALL_A(I);   10670000
          END;                                                          10680000
                                         /* SET LINES 4 AND 5 TO     */ 10690000
                                         /* BLANK, SO NO CRAP IN THEM*/ 10700000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           10710000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    10720000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 10730000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 10740000
                              /*   CALLING PROGRAM.                  */ 10750000
          END;                /**** HVP CUSTOMER - END            ****/ 10760000
                                                                        10770000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 10780000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 10790000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 10800000
                /* ALSO THE ZIP-CODE.                                */ 10810000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 10820000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 10830000
 /****                                                                  10840000
             DO I = 1 TO 5:                                             10850000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =    10860000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                10870000
             END;                                                       10880000
                                                                        10890000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               10900000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      10910000
  ****/                                                                 10920000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */10930000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */10940000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */10950000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */10960000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */10970000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/10980000
                           /* GOES TO CCMS ADDRESSLINE 1.             */10990000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */11000000
  LOOPBB:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */11010000
                IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 |  11020000
                   SUBSTR(INSTALL_A(I),3,2) = '  '                      11030000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */11040000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              11050000
                                      INSTALL_A(I);                     11060000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              11070000
                                      INSTALL_A(I-1);                   11080000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              11090000
                                      INSTALL_A(1);                     11100000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               11110000
                           INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';      11120000
                        LEAVE LOOPBB;                                   11130000
                        END;                                            11140000
             END;                                                       11150000
                                                                        11160000
          END;                /**** BAU CUSTOMER - END            ****/ 11170000
    END;                       /**** WHEN ('866') - END           ****/ 11180000
                                                                        11190000
    WHEN ('754') DO;           /**** WHEN ('754') - START         ****/ 11200000
                                                                        11210000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          11220000
                                                                        11230000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 11240000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 11250000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 11260000
          DO I = 1 TO 3;                                                11270000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       11280000
                                                        INSTALL_A(I);   11290000
          END;                                                          11300000
                                         /* SET LINES 4 AND 5 TO     */ 11310000
                                         /* BLANK, SO NO CRAP IN THEM*/ 11320000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           11330000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    11340000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 11350000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 11360000
                              /*   CALLING PROGRAM.                  */ 11370000
          END;                /**** HVP CUSTOMER - END            ****/ 11380000
                                                                        11390000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 11400000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 11410000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 11420000
                /* ALSO THE ZIP-CODE.                                */ 11430000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 11440000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 11450000
 /****                                                                  11460000
             DO I = 1 TO 5:                                             11470000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =    11480000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                11490000
             END;                                                       11500000
                                                                        11510000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               11520000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      11530000
  ****/                                                                 11540000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */11550000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */11560000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */11570000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */11580000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */11590000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/11600000
                           /* GOES TO CCMS ADDRESSLINE 1.             */11610000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */11620000
  LOOPAB:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */11630000
                IF VERIFY(SUBSTR(INSTALL_A(I),1,5),'0123456789') = 0 |  11640000
                   SUBSTR(INSTALL_A(I),3,2) = '  '                      11650000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */11660000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              11670000
                                      INSTALL_A(I);                     11680000
                        INSTALL_ADDRESS.ADDRESS_LINES(2) =              11690000
                                      INSTALL_A(I-1);                   11700000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              11710000
                                      INSTALL_A(1);                     11720000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               11730000
                           INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';      11740000
                        LEAVE LOOPAB;                                   11750000
                        END;                                            11760000
             END;                                                       11770000
                                                                        11780000
          END;                /**** BAU CUSTOMER - END            ****/ 11790000
    END;                       /**** WHEN ('754') - END           ****/ 11800000
                                                                        11810000
    WHEN ('788') DO;           /**** WHEN ('788') - START         ****/ 11820000
                                                                        11830000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          11840000
                                                                        11850000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 11860000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 11870000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 11880000
          DO I = 1 TO 3;                                                11890000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       11900000
                                                        INSTALL_A(I);   11910000
          END;                                                          11920000
                                         /* SET LINES 4 AND 5 TO     */ 11930000
                                         /* BLANK, SO NO CRAP IN THEM*/ 11940000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           11950000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    11960000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 11970000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 11980000
                              /*   CALLING PROGRAM.                  */ 11990000
          END;                /**** HVP CUSTOMER - END            ****/ 12000000
                                                                        12010000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 12020000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 12030000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 12040000
                /* ALSO THE ZIP-CODE.                                */ 12050000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 12060000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 12070000
 /****                                                                  12080000
             DO I = 1 TO 5:                                             12090000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    12100000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                12110000
             END;                                                       12120000
                                                                        12130000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               12140000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      12150000
  ****/                                                                 12160000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */12170000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */12180000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */12190000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */12200000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */12210000
                           /* GOES TO CCMS ADDRESSLINE 2 ONLY IF THE  */12220000
                           /* FIRST 7 CHARACTERS DONOT CONTAIN THE    */12230000
                           /* WORD 'Postbus'. IF THIS LINE CONTAINS   */12240000
                           /* 'Postbus' THEN THIS LINE IS SKIPPED AND */12250000
                           /* THE LINE BEFORE THIS LINE GOES TO  THE  */12260000
                           /* ADDRESSLINE 2.                          */12270000
                           /* ADRESSLINE 1 GOES TO CCMS ADDRESSLINE 1.*/12280000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */12290000
  LOOPCH:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */12300000
                IF INSTALL_A(I) ¬= ' ' THEN                             12310000
                 IF VERIFY(SUBSTR(INSTALL_A(I),1,4),'0123456789') = 0 & 12320000
                    SUBSTR(INSTALL_A(I),5,1) = ' '                      12330000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */12340000
                        INSTALL_ADDRESS.ADDRESS_LINES(3) =              12350000
                                      INSTALL_A(I);                     12360000
                        IF SUBSTR(INSTALL_A(I-1),1,7 ) ¬= 'Postbus'     12370000
                         THEN                                           12380000
                         INSTALL_ADDRESS.ADDRESS_LINES(2) =             12390000
                                      INSTALL_A(I-1);                   12400000
                        ELSE                                            12410000
                         INSTALL_ADDRESS.ADDRESS_LINES(2) =             12420000
                                      INSTALL_A(I-2);                   12430000
                        INSTALL_ADDRESS.ADDRESS_LINES(1) =              12440000
                                      INSTALL_A(1);                     12450000
                        INSTALL_ADDRESS.ADDRESS_LINES(4),               12460000
                        INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';         12470000
                        LEAVE LOOPCH;                                   12480000
                        END;                                            12490000
             END;                                                       12500000
                                                                        12510000
          END;                /**** BAU CUSTOMER - END            ****/ 12520000
    END;                       /**** WHEN ('788') - END           ****/ 12530000
                                                                        12540000
    WHEN ('864') DO;           /**** WHEN ('864') - START         ****/ 12550000
                                                                        12560000
       IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER,1,2) = 'SH'          12570000
                                                                        12580000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 12590000
                              /* COPY INSTALL LINES 1,2,3 TO CCMS    */ 12600000
                              /*   INSTALL-LINES 1,2,3, RESPECTIVELY */ 12610000
          DO I = 1 TO 3;                                                12620000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =       12630000
                                                        INSTALL_A(I);   12640000
          END;                                                          12650000
                                         /* SET LINES 4 AND 5 TO     */ 12660000
                                         /* BLANK, SO NO CRAP IN THEM*/ 12670000
          PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),           12680000
            PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) = '';    12690000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 12700000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 12710000
                              /*   CALLING PROGRAM.                  */ 12720000
          END;                /**** HVP CUSTOMER - END            ****/ 12730000
                                                                        12740000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 12750000
                /* THE ADDRESS LINES FOR INSTALL SHOULD              */ 12760000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 12770000
                /* ALSO THE ZIP-CODE.                                */ 12780000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 12790000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 12800000
 /****                                                                  12810000
             DO I = 1 TO 5:                                             12820000
                PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =    12830000
                         FILE_EXTRA_INFO_X.INSTALL_A(I);                12840000
             END;                                                       12850000
                                                                        12860000
             PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE =               12870000
                              SUBSTR(INSTALL_ADDRESS.ICUS5AD,1,5);      12880000
  ****/                                                                 12890000
 /* CCMS address line 1  Should contain SOF address line 3  */          12900000
 /* (street address).                                       */          12910000
 /* CCMS address line 2: Should contain SOF address line 4  */          12920000
 /* (building or office park)......or if blank or           */          12930000
 /* a value of B, should contain SOF address line 2.        */          12940000
 /* CCMS address line 3: Should contain SOF address line 2  */          12950000
 /* (suburb/town)if not used in above field already,Otherwise blank.*/  12960000
               INSTALL_ADDRESS.ADDRESS_LINES(1) =                       12970000
                              INSTALL_A(3);                             12980000
               IF INSTALL_A(4)='' |                                     12990000
                  INSTALL_A(4) = 'B'                                    13000000
               THEN DO;                                                 13010000
                      INSTALL_ADDRESS.ADDRESS_LINES(2) =                13020000
                                  INSTALL_A(2);                         13030000
                      INSTALL_ADDRESS.ADDRESS_LINES(3) = '';            13040000
               END;                                                     13050000
               ELSE DO;                                                 13060000
                      INSTALL_ADDRESS.ADDRESS_LINES(2) =                13070000
                                INSTALL_A(4);                           13080000
                      INSTALL_ADDRESS.ADDRESS_LINES(3) =                13090000
                                 INSTALL_A(2);                          13100000
               END;                                                     13110000
               INSTALL_ADDRESS.ADDRESS_LINES(4),                        13120000
               INSTALL_ADDRESS.ADDRESS_LINES(5) = ' ';                  13130000
                                                                        13140000
                                                                        13150000
                                                                        13160000
          END;                /**** BAU CUSTOMER - END            ****/ 13170000
    END;                       /**** WHEN ('864') - END           ****/ 13180000
    OTHERWISE                                                           13190000
       DO ;                                                             13200000
       END ;                                                            13210000
 END;   /*   SELECT COUNTRY NUMBER   */                                 13220024
                                                                        13230000
                                                                        13240000
1/*********************************************************************/13250000
 /* WEST ADDRESS TRANSLATOR                                           */13260000
 /* CALLED FROM USER DEFINED PROCESSES 706 624                        */13270000
 /*********************************************************************/13280000
 WEST_ADDR_TRANSLATE: PROC ;                                            13290000
                                                                        13300000
  /*---  MCO  ------- INSTALL ADDRESS TRANSLATION ------------*/        13310000
  PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1) =                  13320000
  TRANSLATE(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(1),         13330000
            GNLLETTER,FRLETTER) ;                                       13340000
  PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(2) =                  13350000
  TRANSLATE(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(2),         13360000
            GNLLETTER,FRLETTER) ;                                       13370000
  PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(3) =                  13380000
  TRANSLATE(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(3),         13390000
            GNLLETTER,FRLETTER) ;                                       13400000
  PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4) =                  13410000
  TRANSLATE(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(4),         13420000
            GNLLETTER,FRLETTER) ;                                       13430000
  PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5) =                  13440000
  TRANSLATE(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(5),         13450000
            GNLLETTER,FRLETTER) ;                                       13460000
  END WEST_ADDR_TRANSLATE ;             /* END USER DEFINED PROCESS */  13470000
1/*********************************************************************/13480000
 /*                                                                   */13490000
 /* C758_PROCEDURE                                                    */13500000
 /* CALLED FROM USER DEFINED PROCESS                                  */13510000
 /*                                                                   */13520000
 /*********************************************************************/13530000
 C758_PROCEDURE: PROCEDURE;                                             13540000
    ADDRESS_LINES(*) = '';                                              13550000
    IF SUBSTR(PARM_FILE_RCBDSB0.CUSTOMER_NUMBER, 1, 2) = '00' THEN      13560000
      DO;                                                               13570000
       IF ICUS2AD ¬= '*' THEN                                           13580000
          ADDRESS_LINES(1)  = STRIP(ADDR(ICUS1AD)) || ' ' || ICUS2AD;   13590000
       ELSE                                                             13600000
          ADDRESS_LINES(1)        = ICUS1AD;                            13610000
                                                                        13620000
       ADDRESS_LINES(2)           = ICUS4AD;                            13630000
       ADDRESS_LINES(3)           = SUBSTR(ICUS5AD, 7, 24);             13640000
                                                                        13650000
       PARM_FILE_RCBDSB0.ZIP_CODE = SUBSTR(ICUS5AD,1,5);                13660000
                                                                        13670000
      END;                                                              13680000
    ELSE                                                                13690000
      DO;                                                               13700000
       TB_RCBV011.COUNTRY_NUMBER  = PARM_INT_AREA.COUNTRY_NUMBER     ;  13710000
       TB_RCBV011.CUSTOMER_NUMBER = PARM_FILE_RCBDSB0.CUSTOMER_NUMBER;  13720000
                                                                        13730000
       EXEC SQL                                                         13740000
       SELECT *                                                         13750000
       INTO   :TB_RCBV011 :TB_RCBV011I.INDNULL                          13760000
       FROM   RCBV0011_PI_CUST                                          13770000
       WHERE  COUNTRY_NUMBER     = :TB_RCBV011.COUNTRY_NUMBER           13780000
         AND  CUSTOMER_NUMBER    = :TB_RCBV011.CUSTOMER_NUMBER          13790000
         AND  CUSTOMER_NR_EXTEND = '000'                                13800000
       ;                                                                13810000
       IF SQLCODE ¬= 0 THEN                                             13820000
         DO;                                                            13830000
           PUT SKIP LIST('TB_RCBV011.COUNTRY_NUMBER='                   13840000
                       || TB_RCBV011.COUNTRY_NUMBER,                    13850000
                         'TB_RCBV011.CUSTOMER_NUMBER='                  13860000
                       || TB_RCBV011.CUSTOMER_NUMBER);                  13870000
           PARM_INT_AREA.PTR_ERROR     =   ADDR(SQLCA);                 13880000
           PARM_INT_AREA.ERR_TYPE      =  'DB2'       ;                 13890000
           PARM_INT_AREA.CALL_ID       =  '#999'      ;                 13900000
           CALL RCB0E1M (PTR_INT_AREA)                ;                 13910000
         END;                                                           13920000
                                                                        13930000
       ADDRESS_LINES(1)   = TB_RCBV011.CUSTOMER_NAME;                   13940000
                                                                        13950000
       ADDRESS_LINES(2)   = ICUS1AD;                                    13960000
       ADDRESS_LINES(3)   = ICUS2AD;                                    13970000
                                                                        13980000
      END;                                                              13990000
                                                                        14000000
 END C758_PROCEDURE;                                                    14010000
                                                                        14020000
 /* ROSOUTH STRIP CALCULATION */                                        14030000
 STRIP:  PROC(PTR_DEP) RETURNS(CHAR(250) VARYING) REORDER;              14040000
 DCL PTR_DEP   PTR;                                                     14050000
 DCL K FIXED BIN(15) INIT(0) AUTO;                                      14060000
 DCL STRINGA BASED(PTR_DEP) CHAR(30);                                   14070000
                                                                        14080000
 DO K = LENGTH(STRINGA) TO 0 BY -1 WHILE(SUBSTR(STRINGA, K, 1) = ' ');  14090000
 END;                                                                   14100000
 RETURN(SUBSTR(STRINGA, 1, K));                                         14110000
 END STRIP;                                                             14120000
                                                                        14130000
1/*********************************************************************/14140000
 /*                                                                   */14150000
 /* NORDZ_REDIGERA_ADDR                                               */14160000
 /* CALLED FROM USER DEFINED PROCESS                                  */14170000
 /*                                                                   */14180000
 /*********************************************************************/14190000
 NORD_REDIGERA_ADDR: PROCEDURE;                                         14200000
    NORD_WRK_LINES.RAD(1) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS1AD;    14210000
    NORD_WRK_LINES.RAD(2) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS2AD;    14220000
    NORD_WRK_LINES.RAD(3) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS3AD;    14230000
    NORD_WRK_LINES.RAD(4) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS4AD;    14240000
    NORD_WRK_LINES.RAD(5) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS5AD;    14250000
    NORD_WRK_LINES.RAD(6) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS6AD;    14260000
    NORD_WRK_LINES.RAD(7) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS7AD;    14270000
    NORD_WRK_LINES.RAD(8) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS8AD;    14280000
    NORD_WRK_LINES.RAD(9) = FILE_EXTRA_INFO.INSTALL_ADDRESS.ICUS9AD;    14290000
    CALL NORD_CUST_NAME;                                                14300000
    CALL NORD_STREET_ADDR;                                              14310000
    CALL NORD_ZIP_CODE;                                                 14320000
    CALL NORD_EDIT_LINES;                                               14330000
    DO I = 1 TO 5;                                                      14340000
         PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ADDRESS_LINES(I) =           14350000
          NORD_ADDR_LINES.RAD(I);                                       14360000
     END;                                                               14370000
                                                                        14380000
 END NORD_REDIGERA_ADDR;                                                14390000
 /*                                                                 */  14400000
 /*******************************************************************/  14410000
 /*                                                                 */  14420000
 /* NORD_CUST_NAME: PROCEDURE                                       */  14430000
 /*                                                                 */  14440000
 /*******************************************************************/  14450000
 NORD_CUST_NAME: PROCEDURE;                                             14460000
 NORD_ADDR_LINES.RAD(1) = NORD_WRK_LINES.RAD(1);                        14470000
                                  /* FLYTTAR KUNDNAMN TILL RAD 1    */  14480000
 END NORD_CUST_NAME;                                                    14490000
 /*                                                                 */  14500000
 /*******************************************************************/  14510000
 /*                                                                 */  14520000
 /*   NORD_STREET_ADDR: PROCEDURE (SKRIVER GATUADRESS TILL RAD 2    */  14530000
 /*                                    I NORD_WRK_LINES)            */  14540000
 /*                                                                 */  14550000
 /*******************************************************************/  14560000
 NORD_STREET_ADDR: PROCEDURE;                                           14570000
   DO I = 2 TO 5;                                                       14580000
      CALL NORD_VERIFY_ADDR_LINE;                                       14590000
      IF NORD_STREET_ADDR_OK = '1'                                      14600000
         THEN                                                           14610000
           DO;                                                          14620000
             NORD_ADDR_LINES.RAD(2) = NORD_WRK_LINES.RAD(I);            14630000
           END;                                                         14640000
   END;                                                                 14650000
 END NORD_STREET_ADDR;                                                  14660000
 /*                                                                     14670000
 /*******************************************************************/  14680000
 /*                                                                 */  14690000
 /*  NORD_ZIP_CODE: PROCEDURE    (V{LJER  RAD MED POSTADRESS)       */  14700000
 /*                                                                 */  14710000
 /*******************************************************************/  14720000
 NORD_ZIP_CODE: PROCEDURE;                                              14730000
      DO I = 2 TO 6;  /* TAR 6 RADER EFTERSOM SVENSKA POSTNR LIGGER */  14740000
                      /* P} RAD 6                                   */  14750000
        IF SUBSTR(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE,1,4) =     14760000
           SUBSTR(NORD_WRK_LINES.RAD(I),1,4)                            14770000
           &                                                            14780000
           VERIFY(NORD_WRK_LINES.RAD(I),' 0123456789') ¬= '0'           14790000
         THEN DO;                                                       14800000
           CALL NORD_CITY;                                              14810000
         END;                                                           14820000
      END;                                                              14830000
 END NORD_ZIP_CODE;                                                     14840000
 /*                                                                 */  14850000
 /*******************************************************************/  14860000
 /*                                                                 */  14870000
 /*   NORD_VERIFY_ADDR_LINE: PROCEDURE                              */  14880000
 /*       (1. V{LJER RADER SOM INNEH}LLER ICKE NUMERISKA TECKEN     */  14890000
 /*         OCH EVENTUELLT BLANKA OCH NUMERISKA TECKEN              */  14900000
 /*       (2. V{LJER BORT RADER SOM INNEH}LLER ANNAT {N GATUADRESS  */  14910000
 /*                                                                 */  14920000
 /*******************************************************************/  14930000
 NORD_VERIFY_ADDR_LINE: PROCEDURE;                                      14940000
   NORD_STREET_ADDR_OK = '0';                                           14950000
   NORD_COUNTRY_LINE = '';                                              14960000
      IF VERIFY(NORD_WRK_LINES.RAD(I),' 0123456789') ¬= '0'             14970000
                 /* INEH}LLER BOKST{VER -  {R M¦JLIGEN GATUADRESS */    14980000
        THEN  DO;                                                       14990000
          NORD_STREET_ADDR_OK = '1';                                    15000000
        END;                                                            15010000
      IF SUBSTR(NORD_WRK_LINES.RAD(I),1,2)   = 'D:'  /* TEL.NR DK **/   15020000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = 'ATT:'                   15030000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = 'ATT.'                   15040000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,2)   = '4 '                     15050000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,5)   = 'BUDG.'                  15060000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,5)   = 'BUDG:'                  15070000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,5)   = '(BEST'                  15080000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,5)   = 'BEST.'                  15090000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,7)   = 'BESTNR.'                15100000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,14)  = 'BESTILLING NR.'         15110000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = 'REF.'                   15120000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,8)   = 'POSTBOX '               15130000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,9)   = 'POSTBOKS '              15140000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,9)   = '(POSTBOKS'              15150000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = 'BAS1'                   15160000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,5)   = 'SUPL '                  15170000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = 'EDB-'                   15180000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,5)    = 'PERS '                 15190000
       | SUBSTR(NORD_WRK_LINES.RAD(I),2,29)   = ' '                     15200000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = 'HR. '                   15210000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = '(PGS'                   15220000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,4)   = 'C/O '                   15230000
                                 /* KONTAKTPERSON                 */    15240000
       | (SUBSTR(NORD_WRK_LINES.RAD(I),1,4) =                           15250000
              SUBSTR(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE,1,4))   15260000
                                 /*  POSTADRESS                   */    15270000
       | SUBSTR(NORD_WRK_LINES.RAD(I),1,16)                             15280000
                          = '230 80 OLOFSTR@M'                          15290000
                        /* SEPARAT HANTERING AV KUND NR 61356      */   15300000
                        /*  PGA FELAKTIG ADRRESS FROM SOF          */   15310000
      THEN  DO;                                                         15320000
        NORD_STREET_ADDR_OK = '0'; /*INNEH}LLER BOKST{VER MEN {R EJ */  15330000
                                  /* GATUADRESS                    */   15340000
       END;                                                             15350000
    IF (SUBSTR(NORD_WRK_LINES.RAD(I),1,9) = 'FINLAND  '                 15360000
         |  SUBSTR(NORD_WRK_LINES.RAD(I),1,9) = 'EESTI    '             15370000
         |  SUBSTR(NORD_WRK_LINES.RAD(I),1,9) = 'ESTONIA  '             15380000
         |  SUBSTR(NORD_WRK_LINES.RAD(I),1,9) = 'LATVIA   '             15390000
         |  SUBSTR(NORD_WRK_LINES.RAD(I),1,9) = 'LITHUANIA')            15400000
      THEN DO;                                                          15410000
          NORD_COUNTRY_LINE = SUBSTR(NORD_WRK_LINES.RAD(I),1,9);        15420000
          NORD_STREET_ADDR_OK = '0'; /*{R INGEN GATUADR. UTAN COUNTRY */15430000
        END;                                                            15440000
 END NORD_VERIFY_ADDR_LINE;                                             15450000
 /*                                                                 */  15460000
 /*******************************************************************/  15470000
 /*                                                                 */  15480000
 /*   NORD_EDIT_LINES: PROCEDURE ({NDRAR $, #, @ TILL A OCH O)      */  15490000
 /*                                                                 */  15500000
 /*******************************************************************/  15510000
 NORD_EDIT_LINES: PROCEDURE;                                            15520000
      DO I = 1 TO 3;                                                    15530000
        NORD_WRK_EDIT_LINE = '';                                        15540000
        DO J = 1 TO 30;                                                 15550000
          SELECT (SUBSTR(NORD_ADDR_LINES.RAD(I),J,1));                  15560000
          WHEN('#')                                                     15570000
            DO;                                                         15580000
              SUBSTR(NORD_WRK_EDIT_LINE,J,1)= 'A';                      15590000
            END;                                                        15600000
          WHEN('$')                                                     15610000
            DO;                                                         15620000
              SUBSTR(NORD_WRK_EDIT_LINE,J,1)= 'A';                      15630000
            END;                                                        15640000
          WHEN('@')                                                     15650000
            DO;                                                         15660000
              SUBSTR(NORD_WRK_EDIT_LINE,J,1)= 'O';                      15670000
            END;                                                        15680000
          WHEN('{')                                                     15690000
            DO;                                                         15700000
              SUBSTR(NORD_WRK_EDIT_LINE,J,1)= 'A';                      15710000
            END;                                                        15720000
          WHEN('}')                                                     15730000
            DO;                                                         15740000
              SUBSTR(NORD_WRK_EDIT_LINE,J,1)= 'A';                      15750000
            END;                                                        15760000
          WHEN('¦')                                                     15770000
            DO;                                                         15780000
              SUBSTR(NORD_WRK_EDIT_LINE,J,1)= 'O';                      15790000
            END;                                                        15800000
          OTHERWISE DO;                                                 15810000
            SUBSTR(NORD_WRK_EDIT_LINE,J,1) =                            15820000
                      SUBSTR(NORD_ADDR_LINES.RAD(I),J,1);               15830000
            END;                                                        15840000
          END;                                /*  END SELECT       */   15850000
        END;                                  /*  END DO J = ...   */   15860000
      NORD_ADDR_LINES.RAD(I) = NORD_WRK_EDIT_LINE;                      15870000
      END;                                                              15880000
 END NORD_EDIT_LINES;                         /*  END DO I = ...   */   15890000
 /*                                                                  */ 15900000
 /********************************************************************/ 15910000
 /*                                                                  */ 15920000
 /*   NORD__CITY: PROCEDURE (1.R{KNAR L{NGDEN P} ZIP-CODE OCH        */ 15930000
 /*                           SKRIVER ENDAST CITY I POSTADRESS-RADEN */ 15940000
 /*                         2.F¦R BALTISKA L{NDER L{GGS {VEN COUNTRY */ 15950000
 /*                           EFTER CITY)                            */ 15960000
 /********************************************************************/ 15970000
 NORD_CITY: PROCEDURE;                                                  15980000
    NORD_WRK_EDIT_LINE = '';                                            15990000
    NORD_ZIP_LENGTH = 11;                                               16000000
    DO UNTIL       /* S¦KER  POSITION MED SISTA BLANKT FR}N H¦GER */    16010000
                                                                        16020000
      (SUBSTR(PARM_FILE_RCBDSB0.INSTALL_ADDRESS.ZIP_CODE,               16030000
                                         NORD_ZIP_LENGTH,1) ¬= ' ');    16040000
       NORD_ZIP_LENGTH = NORD_ZIP_LENGTH - 1;                           16050000
     END;                                                               16060000
    NORD_WRK_EDIT_LINE = SUBSTR(NORD_WRK_LINES.RAD(I),                  16070000
            (NORD_ZIP_LENGTH +2),(30 - NORD_ZIP_LENGTH -2));            16080000
                                                                        16090000
    IF (NORD_COUNTRY_LINE ¬= ''                                         16100000
        & NORD_COUNTRY_LINE ¬= 'FINLAND')                               16110000
     THEN  DO;                                                          16120000
                    /* R{KNAR HUR L}NGT CITY-NAMN {R              */    16130000
       NORD_CITY_LENGTH = 30;                                           16140000
       DO WHILE (SUBSTR(NORD_WRK_EDIT_LINE,NORD_CITY_LENGTH,1) = ' '    16150000
               | SUBSTR(NORD_WRK_EDIT_LINE,NORD_CITY_LENGTH,1) = '');   16160000
            NORD_CITY_LENGTH = NORD_CITY_LENGTH - 1;                    16170000
          END;                             /*    END WHILE        */    16180000
                  /*   COUNTRY SKA L{GGAS IN EFTER CITY -         */    16190000
                  /* DETTA {R AKTUELLT ENDAST F¦R BALTISKA L{NDER */    16200000
       NORD_WRK_EDIT_LINE = SUBSTR(NORD_WRK_EDIT_LINE,                  16210000
            1, NORD_CITY_LENGTH)                                        16220000
            || ', '                                                     16230000
            || NORD_COUNTRY_LINE;                                       16240000
                           /* ADDERAR COUNTRY F¦R BALTISKA L{NDER */    16250000
    END;                                  /* END IF               */    16260000
    NORD_ADDR_LINES.RAD(3) = NORD_WRK_EDIT_LINE;                        16270000
 END NORD_CITY;                                                         16280000
                                                                        16290000
0/*******************************************************************/  16300000
 /* END COUNTRY SPECIFIC CODE                                       */  16310000
 /*******************************************************************/  16320000
                                                                        16330000
1/********************************************************************/ 16340000
 /**** USER FUNCTION   SHORTEN                                   *****/ 16350000
 /****      REMOVES REDUNDANT BLANKS BETWEEN WORDS AND           *****/ 16360000
 /****      RETURNS A CHARACTER STRING OF LENGTH 40.             *****/ 16370000
 /********************************************************************/ 16380000
 SHORTEN: PROCEDURE (STR) RETURNS (CHARACTER(40));                      16390000
                                                                        16400000
 DCL STR CHARACTER(*);         /* CHARACTER STRING OF DIFFERENT LENGTH*/16410000
 DCL (I1, I2) BINARY FIXED(31) /* WORKING VARIABLES FOR POSITIONS     */16420000
              INITIAL(0);                                               16430000
 DCL BLKSW    BIT(1)           /* SWITCH FOR BLANK HANDLING           */16440000
              INITIAL('0'B);   /*    ON IF NO BLANK REQUIRED          */16450000
 DCL OUT_STR  CHARACTER(40)    /* WORKING AREA FOR OUTPUT STRING      */16460000
              INITIAL(' ');                                             16470000
 DCL LENGTH   BUILTIN;         /* BUILTIN FUNCTION                    */16480000
                                                                        16490000
    OUT_STR = ' ';                      /* INITIALIZE OUTPUT STRING   */16500000
    I2 = 1;                             /* INITIALIZE OUTPUT POSITION */16510000
    BLKSW = '0'B;                       /* INITIALIZE BLANK SWITCH    */16520000
    DO I1 = 1 TO LENGTH(STR);           /*                            */16530000
       IF SUBSTR(STR,I1,1) ¬= ' ' THEN  /* IF CHAR NOT BLANK THEN     */16540000
          DO;                           /*    COPY TO OUTPUT          */16550000
          SUBSTR(OUT_STR,I2,1) = SUBSTR(STR,I1,1);                      16560000
          BLKSW = '1'B;                 /* NEXT BLANK IS REQUIRED     */16570000
          I2 = I2 + 1;                  /* POINT TO NEXT POSITION     */16580000
          END;                          /*                            */16590000
                                  ELSE                                  16600000
          DO;                           /* CHARACTER IS A BLANK       */16610000
          IF BLKSW = '1'B THEN          /* IF BLANK IS REQUIRED THEN  */16620000
             DO;                        /*                            */16630000
             BLKSW = '0'B;              /* - RESET BLANK REQUIRED     */16640000
             I2 = I2 + 1;               /* - SKIP TO NEXT POSITION    */16650000
             END;                                                       16660000
          END;                                                          16670000
                                        /* IF NEXT OUTPUT POSITION IS */16680000
       IF I2 > 40 THEN LEAVE;           /*    OUTSIDE TARGET STRING   */16690000
                                        /*    THEN LEAVE DO LOOP      */16700000
    END;                 /*** END DO LOOP ***/                          16710000
                                                                        16720000
    RETURN(OUT_STR);                    /* RETURN THE CHARACTER STRING*/16730000
                                                                        16740000
 END SHORTEN;                                                           16750000
0/********************************************************************/ 16760000
 /**** LOKALE AENDERUNGEN - ENDE                                 *****/ 16770000
 /**** LOKALE AENDERUNGEN - ENDE                                 *****/ 16780000
 /**** LOKALE AENDERUNGEN - ENDE                                 *****/ 16790000
 /********************************************************************/ 16800000
                                                                        16810000
                                         /* END USER DEFINED PROCESS */ 16820000
0                                        /* RESET LEVEL              */ 16830000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            16840000
1/*******************************************************************/  16850000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  16860000
 /*******************************************************************/  16870000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  16880000
 $DAIMOD (RCBDS4U);                      /* MODULE TO BE COMPILED   */  16890000
0/*******************************************************************/  16900000
 /* END OF ABR BLOCK                                                */  16910000
 /*******************************************************************/  16920000
0END RCBDS4U;                                                           16930000