1/* RCBDQDM - CEREOLS HW: DELTA EXTRACT                              */ 00010099
 /********************************************************************/ 00020099
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030099
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040099
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050099
 /********************************************************************/ 00060099
 /* PROGRAM          : RCBDQDM                                       */ 00070099
 /*                                                                  */ 00080099
 /* LANGUAGE         : PLISQL                                        */ 00090099
 /*                                                                  */ 00100099
 /* TYPE             : BATCH                                         */ 00110099
 /*                                                                  */ 00120099
 /* DESCRIPTION      : THE EXTRACT OF HW RELATED                     */ 00130099
 /*                    INFORMATION FOR THE COUNTRIES GIVEN           */ 00140099
 /*                    AND FOR WHICH INFORMATION HAS CHANGED         */ 00150099
 /*                    SINCE THE LAST REOLS HW EXTRACT               */ 00160099
 /*                                                                  */ 00170099
 /* NOTE             : THIS IS A COPY OF THE CEDS RELEASE 2.2        */ 00180099
 /*                    VERSION OF RCBDPBM. THIS COPY CATERS ONLY     */ 00190099
 /*                    FOR REOLS WHEREAS RCBDPBM CATERS FOR THE      */ 00200099
 /*                    CPP/S PART                                    */ 00210099
 /*                                                                  */ 00220099
 /* INPUT            : - DB2   : RCBV0040_OU                         */ 00230099
 /*                              RCBV0010_CUSTOMER           RB01289 */ 00240099
 /*                              RCBV0011_PI_CUST            RB01289 */ 00250099
 /*                              RCBV0030_CONTRACT           RB01290 */ 00260099
 /*                              RCBV0051_PI_HW_PR           RB01237 */ 00270099
 /*                              RCBV0110_HW_STATUS                  */ 00280099
 /*                              RCBV0125_DMMY_REAL          RB01320 */ 00290099
 /*                              RCBV0170_OU_HW                      */ 00300099
 /*                              RCBV0190_HW_CUST                    */ 00310099
 /*                              RCBV0220_SUPPL_CTR                  */ 00320099
 /*                              RCBV0240_SERV_CTR                   */ 00330099
 /*                              RCBV0241_PI_CTR             RB01237 */ 00340099
 /*                              RCBV0250_MES_PR                     */ 00350099
 /*                              RCBV0260_HW_IN_ORD                  */ 00360099
 /*                              RCBV0300_HW_REAL                    */ 00370099
 /*                              RCBV0330_MES_PO                     */ 00380099
 /*                              RCBV0380_HW_PR_MOD                  */ 00390099
 /*                              RCBV0400_PO_MOD1                    */ 00400099
 /*                              RCBV0470_SERV_COND          RB01237 */ 00410099
 /*                              RCBV0475_CTRY_COND          RB01237 */ 00420099
 /*                              RCBV0500_PARM                       */ 00430099
 /*                              RCBV0600_TRANS_WC                   */ 00440099
 /*                              RCBV0610_TRANS_ATO                  */ 00450099
 /*                              RCBV0640_TRANS_SVT          RB01237 */ 00460099
 /*                              RCBT0645_CTRY_SVT           RB01237 */ 00470099
 /*                              RCBV0725_PICOS_HW                   */ 00480099
 /*                                                                  */ 00490099
 /* OUTPUT           : - FILE  : RCBDQD1                             */ 00500099
 /*                              RCB0M10                             */ 00510099
 /*                                                                  */ 00520099
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00530099
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00540099
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00550099
 /*                    RCB018M   UPDATE HASH TOTAL                   */ 00560099
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00570099
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00580099
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00590099
 /*                    RCBF50M   RETRIEVE PARAMETER                  */ 00600099
 /*                    RCBG50M   RETRIEVE PARAMETER                  */ 00610099
 /*                    RCBIBOM   RETRIEVE ROW FROM T640/45   RB01237 */ 00620099
 /*                    RCBISRM   RETRIEVE ROW FROM T470/75   RB01237 */ 00630099
 /*                    RCBI50M   RETRIEVE PARAMETER                  */ 00640099
 /*                    RCBI61M   RETRIEVE AGREEMENT TYPE/OPTION      */ 00650099
 /*                    RCBDQ1U   USER EXIT TO FILL MABO WITH OU CODE */ 00660099
 /*                    RCBDQ2U   USER EXIT TO CHECK OUTPUT   RB01237 */ 00670099
 /*                                                                  */ 00680099
 /* MESSAGES         :                                               */ 00690099
 /*                                                                  */ 00700099
 /* DEPENDENCIES     : NONE                                          */ 00710099
 /*                                                                  */ 00720099
 /* FREQUENCY        : USER DEPENDENT                                */ 00730099
 /*                                                                  */ 00740099
 /* MAINTENANCE LOG  :                                               */ 00750099
 /* ---------------                                                  */ 00760099
 /*                                                                  */ 00770099
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00780099
 /* --------------------------------------------------------------   */ 00790099
 /* 1993-04-01| ----         | CEDS INITIAL DEVELOPMENT              */ 00800099
 /* 1993-12-09| CED0014      | USER EXIT FOR MABO ADDED              */ 00810099
 /* 1994-06-23| RA01077      | REMOVED MEASUREMENT_VALUE             */ 00820099
 /* 1994-11-15| RC01116      | STORE TYPE OF WARRANTY                */ 00830099
 /* 1996-01-08| ----         | CREATION OF SEPERATE REOLS VERSION    */ 00840099
 /*           | RB01140      | IMPROVE PERFORMANCE, TABLE CHANGES    */ 00850099
 /*           | RC01141      | IMPROVE MESSAGES                      */ 00860099
 /* 1997-04-11| PTM1036      | CORRECTED PROLOG                      */ 00870099
 /* 1999-01-06| PTM1217      | MACHINE_CATEGORY CAN BE DB2 NULL:     */ 00880099
 /*           |              | NULL INDICATOR ADDED IN SELECT STMNT. */ 00890099
 /* 1999-07-06| RC01219      | DORO                                  */ 00900099
 /* 2004-08-04| RB01237      | PRIME INPUT DATA IN PARTS INTERFACE   */ 00910099
 /* 2004-08-04| RB01242      | SEQUENCE NUMBER FROM 7 TO 28 CHAR.    */ 00920099
 /* 2007-04-12| RB01281      | CHANGES FOR FLEXIBLE WARRANTY MACHINES*/ 00930099
 /* 2008-02-28| RB01289      | PRIME INPUT CUSTOMER NUMBER           */ 00940099
 /* 2008-07-15| CEDS00000415 | HANDLED THE USEREXIT FLAGS            */ 00950099
 /* 2008-07-31| RC01293      | PCR:P08-0098 SELECTION CLAUSE THAT    */ 00960099
 /*           |              | RESTRICTS TO MACHINES EITHER UNDER    */ 00970099
 /*           |              | WARRANTY OR UNDER CONTRACT IS REMOVED */ 00980099
 /*           |              | SO THAT ALL PRIME INPUT MACHINES      */ 00990099
 /*           |              | ARE PROCESSED.                        */ 01000099
 /* 2008-05-20| RB01290      | ACCEPT CONTRACTS ON INTERNAL MACHINES */ 01010099
 /* 2009-01-23| RB01298      | HANDLING HARD BUNDLE MACHINES         */ 01020099
 /*           |              | CHANGES TO RCB063/RCB064 PARAMETERS   */ 01030099
 /*           |              | AS PART OF PCR-0014                   */ 01040099
 /* 2009-05-26| CEDS00000468 | CURSOR_PI_HW IS RESTRICTED TO         */ 01050099
 /*           |              | TYPE_OF_RELATION AS 'U' IN T190       */ 01060099
 /* 2010-11-09| RC01311      | USE CORRECT OU-CODE PCR P10-0208      */ 01070099
 /* 2011-05-05| RC01313      | PCEDSP-0064: SOLVE DESIGN ERROR OF    */ 01080099
 /*           |              | PCR 208 IN ALL DOWNSTREAMS            */ 01090099
 /* 2012-01-23| RB01320      | CEDS 3.3 A17 RELEASE -                */ 01100099
 /*           |              | LONG SERIAL SUPPORT AND MA STATUS     */ 01110099
 /*           |              | PRIORITY RULES AS PART OF PCR 282     */ 01120099
 /* 2015-04-29| CEDS00000738 | T081567 : PERFORMANCE ISSUE FOR DP01  */ 01121099
 /*           |              | AND DC01 REAL_ORIGIN, REAL_SEQ_NUM ARE*/ 01122099
 /*           |              | ADDED TO T725 AND T735                */ 01123099
 /*           |              |                                       */ 01130099
 /********************************************************************/ 01140099
1RCBDQDM: PROC                                                          01150099
          OPTIONS (MAIN)                                                01160099
          REORDER;                                                      01170099
 DEFAULT RANGE (*)        STATIC;                                       01180099
0/********************************************************************/ 01190099
 /* EXTERNAL ENTRIES                                                 */ 01200099
 /********************************************************************/ 01210099
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01220099
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 01230099
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 01240099
 DCL RCB018M   ENTRY  EXTERNAL;          /* UPDATE HASH TOTAL        */ 01250099
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01260099
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01270099
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 01280099
 DCL RCBF50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01290099
 DCL RCBG50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01300099
                                                      /* SOC RB01237 */ 01310099
 DCL RCBIBOM   ENTRY  EXTERNAL;          /* RETRIEVE ROW FROM T640/5 */ 01320099
 DCL RCBISRM   ENTRY  EXTERNAL;          /* RETRIEVE ROW FROM T470/5 */ 01330099
                                                      /* EOC RB01237 */ 01340099
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01350099
 DCL RCBI61M   ENTRY  EXTERNAL;          /* RETRIEVE TPMNT+ SERVTYPE */ 01360099
 DCL RCBDQ1U   ENTRY  EXTERNAL;          /* USER EXIT MABO           */ 01370099
 DCL RCBDQ2U   ENTRY  EXTERNAL;          /* USER EXIT OUTPUT RB01237 */ 01380099
0/********************************************************************/ 01390099
 /*  FILE DECLARATIONS                                               */ 01400099
 /********************************************************************/ 01410099
 DCL RCBDQD1        FILE         /* EXTRACT (CEDS)                   */ 01420099
                    RECORD                                              01430099
                    OUTPUT                                              01440099
                    SEQUENTIAL                                          01450099
                    ENV (FB RECSIZE(82));                               01460099
1/********************************************************************/ 01470099
 /*  PARAMETERS                                                      */ 01480099
 /********************************************************************/ 01490099
 DCL PTR_INT_AREA        PTR;          /* INTERFACE AREA             */ 01500099
 DCL PTR_RETURN_AREA_BB  PTR;          /* RETURN AREA FROM BB        */ 01510099
 DCL PTR_COUNTRY_AREA    PTR;          /* INTERFACE RCB019M          */ 01520099
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 01530099
                                                                        01540099
0DCL 1 PARM_INT_AREA,                         /* INTERFACE AREA      */ 01550099
       %INCLUDE (RCBZ01S);;                                             01560099
0DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 01570099
       %INCLUDE (RCBZ02S);;                                             01580099
0DCL 1 COUNTRY_AREA,                          /* COUNTRY AREA        */ 01590099
       %INCLUDE (RCBZ26S);;                                             01600099
0DCL 1 RUN_DATE_AREA,                         /* RUN DATE AREA       */ 01610099
       %INCLUDE (RCBZ28S);;                                             01620099
                                                      /* SOC RB01237 */ 01630099
0DCL 1 PARM_RCB005,                           /* PI EXTRACT PARM     */ 01640099
      %INCLUDE (RCBP05S);;                                              01650099
                                                      /* EOC RB01237 */ 01660099
                                                      /* SOC RB01281 */ 01670099
 DCL 1 PARM_RCBP63S,                   /* FLEXIBLE WARRANTY GEO LEVEL*/ 01680099
       %INCLUDE (RCBP63S);;                                             01690099
 DCL 1 PARM_RCBP64S,                   /* FLEXIBLE WARRANTY CTR LEVEL*/ 01700099
       %INCLUDE (RCBP64S);;                           /* EOC RB01281 */ 01710099
0DCL 1 PARM_RCBP67S,                          /* TPMNT TO MA_STATUS  */ 01720099
       %INCLUDE (RCBP67S);;                                             01730099
0DCL 1 PARM_RCBP68S,                          /* CUNO TO SERV_DIV    */ 01740099
       %INCLUDE (RCBP68S);;                                             01750099
0DCL 1 PARM_USER_INFO,                        /* INTERFACE TO EXIT   */ 01760099
       %INCLUDE (RCBDQ1S);;                                             01770099
0DCL 1 PARM_RCB024M,                          /* RCB024M PARM        */ 01780099
       %INCLUDE (RCBZ33S);;                                             01790099
                                                      /* SOC RB01290 */ 01800099
0DCL 1 PARM_RCBP70S,                          /* TPMNT FOR INTERNAL  */ 01810099
      %INCLUDE (RCBP70S);;                    /* MACHINES            */ 01820099
                                                      /* EOC RB01290 */ 01830099
                                                      /* SOC RB01298 */ 01840099
 DCL 1 PARM_RCBP71S,                           /* TPMNT TO CE STATUS */ 01850099
        %INCLUDE (RCBP71S);;                   /* COUNTRY DEVIATION  */ 01860099
                                                      /* EOC RB01298 */ 01870099
                                                      /* SOC RB01320 */ 01880099
0DCL 1 PARM_RCBP103S,                 /* SERVICE ON BEHALF OF VENDOR */ 01890099
        %INCLUDE (RCBP103S);;                                           01900099
                                                      /* EOC RB01320 */ 01910099
1/********************************************************************/ 01920099
 /* DB2 TABLE STRUCTURES                                             */ 01930099
 /********************************************************************/ 01940099
                                                      /* SOC RB01237 */ 01950099
0DCL 1 TB_RCBV040,                                                      01960099
      %INCLUDE (RCB040S);;                                              01970099
                                                      /* EOC RB01237 */ 01980099
0DCL 1 TB_RCBV125,                                    /* SOC RB01320 */ 01990099
      %INCLUDE (RCB125S);;                            /* EOC RB01320 */ 02000099
                                                                        02010099
0DCL 1 TB_RCBV240,                                                      02020099
      %INCLUDE (RCB240S);;                                              02030099
                                                                        02040099
 /*COMMENTED AS PART OF PCEDSP-0064                      SOC RC01313 */ 02050099
 /*DCL 1 TB_RCBV350,                                     SOC RC01311 */ 02060099
 /*    %INCLUDE (RCB350S);;                              EOC RC01311 */ 02070099
 /*                                                      EOC RC01313 */ 02080099
                                                                        02090099
0DCL 1 TB_RCBV380,                                                      02100099
      %INCLUDE (RCB380S);;                                              02110099
                                                                        02120099
0DCL 1 TB_RCBV400,                                                      02130099
      %INCLUDE (RCB400S);;                                              02140099
                                                      /* SOC RB01237 */ 02150099
0DCL 1 TB_RCBV470,                                                      02160099
      %INCLUDE (RCB470S);;                                              02170099
0DCL 1 TB_RCBV470_I,                                                    02180099
      %INCLUDE (RCB470SI);;                                             02190099
                                                      /* EOC RB01237 */ 02200099
0DCL 1 TB_RCBV500,                                                      02210099
      %INCLUDE (RCB500S);;                                              02220099
0DCL 1 TB_RCBV500_I,                                                    02230099
      %INCLUDE (RCB500SI);;                                             02240099
                                                       /* SOC RB01237 */02250099
0DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  02260099
      %INCLUDE (RCBP05S);;                                              02270099
                                                       /* EOC RB01237 */02280099
0DCL 1 TB_RCBP24S            BASED (ADDR(TB_RCBV500)),                  02290099
      %INCLUDE (RCBP24S);;                                              02300099
 DCL 1 TB_RCBP63S            BASED (ADDR(TB_RCBV500)), /* SOC RB01281 */02310099
      %INCLUDE (RCBP63S);;                                              02320099
 DCL 1 TB_RCBP64S            BASED (ADDR(TB_RCBV500)),                  02330099
      %INCLUDE (RCBP64S);;                             /* EOC RB01281 */02340099
0DCL 1 TB_RCBP67S            BASED (ADDR(TB_RCBV500)),                  02350099
      %INCLUDE (RCBP67S);;                                              02360099
0DCL 1 TB_RCBP68S            BASED (ADDR(TB_RCBV500)),                  02370099
      %INCLUDE (RCBP68S);;                                              02380099
                                                                        02390099
0DCL 1 TB_RCBV610,                                                      02400099
      %INCLUDE (RCB610S);;                                              02410099
0DCL 1 TB_RCBV610_I,                                                    02420099
      %INCLUDE (RCB610SI);;                                             02430099
                                                      /* SOC RB01237 */ 02440099
0DCL 1 TB_RCBV640,                                                      02450099
      %INCLUDE (RCB640S);;                                              02460099
0DCL 1 TB_RCBV640_I,                                                    02470099
      %INCLUDE (RCB640SI);;                                             02480099
                                                      /* EOC RB01237 */ 02490099
                                                      /* SOC RB01290 */ 02500099
 DCL 1 TB_RCBP70S            BASED (ADDR(TB_RCBV500)),                  02510099
      %INCLUDE (RCBP70S);;                                              02520099
                                                      /* EOC RB01290 */ 02530099
                                                      /* SOC RB01298 */ 02540099
 DCL 1 TB_RCBP71S            BASED (ADDR(TB_RCBV500)),                  02550099
      %INCLUDE (RCBP71S);;                                              02560099
                                                      /* EOC RB01298 */ 02570099
 DCL 1 TB_RCBP103S           BASED (ADDR(TB_RCBV500)),/* SOC RB01320 */ 02580099
      %INCLUDE (RCBP103S);;                                             02590099
                                                      /* EOC RB01320 */ 02600099
                                                                        02610099
                                                                        02620099
1/********************************************************************/ 02630099
 /* SELECT STRUCTURES                                                */ 02640099
 /********************************************************************/ 02650099
                                                      /* SOC RB01237 */ 02660099
0DCL 1 CURSOR_HW_PI_V051,                                               02670099
        %INCLUDE (RCB051S);;                                            02680099
0DCL 1 CURSOR_HW_PI_V241,                                               02690099
        %INCLUDE (RCB241S);;                                            02700099
                                                      /* EOC RB01237 */ 02710099
0DCL 1 CURSOR_HW_O_V040,                                                02720099
        %INCLUDE (RCB040S);;                                            02730099
0DCL 1 CURSOR_HW_O_V260,                                                02740099
        %INCLUDE (RCB260S);;                                            02750099
                                                                        02760099
0DCL 1 CURSOR_HW_I_V040,                                                02770099
        %INCLUDE (RCB040S);;                                            02780099
0DCL 1 CURSOR_HW_I_V110,                                                02790099
        %INCLUDE (RCB110S);;                                            02800099
0DCL 1 CURSOR_HW_I_V190,                                                02810099
        %INCLUDE (RCB190S);;                                            02820099
0DCL 1 CURSOR_HW_I_V220,                                                02830099
        %INCLUDE (RCB220S);;                                            02840099
0DCL 1 CURSOR_HW_I_V300,                                                02850099
        %INCLUDE (RCB300S);;                                            02860099
                                                                        02870099
0DCL 1 CURSOR_MES_I_V250,                                               02880099
        %INCLUDE (RCB250S);;                                            02890099
                                                                        02900099
0DCL 1 CURSOR_MES_O_V330,                                               02910099
        %INCLUDE (RCB330S);;                                            02920099
1/********************************************************************/ 02930099
 /*  RECORD STRUCTURES                                               */ 02940099
 /********************************************************************/ 02950099
 DCL 1 FILE_RCBDQD1,                                                    02960099
      3 PRODUCT_TYPE           CHAR(04),                                02970099
      3 ORIGIN                 CHAR(02),                                02980099
      3 SEQUENCE_NUMBER        CHAR(05),                                02990099
     2 RECORD_INFO,                                                     03000099
      %INCLUDE (RCBDQDS);;                                              03010099
                                                                        03020099
 DCL 1 USER_FILE_RCBDQD1 LIKE FILE_RCBDQD1;                             03030099
                                                      /* SOC RB01237 */ 03040099
 DCL 1 USER_FILE_BAU     LIKE FILE_RCBDQD1;                             03050099
 DCL 1 USER_FILE_PI      LIKE FILE_RCBDQD1;                             03060099
                                                      /* EOC RB01237 */ 03070099
 DCL 1 FILE_RCBDQD1_H BASED(ADDR(FILE_RCBDQD1)),                        03080099
      %INCLUDE (RCBD01S);;                                              03090099
                                                                        03100099
1/********************************************************************/ 03110099
 /*  BIT SWITCHES                                                    */ 03120099
 /********************************************************************/ 03130099
 DCL 1 SWITCHES,                                                        03140099
                                                      /* SOC RB01237 */ 03150099
     3 SWITCH_BAU                BIT (1)   INIT ('0'B),                 03160099
     3 SWITCH_PI                 BIT (1)   INIT ('0'B),                 03170099
     3 SWITCH_HW_INST            BIT (1)   INIT ('0'B),                 03180099
     3 SWITCH_HW_ORDR            BIT (1)   INIT ('0'B),                 03190099
                                                      /* EOC RB01237 */ 03200099
     3 TRUE                      BIT (1)   INIT ('1'B),                 03210099
     3 FALSE                     BIT (1)   INIT ('0'B),                 03220099
     3 SWITCH_EOC_CURSOR_HW_O    BIT (1)   INIT ('0'B),                 03230099
     3 SWITCH_EOC_CURSOR_HW_I    BIT (1)   INIT ('0'B),                 03240099
     3 SWITCH_EOC_CURSOR_HW_PI   BIT (1)   INIT ('0'B),   /* RB01237 */ 03250099
     3 SWITCH_EOC_CURSOR_MES_I   BIT (1)   INIT ('0'B),                 03260099
                                                      /* SOC RB01298 */ 03270099
 /*  3 SWITCH_FLEXIBLE_WARRANTY_PI   BIT (1)   INIT ('0'B),/* RB01281*/ 03280099
                                                      /* EOC RB01298 */ 03290099
     3 SWITCH_FLEXIBLE_WARRANTY_BAU  BIT (1)   INIT ('0'B),/* RB01281*/ 03300099
     3 F_WARRANTY_MA_STATUS          BIT (1)   INIT ('0'B),/* RB01281*/ 03310099
                                                      /* SOC RB01320 */ 03320099
 /*  3 F_WARRANTY_MA_STATUS_GEO      BIT (1)   INIT ('0'B),/* RB01281*/ 03330099
                                                      /* EOC RB01320 */ 03340099
     3 SWITCH_EOC_CURSOR_MES_O       BIT (1)   INIT ('0'B),             03350099
     3 SWITCH_INTERNAL_CTR           BIT (1)   INIT ('0'B),/* RB01290*/ 03360099
     3 SWITCH_ACTIVE_CONTRACT        BIT (1)   INIT ('0'B),/* RB01290*/ 03370099
                                                      /* SOC RB01298 */ 03380099
     3 SWITCH_MA_ST_COUNTRY          BIT (1)   INIT ('0'B),             03390099
     3 SWITCH_HARDBUNDLE_BAU         BIT (1)   INIT ('0'B),             03400099
     3 SWITCH_FW_PI                  BIT (1)   INIT ('0'B),             03410099
                                                      /* EOC RB01298 */ 03420099
                                                      /* SOC RB01320 */ 03430099
 /*  3 SWITCH_HB_PI                  BIT (1)   INIT ('0'B);          */ 03440099
     3 SWITCH_HB_PI                  BIT (1)   INIT ('0'B),             03450099
     3 SWITCH_VENDOR_SERVICE         BIT (1)   INIT ('0'B),             03460099
     3 SW_BRAND_BAU                  BIT (1)   INIT ('0'B),             03470099
     3 SW_SUPP_CTR                   BIT (1)   INIT ('0'B),             03480099
     3 SWITCH_LEASE_RENTAL           BIT (1)   INIT ('0'B),             03490099
     3 SWITCH_INTERNAL               BIT (1)   INIT ('0'B),             03500099
     3 SW_POST_WARR_BAU              BIT (1)   INIT ('0'B),             03510099
     3 SW_POST_WARR_T51_PI           BIT (1)   INIT ('0'B),             03520099
     3 SW_WARR_PI                    BIT (1)   INIT ('0'B),             03530099
     3 SW_MAINT_PI                   BIT (1)   INIT ('0'B),             03540099
     3 SW_WARRANTY                   BIT (1)   INIT ('0'B);             03550099
                                                      /* EOC RB01320 */ 03560099
                                                                        03570099
 DCL 1 SWITCH_USER_EXIT          BIT (1)   INIT ('1'B);                 03580099
                                                      /* SOC RB01237 */ 03590099
 DCL   SWITCH_USER_EXIT2         BIT (1)   INIT ('1'B);                 03600099
 DCL   DATA_ORIGIN               CHAR(1)   INIT ('');                   03610099
                                                      /* EOC RB01237 */ 03620099
 /********************************************************************/ 03630099
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 03640099
 /********************************************************************/ 03650099
 DCL 1 WORK_FIELDS,                                                     03660099
    3 WRK_MOD_NAME                      CHAR (08)  INIT ('RCBDQDM'),    03670099
    3 WRK_PRG_NAME                      CHAR (08)  INIT ('RCBDQDP'),    03680099
    3 WRK_FILE_NAME                     CHAR (07)  INIT ('RCBDQD1'),    03690099
    3 WRK_SYSTEM_TYPE                   CHAR (01)  INIT ('B'),          03700099
    3 WRK_PROC_ID                       CHAR (04),                      03710099
    3 WRK_CTRYNO                        CHAR (03),                      03720099
    3 WRK_CTRYNO_NO                     FIXED BIN(15) INIT(1),          03730099
    3 WRK_PGR_TYPE                      CHAR (03),                      03740099
    3 WRK_RUN_DATE                      CHAR (10),                      03750099
    3 WRK_INDNULL                       FIXED BIN(15),                  03760099
                                                      /* SOC RB01237 */ 03770099
    3 WRK_IND_INST_DATE                 FIXED BIN(15),                  03780099
    3 WRK_IND_TOW                       FIXED BIN(15),                  03790099
    3 WRK_IND_SLC_1                     FIXED BIN(15),                  03800099
    3 WRK_IND_SLC_2                     FIXED BIN(15),                  03810099
    3 WRK_IND_SPLT_DATE                 FIXED BIN(15),                  03820099
    3 WRK_IND_OU                        FIXED BIN(15),                  03830099
    3 WRK_IND_EFF_DATE                  FIXED BIN(15),                  03840099
    3 WRK_IND_END_DATE                  FIXED BIN(15),                  03850099
    3 WRK_PI_ORIGIN                     CHAR (04),                      03860099
    3 WRK_PI_ORIGIN_TEMP                CHAR (04),    /* SOC RB01289 */ 03870099
    3 WRK_CUSTOMER_NUMBER_V10           CHAR (08),                      03880099
    3 WRK_CUSTNO_V10_IND                FIXED BIN(15),                  03890099
    3 WRK_CUSTOMER_NUMBER_V11           CHAR (08),                      03900099
    3 WRK_CUSTNO_V11_IND                FIXED BIN(15),                  03910099
    3 WRK_CUSTOMER_NUMBER_V190          CHAR (08),                      03920099
    3 WRK_CUSTNO_V190_IND               FIXED BIN(15),                  03930099
    3 WRK_OU_CODE_V170                  CHAR (07),     /* SOC RC01311*/ 03940099
    3 WRK_OU_CODE_V170_IND              FIXED BIN(15),                  03950099
    3 WRK_PI_BAU_OU_CODE                CHAR (07),                      03960099
    3 WRK_PI_BAU_T040_MABO              CHAR (04),     /* EOC RC01311*/ 03970099
    3 WRK_IND_CUST                      FIXED BIN(15),                  03980099
    3 WRK_V051_SOUR_IND                 FIXED BIN(15),/* EOC RB01289 */ 03990099
    3 WRK_SAV_CONTR_NR                  CHAR (15),                      04000099
    3 WRK_SERVICE_LVL_CODE              CHAR (03),                      04010099
    3 WRK_SERVICE_TYPE                  CHAR (01),                      04020099
                                                      /* EOC RB01237 */ 04030099
                                                      /* SOC RB01320 */ 04040099
    3 WRK_ORIGIN                        CHAR (02) INIT (''),            04050099
    3 WRK_SEQ_NO                        CHAR (28) INIT (''),            04060099
    3 WRK_REAL_SERIAL_NUM_BAU           CHAR (30) INIT (''),            04070099
    3 WRK_REAL_BAU_INDNULL              FIXED BIN(15),                  04080099
                                                      /* EOC RB01320 */ 04090099
    3 WRK_HASH_TOTAL                    FIXED DEC(15) INIT(0),          04100099
    3 WRK_ORDER_NO                      CHAR(06),                       04110099
    3 WRK_TIME_STAMP                    CHAR(20),                       04120099
    3 WRK_CNT_COUNTRY                   FIXED BIN(31) INIT(0),          04130099
    3 WRK_CNT_RCBDQD1                   FIXED BIN(31) INIT(0),          04140099
    3 WRK_TPMNT_VAL,                                                    04150099
      %INCLUDE (RCBZ99S);,                                              04160099
    3 WRK_PIC_10                        PIC 'Z,ZZZ,ZZZ,ZZ9',            04170099
    3 WRK_OPEN_DATE_CH6                 CHAR (06)  INIT ('999999'),     04180099
    3 WRK_OPEN_DATE_CH10                CHAR (10)  INIT ('9999-12-31'), 04190099
    3 WRK_TYPE_OF_CONTRACT      CHAR(10),               /*SOC RB01290 */04200099
    3 WRK_CONTRACT_NUMBER       CHAR(15),                               04210099
    3 WRK_TYPE_OF_CONTRACT_INDNULL    FIXED BIN(15),                    04220099
    3 WRK_CONTRACT_NUMBER_INDNULL     FIXED BIN(15);    /*EOC RB01290 */04230099
                                                      /* SOC RB01237 */ 04240099
 DCL 1 WRK_SAVE,                                                        04250099
      5 PRODUCT_TYPE                    CHAR(04),                       04260099
      5 ORIGIN                          CHAR(02),                       04270099
      5 SEQUENCE_NUMBER                 CHAR(05);                       04280099
                                                      /* EOC RB01237 */ 04290099
 DCL 1 SK_CURRENT_HW,                                                   04300099
      5 EOF                             CHAR(01),                       04310099
      5 PRODUCT_TYPE                    CHAR(04),                       04320099
      5 ORIGIN                          CHAR(02),                       04330099
      5 SEQUENCE_NUMBER                 CHAR(28),         /* RB01242 */ 04340099
      5 MODEL_NUMBER                    CHAR(03);                       04350099
 DCL 1 SK_CURRENT_HW_1   BASED(ADDR(SK_CURRENT_HW)) CHAR(35);           04360099
                                                                        04370099
 DCL 1 SK_HW_I LIKE SK_CURRENT_HW;                                      04380099
 DCL 1 SK_HW_I_1   BASED(ADDR(SK_HW_I)) CHAR(35);         /* RB01242 */ 04390099
                                                                        04400099
 DCL 1 SK_HW_O LIKE SK_CURRENT_HW;                                      04410099
 DCL 1 SK_HW_O_1   BASED(ADDR(SK_HW_O)) CHAR(35);         /* RB01242 */ 04420099
                                                      /* SOC RB01237 */ 04430099
 DCL 1 SK_HW_PI LIKE SK_CURRENT_HW;                                     04440099
 DCL 1 SK_HW_PI_1  BASED(ADDR(SK_HW_PI)) CHAR(35);        /* RB01242 */ 04450099
                                                      /* EOC RB01237 */ 04460099
 DCL 1 WRK_FWTOW           CHAR (01);                     /* RB01298 */ 04470099
 DCL 1 WRK_HBTOM           CHAR (01);                     /* RB01298 */ 04480099
                                                      /* SOC RB01320 */ 04490099
 DCL 1 WRK_220_I_TOM            CHAR (1)  INIT ('');                    04500099
 DCL 1 WRK_220_I_TOW            CHAR (1)  INIT ('');                    04510099
 DCL 1 WRK_220_I_FTOW           CHAR (1)  INIT ('');                    04520099
 DCL 1 WRK_051_PI_TOM           CHAR (1)  INIT ('');                    04530099
 DCL 1 WRK_051_PI_TOW           CHAR (1)  INIT ('');                    04540099
 DCL 1 WRK_051_PI_FTOW          CHAR (1)  INIT ('');  /* EOC RB01320 */ 04550099
                                                                        04560099
1/********************************************************************/ 04570099
 /*  BUILTIN FUNCTIONS                                               */ 04580099
 /********************************************************************/ 04590099
 DCL (ADDR,                                                             04600099
     DATE,                                                              04610099
     NULL,                                                              04620099
     STRING,                                                            04630099
     SUBSTR,                                                            04640099
     STG,                                                               04650099
     TRANSLATE,                                                         04660099
     TIME)                   BUILTIN;                                   04670099
0/********************************************************************/ 04680099
 /* ON ERROR CONDITIONS                                              */ 04690099
 /********************************************************************/ 04700099
 %INCLUDE (RCB0E0M);                                                    04710099
 END;                                                                   04720099
0/********************************************************************/ 04730099
 /* DB2/SQL SQLCA                                                    */ 04740099
 /********************************************************************/ 04750099
 EXEC SQL                                                               04760099
   INCLUDE SQLCA                                                        04770099
   ;                                                                    04780099
1/********************************************************************/ 04790099
 /* DB2/SQL CURSORS                                                  */ 04800099
 /********************************************************************/ 04810099
                                                      /* SOC RB01237 */ 04820099
                            /* CURSOR_HW_PI                          */ 04830099
                            /* RETRIEVE ALL CHANGED HW PRIME INPUT   */ 04840099
     /* DATES '3999-12-31' ARE PLACE-HOLDERS. A DATE FORMAT MUST BE  */ 04850099
     /* SELECTED FOR CERTAIN FIELDS. WHEN A ROW IS RETRIEVED, WITH   */ 04860099
     /* DATE '3999-12-31' THIS WILL BE BLANKED AND SET TO DB2 NULL.  */ 04870099
 EXEC SQL                                                               04880099
   DECLARE CURSOR_HW_PI CURSOR FOR                                      04890099
   SELECT                                                               04900099
          B.PRODUCT_TYPE                                                04910099
                                                      /* SOC RB01320 */ 04920099
         ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   04930099
         ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   04940099
      /* ,B.ORIGIN                                                      04950099
         ,B.SEQUENCE_NUMBER */                        /* EOC RB01320 */ 04960099
         ,'BOTH'                                                        04970099
         ,B.MODEL_NUMBER                                                04980099
         ,B.INSTALL_DATE                                                04990099
         ,B.TYPE_OF_MAINT                                               05000099
         ,B.TYPE_OF_WARRANTY                                            05010099
         ,B.SERVICE_LVL_CODE_1                                          05020099
         ,B.WARRANTY_SPLT_DATE                                          05030099
         ,B.SERVICE_LVL_CODE_2                                          05040099
         ,B.WARRANTY_EXP_DATE                             /* RB01281 */ 05050099
         ,B.CUSTOMER_NUMBER                                             05060099
         ,B.OU_CODE                                                     05070099
         ,B.SOURCE_INDICATOR                              /* RB01289 */ 05080099
         ,B.F_TYPE_OF_WARRANTY                            /* RB01281 */ 05090099
         ,C.CONTRACT_NUMBER                                             05100099
         ,C.SERVICE_TYPE                                                05110099
         ,C.EFFECTIVE_DATE                                              05120099
         ,C.END_DATE                                                    05130099
         ,C.AUTHORISATION_CODE                            /* RB01320 */ 05140099
         ,D.CUSTOMER_NUMBER                           /* SOC RB01289 */ 05150099
         ,E.CUSTOMER_NUMBER                                             05160099
         ,F.CUSTOMER_NUMBER                                             05170099
         ,G.OU_CODE                                       /* RC01311 */ 05180099
   FROM RCBV0725_PICOS_HW               A                               05190099
   LEFT OUTER JOIN RCBV0125_DMMY_REAL   H             /* SOC RB01320 */ 05200099
     ON    A.PRODUCT_TYPE       = H.PRODUCT_TYPE                        05210099
     AND   A.ORIGIN             = H.DUMMY_ORIGIN                        05220099
     AND   A.SEQUENCE_NUMBER    = H.DUMMY_SEQUENCE_NUM                  05230099
     AND   A.COUNTRY_NUMBER     = H.COUNTRY_NUMBER    /* EOC RB01320 */ 05240099
   INNER JOIN RCBV0051_PI_HW_PR         B                               05250099
     ON  B.PRODUCT_TYPE         = A.PRODUCT_TYPE                        05260099
 /*  AND B.ORIGIN               = A.ORIGIN            /* SOC RB01320 */ 05270099
 /*  AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER                  */ 05280099
     AND ((B.ORIGIN                    = A.ORIGIN                       05290099
     AND   B.SEQUENCE_NUMBER           = A.SEQUENCE_NUMBER)             05300099
     OR   (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER               05310099
     AND   B.PRODUCT_TYPE              = H.PRODUCT_TYPE                 05320099
     AND  (B.ORIGIN||B.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)          05330099
     AND  (A.ORIGIN                    = H.DUMMY_ORIGIN                 05340099
     AND   A.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM)))        05350099
                                                      /* EOC RB01320 */ 05360099
     AND B.COUNTRY_NUMBER       = A.COUNTRY_NUMBER                      05370099
   INNER JOIN RCBV0241_PI_CTR           C                               05380099
     ON  B.PRODUCT_TYPE         = C.PRODUCT_TYPE                        05390099
     AND B.ORIGIN               = C.ORIGIN                              05400099
     AND B.SEQUENCE_NUMBER      = C.SEQUENCE_NUMBER                     05410099
     AND B.COUNTRY_NUMBER = C.COUNTRY_NUMBER                            05420099
   LEFT OUTER JOIN RCBV0010_CUSTOMER    D                               05430099
     ON  B.COUNTRY_NUMBER       = D.COUNTRY_NUMBER                      05440099
     AND B.CUSTOMER_NUMBER      = D.CUSTOMER_NUMBER                     05450099
     AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE          05460099
   LEFT OUTER JOIN RCBV0011_PI_CUST     E                               05470099
     ON  B.COUNTRY_NUMBER       = E.COUNTRY_NUMBER                      05480099
     AND B.CUSTOMER_NUMBER      = E.CUSTOMER_NUMBER                     05490099
     AND B.CUSTOMER_NR_EXTEND   = E.CUSTOMER_NR_EXTEND                  05500099
   LEFT OUTER JOIN RCBV0190_HW_CUST     F                               05510099
     ON  B.PRODUCT_TYPE         = F.PRODUCT_TYPE                        05520099
 /*  AND B.ORIGIN               = F.ORIGIN            /* SOC RB01320 */ 05530099
 /*  AND B.SEQUENCE_NUMBER      = F.SEQUENCE_NUMBER                  */ 05540099
     AND ((B.ORIGIN                     = F.ORIGIN                      05550099
     AND   B.SEQUENCE_NUMBER            = F.SEQUENCE_NUMBER)            05560099
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              05570099
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                05580099
     AND  (F.ORIGIN||F.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         05590099
     AND  (B.ORIGIN                     = H.DUMMY_ORIGIN                05600099
     AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))       05610099
                                                      /* EOC RB01320 */ 05620099
     AND B.COUNTRY_NUMBER       = F.COUNTRY_NUMBER                      05630099
     AND F.TYPE_OF_RELATION     = 'U'                /* CEDS00000468 */ 05640099
     AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE          05650099
                                                                        05660099
   LEFT OUTER JOIN RCBV0170_OU_HW     G               /* SOC RC01311 */ 05670099
     ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                          05680099
 /*  AND B.ORIGIN             = G.ORIGIN              /* SOC RB01320 */ 05690099
 /*  AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER                    */ 05700099
     AND ((B.ORIGIN                     = G.ORIGIN                      05710099
     AND   B.SEQUENCE_NUMBER            = G.SEQUENCE_NUMBER)            05720099
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              05730099
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                05740099
     AND  (G.ORIGIN||G.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         05750099
     AND  (B.ORIGIN                     = H.DUMMY_ORIGIN                05760099
     AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))       05770099
                                                      /* EOC RB01320 */ 05780099
     AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                        05790099
     AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE          05800099
                                                      /* EOC RC01311 */ 05810099
   WHERE A.COUNTRY_NUMBER       = :WRK_CTRYNO                           05820099
     AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE          05830099
                                                      /* EOC RB01289 */ 05840099
                                                                        05850099
 /*FROM RCBV0725_PICOS_HW    A                        /* SOC RB01289 */ 05860099
 /*    ,RCBV0051_PI_HW_PR    B                                          05870099
       ,RCBV0241_PI_CTR      C                                          05880099
   WHERE A.COUNTRY_NUMBER    = :WRK_CTRYNO                              05890099
                                                                        05900099
     AND B.COUNTRY_NUMBER    = A.COUNTRY_NUMBER                         05910099
     AND B.PRODUCT_TYPE      = A.PRODUCT_TYPE                           05920099
     AND B.ORIGIN            = A.ORIGIN                                 05930099
     AND B.SEQUENCE_NUMBER   = A.SEQUENCE_NUMBER                        05940099
                                                                        05950099
     AND C.COUNTRY_NUMBER    = B.COUNTRY_NUMBER                         05960099
     AND C.PRODUCT_TYPE      = B.PRODUCT_TYPE                           05970099
     AND C.ORIGIN            = B.ORIGIN                                 05980099
     AND C.SEQUENCE_NUMBER   = B.SEQUENCE_NUMBER                        05990099
     AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE                         06000099
                           AND C.END_DATE             /* EOC RB01289 */ 06010099
                                                                        06020099
   UNION                                                                06030099
                                                                        06040099
   SELECT                                                               06050099
          B.PRODUCT_TYPE                                                06060099
                                                     /* SOC RB01320 */  06070099
         ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   06080099
         ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   06090099
       /*,B.ORIGIN                                                      06100099
         ,B.SEQUENCE_NUMBER */                       /* EOC RB01320 */  06110099
         ,'T051'                                                        06120099
         ,B.MODEL_NUMBER                                                06130099
         ,B.INSTALL_DATE                                                06140099
         ,B.TYPE_OF_MAINT                                               06150099
         ,B.TYPE_OF_WARRANTY                                            06160099
         ,B.SERVICE_LVL_CODE_1                                          06170099
         ,B.WARRANTY_SPLT_DATE                                          06180099
         ,B.SERVICE_LVL_CODE_2                                          06190099
         ,B.WARRANTY_EXP_DATE                             /* RB01281 */ 06200099
         ,B.CUSTOMER_NUMBER                                             06210099
         ,B.OU_CODE                                                     06220099
         ,B.SOURCE_INDICATOR                              /* RB01289 */ 06230099
         ,B.F_TYPE_OF_WARRANTY                            /* RB01281 */ 06240099
         ,''                                                            06250099
         ,''                                                            06260099
         ,DATE('3999-12-31')                                            06270099
         ,DATE('3999-12-31')                                            06280099
         ,''                                              /* RB01320 */ 06290099
         ,D.CUSTOMER_NUMBER                            /* SOC RB01289 */06300099
         ,E.CUSTOMER_NUMBER                                             06310099
         ,F.CUSTOMER_NUMBER                                             06320099
         ,G.OU_CODE                                        /* RC01311 */06330099
   FROM RCBV0725_PICOS_HW               A                               06340099
   LEFT OUTER JOIN RCBV0125_DMMY_REAL   H             /* SOC RB01320 */ 06350099
     ON    A.PRODUCT_TYPE       = H.PRODUCT_TYPE                        06360099
     AND   A.ORIGIN             = H.DUMMY_ORIGIN                        06370099
     AND   A.SEQUENCE_NUMBER    = H.DUMMY_SEQUENCE_NUM                  06380099
     AND   A.COUNTRY_NUMBER     = H.COUNTRY_NUMBER    /* EOC RB01320 */ 06390099
   INNER JOIN RCBV0051_PI_HW_PR         B                               06400099
     ON  B.PRODUCT_TYPE         = A.PRODUCT_TYPE                        06410099
 /*  AND B.ORIGIN               = A.ORIGIN            /* SOC RB01320 */ 06420099
 /*  AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER                  */ 06430099
     AND ((B.ORIGIN                     = A.ORIGIN                      06440099
     AND   B.SEQUENCE_NUMBER            = A.SEQUENCE_NUMBER)            06450099
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              06460099
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                06470099
     AND  (B.ORIGIN||B.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         06480099
     AND  (A.ORIGIN                     = H.DUMMY_ORIGIN                06490099
     AND   A.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))       06500099
                                                      /* EOC RB01320 */ 06510099
     AND B.COUNTRY_NUMBER       = A.COUNTRY_NUMBER                      06520099
   LEFT OUTER JOIN RCBV0010_CUSTOMER    D                               06530099
     ON  B.COUNTRY_NUMBER       = D.COUNTRY_NUMBER                      06540099
     AND B.CUSTOMER_NUMBER      = D.CUSTOMER_NUMBER                     06550099
     AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE          06560099
   LEFT OUTER JOIN RCBV0011_PI_CUST     E                               06570099
     ON  B.COUNTRY_NUMBER       = E.COUNTRY_NUMBER                      06580099
     AND B.CUSTOMER_NUMBER      = E.CUSTOMER_NUMBER                     06590099
     AND B.CUSTOMER_NR_EXTEND   = E.CUSTOMER_NR_EXTEND                  06600099
   LEFT OUTER JOIN RCBV0190_HW_CUST     F                               06610099
     ON  B.PRODUCT_TYPE         = F.PRODUCT_TYPE                        06620099
 /*  AND B.ORIGIN               = F.ORIGIN            /* SOC RB01320 */ 06630099
 /*  AND B.SEQUENCE_NUMBER      = F.SEQUENCE_NUMBER                  */ 06640099
     AND ((B.ORIGIN                     = F.ORIGIN                      06650099
     AND   B.SEQUENCE_NUMBER            = F.SEQUENCE_NUMBER)            06660099
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              06670099
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                06680099
     AND  (F.ORIGIN||F.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         06690099
     AND  (B.ORIGIN                     = H.DUMMY_ORIGIN                06700099
     AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))       06710099
                                                      /* EOC RB01320 */ 06720099
     AND B.COUNTRY_NUMBER       = F.COUNTRY_NUMBER                      06730099
     AND F.TYPE_OF_RELATION     = 'U'                 /* CEDS00000468 */06740099
     AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE          06750099
   LEFT OUTER JOIN RCBV0170_OU_HW     G                /* SOC RC01311 */06760099
     ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                          06770099
 /*  AND B.ORIGIN             = G.ORIGIN              /* SOC RB01320 */ 06780099
 /*  AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER                    */ 06790099
     AND ((B.ORIGIN                     = G.ORIGIN                      06800099
     AND   B.SEQUENCE_NUMBER            = G.SEQUENCE_NUMBER)            06810099
     OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER              06820099
     AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE                06830099
     AND  (G.ORIGIN||G.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)         06840099
     AND  (B.ORIGIN                     = H.DUMMY_ORIGIN                06850099
     AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))       06860099
                                                      /* EOC RB01320 */ 06870099
     AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                        06880099
     AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE          06890099
                                                       /* EOC RC01311 */06900099
                                                                        06910099
   WHERE A.COUNTRY_NUMBER       = :WRK_CTRYNO                           06920099
 /*  AND B.WARRANTY_EXP_DATE    >= :WRK_RUN_DATE       /* EOC RB01289 */06930099
                                                           /* RC01293 */06940099
 /*FROM RCBV0725_PICOS_HW     A                        /* SOC RB01289 */06950099
 /*      ,RCBV0051_PI_HW_PR     B                                       06960099
   WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                             06970099
                                                                        06980099
     AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                        06990099
     AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                          07000099
     AND B.ORIGIN             = A.ORIGIN                                07010099
     AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       07020099
     AND B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE          /* EOC RB01289 */07030099
                                                                        07040099
     AND NOT EXISTS                                                     07050099
        (SELECT *                                                       07060099
         FROM RCBV0241_PI_CTR      C                                    07070099
         WHERE C.COUNTRY_NUMBER    = :WRK_CTRYNO                        07080099
           AND C.PRODUCT_TYPE      = B.PRODUCT_TYPE                     07090099
           AND C.ORIGIN            = B.ORIGIN                           07100099
           AND C.SEQUENCE_NUMBER   = B.SEQUENCE_NUMBER                  07110099
                                                                        07120099
           AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE                   07130099
                                 AND C.END_DATE                         07140099
        )                                                               07150099
                                                                        07160099
   UNION                                                                07170099
                                                                        07180099
   SELECT                                                               07190099
          C.PRODUCT_TYPE                                                07200099
                                                       /* SOC RB01320 */07210099
         ,COALESCE(D.DUMMY_ORIGIN,C.ORIGIN) AS ORIGIN                   07220099
         ,COALESCE(D.DUMMY_SEQUENCE_NUM,C.SEQUENCE_NUMBER) AS SEQ_NUM   07230099
      /* ,C.ORIGIN                                                      07240099
         ,C.SEQUENCE_NUMBER */                         /* EOC RB01320 */07250099
         ,'T241'                                                        07260099
         ,''                                                            07270099
         ,DATE('3999-12-31')                                            07280099
         ,''                                                            07290099
         ,''                                                            07300099
         ,''                                                            07310099
         ,DATE('3999-12-31')                                            07320099
         ,''                                                            07330099
         ,DATE('3999-12-31')                              /* RB01281 */ 07340099
         ,C.CUSTOMER_NUMBER                               /* RB01289 */ 07350099
         ,''                                                            07360099
         ,''                                              /* RB01289 */ 07370099
         ,''                                              /* RB01281 */ 07380099
         ,C.CONTRACT_NUMBER                                             07390099
         ,C.SERVICE_TYPE                                                07400099
         ,C.EFFECTIVE_DATE                                              07410099
         ,C.END_DATE                                                    07420099
         ,C.AUTHORISATION_CODE                            /* RB01320 */ 07430099
         ,''                                           /* SOC RB01289 */07440099
         ,''                                                            07450099
         ,''                                           /* EOC RB01289 */07460099
         ,''                                               /* RC01311 */07470099
 /*FROM RCBV0725_PICOS_HW    A                                       */ 07480099
 /*    ,RCBV0241_PI_CTR      C                                       */ 07490099
   FROM RCBV0241_PI_CTR      C                                          07500099
       ,RCBV0725_PICOS_HW    A                                          07510099
   LEFT OUTER JOIN RCBV0125_DMMY_REAL   D                               07520099
   ON    A.PRODUCT_TYPE               = D.PRODUCT_TYPE                  07530099
   AND   A.ORIGIN                     = D.DUMMY_ORIGIN                  07540099
   AND   A.SEQUENCE_NUMBER            = D.DUMMY_SEQUENCE_NUM            07550099
   AND   A.COUNTRY_NUMBER             = D.COUNTRY_NUMBER                07560099
                                                      /* EOC RB01320 */ 07570099
   WHERE A.COUNTRY_NUMBER    = :WRK_CTRYNO                              07580099
                                                                        07590099
     AND C.COUNTRY_NUMBER    = A.COUNTRY_NUMBER                         07600099
     AND C.PRODUCT_TYPE      = A.PRODUCT_TYPE                           07610099
 /*  AND C.ORIGIN            = A.ORIGIN               /* SOC RB01320 */ 07620099
 /*  AND C.SEQUENCE_NUMBER   = A.SEQUENCE_NUMBER                     */ 07630099
     AND ((C.ORIGIN                     = A.ORIGIN                      07640099
     AND   C.SEQUENCE_NUMBER            = A.SEQUENCE_NUMBER)            07650099
     OR   (C.COUNTRY_NUMBER             = D.COUNTRY_NUMBER              07660099
     AND   C.PRODUCT_TYPE               = D.PRODUCT_TYPE                07670099
     AND  (C.ORIGIN||C.SEQUENCE_NUMBER  = D.REAL_SERIAL_NUMBER)         07680099
     AND  (A.ORIGIN                     = D.DUMMY_ORIGIN                07690099
     AND   A.SEQUENCE_NUMBER            = D.DUMMY_SEQUENCE_NUM)))       07700099
                                                      /* EOC RB01320 */ 07710099
     AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE                         07720099
                           AND C.END_DATE                               07730099
                                                                        07740099
     AND NOT EXISTS                                                     07750099
        (SELECT *                                                       07760099
         FROM RCBV0051_PI_HW_PR    B                                    07770099
         WHERE B.COUNTRY_NUMBER    = :WRK_CTRYNO                        07780099
           AND B.PRODUCT_TYPE      = C.PRODUCT_TYPE                     07790099
           AND B.ORIGIN            = C.ORIGIN                           07800099
           AND B.SEQUENCE_NUMBER   = C.SEQUENCE_NUMBER                  07810099
        )                                                               07820099
                                                                        07830099
   ORDER BY 1                                                           07840099
           ,2                                                           07850099
           ,3                                                           07860099
   FOR FETCH ONLY                                                       07870099
           ;                                                            07880099
                                                      /* EOC RB01237 */ 07890099
0/********************************************************************/ 07900099
                                         /* CURSOR_HW_O              */ 07910099
                            /* RETRIEVE ALL CHANGED HW ON ORDER      */ 07920099
 EXEC SQL                                                               07930099
   DECLARE CURSOR_HW_O CURSOR FOR                                       07940099
   SELECT DISTINCT                                                      07950099
          B.PRODUCT_TYPE                                                07960099
                                                      /* SOC RB01320 */ 07970099
       /*,B.ORIGIN                                                      07980099
         ,B.SEQUENCE_NUMBER */                                          07990099
         ,COALESCE(D.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   08000099
         ,COALESCE(D.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   08010099
                                                      /* EOC RB01320 */ 08020099
         ,B.MODEL_NUMBER                                                08030099
         ,B.CUSTOMER_USER                                               08040099
         ,B.ORDER_REF_NUMBER                                            08050099
         ,B.DP_SYSTEM_NUMBER                                            08060099
         ,B.OU_CODE                                                     08070099
         ,B.SCHED_COMPL_DATE                                            08080099
         ,B.TYPE_OF_MAINT                                               08090099
         ,B.TYPE_OF_WARRANTY                                            08100099
         ,B.ORDER_DATE                                                  08110099
         ,B.END_DATE                                                    08120099
         ,C.MABO                                                        08130099
 /*FROM RCBV0725_PICOS_HW    A                                       */ 08140099
 /*    ,RCBV0040_OU          C                                       */ 08150099
   FROM RCBV0040_OU          C                                          08160099
       ,RCBV0260_HW_IN_ORD   B                                          08170099
       ,RCBV0725_PICOS_HW    A                                          08180099
                                                                        08190099
   LEFT OUTER JOIN RCBV0125_DMMY_REAL D                                 08200099
     ON    A.PRODUCT_TYPE       = D.PRODUCT_TYPE                        08210099
     AND   A.ORIGIN             = D.DUMMY_ORIGIN                        08220099
     AND   A.SEQUENCE_NUMBER    = D.DUMMY_SEQUENCE_NUM                  08230099
     AND   A.COUNTRY_NUMBER     = D.COUNTRY_NUMBER    /* EOC RB01320 */ 08240099
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            08250099
                                                                        08260099
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       08270099
     AND B.ORDER_REF_NUMBER    = A.ORDER_REF_NUMBER                     08280099
     AND B.END_DATE           >= :WRK_RUN_DATE                          08290099
                                                                        08300099
     AND C.COUNTRY_NUMBER      = B.COUNTRY_NUMBER                       08310099
     AND C.OU_CODE             = B.OU_CODE                              08320099
                                                                        08330099
   ORDER BY B.PRODUCT_TYPE     ASC                                      08340099
         /*,B.ORIGIN           ASC                                      08350099
           ,B.SEQUENCE_NUMBER  ASC */                                   08360099
           ,ORIGIN             ASC                                      08370099
           ,SEQ_NUM            ASC                                      08380099
           ,B.MODEL_NUMBER     ASC                                      08390099
           ,B.ORDER_REF_NUMBER ASC                                      08400099
   FOR FETCH ONLY                                         /* RC01219 */ 08410099
           ;                                                            08420099
                                                                        08430099
0/********************************************************************/ 08440099
                                         /* CURSOR_HW_I              */ 08450099
                            /* RETRIEVE ALL CHANGED HW INSTALLED     */ 08460099
 EXEC SQL                                                               08470099
   DECLARE CURSOR_HW_I CURSOR FOR                                       08480099
   SELECT DISTINCT                                                      08490099
          B.PRODUCT_TYPE                                                08500099
                                                       /* SOC RB01320 */08510099
     /*  ,B.ORIGIN                                                      08520099
         ,B.SEQUENCE_NUMBER */                                          08530099
                                                  /* SOC CEDS00000738 */08531099
     /*  ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   08540099
         ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM */08550099
         ,A.ORIGIN                                                      08560099
         ,A.SEQUENCE_NUMBER                                             08570099
                                                  /* EOC CEDS00000738 */08571099
                                                       /* EOC RB01320 */08580099
         ,B.MODEL_NUMBER                                                08590099
         ,C.CUSTOMER_NUMBER                                             08600099
         ,C.MARKETING_INSTDAT                                           08610099
         ,D.STATUS                                                      08620099
         ,F.OU_CODE                                                     08630099
         ,F.MABO                                                        08640099
         ,G.TYPE_OF_MAINT                                               08650099
         ,G.TYPE_OF_WARRANTY                                            08660099
         ,G.WARRANTY_EXP_DATE                             /* RB01281 */ 08670099
         ,G.F_TYPE_OF_WARRANTY                            /* RB01281 */ 08680099
         ,G.F_SPLT_DATE                                   /* RB01281 */ 08690099
         ,G.SOURCE_INDICATOR                              /* RB01290 */ 08700099
         ,G.EFFECTIVE_DATE                            /* SOC RB01320 */ 08710099
         ,G.END_DATE                                                    08720099
 /*      ,H.REAL_SERIAL_NUMBER */                 /* SOC CEDS00000738 */08730099
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM           /* EOC CEDS00000738 */08740099
 /*FROM RCBV0725_PICOS_HW    A                                       */ 08750099
 /*    ,RCBV0300_HW_REAL     B                                       */ 08760099
                                                  /* SOC CEDS00000738*/ 08770099
 /*   FROM RCBV0300_HW_REAL     B                 /* EOC RB01320 */     08780099
 /*    ,RCBV0190_HW_CUST     C                                          08790099
 /*    ,RCBV0110_HW_STATUS   D                                          08800099
 /*    ,RCBV0170_OU_HW       E                                          08810099
 /*    ,RCBV0040_OU          F                                          08820099
 /*    ,RCBV0220_SUPPL_CTR   G                                          08830099
 /*    ,RCBV0725_PICOS_HW    A                        /* SOC RB01320 */ 08840099
      FROM RCBV0725_PICOS_HW    A                                       08850099
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL H                                 08860099
 /*  ON  A.PRODUCT_TYPE       = H.PRODUCT_TYPE                          08870099
 /*  AND A.ORIGIN             = H.DUMMY_ORIGIN                          08880099
 /*  AND A.SEQUENCE_NUMBER    = H.DUMMY_SEQUENCE_NUM                    08890099
 /*  AND A.COUNTRY_NUMBER     = H.COUNTRY_NUMBER       /* EOC RB01320 */08900099
 /*WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            08910099
 /*  AND A.ORDER_REF_NUMBER    = '      ' */                            08920099
   INNER JOIN RCBV0300_HW_REAL     B                                    08930099
 /*  AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE */                      08940099
     ON  B.PRODUCT_TYPE        = A.PRODUCT_TYPE   /* EOC CEDS00000738 */08950099
 /*  AND B.ORIGIN              = A.ORIGIN             /* SOC RB01320 */ 08960099
 /*  AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                   */ 08970099
 /*  AND ((B.ORIGIN             = A.ORIGIN       /* SOC CEDS00000738 */ 08980099
 /*  AND ((B.ORIGIN             = A.ORIGIN                              08990099
 /*  AND   B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    09000099
 /*  OR   (H.COUNTRY_NUMBER     = B.COUNTRY_NUMBER                      09010099
 /*  AND   H.PRODUCT_TYPE       = B.PRODUCT_TYPE                        09020099
 /*  AND ((H.REAL_SERIAL_NUMBER = B.ORIGIN||B.SEQUENCE_NUMBER)          09030099
 /*  AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              09040099
 /*  AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              09050099
     AND B.ORIGIN             = A.REAL_ORIGIN                           09060099
     AND B.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM   /* EOC CEDS00000738 */ 09070099
                                                      /* EOC RB01320 */ 09080099
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       09090099
     AND :WRK_RUN_DATE         BETWEEN B.EFFECTIVE_DATE                 09100099
                                   AND B.END_DATE                       09110099
                                                                        09120099
     INNER JOIN RCBV0190_HW_CUST     C           /* SOC CEDS00000738 */ 09130099
 /*  AND C.PRODUCT_TYPE        = A.PRODUCT_TYPE  */                     09140099
     ON  C.PRODUCT_TYPE        = A.PRODUCT_TYPE  /* EOC CEDS00000738 */ 09150099
 /*  AND C.ORIGIN              = A.ORIGIN             /* SOC RB01320 */ 09160099
 /*  AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                   */ 09170099
 /*  AND ((C.ORIGIN             = A.ORIGIN      /* SOC CEDS00000738 */  09180099
 /*  AND   C.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    09190099
 /*  OR   (H.COUNTRY_NUMBER     = C.COUNTRY_NUMBER                      09200099
 /*  AND   H.PRODUCT_TYPE       = C.PRODUCT_TYPE                        09210099
 /*  AND ((H.REAL_SERIAL_NUMBER = C.ORIGIN||C.SEQUENCE_NUMBER)          09220099
 /*  AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              09230099
 /*  AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              09240099
     AND C.ORIGIN             = A.REAL_ORIGIN                           09250099
     AND C.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM   /* EOC CEDS00000738 */ 09260099
                                                      /* EOC RB01320 */ 09270099
     AND C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       09280099
     AND C.TYPE_OF_RELATION    = 'U'                                    09290099
     AND C.EFFECTIVE_DATE      <= B.END_DATE          /* SOC RB01320 */ 09300099
     AND C.END_DATE            >= B.EFFECTIVE_DATE    /* EOC RB01320 */ 09310099
     AND :WRK_RUN_DATE         BETWEEN C.EFFECTIVE_DATE                 09320099
                                   AND C.END_DATE                       09330099
                                                                        09340099
     INNER JOIN RCBV0110_HW_STATUS   D            /* SOC CEDS00000738 */09350099
 /*  AND D.PRODUCT_TYPE        = A.PRODUCT_TYPE  */                     09360099
     ON D.PRODUCT_TYPE        = A.PRODUCT_TYPE    /* EOC CEDS00000738 */09370099
 /*  AND D.ORIGIN              = A.ORIGIN             /* SOC RB01320 */ 09380099
 /*  AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                   */ 09390099
 /*  AND ((D.ORIGIN             = A.ORIGIN       /* SOC CEDS00000738 */ 09400099
 /*  AND   D.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    09410099
 /*  OR   (H.COUNTRY_NUMBER     = D.COUNTRY_NUMBER                      09420099
 /*  AND   H.PRODUCT_TYPE       = D.PRODUCT_TYPE                        09430099
 /*  AND ((H.REAL_SERIAL_NUMBER = D.ORIGIN||D.SEQUENCE_NUMBER)          09440099
 /*  AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              09450099
 /*  AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              09460099
     AND D.ORIGIN             = A.REAL_ORIGIN                           09470099
     AND D.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM   /* EOC CEDS00000738 */ 09480099
                                                      /* EOC RB01320 */ 09490099
     AND D.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       09500099
     AND D.EFFECTIVE_DATE      <= B.END_DATE          /* SOC RB01320 */ 09510099
     AND D.END_DATE            >= B.EFFECTIVE_DATE                      09520099
     AND D.EFFECTIVE_DATE      <= C.END_DATE                            09530099
     AND D.END_DATE            >= C.EFFECTIVE_DATE    /* EOC RB01320 */ 09540099
     AND :WRK_RUN_DATE         BETWEEN D.EFFECTIVE_DATE                 09550099
                                   AND D.END_DATE                       09560099
     INNER JOIN RCBV0170_OU_HW       E            /* SOC CEDS00000738 */09570099
 /*  AND E.PRODUCT_TYPE        = A.PRODUCT_TYPE */                      09580099
     ON  E.PRODUCT_TYPE        = A.PRODUCT_TYPE   /* EOC CEDS00000738 */09590099
 /*  AND E.ORIGIN              = A.ORIGIN             /* SOC RB01320 */ 09600099
 /*  AND E.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                   */ 09610099
 /*  AND ((E.ORIGIN             = A.ORIGIN       /* SOC CEDS00000738 */ 09620099
 /*  AND   E.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    09630099
 /*  OR   (H.COUNTRY_NUMBER     = E.COUNTRY_NUMBER                      09640099
 /*  AND   H.PRODUCT_TYPE       = E.PRODUCT_TYPE                        09650099
 /*  AND ((H.REAL_SERIAL_NUMBER = E.ORIGIN||E.SEQUENCE_NUMBER)          09660099
 /*  AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              09670099
 /*  AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              09680099
     AND E.ORIGIN             = A.REAL_ORIGIN                           09690099
     AND E.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM   /* EOC CEDS00000738 */ 09700099
                                                      /* EOC RB01320 */ 09710099
     AND E.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       09720099
     AND E.EFFECTIVE_DATE      <= B.END_DATE          /* SOC RB01320 */ 09730099
     AND E.END_DATE            >= B.EFFECTIVE_DATE                      09740099
     AND E.EFFECTIVE_DATE      <= C.END_DATE                            09750099
     AND E.END_DATE            >= C.EFFECTIVE_DATE                      09760099
     AND E.EFFECTIVE_DATE      <= D.END_DATE                            09770099
     AND E.END_DATE            >= D.EFFECTIVE_DATE    /* EOC RB01320 */ 09780099
     AND :WRK_RUN_DATE         BETWEEN E.EFFECTIVE_DATE                 09790099
                                   AND E.END_DATE                       09800099
                                                                        09810099
     INNER JOIN RCBV0040_OU          F            /* SOC CEDS00000738 */09820099
  /* AND F.COUNTRY_NUMBER      = E.COUNTRY_NUMBER */                    09830099
     ON  F.COUNTRY_NUMBER      = E.COUNTRY_NUMBER /* EOC CEDS00000738 */09840099
     AND F.OU_CODE             = E.OU_CODE                              09850099
                                                                        09860099
     INNER JOIN RCBV0220_SUPPL_CTR   G           /* SOC CEDS00000738 */ 09870099
 /*  AND G.PRODUCT_TYPE        = A.PRODUCT_TYPE  */                     09880099
     ON  G.PRODUCT_TYPE        = A.PRODUCT_TYPE  /* EOC CEDS00000738 */ 09890099
 /*  AND G.ORIGIN              = A.ORIGIN             /* SOC RB01320 */ 09900099
 /*  AND G.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                   */ 09910099
 /*  AND ((G.ORIGIN             = A.ORIGIN       /* SOC CEDS00000738 */ 09920099
 /*  AND   G.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    09930099
 /*  OR   (H.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      09940099
 /*  AND   H.PRODUCT_TYPE       = G.PRODUCT_TYPE                        09950099
 /*  AND ((H.REAL_SERIAL_NUMBER = G.ORIGIN||G.SEQUENCE_NUMBER)          09960099
 /*  AND  (H.DUMMY_ORIGIN       = A.ORIGIN                              09970099
 /*  AND   H.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER)))) */              09980099
     AND G.ORIGIN             = A.REAL_ORIGIN                           09990099
     AND G.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM   /* EOC CEDS00000738 */ 10000099
                                                      /* EOC RB01320 */ 10010099
     AND G.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       10020099
     AND G.EFFECTIVE_DATE      <= B.END_DATE          /* SOC RB01320 */ 10030099
     AND G.END_DATE            >= B.EFFECTIVE_DATE                      10040099
     AND G.EFFECTIVE_DATE      <= C.END_DATE                            10050099
     AND G.END_DATE            >= C.EFFECTIVE_DATE                      10060099
     AND G.EFFECTIVE_DATE      <= D.END_DATE                            10070099
     AND G.END_DATE            >= D.EFFECTIVE_DATE                      10080099
     AND G.EFFECTIVE_DATE      <= E.END_DATE                            10090099
     AND G.END_DATE            >= E.EFFECTIVE_DATE    /* EOC RB01320 */ 10100099
     AND :WRK_RUN_DATE         BETWEEN G.EFFECTIVE_DATE                 10110099
                                   AND G.END_DATE                       10120099
                                                                        10130099
     WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO   /* SOC CEDS00000738 */ 10140099
       AND A.ORDER_REF_NUMBER    = '      '      /* EOC CEDS00000738 */ 10150099
                                                                        10160099
   ORDER BY B.PRODUCT_TYPE                                              10170099
                                                      /* SOC RB01320 */ 10180099
     /*    ,B.ORIGIN                                                    10190099
           ,B.SEQUENCE_NUMBER */                                        10200099
     /*    ,ORIGIN                               /* SOC CEDS00000738 */ 10210099
     /*    ,SEQ_NUM      */                           /* EOC RB01320 */ 10220099
           ,A.ORIGIN                                                    10230099
           ,A.SEQUENCE_NUMBER                    /* EOC CEDS00000738 */ 10240099
           ,B.MODEL_NUMBER                                              10250099
   FOR FETCH ONLY                                         /* RC01219 */ 10260099
           ;                                                            10270099
                                                                        10280099
0/********************************************************************/ 10290099
                                         /* CURSOR_MES_O             */ 10300099
                            /* RETRIEVE ALL MES ORDERS FOR CHANGED   */ 10310099
                            /* ON ORDER HW                           */ 10320099
 EXEC SQL                                                               10330099
   DECLARE CURSOR_MES_O CURSOR FOR                                      10340099
   SELECT MES_ORDER_NUMBER                                              10350099
         ,FUTURE_TYPE                                                   10360099
         ,FUTURE_MODEL                                                  10370099
         ,SCHED_COMPL_DATE                                              10380099
   FROM   RCBV0330_MES_PO                                               10390099
   WHERE  COUNTRY_NUMBER     = :WRK_CTRYNO                              10400099
   AND    ORDER_REF_NUMBER   = :WRK_ORDER_NO                            10410099
   AND    FUTURE_TYPE        IS NOT NULL                                10420099
   AND    FUTURE_TYPE        ¬= :FILE_RCBDQD1.PRODUCT_TYPE              10430099
   AND    :WRK_RUN_DATE BETWEEN ORDER_DATE                              10440099
                            AND END_DATE                                10450099
   ORDER BY MES_ORDER_NUMBER                                            10460099
           ,FUTURE_TYPE                                                 10470099
           ,FUTURE_MODEL                                                10480099
   FOR FETCH ONLY                                         /* RC01219 */ 10490099
   ;                                                                    10500099
                                                                        10510099
0/********************************************************************/ 10520099
                                         /* CURSOR_MES_I             */ 10530099
                            /* RETRIEVE ALL MES ORDERS FOR CHANGED   */ 10540099
                            /* INSTALLED HW                          */ 10550099
 EXEC SQL                                                               10560099
   DECLARE CURSOR_MES_I CURSOR FOR                                      10570099
   SELECT MES_ORDER_NUMBER                                              10580099
         ,FUTURE_TYPE                                                   10590099
         ,FUTURE_MODEL                                                  10600099
         ,SCHED_COMPL_DATE                                              10610099
   FROM   RCBV0250_MES_PR                                               10620099
   WHERE  PRODUCT_TYPE       = :FILE_RCBDQD1.PRODUCT_TYPE               10630099
                                                      /* SOC RB01320 */ 10640099
 /* AND    ORIGIN            = :FILE_RCBDQD1.ORIGIN                     10650099
   AND    SUBSTR(SEQUENCE_NUMBER,3,5) =                                 10660099
                               :FILE_RCBDQD1.SEQUENCE_NUMBER        */  10670099
    AND    ORIGIN                      = :WRK_ORIGIN                    10680099
    AND    SUBSTR(SEQUENCE_NUMBER,3,5) = :WRK_SEQ_NO  /* EOC RB01320 */ 10690099
   AND COUNTRY_NUMBER        = :WRK_CTRYNO                              10700099
   AND    FUTURE_TYPE        IS NOT NULL                                10710099
   AND    FUTURE_TYPE        ¬= :FILE_RCBDQD1.PRODUCT_TYPE              10720099
   AND    :WRK_RUN_DATE BETWEEN ORDER_DATE                              10730099
                            AND END_DATE                                10740099
   ORDER BY MES_ORDER_NUMBER                                            10750099
           ,FUTURE_TYPE                                                 10760099
           ,FUTURE_MODEL                                                10770099
   FOR FETCH ONLY                                         /* RC01219 */ 10780099
   ;                                                                    10790099
1/********************************************************************/ 10800099
 /*                 S T A R T   P R O C E S S I N G                  */ 10810099
 /********************************************************************/ 10820099
 CALL R900_INIT_PROGRAM;                                                10830099
                                  /* PROCESS ALL COUNTRIES ASKED FOR */ 10840099
 DO WHILE (WRK_CTRYNO_NO <= COUNTRY_AREA.COUNT_CTRY);                   10850099
                                                                        10860099
   CALL R700_INIT_COUNTRY;                                              10870099
                                  /* PROCESS ALL CHANGED HW FOR CTRY */ 10880099
                                                      /* SOC RB01237 */ 10890099
   DO WHILE ( ¬SWITCH_EOC_CURSOR_HW_I                                   10900099
            | ¬SWITCH_EOC_CURSOR_HW_O                                   10910099
            | ¬SWITCH_EOC_CURSOR_HW_PI);                                10920099
                                                                        10930099
     CALL R600_INIT_CURR_HW;            /* INITIALIZE CURRENT  KEY   */ 10940099
                                                                        10950099
     IF SK_HW_I_1 < SK_HW_O_1           /* INSTAL. SMALLER ON-ORDER  */ 10960099
     THEN DO;                                                           10970099
       IF SK_HW_I_1 < SK_HW_PI_1 THEN   /* INSTALLED IS SMALLEST KEY */ 10980099
         CALL R102_PROC_HW_I;           /* PROCESS HW INSTALLED      */ 10990099
       ELSE DO;                                                         11000099
         IF SK_HW_PI_1 < SK_HW_I_1 THEN /* PRIM.INP. IS SMALLEST KEY */ 11010099
           CALL R106_PROC_HW_PI;        /* PROCESS HW PRIME INPUT    */ 11020099
         ELSE DO;                       /* INST. AND PI IS SAME KEY  */ 11030099
           CALL R102_PROC_HW_I;         /* PROCESS HW INSTALLED      */ 11040099
           CALL R106_PROC_HW_PI;        /* PROCESS HW PRIME INPUT    */ 11050099
         END;                                                           11060099
       END;                                                             11070099
     END;                                                               11080099
     ELSE DO;                                                           11090099
       IF SK_HW_O_1 < SK_HW_I_1         /* ON-ORDER SMALLER INSTAL.  */ 11100099
       THEN DO;                                                         11110099
         IF SK_HW_O_1 < SK_HW_PI_1 THEN /* ON-ORDER  IS SMALLEST KEY */ 11120099
           CALL R104_PROC_HW_O;         /* PROCESS HW ON-ORDER       */ 11130099
         ELSE DO;                                                       11140099
          IF SK_HW_PI_1 < SK_HW_O_1 THEN      /* PI. IS SMALLEST KEY */ 11150099
             CALL R106_PROC_HW_PI;      /* PROCESS HW PRIME INPUT    */ 11160099
           ELSE DO;                     /* ON-ORD.AND PI IS SAME KEY */ 11170099
             CALL R104_PROC_HW_O;       /* PROCESS HW ON-ORDER       */ 11180099
             CALL R106_PROC_HW_PI;      /* PROCESS HW PRIME INPUT    */ 11190099
           END;                                                         11200099
         END;                                                           11210099
       END;                                                             11220099
       ELSE DO;                         /* INST.AND ON-ORD. SAME KEY */ 11230099
         IF SK_HW_PI_1 = SK_HW_I_1      /* PRIME INPUT ALSO SAME KEY */ 11240099
         THEN DO;                       /* ALL KEYS THE SAME         */ 11250099
           CALL R102_PROC_HW_I;         /* PROCESS BOTH HW INST/ORD. */ 11260099
           CALL R106_PROC_HW_PI;        /* PROCESS HW PRIME INPUT    */ 11270099
         END;                                                           11280099
         ELSE DO;                                                       11290099
           IF SK_HW_PI_1 < SK_HW_I_1                                    11300099
           THEN                         /* PI. IS SMALLEST KEY */       11310099
             CALL R106_PROC_HW_PI;      /* PROCESS HW PRIME INPUT    */ 11320099
           ELSE                         /* INST. AND ORDER SMALL KEY */ 11330099
             CALL R102_PROC_HW_I;       /* PROCESS BOTH HW INST/ORD. */ 11340099
         END;                                                           11350099
       END;                                                             11360099
     END;                                                               11370099
                                                                        11380099
     CALL R699_END_CURR_HW;             /* FINALIZE CURRENT  KEY     */ 11390099
                                                      /* EOC RB01237 */ 11400099
   END;                                                                 11410099
                                                                        11420099
   CALL R799_END_COUNTRY;                                               11430099
                                                                        11440099
 END;                                                                   11450099
                                                                        11460099
 CALL R999_END_PROGRAM;                                                 11470099
                                                                        11480099
1/********************************************************************/ 11490099
 /*                                                      SOC RB01327 */ 11500099
 /* MODULE NAME      :  R102_PROC_HW_I                               */ 11510099
 /*                                                                  */ 11520099
 /* DESCRIPTION      : PROCESS HARDWARE INSTALLED                    */ 11530099
 /*                                                                  */ 11540099
 /********************************************************************/ 11550099
 R102_PROC_HW_I: PROC;                                                  11560099
                                                                        11570099
 SWITCH_BAU     = TRUE;                                                 11580099
 SWITCH_HW_INST = TRUE;                                                 11590099
 SW_WARRANTY             = FALSE;                     /* SOC RB01320 */ 11600099
 SW_SUPP_CTR             = FALSE;                                       11610099
 SW_POST_WARR_BAU        = FALSE;                                       11620099
 SW_POST_WARR_T51_PI     = FALSE;                                       11630099
                                                                        11640099
 IF ((CURSOR_HW_I_V220.TYPE_OF_MAINT =                                  11650099
                    WRK_TPMNT_VAL.TPMNT_ST2_DEF)|                       11660099
       (SWITCH_ACTIVE_CONTRACT = TRUE))                                 11670099
                                                                        11680099
 THEN DO;                                                               11690099
   SW_SUPP_CTR = TRUE;                                                  11700099
   END;                                                                 11710099
 ELSE DO;                                /* PROCESS WARRANTY PERIODS */ 11720099
   IF (VERIFY (CURSOR_HW_I_V220.TYPE_OF_WARRANTY,                       11730099
               WRK_TPMNT_VAL.TPMNT_WAR) = 0  |                          11740099
               SW_BRAND_BAU | SWITCH_FLEXIBLE_WARRANTY_BAU |            11750099
               SWITCH_HARDBUNDLE_BAU )                                  11760099
   THEN DO;                                                             11770099
     SW_WARRANTY = TRUE;                                                11780099
     END;                                                               11790099
 END;                                                                   11800099
                                                                        11810099
 IF (CURSOR_HW_I_V220.TYPE_OF_MAINT = '3')                              11820099
 THEN                                                                   11830099
   DO;                                                                  11840099
     SW_POST_WARR_BAU = TRUE;                                           11850099
   END;                                                                 11860099
                                                      /* EOC RB01320 */ 11870099
 CALL R252_RETR_ADD_INST_INFO;                            /* RA01138 */ 11880099
 CALL R202_FILL_RCBDQD1_I;                                              11890099
                                                                        11900099
 DO WHILE (SK_HW_O_1 = SK_HW_I_1);         /* BYPASS ORDERS SAME KEY */ 11910099
   CALL R214_FETCH_CURSOR_HW_O;                                         11920099
 END;                                                                   11930099
                                                      /* SOC RB01320 */ 11940099
 WRK_220_I_TOM           = CURSOR_HW_I_V220.TYPE_OF_MAINT;              11950099
 WRK_220_I_TOW           = CURSOR_HW_I_V220.TYPE_OF_WARRANTY;           11960099
 WRK_220_I_FTOW          = CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY;         11970099
                                                                        11980099
 /* APPLYING PRIORITY RULES TO SELECT TOM/TOW/FTOW & MA STATUS FIELD */ 11990099
  IF (SK_HW_I_1 = SK_HW_PI_1) THEN                                      12000099
  DO;                                                                   12010099
    CALL R290_APPLY_PRIORITY;                                           12020099
  END;                                                                  12030099
                                                      /* EOC RB01320 */ 12040099
 CALL R204_FETCH_CURSOR_HW_I;                                           12050099
                                                                        12060099
 END R102_PROC_HW_I;                                                    12070099
                                                      /* EOC RB01237 */ 12080099
1/********************************************************************/ 12090099
 /*                                                      SOC RB01327 */ 12100099
 /* MODULE NAME      :  R104_PROC_HW_O                               */ 12110099
 /*                                                                  */ 12120099
 /* DESCRIPTION      : PROCESS HARDWARE ON ORDER                     */ 12130099
 /*                                                                  */ 12140099
 /********************************************************************/ 12150099
 R104_PROC_HW_O: PROC;                                                  12160099
                                                                        12170099
 SWITCH_BAU     = TRUE;                                                 12180099
 SWITCH_HW_ORDR = TRUE;                                                 12190099
                                                                        12200099
 CALL R212_FILL_RCBDQD1_O;                                              12210099
 CALL R214_FETCH_CURSOR_HW_O;                                           12220099
                                                                        12230099
 END R104_PROC_HW_O;                                                    12240099
                                                      /* EOC RB01237 */ 12250099
1/********************************************************************/ 12260099
 /*                                                      SOC RB01327 */ 12270099
 /* MODULE NAME      :  R106_PROC_HW_PI                              */ 12280099
 /*                                                                  */ 12290099
 /* DESCRIPTION      : PROCESS HARDWARE PRIME INPUT                  */ 12300099
 /*                                                                  */ 12310099
 /********************************************************************/ 12320099
 R106_PROC_HW_PI: PROC;                                                 12330099
                                                                        12340099
 SWITCH_PI = TRUE;                                                      12350099
                                                                        12360099
 CALL R254_RETR_ADD_PI_DATA;                                            12370099
 CALL R222_FILL_RCBDQD1_PI;                                             12380099
 CALL R224_FETCH_CURSOR_HW_PI;                                          12390099
                                                                        12400099
 END R106_PROC_HW_PI;                                                   12410099
                                                      /* EOC RB01237 */ 12420099
1/*********************************************************************/12430099
 /*                                                                   */12440099
 /* MODULE NAME      :  R202_FILL_RCBDQD1_I                           */12450099
 /*                                                                   */12460099
 /* DESCRIPTION      :                                                */12470099
 /*                                                                   */12480099
 /*********************************************************************/12490099
 R202_FILL_RCBDQD1_I: PROC;                                             12500099
                                                                        12510099
 FILE_RCBDQD1   = '';                                                   12520099
 PARM_USER_INFO = '';                                                   12530099
                                                                        12540099
 FILE_RCBDQD1.PRODUCT_TYPE    = CURSOR_HW_I_V300.PRODUCT_TYPE;          12550099
 FILE_RCBDQD1.ORIGIN          = CURSOR_HW_I_V300.ORIGIN;                12560099
 FILE_RCBDQD1.SEQUENCE_NUMBER =                                         12570099
                         SUBSTR(CURSOR_HW_I_V300.SEQUENCE_NUMBER,3,5);  12580099
 FILE_RCBDQD1.CTRYNO          = WRK_CTRYNO;                             12590099
 FILE_RCBDQD1.REC_TYPE        = 'M';                                    12600099
 FILE_RCBDQD1.MABO            = CURSOR_HW_I_V040.MABO;                  12610099
 FILE_RCBDQD1.MA_TYPE         = CURSOR_HW_I_V300.PRODUCT_TYPE;          12620099
 FILE_RCBDQD1.MA_ORIGIN       = CURSOR_HW_I_V300.ORIGIN;                12630099
 FILE_RCBDQD1.MA_SER_NO       =                                         12640099
                         SUBSTR(CURSOR_HW_I_V300.SEQUENCE_NUMBER,3,5);  12650099
 FILE_RCBDQD1.DIS             = '3';                                    12660099
 FILE_RCBDQD1.CUST_NO         =                                         12670099
                         SUBSTR(CURSOR_HW_I_V190.CUSTOMER_NUMBER,3,6);  12680099
                                                                        12690099
 IF ((SK_HW_I_1 = SK_HW_O_1) &            /* HW COINCIDES WITH ORDER */ 12700099
     (CURSOR_HW_O_V260.CUSTOMER_USER =    /* AND SAME CUSTOMER       */ 12710099
      CURSOR_HW_I_V190.CUSTOMER_NUMBER))                                12720099
 THEN                                                                   12730099
   FILE_RCBDQD1.ORDER_NO      = CURSOR_HW_O_V260.ORDER_REF_NUMBER;      12740099
 FILE_RCBDQD1.CSLMEMC         = TB_RCBV400.MACHINE_CATEGORY;            12750099
 FILE_RCBDQD1.SYSTEM_NO       = TB_RCBV380.DP_SYSTEM_NUMBER;            12760099
 FILE_RCBDQD1.MA_MODEL        = CURSOR_HW_I_V300.MODEL_NUMBER;          12770099
 FILE_RCBDQD1.PTS_HOST        = 1;                        /* RA01077 */ 12780099
 FILE_RCBDQD1.DPIS            = CURSOR_HW_I_V110.STATUS;                12790099
 FILE_RCBDQD1.INST_DATE       =                                         12800099
                R504_TRANS_DATE(CURSOR_HW_I_V190.MARKETING_INSTDAT);    12810099
 SELECT;                                                                12820099
   WHEN (CURSOR_HW_I_V220.TYPE_OF_MAINT ¬= '') DO;                      12830099
     FILE_RCBDQD1.TYPE_MNT    = CURSOR_HW_I_V220.TYPE_OF_MAINT;         12840099
     IF CURSOR_HW_I_V220.TYPE_OF_MAINT = WRK_TPMNT_VAL.TPMNT_ST2_DEF    12850099
      | SWITCH_ACTIVE_CONTRACT = TRUE                      /* RB01290 */12860099
     THEN DO;                                                           12870099
       IF TB_RCBV240.SOURCE_INDICATOR ¬='E'                             12880099
       THEN DO;                         /* IN CASE OF CHIS CONTRACT  */ 12890099
         FILE_RCBDQD1.TYPE_MNT = CURSOR_HW_I_V220.TYPE_OF_MAINT;        12900099
         FILE_RCBDQD1.SERVTYPE = TB_RCBV240.SERVICE_TYPE;               12910099
       END;                                                             12920099
       ELSE                             /* IN CASE OF EMACS CONTRACT */ 12930099
         CALL R506_TRANS_ATO(TB_RCBV240.AGREEMENT_TYPE,                 12940099
                             TB_RCBV240.AGREEMENT_OPTION,               12950099
                             FILE_RCBDQD1.TYPE_MNT,                     12960099
                             FILE_RCBDQD1.SERVTYPE);                    12970099
     END;                                                               12980099
   END;                                                                 12990099
   WHEN (CURSOR_HW_I_V220.TYPE_OF_WARRANTY ¬= '')         /* RC01116 */ 13000099
     DO;                                                                13010099
                                                     /* SOC : RB01281 */13020099
  /* FILL TYPE_MNT FROM F_TYPE_OF_WARRANTY WHEN THE MACHINE IS */       13030099
  /* UNDER FLEXIBLE WARANTY                                    */       13040099
                                                      /* SOC RB01298 */ 13050099
  /*   IF (SWITCH_FLEXIBLE_WARRANTY_BAU &                            */ 13060099
  /*       WRK_RUN_DATE > CURSOR_HW_I_V220.F_SPLT_DATE &             */ 13070099
  /*       WRK_RUN_DATE <= CURSOR_HW_I_V220.WARRANTY_EXP_DATE)       */ 13080099
       IF (SWITCH_FLEXIBLE_WARRANTY_BAU | SWITCH_HARDBUNDLE_BAU)        13090099
                                                      /* EOC RB01298 */ 13100099
       THEN                                                             13110099
            FILE_RCBDQD1.TYPE_MNT = CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY;13120099
       ELSE                                                             13130099
            FILE_RCBDQD1.TYPE_MNT = CURSOR_HW_I_V220.TYPE_OF_WARRANTY;  13140099
     END;                                            /* EOC : RB01281 */13150099
   OTHERWISE;                                                           13160099
 END;                                                                   13170099
                                                                        13180099
                                                      /* SOC RB01290 */ 13190099
 IF SWITCH_INTERNAL_CTR THEN                                            13200099
   DO;                                                /* SOC RB01320 */ 13210099
    FILE_RCBDQD1.TYPE_MNT  = PARM_RCBP70S.TOM_INTERNAL_CONTRACT;        13220099
                                                      /* EOC RB01320 */ 13230099
    FILE_RCBDQD1.MA_STATUS = PARM_RCBP70S.MACHINE_STATUS;               13240099
   END;                                                                 13250099
 ELSE                                                 /* EOC RB01290 */ 13260099
    FILE_RCBDQD1.MA_STATUS =                                            13270099
               R502_TRANS_TPMNT(FILE_RCBDQD1.TYPE_MNT);                 13280099
                                                                        13290099
 FILE_RCBDQD1.SERV_DIV     =                                            13300099
                  R508_SERV_DIV(CURSOR_HW_I_V190.CUSTOMER_NUMBER);      13310099
                                                                        13320099
 IF SWITCH_USER_EXIT                                                    13330099
 THEN DO;                                                               13340099
   PARM_USER_INFO.OU_CODE = CURSOR_HW_I_V040.OU_CODE;                   13350099
   USER_FILE_RCBDQD1      = FILE_RCBDQD1, BY NAME;                      13360099
                                                                        13370099
   CALL RCBDQ1U (ADDR (SWITCH_USER_EXIT),                               13380099
                 ADDR (PARM_USER_INFO),                                 13390099
                 ADDR (USER_FILE_RCBDQD1),                              13400099
                 PTR_INT_AREA);                                         13410099
                                                                        13420099
   IF SWITCH_USER_EXIT                        /* IS USER EXIT USED ? */ 13430099
   THEN                                                                 13440099
     FILE_RCBDQD1.MABO = USER_FILE_RCBDQD1.MABO;                        13450099
 END;                                                                   13460099
                                                                        13470099
 END R202_FILL_RCBDQD1_I;                                               13480099
1/*********************************************************************/13490099
 /*                                                                   */13500099
 /* MODULE NAME      :  R204_FETCH_CURSOR_HW_I                        */13510099
 /*                                                                   */13520099
 /* DESCRIPTION      :                                                */13530099
 /*                                                                   */13540099
 /*********************************************************************/13550099
 R204_FETCH_CURSOR_HW_I: PROC;                                          13560099
                                                                        13570099
 CURSOR_HW_I_V040 = '';                                                 13580099
 CURSOR_HW_I_V110 = '';                                                 13590099
 CURSOR_HW_I_V190 = '';                                                 13600099
 CURSOR_HW_I_V220 = '';                                                 13610099
 CURSOR_HW_I_V300 = '';                                                 13620099
 SWITCH_INTERNAL_CTR    = FALSE;                           /* RB01290 */13630099
 SWITCH_ACTIVE_CONTRACT = FALSE;                           /* RB01290 */13640099
 SWITCH_HARDBUNDLE_BAU = FALSE;                            /* RB01298 */13650099
 SW_BRAND_BAU                  = FALSE;                /* SOC RB01320 */13660099
 SWITCH_FLEXIBLE_WARRANTY_BAU  = FALSE;                                 13670099
 SWITCH_INTERNAL               = FALSE;                                 13680099
 SWITCH_LEASE_RENTAL           = FALSE;                                 13690099
 WRK_TYPE_OF_CONTRACT          = '';                                    13700099
 WRK_REAL_SERIAL_NUM_BAU       = '';                                    13710099
 WRK_REAL_BAU_INDNULL          = '';                   /* EOC RB01320 */13720099
                                                                        13730099
 EXEC SQL                                                               13740099
   FETCH CURSOR_HW_I                                                    13750099
     INTO :CURSOR_HW_I_V300.PRODUCT_TYPE          :WRK_INDNULL          13760099
         ,:CURSOR_HW_I_V300.ORIGIN                :WRK_INDNULL          13770099
         ,:CURSOR_HW_I_V300.SEQUENCE_NUMBER       :WRK_INDNULL          13780099
         ,:CURSOR_HW_I_V300.MODEL_NUMBER          :WRK_INDNULL          13790099
         ,:CURSOR_HW_I_V190.CUSTOMER_NUMBER       :WRK_INDNULL          13800099
         ,:CURSOR_HW_I_V190.MARKETING_INSTDAT     :WRK_INDNULL          13810099
         ,:CURSOR_HW_I_V110.STATUS                :WRK_INDNULL          13820099
         ,:CURSOR_HW_I_V040.OU_CODE               :WRK_INDNULL          13830099
         ,:CURSOR_HW_I_V040.MABO                  :WRK_INDNULL          13840099
         ,:CURSOR_HW_I_V220.TYPE_OF_MAINT         :WRK_INDNULL          13850099
         ,:CURSOR_HW_I_V220.TYPE_OF_WARRANTY      :WRK_INDNULL          13860099
                                                      /* SOC RB01281 */ 13870099
         ,:CURSOR_HW_I_V220.WARRANTY_EXP_DATE     :WRK_INDNULL          13880099
         ,:CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY    :WRK_INDNULL          13890099
         ,:CURSOR_HW_I_V220.F_SPLT_DATE           :WRK_INDNULL          13900099
                                                      /* EOC RB01281 */ 13910099
                                                      /* SOC RB01290 */ 13920099
         ,:CURSOR_HW_I_V220.SOURCE_INDICATOR      :WRK_INDNULL          13930099
                                                      /* EOC RB01290 */ 13940099
                                                      /* SOC RB01320 */ 13950099
         ,:CURSOR_HW_I_V220.EFFECTIVE_DATE        :WRK_INDNULL          13960099
         ,:CURSOR_HW_I_V220.END_DATE              :WRK_INDNULL          13970099
         ,:WRK_REAL_SERIAL_NUM_BAU                :WRK_REAL_BAU_INDNULL 13980099
       ;                                              /* EOC RB01320 */ 13990099
                                                                        14000099
 SELECT (SQLCODE);                                                      14010099
   WHEN (0) DO;                                                         14020099
     SWITCH_EOC_CURSOR_HW_I  = FALSE;                                   14030099
                                                      /* SOC RB01281 */ 14040099
     IF (CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY ¬= '' &                    14050099
             CURSOR_HW_I_V220.F_SPLT_DATE ¬= '')                        14060099
     THEN DO;                                                           14070099
                                                      /* SOC RB01298 */ 14080099
          /*      SWITCH_FLEXIBLE_WARRANTY_BAU = TRUE;   */             14090099
                                                      /* SOC RB01320 */ 14100099
       /* IF WRK_RUN_DATE >= CURSOR_HW_I_V220.F_SPLT_DATE               14110099
       /* THEN DO;                                                      14120099
       /*      IF WRK_RUN_DATE <= CURSOR_HW_I_V220.WARRANTY_EXP_DATE    14130099
       /*         THEN SWITCH_FLEXIBLE_WARRANTY_BAU = TRUE;             14140099
       /*      ELSE SWITCH_HARDBUNDLE_BAU = TRUE;                       14150099
       /*      END;                                                     14160099
       /*ELSE                                         /* EOC RB01298 */ 14170099
       /*    DO;                                          /* RB01298 */ 14180099
       /*    SWITCH_FLEXIBLE_WARRANTY_BAU = FALSE;                      14190099
       /*    SWITCH_HARDBUNDLE_BAU = FALSE;               /* RB01298 */ 14200099
       /*    END;                                         /* RB01298 */ 14210099
       IF (WRK_RUN_DATE >= CURSOR_HW_I_V220.EFFECTIVE_DATE &            14220099
           WRK_RUN_DATE < CURSOR_HW_I_V220.F_SPLT_DATE)                 14230099
       THEN                                                             14240099
         DO;                                                            14250099
           SW_BRAND_BAU = TRUE;                                         14260099
         END;                                         /* EOC RB01320 */ 14270099
     ELSE                                                               14280099
                                                      /* SOC RB01320 */ 14290099
     /*   DO;                                             /* RB01298 */ 14300099
     /*          SWITCH_FLEXIBLE_WARRANTY_BAU = FALSE;                  14310099
                SWITCH_HARDBUNDLE_BAU = FALSE;            /* RB01298 */ 14320099
     /*   END;                                            /* RB01298 */ 14330099
                                                      /* EOC RB01281 */ 14340099
         DO;                                                            14350099
           IF (WRK_RUN_DATE >= CURSOR_HW_I_V220.F_SPLT_DATE &           14360099
               WRK_RUN_DATE <= CURSOR_HW_I_V220.WARRANTY_EXP_DATE &     14370099
               VERIFY(CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY,              14380099
                      WRK_FWTOW) = '0')                                 14390099
           THEN                                                         14400099
             DO;                                                        14410099
               SWITCH_FLEXIBLE_WARRANTY_BAU = TRUE;                     14420099
             END;                                                       14430099
           ELSE                                                         14440099
             DO;                                                        14450099
               IF (VERIFY(CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY,          14460099
                          WRK_HBTOM) = '0')                             14470099
               THEN                                                     14480099
                 DO;                                                    14490099
                   SWITCH_HARDBUNDLE_BAU = TRUE;                        14500099
                 END;                                                   14510099
              END;                                                      14520099
         END;                                         /* EOC RB01320 */ 14530099
      END;                                                              14540099
     SK_HW_I.EOF             = '0';                                     14550099
     SK_HW_I.PRODUCT_TYPE    = CURSOR_HW_I_V300.PRODUCT_TYPE;           14560099
     SK_HW_I.ORIGIN          = CURSOR_HW_I_V300.ORIGIN;                 14570099
     SK_HW_I.SEQUENCE_NUMBER = CURSOR_HW_I_V300.SEQUENCE_NUMBER;        14580099
     SK_HW_I.MODEL_NUMBER    = CURSOR_HW_I_V300.MODEL_NUMBER;           14590099
                                                      /* SOC RB01290 */ 14600099
   IF (((CURSOR_HW_I_V220.TYPE_OF_MAINT = 'A') |                        14610099
        (CURSOR_HW_I_V220.TYPE_OF_MAINT = 'B') |                        14620099
        (CURSOR_HW_I_V220.TYPE_OF_MAINT = 'E') |          /* RB01320 */ 14630099
        (CURSOR_HW_I_V220.TYPE_OF_MAINT = '2')) &                       14640099
        (CURSOR_HW_I_V220.SOURCE_INDICATOR = 'C')) THEN                 14650099
   DO;                                                                  14660099
     SWITCH_ACTIVE_CONTRACT = TRUE ;                                    14670099
     SK_CURRENT_HW = SK_HW_I;                                           14680099
     PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_CURRENT_HW);                14690099
     CALL R512_GET_CONTRACT_NUMBER;                                     14700099
     IF (WRK_CONTRACT_NUMBER_INDNULL ¬= -1)                             14710099
         & (WRK_CONTRACT_NUMBER ¬= '') THEN                             14720099
     DO;                                                                14730099
       CALL R514_GET_TYPE_OF_CONTRACT;                                  14740099
       IF (WRK_TYPE_OF_CONTRACT_INDNULL ¬= -1)                          14750099
         & (WRK_TYPE_OF_CONTRACT ¬= '') THEN                            14760099
       DO;                                                              14770099
         CALL R516_GET_RCB070;                                          14780099
 /*      IF (SWITCH_INTERNAL_CTR) THEN                /* SOC RB01320 */ 14790099
 /*        CURSOR_HW_I_V220.TYPE_OF_MAINT =                          */ 14800099
 /*                     PARM_RCBP70S.TOM_INTERNAL_CONTRACT;          */ 14810099
                                                      /* EOC RB01320 */ 14820099
       END;                                                             14830099
     END;                                                               14840099
   END;                                                                 14850099
                                                                        14860099
   IF ((VERIFY(CURSOR_HW_I_V220.TYPE_OF_MAINT,        /* SOC RB01320 */ 14870099
        WRK_TPMNT_VAL.TPMNT_INTERNAL ) = '0'     ) &                    14880099
        (CURSOR_HW_I_V220.SOURCE_INDICATOR = '')  ) THEN                14890099
     DO;                                                                14900099
       SWITCH_INTERNAL = TRUE;                                          14910099
     END;                                                               14920099
                                                                        14930099
   IF ((VERIFY(CURSOR_HW_I_V220.TYPE_OF_MAINT,                          14940099
        WRK_TPMNT_VAL.TPMNT_ST1 ) = '0'          ) &                    14950099
       (CURSOR_HW_I_V220.SOURCE_INDICATOR = '')  ) THEN                 14960099
     DO;                                                                14970099
       SWITCH_LEASE_RENTAL = TRUE;                                      14980099
     END;                                             /* EOC RB01320 */ 14990099
   END;                                                                 15000099
                                                                        15010099
   WHEN (100) DO;                                                       15020099
     SWITCH_EOC_CURSOR_HW_I = TRUE;                                     15030099
     SWITCH_FLEXIBLE_WARRANTY_BAU = FALSE;                /* RB01281 */ 15040099
     SK_HW_I.EOF            = '1';                                      15050099
   END;                                                                 15060099
   OTHERWISE                                                            15070099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#001');                    15080099
 END;                                                                   15090099
                                                                        15100099
 END R204_FETCH_CURSOR_HW_I;                                            15110099
                                                                        15120099
1/*********************************************************************/15130099
 /*                                                                   */15140099
 /* MODULE NAME      :  R212_FILL_RCBDQD1_O                           */15150099
 /*                                                                   */15160099
 /* DESCRIPTION      :                                                */15170099
 /*                                                                   */15180099
 /*********************************************************************/15190099
 R212_FILL_RCBDQD1_O: PROC;                                             15200099
                                                                        15210099
 FILE_RCBDQD1   = '';                                                   15220099
 PARM_USER_INFO = '';                                                   15230099
                                                                        15240099
 FILE_RCBDQD1.PRODUCT_TYPE    = CURSOR_HW_O_V260.PRODUCT_TYPE;          15250099
 FILE_RCBDQD1.ORIGIN          = CURSOR_HW_O_V260.ORIGIN;                15260099
 FILE_RCBDQD1.SEQUENCE_NUMBER =                                         15270099
                         SUBSTR(CURSOR_HW_O_V260.SEQUENCE_NUMBER,3,5);  15280099
                                                                        15290099
 FILE_RCBDQD1.CTRYNO          = WRK_CTRYNO;                             15300099
 FILE_RCBDQD1.REC_TYPE        = 'M';                                    15310099
 FILE_RCBDQD1.MABO            = CURSOR_HW_O_V040.MABO;                  15320099
 FILE_RCBDQD1.MA_TYPE         = CURSOR_HW_O_V260.PRODUCT_TYPE;          15330099
 FILE_RCBDQD1.MA_ORIGIN       = CURSOR_HW_O_V260.ORIGIN;                15340099
 FILE_RCBDQD1.MA_SER_NO       =                                         15350099
                         SUBSTR(CURSOR_HW_O_V260.SEQUENCE_NUMBER,3,5);  15360099
 FILE_RCBDQD1.DIS             = '2';                                    15370099
 FILE_RCBDQD1.CUST_NO         =                                         15380099
                         SUBSTR(CURSOR_HW_O_V260.CUSTOMER_USER,3,6);    15390099
 FILE_RCBDQD1.ORDER_NO        = CURSOR_HW_O_V260.ORDER_REF_NUMBER;      15400099
 WRK_ORDER_NO                 = CURSOR_HW_O_V260.ORDER_REF_NUMBER;      15410099
 FILE_RCBDQD1.CSLMEMC         = TB_RCBV400.MACHINE_CATEGORY;            15420099
 FILE_RCBDQD1.SYSTEM_NO       = CURSOR_HW_O_V260.DP_SYSTEM_NUMBER;      15430099
 FILE_RCBDQD1.MA_MODEL        = CURSOR_HW_O_V260.MODEL_NUMBER;          15440099
 FILE_RCBDQD1.PTS_HOST        = 1;                        /* RA01077 */ 15450099
 FILE_RCBDQD1.DPIS            = '0';                                    15460099
 FILE_RCBDQD1.INST_DATE       =                                         15470099
                R504_TRANS_DATE(CURSOR_HW_O_V260.SCHED_COMPL_DATE);     15480099
                                                                        15490099
 SELECT;                                                                15500099
                                                       /* SOC RB01320 */15510099
             /* ALIGNED THE CODE AS TYPE OF WARRANTY HAS TO OVERRULE  */15520099
             /* TYPE OF MAINTENANCE, IN CASE BOTH ARE FILLED          */15530099
   WHEN (CURSOR_HW_O_V260.TYPE_OF_WARRANTY ¬= '')                       15540099
     FILE_RCBDQD1.TYPE_MNT    = CURSOR_HW_O_V260.TYPE_OF_WARRANTY;      15550099
                                                       /* EOC RB01320 */15560099
   WHEN (CURSOR_HW_O_V260.TYPE_OF_MAINT ¬= '')                          15570099
     FILE_RCBDQD1.TYPE_MNT    = CURSOR_HW_O_V260.TYPE_OF_MAINT;         15580099
                                                       /* SOC RB01320 */15590099
 /*WHEN (CURSOR_HW_O_V260.TYPE_OF_WARRANTY ¬= '')          /* RC01116 */15600099
 /*  FILE_RCBDQD1.TYPE_MNT    = CURSOR_HW_O_V260.TYPE_OF_WARRANTY;    */15610099
                                                       /* EOC RB01320 */15620099
   OTHERWISE;                                                           15630099
 END;                                                                   15640099
                                                                        15650099
 FILE_RCBDQD1.MA_STATUS       = R502_TRANS_TPMNT(FILE_RCBDQD1.TYPE_MNT);15660099
 FILE_RCBDQD1.SERV_DIV        =                                         15670099
                  R508_SERV_DIV(CURSOR_HW_O_V260.CUSTOMER_USER);        15680099
                                                                        15690099
 IF SWITCH_USER_EXIT                                                    15700099
 THEN DO;                                                               15710099
   PARM_USER_INFO.OU_CODE = CURSOR_HW_O_V260.OU_CODE;                   15720099
   USER_FILE_RCBDQD1      = FILE_RCBDQD1, BY NAME;                      15730099
                                                                        15740099
   CALL RCBDQ1U (ADDR (SWITCH_USER_EXIT),                               15750099
                 ADDR (PARM_USER_INFO),                                 15760099
                 ADDR (USER_FILE_RCBDQD1),                              15770099
                 PTR_INT_AREA);                                         15780099
                                                                        15790099
   IF SWITCH_USER_EXIT                        /* IS USER EXIT USED ? */ 15800099
   THEN                                                                 15810099
     FILE_RCBDQD1.MABO        = USER_FILE_RCBDQD1.MABO;                 15820099
 END;                                                                   15830099
                                                                        15840099
 END R212_FILL_RCBDQD1_O;                                               15850099
                                                                        15860099
1/*********************************************************************/15870099
 /*                                                                   */15880099
 /* MODULE NAME      :  R214_FETCH_CURSOR_HW_O                        */15890099
 /*                                                                   */15900099
 /* DESCRIPTION      :                                                */15910099
 /*                                                                   */15920099
 /*********************************************************************/15930099
 R214_FETCH_CURSOR_HW_O: PROC;                                          15940099
                                                                        15950099
 CURSOR_HW_O_V260 = '';                                                 15960099
 CURSOR_HW_O_V040 = '';                                                 15970099
                                                                        15980099
 EXEC SQL                                                               15990099
   FETCH CURSOR_HW_O                                                    16000099
     INTO :CURSOR_HW_O_V260.PRODUCT_TYPE          :WRK_INDNULL          16010099
         ,:CURSOR_HW_O_V260.ORIGIN                :WRK_INDNULL          16020099
         ,:CURSOR_HW_O_V260.SEQUENCE_NUMBER       :WRK_INDNULL          16030099
         ,:CURSOR_HW_O_V260.MODEL_NUMBER          :WRK_INDNULL          16040099
         ,:CURSOR_HW_O_V260.CUSTOMER_USER         :WRK_INDNULL          16050099
         ,:CURSOR_HW_O_V260.ORDER_REF_NUMBER      :WRK_INDNULL          16060099
         ,:CURSOR_HW_O_V260.DP_SYSTEM_NUMBER      :WRK_INDNULL          16070099
         ,:CURSOR_HW_O_V260.OU_CODE               :WRK_INDNULL          16080099
         ,:CURSOR_HW_O_V260.SCHED_COMPL_DATE      :WRK_INDNULL          16090099
         ,:CURSOR_HW_O_V260.TYPE_OF_MAINT         :WRK_INDNULL          16100099
         ,:CURSOR_HW_O_V260.TYPE_OF_WARRANTY      :WRK_INDNULL          16110099
         ,:CURSOR_HW_O_V260.ORDER_DATE            :WRK_INDNULL          16120099
         ,:CURSOR_HW_O_V260.END_DATE              :WRK_INDNULL          16130099
         ,:CURSOR_HW_O_V040.MABO                  :WRK_INDNULL          16140099
       ;                                                                16150099
                                                                        16160099
 SELECT (SQLCODE);                                                      16170099
   WHEN (0) DO;                                                         16180099
     SWITCH_EOC_CURSOR_HW_O  = FALSE;                                   16190099
     SK_HW_O.EOF             = '0';                                     16200099
     SK_HW_O.PRODUCT_TYPE    = CURSOR_HW_O_V260.PRODUCT_TYPE;           16210099
     SK_HW_O.ORIGIN          = CURSOR_HW_O_V260.ORIGIN;                 16220099
     SK_HW_O.SEQUENCE_NUMBER = CURSOR_HW_O_V260.SEQUENCE_NUMBER;        16230099
     SK_HW_O.MODEL_NUMBER    = CURSOR_HW_O_V260.MODEL_NUMBER;           16240099
   END;                                                                 16250099
   WHEN (100) DO;                                                       16260099
     SWITCH_EOC_CURSOR_HW_O = TRUE;                                     16270099
     SK_HW_O.EOF            = '1';                                      16280099
   END;                                                                 16290099
   OTHERWISE                                                            16300099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#002');                    16310099
 END;                                                                   16320099
 END R214_FETCH_CURSOR_HW_O;                                            16330099
1/********************************************************************/ 16340099
 /*                                                      SOC RB01237 */ 16350099
 /* MODULE NAME      :  R222_FILL_RCBDQD1_PI                         */ 16360099
 /*                                                                  */ 16370099
 /* DESCRIPTION      : FILL THE HW PRIME INPUT RECORD                */ 16380099
 /*                                                                  */ 16390099
 /********************************************************************/ 16400099
 R222_FILL_RCBDQD1_PI: PROC;                                            16410099
                                                                        16420099
 USER_FILE_PI   = '';                                                   16430099
 PARM_USER_INFO = '';                                                   16440099
 WRK_PI_ORIGIN_TEMP = '';                                 /* RB01289 */ 16450099
 WRK_PI_BAU_OU_CODE   = '';                           /* SOC RC01311 */ 16460099
 WRK_PI_BAU_T040_MABO = '';                           /* EOC RC01311 */ 16470099
                                                                        16480099
   SELECT(WRK_PI_ORIGIN);                             /* SOC RB01320 */ 16490099
   WHEN('BOTH')                                                         16500099
     DO;                                                                16510099
                                   /* -- PI WARRANTY, PI CONTRACT -- */ 16520099
       IF (SW_WARR_PI & SW_MAINT_PI)                                    16530099
       THEN                                                             16540099
         DO;                                                            16550099
           IF SWITCH_FW_PI | SWITCH_HB_PI | SW_WARR_PI                  16560099
           THEN                                                         16570099
           DO;                                                          16580099
             IF SWITCH_FW_PI | SWITCH_HB_PI THEN                        16590099
               DO;                                                      16600099
                 USER_FILE_PI.TYPE_MNT =                                16610099
                               CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY;    16620099
               END;                                                     16630099
             ELSE                                                       16640099
             DO;                                                        16650099
               USER_FILE_PI.TYPE_MNT =                                  16660099
                                CURSOR_HW_PI_V051.TYPE_OF_WARRANTY;     16670099
             END;                                                       16680099
           END;                                                         16690099
           ELSE                                                         16700099
           DO;                                                          16710099
             USER_FILE_PI.TYPE_MNT =                                    16720099
                            CURSOR_HW_PI_V051.TYPE_OF_WARRANTY;         16730099
           END;                                                         16740099
                                                                        16750099
           USER_FILE_PI.MA_STATUS          =                            16760099
                       R502_TRANS_TPMNT(USER_FILE_PI.TYPE_MNT);         16770099
         END;                                                           16780099
       ELSE                                                             16790099
         DO;                                                            16800099
           IF CURSOR_HW_PI_V051.TYPE_OF_MAINT = 'G' THEN                16810099
           DO;                                                          16820099
             USER_FILE_PI.TYPE_MNT = 'G';                               16830099
           END;                                                         16840099
           ELSE                                                         16850099
           DO;                                                          16860099
             USER_FILE_PI.TYPE_MNT = '2';                               16870099
           END;                                                         16880099
                                                                        16890099
           USER_FILE_PI.MA_STATUS        =                              16900099
                        R502_TRANS_TPMNT(USER_FILE_PI.TYPE_MNT);        16910099
         END;                                                           16920099
     END;                                                               16930099
     WHEN('T241')                                                       16940099
     DO;                                                                16950099
       IF SWITCH_VENDOR_SERVICE THEN                                    16960099
         DO;                                                            16970099
           IF SUBSTR(CURSOR_HW_PI_V241.AUTHORISATION_CODE,1,3) = 'LEN'  16980099
            THEN                                                        16990099
              DO;                                                       17000099
                USER_FILE_PI.TYPE_MNT  = 'G';                           17010099
              END;                                                      17020099
           ELSE                                                         17030099
           DO;                                                          17040099
             USER_FILE_PI.TYPE_MNT = '2';                               17050099
           END;                                                         17060099
         END;                                                           17070099
       ELSE                                                             17080099
       DO;                                                              17090099
         USER_FILE_PI.TYPE_MNT = '2';                                   17100099
       END;                                                             17110099
                                                                        17120099
       USER_FILE_PI.MA_STATUS        =                                  17130099
                          R502_TRANS_TPMNT(USER_FILE_PI.TYPE_MNT);      17140099
                                                                        17150099
     END;                                                               17160099
     WHEN('T051')                                                       17170099
     DO;                                                                17180099
       IF WRK_IND_TOW ¬= -1 &                                           17190099
       WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE              17200099
       THEN                                                             17210099
       DO;                                                              17220099
         IF SWITCH_FW_PI | SWITCH_HB_PI THEN                            17230099
         DO;                                                            17240099
           USER_FILE_PI.TYPE_MNT =                                      17250099
                     CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY;              17260099
         END;                                                           17270099
         ELSE                                                           17280099
         DO;                                                            17290099
           USER_FILE_PI.TYPE_MNT =                                      17300099
                     CURSOR_HW_PI_V051.TYPE_OF_WARRANTY;                17310099
         END;                                                           17320099
       END;                                                             17330099
       ELSE                                                             17340099
       DO;                                                              17350099
         USER_FILE_PI.TYPE_MNT = '3';                                   17360099
       END;                                                             17370099
                                                                        17380099
      USER_FILE_PI.MA_STATUS        =                                   17390099
                       R502_TRANS_TPMNT(USER_FILE_PI.TYPE_MNT);         17400099
     END;                                                               17410099
     OTHERWISE;                                                         17420099
   END;                                               /* EOC RB01320 */ 17430099
                                                                        17440099
 IF WRK_PI_ORIGIN = 'T051' THEN                 /* NO T241 AVAILABLE */ 17450099
   WRK_SAV_CONTR_NR = '';                                               17460099
 ELSE                                                                   17470099
   WRK_SAV_CONTR_NR = CURSOR_HW_PI_V241.CONTRACT_NUMBER;                17480099
                                                                        17490099
 USER_FILE_PI.CTRYNO          = WRK_CTRYNO;                             17500099
 USER_FILE_PI.REC_TYPE        = 'M';                                    17510099
                                                                        17520099
 IF WRK_PI_ORIGIN = 'T241'                                              17530099
 THEN DO;                                       /* NO T051 AVAILABLE */ 17540099
   USER_FILE_PI.MA_TYPE       = CURSOR_HW_PI_V051.PRODUCT_TYPE;         17550099
   USER_FILE_PI.MA_ORIGIN     = CURSOR_HW_PI_V051.ORIGIN;               17560099
   USER_FILE_PI.MA_SER_NO     =                                         17570099
                         SUBSTR(CURSOR_HW_PI_V051.SEQUENCE_NUMBER,3,5); 17580099
   IF (WRK_IND_CUST ¬= -1) THEN                       /* SOC RB01289 */ 17590099
     USER_FILE_PI.CUST_NO     =                                         17600099
                         SUBSTR(CURSOR_HW_PI_V051.CUSTOMER_NUMBER,3,6); 17610099
   ELSE                                                                 17620099
     USER_FILE_PI.CUST_NO     = '';                                     17630099
                                                      /* EOC RB01289 */ 17640099
 END;                                                                   17650099
 ELSE DO;                                        /* T051 ENTRY FOUND */ 17660099
   USER_FILE_PI.MA_TYPE       = CURSOR_HW_PI_V051.PRODUCT_TYPE;         17670099
   USER_FILE_PI.MA_ORIGIN     = CURSOR_HW_PI_V051.ORIGIN;               17680099
   USER_FILE_PI.MA_SER_NO     =                                         17690099
                         SUBSTR(CURSOR_HW_PI_V051.SEQUENCE_NUMBER,3,5); 17700099
   USER_FILE_PI.CUST_NO       =                                         17710099
                         SUBSTR(CURSOR_HW_PI_V051.CUSTOMER_NUMBER,3,6); 17720099
   USER_FILE_PI.MA_MODEL      = CURSOR_HW_PI_V051.MODEL_NUMBER;         17730099
   USER_FILE_PI.INST_DATE     =                                         17740099
                R504_TRANS_DATE(CURSOR_HW_PI_V051.INSTALL_DATE);        17750099
 END;                                                                   17760099
                                                                        17770099
                                                       /* SOC RB01289 */17780099
 IF ((WRK_PI_ORIGIN = 'BOTH') | (WRK_PI_ORIGIN = 'T051'))               17790099
 THEN DO;                                                               17800099
   SELECT(CURSOR_HW_PI_V051.SOURCE_INDICATOR);                          17810099
     WHEN('O')                                                          17820099
     DO;                                                                17830099
     /*IF (WRK_CUSTNO_V10_IND ¬= -1) THEN */           /* SOC RC01311*/ 17840099
       IF (WRK_CUSTNO_V10_IND ¬= -1) THEN DO;          /* EOC RC01311*/ 17850099
         USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V10,3,6);    17860099
         IF (WRK_OU_CODE_V170_IND ¬= -1) THEN          /* SOC RC01311*/ 17870099
           WRK_PI_BAU_OU_CODE = WRK_OU_CODE_V170;                       17880099
       /*COMMENTED AS PART OF PCR PCEDSP-0064             SOC RC01313*/ 17890099
       /*ELSE DO;                                                    */ 17900099
       /*  CALL R350_RETR_CU_ENGG_OU(WRK_CUSTOMER_NUMBER_V10);       */ 17910099
       /*  IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN DO;            */ 17920099
       /*   WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;       */ 17930099
       /*  END;                                                      */ 17940099
       /*END;                                                        */ 17950099
       /*                                                 EOC RC01313*/ 17960099
       END;                                            /* EOC RC01311*/ 17970099
       ELSE DO;                                                         17980099
      /* IF (WRK_CUSTNO_V190_IND ¬= -1) THEN */        /* SOC RC01311*/ 17990099
         IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;       /* EOC RC01311*/ 18000099
           USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V190,3,6); 18010099
           IF (WRK_OU_CODE_V170_IND ¬= -1) THEN        /* SOC RC01311*/ 18020099
             WRK_PI_BAU_OU_CODE = WRK_OU_CODE_V170;                     18030099
       /*COMMENTED AS PART OF PCR PCEDSP-0064             SOC RC01313*/ 18040099
       /*  ELSE DO;                                                  */ 18050099
       /*    CALL R350_RETR_CU_ENGG_OU(WRK_CUSTOMER_NUMBER_V190);    */ 18060099
       /*    IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN              */ 18070099
       /*     WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;     */ 18080099
       /*  END;                                                      */ 18090099
       /*                                                 EOC RC01313*/ 18100099
         END;                                           /* EOC RC01311*/18110099
         ELSE DO;                                                       18120099
           IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                           18130099
             USER_FILE_PI.CUST_NO =                                     18140099
                                  SUBSTR(WRK_CUSTOMER_NUMBER_V11,3,6);  18150099
         END;                                                           18160099
       END;                                                             18170099
     END;                                                               18180099
     WHEN('S')                                                          18190099
     DO;                                                                18200099
    /* IF (WRK_CUSTNO_V190_IND ¬= -1) THEN     */      /* SOC RC01311*/ 18210099
       IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;         /* EOC RC01311*/ 18220099
         USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V190,3,6);   18230099
         IF (WRK_OU_CODE_V170_IND ¬= -1) THEN          /* SOC RC01311*/ 18240099
           WRK_PI_BAU_OU_CODE            = WRK_OU_CODE_V170;            18250099
       /*COMMENTED AS PART OF PCR PCEDSP-0064             SOC RC01313*/ 18260099
       /*ELSE DO;                                                    */ 18270099
       /*  CALL R350_RETR_CU_ENGG_OU(WRK_CUSTOMER_NUMBER_V190);      */ 18280099
       /*  IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN                */ 18290099
       /*   WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;       */ 18300099
       /*END;                                                        */ 18310099
       /*                                                 EOC RC01313*/ 18320099
       END;                                            /* EOC RC01311*/ 18330099
       ELSE DO;                                                         18340099
         IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                             18350099
           USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V11,3,6);  18360099
       END;                                                             18370099
     END;                                                               18380099
     OTHERWISE                                                          18390099
     DO;                                                                18400099
    /* IF (WRK_CUSTNO_V190_IND ¬= -1) THEN */          /* SOC RC01311*/ 18410099
       IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;         /* EOC RC01311*/ 18420099
         USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V190,3,6);   18430099
         IF (WRK_OU_CODE_V170_IND ¬= -1) THEN          /* SOC RC01311*/ 18440099
           WRK_PI_BAU_OU_CODE            = WRK_OU_CODE_V170;            18450099
       /*COMMENTED AS PART OF PCR PCEDSP-0064             SOC RC01313*/ 18460099
       /*ELSE DO;                                                    */ 18470099
       /*  CALL R350_RETR_CU_ENGG_OU(WRK_CUSTOMER_NUMBER_V190);      */ 18480099
       /*  IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN                */ 18490099
       /*   WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;       */ 18500099
       /*END;                                                        */ 18510099
       /*                                                 EOC RC01313*/ 18520099
       END;                                            /* EOC RC01311*/ 18530099
       ELSE DO;                                                         18540099
     /*  IF (WRK_CUSTNO_V10_IND ¬= -1) THEN */         /* SOC RC01311*/ 18550099
         IF (WRK_CUSTNO_V10_IND ¬= -1) THEN DO;        /* EOC RC01311*/ 18560099
           USER_FILE_PI.CUST_NO = SUBSTR(WRK_CUSTOMER_NUMBER_V10,3,6);  18570099
       /*COMMENTED AS PART OF PCR PCEDSP-0064             SOC RC01313*/ 18580099
       /* IF (WRK_OU_CODE_V170_IND ¬= -1) THEN         /* SOC RC01311*/ 18590099
       /*  WRK_PI_BAU_OU_CODE            = WRK_OU_CODE_V170;         */ 18600099
       /* ELSE DO;                                                   */ 18610099
       /*  CALL R350_RETR_CU_ENGG_OU(WRK_CUSTOMER_NUMBER_V10);       */ 18620099
       /*  IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN                */ 18630099
       /*   WRK_PI_BAU_OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;       */ 18640099
       /* END;                                                       */ 18650099
       /*                                                 EOC RC01313*/ 18660099
        END;                                            /* EOC RC01311*/18670099
       END;                                                             18680099
     END;                                                               18690099
   END;                                                                 18700099
 END;                                                  /* EOC RB01289 */18710099
                                                                        18720099
 USER_FILE_PI.PRODUCT_TYPE    = USER_FILE_PI.MA_TYPE;                   18730099
 USER_FILE_PI.ORIGIN          = USER_FILE_PI.MA_ORIGIN;                 18740099
 USER_FILE_PI.SEQUENCE_NUMBER = USER_FILE_PI.MA_SER_NO;                 18750099
                                                                        18760099
 IF WRK_PI_BAU_OU_CODE ¬= '' THEN                      /* SOC RC01311 */18770099
  DO;                                                                   18780099
   CALL R255_RETR_MABO_FOR_BAU_OUCODE;                                  18790099
    IF WRK_PI_BAU_T040_MABO ¬= '' THEN                                  18800099
     DO;                                                                18810099
      TB_RCBV040.MABO = WRK_PI_BAU_T040_MABO;                           18820099
      CURSOR_HW_PI_V051.OU_CODE = WRK_PI_BAU_OU_CODE;                   18830099
     END;                                                               18840099
  END;                                                 /* EOC RC01311 */18850099
                                                                        18860099
 /*IF WRK_PI_ORIGIN = 'T051'                          /* SOC RB01320 */ 18870099
 /*THEN DO;                                     /* NO T241 AVAILABLE */ 18880099
 /*IF WRK_IND_TOW ¬= -1 &                                 /* RC01293 */ 18890099
 /*  WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE  /* RC01293 */ 18900099
 /* THEN DO;                                          /* SOC RB01281 */ 18910099
                                                                        18920099
  /* IF (SWITCH_FLEXIBLE_WARRANTY_PI &                       RB01298 */ 18930099
                                                      /* SOC RC01293 */ 18940099
  /*     WRK_RUN_DATE > CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE)RB01298 */ 18950099
  /*     WRK_RUN_DATE > CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE & */       18960099
  /*     WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE) */        18970099
                                                      /* EOC RC01293 */ 18980099
                                                      /* SOC RC01298 */ 18990099
  /* IF ( SWITCH_FW_PI | SWITCH_HB_PI)                               */ 19000099
                                                      /* EOC RC01298 */ 19010099
  /* THEN                                                            */ 19020099
  /*   USER_FILE_PI.TYPE_MNT = CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY; */ 19030099
  /* ELSE                                                            */ 19040099
  /*   USER_FILE_PI.TYPE_MNT = CURSOR_HW_PI_V051.TYPE_OF_WARRANTY;   */ 19050099
  /*END;                                              /* EOC RB01281 */ 19060099
  /*ELSE                                                             */ 19070099
  /*USER_FILE_PI.TYPE_MNT = CURSOR_HW_PI_V051.TYPE_OF_MAINT; RC01293 */ 19080099
  /*USER_FILE_PI.TYPE_MNT = '3';                          /* RC01293 */ 19090099
  /*END;                                                             */ 19100099
  /*ELSE                                         /* T241 ENTRY FOUND */ 19110099
  /*USER_FILE_PI.TYPE_MNT = '2';                                     */ 19120099
                                                      /* EOC RB01320 */ 19130099
 USER_FILE_PI.MA_STATUS = R502_TRANS_TPMNT(USER_FILE_PI.TYPE_MNT);      19140099
                                                                        19150099
 USER_FILE_PI.MABO            = TB_RCBV040.MABO;                        19160099
 USER_FILE_PI.DIS             = '3';                                    19170099
 USER_FILE_PI.ORDER_NO        = ' ';                                    19180099
 USER_FILE_PI.CSLMEMC         = TB_RCBV400.MACHINE_CATEGORY;            19190099
 USER_FILE_PI.SYSTEM_NO       = ' ';                                    19200099
 USER_FILE_PI.CPU_TYPE        = ' ';                                    19210099
 USER_FILE_PI.PTS_HOST        = 1;                                      19220099
 USER_FILE_PI.DISF            = ' ';                                    19230099
 USER_FILE_PI.SERV_DIV        = '2';                                    19240099
 USER_FILE_PI.DPIS            = '3';                                    19250099
 USER_FILE_PI.DSC             = ' ';                                    19260099
                                                                        19270099
 IF WRK_PI_ORIGIN = 'T051' THEN                 /* NO T241 AVAILABLE */ 19280099
   USER_FILE_PI.SERVTYPE      = WRK_SERVICE_TYPE;                       19290099
 ELSE                                                                   19300099
   USER_FILE_PI.SERVTYPE      = CURSOR_HW_PI_V241.SERVICE_TYPE;         19310099
                                                                        19320099
 IF SWITCH_USER_EXIT                                                    19330099
 THEN DO;                                                               19340099
   IF WRK_PI_ORIGIN = 'T241' THEN                /* NO T051 AVAILABLE */19350099
     PARM_USER_INFO.OU_CODE = '';                                       19360099
   ELSE                                                                 19370099
     PARM_USER_INFO.OU_CODE = CURSOR_HW_PI_V051.OU_CODE;                19380099
                                                                        19390099
   USER_FILE_RCBDQD1 = USER_FILE_PI, BY NAME;                           19400099
                                                                        19410099
   CALL RCBDQ1U (ADDR (SWITCH_USER_EXIT),                               19420099
                 ADDR (PARM_USER_INFO),                                 19430099
                 ADDR (USER_FILE_RCBDQD1),                              19440099
                 PTR_INT_AREA);                                         19450099
                                                                        19460099
   IF SWITCH_USER_EXIT                           /* USER EXIT USED ? */ 19470099
   THEN                                                                 19480099
     USER_FILE_PI.MABO        = USER_FILE_RCBDQD1.MABO;                 19490099
 END;                                                                   19500099
                                                                        19510099
 WRK_PI_ORIGIN_TEMP = WRK_PI_ORIGIN;                       /*RB01289 */ 19520099
                                                                        19530099
 END R222_FILL_RCBDQD1_PI;                                              19540099
                                                      /* EOC RB01237 */ 19550099
                                                                        19560099
                                                                        19570099
1/********************************************************************/ 19580099
 /*                                                      SOC RB01237 */ 19590099
 /* MODULE NAME      :  R224_FETCH_CURSOR_HW_PI                      */ 19600099
 /*                                                                  */ 19610099
 /* DESCRIPTION      :                                               */ 19620099
 /*                                                                  */ 19630099
 /********************************************************************/ 19640099
 R224_FETCH_CURSOR_HW_PI: PROC;                                         19650099
                                                                        19660099
 CURSOR_HW_PI_V051 = '';                                                19670099
 CURSOR_HW_PI_V241 = '';                                                19680099
 WRK_PI_ORIGIN     = '';                                                19690099
 WRK_CUSTOMER_NUMBER_V10  = '';                        /* SOC RB01289*/ 19700099
 WRK_CUSTOMER_NUMBER_V11  = '';                                         19710099
 WRK_CUSTOMER_NUMBER_V190 = '';                        /* EOC RB01289*/ 19720099
 WRK_OU_CODE_V170         = '';                           /* RC01311 */ 19730099
 SWITCH_FW_PI = FALSE;                                    /* RB01298 */ 19740099
 SWITCH_HB_PI = FALSE;                                    /* RB01298 */ 19750099
                                                      /* SOC RB01320 */ 19760099
 SW_WARR_PI    = FALSE;                                                 19770099
 SW_MAINT_PI   = FALSE;                               /* EOC RB01320 */ 19780099
                                                                        19790099
 EXEC SQL                                                               19800099
   FETCH CURSOR_HW_PI                                                   19810099
     INTO :CURSOR_HW_PI_V051.PRODUCT_TYPE         :WRK_INDNULL          19820099
         ,:CURSOR_HW_PI_V051.ORIGIN               :WRK_INDNULL          19830099
         ,:CURSOR_HW_PI_V051.SEQUENCE_NUMBER      :WRK_INDNULL          19840099
         ,:WRK_PI_ORIGIN                          :WRK_INDNULL          19850099
         ,:CURSOR_HW_PI_V051.MODEL_NUMBER         :WRK_INDNULL          19860099
         ,:CURSOR_HW_PI_V051.INSTALL_DATE         :WRK_IND_INST_DATE    19870099
         ,:CURSOR_HW_PI_V051.TYPE_OF_MAINT        :WRK_INDNULL          19880099
         ,:CURSOR_HW_PI_V051.TYPE_OF_WARRANTY     :WRK_IND_TOW          19890099
         ,:CURSOR_HW_PI_V051.SERVICE_LVL_CODE_1   :WRK_IND_SLC_1        19900099
         ,:CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE   :WRK_IND_SPLT_DATE    19910099
         ,:CURSOR_HW_PI_V051.SERVICE_LVL_CODE_2   :WRK_IND_SLC_2        19920099
         ,:CURSOR_HW_PI_V051.WARRANTY_EXP_DATE    :WRK_INDNULL          19930099
                                                           /* RB01281 */19940099
         ,:CURSOR_HW_PI_V051.CUSTOMER_NUMBER      :WRK_IND_CUST         19950099
         ,:CURSOR_HW_PI_V051.OU_CODE              :WRK_IND_OU           19960099
         ,:CURSOR_HW_PI_V051.SOURCE_INDICATOR     :WRK_V051_SOUR_IND    19970099
                                                           /* RB01289 */19980099
         ,:CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY   :WRK_INDNULL          19990099
                                                          /*  RB01281 */20000099
         ,:CURSOR_HW_PI_V241.CONTRACT_NUMBER      :WRK_INDNULL          20010099
         ,:CURSOR_HW_PI_V241.SERVICE_TYPE         :WRK_INDNULL          20020099
         ,:CURSOR_HW_PI_V241.EFFECTIVE_DATE       :WRK_IND_EFF_DATE     20030099
         ,:CURSOR_HW_PI_V241.END_DATE             :WRK_IND_END_DATE     20040099
                                                          /* RB01320 */ 20050099
         ,:CURSOR_HW_PI_V241.AUTHORISATION_CODE   :WRK_INDNULL          20060099
                                                       /* SOC RB01289 */20070099
         ,:WRK_CUSTOMER_NUMBER_V10                :WRK_CUSTNO_V10_IND   20080099
         ,:WRK_CUSTOMER_NUMBER_V11                :WRK_CUSTNO_V11_IND   20090099
         ,:WRK_CUSTOMER_NUMBER_V190               :WRK_CUSTNO_V190_IND  20100099
                                                       /* EOC RB01289 */20110099
                                                       /* SOC RC01311 */20120099
         ,:WRK_OU_CODE_V170                       :WRK_OU_CODE_V170_IND 20130099
                                                       /* EOC RC01311 */20140099
       ;                                                                20150099
                                                                        20160099
 SELECT (SQLCODE);                                                      20170099
   WHEN (0) DO;                                                         20180099
     SWITCH_EOC_CURSOR_HW_PI  = FALSE;                                  20190099
     SK_HW_PI                 = '';                       /* RB01320 */ 20200099
     SK_HW_PI.EOF             = '0';                                    20210099
     SK_HW_PI.PRODUCT_TYPE    = CURSOR_HW_PI_V051.PRODUCT_TYPE;         20220099
     SK_HW_PI.ORIGIN          = CURSOR_HW_PI_V051.ORIGIN;               20230099
     SK_HW_PI.SEQUENCE_NUMBER = CURSOR_HW_PI_V051.SEQUENCE_NUMBER;      20240099
     SK_HW_PI.MODEL_NUMBER    = CURSOR_HW_PI_V051.MODEL_NUMBER;         20250099
                                                      /* SOC RB01320 */ 20260099
     WRK_051_PI_TOM           = CURSOR_HW_PI_V051.TYPE_OF_MAINT;        20270099
     WRK_051_PI_TOW           = CURSOR_HW_PI_V051.TYPE_OF_WARRANTY;     20280099
     WRK_051_PI_FTOW          = CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY;   20290099
                                                      /* EOC RB01320 */ 20300099
     IF CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE = '3999-12-31'             20310099
     THEN DO;                                                           20320099
       CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE = '';                       20330099
       WRK_IND_SPLT_DATE = -1;                                          20340099
     END;                                                               20350099
     IF CURSOR_HW_PI_V051.INSTALL_DATE = '3999-12-31'                   20360099
     THEN DO;                                                           20370099
       CURSOR_HW_PI_V051.INSTALL_DATE = '';                             20380099
       WRK_IND_INST_DATE = -1;                                          20390099
     END;                                                               20400099
     IF CURSOR_HW_PI_V241.EFFECTIVE_DATE = '3999-12-31'                 20410099
     THEN DO;                                                           20420099
       CURSOR_HW_PI_V241.EFFECTIVE_DATE = '';                           20430099
       WRK_IND_EFF_DATE = -1;                                           20440099
       CURSOR_HW_PI_V241.END_DATE = '';                                 20450099
       WRK_IND_END_DATE = -1;                                           20460099
     END;                                                               20470099
                                                       /* SOC RB01320 */20480099
   IF (WRK_RUN_DATE >= CURSOR_HW_PI_V241.EFFECTIVE_DATE  &              20490099
       WRK_RUN_DATE <= CURSOR_HW_PI_V241.END_DATE)                      20500099
   THEN                                                                 20510099
   DO;                                                                  20520099
     SW_MAINT_PI = TRUE;                                                20530099
   END;                                                /* EOC RB01320 */20540099
                                                       /* SOC RB01281 */20550099
       IF (CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY ¬= '' &                 20560099
           CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE ¬= '' &                 20570099
           CURSOR_HW_PI_V051.TYPE_OF_WARRANTY ¬=                        20580099
                   CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY) THEN           20590099
                                                       /* SOC RB01298 */20600099
   /*  THEN                                                           */20610099
   /*      SWITCH_FLEXIBLE_WARRANTY_PI = TRUE;                        */20620099
   /*  ELSE                                                           */20630099
   /*      SWITCH_FLEXIBLE_WARRANTY_PI = FALSE;                       */20640099
   /* END;                                                            */20650099
       DO;                                                              20660099
        IF (WRK_RUN_DATE >= CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE) &     20670099
           (WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE) THEN   20680099
          DO;                                                           20690099
           IF (CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY = WRK_FWTOW) THEN   20700099
               SWITCH_FW_PI = TRUE;                                     20710099
            ELSE                                                        20720099
              DO;                                                       20730099
               IF (CURSOR_HW_PI_V051.F_TYPE_OF_WARRANTY = WRK_HBTOM)    20740099
                   THEN  SWITCH_HB_PI = TRUE;                           20750099
              END;                                                      20760099
          END;                                                          20770099
  /*    ELSE                                          /* SOC RB01320 */ 20780099
  /*      DO;                                                           20790099
  /*         SWITCH_FW_PI = FALSE;                                      20800099
  /*         SWITCH_HB_PI = FALSE;                                      20810099
  /*      END;                                       /* EOC RB01320 */  20820099
         END;                                                           20830099
  /* ELSE                                            /* SOC RB01320 */  20840099
  /*   DO;                                                              20850099
  /*         SWITCH_FW_PI = FALSE;                                      20860099
  /*         SWITCH_HB_PI = FALSE;                                      20870099
  /*   END;                                                         */  20880099
                                                                        20890099
   IF  WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE  &           20900099
       (VERIFY(CURSOR_HW_PI_V051.TYPE_OF_WARRANTY,                      20910099
               WRK_TPMNT_VAL.TPMNT_WAR) = '0' |                         20920099
         SWITCH_FW_PI | SWITCH_HB_PI )                                  20930099
   THEN                                                                 20940099
     DO;                                                                20950099
       SW_WARR_PI = TRUE;                                               20960099
     END;                                                               20970099
                                                                        20980099
     IF (WRK_RUN_DATE > CURSOR_HW_PI_V051.WARRANTY_EXP_DATE)            20990099
     THEN                                                               21000099
     DO;                                                                21010099
       SW_POST_WARR_T51_PI = TRUE;                                      21020099
     END;                                                               21030099
                                                      /* EOC RB01320 */ 21040099
     END;                                               /*EOC RB01298*/ 21050099
   WHEN (100) DO;                                                       21060099
     SWITCH_EOC_CURSOR_HW_PI = TRUE;                                    21070099
                                                       /* SOC RB01298 */21080099
 /*  SWITCH_FLEXIBLE_WARRANTY_PI = FALSE;                  /* RB01281 */21090099
     SWITCH_FW_PI = FALSE;                                              21100099
     SWITCH_HB_PI = FALSE;                          /* EOC RB01298 */   21110099
     SK_HW_PI.EOF            = '1';                                     21120099
   END;                                                                 21130099
   OTHERWISE                                                            21140099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#003');                    21150099
 END;                                                                   21160099
                                                                        21170099
 END R224_FETCH_CURSOR_HW_PI;                                           21180099
                                                      /* EOC RB01237 */ 21190099
1/*********************************************************************/21200099
 /*                                                                   */21210099
 /* MODULE NAME      :  R252_RETR_ADD_INST_INFO                       */21220099
 /*                                                                   */21230099
 /* DESCRIPTION      :                                                */21240099
 /*                                                                   */21250099
 /*********************************************************************/21260099
 R252_RETR_ADD_INST_INFO: PROC;                                         21270099
                                                                        21280099
 TB_RCBV380 = '';                                                       21290099
                                                                        21300099
 IF WRK_REAL_BAU_INDNULL = -1 THEN                     /* SOC RB01320 */21310099
 DO;                                                                    21320099
   WRK_ORIGIN = CURSOR_HW_I_V300.ORIGIN;                                21330099
   WRK_SEQ_NO = CURSOR_HW_I_V300.SEQUENCE_NUMBER;                       21340099
 END;                                                                   21350099
 ELSE                                                                   21360099
 DO;                                                                    21370099
   WRK_ORIGIN = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,1,2);                    21380099
   WRK_SEQ_NO = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,3);                      21390099
 END;                                                 /* EOC RB01320 */ 21400099
                                                                        21410099
 EXEC SQL                                                               21420099
   SELECT DP_SYSTEM_NUMBER                                              21430099
     INTO :TB_RCBV380.DP_SYSTEM_NUMBER    :WRK_INDNULL                  21440099
   FROM RCBV0380_HW_PR_MOD                                              21450099
   WHERE PRODUCT_TYPE        = :CURSOR_HW_I_V300.PRODUCT_TYPE           21460099
                                                      /* SOC RB01320 */ 21470099
   /*AND ORIGIN              = :CURSOR_HW_I_V300.ORIGIN                 21480099
     AND SEQUENCE_NUMBER     = :CURSOR_HW_I_V300.SEQUENCE_NUMBER */     21490099
     AND ORIGIN              = :WRK_ORIGIN                              21500099
     AND SEQUENCE_NUMBER     = :WRK_SEQ_NO                              21510099
                                                      /* EOC RB01320 */ 21520099
     AND COUNTRY_NUMBER      = :WRK_CTRYNO                              21530099
     AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE                           21540099
                           AND END_DATE                                 21550099
   ;                                                                    21560099
                                                                        21570099
 SELECT (SQLCODE);                                                      21580099
   WHEN (0);                                                            21590099
   WHEN (100);                                                          21600099
   OTHERWISE                                                            21610099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#004');                    21620099
 END;                                                                   21630099
                                                                        21640099
               /* RETRIEVE SERVICE CONTRACT INFO IN CASE OF SERV CTR */ 21650099
 IF CURSOR_HW_I_V220.TYPE_OF_MAINT = WRK_TPMNT_VAL.TPMNT_ST2_DEF        21660099
    | SWITCH_ACTIVE_CONTRACT = TRUE                        /* RB01290 */21670099
 THEN DO;                                                               21680099
   TB_RCBV240 = '';                                                     21690099
                                                                        21700099
   EXEC SQL                                                             21710099
     SELECT AGREEMENT_TYPE                                              21720099
           ,AGREEMENT_OPTION                                            21730099
           ,SERVICE_TYPE                                                21740099
           ,SOURCE_INDICATOR                                            21750099
       INTO :TB_RCBV240.AGREEMENT_TYPE        :WRK_INDNULL              21760099
           ,:TB_RCBV240.AGREEMENT_OPTION      :WRK_INDNULL              21770099
           ,:TB_RCBV240.SERVICE_TYPE          :WRK_INDNULL              21780099
           ,:TB_RCBV240.SOURCE_INDICATOR      :WRK_INDNULL              21790099
     FROM RCBV0240_SERV_CTR                                             21800099
     WHERE PRODUCT_TYPE        = :CURSOR_HW_I_V300.PRODUCT_TYPE         21810099
                                                       /* SOC RB01320 */21820099
    /* AND ORIGIN              = :CURSOR_HW_I_V300.ORIGIN               21830099
       AND SEQUENCE_NUMBER     = :CURSOR_HW_I_V300.SEQUENCE_NUMBER */   21840099
       AND ORIGIN              = :WRK_ORIGIN                            21850099
       AND SEQUENCE_NUMBER     = :WRK_SEQ_NO                            21860099
                                                       /* EOC RB01320 */21870099
       AND COUNTRY_NUMBER      = :WRK_CTRYNO                            21880099
       AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE                         21890099
                             AND END_DATE                               21900099
     ;                                                                  21910099
                                                                        21920099
   SELECT (SQLCODE);                                                    21930099
     WHEN (0);                                                          21940099
     OTHERWISE                                                          21950099
       CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#005');                  21960099
   END;                                                                 21970099
 END;                                                                   21980099
                                                                        21990099
 END R252_RETR_ADD_INST_INFO;                                           22000099
                                                                        22010099
1/********************************************************************/ 22020099
 /*                                                        RB012137  */ 22030099
 /* MODULE NAME      :  R254_RETR_ADD_PI_DATA                        */ 22040099
 /*                                                                  */ 22050099
 /* DESCRIPTION      : RETRIEVE ADDITIONAL PRIME INPUT DATA          */ 22060099
 /*                                                                  */ 22070099
 /********************************************************************/ 22080099
 R254_RETR_ADD_PI_DATA: PROC;                                           22090099
                                            /*************************/ 22100099
                                            /* GET BRANCH OFFICE     */ 22110099
                                            /*************************/ 22120099
 TB_RCBV040 = '';                                                       22130099
 IF WRK_PI_ORIGIN = 'BOTH'                  /* T051 AVAILABLE        */ 22140099
  | WRK_PI_ORIGIN = 'T051'                  /* T051 AVAILABLE        */ 22150099
 THEN DO;                                                               22160099
   IF WRK_IND_OU ¬= -1                      /* OU-CODE AVAILABLE     */ 22170099
   THEN DO;                                                             22180099
     EXEC SQL                                                           22190099
       SELECT MABO                                                      22200099
         INTO :TB_RCBV040.MABO    :WRK_INDNULL                          22210099
       FROM RCBV0040_OU                                                 22220099
       WHERE COUNTRY_NUMBER     = :WRK_CTRYNO                           22230099
         AND OU_CODE            = :CURSOR_HW_PI_V051.OU_CODE            22240099
     ;                                                                  22250099
                                                                        22260099
     SELECT (SQLCODE);                                                  22270099
       WHEN (0);                                                        22280099
       WHEN (100) TB_RCBV040.MABO = '';                                 22290099
       OTHERWISE                                                        22300099
         CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#006');                22310099
     END;                                                               22320099
   END;                                                                 22330099
 END;                                                                   22340099
                                            /*************************/ 22350099
                                            /* GET SERVICE TYPE      */ 22360099
                                            /*************************/ 22370099
 IF WRK_PI_ORIGIN = 'T051'                  /* NO T241 AVAILABLE     */ 22380099
 THEN DO;                                                               22390099
   IF WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_EXP_DATE /* RC01293 */ 22400099
   THEN DO;                                               /* RC01293 */ 22410099
     SELECT;                                                            22420099
       WHEN(WRK_IND_SLC_1 ¬= -1 &               /* NULLIND SLC 1     */ 22430099
            WRK_IND_SLC_2  = -1)                /* NO WARRANTY SPLIT */ 22440099
         WRK_SERVICE_LVL_CODE = CURSOR_HW_PI_V051.SERVICE_LVL_CODE_1;   22450099
       WHEN(WRK_IND_SLC_1 ¬= -1 &               /* NULLIND SLC 1     */ 22460099
            WRK_IND_SLC_2 ¬= -1)                /* WARRANTY SPLIT    */ 22470099
       DO;                                                              22480099
         IF CURSOR_HW_PI_V051.INSTALL_DATE <= WRK_RUN_DATE &            22490099
            WRK_RUN_DATE <= CURSOR_HW_PI_V051.WARRANTY_SPLT_DATE        22500099
         THEN                                                           22510099
           WRK_SERVICE_LVL_CODE = CURSOR_HW_PI_V051.SERVICE_LVL_CODE_1; 22520099
         ELSE                                                           22530099
           WRK_SERVICE_LVL_CODE = CURSOR_HW_PI_V051.SERVICE_LVL_CODE_2; 22540099
       END;                                                             22550099
       OTHERWISE                                                        22560099
         WRK_SERVICE_LVL_CODE = '';                                     22570099
     END;                                                               22580099
   END;                                               /* SOC RC01293 */ 22590099
   ELSE                                                                 22600099
     WRK_SERVICE_LVL_CODE = '';                       /* EOC RC01293 */ 22610099
   IF WRK_SERVICE_LVL_CODE = '' THEN                                    22620099
     WRK_SERVICE_TYPE = ' ';                                            22630099
   ELSE                                                                 22640099
     CALL R264_GET_SERVICE_TYPE;     /* TRANSLATE LVL_CODE TO TYPE   */ 22650099
                                                                        22660099
 END;                                                                   22670099
                                                                        22680099
 END R254_RETR_ADD_PI_DATA;                                             22690099
                                                      /* EOC RB01237 */ 22700099
1/********************************************************************/ 22710099
 /*                                                      SOC RC01311 */ 22720099
 /* MODULE NAME      : R255_RETR_MABO_FOR_BAU_OUCODE                 */ 22730099
 /*                                                                  */ 22740099
 /* DESCRIPTION      : RETRIEVE MABO FOR THE BAU OU_CODE WHEN THE    */ 22750099
 /*                    PI TOS AVAILABLE IN BAU CUSTOMER INVENTORY    */ 22760099
 /********************************************************************/ 22770099
 R255_RETR_MABO_FOR_BAU_OUCODE : PROC;                                  22780099
                                            /*************************/ 22790099
                                            /* GET BRANCH OFFICE     */ 22800099
                                            /*************************/ 22810099
 WRK_PI_BAU_T040_MABO = '';                                             22820099
                                                                        22830099
 IF WRK_PI_ORIGIN = 'BOTH'                  /* T051 AVAILABLE        */ 22840099
  | WRK_PI_ORIGIN = 'T051'                  /* T051 AVAILABLE        */ 22850099
 THEN DO;                                                               22860099
   EXEC SQL                                                             22870099
     SELECT MABO                                                        22880099
       INTO :WRK_PI_BAU_T040_MABO :WRK_INDNULL                          22890099
     FROM RCBV0040_OU                                                   22900099
     WHERE COUNTRY_NUMBER     = :WRK_CTRYNO                             22910099
       AND OU_CODE            = :WRK_PI_BAU_OU_CODE                     22920099
   ;                                                                    22930099
                                                                        22940099
   SELECT (SQLCODE);                                                    22950099
     WHEN (0);                                                          22960099
     WHEN (100) WRK_PI_BAU_T040_MABO = '';                              22970099
     OTHERWISE                                                          22980099
       CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#065');                  22990099
   END;                                                                 23000099
 END;                                                                   23010099
 END R255_RETR_MABO_FOR_BAU_OUCODE;                    /* EOC RC01311 */23020099
 /*********************************************************************/23030099
 /* THIS PROC IS COMMENTED AS PART OF PCEDSP-0064         SOC RC01313 */23040099
 /*                                                       SOC RC01311 */23050099
 /* MODULE NAME      : R350_RETR_CU_ENGG_OU                           */23060099
 /*                                                                   */23070099
 /* DESCRIPTION      : RETRIEVE CU ENGINEERING OU CODE FROM TABLE     */23080099
 /*                    RCBT0350_CUST_MOD WHEN OU CODE COULD NOT BE    */23090099
 /*                    DETERMINED FROM TABLE RCBT0170_OU_HW           */23100099
 /*                                                                   */23110099
 /*********************************************************************/23120099
 /*R350_RETR_CU_ENGG_OU: PROC(CUSTOMER_NO);                             23130099
                                                                        23140099
                                        /* RETRIEVE CU ENGINEERING OU */23150099
 /*TB_RCBV350 = '';                                                     23160099
 /*DCL CUSTOMER_NO CHAR(08);                                            23170099
                                                                        23180099
 /*EXEC SQL                                                             23190099
 /*SELECT CU_ENGINEERING_OU                                             23200099
 /*INTO :TB_RCBV350.CU_ENGINEERING_OU      :WRK_INDNULL                 23210099
 /*FROM RCBV0350_CUST_MOD                                               23220099
 /*WHERE COUNTRY_NUMBER      = :WRK_CTRYNO                              23230099
 /*AND CUSTOMER_NUMBER       = :CUSTOMER_NO                             23240099
 /*AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                           23250099
 /*                    AND END_DATE                                     23260099
 /*;                                                                    23270099
 /*SELECT(SQLCODE);                                                     23280099
 /*  WHEN(0);                                                           23290099
 /*  WHEN(100);                                                         23300099
 /*  OTHERWISE                                                          23310099
 /*    DO;                                                              23320099
 /*      CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#066');                23330099
 /*    END;                                                             23340099
 /*END;                                                                 23350099
 /*END R350_RETR_CU_ENGG_OU;                        /* EOC RC01311 */   23360099
                                                    /* EOC RC01313 */   23370099
1/********************************************************************/ 23380099
 /*                                                      SOC RB01237 */ 23390099
 /* MODULE NAME      : R264_GET_SERVICE_TYPE                         */ 23400099
 /*                                                                  */ 23410099
 /* DESCRIPTION      : TRANSLATE SERVICE LEVEL CODE                  */ 23420099
 /*                         INTO SERVICE TYPE                        */ 23430099
 /*                                                                  */ 23440099
 /********************************************************************/ 23450099
 R264_GET_SERVICE_TYPE: PROC;                                           23460099
                                                                        23470099
 TB_RCBV470                  = '';                                      23480099
 TB_RCBV470_I.INDNULL(*)     = 0;                                       23490099
 TB_RCBV470.SERVICE_LVL_CODE = WRK_SERVICE_LVL_CODE;                    23500099
                                                                        23510099
 CALL RCBISRM (ADDR(TB_RCBV470),                                        23520099
               ADDR(TB_RCBV470_I),                                      23530099
               ADDR(RETURN_AREA_BB),                                    23540099
               PTR_INT_AREA);                                           23550099
                                                                        23560099
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   23570099
   WHEN (0) DO;                                                         23580099
     TB_RCBV640                    = '';                                23590099
     TB_RCBV640_I.INDNULL(*)       = 0;                                 23600099
     TB_RCBV640.SERVICE_DLVR_METHD = TB_RCBV470.SERVICE_DLVR_METHD;     23610099
                                                                        23620099
     CALL RCBIBOM (ADDR(TB_RCBV640),                                    23630099
                   ADDR(TB_RCBV640_I),                                  23640099
                   PTR_RETURN_AREA_BB,                                  23650099
                   PTR_INT_AREA,                                        23660099
                   'SDM');                                              23670099
                                                                        23680099
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                23690099
       WHEN (0)                                                         23700099
         WRK_SERVICE_TYPE = TB_RCBV640.SERVICE_TYPE;                    23710099
       WHEN (4)                                                         23720099
         WRK_SERVICE_TYPE = ' ';                                        23730099
       OTHERWISE                                                        23740099
         CALL RCBDQDM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),            23750099
                            'DB2','#007');                              23760099
     END;                                                               23770099
   END;                                                                 23780099
                                                                        23790099
   OTHERWISE                                                            23800099
     CALL RCBDQDM_ERROR (ADDR(RETURN_AREA_BB.RETURN_SQL),               23810099
                         'DB2','#008');                                 23820099
 END;                                                                   23830099
                                                                        23840099
 END R264_GET_SERVICE_TYPE;                                             23850099
                                                      /* EOC RB01237 */ 23860099
1/********************************************************************/ 23870099
 /*                                                   /* SOC RB01320 */ 23880099
 /* MODULE NAME      : R290_APPLY_PRIORITY                           */ 23890099
 /*                                                                  */ 23900099
 /* DESCRIPTION      : APPLY BAU_PI PRIORITY RULES                   */ 23910099
 /*                                                                  */ 23920099
 /********************************************************************/ 23930099
 R290_APPLY_PRIORITY: PROC;                                             23940099
                /* APPLYING PRIORITY RULES FOR BAU AND PI COMINATION */ 23950099
 SELECT;                                                                23960099
   WHEN (SW_WARRANTY)                                /* BAU WARRANTY */ 23970099
   DO;                                                                  23980099
     SELECT;                                                            23990099
       WHEN(SWITCH_FLEXIBLE_WARRANTY_BAU | SWITCH_HARDBUNDLE_BAU)       24000099
       DO;                                                              24010099
         FILE_RCBDQD1.TYPE_MNT = WRK_220_I_FTOW;                        24020099
       END;                                                             24030099
       WHEN(WRK_220_I_TOW ¬= '')                                        24040099
       DO;                                                              24050099
         FILE_RCBDQD1.TYPE_MNT = WRK_220_I_TOW;                         24060099
       END;                                                             24070099
       OTHERWISE                                                        24080099
       DO;                                                              24090099
         FILE_RCBDQD1.TYPE_MNT = WRK_220_I_TOM;                         24100099
       END;                                                             24110099
     END;                                                               24120099
   END;                                                                 24130099
                                                      /* PI WARRANTY */ 24140099
   WHEN (SW_WARR_PI)                                                    24150099
   DO;                                                                  24160099
     SELECT;                                                            24170099
       WHEN(SWITCH_FW_PI | SWITCH_HB_PI)                                24180099
       DO;                                                              24190099
         FILE_RCBDQD1.TYPE_MNT = WRK_051_PI_FTOW;                       24200099
       END;                                                             24210099
       WHEN(WRK_051_PI_TOW ¬= '')                                       24220099
       DO;                                                              24230099
         FILE_RCBDQD1.TYPE_MNT = WRK_051_PI_TOW;                        24240099
       END;                                                             24250099
       OTHERWISE                                                        24260099
       DO;                                                              24270099
         FILE_RCBDQD1.TYPE_MNT = WRK_051_PI_TOM;                        24280099
       END;                                                             24290099
     END;                                                               24300099
   END;                                                                 24310099
                                          /* INTERNAL & LEASE RENTAL */ 24320099
   WHEN(SWITCH_INTERNAL|SWITCH_LEASE_RENTAL)                            24330099
   DO;                                                                  24340099
     FILE_RCBDQD1.TYPE_MNT = WRK_220_I_TOM;                             24350099
   END;                                                                 24360099
                                            /* TOM INTERNAL CONTRACT */ 24370099
   WHEN(SWITCH_INTERNAL_CTR)                                            24380099
   DO;                                                                  24390099
     FILE_RCBDQD1.TYPE_MNT  = PARM_RCBP70S.TOM_INTERNAL_CONTRACT;       24400099
     FILE_RCBDQD1.MA_STATUS = PARM_RCBP70S.MACHINE_STATUS;              24410099
   END;                                                                 24420099
                                     /* CONTRACT AND SUPPLY CONTRACT */ 24430099
   WHEN(SWITCH_ACTIVE_CONTRACT | SW_SUPP_CTR)                           24440099
   DO;                                                                  24450099
     FILE_RCBDQD1.TYPE_MNT = WRK_220_I_TOM;                             24460099
   END;                                                                 24470099
                                                      /* PI CONTRACT */ 24480099
   WHEN(SW_MAINT_PI)                                                    24490099
   DO;                                                                  24500099
     IF SWITCH_VENDOR_SERVICE THEN                                      24510099
       DO;                                                              24520099
         IF SUBSTR(CURSOR_HW_PI_V241.AUTHORISATION_CODE,1,3) = 'LEN'    24530099
         THEN                                                           24540099
           DO;                                                          24550099
             FILE_RCBDQD1.TYPE_MNT  = 'G';                              24560099
           END;                                                         24570099
         ELSE                                                           24580099
           DO;                                                          24590099
             FILE_RCBDQD1.TYPE_MNT = '2';                               24600099
           END;                                                         24610099
       END;                                                             24620099
     ELSE                                                               24630099
       DO;                                                              24640099
         FILE_RCBDQD1.TYPE_MNT = '2';                                   24650099
       END;                                                             24660099
   END;                                                                 24670099
                                                      /* BAU PERCALL */ 24680099
   WHEN(SW_POST_WARR_BAU)                                               24690099
   DO;                                                                  24700099
     FILE_RCBDQD1.TYPE_MNT = WRK_220_I_TOM;                             24710099
   END;                                                                 24720099
                                                       /* PI PERCALL */ 24730099
   WHEN(SW_POST_WARR_T51_PI)                                            24740099
   DO;                                                                  24750099
     FILE_RCBDQD1.TYPE_MNT = '3';                                       24760099
   END;                                                                 24770099
                                                                        24780099
   OTHERWISE                                                            24790099
   DO;                                                                  24800099
     FILE_RCBDQD1.TYPE_MNT = WRK_220_I_TOM;                             24810099
   END;                                                                 24820099
 END;                                                                   24830099
                                                                        24840099
 IF ¬SWITCH_INTERNAL_CTR                                                24850099
 THEN                                                                   24860099
 DO;                                                                    24870099
 FILE_RCBDQD1.MA_STATUS = R502_TRANS_TPMNT(FILE_RCBDQD1.TYPE_MNT);      24880099
 END;                                                                   24890099
                                                                        24900099
 END R290_APPLY_PRIORITY;                             /* EOC RB01320 */ 24910099
1/*********************************************************************/24920099
 /*                                                                   */24930099
 /* MODULE NAME      :  R300_WRITE_RCBDQD1                            */24940099
 /*                                                                   */24950099
 /* DESCRIPTION      :                                                */24960099
 /*                                                                   */24970099
 /*********************************************************************/24980099
 R300_WRITE_RCBDQD1: PROC;                                              24990099
                                                 /* UPDATE HASH_TOTAL */25000099
 CALL RCB018M (SUBSTR(FILE_RCBDQD1.MA_SER_NO,1,4),                      25010099
               WRK_HASH_TOTAL,                                          25020099
               PTR_INT_AREA);                                           25030099
                                                                        25040099
 WRITE FILE(RCBDQD1) FROM (FILE_RCBDQD1);                               25050099
                                                                        25060099
 WRK_CNT_COUNTRY = WRK_CNT_COUNTRY + 1;                                 25070099
                                                                        25080099
 END R300_WRITE_RCBDQD1;                                                25090099
                                                                        25100099
1/*********************************************************************/25110099
 /*                                                      SOC RB01237 **/25120099
 /* MODULE NAME      :  R400_PROC_MES                                 */25130099
 /*                                                                   */25140099
 /* DESCRIPTION      : PROCESS MES RECORDS                            */25150099
 /*                                                                   */25160099
 /*********************************************************************/25170099
 R400_PROC_MES: PROC;                                                   25180099
                                                                        25190099
 IF SWITCH_HW_INST = TRUE                                               25200099
 THEN DO;                                                               25210099
                                             /* RETR MES ORDERS INST */ 25220099
   CALL R402_INIT_MES_INSTALLED;                                        25230099
   DO WHILE (¬SWITCH_EOC_CURSOR_MES_I);                                 25240099
     CALL R406_FILL_MES_INSTALLED;                                      25250099
     CALL R300_WRITE_RCBDQD1;                                           25260099
     CALL R404_FETCH_CURSOR_MES_I;                                      25270099
   END;                                                                 25280099
   CALL R408_END_MES_INSTALLED;                                         25290099
 END;                                                                   25300099
                                                                        25310099
 IF SWITCH_HW_ORDR = TRUE                                               25320099
 THEN DO;                                                               25330099
                                             /* RETR MES ORDERS OO   */ 25340099
   CALL R412_INIT_MES_ON_ORDER;                                         25350099
   DO WHILE (¬SWITCH_EOC_CURSOR_MES_O);                                 25360099
     CALL R416_FILL_MES_ON_ORDER;                                       25370099
     CALL R300_WRITE_RCBDQD1;                                           25380099
     CALL R414_FETCH_CURSOR_MES_O;                                      25390099
   END;                                                                 25400099
   CALL R418_END_MES_ON_ORDER;                                          25410099
 END;                                                                   25420099
                                                                        25430099
 END R400_PROC_MES;                                                     25440099
                                                      /* EOC RB01237 */ 25450099
1/*********************************************************************/25460099
 /*                                                                   */25470099
 /* MODULE NAME      :  R402_INIT_MES_INSTALLED                       */25480099
 /*                                                                   */25490099
 /* DESCRIPTION      :                                                */25500099
 /*                                                                   */25510099
 /*********************************************************************/25520099
 R402_INIT_MES_INSTALLED: PROC;                                         25530099
                                         /* INIT CURSOR CURSOR_MES_I */ 25540099
 EXEC SQL                                                               25550099
   OPEN CURSOR_MES_I;                                                   25560099
                                                                        25570099
 SELECT (SQLCODE);                                                      25580099
   WHEN (0);                                                            25590099
   OTHERWISE                                                            25600099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#009');                    25610099
 END;                                                                   25620099
                            /* FETCH FIRST OCCURENCE OF CURSOR_MES_I */ 25630099
 CALL R404_FETCH_CURSOR_MES_I;                                          25640099
                                                                        25650099
 END R402_INIT_MES_INSTALLED;                                           25660099
                                                                        25670099
1/*********************************************************************/25680099
 /*                                                                   */25690099
 /* MODULE NAME      :  R404_FETCH_CURSOR_MES_I                       */25700099
 /*                                                                   */25710099
 /* DESCRIPTION      :                                                */25720099
 /*                                                                   */25730099
 /*********************************************************************/25740099
 R404_FETCH_CURSOR_MES_I: PROC;                                         25750099
                                                                        25760099
 CURSOR_MES_I_V250 = '';                                                25770099
 IF WRK_REAL_INDNULL_BAU = -1 THEN                   /* SOC RB01320 */  25780099
 DO;                                                                    25790099
   WRK_ORIGIN = FILE_RCBDQD1.ORIGIN;                                    25800099
   WRK_SEQ_NO = FILE_RCBDQD1.SEQUENCE_NUMBER;                           25810099
 END;                                                                   25820099
 ELSE                                                                   25830099
 DO;                                                                    25840099
   WRK_ORIGIN = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,1,2);                    25850099
   WRK_SEQ_NO = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,3);                      25860099
 END;                                                 /* EOC RB01320 */ 25870099
 EXEC SQL                                                               25880099
   FETCH CURSOR_MES_I                                                   25890099
   INTO   :CURSOR_MES_I_V250.MES_ORDER_NUMBER :WRK_INDNULL              25900099
         ,:CURSOR_MES_I_V250.FUTURE_TYPE      :WRK_INDNULL              25910099
         ,:CURSOR_MES_I_V250.FUTURE_MODEL     :WRK_INDNULL              25920099
         ,:CURSOR_MES_I_V250.SCHED_COMPL_DATE :WRK_INDNULL              25930099
   ;                                                                    25940099
                                                                        25950099
 SELECT (SQLCODE);                                                      25960099
   WHEN (0)                                                             25970099
     SWITCH_EOC_CURSOR_MES_I = FALSE;                                   25980099
   WHEN (100)                                                           25990099
     SWITCH_EOC_CURSOR_MES_I = TRUE;                                    26000099
   OTHERWISE                                                            26010099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#010');                    26020099
 END;                                                                   26030099
                                                                        26040099
 END R404_FETCH_CURSOR_MES_I;                                           26050099
                                                                        26060099
1/*********************************************************************/26070099
 /*                                                                   */26080099
 /* MODULE NAME      :  R406_FILL_MES_INSTALLED                       */26090099
 /*                                                                   */26100099
 /* DESCRIPTION      :                                                */26110099
 /*                                                                   */26120099
 /*********************************************************************/26130099
 R406_FILL_MES_INSTALLED: PROC;                                         26140099
                                                                        26150099
 FILE_RCBDQD1.MA_TYPE   = CURSOR_MES_I_V250.FUTURE_TYPE;                26160099
 FILE_RCBDQD1.DIS       = '2';                                          26170099
 FILE_RCBDQD1.ORDER_NO  = CURSOR_MES_I_V250.MES_ORDER_NUMBER;           26180099
 FILE_RCBDQD1.MA_MODEL  = CURSOR_MES_I_V250.FUTURE_MODEL;               26190099
 FILE_RCBDQD1.PTS_HOST  = 1;                              /* RA01077 */ 26200099
 FILE_RCBDQD1.TYPE_MNT  = '';                                           26210099
 FILE_RCBDQD1.MA_STATUS = '';                                           26220099
 FILE_RCBDQD1.DPIS      = '0';                                          26230099
 FILE_RCBDQD1.SERVTYPE  = '';                                           26240099
 FILE_RCBDQD1.INST_DATE =                                               26250099
         R504_TRANS_DATE (CURSOR_MES_I_V250.SCHED_COMPL_DATE);          26260099
                                                                        26270099
 /*------------------ START RC01141 CHANGES -------------------------*/ 26280099
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_CURRENT_HW)                     26290099
                           || CURSOR_MES_I_V250.FUTURE_TYPE             26300099
                           || CURSOR_MES_I_V250.MES_ORDER_NUMBER        26310099
                           || CURSOR_MES_I_V250.FUTURE_MODEL;           26320099
 /*-------------------- END RC01141 CHANGES -------------------------*/ 26330099
 END R406_FILL_MES_INSTALLED;                                           26340099
                                                                        26350099
1/*********************************************************************/26360099
 /*                                                                   */26370099
 /* MODULE NAME      :  R408_END_MES_INSTALLED                        */26380099
 /*                                                                   */26390099
 /* DESCRIPTION      :                                                */26400099
 /*                                                                   */26410099
 /*********************************************************************/26420099
 R408_END_MES_INSTALLED: PROC;                                          26430099
                                        /* CLOSE CURSOR CURSOR_MES_I */ 26440099
 EXEC SQL                                                               26450099
   CLOSE CURSOR_MES_I;                                                  26460099
                                                                        26470099
 SELECT (SQLCODE);                                                      26480099
   WHEN (0);                                                            26490099
   OTHERWISE                                                            26500099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#011');                    26510099
 END;                                                                   26520099
                                                                        26530099
 END R408_END_MES_INSTALLED;                                            26540099
                                                                        26550099
1/*********************************************************************/26560099
 /*                                                                   */26570099
 /* MODULE NAME      :  R412_INIT_MES_ON_ORDER                        */26580099
 /*                                                                   */26590099
 /* DESCRIPTION      :                                                */26600099
 /*                                                                   */26610099
 /*********************************************************************/26620099
 R412_INIT_MES_ON_ORDER: PROC;                                          26630099
                                         /* INIT CURSOR CURSOR_MES_O */ 26640099
 EXEC SQL                                                               26650099
   OPEN CURSOR_MES_O;                                                   26660099
                                                                        26670099
 SELECT (SQLCODE);                                                      26680099
   WHEN (0);                                                            26690099
   OTHERWISE                                                            26700099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#012');                    26710099
 END;                                                                   26720099
                            /* FETCH FIRST OCCURENCE OF CURSOR_MES_O */ 26730099
 CALL R414_FETCH_CURSOR_MES_O;                                          26740099
                                                                        26750099
 END R412_INIT_MES_ON_ORDER;                                            26760099
                                                                        26770099
1/*********************************************************************/26780099
 /*                                                                   */26790099
 /* MODULE NAME      :  R414_FETCH_CURSOR_MES_O                       */26800099
 /*                                                                   */26810099
 /* DESCRIPTION      :                                                */26820099
 /*                                                                   */26830099
 /*********************************************************************/26840099
 R414_FETCH_CURSOR_MES_O: PROC;                                         26850099
                                                                        26860099
 CURSOR_MES_O_V330 = '';                                                26870099
                                                                        26880099
 EXEC SQL                                                               26890099
   FETCH CURSOR_MES_O                                                   26900099
   INTO   :CURSOR_MES_O_V330.MES_ORDER_NUMBER :WRK_INDNULL              26910099
         ,:CURSOR_MES_O_V330.FUTURE_TYPE      :WRK_INDNULL              26920099
         ,:CURSOR_MES_O_V330.FUTURE_MODEL     :WRK_INDNULL              26930099
         ,:CURSOR_MES_O_V330.SCHED_COMPL_DATE :WRK_INDNULL              26940099
   ;                                                                    26950099
                                                                        26960099
 SELECT (SQLCODE);                                                      26970099
   WHEN (0)                                                             26980099
     SWITCH_EOC_CURSOR_MES_O = FALSE;                                   26990099
   WHEN (100)                                                           27000099
     SWITCH_EOC_CURSOR_MES_O = TRUE;                                    27010099
   OTHERWISE                                                            27020099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#013');                    27030099
 END;                                                                   27040099
                                                                        27050099
 END R414_FETCH_CURSOR_MES_O;                                           27060099
                                                                        27070099
1/*********************************************************************/27080099
 /*                                                                   */27090099
 /* MODULE NAME      :  R416_FILL_MES_ON_ORDER                        */27100099
 /*                                                                   */27110099
 /* DESCRIPTION      :                                                */27120099
 /*                                                                   */27130099
 /*********************************************************************/27140099
 R416_FILL_MES_ON_ORDER: PROC;                                          27150099
                                                                        27160099
 FILE_RCBDQD1.MA_TYPE   = CURSOR_MES_O_V330.FUTURE_TYPE;                27170099
 FILE_RCBDQD1.DIS       = '2';                                          27180099
 FILE_RCBDQD1.ORDER_NO  = CURSOR_MES_O_V330.MES_ORDER_NUMBER;           27190099
 FILE_RCBDQD1.MA_MODEL  = CURSOR_MES_O_V330.FUTURE_MODEL;               27200099
 FILE_RCBDQD1.PTS_HOST  = 1;                               /* RA01077*/ 27210099
 FILE_RCBDQD1.TYPE_MNT  = '';                                           27220099
 FILE_RCBDQD1.MA_STATUS = '';                                           27230099
 FILE_RCBDQD1.DPIS      = '0';                                          27240099
 FILE_RCBDQD1.SERVTYPE  = '';                                           27250099
 FILE_RCBDQD1.INST_DATE =                                               27260099
         R504_TRANS_DATE (CURSOR_MES_O_V330.SCHED_COMPL_DATE);          27270099
                                                                        27280099
 /*------------------ START RC01141 CHANGES -------------------------*/ 27290099
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_CURRENT_HW)                     27300099
                           || CURSOR_MES_O_V330.FUTURE_TYPE             27310099
                           || CURSOR_MES_O_V330.MES_ORDER_NUMBER        27320099
                           || CURSOR_MES_O_V330.FUTURE_MODEL;           27330099
 /*-------------------- END RC01141 CHANGES -------------------------*/ 27340099
 END R416_FILL_MES_ON_ORDER;                                            27350099
                                                                        27360099
1/*********************************************************************/27370099
 /*                                                                   */27380099
 /* MODULE NAME      :  R418_END_MES_ON_ORDER                         */27390099
 /*                                                                   */27400099
 /* DESCRIPTION      :                                                */27410099
 /*                                                                   */27420099
 /*********************************************************************/27430099
 R418_END_MES_ON_ORDER: PROC;                                           27440099
                                        /* CLOSE CURSOR CURSOR_MES_O */ 27450099
 EXEC SQL                                                               27460099
   CLOSE CURSOR_MES_O;                                                  27470099
                                                                        27480099
 SELECT (SQLCODE);                                                      27490099
   WHEN (0);                                                            27500099
   OTHERWISE                                                            27510099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#014');                    27520099
 END;                                                                   27530099
                                                                        27540099
 END R418_END_MES_ON_ORDER;                                             27550099
                                                                        27560099
1/********************************************************************/ 27570099
 /*                                                                  */ 27580099
 /* MODULE NAME      : R502_TRANS_TPMNT                              */ 27590099
 /*                                                                  */ 27600099
 /* DESCRIPTION      : TRANSLATE TYPE_OF_MAINT TO MACHINE STATUS     */ 27610099
 /*                                                                  */ 27620099
 /********************************************************************/ 27630099
 R502_TRANS_TPMNT : PROC    (TYPE_OF_MAINT)                             27640099
                    RETURNS (CHAR(01));                                 27650099
                                                                        27660099
 DCL TYPE_OF_MAINT  CHAR(01);                                           27670099
 DCL MA_ST          CHAR(01);                                           27680099
 DCL I              FIXED BIN(15);                                      27690099
                                                                        27700099
 MA_ST = '';                                                            27710099
                                                                        27720099
 DO I = 1 TO PARM_RCBP67S.NUMBER_OF_TPMNT;                              27730099
   IF TYPE_OF_MAINT = PARM_RCBP67S.TPMNT_TABLE.TYPE_MNT(I)              27740099
   THEN DO;                                                             27750099
     MA_ST = PARM_RCBP67S.TPMNT_TABLE.MA_ST(I);                         27760099
     I     = 999;                                                       27770099
   END;                                                                 27780099
 END;                                                                   27790099
                                                      /* SOC RB01298 */ 27800099
                                                      /* SOC RB01281 */ 27810099
 /*IF (SWITCH_FLEXIBLE_WARRANTY_BAU | SWITCH_FLEXIBLE_WARRANTY_PI)   */ 27820099
 /* THEN                                                             */ 27830099
 /*DO;                                                               */ 27840099
 /*IF F_WARRANTY_MA_STATUS                                           */ 27850099
 /*THEN                                                              */ 27860099
 /*  DO;                                                             */ 27870099
 /*   IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,1,1) */ 27880099
 /*   THEN                                                           */ 27890099
 /*      MA_ST = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,2,1);        */ 27900099
 /*   ELSE                                                           */ 27910099
 /*     DO;                                                          */ 27920099
 /*    IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,1,1)*/ 27930099
 /*      THEN                                                        */ 27940099
 /*      MA_ST = SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,2,1);        */ 27950099
 /*     END;                                                         */ 27960099
 /*  END;                                                            */ 27970099
 /*END;                                              /*  EOC RB01281 */ 27980099
 IF (SWITCH_FLEXIBLE_WARRANTY_BAU | SWITCH_HB_PI |                      27990099
     SWITCH_HARDBUNDLE_BAU |SWITCH_FW_PI)                               28000099
    THEN DO;                                                            28010099
       IF SWITCH_MA_ST_COUNTRY = TRUE                                   28020099
          THEN DO I = 1 TO PARM_RCBP71S.NUMBER_OF_TPMNT;                28030099
                IF TYPE_OF_MAINT = PARM_RCBP71S.TPMNT_TABLE.TYPE_MNT(I) 28040099
                   THEN DO;                                             28050099
                       MA_ST = PARM_RCBP71S.TPMNT_TABLE.MA_ST(I);       28060099
                       I     = 999;                                     28070099
                        END;                                            28080099
               END;                                                     28090099
     END;                                                               28100099
                                                      /* EOC RB01298 */ 28110099
 RETURN(MA_ST);                                                         28120099
                                                                        28130099
 END R502_TRANS_TPMNT;                                                  28140099
                                                                        28150099
1/********************************************************************/ 28160099
 /*                                                                  */ 28170099
 /* MODULE NAME      : R504_TRANS_DATE                               */ 28180099
 /*                                                                  */ 28190099
 /* DESCRIPTION      : TRANSLATE DB2 DATE FORMAT TO EXTRACT FILE     */ 28200099
 /*                    DATE FORMAT WITH RESPECT FOR OPEN END DATES   */ 28210099
 /*                                                                  */ 28220099
 /********************************************************************/ 28230099
 R504_TRANS_DATE: PROC    (DB2_DATE_IN)                                 28240099
                  RETURNS (CHAR(06));                                   28250099
                                                                        28260099
 DCL DB2_DATE_IN  CHAR(10);                                             28270099
                                                                        28280099
 IF DB2_DATE_IN = WRK_OPEN_DATE_CH10                                    28290099
 THEN                                                                   28300099
   RETURN(WRK_OPEN_DATE_CH6);                                           28310099
 ELSE                                                                   28320099
   RETURN(TRANSLATE('YRMNDA',DB2_DATE_IN ,'CEYR-MN-DA'));               28330099
                                                                        28340099
 END R504_TRANS_DATE;                                                   28350099
                                                                        28360099
1/*********************************************************************/28370099
 /*                                                                   */28380099
 /* MODULE NAME      :  R506_TRANS_ATO                                */28390099
 /*                                                                   */28400099
 /* DESCRIPTION      : TRANSLATE AGREEMENT TYPE/OPTION INTO TYPE OF   */28410099
 /*                    MAINTENANCE AND SERVICE TYPE                   */28420099
 /*                                                                   */28430099
 /*********************************************************************/28440099
 R506_TRANS_ATO: PROC (AGREEMENT_TYPE,                                  28450099
                       AGREEMENT_OPTION,                                28460099
                       TYPE_OF_MAINT,                                   28470099
                       SERVICE_TYPE);                                   28480099
                                                                        28490099
 DCL AGREEMENT_TYPE   CHAR (2);                                         28500099
 DCL AGREEMENT_OPTION CHAR (1);                                         28510099
 DCL TYPE_OF_MAINT    CHAR (1);                                         28520099
 DCL SERVICE_TYPE     CHAR (1);                                         28530099
                                                                        28540099
 TB_RCBV610                  = '';                                      28550099
 TB_RCBV610_I                = '';                                      28560099
 TB_RCBV610.COUNTRY_NUMBER   = WRK_CTRYNO;                              28570099
 TB_RCBV610.AGREEMENT_TYPE   = AGREEMENT_TYPE;                          28580099
 TB_RCBV610.AGREEMENT_OPTION = AGREEMENT_OPTION;                        28590099
                                                                        28600099
 CALL RCBI61M (ADDR(TB_RCBV610),                                        28610099
               ADDR(TB_RCBV610_I),                                      28620099
               ADDR(RETURN_AREA_BB),                                    28630099
               PTR_INT_AREA);                                           28640099
                                                                        28650099
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   28660099
   WHEN (0) DO;                                                         28670099
     TYPE_OF_MAINT = TB_RCBV610.TYPE_OF_MAINT;                          28680099
     SERVICE_TYPE  = TB_RCBV610.SERVICE_TYPE;                           28690099
   END;                                                                 28700099
   WHEN (4) DO;                                                         28710099
     PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                              28720099
     PARM_INT_AREA.MESSAGE_NUMBER  = 'I061';                            28730099
     PARM_INT_AREA.MSG_VAR_CODES   = '';                                28740099
     PARM_INT_AREA.MSG_VAR_CODE_1  = 'HW';                              28750099
     PARM_INT_AREA.MSG_VAR_VALUE_1 = SK_CURRENT_HW.PRODUCT_TYPE         28760099
                                  || SK_CURRENT_HW.ORIGIN               28770099
                                  || SK_CURRENT_HW.SEQUENCE_NUMBER;     28780099
     PARM_INT_AREA.MSG_VAR_CODE_6  = 'AT';                              28790099
     PARM_INT_AREA.MSG_VAR_VALUE_6 = AGREEMENT_TYPE;                    28800099
     PARM_INT_AREA.MSG_VAR_CODE_7  = 'AO';                              28810099
     PARM_INT_AREA.MSG_VAR_VALUE_7 = AGREEMENT_OPTION;                  28820099
     CALL RCB0M1M (PTR_INT_AREA);                                       28830099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#015');                        28840099
   END;                                                                 28850099
   OTHERWISE                                                            28860099
     CALL RCBDQDM_ERROR (ADDR(RETURN_AREA_BB.RETURN_SQL),               28870099
                         'DB2','#016');                                 28880099
 END;                                                                   28890099
                                                                        28900099
 END R506_TRANS_ATO;                                                    28910099
                                                                        28920099
1/********************************************************************/ 28930099
 /*                                                                  */ 28940099
 /* MODULE NAME      : R508_SERV_DIV                                 */ 28950099
 /*                                                                  */ 28960099
 /* DESCRIPTION      : CALCULATE BUSINESS UNIT DEVISION DEPENDING ON */ 28970099
 /*                    THE CUSTOMER NUMBER                           */ 28980099
 /*                                                                  */ 28990099
 /********************************************************************/ 29000099
 R508_SERV_DIV:     PROC    (CUSTOMER_NUMBER)                           29010099
                    RETURNS (CHAR(01));                                 29020099
                                                                        29030099
 DCL CUSTOMER_NUMBER   CHAR (08);                                       29040099
 DCL SERV_DIV          CHAR (01);                                       29050099
 DCL I                 FIXED BIN(15);                                   29060099
                                                                        29070099
 IF SUBSTR(CUSTOMER_NUMBER,3,2) ¬= '99'                                 29080099
 THEN                                                                   29090099
   SERV_DIV = '2';                                                      29100099
 ELSE DO;                                                               29110099
   DO I = 1 TO PARM_RCBP68S.NUMBER_OF_OCC;                              29120099
     IF SUBSTR(CUSTOMER_NUMBER,5,1) =                                   29130099
                        PARM_RCBP68S.CUNO_TABLE.CUNO_POS_5(I)           29140099
     THEN DO;                                                           29150099
       SERV_DIV = PARM_RCBP68S.CUNO_TABLE.SERV_DIV(I);                  29160099
       I        = 999;                                                  29170099
     END;                                                               29180099
   END;                                                                 29190099
 END;                                                                   29200099
                                                                        29210099
 RETURN(SERV_DIV);                                                      29220099
                                                                        29230099
 END R508_SERV_DIV;                                                     29240099
                                                                        29250099
1/********************************************************************/ 29260099
 /*                                                                  */ 29270099
 /* MODULE NAME      : R512_GET_CONTRACT_NUMBER                      */ 29280099
 /*                                                                  */ 29290099
 /* DESCRIPTION      : RETRIEVES CONTRACT NUMBER FROM RCBV0240_SERV_ */ 29300099
 /*                    CTR BASED ON TOS                              */ 29310099
 /*                                                    SOC RB01290   */ 29320099
 /********************************************************************/ 29330099
 R512_GET_CONTRACT_NUMBER: PROC;                                        29340099
                                                                        29350099
 WRK_CONTRACT_NUMBER = '';                                              29360099
 WRK_CONTRACT_NUMBER_INDNULL = 0;                                       29370099
 IF WRK_REAL_BAU_INDNULL = -1 THEN                    /* SOC RB01320 */ 29380099
 DO;                                                                    29390099
   WRK_ORIGIN = CURSOR_HW_I_V300.ORIGIN;                                29400099
   WRK_SEQ_NO = CURSOR_HW_I_V300.SEQUENCE_NUMBER;                       29410099
 END;                                                                   29420099
 ELSE                                                                   29430099
 DO;                                                                    29440099
   WRK_ORIGIN = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,1,2);                    29450099
   WRK_SEQ_NO = SUBSTR(WRK_REAL_SERIAL_NUM_BAU,3);                      29460099
 END;                                                 /* EOC RB01320 */ 29470099
 EXEC SQL                                                               29480099
    SELECT  CONTRACT_NUMBER                                             29490099
      INTO : WRK_CONTRACT_NUMBER :WRK_CONTRACT_NUMBER_INDNULL           29500099
      FROM  RCBV0240_SERV_CTR                                           29510099
    WHERE PRODUCT_TYPE        = :CURSOR_HW_I_V300.PRODUCT_TYPE          29520099
                                                       /* SOC RB01320 */29530099
    /*AND ORIGIN              = :CURSOR_HW_I_V300.ORIGIN                29540099
      AND SEQUENCE_NUMBER     = :CURSOR_HW_I_V300.SEQUENCE_NUMBER*/     29550099
      AND ORIGIN              = :WRK_ORIGIN                             29560099
      AND SEQUENCE_NUMBER     = :WRK_SEQ_NO                             29570099
                                                       /* EOC RB01320 */29580099
      AND COUNTRY_NUMBER      = :WRK_CTRYNO                             29590099
      AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE             29600099
    ;                                                                   29610099
 SELECT(SQLCODE);                                                       29620099
   WHEN (0);                                                            29630099
   WHEN (100) DO;                                                       29640099
    PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                      29650099
    PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0186';                    29660099
    PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                       29670099
    CALL RCB0M1M (PTR_INT_AREA);                                        29680099
    CALL RCBDQDM_ERROR (NULL,'OTHER','#067');                           29690099
   END;                                                                 29700099
   OTHERWISE                                                            29710099
    DO;                                                                 29720099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#068');                    29730099
    END;                                                                29740099
 END;                                                                   29750099
                                                                        29760099
 END R512_GET_CONTRACT_NUMBER;                        /* EOC RB01290 */ 29770099
1/********************************************************************/ 29780099
 /*                                                                  */ 29790099
 /* MODULE NAME      : R514_GET_TYPE_OF_CONTRACT                     */ 29800099
 /*                                                                  */ 29810099
 /* DESCRIPTION      : RETRIEVES TYPE_OF_CONTRACT FROM               */ 29820099
 /*                    RCBV0030_CONTRACT BASED ON CONTRACT NUMBER    */ 29830099
 /*                    RETRIEVED FROM RCBV0240_SERV_CTR              */ 29840099
 /*                                                     SOC RB01290  */ 29850099
 /********************************************************************/ 29860099
 R514_GET_TYPE_OF_CONTRACT: PROC;                                       29870099
                                                                        29880099
 WRK_TYPE_OF_CONTRACT = '';                                             29890099
 WRK_TYPE_OF_CONTRACT_INDNULL = 0;                                      29900099
 EXEC SQL                                                               29910099
   SELECT  TYPE_OF_CONTRACT                                             29920099
      INTO :WRK_TYPE_OF_CONTRACT :WRK_TYPE_OF_CONTRACT_INDNULL          29930099
      FROM  RCBV0030_CONTRACT                                           29940099
   WHERE  COUNTRY_NUMBER  = :WRK_CTRYNO                                 29950099
     AND  CONTRACT_NUMBER = :WRK_CONTRACT_NUMBER                        29960099
   ;                                                                    29970099
 SELECT(SQLCODE);                                                       29980099
   WHEN (0);                                                            29990099
   WHEN (100);                                                          30000099
   OTHERWISE                                                            30010099
    DO;                                                                 30020099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#069');                    30030099
    END;                                                                30040099
 END;                                                                   30050099
 END R514_GET_TYPE_OF_CONTRACT;                       /* EOC RB01290 */ 30060099
1/********************************************************************/ 30070099
 /*                                                                  */ 30080099
 /* MODULE NAME      : R516_GET_RCB070                               */ 30090099
 /*                                                                  */ 30100099
 /* DESCRIPTION      : RETRIEVES RCB070 PARAMETER FROM               */ 30110099
 /*                    RCBV0500_PARM BASED TYPE OF CONTRACT          */ 30120099
 /*                    RETRIEVED FROM RCBV0030_CONTRACT              */ 30130099
 /*                                                    SOC RB01290   */ 30140099
 /********************************************************************/ 30150099
 R516_GET_RCB070:PROC;                                                  30160099
 TB_RCBV500          = '';                                              30170099
 TB_RCBV500_I        = '';                                              30180099
 TB_RCBP70S.NUMBER   = 'RCB070';                                        30190099
 TB_RCBP70S.CTRYNO   = WRK_CTRYNO;                                      30200099
 TB_RCBP70S.TYPE_OF_CONTRACT = WRK_TYPE_OF_CONTRACT;                    30210099
                                                                        30220099
 CALL RCBI50M ('U',                                                     30230099
               ADDR(TB_RCBV500),                                        30240099
               ADDR(TB_RCBV500_I),                                      30250099
               PTR_RETURN_AREA_BB,                                      30260099
               PTR_INT_AREA);                                           30270099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    30280099
   WHEN (0) DO;                                                         30290099
     PARM_RCBP70S = TB_RCBP70S, BY NAME;                                30300099
     IF (PARM_RCBP70S.TOM_INTERNAL_CONTRACT ¬= '') THEN   /* RB01320 */ 30310099
     SWITCH_INTERNAL_CTR =  TRUE ;                                      30320099
   END;                                                                 30330099
   WHEN (4)                                        /* NO PARM FOUND */  30340099
     SWITCH_INTERNAL_CTR =  FALSE ;                                     30350099
   OTHERWISE                                                            30360099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              30370099
                         'DB2','#070');                                 30380099
 END;                                                                   30390099
                                                                        30400099
 END R516_GET_RCB070;                                /* EOC RB01290 */  30410099
1/*********************************************************************/30420099
 /*                                                                   */30430099
 /* MODULE NAME      :  R600_INIT_CURR_HW                             */30440099
 /*                                                                   */30450099
 /* DESCRIPTION      :                                                */30460099
 /*                                                                   */30470099
 /*********************************************************************/30480099
 R600_INIT_CURR_HW: PROC;                                               30490099
                                                      /* SOC RB01237 */ 30500099
 SWITCH_BAU        = FALSE;                                             30510099
 SWITCH_PI         = FALSE;                                             30520099
 SWITCH_HW_INST    = FALSE;                                             30530099
 SWITCH_HW_ORDR    = FALSE;                                             30540099
 FILE_RCBDQD1      = '';                                                30550099
 USER_FILE_RCBDQD1 = '';                                                30560099
 USER_FILE_BAU     = '';                                                30570099
 USER_FILE_PI      = '';                                                30580099
                                       /* DETERMINE SMALLEST KEY     */ 30590099
 IF SK_HW_I_1 < SK_HW_O_1                                               30600099
 THEN DO;                                                               30610099
   IF SK_HW_I_1 < SK_HW_PI_1 THEN      /* INST. HW SMALLEST KEY      */ 30620099
     SK_CURRENT_HW = SK_HW_I;                                           30630099
   ELSE                                                                 30640099
     SK_CURRENT_HW = SK_HW_PI;         /* PI HW SMALLEST KEY         */ 30650099
 END;                                                                   30660099
 ELSE DO;                                                               30670099
   IF SK_HW_O_1 < SK_HW_I_1                                             30680099
   THEN DO;                                                             30690099
     IF SK_HW_O_1 < SK_HW_PI_1 THEN                                     30700099
       SK_CURRENT_HW = SK_HW_O;        /* ON-ORDER HW SMALLEST KEY   */ 30710099
     ELSE                                                               30720099
       SK_CURRENT_HW = SK_HW_PI;       /* PI HW SMALLEST KEY         */ 30730099
   END;                                                                 30740099
   ELSE DO;                            /* INST. AND ON-ORDER SAME KEY*/ 30750099
     IF SK_HW_PI_1 < SK_HW_I_1 THEN                                     30760099
       SK_CURRENT_HW = SK_HW_PI;       /* PI HW SMALLEST KEY         */ 30770099
     ELSE                                                               30780099
       SK_CURRENT_HW = SK_HW_I;        /* INST/ON-ORDER SMALLEST KEY */ 30790099
   END;                                                                 30800099
 END;                                                                   30810099
                                                      /* EOC RB01237 */ 30820099
                                  /* RETRIEVE ADDITIONAL PO INFO     */ 30830099
 TB_RCBV400 = '';                                                       30840099
                                  /* PTM1217: ADD WRK_INDNULL        */ 30850099
 EXEC SQL                                                               30860099
   SELECT MACHINE_CATEGORY                                              30870099
     INTO :TB_RCBV400.MACHINE_CATEGORY   :WRK_INDNULL                   30880099
     FROM RCBV0400_PO_MOD1                                              30890099
    WHERE COUNTRY_NUMBER        = :WRK_CTRYNO                           30900099
      AND PRODUCT_TYPE          = :SK_CURRENT_HW.PRODUCT_TYPE           30910099
      AND MODEL_NUMBER          = :SK_CURRENT_HW.MODEL_NUMBER           30920099
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        30930099
                              AND END_DATE                              30940099
 ;                                                                      30950099
 SELECT (SQLCODE);                                                      30960099
   WHEN (0);                                                            30970099
   WHEN (100);                                                          30980099
   OTHERWISE                                                            30990099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#017');                    31000099
 END;                                                                   31010099
                                                                        31020099
 /*------------------ START RC01141 CHANGES -------------------------*/ 31030099
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_CURRENT_HW);                    31040099
 /*-------------------- END RC01141 CHANGES -------------------------*/ 31050099
                                                                        31060099
 END R600_INIT_CURR_HW;                                                 31070099
                                                                        31080099
1/********************************************************************/ 31090099
 /*                                                      SOC RB01237 */ 31100099
 /* MODULE NAME      :  R620_PROC_USER_EXIT2                         */ 31110099
 /*                                                                  */ 31120099
 /* DESCRIPTION      : INVOKE USER EXIT ROUTINE RCBDQ2U              */ 31130099
 /*                                                                  */ 31140099
 /********************************************************************/ 31150099
 R620_PROC_USER_EXIT2: PROC;                                            31160099
                                                                        31170099
 IF SWITCH_USER_EXIT2 = TRUE                                            31180099
 THEN DO;                                                               31190099
   WRK_SAVE.PRODUCT_TYPE    = FILE_RCBDQD1.PRODUCT_TYPE;                31200099
   WRK_SAVE.ORIGIN          = FILE_RCBDQD1.ORIGIN;                      31210099
   WRK_SAVE.SEQUENCE_NUMBER = FILE_RCBDQD1.SEQUENCE_NUMBER;             31220099
                                                                        31230099
   USER_FILE_RCBDQD1 = FILE_RCBDQD1, BY NAME;                           31240099
                                                                        31250099
   IF DATA_ORIGIN = '2'                                                 31260099
   THEN DO;                                                             31270099
                                                                        31280099
                /*****************************************************/ 31290099
                /* PREFER PI IF BAU HAS STATUS 3 AND PI NOT          */ 31300099
                /*****************************************************/ 31310099
     IF VERIFY(USER_FILE_RCBDQD1.TYPE_MNT,                              31320099
                  WRK_TPMNT_VAL.TPMNT_ST3) = '0'                        31330099
     THEN DO;                                                           31340099
       IF VERIFY(USER_FILE_PI.TYPE_MNT,                                 31350099
               WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0'                          31360099
       THEN                                                             31370099
         USER_FILE_RCBDQD1= USER_FILE_PI, BY NAME ;                     31380099
     END;                                                               31390099
     ELSE DO;                                                           31400099
                /*****************************************************/ 31410099
                /* PREFER PI IF BAU HAS WARRANTY AND PI A CONTRACT   */ 31420099
                /*****************************************************/ 31430099
       IF (VERIFY(USER_FILE_RCBDQD1.TYPE_MNT,                           31440099
                    WRK_TPMNT_VAL.TPMNT_WAR) = '0' |                    31450099
          VERIFY(USER_FILE_RCBDQD1.TYPE_MNT,           /* SOC RB01281 */31460099
          SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,1,1)) = '0')           31470099
       THEN DO;                                        /* EOC RB01281 */31480099
         IF WRK_SAV_CONTR_NR ¬= ''                                      31490099
         THEN                                                           31500099
           USER_FILE_RCBDQD1 = USER_FILE_PI, BY NAME ;                  31510099
       END;                                                             31520099
     END;                                                               31530099
                                                                        31540099
     IF SUBSTR(FILE_RCBDQD1.CUST_NO,1,2) = 'CI'                         31550099
     THEN DO;                                                           31560099
       USER_FILE_RCBDQD1.CUST_NO = USER_FILE_BAU.CUST_NO;               31570099
     END;                                                               31580099
   END;                                                                 31590099
                                                                        31600099
   CALL RCBDQ2U (ADDR(SWITCH_USER_EXIT2)                                31610099
                ,ADDR(DATA_ORIGIN)                                      31620099
                ,ADDR(USER_FILE_RCBDQD1)                                31630099
                ,ADDR(USER_FILE_PI)                                     31640099
                ,ADDR(USER_FILE_BAU)                                    31650099
                ,PTR_INT_AREA);                                         31660099
                                                                        31670099
   IF SWITCH_USER_EXIT2 = TRUE                                          31680099
   THEN DO;                                                             31690099
     FILE_RCBDQD1 = USER_FILE_RCBDQD1, BY NAME;                         31700099
                       /* THE TOS IS NOT ALLOWED TO BE OVERWRITTEN ! */ 31710099
     FILE_RCBDQD1.CTRYNO          = WRK_CTRYNO;                         31720099
     FILE_RCBDQD1.PRODUCT_TYPE    = WRK_SAVE.PRODUCT_TYPE;              31730099
     FILE_RCBDQD1.ORIGIN          = WRK_SAVE.ORIGIN;                    31740099
     FILE_RCBDQD1.SEQUENCE_NUMBER = WRK_SAVE.SEQUENCE_NUMBER;           31750099
     FILE_RCBDQD1.MA_TYPE         = WRK_SAVE.PRODUCT_TYPE;              31760099
     FILE_RCBDQD1.MA_ORIGIN       = WRK_SAVE.ORIGIN;                    31770099
     FILE_RCBDQD1.MA_SER_NO       = WRK_SAVE.SEQUENCE_NUMBER;           31780099
   END;                                                                 31790099
 END;                                                                   31800099
                                                                        31810099
 END R620_PROC_USER_EXIT2;                                              31820099
                                                      /* EOC RB01237 */ 31830099
1/********************************************************************/ 31840099
 /*                                                      SOC RB01237 */ 31850099
 /* MODULE NAME      :  R699_END_CURR_HW                             */ 31860099
 /*                                                                  */ 31870099
 /* DESCRIPTION      : END PROCESSING FOR CURRENT HW KEY             */ 31880099
 /*                                                                  */ 31890099
 /********************************************************************/ 31900099
 R699_END_CURR_HW: PROC;                                                31910099
                                                                        31920099
 IF SWITCH_BAU = TRUE                                                   31930099
 THEN DO;                                                               31940099
   IF SWITCH_PI = TRUE                                                  31950099
   THEN DO;                             /* BOTH BAU AND PI AVAILABLE */ 31960099
                                                                        31970099
 /*  IF USER_FILE_PI.CUST_NO = ''     /* ONLY T241 ENTRY*//* RB01289 */ 31980099
 /*    USER_FILE_PI.CUST_NO   = FILE_RCBDQD1.CUST_NO;     /* RB01289 */ 31990099
     IF (WRK_PI_ORIGIN_TEMP = 'T241')                 /* SOC RB01289 */ 32000099
     THEN DO;                                                           32010099
       IF USER_FILE_PI.CUST_NO = '' THEN DO;                            32020099
         USER_FILE_PI.CUST_NO  = FILE_RCBDQD1.CUST_NO;                  32030099
       END;                                           /* EOC RB01289 */ 32040099
       USER_FILE_PI.MABO      = FILE_RCBDQD1.MABO;                      32050099
       USER_FILE_PI.MA_MODEL  = FILE_RCBDQD1.MA_MODEL;                  32060099
       USER_FILE_PI.INST_DATE = FILE_RCBDQD1.INST_DATE;                 32070099
     END;                                                               32080099
                                                                        32090099
     DATA_ORIGIN   = '2';               /* ORIGIN OF DATA: BOTH      */ 32100099
     USER_FILE_BAU = FILE_RCBDQD1, BY NAME;                             32110099
                                                                        32120099
     CALL R620_PROC_USER_EXIT2;                                         32130099
     CALL R300_WRITE_RCBDQD1;                                           32140099
                                                                        32150099
   END;                                                                 32160099
   ELSE DO;                             /* ONLY BAU AVAILABLE        */ 32170099
                                                                        32180099
     DATA_ORIGIN   = '0';               /* ORIGIN OF DATA: BAU CEDS  */ 32190099
     USER_FILE_PI  = '';                                                32200099
     USER_FILE_BAU = FILE_RCBDQD1, BY NAME;                             32210099
                                                                        32220099
     CALL R620_PROC_USER_EXIT2;                                         32230099
     CALL R300_WRITE_RCBDQD1;                                           32240099
     CALL R400_PROC_MES;                                                32250099
                                                                        32260099
   END;                                                                 32270099
 END;                                                                   32280099
 ELSE DO;                                                               32290099
                                                       /* SOC RB01289 */32300099
   IF ((SWITCH_PI          = TRUE) &     /* ONLY PI AVAILABLE         */32310099
                                                       /* SOC RB01320 */32320099
   /* ((WRK_PI_ORIGIN_TEMP = 'BOTH') | (WRK_PI_ORIGIN_TEMP = 'T051')))*/32330099
      ((WRK_PI_ORIGIN_TEMP = 'BOTH') | (WRK_PI_ORIGIN_TEMP = 'T051') |  32340099
       (WRK_PI_ORIGIN_TEMP = 'T241')))                 /* EOC RB01320 */32350099
 /* & USER_FILE_PI.CUST_NO ¬= ''         /* T051 ENTRY PRESENT*/        32360099
                                                       /* EOC RB01289 */32370099
   THEN DO;                                                             32380099
                                                                        32390099
     DATA_ORIGIN   = '1';             /* ORIGIN OF DATA: PRIME INPUT */ 32400099
     FILE_RCBDQD1  = USER_FILE_PI, BY NAME;                             32410099
     USER_FILE_BAU = '';                                                32420099
                                                                        32430099
     CALL R620_PROC_USER_EXIT2;                                         32440099
     CALL R300_WRITE_RCBDQD1;                                           32450099
                                                                        32460099
   END;                                                                 32470099
 END;                                                                   32480099
 END R699_END_CURR_HW;                                                  32490099
                                                      /* EOC RB01237 */ 32500099
1/********************************************************************/ 32510099
 /*                                                                  */ 32520099
 /* MODULE NAME      : R700_INIT_COUNTRY                             */ 32530099
 /*                                                                  */ 32540099
 /* DESCRIPTION      : OPEN AND INTITIAL FETCH CURSORS               */ 32550099
 /*                                                                  */ 32560099
 /********************************************************************/ 32570099
 R700_INIT_COUNTRY:    PROC;                                            32580099
                                                      /* SOC RB01237 */ 32590099
 /* SWITCH_USER_EXIT  = FALSE;                          CEDS00000415 */ 32600099
 /* SWITCH_USER_EXIT2 = FALSE;                          CEDS00000415 */ 32610099
                                                      /* EOC RB01237 */ 32620099
 SWITCH_MA_ST_COUNTRY = FALSE;                            /* RB01298 */ 32630099
                                  /* FILL CURRENT COUNTRY            */ 32640099
 WRK_PROC_ID     = COUNTRY_AREA.PROC_ID;                                32650099
 WRK_CTRYNO      = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).CTRYNO;       32660099
 WRK_PGR_TYPE    = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).PGR_TYPE;     32670099
 WRK_CNT_COUNTRY = 0;                                                   32680099
 PARM_RCB005             = '';                        /* SOC RB01320 */ 32690099
 SWITCH_EOC_CURSOR_HW_O  = FALSE;                                       32700099
 SWITCH_EOC_CURSOR_HW_I  = FALSE;                                       32710099
 SWITCH_EOC_CURSOR_HW_PI = FALSE;                                       32720099
 SWITCH_EOC_CURSOR_MES_I = FALSE;                     /* EOC RB01320 */ 32730099
                                                /* LOCK TABLES       */ 32740099
 CALL R702_LOCK_TABLES;                                                 32750099
                                                                        32760099
                                                /* RETRIEVE RUN DATE */ 32770099
 RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                       32780099
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 32790099
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               32800099
                                                                        32810099
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       32820099
               PTR_INT_AREA);                                           32830099
                                                                        32840099
 IF RUN_DATE_AREA.RUN_DATE = ''       /* NO RUN DATE RCB001 FOUND    */ 32850099
 THEN                                                                   32860099
   WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                            32870099
 ELSE                                                                   32880099
   WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                               32890099
                                                                        32900099
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           32910099
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 32920099
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               32930099
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   32940099
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 32950099
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         32960099
 CALL RCB0M1M (PTR_INT_AREA);                                           32970099
                                                      /* SOC RB01237 */ 32980099
 TB_RCBV500          = '';                  /* RETRIEVE EXTRACT PARM */ 32990099
 TB_RCBV500_I        = '';                                              33000099
 TB_RCBP05S.NUMBER   = 'RCB005';                                        33010099
 TB_RCBP05S.CTRYNO   = WRK_CTRYNO;                                      33020099
 TB_RCBP05S.PGR_TYPE = WRK_PGR_TYPE;                                    33030099
                                                                        33040099
 CALL RCBI50M ('U',                                                     33050099
               ADDR(TB_RCBV500),                                        33060099
               ADDR(TB_RCBV500_I),                                      33070099
               PTR_RETURN_AREA_BB,                                      33080099
               PTR_INT_AREA);                                           33090099
                                                                        33100099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    33110099
   WHEN (0)                                                             33120099
     PARM_RCB005 = TB_RCBP05S, BY NAME;                                 33130099
   WHEN (4)                               /* NO EXTRACT PARM FOUND   */ 33140099
     PARM_RCB005.PI_TO_CEREOLS = 'N';                                   33150099
   OTHERWISE                                                            33160099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              33170099
                         'DB2','#018');                                 33180099
 END;                                                                   33190099
 IF PARM_RCB005.PI_TO_CEREOLS = 'Y'    /* PRIME INPUT IN INTERFACE ? */ 33200099
 THEN DO;                                                               33210099
   EXEC SQL                              /* INIT CURSOR CURSOR_HW_PI */ 33220099
     OPEN CURSOR_HW_PI;                                                 33230099
                                                                        33240099
   SELECT (SQLCODE);                                                    33250099
     WHEN (0);                                                          33260099
     OTHERWISE                                                          33270099
       CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#019');                  33280099
   END;                                                                 33290099
                            /* FETCH FIRST OCCURENCE OF CURSOR_HW_PI */ 33300099
   CALL R224_FETCH_CURSOR_HW_PI;                                        33310099
 END;                                                                   33320099
 ELSE DO;                                /* NO PRIME INPUT           */ 33330099
   SWITCH_EOC_CURSOR_HW_PI = TRUE;                                      33340099
   SK_HW_PI.EOF            = '1';                                       33350099
 END;                                                                   33360099
                                                      /* EOC RB01237 */ 33370099
                                                    /* SOC : RB01281 */ 33380099
                                        /* RETRIEVE PARAMETER RCB064 */ 33390099
 /* GET MA_STATUS FROM RCB064 AT COUNTRY LEVEL THAT WILL BE  */         33400099
 /* APPLIED FOR FLEXIBLE WARRANTY MACHINES OF THAT COUNTRY   */         33410099
                                                      /* SOC RB01320 */ 33420099
 /* GET TOM/TOW FROM RCB064 AT COUNTRY LEVEL THAT WILL BE APPLIED    */ 33430099
 /* FOR FLEXIBLE WARRANTY AND HARDBUNDLE MACHINES OF THAT COUNTRY    */ 33440099
                                                      /* EOC RB01320 */ 33450099
 TB_RCBV500                 = '';                                       33460099
 TB_RCBV500_I               = '';                                       33470099
 TB_RCBP64S.NUMBER          = 'RCB064';                                 33480099
 TB_RCBP64S.CTRYNO          = WRK_CTRYNO;                               33490099
                                                                        33500099
 CALL RCBI50M ('U',                                                     33510099
               ADDR (TB_RCBV500),                                       33520099
               ADDR (TB_RCBV500_I),                                     33530099
               PTR_RETURN_AREA_BB,                                      33540099
               PTR_INT_AREA);                                           33550099
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   33560099
   WHEN(0)                                                              33570099
     DO;                                                                33580099
      PARM_RCBP64S = TB_RCBP64S, BY NAME;                               33590099
                                                      /* SOC RB01298 */ 33600099
     /* IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1) ¬= ' ' |           */ 33610099
     /*    F_WARRANTY_MA_STATUS_GEO THEN                             */ 33620099
     /*    F_WARRANTY_MA_STATUS                    = TRUE;           */ 33630099
      WRK_FWTOW = PARM_RCBP64S.F_WARRANTY_MACHINE;                      33640099
      WRK_HBTOM = PARM_RCBP64S.HARDBUNDLE;            /* EOC RB01298 */ 33650099
     END;                                                               33660099
   WHEN(4)                                                              33670099
     DO;                                                                33680099
     /* IF F_WARRANTY_MA_STATUS_GEO THEN                 SOC RB01298 */ 33690099
     /*    F_WARRANTY_MA_STATUS                    = TRUE;           */ 33700099
       WRK_FWTOW = PARM_RCBP63S.F_WARRANTY_MACHINE;                     33710099
       WRK_HBTOM = PARM_RCBP63S.HARDBUNDLE;           /* EOC RB01298 */ 33720099
     END;                                                               33730099
   OTHERWISE;                                             /* RB01320 */ 33740099
 END;                                                                   33750099
                                                    /* EOC : RB01281 */ 33760099
                                                      /* SOC RB01320 */ 33770099
                                     /* RETRIEVE PARAMETER RCB071    */ 33780099
 /* GET MA_STATUS FROM RCB071 AT COUNTRY LEVEL FOR FLEXIBLE WARRANTY */ 33790099
 /* OR HARDBUNDLE MACHINES                                           */ 33800099
                                                      /* EOC RB01320 */ 33810099
                                                      /* SOC RB01298 */ 33820099
 TB_RCBV500                 = '';                                       33830099
 TB_RCBV500_I               = '';                                       33840099
 TB_RCBP71S.NUMBER          = 'RCB071';                                 33850099
 TB_RCBP71S.CTRYNO          = WRK_CTRYNO;                               33860099
                                                                        33870099
 CALL RCBI50M ('U',                                                     33880099
               ADDR (TB_RCBV500),                                       33890099
               ADDR (TB_RCBV500_I),                                     33900099
               PTR_RETURN_AREA_BB,                                      33910099
               PTR_INT_AREA);                                           33920099
                                                                        33930099
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   33940099
   WHEN(0)                                                              33950099
     DO;                                                                33960099
      PARM_RCBP71S = TB_RCBP71S, BY NAME;                               33970099
      IF SUBSTR (TB_RCBV500.PARAMETER_VALUE, 2, 1) ¬= ' ' THEN          33980099
              SWITCH_MA_ST_COUNTRY = TRUE;                              33990099
     END;                                                               34000099
   OTHERWISE                                                            34010099
              SWITCH_MA_ST_COUNTRY = FALSE;                             34020099
 END;                                                                   34030099
                                                      /* EOC RB01298 */ 34040099
                                         /* INIT CURSOR CURSOR_HW_I  */ 34050099
 EXEC SQL                                                               34060099
   OPEN CURSOR_HW_I;                                                    34070099
                                                                        34080099
 SELECT (SQLCODE);                                                      34090099
   WHEN (0);                                                            34100099
   OTHERWISE                                                            34110099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#020');                    34120099
 END;                                                                   34130099
                             /* FETCH FIRST OCCURENCE OF CURSOR_HW_I */ 34140099
 CALL R204_FETCH_CURSOR_HW_I;                                           34150099
                                         /* INIT CURSOR CURSOR_HW_O  */ 34160099
 EXEC SQL                                                               34170099
   OPEN CURSOR_HW_O;                                                    34180099
                                                                        34190099
 SELECT (SQLCODE);                                                      34200099
   WHEN (0);                                                            34210099
   OTHERWISE                                                            34220099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#021');                    34230099
 END;                                                                   34240099
                             /* FETCH FIRST OCCURENCE OF CURSOR_HW_O */ 34250099
 CALL R214_FETCH_CURSOR_HW_O;                                           34260099
                                                      /* SOC RB01320 */ 34270099
                        /* RETRIEVE SERVICE ON BEHALF OF VENDOR PARM */ 34280099
 TB_RCBV500           = '';                                             34290099
 TB_RCBV500_I         = '';                                             34300099
 TB_RCBP103S.NUMBER   = 'RCB103';                                       34310099
 TB_RCBP103S.CTRYNO   = WRK_CTRYNO;                                     34320099
 TB_RCBP103S.PGR_TYPE = WRK_PGR_TYPE;                                   34330099
                                                                        34340099
 CALL RCBI50M ('U',                                                     34350099
               ADDR(TB_RCBV500),                                        34360099
               ADDR(TB_RCBV500_I),                                      34370099
               PTR_RETURN_AREA_BB,                                      34380099
               PTR_INT_AREA);                                           34390099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    34400099
   WHEN(0)                                                              34410099
     DO;                                                                34420099
       PARM_RCBP103S =  TB_RCBP103S, BY NAME;                           34430099
       IF PARM_RCBP103S.SRV_ON_BEHF_OF_VENDOR = 'Y' THEN                34440099
         SWITCH_VENDOR_SERVICE = TRUE;                                  34450099
       ELSE                                                             34460099
         SWITCH_VENDOR_SERVICE = FALSE;                                 34470099
     END;                                                               34480099
   WHEN(4)                                        /* NO RECORD FOUND */ 34490099
     DO;                                                                34500099
       SWITCH_VENDOR_SERVICE = FALSE;                                   34510099
     END;                                                               34520099
   OTHERWISE                                                            34530099
     DO;                                                                34540099
       CALL RCBDQDM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),              34550099
                          'DB2',                                        34560099
                          '#073');                                      34570099
     END;                                                               34580099
 END;                                                 /* EOC RB01320 */ 34590099
                                                                        34600099
 END R700_INIT_COUNTRY;                                                 34610099
                                                                        34620099
1/********************************************************************/ 34630099
 /*                                                                  */ 34640099
 /* MODULE NAME      : R702_LOCK_TABLES                              */ 34650099
 /*                                                                  */ 34660099
 /* DESCRIPTION      :                                               */ 34670099
 /*                                                                  */ 34680099
 /********************************************************************/ 34690099
 R702_LOCK_TABLES: PROC;                                                34700099
                                                                        34710099
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 34720099
                                                                        34730099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0030_CONTRACT';   /* SOC RB01290 */ 34740099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 34750099
                                                                        34760099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      34770099
               PTR_RETURN_AREA_BB,                                      34780099
               PTR_INT_AREA);                                           34790099
                                                                        34800099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    34810099
   WHEN (0);                                                            34820099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 34830099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#071');                        34840099
   OTHERWISE                                                            34850099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              34860099
                           'DB2','#072');                               34870099
 END;                                                                   34880099
                                                      /* EOC RB01290 */ 34890099
 /********************************************************************/ 34900099
                                                                        34910099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0040_OU';                           34920099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 34930099
                                                                        34940099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      34950099
               PTR_RETURN_AREA_BB,                                      34960099
               PTR_INT_AREA);                                           34970099
                                                                        34980099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    34990099
   WHEN (0);                                                            35000099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 35010099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#022');                        35020099
   OTHERWISE                                                            35030099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              35040099
                           'DB2','#023');                               35050099
 END;                                                                   35060099
                                                                        35070099
 /********************************************************************/ 35080099
                                                      /* SOC RB01237 */ 35090099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0051_PI_HW_PR';                     35100099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 35110099
                                                                        35120099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      35130099
               PTR_RETURN_AREA_BB,                                      35140099
               PTR_INT_AREA);                                           35150099
                                                                        35160099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    35170099
   WHEN (0);                                                            35180099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 35190099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#024');                        35200099
   OTHERWISE                                                            35210099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              35220099
                           'DB2','#025');                               35230099
 END;                                                                   35240099
                                                      /* EOC RB01237 */ 35250099
 /********************************************************************/ 35260099
                                                                        35270099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0110_HW_STATUS';                    35280099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 35290099
                                                                        35300099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      35310099
               PTR_RETURN_AREA_BB,                                      35320099
               PTR_INT_AREA);                                           35330099
                                                                        35340099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    35350099
   WHEN (0);                                                            35360099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 35370099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#026');                        35380099
   OTHERWISE                                                            35390099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              35400099
                           'DB2','#027');                               35410099
 END;                                                                   35420099
                                                                        35430099
 /********************************************************************/ 35440099
                                                                        35450099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0170_OU_HW';                        35460099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 35470099
                                                                        35480099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      35490099
               PTR_RETURN_AREA_BB,                                      35500099
               PTR_INT_AREA);                                           35510099
                                                                        35520099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    35530099
   WHEN (0);                                                            35540099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 35550099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#028');                        35560099
   OTHERWISE                                                            35570099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              35580099
                           'DB2','#029');                               35590099
 END;                                                                   35600099
                                                                        35610099
 /********************************************************************/ 35620099
                                                      /* SOC RB01320 */ 35630099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0125_DMMY_REAL';                    35640099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 35650099
                                                                        35660099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      35670099
               PTR_RETURN_AREA_BB,                                      35680099
               PTR_INT_AREA);                                           35690099
                                                                        35700099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    35710099
   WHEN (0);                                                            35720099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 35730099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#074');                        35740099
   OTHERWISE                                                            35750099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              35760099
                           'DB2','#075');                               35770099
 END;                                                                   35780099
                                                      /* EOC RB01320 */ 35790099
 /********************************************************************/ 35800099
                                                                        35810099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      35820099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 35830099
                                                                        35840099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      35850099
               PTR_RETURN_AREA_BB,                                      35860099
               PTR_INT_AREA);                                           35870099
                                                                        35880099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    35890099
   WHEN (0);                                                            35900099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 35910099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#030');                        35920099
   OTHERWISE                                                            35930099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              35940099
                           'DB2','#031');                               35950099
 END;                                                                   35960099
                                                                        35970099
 /********************************************************************/ 35980099
                                                                        35990099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0220_SUPPL_CTR';                    36000099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36010099
                                                                        36020099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36030099
               PTR_RETURN_AREA_BB,                                      36040099
               PTR_INT_AREA);                                           36050099
                                                                        36060099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36070099
   WHEN (0);                                                            36080099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36090099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#032');                        36100099
   OTHERWISE                                                            36110099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36120099
                           'DB2','#033');                               36130099
 END;                                                                   36140099
                                                                        36150099
 /********************************************************************/ 36160099
                                                                        36170099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0240_SERV_CTR';                     36180099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36190099
                                                                        36200099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36210099
               PTR_RETURN_AREA_BB,                                      36220099
               PTR_INT_AREA);                                           36230099
                                                                        36240099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36250099
   WHEN (0);                                                            36260099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36270099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#034');                        36280099
   OTHERWISE                                                            36290099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36300099
                           'DB2','#035');                               36310099
 END;                                                                   36320099
                                                      /* SOC RB01237 */ 36330099
 /********************************************************************/ 36340099
                                                                        36350099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0241_PI_CTR';                       36360099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36370099
                                                                        36380099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36390099
               PTR_RETURN_AREA_BB,                                      36400099
               PTR_INT_AREA);                                           36410099
                                                                        36420099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36430099
   WHEN (0);                                                            36440099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36450099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#036');                        36460099
   OTHERWISE                                                            36470099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36480099
                           'DB2','#037');                               36490099
 END;                                                                   36500099
                                                      /* EOC RB01237 */ 36510099
 /********************************************************************/ 36520099
                                                                        36530099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0250_MES_PR';                       36540099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36550099
                                                                        36560099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36570099
               PTR_RETURN_AREA_BB,                                      36580099
               PTR_INT_AREA);                                           36590099
                                                                        36600099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36610099
   WHEN (0);                                                            36620099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36630099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#038');                        36640099
   OTHERWISE                                                            36650099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36660099
                           'DB2','#039');                               36670099
 END;                                                                   36680099
                                                                        36690099
 /********************************************************************/ 36700099
                                                                        36710099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0260_HW_IN_ORD';                    36720099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36730099
                                                                        36740099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36750099
               PTR_RETURN_AREA_BB,                                      36760099
               PTR_INT_AREA);                                           36770099
                                                                        36780099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36790099
   WHEN (0);                                                            36800099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36810099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#040');                        36820099
   OTHERWISE                                                            36830099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              36840099
                           'DB2','#041');                               36850099
 END;                                                                   36860099
                                                                        36870099
 /********************************************************************/ 36880099
                                                                        36890099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0300_HW_REAL';                      36900099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 36910099
                                                                        36920099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      36930099
               PTR_RETURN_AREA_BB,                                      36940099
               PTR_INT_AREA);                                           36950099
                                                                        36960099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    36970099
   WHEN (0);                                                            36980099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 36990099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#042');                        37000099
   OTHERWISE                                                            37010099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37020099
                           'DB2','#043');                               37030099
 END;                                                                   37040099
                                                                        37050099
 /********************************************************************/ 37060099
                                                                        37070099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0330_MES_PO';                       37080099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37090099
                                                                        37100099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37110099
               PTR_RETURN_AREA_BB,                                      37120099
               PTR_INT_AREA);                                           37130099
                                                                        37140099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37150099
   WHEN (0);                                                            37160099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37170099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#044');                        37180099
   OTHERWISE                                                            37190099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37200099
                           'DB2','#045');                               37210099
 END;                                                                   37220099
                                                                        37230099
 /********************************************************************/ 37240099
                                                                        37250099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0380_HW_PR_MOD';                    37260099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37270099
                                                                        37280099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37290099
               PTR_RETURN_AREA_BB,                                      37300099
               PTR_INT_AREA);                                           37310099
                                                                        37320099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37330099
   WHEN (0);                                                            37340099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37350099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#046');                        37360099
   OTHERWISE                                                            37370099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37380099
                           'DB2','#047');                               37390099
 END;                                                                   37400099
                                                                        37410099
 /********************************************************************/ 37420099
                                                                        37430099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0400_PO_MOD1';                      37440099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37450099
                                                                        37460099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37470099
               PTR_RETURN_AREA_BB,                                      37480099
               PTR_INT_AREA);                                           37490099
                                                                        37500099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37510099
   WHEN (0);                                                            37520099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37530099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#048');                        37540099
   OTHERWISE                                                            37550099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37560099
                           'DB2','#049');                               37570099
 END;                                                                   37580099
                                                                        37590099
 /********************************************************************/ 37600099
                                                                        37610099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0610_TRANS_ATO';                    37620099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37630099
                                                                        37640099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37650099
               PTR_RETURN_AREA_BB,                                      37660099
               PTR_INT_AREA);                                           37670099
                                                                        37680099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37690099
   WHEN (0);                                                            37700099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37710099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#050');                        37720099
   OTHERWISE                                                            37730099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37740099
                           'DB2','#051');                               37750099
 END;                                                                   37760099
                                                                        37770099
 /********************************************************************/ 37780099
                                                                        37790099
 PARM_RCB024M.VIEW_NAME      = 'RCBT0725_PICOS_HW';                     37800099
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 37810099
                                                                        37820099
 CALL RCB024M (ADDR(PARM_RCB024M),                                      37830099
               PTR_RETURN_AREA_BB,                                      37840099
               PTR_INT_AREA);                                           37850099
                                                                        37860099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    37870099
   WHEN (0);                                                            37880099
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 37890099
     CALL RCBDQDM_ERROR (NULL, 'OTHER', '#052');                        37900099
   OTHERWISE                                                            37910099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              37920099
                           'DB2','#053');                               37930099
 END;                                                 /* EOC RC01219 */ 37940099
                                                                        37950099
 END R702_LOCK_TABLES;                                                  37960099
                                                                        37970099
1/*********************************************************************/37980099
 /*                                                                   */37990099
 /* MODULE NAME      :  R799_END_COUNTRY                              */38000099
 /*                                                                   */38010099
 /* DESCRIPTION      :                                                */38020099
 /*                                                                   */38030099
 /*********************************************************************/38040099
 R799_END_COUNTRY: PROC;                                                38050099
                                         /* CLOSE CURSOR CURSOR_HW_I */ 38060099
 EXEC SQL                                                               38070099
   CLOSE CURSOR_HW_I;                                                   38080099
                                                                        38090099
 SELECT (SQLCODE);                                                      38100099
   WHEN (0);                                                            38110099
   OTHERWISE                                                            38120099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#054');                    38130099
 END;                                                                   38140099
                                         /* CLOSE CURSOR CURSOR_HW_O */ 38150099
 EXEC SQL                                                               38160099
   CLOSE CURSOR_HW_O;                                                   38170099
                                                                        38180099
 SELECT (SQLCODE);                                                      38190099
   WHEN (0);                                                            38200099
   OTHERWISE                                                            38210099
     CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#055');                    38220099
 END;                                                                   38230099
                                                      /* SOC RB01237 */ 38240099
 IF PARM_RCB005.PI_TO_CEREOLS = 'Y'    /* PRIME INPUT IN INTERFACE ? */ 38250099
 THEN DO;                                                               38260099
   EXEC SQL                              /*CLOSE CURSOR CURSOR_HW_PI */ 38270099
     CLOSE CURSOR_HW_PI;                                                38280099
                                                                        38290099
   SELECT (SQLCODE);                                                    38300099
     WHEN (0);                                                          38310099
     OTHERWISE                                                          38320099
       CALL RCBDQDM_ERROR (ADDR (SQLCA),'DB2','#056');                  38330099
   END;                                                                 38340099
 END;                                                                   38350099
                                                      /* EOC RB01237 */ 38360099
                             /* WRITE COUNT MESSAGE FOR COUNTRY      */ 38370099
 PARM_INT_AREA.MESSAGE_TYPE         = 'IS';                             38380099
 PARM_INT_AREA.MESSAGE_NUMBER       = '0004';                           38390099
 PARM_INT_AREA.MSG_VAR_CODES        = ' ';                              38400099
 PARM_INT_AREA.MSG_VAR_CODE_6       = 'FL';                             38410099
 PARM_INT_AREA.MSG_VAR_VALUE_6      = WRK_FILE_NAME;                    38420099
 PARM_INT_AREA.MSG_VAR_CODE_7       = 'C6';                             38430099
 WRK_PIC_10                         = WRK_CNT_COUNTRY;                  38440099
 PARM_INT_AREA.MSG_VAR_VALUE_7      = WRK_PIC_10;                       38450099
 CALL RCB0M1M (PTR_INT_AREA);                                           38460099
                                      /* ADD CNT_COUNTRY TO TOTAL    */ 38470099
 WRK_CNT_RCBDQD1 = WRK_CNT_RCBDQD1 + WRK_CNT_COUNTRY;                   38480099
                                      /* INCREASE FOR NEXT CTRYNO    */ 38490099
 WRK_CTRYNO_NO = WRK_CTRYNO_NO + 1;                                     38500099
                                                      /* SOC RB01320 */ 38510099
                          /* COMMIT TO RELEASE LOCK FOR THIS COUNTRY */ 38520099
   EXEC SQL COMMIT;                                                     38530099
                                                                        38540099
   SELECT (SQLCODE);                                                    38550099
     WHEN (0);                                                          38560099
     OTHERWISE                                                          38570099
       DO;                                                              38580099
          CALL RCBDQDM_ERROR (ADDR (SQLCA),                             38590099
                      'DB2',                                            38600099
                      '#076');                                          38610099
       END;                                                             38620099
   END;                                               /* EOC RB01320 */ 38630099
 END R799_END_COUNTRY;                                                  38640099
                                                                        38650099
1/********************************************************************/ 38660099
 /*                                                                  */ 38670099
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 38680099
 /*                                                                  */ 38690099
 /* DESCRIPTION      : INIT PROGRAM                                  */ 38700099
 /*                                                                  */ 38710099
 /********************************************************************/ 38720099
 R900_INIT_PROGRAM: PROC;                                               38730099
                                             /* INITIALISE POINTERS  */ 38740099
 PTR_INT_AREA       = ADDR(PARM_INT_AREA);                              38750099
 PTR_RETURN_AREA_BB = ADDR(RETURN_AREA_BB);                             38760099
 PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA);                              38770099
 PTR_RUN_DATE_AREA  = ADDR (RUN_DATE_AREA);                             38780099
                                             /* INITIALISE VARIABLES */ 38790099
 PARM_INT_AREA.MSG_AREA       = '';                                     38800099
 PARM_INT_AREA.ERR_AREA       = ' ';                                    38810099
 PARM_INT_AREA.MSG_REQUEST    = 'O';                                    38820099
 PARM_INT_AREA.MSG_TARGET     = 'F';                                    38830099
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                  38840099
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                           38850099
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           38860099
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      38870099
 PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                        38880099
 PARM_INT_AREA.TXN_CODE       = '';                                     38890099
 PARM_INT_AREA.VERSION        = '';                                     38900099
 PARM_INT_AREA.PTR_PCB_IO     = NULL;                                   38910099
 PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                   38920099
                                              /* OPEN MESSAGE FILE   */ 38930099
 CALL RCB0M1M(PTR_INT_AREA);                                            38940099
                                              /* RETR. SYSTEM DATE   */ 38950099
 CALL RCB0T1M(PTR_INT_AREA);                                            38960099
                                              /* RETRIEVE COUNTRIES  */ 38970099
 CALL RCB019M (PTR_COUNTRY_AREA,                                        38980099
               PTR_INT_AREA);                                           38990099
                                              /* NO COUNTRIES FOUND  */ 39000099
 IF COUNTRY_AREA.COUNT_CTRY = 0                                         39010099
 THEN DO;                                                               39020099
   PARM_INT_AREA.COUNTRY_NUMBER    = '';                                39030099
   PARM_INT_AREA.MSG_VAR_CODES     = '';                                39040099
   PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                              39050099
   PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                            39060099
   CALL RCB0M1M (PTR_INT_AREA);                                         39070099
   CALL RCBDQDM_ERROR (NULL, 'OTHER', '#057');                          39080099
 END;                                                                   39090099
                           /* DETERMINE TIMESTAMP FOR HEADER + HASH  */ 39100099
 WRK_TIME_STAMP = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();           39110099
                                                                        39120099
                                                                        39130099
                                      /* RETRIEVE PARAMETER RCB067   */ 39140099
                                      /* TRANS TABLE TPMNT --> MA_ST */ 39150099
 TB_RCBV500          = '';                                              39160099
 TB_RCBV500_I        = '';                                              39170099
 TB_RCBP67S.NUMBER   = 'RCB067';                                        39180099
                                                                        39190099
 CALL RCBI50M ('U',                                       /* RC01219 */ 39200099
               ADDR (TB_RCBV500),                                       39210099
               ADDR (TB_RCBV500_I),                                     39220099
               PTR_RETURN_AREA_BB,                                      39230099
               PTR_INT_AREA);                                           39240099
                                                                        39250099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    39260099
   WHEN (0)                                                             39270099
     PARM_RCBP67S = TB_RCBP67S;                                         39280099
   WHEN (4) DO;                                                         39290099
     PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                   39300099
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';                 39310099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                    39320099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                   39330099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                         39340099
                                    TB_RCBV500.PARAMETER_NUMBER;        39350099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                   39360099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                         39370099
                                    TB_RCBV500.PARAMETER_KEY;           39380099
     CALL RCB0M1M (PTR_INT_AREA);                                       39390099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              39400099
                        'DB2','#058');                                  39410099
   END;                                                                 39420099
   OTHERWISE                                                            39430099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              39440099
                         'DB2','#059');                                 39450099
 END;                                                                   39460099
                                      /* RETRIEVE PARAMETER RCB068   */ 39470099
                                      /* TRANS TBLE CUNO -> SERV_DIV */ 39480099
 TB_RCBV500          = '';                                              39490099
 TB_RCBV500_I        = '';                                              39500099
 TB_RCBP68S.NUMBER   = 'RCB068';                                        39510099
                                                                        39520099
 CALL RCBI50M ('U',                                       /* RC01219 */ 39530099
               ADDR (TB_RCBV500),                                       39540099
               ADDR (TB_RCBV500_I),                                     39550099
               PTR_RETURN_AREA_BB,                                      39560099
               PTR_INT_AREA);                                           39570099
                                                                        39580099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    39590099
   WHEN (0)                                                             39600099
     PARM_RCBP68S = TB_RCBP68S;                                         39610099
   WHEN (4) DO;                                                         39620099
     PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                   39630099
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';                 39640099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                    39650099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                   39660099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                         39670099
                                    TB_RCBV500.PARAMETER_NUMBER;        39680099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                   39690099
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                         39700099
                                    TB_RCBV500.PARAMETER_KEY;           39710099
     CALL RCB0M1M (PTR_INT_AREA);                                       39720099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              39730099
                        'DB2','#060');                                  39740099
   END;                                                                 39750099
   OTHERWISE                                                            39760099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              39770099
                         'DB2','#061');                                 39780099
 END;                                                                   39790099
                                                      /* SOC RB01281 */ 39800099
 /* GET MA_STATUS FROM RCB063 AT GEO INSTALLATION LEVEL THAT WILL BE */ 39810099
 /* APPLIED FOR FLEXIBLE WARRANTY MACHINES WHEN RCB064 IS UNAVAILABLE*/ 39820099
                                                                        39830099
 WRK_FWTOW = '';                                      /* SOC RB01320 */ 39840099
 WRK_HBTOM = '';                                      /* EOC RB01320 */ 39850099
 TB_RCBV500                   = '';                                     39860099
 TB_RCBV500_I                 = '';                                     39870099
 TB_RCBP63S.NUMBER            = 'RCB063';                               39880099
                                                                        39890099
 CALL RCBI50M ('U',                                                     39900099
               ADDR (TB_RCBV500),                                       39910099
               ADDR (TB_RCBV500_I),                                     39920099
               PTR_RETURN_AREA_BB,                                      39930099
               PTR_INT_AREA);                                           39940099
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   39950099
   WHEN(0)                                                              39960099
     DO;                                                                39970099
      PARM_RCBP63S = TB_RCBP63S;                                        39980099
                                                                        39990099
     /* WHEN RCB063 PARAMETER VALUE IS BLANK THEN ABEND THE PROGRAM */  40000099
                                                                        40010099
   /* F_WARRANTY_MA_STATUS_GEO                   = TRUE; /* RB01320 */  40020099
                                                                        40030099
                                                    /* SOC RB01298 */   40040099
   /* IF TB_RCBV500.PARAMETER_VALUE              = ' '             */   40050099
   /* THEN                                                         */   40060099
   /*   DO;                                                        */   40070099
   /*     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';             */   40080099
   /*     PARM_INT_AREA.MESSAGE_TYPE             = 'BU';           */   40090099
   /*     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0217';         */   40100099
   /*     PARM_INT_AREA.MSG_VAR_CODE_6           = 'PN';           */   40110099
   /*     PARM_INT_AREA.MSG_VAR_VALUE_6          =                 */   40120099
   /*                                 TB_RCBV500.PARAMETER_NUMBER; */   40130099
   /*     PARM_INT_AREA.MSG_VAR_CODE_8           = 'PV';           */   40140099
   /*     PARM_INT_AREA.MSG_VAR_VALUE_8          =                 */   40150099
   /*                                 'RCB063 VALUE NOT FOUND  ';  */   40160099
   /*     CALL RCB0M1M (PTR_INT_AREA);                             */   40170099
   /*     CALL RCBDQDM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),      */   40180099
   /*                      'DB2',                                  */   40190099
   /*                      '#062');                                */   40200099
   /*   END;                                           EOC RB01298 */   40210099
     END;                                                               40220099
   WHEN(4)                                                              40230099
     DO;                                                                40240099
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                40250099
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              40260099
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 40270099
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                40280099
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      40290099
                                       TB_RCBV500.PARAMETER_NUMBER;     40300099
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                40310099
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      40320099
                                       TB_RCBV500.PARAMETER_KEY;        40330099
        CALL RCB0M1M (PTR_INT_AREA);                                    40340099
        CALL RCBDQDM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),             40350099
                         'DB2',                                         40360099
                        '#063');                                        40370099
     END;                                                               40380099
   OTHERWISE                                                            40390099
     DO;                                                                40400099
        CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           40410099
                    'DB2',                                              40420099
                    '#064');                                            40430099
     END;                                                               40440099
 END;                                                                   40450099
                                                                        40460099
                                                     /* EOC  RB01281 */ 40470099
                                        /* OPEN RCBDQD1              */ 40480099
 OPEN FILE(RCBDQD1);                                                    40490099
                                        /* INIT AND FILL HEADER REC  */ 40500099
 FILE_RCBDQD1                = '';                                      40510099
 FILE_RCBDQD1_H.KEY          = '';                                      40520099
 FILE_RCBDQD1_H.PROCESS_NAME = 'PICOS HW';                              40530099
 FILE_RCBDQD1_H.FILE_TYPE    = 'DELTA EXTR';                            40540099
 FILE_RCBDQD1_H.TIME_STAMP   = WRK_TIME_STAMP;                          40550099
                                        /* WRITE HEADER REC          */ 40560099
 WRITE FILE(RCBDQD1) FROM(FILE_RCBDQD1);                                40570099
                                                                        40580099
 END R900_INIT_PROGRAM;                                                 40590099
1/********************************************************************/ 40600099
 /*                                                                  */ 40610099
 /* MODULE NAME      : R999_END_PROGRAM                              */ 40620099
 /*                                                                  */ 40630099
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 40640099
 /*                                                                  */ 40650099
 /********************************************************************/ 40660099
 R999_END_PROGRAM:  PROC;                                               40670099
                                        /* INIT AND FILL TRAILER REC */ 40680099
 FILE_RCBDQD1                = '';                                      40690099
 FILE_RCBDQD1_H.KEY          = (20)'9';                                 40700099
 FILE_RCBDQD1_H.PROCESS_NAME = 'PICOS HW';                              40710099
 FILE_RCBDQD1_H.FILE_TYPE    = 'DELTA EXTR';                            40720099
 FILE_RCBDQD1_H.TIME_STAMP   = '';                                      40730099
                                        /* WRITE TRAILER REC         */ 40740099
 WRITE FILE(RCBDQD1) FROM(FILE_RCBDQD1);                                40750099
                                            /* CLOSE FILE RCBDQD1    */ 40760099
 CLOSE FILE(RCBDQD1);                                                   40770099
                              /* SAVE HASH TOTAL IN PARAMETER RCB024 */ 40780099
 TB_RCBV500 = '';                                                       40790099
 TB_RCBV500_I = '';                                                     40800099
 TB_RCBP24S.NUMBER     = 'RCB024';                                      40810099
 TB_RCBP24S.PROC_ID    = WRK_PROC_ID;                                   40820099
 TB_RCBP24S.CTRYNO     = COUNTRY_AREA.CTRY_SET_ID;        /* RC01219 */ 40830099
 TB_RCBP24S.FILE_NAME  = WRK_FILE_NAME;                                 40840099
 TB_RCBP24S.TIME_STAMP = WRK_TIME_STAMP;                                40850099
 TB_RCBP24S.HASH_TOTAL = WRK_HASH_TOTAL;                                40860099
 TB_RCBP24S.LENGTH_PARM = STG(TB_RCBP24S.TIME_STAMP) +                  40870099
                          STG(TB_RCBP24S.HASH_TOTAL);                   40880099
                                                                        40890099
 CALL RCBG50M (ADDR(TB_RCBV500),                                        40900099
               ADDR(TB_RCBV500_I),                                      40910099
               PTR_RETURN_AREA_BB,                                      40920099
               PTR_INT_AREA);                                           40930099
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    40940099
   WHEN (0);                                                            40950099
   WHEN (4) DO;                    /* WHEN NOT FOUND THEN INSERT  */    40960099
     CALL RCBF50M (ADDR(TB_RCBV500),                                    40970099
                   ADDR(TB_RCBV500_I),                                  40980099
                   PTR_RETURN_AREA_BB,                                  40990099
                   PTR_INT_AREA);                                       41000099
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                41010099
       WHEN (0);                                                        41020099
       OTHERWISE                                                        41030099
         CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          41040099
                             'DB2','#065');                             41050099
     END;                                                               41060099
   END;                                                                 41070099
   OTHERWISE                                                            41080099
     CALL RCBDQDM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              41090099
                         'DB2','#066');                                 41100099
 END;                                                                   41110099
                                    /* WRITE COUNT MESSAGE           */ 41120099
                                   /* RCBDQD1 WRITTEN                */ 41130099
 PARM_INT_AREA.COUNTRY_NUMBER           = '';                           41140099
 PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                         41150099
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0004';                       41160099
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                           41170099
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'FL';                         41180099
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = WRK_FILE_NAME;                41190099
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'C6';                         41200099
 WRK_PIC_10                             = WRK_CNT_RCBDQD1;              41210099
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = WRK_PIC_10;                   41220099
 CALL RCB0M1M (PTR_INT_AREA);                                           41230099
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 41240099
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  41250099
 PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                                41260099
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    41270099
 CALL RCB0M1M (PTR_INT_AREA);                                           41280099
                                    /* CLOSE MESSAGE FILE            */ 41290099
 PARM_INT_AREA.MSG_REQUEST = 'C';                                       41300099
 CALL RCB0M1M (PTR_INT_AREA);                                           41310099
                                                                        41320099
 END R999_END_PROGRAM;                                                  41330099
1/********************************************************************/ 41340099
 /*                                                                  */ 41350099
 /* MODULE NAME      : RCBDQDM_ERROR                                 */ 41360099
 /*                                                                  */ 41370099
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 41380099
 /*                    THE INPUT VARIABLES                           */ 41390099
 /*                                                                  */ 41400099
 /********************************************************************/ 41410099
 RCBDQDM_ERROR: PROC (PTR_ERROR,                                        41420099
                      ERR_TYPE,                                         41430099
                      CALL_ID);                                         41440099
                                                                        41450099
 DCL PTR_ERROR     PTR;                                                 41460099
 DCL ERR_TYPE      CHAR(8);                                             41470099
 DCL CALL_ID       CHAR(4);                                             41480099
                                                                        41490099
 PARM_INT_AREA.PTR_ERROR = PTR_ERROR;                                   41500099
 PARM_INT_AREA.ERR_TYPE  = ERR_TYPE;                                    41510099
 PARM_INT_AREA.CALL_ID   = CALL_ID;                                     41520099
 CALL RCB0E1M (ADDR(PARM_INT_AREA));                                    41530099
                                                                        41540099
 END RCBDQDM_ERROR;                                                     41550099
1/*******************************************************************/  41560099
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  41570099
 /*******************************************************************/  41580099
 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */   41590099
 $DAIMOD (RCBDQDM);                      /* MODULE TO BE COMPILED   */  41600099
 /*******************************************************************/  41610099
 /* END OF ABR BLOCK                                                */  41620099
 /*******************************************************************/  41630099
 END RCBDQDM;                                                           41640099