1/* RCBDRIM - RCMS HW: EXTRACT                                       */ 00010000
 /********************************************************************/ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /********************************************************************/ 00060000
 /* PROGRAM          : RCBDRIM                                       */ 00070000
 /*                                                                  */ 00080000
 /* LANGUAGE         : PLISQL                                        */ 00090000
 /*                                                                  */ 00100000
 /* TYPE             : BATCH                                         */ 00110000
 /*                                                                  */ 00120000
 /* DESCRIPTION      : THE EXTRACT OF HW RELATED                     */ 00130000
 /*                    INFORMATION FOR ONE COUNTRY GIVEN             */ 00140000
 /*                    AND FOR WHICH INFORMATION HAS CHANGED         */ 00150000
 /*                    SINCE THE LAST RCMS HW EXTRACT                */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : - DB2   : RCBV0030_CONTRACT                   */ 00180000
 /*                              RCBV0010_CUSTOMER           RB01289 */ 00190000
 /*                              RCBV0011_PI_CUST            RB01289 */ 00200000
 /*                              RCBV0051_PI_HW_PR           RC01158 */ 00210000
 /*                              RCBV0110_HW_STATUS                  */ 00220000
 /*                              RCBV0125_DMMY_REAL          RB01320 */ 00230000
 /*                              RCBV0170_OU_HW                      */ 00240000
 /*                              RCBV0190_HW_CUST                    */ 00250000
 /*                              RCBV0220_SUPPL_CTR                  */ 00260000
 /*                              RCBV0240_SERV_CTR                   */ 00270000
 /*                              RCBV0241_PI_CTR             RC01158 */ 00280000
 /*                              RCBV0260_HW_IN_ORD                  */ 00290000
 /*                              RCBV0300_HW_REAL                    */ 00300000
 /*                              RCBV0340_HW_ADDR                    */ 00310000
 /*                              RCBV0380_HW_PR_MOD                  */ 00320000
 /*                              RCBV0470_SERV_COND          RC01194 */ 00330000
 /*                              RCBV0475_CTRY_COND          RA01233 */ 00340000
 /*                              RCBV0500_PARM                       */ 00350000
 /*                              RCBV0610_TRANS_ATO                  */ 00360000
 /*                              RCBT0630_TRANS_HVC   /* SOC RC01326 */ 00370000
 /*                              RCBT0635_CTRY_HVC    /* EOC RC01326 */ 00380000
 /*                              RCBV0645_CTRY_SVT           RC01279 */ 00390000
 /*                              RCBV0722_RCMS_HW                    */ 00400000
 /*                              RCBT0691_TRANS_OFF   /*SOC  RB01301 */ 00410000
 /*                              RCBT0120_MESE_HW                    */ 00420000
 /*                              RCBT0650_TRANS_SDF   /*EOC  RB01301 */ 00430000
 /*                                                                  */ 00440000
 /* INTERMEDIATE     : - FILE  : RCBDRII                             */ 00450000
 /*                              RCBDRIJ                             */ 00460000
 /*                              RCBDRIK                             */ 00470000
 /*                                                                  */ 00480000
 /* OUTPUT           : - FILE  : RCBDRI1                             */ 00490000
 /*                              RCB0M10                             */ 00500000
 /*                                                                  */ 00510000
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00520000
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00530000
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00540000
 /*                    RCB004M   DATE CALCULATION                    */ 00550000
 /*                    RCB018M   UPDATE HASH TOTAL                   */ 00560000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00570000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00580000
 /*                    RCBISRM   RETRIEVE RCBT0470_SERV_COND RA01233 */ 00590000
 /*                                       RCBT0475_CTRY_COND         */ 00600000
 /*                    RCBI50M   RETRIEVE PARAMETER                  */ 00610000
 /*                    RCBF50M   INSERT PARAMETER                    */ 00620000
 /*                    RCBG50M   UPDATE PARAMETER                    */ 00630000
 /*                    RCBI61M   RETRIEVE AGREEMENT TYPE/OPTION      */ 00640000
 /*                    RCBIBOM   RETRIEVE SERVICE TYPE               */ 00650000
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00660000
 /*                                                                  */ 00670000
 /* MESSAGES         :                                               */ 00680000
 /*                                                                  */ 00690000
 /* DEPENDENCIES     : NONE                                          */ 00700000
 /*                                                                  */ 00710000
 /* FREQUENCY        : USER DEPENDENT                                */ 00720000
 /*                                                                  */ 00730000
 /* MAINTENANCE LOG  :                                               */ 00740000
 /* ---------------                                                  */ 00750000
 /*                                                                  */ 00760000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00770000
 /*           |              |                                       */ 00780000
 /*1993-04-01 | ----         | CEDS INITIAL DEVELOPMENT              */ 00790000
 /*1994-03-10 | PTM478       | USE SOURCE_INDICATOR FROM TABLE T0240 */ 00800000
 /*           |              | INSTEAD OF T030                       */ 00810000
 /*1994-05-20 | PTM...       | ONORDER-INSTALL DUPLICATES MUST NOT   */ 00820000
 /*           |              | LEAD TO ABEND.                        */ 00830000
 /*           |              |                                       */ 00840000
 /*1994-09-30 | PTM571       | SORT NOT ADAPTED                      */ 00850000
 /*1994-10-03 | PTM573       | RESET HVP_QUANT.                      */ 00860000
 /*1994-11-15 | RC01116      | STORE TYPE OF WARRANTY                */ 00870000
 /*1995-09-14 | RC01141      | FILL SEQUENCE_KEY                 (DG)*/ 00880000
 /*1996-04-22 | RC01158      | PRIME INPUT                       (RK)*/ 00890000
 /*1996-10-03 | PTM0985      | PRIME INPUT                       (JB)*/ 00900000
 /*1996-10-03 | PTM0988      | FILL WARRANTY-GAP                 (RK)*/ 00910000
 /*1996-11-15 | RA01171      | CEDS OPTION FOR HVP DATA HANDLING     */ 00920000
 /*1997-04-11 | PTM1036      | CORRECTED PROLOG                      */ 00930000
 /*1997-04-22 | PTM1048      | SERVICE TYPE NOT OUTPUT           (DG)*/ 00940000
 /*1997-09-24 | RC01194      | CEDS ENHANCEMENT                      */ 00950000
 /*           |              | RCMS INVENTORY INTERFACE          (BP)*/ 00960000
 /*1997-10-31 | PTM1114      | INITILIZE SW_WARRANTY             (IS)*/ 00970000
 /*1997-11-03 | PTM1111      | INCORRECT ROUNDING COVERAGE HOURS (IS)*/ 00980000
 /*1997-11-11 | PTM1130      | INTRODUCE NEW WARRANTY            (IS)*/ 00990000
 /*1997-12-10 | PTM1142      | CORRECTION ON PTM1111             (IS)*/ 01000000
 /*1998-01-07 | PTM1148      | REMOVE INTERNAL SORT              (JB)*/ 01010000
 /*1998-05-06 | PTM1170      | YEAR 1999 => 9999                (JVG)*/ 01020000
 /*1999-03-08 | PTM1254      | FUNNY CALCULATIONS ON 9999-12-31      */ 01030000
 /*1999-02-02 | PTM1202      | CORRECT FILLING MKTGD & MKBINA    (EC)*/ 01040000
 /*1999-06-16 | PTM1266      | R527 WAS NOT CALLED FOR PI WITH BOTH  */ 01050000
 /*           |              |  T051 AND T241, WHEN TOW IS EMPTY     */ 01060000
 /*1999-07-06 | RC01219      | DORO                                  */ 01070000
 /*1999-11-25 | PTM1313      | EXTRACT PI DATA WITH FUTURE WARRANTY  */ 01080000
 /*2000-03-07 | PTM1317      | CORRECT 99991230 TO 99999999     (NVS)*/ 01090000
 /*2000-04-04 | PTM1318      | DO NOT ABEND ON BLANK SERVTYPE   (JVB)*/ 01100000
 /*2000-10-10 | PTM1334      | INCORRECT FIELD FILLING               */ 01110000
 /*2000-11-07 | RA01224      | CISCO ETC, IMPROVEMENT OF PI HANDLING */ 01120000
 /*2001-12-14 | RA01229      | SERV REF INTERIM                      */ 01130000
 /*2002-07-10 | RA01233      | TACTICAL SERVICE REFERENCE            */ 01140000
 /*2002-12-03 | PTM1401      | INCLUDE PEW SDF DATA ON MA CONTRACTS  */ 01150000
 /*2003-03-19 | RB01236      | MULTIPLE SERVICE PAC SUPPORT          */ 01160000
 /*2003-09-11 | PTM1408      | SOURCE_INDICATOR FROM T0241 WHEN APPL.*/ 01170000
 /*2004-04-28 | RB01256      | ALIGN SLC ENTITY NAMES                */ 01180000
 /*2004-05-18 | PTM1414      | ADAPT THE PI_PRIORITY FLAG SETTING    */ 01190000
 /*2004-08-23 | RB01254      | ADD 10 TO IO_AREA_RCBDRG2             */ 01200000
 /*2004-08-23 | RB01242      | SEQUENCE_NUMBER FROM 7 TO 28 CHAR.    */ 01210000
 /*2006-01-16 | RB01274      | SERVICE REFERENCE FIXES               */ 01220000
 /*2006-08-08 | RB01272      | LENOVO ENHANCEMENTS FOR CEDS 3.3      */ 01230000
 /*2006-11-01 | RB01278      | CEDS 3.3 (LENOVO)VENDOR COST          */ 01240000
 /*           |              | ASSIGNMENT                            */ 01250000
 /*2006-12-05 | CEDS00000320 | WSU/WSUC CHANGES                      */ 01260000
 /*2007-01-09 | RC01279      | PASSING SDM TO DOWNSTREAM I.S.O.      */ 01270000
 /*           |              | SERVICE TYPE                          */ 01280000
 /*2007-01-25 | CEDS00000321 | IBM & LENOVO CONTRACT TO BE TREATED   */ 01290000
 /*           |              | DIFFERENTLY                           */ 01300000
 /*2007-05-02 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY MACHINES*/ 01310000
 /*2007-11-08 | RB01283      | LENOVO FLAG                           */ 01320000
 /*2008-02-04 | CEDS00000327 | SLC FOR SERVICECONTRACT RECORDS IN    */ 01330000
 /*           |              | RCMS HW EXTRACTY                      */ 01340000
 /*2008-04-03 | RB01289      | PRIME INPUT CUSTOMER NUMBER           */ 01350000
 /*2008-05-20 | RB01290      | ACCEPT CONTRACTS ON INTERNAL MACHINES */ 01360000
 /*2008-08-11 | CEDS00000438 | PASSING FLEXIBLE TYPE OF WARRANTY FROM*/ 01370000
 /*           |              | T051 TO FILE FOR PI MACHINE           */ 01380000
 /*2008-08-29 | RC01295      | PCEDSP-0008:  INCORRECT DETERMINATION */ 01390000
 /*           |              | OF 'LENOVO-MACHINE'                   */ 01400000
 /*2009-01-20 | RB01298      | HANDLING HARDBUNDLE MACHINES          */ 01410000
 /*2009-02-20 | RB01299      | CEDS ALIGNMENT TO CHIS 810            */ 01420000
 /*2009-05-28 | CEDS00000468 | CURSOR_PI_HW IS RESTRICTED TO         */ 01430000
 /*           |              | TYPE_OF_RELATION AS 'U' IN T190       */ 01440000
 /*2009-07-16 | CEDS00000478 | CUSTOMER NUMBER EXTENSION-ICUSANO FOR */ 01450000
 /*           |              | BAU CUSTOMER SHOULD BE '000'          */ 01460000
 /*2009-08-03 | RB01301      | BAU SERVICE EXTENSIONS                */ 01470000
 /*2009-08-20 | RC01302      | PCEDSP-0023: ADDED  ADDRESS_NUMBER    */ 01480000
 /*           |              | FIELD IN RCBDRIS PLINCL AND INCREASED */ 01490000
 /*           |              | THE FILE LENGTH                       */ 01500000
 /*2009-09-15 | CEDS00000487 | PREVENT OVERWRITE OF BAU DATA WITH PI */ 01510000
 /*2009-10-12 | CEDS00000491 | RCMS SLOTS AND PRES_VALID ARE HANDLED */ 01520000
 /*           |              | PROPERLY                              */ 01530000
 /*2009-10-22 | CEDS00000493 | SWITCH_PIWARR_BAUCTR FLAG INITIALISED */ 01540000
 /*           |              | PROPERLY                              */ 01550000
 /*2009-10-30 | CEDS00000494 | CHECK FOR EFFECTIVE BAU CONTRACT WHEN */ 01560000
 /*           |              | PI WARRANTY IS EFFECTIVE AT RUN DATE  */ 01570000
 /*           |              | & SWITCH_PIWARR_BAUCTR IS INITIALIZED */ 01580000
 /*           |              | PROPERLY.                             */ 01590000
 /*2009-11-06 | CEDS00000497 | SWITCH_PIWARR_BAUCTR FLAG IS REMOVED  */ 01600000
 /*           |              | AND CONDITION ADDED TO CHK WHETHER    */ 01610000
 /*           |              | MACHINE IS EFFECTIVE IN PI WARRANTY   */ 01620000
 /*           |              | AND BAU CONTRACT                      */ 01630000
 /*2010-03-05 | CEDS00000505 | MISSING DB2 TABLE/PARTITION LOCK      */ 01640000
 /*           |              | APPLIED                               */ 01650000
 /*2010-08-11 | CEDS00000536 | INITIALIZED SERVICE EXTENSION RELATED */ 01660000
 /*           |              | WORK FIELDS PROPERLY                  */ 01670000
 /*2010-08-19 | RB01308      | T10-1114, T10-1109 AND TEMEA-T080068: */ 01680000
 /*           |              | PRIORITY RULES ALIGNMENT              */ 01690000
 /*           |              | PCR 155/T08-0808: PREVENT LOSS OF DATA*/ 01700000
 /*           |              | DURING INTERNAL SORT                  */ 01710000
 /*           |              | TEMEA-T080097: PREVENT A WRONG SLOT   */ 01720000
 /*           |              | WHEN CONTRACT ENDING 1 DAY BEFORE WARR*/ 01730000
 /*           |              | PCR P10-0187:USE CORRECT OU-CODE WHEN */ 01740000
 /*           |              | PI INVENTORY MATCHED WITH BAU CUSTOMER*/ 01750000
 /* 2010-11-09| RC01311      | USE CORRECT OU-CODE PCR P10-0208      */ 01760000
 /* 2011-03-01| CEDS00000548 | CHECK THE EXISTENCE OF                */ 01770000
 /*           |              | T350.CU_ENGINEERING_OU IN T040        */ 01780000
 /* 2011-02-10| CEDS00000551 | ASSIGN BLANK BW SLC WHEN CONTRACT     */ 01790000
 /*           |              | OVERLAP WITH HARD BUNDLE PERIOD-2     */ 01800000
 /* 2011-16-10| CEDS00000552 | BAU CUSTOMER DETAILS OVERULES PI WHEN */ 01810000
 /*           |              | BOTH BAU AND PI ARE EFFECTIVE         */ 01820000
 /* 2011-02-24| CEDS00000555 | CORRECTION IN FILLING PI_PRIORITY FLAG*/ 01830000
 /* 2011-05-06| RC01313      | PCEDSP-0064: SOLVE DESIGN ERROR OF    */ 01840000
 /*           |              | PCR 208                               */ 01850000
 /* 2012-03-15| RB01320      | CEDS 3.3 A17 RELEASE: SUPPORT FOR     */ 01860000
 /*           |              | LONG SERIAL IN DOWNSTREAMS            */ 01870000
 /* 2013-01-18| CEDS00000623 | INTERNAL CTR MACH NOT PROCESSED CORRE-*/ 01871000
 /*           |              | CTLY IN DR06.                         */ 01872000
 /* 2013-01-31| RC01326      | PCR P10-0421 - HANDLING SERVICE LEVEL */ 01880000
 /*           |              | EXTENSIONS FOR BAU & PI SERVICE PAC   */ 01881000
 /* 2013-04-22| CEDS00000631 | TREC 1908:BASE WARRANTY SLC NOT FILLED*/ 01882000
 /*           |              | CORRECTLY FOR MACHINES WITH INTERNAL  */ 01883000
 /*           |              | CONTRACT                              */ 01884000
 /* 2013-04-29| CEDS00000634 | ASSIGNING VALUES TO SK_CURRENT_HW WHEN*/ 01885000
 /*           |              | SK_INST_HW_2 = SK_OO_HW_2             */ 01886000
 /* 2013-04-30| RB01327      | SWG REQUIREMENT -                     */ 01887000
 /*           |              | CEDS 3.3 A18 RELEASE                  */ 01888000
 /* 2013-09-04| CEDS00000648 | BASE WARRENTY SLC IS BLANKED          */ 01888100
 /*           |              | WHEN SWITCH_INTERNAL_MACHINE_CTR FLAG */ 01888200
 /*           |              | IS SET FOR TOM = 2                    */ 01888300
 /* 2014-10-10| CEDS00000702 | "NO SERVICE CONTRACT FOUND " FOR T240 */ 01888400
 /*           |              |  CURSOR WHEN T125 TABLE IS EMPTY      */ 01888500
 /* 2014-12-19| CEDS00000719 | TREC 2068 RCMS PERFORMANCE ISSUE      */ 01888600
 /* 2015-01-16| CEDS00000721 | TOM WAS NOT PICKED PROPERLY FROM      */ 01888700
 /*           |              | RCB070 PARAMETER IF MULTIPLE ENTRIES  */ 01888800
 /*           |              | ARE PRESENT IN T240 FOR INTERNAL      */ 01888900
 /* 2015-01-22| CEDS00000724 | TPMNT IS TAKEN CORRECTLY FROM T220    */ 01889000
 /*           |              | FOR INTERNAL MACHINE IF THERE IS NO   */ 01889100
 /*           |              | LONGER A VALID RCB070 VALUE FOR       */ 01889200
 /*           |              | ACTIVE CONTRACT IN T240               */ 01889300
 /* 2015-03-04| RC01353      | PCR10-0612 :ESTABLISH A SPECIFIC      */ 01889400
 /*           |              | SOURCE INDICATOR FOR SERVICE          */ 01889500
 /*           |              | INTEGRATOR CONTRACTS                  */ 01889600
 /* 2015-03-10| CEDS00000735 | RUN DATE IS PASSED TO THE USER EXIT   */ 01889702
 /*           |              | RCBDRAU - TREC 2131                   */ 01889802
 /* 2015-06-05| RC01359      | P10-0559 : REMOVED PADDED ZEROES FROM */ 01890009
 /*           |              | LONG SERIAL FIELD FOR IBM MACHINES    */ 01890108
 /* 2015-07-06| CEDS00000754 | TEMEA-T081581 : SETTING TOM = G WHEN  */ 01890212
 /*           |              | T241.AUTHORISATION_CODE="LEN"         */ 01890313
 /* 2015-08-04| RC01362      | PCR 0472 - TO REMOVE ASSIGNING OF TOM */ 01890518
 /*           |              | TO G WHEN RCB103 PARAMETER IS SET     */ 01890718
 /*           |              | TO Y FOR LENOVO MACHINES              */ 01890818
 /* 2015-12-29| CEDS00000778 | TREC T10-2179 TO AVOID MULTIPLE       */ 01890924
 /*           |              | RECORDS TO BE SELECT BY SQL QUERY     */ 01891022
 /*           |              |                                       */ 01891129
 /********************************************************************/ 01892000
 /*(CHECK(                                                              01900000
 R001_LOCK_TABLES                            ,                          01910000
 R010_MAX_DATE                               ,                          01920000
 R011_MIN_DATE                               ,                          01930000
 R012_TRANS_TIME                             ,                          01940000
 R013_TRANS_DATE                             ,                          01950000
 R014_DATE_CALC                              ,                          01960000
 R015_TRANS_ATO                              ,                          01970000
 R016_FILL_COVERAGE_HOURS                    ,                          01980000
 R017_GET_SERVICE_TYPE                       ,                          01990000
 R018_DATE_CALC8                             ,                  RB01308 02000000
 R400_RETR_ADD_CONTR_INFO                    ,                          02010000
 R402_FILL_SERV_CTR_PERIOD                   ,                          02020000
 R404_PROCESS_FILLED_PERIOD                  ,                          02030000
 R405_FILL_SUPPL_CTR_PERIOD                  ,                          02040000
 R406_RETRIEVE_SRVICE_DLVRY_CONS             ,                          02050000
 R409_FETCH_CURSOR_SERV_CTR                  ,                          02060000
 R410_CHECK_GAP                              ,                          02070000
 R411_FILL_WARRANTY_PERIOD                   ,                          02080000
 R412_FILL_CTR_T241_PERIOD                   ,                          02090000
 R413_FILL_CTR_BOTH_PERIOD                   ,                          02100000
 R414_FILL_TPMNT_3_PERIOD                    ,                          02110000
 R415_FILL_WAR_CTR_PERIOD                    ,                          02120000
 R416_PROCESS_PERIOD                         ,                          02130000
 R417_PROCESS_FW_MACHINE                     ,                          02140000
 R418_FILL_OFF_SNAME                         ,                  RB01301 02150000
 R419_PROCESS_RCBDRI1_PERIOD                 ,                  RB01308 02160000
 R500_INIT_SERV_CTR_PERIOD                   ,                          02170000
 R505_END_SERV_CTR_PERIOD                    ,                          02180000
 R508_RETR_ADD_CURRENT_INFO                  ,                          02190000
 R509_FILL_CURRENT_INFO                      ,                          02200000
 R510_FILL_CURRENT_PI_INFO                   ,                  RB01308 02210000
 R511_FILL_CURRENT_BAU_INFO                  ,                  RB01308 02220000
 R520_FILL_DATE_TABLE_FROM_T051              ,                          02230000
 R521_FILL_DATE_TABLE_FROM_T241              ,                          02240000
 R525_SORT_DATE_TABLE                        ,                          02250000
 R526_ADD_DATE_TO_TABLE                      ,                          02260000
 R527_PROCESS_TABLE                          ,                          02270000
 R528_FILL_DATE_ARRAY                        ,                  RB01308 02280000
 R529_SORT_DATE_ARRAY                        ,                  RB01308 02290000
 R530_FIND_SLOT                              ,                  RB01308 02300000
 R531_CHECK_SLOT_VALUES                      ,                  RB01308 02310000
 R600_FILL_INST_PERIOD                       ,                          02320000
 R609_FETCH_CURSOR_INST_HW                   ,                          02330000
 R610_PROCESS_OO_HW                          ,                          02340000
 R619_FETCH_CURSOR_OO_HW                     ,                          02350000
 R620_PROCESS_PI_PERIODS                     ,                          02360000
 R621_PROCESS_USER_EXIT                      ,                          02370000
 R624_CHECK_PI_PRIORITY                      ,                          02380000
 R629_FETCH_CURSOR_PI_HW                     ,                          02390000
 R630_FETCH_T051_SDF                         ,                  RB01301 02400000
 R653_WRITE_RCBDRIK                          ,                          02410000
 R655_PROCESS_ICUSANO                        ,                          02420000
 R658_READ_FILE_RCBDRIJ                      ,                          02430000
 R659_READ_FILE_RCBDRG2                      ,                          02440000
 R700_INIT_HW_OCCURENCE                      ,                          02450000
 R701_INIT_HW_PERIOD                         ,                          02460000
 R710_PROCESS_PI_HW                          ,                          02470000
 R720_PROCESS_REGULAR_HW                     ,                          02480000
 R730_APPLY_PRIORITY                         ,                  RB01308 02490000
 R740_FINISH_HW_OCCURENCE                    ,                          02500000
 R749_WRITE_RCBDRII                          ,                          02510000
 R800_INIT_PROCESSING                        ,                          02520000
 R849_END_PROCESSING                         ,                          02530000
 R850_SORT_FOR_ADDR_RES                      ,                          02540000
 R860_INIT_PROCESS_SORT                      ,                          02550000
 R870_END_PROCESS_SORT                       ,                          02560000
 R900_INIT_PROGRAM                           ,                          02570000
 R950_PROCESS_PI_LONG_SER                    ,                  RC01326 02571000
 R960_PROCESS_SERVICE_EXTN                   ,            SOC   RB01301 02580000
 R961_PROCESS_BAU_CTR_SE                     ,            SOC   RC01326 02590000
 R962_PROCESS_PI_CTR_SE                      ,                          02600000
 R963_FILL_SERV_EXTN                         ,            EOC   RC01326 02610000
 R965_FILL_BASE_WARANTY_SLC                  ,            EOC   RB01301 02620000
 R970_SORT_FOR_OUTPUT                        ,                          02630000
 R999_END_PROGRAM                            ,                          02640000
 RCBDRIM_ERROR                                                          02650000
 )): */                                                                 02660000
1RCBDRIM: PROC                                                          02670000
          OPTIONS (MAIN)                                                02680000
          REORDER;                                                      02690000
 DEFAULT RANGE (*)        STATIC;                                       02700000
1/********************************************************************/ 02710000
 /*  PARAMETERS                                                      */ 02720000
 /********************************************************************/ 02730000
 DCL PTR_INT_AREA        PTR;          /* INTERFACE AREA             */ 02740000
 DCL PTR_RETURN_AREA_BB  PTR;          /* RETURN AREA FROM BB        */ 02750000
 DCL PTR_COUNTRY_AREA    PTR;          /* INTERFACE RCB019M          */ 02760000
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 02770000
                                                                        02780000
 DCL 1 PARM_INT_AREA,                         /* INTERFACE AREA      */ 02790000
       %INCLUDE (RCBZ01S);;                                             02800000
 DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 02810000
       %INCLUDE (RCBZ02S);;                                             02820000
 DCL 1 PARM_DATE_CALC,                        /* DATE CALCULATION    */ 02830000
       %INCLUDE (RCBZ03S);;                                             02840000
 DCL 1 COUNTRY_AREA,                          /* COUNTRY AREA        */ 02850000
       %INCLUDE (RCBZ26S);;                                             02860000
 DCL 1 RUN_DATE_AREA,                         /* RUN DATE AREA       */ 02870000
       %INCLUDE (RCBZ28S);;                                             02880000
 DCL 1 PARM_RCB005,                            /* RCMS EXTR PARM     */ 02890000
      %INCLUDE (RCBP05S);;                                              02900000
 DCL 1 PARM_RCB024,                            /* HASH_TOTAL PARM    */ 02910000
      %INCLUDE (RCBP24S);;                                              02920000
 DCL 1 PARM_RCB024M,                           /* RCB024M PARM       */ 02930000
      %INCLUDE (RCBZ33S);;                                              02940000
                                                      /* SOC RB01278 */ 02950000
0DCL 1 PARM_RCBP103S,                 /* SERVICE ON BEHALF OF VENDOR */ 02960000
      %INCLUDE (RCBP103S);;                                             02970000
                                                      /* EOC RB01278 */ 02980000
 DCL 1 PARM_RCB063S,                                  /*RB01281*/       02990000
       %INCLUDE (RCBP63S);;                           /*RB01281*/       03000000
                                                      /* SOC RB01290 */ 03010000
0DCL 1 PARM_RCBP70S,                  /* TOM FOR INTERNAL CONTRACT   */ 03020000
      %INCLUDE (RCBP70S);;            /*    MACHINES                 */ 03030000
                                                      /* EOC RB01290 */ 03040000
0DCL 1 PARM_RCBP64S,                                      /* RB01298 */ 03050000
      %INCLUDE (RCBP64S);;                                /* RB01298 */ 03060000
                                                                        03070000
 DCL 1 TB_RCBV691,                                     /* SOC RB01301*/ 03080000
      %INCLUDE (RCB691S);;                                              03090000
                                                                        03100000
 DCL 1 TB_RCBV691_I,                                                    03110000
      %INCLUDE (RCB691SI);;                                             03120000
                                                                        03130000
 DCL 1 TB_RCBV120,                                                      03140000
      %INCLUDE (RCB120S);;                                              03150000
                                                                        03160000
 DCL 1 TB_RCBV120_I,                                                    03170000
      %INCLUDE (RCB120SI);;                                             03180000
                                                                        03190000
 /*                                                       SOC RC01313 */03200000
0/* DCL 1 TB_RCBV350,                                  /* SOC RC01311 */03210000
 /*   %INCLUDE (RCB350S);;                             /* EOC RC01311 */03220000
 /*                                                       EOC RC01313 */03230000
                                                                        03240000
 DCL 1 TB_RCBV650,                                                      03250000
      %INCLUDE (RCB650S);;                                              03260000
                                                                        03270000
 DCL 1 TB_RCBV650_I,                                                    03280000
      %INCLUDE (RCB650SI);;                            /* EOC RB01301*/ 03290000
                                                                        03300000
                                                                        03420000
1/********************************************************************/ 03430000
 /* EXTERNAL ENTRIES                                                 */ 03440000
 /********************************************************************/ 03450000
 /*DCL PLIXOPT       EXTERNAL CHAR (30) VAR INIT ('ISA(10K),NOSTAE');*/ 03460000
                                                                        03470000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 03480000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 03490000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 03500000
 DCL RCB004M   ENTRY  EXTERNAL;          /* DATE CALC ROUTINE        */ 03510000
 DCL RCB018M   ENTRY  EXTERNAL;          /* UPDATE HASH TOTAL        */ 03520000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 03530000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 03540000
 DCL RCBDRAU   ENTRY  EXTERNAL;          /* USER EXIT        RC01158 */ 03550000
 DCL RCBISRM   ENTRY  EXTERNAL;          /* RETRIEVE T470/475 RA01233*/ 03560000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 03570000
 DCL RCBF50M   ENTRY  EXTERNAL;          /* INSERT PARAMETER         */ 03580000
 DCL RCBG50M   ENTRY  EXTERNAL;          /* UPDATE PARAMETER         */ 03590000
 DCL RCBI61M   ENTRY  EXTERNAL;          /* RETRIEVE TPMNT+ SERVTYPE */ 03600000
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 03610000
1/********************************************************************/ 03620000
 /*  FILE DECLARATIONS                                               */ 03630000
 /********************************************************************/ 03640000
 DCL RCBDRII        FILE         /* INTERMEDIATE (SORTIN) FILE       */ 03650000
                    RECORD                                              03660000
                    OUTPUT                                              03670000
                    SEQUENTIAL                                          03680000
 /*                 ENV (FB RECSIZE(1312));           /* SOC RC01302 */ 03690000
                                                      /* SOC RB01320 */ 03700000
 /*                 ENV (FB RECSIZE(1330));*/         /* EOC RC01302  */03710000
                    ENV (FB RECSIZE(1360));           /* EOC RB01320 */ 03720000
                                                                        03730000
 DCL RCBDRIJ        FILE         /* INTERMEDIATE (SORTOUT) FILE      */ 03740000
                    RECORD                                              03750000
                    INPUT                                               03760000
                    SEQUENTIAL                                          03770000
 /*                 ENV (FB RECSIZE(1312));           /* SOC RC01302 */ 03780000
                                                      /* SOC RB01320 */ 03790000
 /*                 ENV (FB RECSIZE(1330)); */        /* EOC RC01302 */ 03800000
                    ENV (FB RECSIZE(1360));           /* EOC RB01320 */ 03810000
                                                                        03820000
 ON ENDFILE (RCBDRIJ)                                                   03830000
   BEGIN;                                                               03840000
      SWITCH_END_OF_RCBDRIJ = TRUE;                                     03850000
      SK_RCBDRIJ.EOF = '1';                                             03860000
   END;                                                                 03870000
                                                                        03880000
 DCL RCBDRIK        FILE         /* INTERMEDIATE (SORTOUT) FILE      */ 03890000
                    RECORD                                              03900000
                    OUTPUT                                              03910000
                    SEQUENTIAL                                          03920000
 /*                 ENV (FB RECSIZE(1312));           /* SOC RC01302 */ 03930000
                                                      /* SOC RB01320 */ 03940000
 /*                 ENV (FB RECSIZE(1330)); */        /* EOC RC01302 */ 03950000
                    ENV (FB RECSIZE(1360));           /* EOC RB01320 */ 03960000
                                                                        03970000
 DCL RCBDRG2        FILE         /* CUSTOMER EXTRACT FILE            */ 03980000
                    RECORD                                              03990000
                    INPUT                                               04000000
                    SEQUENTIAL                                          04010000
                    ENV (FB RECSIZE(266)); /* RB01254*/                 04020000
                                                                        04030000
 ON ENDFILE (RCBDRG2)                                                   04040000
   BEGIN;                                                               04050000
      SWITCH_END_OF_RCBDRG2 = TRUE;                                     04060000
      SK_RCBDRG2.EOF = '1';                                             04070000
   END;                                                                 04080000
                                                                        04090000
 DCL RCBDRI1        FILE         /* EXTRACT (CEDS)                   */ 04100000
                    RECORD                                              04110000
 /*                 OUTPUT                                   RB01308 */ 04120000
                    UPDATE                                /* RB01308 */ 04130000
                    SEQUENTIAL                                          04140000
 /*                 ENV (FB RECSIZE(1312));           /* SOC RC01302 */ 04150000
                                                      /* SOC RB01320 */ 04160000
 /*                 ENV (FB RECSIZE(1330));*/         /* EOC RC01302 */ 04170000
                    ENV (FB RECSIZE(1360));           /* EOC RB01320 */ 04180000
                                                                        04190000
 ON ENDFILE (RCBDRI1)                                 /* SOC RB01308 */ 04200000
   BEGIN;                                                               04210000
      SWITCH_END_OF_RCBDRI1 = TRUE;                                     04220000
   END;                                               /* EOC RB01308 */ 04230000
1/********************************************************************/ 04240000
 /* DB2 TABLE STRUCTURES                                             */ 04250000
 /********************************************************************/ 04260000
 DCL 1 TB_RCBV030,                                                      04270000
      %INCLUDE (RCB030S);;                                              04280000
                                                                        04290000
 DCL 1 TB_RCBV110,                                                      04300000
      %INCLUDE (RCB110S);;                                              04310000
                                                                        04320000
 DCL 1 TB_RCBV240,                                                      04330000
      %INCLUDE (RCB240S);;                                              04340000
                                                                        04350000
 DCL 1 TB_RCBV260,                                                      04360000
      %INCLUDE (RCB260S);;                                              04370000
                                                                        04380000
 DCL 1 TB_RCBV300,                                                      04390000
      %INCLUDE (RCB300S);;                                              04400000
                                                                        04410000
 DCL 1 TB_RCBV380,                                                      04420000
      %INCLUDE (RCB380S);;                                              04430000
                                                                        04440000
 DCL 1 TB_RCBV340,                                                      04450000
      %INCLUDE (RCB340S);;                                              04460000
                                                                        04470000
                                                       /* SOC RC01362 */04471019
 /*DCL 1 TB_RCBV400,                                */ /* SOC RB01272 */04480020
 /* %INCLUDE (RCB400S);;                                                04490020
 DCL 1 TB_RCBV400_I,                                                    04500016
      %INCLUDE (RCB400SI);;                         *//* EOC RB01272 */ 04510020
                                                      /* EOC RC01362 */ 04511019
                                                                        04520000
 DCL 1 TB_RCBV470,                                    /* SOC RC01194 */ 04530000
      %INCLUDE (RCB470S);;                                              04540000
 DCL 1 TB_RCBV470_I,                                                    04550000
      %INCLUDE (RCB470SI);;                           /* EOC RC01194 */ 04560000
                                                                        04570000
 DCL 1 TB_RCBV475,                                    /* SOC RC01194 */ 04580000
      %INCLUDE (RCB475S);;                                              04590000
 DCL 1 TB_RCBV475_I,                                                    04600000
      %INCLUDE (RCB475SI);;                           /* EOC RC01194 */ 04610000
                                                                        04620000
 DCL 1 TB_RCBV500,                                                      04630000
      %INCLUDE (RCB500S);;                                              04640000
 DCL 1 TB_RCBV500_I,                                                    04650000
      %INCLUDE (RCB500SI);;                                             04660000
 DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  04670000
      %INCLUDE (RCBP05S);;                                              04680000
 DCL 1 TB_RCBP24S            BASED (ADDR(TB_RCBV500)),                  04690000
      %INCLUDE (RCBP24S);;                                              04700000
 DCL 1 TB_RCBP103S           BASED (ADDR(TB_RCBV500)),  /*   RB01278 */ 04710000
      %INCLUDE (RCBP103S);;                             /*   RB01278 */ 04720000
                                                                        04730000
 DCL 1 TB_RCBV610,                                                      04740000
      %INCLUDE (RCB610S);;                                              04750000
 DCL 1 TB_RCBV610_I,                                                    04760000
      %INCLUDE (RCB610SI);;                                             04770000
                                                                        04780000
 DCL 1 TB_RCBV645,                                    /* SOC RC01279 */ 04790000
      %INCLUDE (RCB645S);;                                              04800000
 DCL 1 TB_RCBV645_I,                                                    04810000
      %INCLUDE (RCB645SI);;                           /* EOC RC01279 */ 04820000
                                                                        04830000
 DCL 1 TB_RCBV680,                                    /* SOC PTM1401 */ 04840000
      %INCLUDE (RCB680S);;                                              04850000
 DCL 1 TB_RCBV680_I,                                                    04860000
      %INCLUDE (RCB680SI);;                           /* EOC PTM1401 */ 04870000
 DCL 1 TB_RCB063S        BASED (ADDR(TB_RCBV500)),    /*RB01281*/       04880000
       %INCLUDE (RCBP63S);;                           /*RB01281*/       04890000
                                                                        04900000
 DCL 1 TB_RCBP70S            BASED (ADDR(TB_RCBV500)),    /* RB01290 */ 04910000
      %INCLUDE (RCBP70S);;                                /* RB01290 */ 04920000
                                                                        04930000
 DCL 1 TB_RCBP64S            BASED (ADDR(TB_RCBV500)),    /* RB01298 */ 04940000
      %INCLUDE (RCBP64S);;                                /* RB01298 */ 04950000
                                                                        04960000
 DCL 1 TB_RCBV630,                                    /* SOC RC01326 */ 04961000
      %INCLUDE (RCB630S);;                                              04962000
                                                                        04963000
 DCL 1 TB_RCBV630_I,                                                    04964000
      %INCLUDE (RCB630SI);;                                             04965000
                                                                        04966000
 DCL 1 TB_RCBV635,                                                      04967000
      %INCLUDE (RCB635S);;                                              04968000
                                                                        04969000
 DCL 1 TB_RCBV635_I,                                                    04969100
      %INCLUDE (RCB635SI);;                           /* EOC RC01326 */ 04969200
                                                                        04969300
1/********************************************************************/ 04970000
 /* SELECT STRUCTURES                                                */ 04980000
 /********************************************************************/ 04990000
                                                                        05000000
 DCL 1 CURSOR_INST_HW_V190,                                             05010000
      %INCLUDE (RCB190S);;                                              05020000
 DCL 1 CURSOR_INST_HW_V170,                                             05030000
      %INCLUDE (RCB170S);;                                              05040000
 DCL 1 CURSOR_INST_HW_V220,                                             05050000
      %INCLUDE (RCB220S);;                                              05060000
                                                                        05070000
 DCL 1 CURSOR_OO_HW_V260,                                               05080000
      %INCLUDE (RCB260S);;                                              05090000
                                                                        05100000
 DCL 1 CURSOR_HW_PI,                                      /* RC01158 */ 05110000
        %INCLUDE (RCB051S);;                              /* RC01158 */ 05120000
 DCL 1 CURSOR_CTR_PI,                                     /* RC01158 */ 05130000
        %INCLUDE (RCB241S);;                              /* RC01158 */ 05140000
 DCL 1 TB_RCBV125,                                        /* RB01320 */ 05150000
      % INCLUDE (RCB125S);;                               /* RB01320 */ 05160000
                                                                        05170000
 /********************************************************************/ 05180000
 /*  RECORD STRUCTURES                                               */ 05190000
 /********************************************************************/ 05200000
 /*DCL IO_AREA_RCBDRI1        CHAR(1312);             /* SOC RC01302 */ 05210000
                                                      /* SOC RB01320 */ 05220000
 /*DCL IO_AREA_RCBDRI1        CHAR(1330);*/           /* EOC RC01302 */ 05230000
 DCL IO_AREA_RCBDRI1        CHAR(1360);               /* EOC RB01320 */ 05240000
 DCL 1 FILE_RCBDRI1 BASED(ADDR(IO_AREA_RCBDRI1)),                       05250000
      %INCLUDE (RCBDRIS);;                                              05260000
                                                                        05270000
 DCL FILE_RCBDRI1_AAS_ADD              CHAR(05)                         05280000
 /*          BASED(ADDR(FILE_RCBDRI1.FILL03));        /* SOC RC01302 */ 05290000
             BASED(ADDR(FILE_RCBDRI1.ADDRESS_NUMBER));/* EOC RC01302 */ 05300000
                                                                        05310000
                                                      /* SOC RC01158 */ 05320000
 DCL 1 USER_FILE_RCBDRI1 LIKE FILE_RCBDRI1;                             05330000
                                                                        05340000
 DCL 1 USER_FILE_PI      LIKE FILE_RCBDRI1;                             05350000
 DCL 1 USER_FILE_BAU     LIKE FILE_RCBDRI1;                             05360000
                                                                        05370000
 DCL USER_FILE_PI_AAS_ADD              CHAR(05)                         05380000
 /*       BASED(ADDR(USER_FILE_PI.FILL03));           /* SOC RC01302 */ 05390000
          BASED(ADDR(USER_FILE_PI.ADDRESS_NUMBER));   /* EOC RC01302 */ 05400000
                                                      /* EOC RC01158 */ 05410000
                                                                        05420000
 DCL 1 FILE_RCBDRI1_H BASED(ADDR(IO_AREA_RCBDRI1)),                     05430000
      %INCLUDE (RCBD01S);;                                              05440000
                                                                        05450000
                                    /* FULL IMAGE RCMS CUSTOMER EXTR */ 05460000
                                    /* SOC RB01254 FROM 256 TO 266   */ 05470000
 DCL IO_AREA_RCBDRG2        CHAR(266) ;                                 05480000
                                    /* EOC RB01254                   */ 05490000
 DCL 1 FILE_RCBDRG2 BASED(ADDR(IO_AREA_RCBDRG2)),                       05500000
       2 DATA,                                                          05510000
      %INCLUDE (RCBDRFS);;                                              05520000
                                                                        05530000
 DCL 1 FILE_RCBDRG2_H BASED(ADDR(IO_AREA_RCBDRG2)),                     05540000
       2 DATA,                                                          05550000
      %INCLUDE (RCBD01S);;                                              05560000
 /********************************************************************/ 05570000
 /*  BIT SWITCHES                                                    */ 05580000
 /********************************************************************/ 05590000
 DCL 1 SWITCHES,                                                        05600000
     3 TRUE                          BIT (1)           INIT ('1'B),     05610000
     3 FALSE                         BIT (1)           INIT ('0'B),     05620000
                                                      /* SOC RC01158 */ 05630000
     3 SW_WARRANTY                   BIT (1)           INIT ('0'B),     05640000
                                                      /* SOC PTM1130 */ 05650000
     3 SW_MAINT_02                   BIT (1)           INIT ('0'B),     05660000
                                                      /* EOC PTM1130 */ 05670000
     3 SWITCH_EOC_PI_HW              BIT (1)           INIT ('0'B),     05680000
     3 SW_PI                         BIT (1)           INIT ('0'B),     05690000
                                                      /* EOC RC01158 */ 05700000
                                                      /* SOC RC01194 */ 05710000
     3 DATES_SWAPPED                 BIT (1)           INIT ('0'B),     05720000
                                                      /* EOC RC01194 */ 05730000
     3 SWITCH_EOC_OO_HW              BIT (1)           INIT ('0'B),     05740000
     3 SWITCH_EOC_INST_HW            BIT (1)           INIT ('0'B),     05750000
     3 SWITCH_EOC_SERV_CTR           BIT (1)           INIT ('0'B),     05760000
     3 SWITCH_END_OF_RCBDRIJ         BIT (1)           INIT ('0'B),     05770000
     3 SWITCH_END_OF_RCBDRG2         BIT (1)           INIT ('0'B),     05780000
                                                      /* SOC RB01308 */ 05790000
     3 SWITCH_END_OF_RCBDRI1         BIT (1)           INIT ('0'B),     05800000
                                                      /* EOC RB01308 */ 05810000
     3 SWITCH_CURRENT_PERIOD_FOUND   BIT (1)           INIT ('0'B),     05820000
     3 SWITCH_VENDOR_SERVICE         BIT (1)           INIT ('0'B),     05830000
                                                      /*     RB01278 */ 05840000
                                                      /* SOC RC01158 */ 05850000
                                                      /* SOC RB01298 */ 05860000
 /*  3 SWITCH_INTERNAL_MACHINE_CTR   BIT (1)           INIT ('0'B);  */ 05870000
                                                          /* RB01290 */ 05880000
     3 SWITCH_INTERNAL_MACHINE_CTR   BIT (1)           INIT ('0'B),     05890000
                                                      /* SOC RB01308 */ 05900000
     3 SWITCH_INTERNAL               BIT (1)           INIT ('0'B),     05910000
     3 SWITCH_LEASE_RENTAL           BIT (1)           INIT ('0'B),     05920000
                                                      /* EOC RB01308 */ 05930000
                                                    /* CEDS00000497 */  05940000
 /*  3 SWITCH_PIWARR_BAUCTR          BIT (1)           INIT ('0'B), */  05950000
                                                 /* SOC CEDS00000494 */ 05960000
                                                      /* EOC RB01298 */ 05970000
 /*  3 PROCESS_BRAND_WARR            BIT (1)           INIT ('1'B);*/   05980000
                                                      /* SOC RB01308 */ 05990000
 /*  3 PROCESS_BRAND_WARR            BIT (1)           INIT ('1'B),  */ 06000000
     3 PROCESS_BRAND_WARR            BIT (1)           INIT ('1'B);     06010000
                                                     /* CEDS00000491 */ 06020000
 /*  3 CURRENT_BAU_CTR_FLAG          BIT (1)           INIT ('0'B);  */ 06030000
                                                      /* EOC RB01308 */ 06040000
                                                 /* EOC CEDS00000494 */ 06050000
 DCL   SWITCH_USER_EXIT              BIT (1)           INIT ('1'B);     06060000
 DCL   DATA_ORIGIN                   CHAR(1)           INIT ('');       06070000
                                                      /* EOC RC01158 */ 06080000
 DCL   SW_ADD_H_END                  BIT (1);         /*     RB01236 */ 06090000
                                                      /* SOC RB01281 */ 06100000
 DCL   SW_FW_PROCESS_BAU             BIT (1)           INIT ('0'B);     06110000
 DCL   SW_FW_PROCESS_W1              BIT (1)           INIT ('0'B);     06120000
 DCL   SW_FW_PROCESS_W2              BIT (1)           INIT ('0'B);     06130000
                                                      /* EOC RB01281 */ 06140000
                                                      /* SOC RB01301 */ 06150000
 DCL SWITCH_EOC_T120                 BIT(01)           INIT ('0'B);     06160000
 DCL PI_PROCESS_SERV_EXT             BIT(01)           INIT ('0'B);     06170000
                                                      /* SOC RB01308 */ 06180000
 /*DCL BAU_WAR_PI_CTR_BAU_CTR          BIT(01)           INIT ('0'B);*/ 06190000
 /*DCL BAU_WAR_BAU_CTR                 BIT(01)           INIT ('0'B);*/ 06200000
 /*DCL PI_WAR_PI_CTR_BAU_CTR           BIT(01)           INIT ('0'B);*/ 06210000
                                                      /* EOC RB01308 */ 06220000
                                                      /* EOC RB01301 */ 06230000
                                                      /* SOC RB01308 */ 06240000
                                                                        06250000
 DCL 1 WRK_BAU_FLAG,                                                    06260000
      3 SW_BAU_WARR                  BIT (1),                           06270000
      3 SW_BAU_CTR                   BIT (1),                           06280000
      3 SW_INTERNAL                  BIT (1),                           06290000
      3 SW_LEASE_RENTAL              BIT (1),                           06300000
      3 SW_BAU_PERCALL               BIT (1),                           06310000
      3 SW_BAU_OO                    BIT (1);                           06320000
                                                                        06330000
 DCL 1 BAU_FLAG(5)                   LIKE WRK_BAU_FLAG;                 06340000
                                                                        06350000
 DCL 1 WRK_PI_FLAG,                                                     06360000
      3 SW_PI_WARR                   BIT (1),                           06370000
      3 SW_PI_CTR                    BIT (1),                           06380000
      3 SW_PI_PERCALL                BIT (1);                           06390000
                                                                        06400000
 DCL 1 PI_FLAG(5)                    LIKE WRK_PI_FLAG;                  06410000
                                                      /* EOC RB01308 */ 06420000
                                                      /* SOC RC01326 */ 06430000
 DCL SW_BAU_CTR_SE             BIT(1)            INIT ('0'B);           06460000
 DCL SW_PI_CTR_SE              BIT(1)            INIT ('0'B);           06470000
 DCL SW_PROCESS_SE             BIT(1)            INIT ('0'B);           06480000
 DCL SWITCH_BAU_ONLY           BIT(1)            INIT ('0'B);           06502000
 DCL SWITCH_PI_ONLY            BIT(1)            INIT ('0'B);           06503000
 DCL SWITCH_OO_ONLY            BIT(1)            INIT ('0'B);           06504000
 DCL SWITCH_BAU_PI             BIT(1)            INIT ('0'B);           06504100
 DCL SWITCH_BAU_OO             BIT(1)            INIT ('0'B);           06504200
 DCL WRK_M                     FIXED BIN(31)     INIT (0);              06504300
 DCL WRK_O                     FIXED BIN(31)     INIT (0);              06504400
 DCL WRK_P                     FIXED BIN(31)     INIT (0);              06504500
                                                      /* EOC RC01326 */ 06510000
 /********************************************************************/ 06520000
 /*  SORT FIELDS                                                     */ 06530000
 /********************************************************************/ 06540000
 DCL 1 SORT_FIELDS,                                                     06550000
    3 RETURN_CODE    FIXED BIN (31),                                    06560000
    3 MAX_STORAGE    FIXED BIN (31);                                    06570000
 /********************************************************************/ 06580000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 06590000
 /********************************************************************/ 06600000
 DCL 1 WORK_FIELDS,                                                     06610000
    3 WRK_MOD_NAME                      CHAR (08)  INIT ('RCBDRIM'),    06620000
    3 WRK_PRG_NAME                      CHAR (08)  INIT ('RCBDRIP'),    06630000
    3 WRK_FILE_NAME_I                   CHAR (07)  INIT ('RCBDRII'),    06640000
    3 WRK_FILE_NAME_J                   CHAR (07)  INIT ('RCBDRIJ'),    06650000
    3 WRK_FILE_NAME_K                   CHAR (07)  INIT ('RCBDRIK'),    06660000
    3 WRK_FILE_NAME_1                   CHAR (07)  INIT ('RCBDRI1'),    06670000
    3 WRK_FILE_NAME_G                   CHAR (07)  INIT ('RCBDRG2'),    06680000
    3 WRK_SYSTEM_TYPE                   CHAR (01)  INIT ('B'),          06690000
    3 WRK_PROC_ID                       CHAR (04),                      06700000
                                                      /* SOC RC01158 */ 06710000
    3 WRK_PI_ORIGIN                     CHAR (04),                      06720000
    3 SAV_PI_ORIGIN                     CHAR (04),        /* RB01236 */ 06730000
    3 WRK_SOURCE                        CHAR (04),        /* RC01326 */ 06731000
    3 SAVE_AAS_ADD                      CHAR (05),                      06740000
    3 SAVE_TYPESER                      CHAR (13),                      06750000
                                                      /* EOC RC01158 */ 06760000
    3 WRK_CTRYNO                        CHAR (03),                      06770000
    3 WRK_PGR_TYPE                      CHAR (03),                      06780000
    3 WRK_RUN_DATE                      CHAR (10),                      06790000
    3 HLP_EFF_DATE                      CHAR (10),        /* PTM0988 */ 06800000
    3 WRK_RUN_DATE8                     CHAR (08),                      06810000
    3 WRK_PERIOD_START_DATE             CHAR (10),                      06820000
    3 WRK_PERIOD_END_DATE               CHAR (10),                      06830000
    3 WRK_DATE                          CHAR (10),                      06840000
    3 WRK_TIME_STAMP                    CHAR (20),                      06850000
                                                      /* SOC RB01308 */ 06860000
 /* 3 WRK051_TYPE_OF_WARRANTY           CHAR (01),        /* RB01274 */ 06870000
 /* 3 WRK051_F_TYPE_OF_WARRANTY         CHAR (01),        /* RB01281 */ 06880000
                                                      /* EOC RB01308 */ 06890000
    3 WRK220_TYPE_OF_MAINT              CHAR (01),    /* CEDS00000724 */06891000
    3 WRK_INDNULL                       FIXED BIN(15),                  06900000
    3 WRK_COVERAGE_START_1_IND          FIXED BIN(15), /* SOC RC01194 */06910000
    3 WRK_COVERAGE_START_2_IND          FIXED BIN(15),                  06920000
    3 WRK_COVERAGE_START_3_IND          FIXED BIN(15),                  06930000
    3 WRK_COVERAGE_START_4_IND          FIXED BIN(15),                  06940000
    3 WRK_COVERAGE_START_5_IND          FIXED BIN(15),                  06950000
    3 WRK_COVERAGE_START_6_IND          FIXED BIN(15),                  06960000
    3 WRK_COVERAGE_START_7_IND          FIXED BIN(15),                  06970000
    3 WRK_COVERAGE_END_1_IND            FIXED BIN(15),                  06980000
    3 WRK_COVERAGE_END_2_IND            FIXED BIN(15),                  06990000
    3 WRK_COVERAGE_END_3_IND            FIXED BIN(15),                  07000000
    3 WRK_COVERAGE_END_4_IND            FIXED BIN(15),                  07010000
    3 WRK_COVERAGE_END_5_IND            FIXED BIN(15),                  07020000
    3 WRK_COVERAGE_END_6_IND            FIXED BIN(15),                  07030000
    3 WRK_COVERAGE_END_7_IND            FIXED BIN(15), /* EOC RC01194 */07040000
    3 WRK_SERVICE_TYPE_IND              FIXED BIN(15),                  07050000
    3 WRK_T051_SLC1_IND                 FIXED BIN(15), /* SOC RC01194 */07060000
    3 SAV_T051_SLC1_IND                 FIXED BIN(15), /*     RB01236 */07070000
    3 WRK_T051_SLC2_IND                 FIXED BIN(15),                  07080000
    3 SAV_T051_SLC2_IND                 FIXED BIN(15), /*     RB01236 */07090000
    3 WRK_T051_SLCC_IND                 FIXED BIN(15),                  07100000
    3 SAV_T051_SLCC_IND                 FIXED BIN(15), /*     RB01236 */07110000
    3 WRK_SDF_IND                       FIXED BIN(15),                  07120000
    3 SAV_SDF_IND                       FIXED BIN(15), /*     RB01236 */07130000
    3 WRK_T220_SLC_IND                  FIXED BIN(15),                  07140000
    3 WRK_T240_SLC_IND                  FIXED BIN(15),                  07150000
    3 WRK_T241_SLC_IND                  FIXED BIN(15), /* EOC RC01194 */07160000
    3 WRK_CNT                           FIXED BIN(15),                  07170000
    3 WRK_PI_CNT                        FIXED BIN(15),     /* RC01158 */07180000
    3 WRK_PERIOD                        LIKE FILE_RCBDRI1.SRCC0MD,      07190000
                                                       /* SOC RB01308 */07200000
    3 WRK_PI_SRCC0MD                    LIKE FILE_RCBDRI1.SRCC0MD,      07210000
    3 WRK_BAU_SRCC0MD                   LIKE FILE_RCBDRI1.SRCC0MD,      07220000
    3 WRK_BAU_PI_SRCC0MD                LIKE FILE_RCBDRI1.SRCC0MD,      07230000
    3 WRK_SAVE_SRCC0MD                  LIKE FILE_RCBDRI1.SRCC0MD,      07240000
                                                       /* EOC RB01308 */07250000
    3 WRK_PERIOD_HVP_QUANTITY           FIXED DEC(5,0),                 07260000
    3 WRK_CNT_RCBDRII                   FIXED BIN(31) INIT(0),          07270000
    3 WRK_CNT_RCBDRIJ                   FIXED BIN(31) INIT(0),          07280000
    3 WRK_CNT_RCBDRIK                   FIXED BIN(31) INIT(0),          07290000
    3 WRK_CNT_RCBDRG2                   FIXED BIN(31) INIT(0),          07300000
    3 WRK_CNT_RCBDRI1                   FIXED BIN(31) INIT(0),          07310000
    3 WRK_CNT_HIST_PERIODS              PIC'9' INIT(0),                 07320000
    3 WRK_CNT_FUT_PERIODS               PIC'9' INIT(0),                 07330000
    3 WRK_CNT_HIST_PI                   PIC'9' INIT(0),   /* RC01158 */ 07340000
    3 WRK_CNT_FUT_PI                    PIC'9' INIT(0),   /* RCO1158 */ 07350000
    3 WRK_HASH_TOTAL_1                  FIXED DEC(15) INIT(0),          07360000
    3 WRK_HASH_TOTAL_2                  FIXED DEC(15) INIT(0),          07370000
    3 WRK_PIC_10                        PIC 'Z,ZZZ,ZZZ,ZZ9',            07380000
    3 WRK_PIC_15                        PIC '(15)9',                    07390000
    3 WRK_SET_HRS                       CHAR(1),                        07400000
    3 WRK_TPMNT_VAL,                                                    07410000
      %INCLUDE (RCBZ99S);,                                              07420000
    3 WRK_OPEN_DATE_CH8                 CHAR (08)  INIT ('99999999'),   07430000
    3 WRK_OPEN_DATE_CH10                CHAR (10)  INIT ('9999-12-31'), 07440000
                                                      /* SOC RB01308 */ 07450000
 /* 3 WRK_LENOVO_DATE                   CHAR (10), */     /* RB01272 */ 07460000
                                                      /* EOC RB01308 */ 07470000
    3 WRK_FW_END_DATE_BAU               CHAR (10),        /* RB01281 */ 07480000
    3 WRK_FW_END_DATE_PI                CHAR (10),        /* RB01281 */ 07490000
    3 WRK_CONTNO_V240_IND               FIXED BIN(15),    /* RB01290 */ 07500000
    3 WRK_TOC_V30_IND                   FIXED BIN(15),    /* RB01290 */ 07510000
    3 WRK_CUSTOMER_NUMBER_V10           CHAR (08),      /*SOC RB01289 */07520000
    3 WRK_CUSTNO_V10_IND                FIXED BIN(15),                  07530000
    3 WRK_CUSTOMER_NUMBER_V11           CHAR (08),                      07540000
    3 WRK_CUSTNO_V11_IND                FIXED BIN(15),                  07550000
    3 WRK_CUSTOMER_NUMBER_V190          CHAR (08),                      07560000
    3 WRK_CUSTNO_V190_IND               FIXED BIN(15),                  07570000
    3 WRK_OU_CODE_V170                  CHAR (07),      /*SOC RB01308 */07580000
    3 WRK_OU_CODE_V170_IND              FIXED BIN(15),  /*EOC RB01308 */07590000
                                                        /*SOC RB01298 */07600000
 /* 3 WRK_CUSTNO_V51_IND                FIXED BIN(15);  /*EOC RB01289 */07610000
                                                        /*SOC RB01320 */07620000
    3 WRK_PI_REAL_SERIAL_NO_V125     CHAR(30),                          07630000
    3 WRK_PI_REAL_SERIAL_NO_V125_IND FIXED BIN(15),                     07640000
    3 PI_REAL_SERNO                  CHAR(30),         /* SOC RC01326 */07643000
    3 PI_ORIGIN                      CHAR(02),                          07644000
    3 PI_DUMMY_ORIGIN                CHAR(02),                          07644100
    3 PI_DUMMY_SEQ_NO                CHAR(07),                          07644200
    3 PI_SEQ_NO                      CHAR(28),         /* EOC RC01326 */07645000
    3 WRK_BAU_REAL_SERIAL_NO_V125     CHAR(30),                         07650000
    3 WRK_BAU_REAL_SERIAL_NO_V125_IND FIXED BIN(15),                    07660000
    3 WRK_OO_REAL_SERIAL_NO_V125     CHAR(30),                          07670000
    3 WRK_OO_REAL_SERIAL_NO_V125_IND FIXED BIN(15),                     07680000
                                                        /*EOC RB01320 */07690000
    3 WRK_CUSTNO_V51_IND                FIXED BIN(15),                  07700000
    3 WRK_SLC2_V220_IND                 FIXED BIN(15),                  07710000
    3 WRK_TOW_V051_IND                  FIXED BIN(15),                  07720000
    3 WRK_FTOW_V051_IND                 FIXED BIN(15),                  07730000
    3 WRK_PI_HB_WED                     CHAR (10);      /*EOC RB01298 */07740000
                                                                        07750000
 DCL  WRK_QTYD                          PIC'99999' INIT(0);             07760000
 DCL  WRK_QTYH                          PIC'999V99'                     07770000
                                        BASED(ADDR(WRK_QTYD));          07780000
                                                       /* SOC RB01308 */07790000
 DCL  BAU_PI_SRCC0MD_STRNG              CHAR(236)                       07800000
                                 BASED (ADDR(WRK_BAU_PI_SRCC0MD));      07810000
 DCL  SAVE_SRCC0MD_STRNG                CHAR(236)                       07820000
                                 BASED (ADDR(WRK_SAVE_SRCC0MD));        07830000
                                                       /* EOC RB01308 */07840000
 DCL I FIXED BIN(15);                                                   07850000
                                                                        07860000
 DCL 1 SK_CURRENT_HW,                                                   07870000
      5 EOF                             CHAR(01),                       07880000
      5 PRODUCT_TYPE                    CHAR(04),                       07890000
      5 ORIGIN                          CHAR(02),                       07900000
      5 SEQUENCE_NUMBER                 CHAR(28),         /* RB01242 */ 07910000
      5 EFFECTIVE_DATE                  CHAR(10),                       07920000
      5 END_DATE                        CHAR(10);                       07930000
                                                                        07940000
 DCL 1 SK_CURRENT_HW_1   BASED(ADDR(SK_CURRENT_HW)) CHAR(35);           07950000
                                                                        07960000
 DCL 1 SK_INST_HW LIKE SK_CURRENT_HW;                                   07970000
 DCL 1 SK_INST_HW_1   BASED(ADDR(SK_INST_HW)) CHAR(35);   /* RB01242 */ 07980000
                                                                        07990000
 DCL 1 SK_INST_HW_2   BASED(ADDR(SK_INST_HW)) CHAR(45);   /* RB01242 */ 08000000
                                                                        08010000
 DCL 1 SK_OO_HW LIKE SK_CURRENT_HW;                                     08020000
 DCL 1 SK_OO_HW_1   BASED(ADDR(SK_OO_HW)) CHAR(35);    /* RB01242 */    08030000
 DCL 1 SK_OO_HW_2   BASED(ADDR(SK_OO_HW)) CHAR(45);    /* RB01242 */    08040000
                                                                        08050000
 DCL 1 SK_PI_HW LIKE SK_CURRENT_HW;                       /* RC01158 */ 08060000
 DCL 1 SK_PI_HW_1   BASED(ADDR(SK_PI_HW)) CHAR(35);       /* RB01242 */ 08070000
                                                                        08080000
 DCL 1 SK_HW_TEMP,                                     /*SOC RB01301 */ 08090000
       3 PRODUCT_TYPE                   CHAR(04),                       08100000
       3 ORIGIN                         CHAR(02),                       08110000
       3 SEQUENCE_NUMBER                CHAR(07);      /*EOC RB01301 */ 08120000
                                                                        08130000
 DCL 1 SAV_PI_HW,                                         /* RB01236 */ 08140000
       3 PRODUCT_TYPE                   CHAR(04),                       08150000
       3 ORIGIN                         CHAR(02),                       08160000
       3 SEQUENCE_NUMBER                CHAR(07);                       08170000
                                                                        08180000
 DCL 1 SK_RCBDRG2,                                                      08190000
       3 EOF                              CHAR(01),                     08200000
       3 CUSTOMER_NUMBER                  CHAR(08),                     08210000
       3 IODPDBU                          CHAR(08),                     08220000
       3 AAS_ADD                          CHAR(05);                     08230000
                                                                        08240000
 DCL 1 SK_RCBDRIJ LIKE SK_RCBDRG2;                                      08250000
                                                                        08260000
 DCL 1 DATE_ROW     BASED,                             /*SOC RC01194 */ 08270000
       3 TYPE       CHAR(03),                                           08280000
       3 ISO_DATE   CHAR(10),                                           08290000
       3 WARRANTY   CHAR(01),                                           08300000
       3 SERVICE    CHAR(01),                                           08310000
       3 CTR_INDEX  FIXED BIN(15);                     /* RB01236    */ 08320000
                                                                        08330000
 %DCL TABMAX FIXED                     /* NUMBER OF TABLE ENTRIES   */; 08340000
 %TABMAX = 40                          /* SETTING IT TO 40 - RB01236*/; 08350000
 DCL 1 NUMBER_OF_DATES          FIXED BIN(31);                          08360000
 DCL 1 MAX_NUMBER_OF_DATES      FIXED BIN(31)  INIT(TABMAX);            08370000
 DCL 1 DATE_TABLE(TABMAX)                      LIKE DATE_ROW;           08380000
 DCL 1 SAVE_DATE_ROW                           LIKE DATE_ROW;           08390000
 DCL 1 DATES_COUNTER            FIXED BIN(31);                          08400000
                                               /* SOC RB01236        */ 08410000
 DCL 1 SAVED_HW_PI         LIKE CURSOR_HW_PI;  /* T0051 INVENT.RECORD*/ 08420000
 DCL 1 COPY_HW_PI_SDF           CHAR(03);      /* FOR DB2 USAGE      */ 08430000
 DCL 1 SAVED_CTR_PI(20)    LIKE CURSOR_CTR_PI; /* T0241-ROWS PER TOS */ 08440000
 DCL 1 CTR_COUNT                FIXED BIN(15); /* T0241-ROW COUNTER  */ 08450000
                                               /* EOC RB01236        */ 08460000
 DCL DATE_ARRAY(20)            CHAR(8);               /* SOC RB01308 */ 08470000
 DCL SAVE_DATE                 CHAR(8);                                 08480000
 DCL WRK_SAVE_EFF              CHAR(8);                                 08490000
 DCL WRK_SAVE_END              CHAR(8);                                 08500000
 DCL NUM_OF_DATES              FIXED BIN(31);                           08510000
 DCL TMP_PI_BASE_WARRANTY_SLC  CHAR(3);                                 08520000
 DCL TMP_BAU_BASE_WARRANTY_SLC CHAR(3);                                 08530000
 DCL WRK_CNT_HIST              PIC'9' INIT(0);                          08540000
 DCL WRK_CNT_FUT               PIC'9' INIT(0);        /* EOC RB01308 */ 08550000
                                                                        08560000
 DCL C_EFF            CHAR(10);                                         08570000
 DCL C_END            CHAR(10);                                         08580000
 DCL W_EFF            CHAR(10);                                         08590000
 DCL W_SPL            CHAR(10);                                         08600000
 DCL W_END            CHAR(10);                        /* EOC RC01194 */08610000
 DCL H_END            CHAR(10);                        /*     RA01224 */08620000
 DCL 1 WRK_FW_TOW                             CHAR(01);    /* RB01298 */08630000
 DCL 1 WRK_HB_TOM                             CHAR(01);    /* RB01298 */08640000
 DCL 1 WRK_END_DATE_SAVE                      CHAR(10);                 08650000
                                                     /* CEDS00000491 */ 08660000
 DCL WRK_ORIGIN                CHAR(2) INIT (' ');     /* SOC RB01320 */08670000
 DCL WRK_SEQ_NO                CHAR(28) INIT (' ');    /* EOC RB01320 */08680000
 DCL SNAME            CHAR(03) INIT('');                /*SOC RB01301*/ 08690000
 DCL WRK051_SERVICE_DELIV_FLAG CHAR (10)  INIT('');                     08700000
                                                      /* SOC RB01308 */ 08710000
 /*DCL WRK_BAU_SLC1              CHAR (03)  INIT(''); */                08720000
 /*DCL WRK_BAU_FTOW              CHAR (01)  INIT(''); */                08730000
 /*DCL WRK_BAU_FSDT              CHAR (10)  INIT(''); */                08740000
 /*DCL WRK_BAU_SLC2              CHAR (03)  INIT(''); */                08750000
 /*DCL WRK_PI_SLC1               CHAR (03)  INIT(''); */                08760000
 /*DCL WRK_PI_FTOW               CHAR (01)  INIT(''); */                08770000
 /*DCL WRK_PI_WSDT               CHAR (10)  INIT(''); */                08780000
 /*DCL WRK_PI_SLC2               CHAR (03)  INIT(''); */                08790000
 /*DCL WRK_BAU_SLC1_INDNULL      FIXED       BIN(15); */                08800000
 /*DCL WRK_BAU_FTOW_INDNULL      FIXED       BIN(15); */                08810000
 /*DCL WRK_BAU_FSDT_INDNULL      FIXED       BIN(15); */                08820000
 /*DCL WRK_BAU_SLC2_INDNULL      FIXED       BIN(15); */                08830000
 /*DCL WRK_PI_SLC1_INDNULL       FIXED       BIN(15); */                08840000
 /*DCL WRK_PI_FTOW_INDNULL       FIXED       BIN(15); */                08850000
 /*DCL WRK_PI_WSDT_INDNULL       FIXED       BIN(15); */                08860000
                                                      /* EOC RB01308 */ 08870000
 DCL WRK_SDF_INDNULL           FIXED       BIN(15);                     08880000
 /*DCL WRK_PI_SLC2_INDNULL       FIXED       BIN(15);        RB01308 */ 08890000
 DCL WRK_X   FIXED BIN(31)     INIT (0);                                08900000
 DCL WRK_Y   FIXED BIN(31)     INIT (0);                                08910000
 /* DCL TEMP_SERV_EXTENSION(5)    CHAR(3); */   /* SOC CEDS00000536 */  08920000
 DCL TEMP_SERV_EXTENSION(5)    CHAR(3)    INIT('');                     08930000
                                                /* EOC CEDS00000536 */  08940000
 DCL BAU_SERV_EXTENSION(5)     CHAR(3)    INIT('');  /* SOC RB01308 */  08950000
 DCL PI_SERV_EXTENSION(5)      CHAR(3)    INIT('');                     08960000
 /*DCL TEMP_BASE_WARRANTY_SLC    CHAR(3);              /*EOC RB01301*/  08970000
                                                     /* EOC RB01308 */  08980000
 DCL WRK_TOC                     CHAR(10);            /* SOC RC01326 */ 08990000
 DCL WRK_SERV_EXT                CHAR(19);                              09000000
 DCL CNT_BAU_CTR_SE              FIXED BIN(31)     INIT (0);            09050000
 DCL CNT_BAU_WAR_SE              FIXED BIN(31)     INIT (0);            09060000
 DCL CNT_PI_CTR_SE               FIXED BIN(31)     INIT (0);            09070000
 DCL CNT_PI_WAR_SE               FIXED BIN(31)     INIT (0);            09080000
 DCL WRK_T240_SI                 CHAR(1);                               09080100
 DCL WRK_T240_CTR                CHAR(15);                              09080200
 DCL WRK_T240_CTR_INDNULL        FIXED BIN(15);                         09082000
 DCL BAU_SERV_EXTENSION_MESE(5)  CHAR(3)           INIT('');            09090000
 DCL PI_SERV_EXTENSION_SDF(5)    CHAR(3)           INIT('');            09100000
                                                      /* EOC RC01326 */ 09120000
                                                      /* SOC RB01327 */ 09121000
 DCL WRK_DSW_X                   CHAR(3)           INIT ('');           09122000
 DCL WRK_DSW_Y                   CHAR(3)           INIT ('');           09123000
                                                      /* EOC RB01327 */ 09124000
1/********************************************************************/ 09130000
 /*  BUILTIN FUNCTIONS                                               */ 09140000
 /********************************************************************/ 09150000
 DCL (ADDR,                                                             09160000
     DATE,                                                              09170000
     LOW,                                                               09180000
     NULL,                                                              09190000
     STG,                                                               09200000
     STRING,                                                            09210000
     SUBSTR,                                                            09220000
     SUM,                                                               09230000
     TRANSLATE,                                                         09240000
     VERIFY,                                                            09250000
     ROUND,                                                             09260000
     PLISRTA,                                                           09270000
     PLIRETC,                                                           09280000
     UNSPEC,                                                            09290000
     TIME)                   BUILTIN;                                   09300000
1/********************************************************************/ 09310000
 /* ON ERROR CONDITIONS                                              */ 09320000
 /********************************************************************/ 09330000
 %INCLUDE (RCB0E0M);                                                    09340000
 END;                                                                   09350000
1/********************************************************************/ 09360000
 /* DB2/SQL SQLCA                                                    */ 09370000
 /********************************************************************/ 09380000
 EXEC SQL                                                               09390000
   INCLUDE SQLCA                                                        09400000
   ;                                                                    09410000
 /********************************************************************/ 09420000
 /* DB2/SQL CURSORS                                                  */ 09430000
 /********************************************************************/ 09440000
                                /* RETRIEVE ALL PI HARDWARE/CONTRACT */ 09450000
   EXEC SQL                                                             09460000
     DECLARE CURSOR_PI_HW CURSOR FOR                                    09470000
     SELECT                                                             09490000
         /* B.PRODUCT_TYPE  */                    /* SOC CEDS00000719 */09491000
            A.PRODUCT_TYPE                                              09500000
           ,A.ORIGIN                                                    09510000
           ,A.SEQUENCE_NUMBER                     /* EOC CEDS00000719 */09520000
                                                      /* SOC RB01320 */ 09521000
       /*  ,B.ORIGIN                                                    09522000
           ,B.SEQUENCE_NUMBER*/                                         09523000
                                                  /* SOC CEDS00000719 */09523100
       /*  ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                 09524000
           ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM 09525000
                                                  */  /* EOC RB01320 */ 09526000
                                                  /* EOC CEDS00000719 */09527000
           ,'BOTH'                                                      09530000
           ,B.MODEL_NUMBER                                              09540000
           ,B.BUILT_TO_MODEL_NR                                         09550000
           ,B.INSTALL_DATE                                              09560000
           ,B.TYPE_OF_MAINT                                             09570000
           ,B.TYPE_OF_WARRANTY                                          09580000
           ,B.SERVICE_LVL_CODE_1                          /* RC01194 */ 09590000
           ,B.WARRANTY_SPLT_DATE                          /* RC01994 */ 09600000
           ,B.SERVICE_LVL_CODE_2                          /* RC01994 */ 09610000
           ,B.SERVICE_LVL_CODE_C                          /* RC01994 */ 09620000
           ,B.WARRANTY_EXP_DATE                                         09630000
           ,B.SERVICE_DELIV_FLAG                                        09640000
           ,B.CUSTOMER_NUMBER                                           09650000
           ,B.CUSTOMER_NR_EXTEND                                        09660000
           ,B.OU_CODE                                                   09670000
           ,B.DEALER_NUMBER                                             09680000
           ,B.SOURCE_INDICATOR                                          09690000
           ,B.F_TYPE_OF_WARRANTY                          /* RB01281*/  09700000
           ,B.WARRANTY_LIABILITY                          /* RB01283 */ 09710000
           ,C.HVP_QUANTITY                                              09720000
           ,C.CONTRACT_NUMBER                                           09730000
           ,C.SERVICE_MODULE_1                                          09740000
           ,C.SERVICE_MODULE_2                                          09750000
           ,C.SERVICE_MODULE_3                                          09760000
           ,C.SERVICE_MODULE_4                                          09770000
           ,C.SERVICE_MODULE_5                                          09780000
           ,C.COVERAGE_START_1                                          09790000
           ,C.COVERAGE_START_2                                          09800000
           ,C.COVERAGE_START_3                                          09810000
           ,C.COVERAGE_START_4                                          09820000
           ,C.COVERAGE_START_5                                          09830000
           ,C.COVERAGE_START_6                                          09840000
           ,C.COVERAGE_START_7                                          09850000
           ,C.COVERAGE_END_1                                            09860000
           ,C.COVERAGE_END_2                                            09870000
           ,C.COVERAGE_END_3                                            09880000
           ,C.COVERAGE_END_4                                            09890000
           ,C.COVERAGE_END_5                                            09900000
           ,C.COVERAGE_END_6                                            09910000
           ,C.COVERAGE_END_7                                            09920000
           ,C.SERVICE_TYPE                                              09930000
           ,C.SERVICE_LVL_CODE                            /* RC01194 */ 09940000
           ,C.SOURCE_INDICATOR                            /* PTM1408 */ 09950000
           ,C.EFFECTIVE_DATE                                            09960000
           ,C.END_DATE                                                  09970000
           ,C.AUTHORISATION_CODE                          /* RB01272 */ 09980000
           ,D.CUSTOMER_NUMBER                         /* SOC RB01289 */ 09990000
           ,E.CUSTOMER_NUMBER                                           10000000
           ,F.CUSTOMER_NUMBER                         /* EOC RB01289 */ 10001000
           ,G.OU_CODE                                     /* RB01308 */ 10002000
                                                  /* SOC CEDS00000719 */10002100
       /*  ,H.REAL_SERIAL_NUMBER    */                     /* RB01320 */10003000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               10030000
                                                  /* EOC CEDS00000719 */10031000
     FROM RCBV0722_RCMS_HW      A                                       10040000
                                                      /* SOC RB01289 */ 10041000
                                                  /* SOC CEDS00000719 */10041100
 /*  LEFT OUTER JOIN RCBV0125_DMMY_REAL   H        */  /* SOC RB01320 */10042000
 /*    ON  A.COUNTRY_NUMBER  = H.COUNTRY_NUMBER                         10044000
       AND A.PRODUCT_TYPE    = H.PRODUCT_TYPE                           10045000
       AND A.ORIGIN          = H.DUMMY_ORIGIN                           10046000
       AND A.SEQUENCE_NUMBER = H.DUMMY_SEQUENCE_NUM */                  10047000
                                                  /* EOC CEDS00000719 */10047100
                                                       /* EOC RB01320 */10048000
     INNER JOIN RCBV0051_PI_HW_PR B                                     10050000
     ON  B.PRODUCT_TYPE     = A.PRODUCT_TYPE                            10060000
   /*AND B.ORIGIN           = A.ORIGIN*/               /* SOC RB01320 */10061000
   /*AND B.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER*/                       10062000
   /*AND ((B.ORIGIN             = A.ORIGIN      *//* SOC CEDS00000719 */10063000
   /*AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER)                    10064000
     OR   (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER               10065000
     AND   B.PRODUCT_TYPE              = H.PRODUCT_TYPE                 10066000
     AND  (B.ORIGIN||B.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)          10067000
     AND  (A.ORIGIN                    = H.DUMMY_ORIGIN                 10068000
     AND   A.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM)))        10069000
                                                   *//* EOC RB01320 */  10069100
     AND ((B.ORIGIN           = A.REAL_ORIGIN                           10070000
     AND   B.SEQUENCE_NUMBER  = A.REAL_SEQ_NUM)                         10080000
     OR (  B.ORIGIN           = A.ORIGIN                                10090000
       AND B.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER))                     10100000
                                                 /* EOC CEDS00000719 */ 10101000
     AND B.COUNTRY_NUMBER   = A.COUNTRY_NUMBER                          10110000
                                                                        10120000
     INNER JOIN RCBV0241_PI_CTR C                                       10130000
     ON  C.PRODUCT_TYPE     = B.PRODUCT_TYPE                            10140000
     AND C.ORIGIN           = B.ORIGIN                                  10150000
     AND C.SEQUENCE_NUMBER  = B.SEQUENCE_NUMBER                         10160000
     AND C.COUNTRY_NUMBER   = B.COUNTRY_NUMBER                          10170000
                                                                        10180000
     LEFT OUTER JOIN RCBV0010_CUSTOMER D                                10190000
     ON  D.COUNTRY_NUMBER      = B.COUNTRY_NUMBER                       10200000
     AND D.CUSTOMER_NUMBER     = B.CUSTOMER_NUMBER                      10210000
     AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE          10220000
                                                                        10230000
     LEFT OUTER JOIN RCBV0011_PI_CUST      E                            10240000
     ON  E.COUNTRY_NUMBER      = B.COUNTRY_NUMBER                       10250000
     AND E.CUSTOMER_NUMBER     = B.CUSTOMER_NUMBER                      10260000
     AND E.CUSTOMER_NR_EXTEND  = B.CUSTOMER_NR_EXTEND                   10270000
                                                                        10280000
     LEFT OUTER JOIN RCBV0190_HW_CUST   F                               10290000
       ON  B.PRODUCT_TYPE       = F.PRODUCT_TYPE                        10300000
     /*AND B.ORIGIN             = F.ORIGIN*/           /* SOC RB01320 */10301000
     /*AND B.SEQUENCE_NUMBER    = F.SEQUENCE_NUMBER*/                   10302000
     /*AND ((B.ORIGIN              = F.ORIGIN    *//*SOC CEDS00000719 */10303000
     /*AND B.SEQUENCE_NUMBER       = F.SEQUENCE_NUMBER)                 10304000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            10305000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              10306000
       AND  (F.ORIGIN||F.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       10307000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              10308000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))     10309000
                                                    */ /* EOC RB01320 */10309100
       AND A.REAL_ORIGIN        = F.ORIGIN                              10310000
       AND A.REAL_SEQ_NUM       = F.SEQUENCE_NUMBER                     10320000
                                                  /* EOC CEDS00000719 */10321000
       AND B.COUNTRY_NUMBER     = F.COUNTRY_NUMBER                      10330000
       AND F.TYPE_OF_RELATION   = 'U'               /* CEDS00000468 */  10340000
       AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE        10350000
                                                                        10360000
     LEFT OUTER JOIN RCBV0170_OU_HW     G            /* SOC RB01308 */  10370000
       ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                        10380000
     /*AND B.ORIGIN             = G.ORIGIN*/           /* SOC RB01320 */10381000
     /*AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER*/                   10382000
     /*AND ((B.ORIGIN             = G.ORIGIN     *//*SOC CEDS00000719 */10383000
     /*AND B.SEQUENCE_NUMBER      = G.SEQUENCE_NUMBER)                  10384000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            10385000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              10386000
       AND  (G.ORIGIN||G.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       10387000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              10388000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))     10389000
                                                     *//* EOC RB01320 */10389100
       AND A.REAL_ORIGIN        = G.ORIGIN                              10390000
       AND A.REAL_SEQ_NUM       = G.SEQUENCE_NUMBER                     10400000
                                                  /* EOC CEDS00000719 */10401000
       AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      10410000
       AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE        10420000
                                                     /* EOC RB01308 */  10421000
     WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                             10430000
     AND C.EFFECTIVE_DATE    <= :WRK_PERIOD_END_DATE                    10440000
     AND C.END_DATE          >= :WRK_PERIOD_START_DATE                  10450000
                                                                        10460000
  /*     ,RCBV0051_PI_HW_PR     B                                       10461000
         ,RCBV0241_PI_CTR       C                                       10462000
                                                                        10463000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           10464000
                                                                        10465000
       AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        10466000
       AND B.ORIGIN             = A.ORIGIN                              10467000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     10468000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      10469000
                                                         /* PTM1313 */  10469100
   /*  AND B.INSTALL_DATE      <= :WRK_PERIOD_END_DATE   */             10469200
                                                                        10469300
   /*  AND C.PRODUCT_TYPE       = B.PRODUCT_TYPE                        10469400
       AND C.ORIGIN             = B.ORIGIN                              10469500
       AND C.SEQUENCE_NUMBER    = B.SEQUENCE_NUMBER                     10469600
       AND C.COUNTRY_NUMBER     = B.COUNTRY_NUMBER                      10469700
       AND C.EFFECTIVE_DATE    <= :WRK_PERIOD_END_DATE                  10469800
       AND C.END_DATE          >= :WRK_PERIOD_START_DATE     */         10469900
                                                      /* EOC RB01289 */ 10470000
     UNION                                                              10471000
                                                                        10480000
     SELECT                                                             10490000
        /*  B.PRODUCT_TYPE  */                   /* SOC CEDS00000719 */ 10491000
            A.PRODUCT_TYPE                                              10491100
           ,A.ORIGIN                                                    10491200
           ,A.SEQUENCE_NUMBER                    /* EOC CEDS00000719 */ 10491300
                                                      /* SOC RB01320 */ 10492000
        /* ,B.ORIGIN                                                    10493000
           ,B.SEQUENCE_NUMBER */                                        10494000
                                                 /* SOC CEDS00000719 */ 10494100
        /* ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                 10495000
           ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM 10496000
                                                   */ /* EOC RB01320 */ 10497000
                                                 /* EOC CEDS00000719 */ 10498000
           ,'T051'                                                      10530000
           ,B.MODEL_NUMBER                                              10540000
           ,B.BUILT_TO_MODEL_NR                                         10550000
           ,B.INSTALL_DATE                                              10560000
           ,B.TYPE_OF_MAINT                                             10570000
           ,B.TYPE_OF_WARRANTY                                          10580000
           ,B.SERVICE_LVL_CODE_1                          /* RC01194 */ 10590000
           ,B.WARRANTY_SPLT_DATE                          /* RC01994 */ 10600000
           ,B.SERVICE_LVL_CODE_2                          /* RC01994 */ 10610000
           ,B.SERVICE_LVL_CODE_C                          /* RC01994 */ 10620000
           ,B.WARRANTY_EXP_DATE                                         10630000
           ,B.SERVICE_DELIV_FLAG                                        10640000
           ,B.CUSTOMER_NUMBER                                           10650000
           ,B.CUSTOMER_NR_EXTEND                                        10660000
           ,B.OU_CODE                                                   10670000
           ,B.DEALER_NUMBER                                             10680000
           ,B.SOURCE_INDICATOR                                          10690000
           ,B.F_TYPE_OF_WARRANTY                          /* RB01281 */ 10700000
           ,B.WARRANTY_LIABILITY                          /* RB01283 */ 10710000
           ,0                                                           10720000
           ,''                                                          10730000
           ,''                                                          10740000
           ,''                                                          10750000
           ,''                                                          10760000
           ,''                                                          10770000
           ,''                                                          10780000
           ,TIME('00.00.00')                                            10790000
           ,TIME('00.00.00')                                            10800000
           ,TIME('00.00.00')                                            10810000
           ,TIME('00.00.00')                                            10820000
           ,TIME('00.00.00')                                            10830000
           ,TIME('00.00.00')                                            10840000
           ,TIME('00.00.00')                                            10850000
           ,TIME('00.00.00')                                            10860000
           ,TIME('00.00.00')                                            10870000
           ,TIME('00.00.00')                                            10880000
           ,TIME('00.00.00')                                            10890000
           ,TIME('00.00.00')                                            10900000
           ,TIME('00.00.00')                                            10910000
           ,TIME('00.00.00')                                            10920000
           ,''                                                          10930000
           ,''                                            /* RC01194 */ 10940000
           ,''                                            /* PTM1408 */ 10950000
           ,DATE('1900-01-01')                                          10960000
                                                      /* SOC PTM1170 */ 10970000
           ,DATE('9999-12-31')                                          10980000
           ,''                                            /* RB01272 */ 10990000
           ,D.CUSTOMER_NUMBER                         /* SOC RB01289 */ 11000000
           ,E.CUSTOMER_NUMBER                                           11010000
           ,F.CUSTOMER_NUMBER                         /* EOC RB01289 */ 11020000
                                                      /* EOC PTM1170 */ 11030000
           ,G.OU_CODE                                     /* RB01308 */ 11040000
                                                 /* SOC CEDS00000719 */ 11040100
       /*  ,H.REAL_SERIAL_NUMBER     */                    /* RB01320 */11041000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               11050000
                                                 /* EOC CEDS00000719 */ 11051000
     FROM RCBV0722_RCMS_HW      A                                       11060000
                                                  /* SOC CEDS00000719 */11061000
   /*LEFT OUTER JOIN RCBV0125_DMMY_REAL   H         */ /* SOC RB01320 */11062000
   /*  ON  A.COUNTRY_NUMBER  = H.COUNTRY_NUMBER                         11063000
       AND A.PRODUCT_TYPE    = H.PRODUCT_TYPE                           11064000
       AND A.ORIGIN          = H.DUMMY_ORIGIN                           11065000
       AND A.SEQUENCE_NUMBER = H.DUMMY_SEQUENCE_NUM */                  11066000
                                                       /* EOC RB01320 */11067000
                                                  /* EOC CEDS00000719 */11067100
     INNER JOIN RCBV0051_PI_HW_PR       B             /* SOC RB01289 */ 11068000
       ON  B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        11080000
     /*AND B.ORIGIN             = A.ORIGIN*/           /* SOC RB01320 */11081000
     /*AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER*/                   11082000
     /*AND ((B.ORIGIN             = A.ORIGIN     *//*SOC CEDS00000719 */11083000
     /*AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER )                 11084000
       OR  (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER              11085000
       AND  B.PRODUCT_TYPE              = H.PRODUCT_TYPE                11086000
       AND (B.ORIGIN||B.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)         11087000
       AND (A.ORIGIN                    = H.DUMMY_ORIGIN                11088000
       AND  A.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM)))       11089000
                                                    */ /* EOC RB01320 */11089100
       AND B.ORIGIN           = A.ORIGIN                                11090000
       AND B.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER                       11100000
                                                 /* EOC CEDS00000719 */ 11101000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      11110000
     LEFT OUTER JOIN RCBV0010_CUSTOMER  D                               11120000
       ON  B.COUNTRY_NUMBER     = D.COUNTRY_NUMBER                      11130000
       AND B.CUSTOMER_NUMBER    = D.CUSTOMER_NUMBER                     11140000
       AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE        11150000
     LEFT OUTER JOIN RCBV0011_PI_CUST   E                               11160000
       ON  B.COUNTRY_NUMBER     = E.COUNTRY_NUMBER                      11170000
       AND B.CUSTOMER_NUMBER    = E.CUSTOMER_NUMBER                     11180000
       AND E.CUSTOMER_NR_EXTEND = B.CUSTOMER_NR_EXTEND                  11190000
     LEFT OUTER JOIN RCBV0190_HW_CUST   F                               11200000
       ON  B.PRODUCT_TYPE       = F.PRODUCT_TYPE                        11210000
     /*AND B.ORIGIN             = F.ORIGIN*/           /* SOC RB01320 */11211000
     /*AND B.SEQUENCE_NUMBER    = F.SEQUENCE_NUMBER*/                   11213000
     /*AND ((B.ORIGIN             = F.ORIGIN         SOC CEDS00000719 */11214000
     /*AND B.SEQUENCE_NUMBER      = F.SEQUENCE_NUMBER)                  11215000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            11216000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              11217000
       AND  (F.ORIGIN||F.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       11218000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              11219000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))     11219100
                                                    */ /* EOC RB01320 */11219200
       AND A.REAL_ORIGIN        = F.ORIGIN                              11220000
       AND A.REAL_SEQ_NUM       = F.SEQUENCE_NUMBER                     11230000
                                                 /* EOC CEDS00000719 */ 11231000
       AND B.COUNTRY_NUMBER     = F.COUNTRY_NUMBER                      11240000
       AND F.TYPE_OF_RELATION   = 'U'               /* CEDS00000468 */  11250000
       AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE        11260000
                                                                        11270000
     LEFT OUTER JOIN RCBV0170_OU_HW     G             /* SOC RB01308 */ 11280000
       ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                        11290000
     /*AND B.ORIGIN             = G.ORIGIN*/           /* SOC RB01320 */11291000
     /*AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER*/                   11292000
     /*AND ((B.ORIGIN           = G.ORIGIN          SOC CEDS00000719 */ 11293000
     /*AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER)                    11294000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            11295000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              11296000
       AND  (G.ORIGIN||G.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       11297000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              11298000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))     11299000
                                                   */  /* EOC RB01320 */11299100
       AND A.REAL_ORIGIN        = G.ORIGIN                              11300000
       AND A.REAL_SEQ_NUM       = G.SEQUENCE_NUMBER                     11310000
                                                  /* EOC CEDS00000719 */11311000
       AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      11320000
       AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE        11330000
                                                      /* EOC RB01308 */ 11340000
       WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                           11350000
       AND B.WARRANTY_EXP_DATE >= :WRK_PERIOD_START_DATE                11360000
                                                                        11361000
 /*       ,RCBV0051_PI_HW_PR     B                                      11362000
                                                                        11363000
 /*    WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                         11364000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER        /* RC01194 */ 11365000
 /*      AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                      11366000
       AND B.ORIGIN             = A.ORIGIN                              11367000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     11368000
                                                         /* PTM1313 */  11369000
   /*  AND B.INSTALL_DATE      <= :WRK_PERIOD_END_DATE   */             11369100
 /* AND B.WARRANTY_EXP_DATE >= :WRK_PERIOD_START_DATE /* EOC RB01289 */ 11369200
                                                                        11369300
       AND NOT EXISTS (                                                 11370000
           SELECT *                                                     11380000
           FROM RCBV0241_PI_CTR     C                                   11390000
           WHERE C.COUNTRY_NUMBER   = :WRK_CTRYNO                       11400000
             AND C.PRODUCT_TYPE     = B.PRODUCT_TYPE                    11410000
             AND C.ORIGIN           = B.ORIGIN                          11420000
             AND C.SEQUENCE_NUMBER  = B.SEQUENCE_NUMBER                 11430000
             AND C.EFFECTIVE_DATE  <= :WRK_PERIOD_END_DATE              11440000
             AND C.END_DATE        >= :WRK_PERIOD_START_DATE            11450000
           )                                                            11460000
                                                                        11470000
                                                  /* SOC CEDS00000719 */11471000
     UNION                                                              11480000
                                                                        11490000
     SELECT                                                             11500000
            A.PRODUCT_TYPE                                              11510000
           ,A.ORIGIN                                                    11520000
           ,A.SEQUENCE_NUMBER                                           11530000
           ,'T051'                                                      11540000
           ,B.MODEL_NUMBER                                              11550000
           ,B.BUILT_TO_MODEL_NR                                         11560000
           ,B.INSTALL_DATE                                              11570000
           ,B.TYPE_OF_MAINT                                             11580000
           ,B.TYPE_OF_WARRANTY                                          11590000
           ,B.SERVICE_LVL_CODE_1                                        11600000
           ,B.WARRANTY_SPLT_DATE                                        11610000
           ,B.SERVICE_LVL_CODE_2                                        11620000
           ,B.SERVICE_LVL_CODE_C                                        11630000
           ,B.WARRANTY_EXP_DATE                                         11640000
           ,B.SERVICE_DELIV_FLAG                                        11650000
           ,B.CUSTOMER_NUMBER                                           11660000
           ,B.CUSTOMER_NR_EXTEND                                        11670000
           ,B.OU_CODE                                                   11680000
           ,B.DEALER_NUMBER                                             11690000
           ,B.SOURCE_INDICATOR                                          11700000
           ,B.F_TYPE_OF_WARRANTY                                        11710000
           ,B.WARRANTY_LIABILITY                                        11720000
           ,0                                                           11730000
           ,''                                                          11740000
           ,''                                                          11750000
           ,''                                                          11760000
           ,''                                                          11770000
           ,''                                                          11780000
           ,''                                                          11790000
           ,TIME('00.00.00')                                            11800000
           ,TIME('00.00.00')                                            11810000
           ,TIME('00.00.00')                                            11820000
           ,TIME('00.00.00')                                            11830000
           ,TIME('00.00.00')                                            11840000
           ,TIME('00.00.00')                                            11850000
           ,TIME('00.00.00')                                            11860000
           ,TIME('00.00.00')                                            11870000
           ,TIME('00.00.00')                                            11880000
           ,TIME('00.00.00')                                            11890000
           ,TIME('00.00.00')                                            11900000
           ,TIME('00.00.00')                                            11910000
           ,TIME('00.00.00')                                            11920000
           ,TIME('00.00.00')                                            11930000
           ,''                                                          11940000
           ,''                                                          11950000
           ,''                                                          11960000
           ,DATE('1900-01-01')                                          11970000
                                                                        11980000
           ,DATE('9999-12-31')                                          11990000
           ,''                                                          12000000
           ,D.CUSTOMER_NUMBER                                           12010000
           ,E.CUSTOMER_NUMBER                                           12020000
           ,F.CUSTOMER_NUMBER                                           12030000
           ,G.OU_CODE                                                   12050000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               12060000
     FROM RCBV0722_RCMS_HW          A                                   12070000
     INNER JOIN RCBV0051_PI_HW_PR           B                           12080000
       ON  B.PRODUCT_TYPE     = A.PRODUCT_TYPE                          12090000
       AND B.ORIGIN           = A.REAL_ORIGIN                           12100000
       AND B.SEQUENCE_NUMBER  = A.REAL_SEQ_NUM                          12110000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      12120000
     LEFT OUTER JOIN RCBV0010_CUSTOMER      D                           12130000
       ON  B.COUNTRY_NUMBER     = D.COUNTRY_NUMBER                      12140000
       AND B.CUSTOMER_NUMBER    = D.CUSTOMER_NUMBER                     12150000
       AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE        12160000
     LEFT OUTER JOIN RCBV0011_PI_CUST       E                           12170000
       ON  B.COUNTRY_NUMBER     = E.COUNTRY_NUMBER                      12180000
       AND B.CUSTOMER_NUMBER    = E.CUSTOMER_NUMBER                     12190000
       AND E.CUSTOMER_NR_EXTEND = B.CUSTOMER_NR_EXTEND                  12200000
     LEFT OUTER JOIN RCBV0190_HW_CUST       F                           12210000
       ON  B.PRODUCT_TYPE       = F.PRODUCT_TYPE                        12220000
       AND A.REAL_ORIGIN        = F.ORIGIN                              12230000
       AND A.REAL_SEQ_NUM       = F.SEQUENCE_NUMBER                     12240000
       AND B.COUNTRY_NUMBER     = F.COUNTRY_NUMBER                      12250000
       AND F.TYPE_OF_RELATION   = 'U'                                   12260000
       AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE        12270000
                                                                        12280000
     LEFT OUTER JOIN RCBV0170_OU_HW         G                           12290000
       ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                        12300000
       AND A.REAL_ORIGIN        = G.ORIGIN                              12310000
       AND A.REAL_SEQ_NUM       = G.SEQUENCE_NUMBER                     12320000
       AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      12330000
       AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE        12340000
                                                                        12350000
       WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                           12360000
       AND B.WARRANTY_EXP_DATE >= :WRK_PERIOD_START_DATE                12370000
       AND NOT EXISTS (                                                 12380000
           SELECT *                                                     12390000
           FROM RCBV0241_PI_CTR         C                               12400000
           WHERE C.COUNTRY_NUMBER   = :WRK_CTRYNO                       12410000
             AND C.PRODUCT_TYPE     = B.PRODUCT_TYPE                    12420000
             AND C.ORIGIN           = B.ORIGIN                          12430000
             AND C.SEQUENCE_NUMBER  = B.SEQUENCE_NUMBER                 12440000
             AND C.EFFECTIVE_DATE  <= :WRK_PERIOD_END_DATE              12450000
             AND C.END_DATE        >= :WRK_PERIOD_START_DATE            12460000
           )                                     /* EOC CEDS00000719 */ 12470000
                                                                        12480000
     UNION                                                              12490000
                                                                        12500000
     SELECT                                                             12510000
       /*   C.PRODUCT_TYPE                             CEDS00000719 */  12511000
                                                      /* SOC RB01320 */ 12512000
       /*  ,C.ORIGIN                                                    12513000
           ,C.SEQUENCE_NUMBER */                                        12514000
                                                /* SOC CEDS00000719 */  12514100
       /*  ,COALESCE(D.DUMMY_ORIGIN,C.ORIGIN) AS ORIGIN                 12515000
           ,COALESCE(D.DUMMY_SEQUENCE_NUM,C.SEQUENCE_NUMBER) AS SEQ_NUM 12516000
                                                  */  /* EOC RB01320 */ 12517000
            A.PRODUCT_TYPE                                              12520000
           ,A.ORIGIN                                                    12530000
           ,A.SEQUENCE_NUMBER                                           12540000
                                                /* EOC CEDS00000719 */  12550000
           ,'T241'                                                      12560000
           ,''                                                          12570000
           ,''                                                          12580000
           ,C.EFFECTIVE_DATE                                            12590000
           ,''                                                          12600000
           ,''                                                          12610000
           ,''                                            /* RC01194 */ 12620000
           ,DATE('3999-12-31')                            /* RC01194 */ 12630000
           ,''                                            /* RC01194 */ 12640000
           ,''                                            /* RC01194 */ 12650000
           ,DATE('9999-12-31')                                          12660000
           ,''                                                          12670000
           ,C.CUSTOMER_NUMBER                             /* RB01289 */ 12680000
           ,''                                                          12690000
           ,''                                                          12700000
           ,''                                                          12710000
           ,''                                            /* PTM1408 */ 12720000
           ,''                                            /* RB01281 */ 12730000
           ,''                                            /* RB01283 */ 12740000
           ,C.HVP_QUANTITY                                              12750000
           ,C.CONTRACT_NUMBER                                           12760000
           ,C.SERVICE_MODULE_1                                          12770000
           ,C.SERVICE_MODULE_2                                          12780000
           ,C.SERVICE_MODULE_3                                          12790000
           ,C.SERVICE_MODULE_4                                          12800000
           ,C.SERVICE_MODULE_5                                          12810000
           ,C.COVERAGE_START_1                                          12820000
           ,C.COVERAGE_START_2                                          12830000
           ,C.COVERAGE_START_3                                          12840000
           ,C.COVERAGE_START_4                                          12850000
           ,C.COVERAGE_START_5                                          12860000
           ,C.COVERAGE_START_6                                          12870000
           ,C.COVERAGE_START_7                                          12880000
           ,C.COVERAGE_END_1                                            12890000
           ,C.COVERAGE_END_2                                            12900000
           ,C.COVERAGE_END_3                                            12910000
           ,C.COVERAGE_END_4                                            12920000
           ,C.COVERAGE_END_5                                            12930000
           ,C.COVERAGE_END_6                                            12940000
           ,C.COVERAGE_END_7                                            12950000
           ,C.SERVICE_TYPE                                              12960000
           ,C.SERVICE_LVL_CODE                            /* RC01194 */ 12970000
           ,C.SOURCE_INDICATOR                            /* PTM1408 */ 12980000
           ,C.EFFECTIVE_DATE                                            12990000
           ,C.END_DATE                                                  13000000
           ,C.AUTHORISATION_CODE                          /* RB01272 */ 13010000
           ,''                                        /* SOC RB01289 */ 13020000
           ,''                                                          13030000
           ,''                                        /* EOC RB01289 */ 13040000
           ,''                                            /* RB01308 */ 13050000
                                                 /* SOC CEDS00000719 */ 13050100
        /* ,D.REAL_SERIAL_NUMBER          */          /* SOC RB01320 */ 13051000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               13060000
                                                 /* EOC CEDS00000719 */ 13060100
   /*FROM RCBV0722_RCMS_HW    A                                         13061000
         ,RCBV0241_PI_CTR     C */                                      13062000
     FROM RCBV0241_PI_CTR     C                                         13070000
         ,RCBV0722_RCMS_HW    A                                         13080000
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL   D           SOC CEDS00000719 */ 13081000
 /*  ON    A.PRODUCT_TYPE               = D.PRODUCT_TYPE                13082000
     AND   A.ORIGIN                     = D.DUMMY_ORIGIN                13083000
     AND   A.SEQUENCE_NUMBER            = D.DUMMY_SEQUENCE_NUM          13084000
     AND   A.COUNTRY_NUMBER             = D.COUNTRY_NUMBER              13085000
                                                    */ /* EOC RB01320 */13086000
                                                  /* EOC CEDS00000719 */13087000
     WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                             13090000
       AND C.COUNTRY_NUMBER   = A.COUNTRY_NUMBER                        13100000
       AND C.PRODUCT_TYPE     = A.PRODUCT_TYPE                          13110000
     /*AND C.ORIGIN           = A.ORIGIN*/             /* SOC RB01320 */13111000
     /*AND C.SEQUENCE_NUMBER   = A.SEQUENCE_NUMBER*/                    13112000
       AND ((C.ORIGIN          = A.ORIGIN                               13120000
       AND C.SEQUENCE_NUMBER   = A.SEQUENCE_NUMBER)                     13130000
                                                  /* SOC CEDS00000719 */13130100
    /* OR (C.COUNTRY_NUMBER    = D.COUNTRY_NUMBER                       13131000
       AND C.PRODUCT_TYPE      = D.PRODUCT_TYPE                         13132000
       AND (C.ORIGIN||C.SEQUENCE_NUMBER = D.REAL_SERIAL_NUMBER)         13133000
       AND (A.ORIGIN           = D.DUMMY_ORIGIN                         13134000
       AND  A.SEQUENCE_NUMBER  = D.DUMMY_SEQUENCE_NUM)))                13135000
                                                    */ /* EOC RB01320 */13136000
       OR   (C.ORIGIN              = A.REAL_ORIGIN                      13140000
       AND   C.SEQUENCE_NUMBER     = A.REAL_SEQ_NUM))                   13150000
                                                  /* EOC CEDS00000719 */13151000
       AND C.EFFECTIVE_DATE  <= :WRK_PERIOD_END_DATE                    13160000
       AND C.END_DATE        >= :WRK_PERIOD_START_DATE                  13170000
                                                                        13180000
       AND NOT EXISTS (                                                 13190000
           SELECT *                                                     13200000
           FROM RCBV0051_PI_HW_PR     B                                 13210000
           WHERE B.COUNTRY_NUMBER     = :WRK_CTRYNO                     13220000
             AND B.PRODUCT_TYPE       = C.PRODUCT_TYPE                  13230000
             AND B.ORIGIN             = C.ORIGIN                        13240000
             AND B.SEQUENCE_NUMBER    = C.SEQUENCE_NUMBER               13250000
                                                         /* PTM1313 */  13251000
        /*   AND B.INSTALL_DATE      <= :WRK_PERIOD_END_DATE  */        13252000
           )                                                            13260000
                                                                        13270000
     ORDER BY 1                                                         13280000
             ,2                                                         13290000
             ,3                                                         13300000
   FOR FETCH ONLY                                         /* RC01219 */ 13310000
             ;                                                          13320000
                                                                        13510000
                                         /* CURSOR_INST_HW           */ 13511000
 /*EXEC SQL                                         SOC CEDS00000719 */ 13516000
 /*DECLARE CURSOR_INST_HW CURSOR FOR                                    13517000
   SELECT DISTINCT                                                      13518000
          B.PRODUCT_TYPE                            EOC CEDS00000719 */ 13519000
                                                      /* SOC RB01320 */ 13519100
      /* ,B.ORIGIN                                                      13519200
         ,B.SEQUENCE_NUMBER */                                          13519300
                                                 /* SOC CEDS00000719 */ 13519400
 /*      ,COALESCE(E.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   13519500
         ,COALESCE(E.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   13519600
                                                   */ /* EOC RB01320 */ 13519700
                                                                        13519800
                                         /* CURSOR_INST_HW           */ 13519900
    EXEC SQL                                                            13520000
    DECLARE CURSOR_INST_HW CURSOR FOR                                   13520100
    SELECT                                                              13520200
          A.PRODUCT_TYPE                                                13520300
         ,A.ORIGIN                                                      13520400
         ,A.SEQUENCE_NUMBER                     /* EOC CEDS00000719 */  13520500
         ,B.CUSTOMER_NUMBER                                             13520600
         ,B.MARKETING_INSTDAT                                           13520700
         ,B.SCHED_REMOVAL_DATE                                          13520800
         ,B.EFFECTIVE_DATE                                              13520900
         ,B.END_DATE                                                    13521000
         ,C.OU_CODE                                                     13521100
         ,C.EFFECTIVE_DATE                                              13521200
         ,C.END_DATE                                                    13521300
         ,D.TYPE_OF_MAINT                                               13521400
         ,D.TYPE_OF_WARRANTY                                            13521500
         ,D.SERVICE_LVL_CODE                               /* RC01194 */13521600
         ,D.SOURCE_INDICATOR                               /* RB01290 */13521700
         ,D.EFFECTIVE_DATE                                              13521800
         ,D.END_DATE                                                    13521900
         ,D.WARRANTY_EXP_DATE                                           13522000
         ,D.F_TYPE_OF_WARRANTY                             /* RB01281 */13522100
         ,D.F_SPLT_DATE                                    /* RB01281 */13522200
         ,D.SERVICE_LVL_CODE_2                             /* RB01298 */13522300
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM           /* SOC CEDS00000719 */13522400
 /*      ,E.REAL_SERIAL_NUMBER                     */  /* SOC RB01320 */13522500
                                                  /* EOC CEDS00000719 */13522600
 /*  FROM RCBV0722_RCMS_HW     A */                                     13522700
 /*      ,RCBV0190_HW_CUST     B */                                     13522800
 /*      ,RCBV0170_OU_HW       C */                                     13522900
 /*      ,RCBV0220_SUPPL_CTR   D */                                     13523000
     FROM RCBV0190_HW_CUST     B                                        13523100
         ,RCBV0170_OU_HW       C                                        13523200
         ,RCBV0220_SUPPL_CTR   D                                        13523300
         ,RCBV0722_RCMS_HW     A                                        13523400
                                                                        13523500
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL   E            SOC CEDS00000719 */13523600
 /*  ON    A.PRODUCT_TYPE               = E.PRODUCT_TYPE                13523700
     AND   A.ORIGIN                     = E.DUMMY_ORIGIN                13523800
     AND   A.SEQUENCE_NUMBER            = E.DUMMY_SEQUENCE_NUM          13523900
     AND   A.COUNTRY_NUMBER             = E.COUNTRY_NUMBER              13524000
                                                   */ /* EOC RB01320 */ 13524100
                                                  /* EOC CEDS00000719 */13524200
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            13524300
     AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE                         13524400
                                                      /* SOC RB01320 */ 13524500
  /* AND B.ORIGIN              = A.ORIGIN                               13524600
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER*/                    13524700
 /*  AND ((B.ORIGIN            = A.ORIGIN            SOC CEDS00000719 */13524800
 /*  AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER)                     13524900
     OR (A.COUNTRY_NUMBER      = E.COUNTRY_NUMBER                       13525000
     AND A.ORIGIN              = E.DUMMY_ORIGIN                         13525100
     AND B.PRODUCT_TYPE        = E.PRODUCT_TYPE                         13525200
     AND A.SEQUENCE_NUMBER     = E.DUMMY_SEQUENCE_NUM                   13525300
     AND B.ORIGIN||B.SEQUENCE_NUMBER = E.REAL_SERIAL_NUMBER))           13525400
                                                   */ /* EOC  RB01320 */13525500
     AND B.ORIGIN            = A.REAL_ORIGIN                            13525600
     AND B.SEQUENCE_NUMBER   = A.REAL_SEQ_NUM     /* EOC CEDS00000719 */13525700
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       13525800
     AND B.TYPE_OF_RELATION    = 'U'                                    13525900
     AND B.EFFECTIVE_DATE      <= :WRK_PERIOD_END_DATE                  13526000
     AND B.END_DATE            >= :WRK_PERIOD_START_DATE                13526100
                                                                        13526200
     AND C.PRODUCT_TYPE        = A.PRODUCT_TYPE                         13526300
                                                      /* SOC  RB01320 */13526400
    /* AND C.ORIGIN            = A.ORIGIN                               13526500
     AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER */                   13526600
 /*  AND ((C.ORIGIN            = A.ORIGIN            SOC CEDS00000719 */13526700
 /*  AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER)                     13526800
     OR (A.COUNTRY_NUMBER      = E.COUNTRY_NUMBER                       13526900
     AND C.PRODUCT_TYPE        = E.PRODUCT_TYPE                         13527000
     AND A.ORIGIN              = E.DUMMY_ORIGIN                         13527100
     AND A.SEQUENCE_NUMBER     = E.DUMMY_SEQUENCE_NUM                   13527200
     AND C.ORIGIN||C.SEQUENCE_NUMBER = E.REAL_SERIAL_NUMBER))           13527300
                                                   */ /* EOC  RB01320 */13527400
     AND C.ORIGIN              = A.REAL_ORIGIN                          13527500
     AND C.SEQUENCE_NUMBER     = A.REAL_SEQ_NUM   /* EOC CEDS00000719 */13527600
     AND C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       13527700
     AND C.EFFECTIVE_DATE      <= B.END_DATE                            13527800
     AND C.END_DATE            >= B.EFFECTIVE_DATE                      13527900
     AND C.EFFECTIVE_DATE      <= :WRK_PERIOD_END_DATE                  13528000
     AND C.END_DATE            >= :WRK_PERIOD_START_DATE                13528100
                                                                        13528200
     AND D.PRODUCT_TYPE        = A.PRODUCT_TYPE                         13528300
                                                      /* SOC  RB01320 */13528400
   /*AND D.ORIGIN              = A.ORIGIN                               13528500
     AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER*/                    13528600
 /*  AND ((D.ORIGIN            = A.ORIGIN            SOC CEDS00000719 */13528700
 /*  AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER)                     13528800
     OR (A.COUNTRY_NUMBER      = E.COUNTRY_NUMBER                       13528900
     AND D.PRODUCT_TYPE        = E.PRODUCT_TYPE                         13529000
     AND A.ORIGIN              = E.DUMMY_ORIGIN                         13529100
     AND A.SEQUENCE_NUMBER     = E.DUMMY_SEQUENCE_NUM                   13529200
     AND D.ORIGIN||D.SEQUENCE_NUMBER = E.REAL_SERIAL_NUMBER))           13529300
                                                   */ /* EOC  RB01320 */13529400
     AND D.ORIGIN            = A.REAL_ORIGIN                            13529500
     AND D.SEQUENCE_NUMBER   = A.REAL_SEQ_NUM     /* EOC CEDS00000719 */13529600
     AND D.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       13529700
     AND D.EFFECTIVE_DATE      <= B.END_DATE                            13529800
     AND D.END_DATE            >= B.EFFECTIVE_DATE                      13529900
     AND D.EFFECTIVE_DATE      <= C.END_DATE                            13530000
     AND D.END_DATE            >= C.EFFECTIVE_DATE                      13530100
     AND D.EFFECTIVE_DATE      <= :WRK_PERIOD_END_DATE                  13530200
     AND D.END_DATE            >= :WRK_PERIOD_START_DATE                13530300
                                                                        13530400
     GROUP BY                                     /* SOC CEDS00000719 */13530600
            A.PRODUCT_TYPE                                              13530700
           ,A.ORIGIN                                                    13530800
           ,A.SEQUENCE_NUMBER                                           13530900
           ,B.CUSTOMER_NUMBER                                           13531000
           ,B.MARKETING_INSTDAT                                         13531100
           ,B.SCHED_REMOVAL_DATE                                        13531200
           ,B.EFFECTIVE_DATE                                            13531300
           ,B.END_DATE                                                  13531400
           ,C.OU_CODE                                                   13531500
           ,C.EFFECTIVE_DATE                                            13531600
           ,C.END_DATE                                                  13531700
           ,D.TYPE_OF_MAINT                                             13531800
           ,D.TYPE_OF_WARRANTY                                          13531900
           ,D.SERVICE_LVL_CODE                                          13532000
           ,D.SOURCE_INDICATOR                                          13532100
           ,D.EFFECTIVE_DATE                                            13532200
           ,D.END_DATE                                                  13532300
           ,D.WARRANTY_EXP_DATE                                         13532400
           ,D.F_TYPE_OF_WARRANTY                                        13532500
           ,D.F_SPLT_DATE                                               13532600
           ,D.SERVICE_LVL_CODE_2                                        13532700
           ,A.REAL_ORIGIN                                               13532800
           ,A.REAL_SEQ_NUM                                              13532900
                                                                        13533000
 /*ORDER BY B.PRODUCT_TYPE                           EOC CEDS00000719 */13533100
       /*  ,B.ORIGIN*/                                 /* SOC RB01320 */13533200
       /*  ,B.SEQUENCE_NUMBER */                                        13533300
 /*        ,ORIGIN                                   SOC CEDS00000719 */13533400
 /*        ,SEQ_NUM                    */              /* EOC RB01320 */13533500
   ORDER BY A.PRODUCT_TYPE                                              13533600
           ,A.ORIGIN                                                    13533700
           ,A.SEQUENCE_NUMBER                     /* EOC CEDS00000719 */13533800
           ,B.EFFECTIVE_DATE                                            13533900
           ,B.END_DATE                                                  13534000
           ,C.EFFECTIVE_DATE                                            13534100
           ,C.END_DATE                                                  13534200
           ,D.EFFECTIVE_DATE                                            13534300
           ,D.END_DATE                                                  13534400
   FOR FETCH ONLY                                         /* RC01219 */ 13534500
           ;                                                            13534600
                                                                        14660000
                                         /* CURSOR_OO_HW             */ 14670000
 EXEC SQL                                                               14680000
   DECLARE CURSOR_OO_HW CURSOR FOR                                      14690000
   SELECT DISTINCT                                                      14700000
       /* B.PRODUCT_TYPE                            SOC CEDS00000719 */ 14710000
          A.PRODUCT_TYPE                                                14711000
         ,A.ORIGIN                                                      14721000
         ,A.SEQUENCE_NUMBER                      /* EOC CEDS00000719 */ 14722000
                                                      /* SOC RB01320 */ 14723000
      /* ,B.ORIGIN                                                      14730000
         ,B.SEQUENCE_NUMBER */                                          14740000
                                                 /* SOC CEDS00000719 */ 14741000
      /* ,COALESCE(C,DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   14750000
         ,COALESCE(C.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   14760000
                                              */      /* EOC RB01320 */ 14770000
                                                 /* EOC CEDS00000719 */ 14771000
         ,B.CUSTOMER_USER                                               14780000
         ,B.MODEL_NUMBER                                                14790000
         ,B.MARKET_RESP_CODE                                            14800000
         ,B.INSTALLING_OU                                               14810000
         ,B.ORDER_REF_NUMBER                                            14820000
         ,B.TYPE_OF_WARRANTY                                            14830000
         ,B.TYPE_OF_AGREEMENT                                           14840000
         ,B.DP_SYSTEM_NUMBER                                            14850000
         ,B.SCHED_REMOVAL_DATE                                          14860000
         ,B.OU_CODE                                                     14870000
         ,B.TYPE_OF_MAINT                                               14880000
         ,B.ORDER_DATE                                                  14890000
         ,B.END_DATE                                                    14900000
                                                 /* SOC CEDS00000719 */ 14901000
      /* ,C.REAL_SERIAL_NUMBER                       *//* SOC RB01320 */14910000
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                                 14911000
                                                 /* EOC CEDS00000719 */ 14912000
  /* FROM RCBV0722_RCMS_HW     A                                        14920000
         ,RCBV0260_HW_IN_ORD   B */                                     14930000
     FROM RCBV0260_HW_IN_ORD   B                                        14940000
         ,RCBV0722_RCMS_HW     A                                        14950000
                                                                        14960000
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL   C           SOC CEDS00000719 */ 14970000
 /*  ON    A.PRODUCT_TYPE               = C.PRODUCT_TYPE                14980000
     AND   A.ORIGIN                     = C.DUMMY_ORIGIN                14990000
     AND   A.SEQUENCE_NUMBER            = C.DUMMY_SEQUENCE_NUM          15000000
     AND   A.COUNTRY_NUMBER             = C.COUNTRY_NUMBER */           15010000
                                                       /* EOC RB01320 */15020000
                                                 /* EOC CEDS00000719 */ 15021000
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            15030000
     AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE                         15040000
                                                      /* SOC  RB01320 */15050000
   /*AND B.ORIGIN              = A.ORIGIN                               15060000
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER*/                    15070000
                                                 /* SOC CEDS00000719 */ 15071000
   /*AND ((B.ORIGIN            = A.ORIGIN                               15080000
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER)                     15090000
     OR (C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       15100000
     AND C.DUMMY_ORIGIN        = A.ORIGIN                               15110000
     AND C.DUMMY_SEQUENCE_NUM  = A.SEQUENCE_NUMBER                      15120000
     AND C.REAL_SERIAL_NUMBER  = B.ORIGIN||B.SEQUENCE_NUMBER)) */       15130000
                                                      /* EOC  RB01320 */15140000
     AND B.ORIGIN           = A.REAL_ORIGIN                             15141000
     AND B.SEQUENCE_NUMBER  = A.REAL_SEQ_NUM                            15142000
                                                 /* EOC CEDS00000719 */ 15143000
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       15150000
     AND :WRK_RUN_DATE         BETWEEN B.ORDER_DATE                     15160000
                                   AND B.END_DATE                       15170000
                                                                        15180000
 /*ORDER BY B.PRODUCT_TYPE */                        /* CEDS00000719 */ 15181000
         /*,B.ORIGIN */                                /* SOC RB01320 */15200000
         /*,B.SEQUENCE_NUMBER */                                        15210000
         /*,ORIGIN                                   SOC CEDS00000719 */15210100
         /*,SEQ_NUM  */                                /* EOC RB01320 */15210200
   ORDER BY A.PRODUCT_TYPE                                              15210300
           ,A.ORIGIN                                                    15211000
           ,A.SEQUENCE_NUMBER                                           15212000
                                                  /* EOC CEDS00000719 */15213000
   FOR FETCH ONLY                                         /* RC01219 */ 15240000
           ;                                                            15250000
                                                                        15260000
                                                                        15270000
                                         /* CURSOR_SERV_CTR          */ 15280000
 EXEC SQL                                                               15290000
   DECLARE CURSOR_SERV_CTR CURSOR FOR                                   15300000
   SELECT CONTRACT_NUMBER                                               15310000
         ,SUPPL_CTR_NUMBER                                              15320000
         ,SERVICE_MODULE_1                                              15330000
         ,SERVICE_MODULE_2                                              15340000
         ,SERVICE_MODULE_3                                              15350000
         ,SERVICE_MODULE_4                                              15360000
         ,SERVICE_MODULE_5                                              15370000
         ,AGREEMENT_TYPE                                                15380000
         ,AGREEMENT_OPTION                                              15390000
         ,SPECIAL_OPTION                                                15400000
         ,AMENDM_COMB_CODE                                              15410000
         ,COVERAGE_START_1                                              15420000
         ,COVERAGE_START_2                                              15430000
         ,COVERAGE_START_3                                              15440000
         ,COVERAGE_START_4                                              15450000
         ,COVERAGE_START_5                                              15460000
         ,COVERAGE_START_6                                              15470000
         ,COVERAGE_START_7                                              15480000
         ,COVERAGE_END_1                                                15490000
         ,COVERAGE_END_2                                                15500000
         ,COVERAGE_END_3                                                15510000
         ,COVERAGE_END_4                                                15520000
         ,COVERAGE_END_5                                                15530000
         ,COVERAGE_END_6                                                15540000
         ,COVERAGE_END_7                                                15550000
         ,SERVICE_TYPE                                                  15560000
         ,SERVICE_LVL_CODE                                   /* 01194 */15570000
         ,HVP_QUANTITY                                                  15580000
         ,SOURCE_INDICATOR                                              15590000
         ,EFFECTIVE_DATE                                                15600000
         ,END_DATE                                                      15610000
  /* FROM RCBV0240_SERV_CTR */                         /* SOC RB01320 */15620000
  /* FROM RCBV0240_SERV_CTR A,                     /* SOC CEDS00000702*/15630000
  /*      RCBV0125_DMMY_REAL B */                                       15640000
     FROM RCBV0240_SERV_CTR A                                           15640100
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL   B    */   /* SOC CEDS00000719 */15641000
  /*   ON    A.PRODUCT_TYPE               = B.PRODUCT_TYPE */           15642000
  /*   AND   A.ORIGIN                     = B.DUMMY_ORIGIN            */15642200
  /*   AND   A.SEQUENCE_NUMBER            = B.DUMMY_SEQUENCE_NUM      */15642300
  /*   AND   A.ORIGIN              = SUBSTR(B.REAL_SERIAL_NUMBER,1,2)   15643000
       AND   A.SEQUENCE_NUMBER     = SUBSTR(B.REAL_SERIAL_NUMBER,3)     15644000
       AND   A.COUNTRY_NUMBER             = B.COUNTRY_NUMBER */         15645000
                                                  /* EOC CEDS00000719 */15647000
 /*WHERE PRODUCT_TYPE        = :SK_CURRENT_HW.PRODUCT_TYPE              15650000
     AND ORIGIN              = :SK_CURRENT_HW.ORIGIN                    15660000
     AND SEQUENCE_NUMBER     = :SK_CURRENT_HW.SEQUENCE_NUMBER           15670000
     AND COUNTRY_NUMBER      = :WRK_CTRYNO                              15680000
     AND EFFECTIVE_DATE      <= :SK_CURRENT_HW.END_DATE                 15690000
     AND EFFECTIVE_DATE      <= :WRK_PERIOD_END_DATE                    15700000
     AND END_DATE            >= :SK_CURRENT_HW.EFFECTIVE_DATE*/         15710000
                                                  /* SOC CEDS00000719 */15710100
 /*WHERE ((A.PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE              15711000
     AND   A.ORIGIN          = :SK_CURRENT_HW.ORIGIN                    15712000
     AND   A.SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER           15713000
     AND   A.COUNTRY_NUMBER  = :WRK_CTRYNO )                            15714000
     OR   (B.PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE              15715000
     AND   B.DUMMY_ORIGIN    = :SK_CURRENT_HW.ORIGIN                    15715100
     AND   B.DUMMY_ORIGIN    = :SK_CURRENT_HW.ORIGIN */                 15716000
  /* AND   B.REAL_SERIAL_NUMBER = A.ORIGIN||A.SEQUENCE_NUMBER           15717000
     AND   B.COUNTRY_NUMBER   = A.COUNTRY_NUMBER )) */                  15718000
   WHERE A.PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE                15720000
     AND A.ORIGIN          = SUBSTR(:WRK_BAU_REAL_SERIAL_NO_V125,1,2)   15740100
     AND A.SEQUENCE_NUMBER = SUBSTR(:WRK_BAU_REAL_SERIAL_NO_V125,3)     15741000
     AND A.COUNTRY_NUMBER  = :WRK_CTRYNO                                15750000
                                                 /* EOC CEDS00000719 */ 15801000
     AND A.EFFECTIVE_DATE      <= :SK_CURRENT_HW.END_DATE               15810000
     AND A.EFFECTIVE_DATE      <= :WRK_PERIOD_END_DATE                  15820000
     AND A.END_DATE            >= :SK_CURRENT_HW.EFFECTIVE_DATE         15830000
                                                       /* EOC RB01320 */15840000
                                                                        15850000
   ORDER BY EFFECTIVE_DATE                                              15860000
   FOR FETCH ONLY                                         /* RC01219 */ 15870000
           ;                                                            15880000
                                                                        15890000
                                                       /* SOC RB01301*/ 15900000
 EXEC SQL                                                               15910000
   DECLARE T120_SNAME_CURSOR CURSOR FOR                                 15920000
   SELECT T691.OFFERING_SNAME                                           15930000
    FROM       RCBV0120_MESE_HW T120,                                   15940000
               RCBV0691_TRANS_OFF T691                                  15950000
    WHERE T120.COUNTRY_NUMBER   = :WRK_CTRYNO                           15960000
    AND   T120.PRODUCT_TYPE     = :SK_HW_TEMP.PRODUCT_TYPE              15970000
    AND   T120.ORIGIN           = :SK_HW_TEMP.ORIGIN                    15980000
    AND   T120.SEQUENCE_NUMBER  = :SK_HW_TEMP.SEQUENCE_NUMBER           15990000
    AND   (:WRK_RUN_DATE BETWEEN T120.SERVICE_START_DATE AND            16000000
          T120.SERVICE_END_DATE)                                        16010000
    AND   T691.COUNTRY_NUMBER    = T120.COUNTRY_NUMBER                  16020000
    AND   T691.OFFERING_ID       = T120.OFFERING_NICK_NAME              16030000
    AND   T691.TYPE_OF_OFFERING  = 'MESE'                               16040000
    ORDER BY T691.RANK_NUMBER DESC                                      16050000
    FETCH FIRST 6 ROWS ONLY;                                            16060000
                                                       /* EOC RB01301*/ 16070000
                                                                        16080000
1/********************************************************************/ 16090000
 /*                 S T A R T   P R O C E S S I N G                  */ 16100000
 /********************************************************************/ 16110000
                                                                        16120000
 CALL R900_INIT_PROGRAM;                                                16130000
                                                                        16140000
 CALL R800_INIT_PROCESSING;                                             16150000
                                                                        16160000
                          /***************************************** */ 16170000
                          /* PROCESS ALL CHANGED HARDWARE            */ 16180000
                          /***************************************** */ 16190000
 DO WHILE ( ¬ SWITCH_EOC_INST_HW                                        16200000
          | ¬ SWITCH_EOC_OO_HW                                          16210000
          | ¬ SWITCH_EOC_PI_HW);                      /* SOC RC01158 */ 16220000
                                                                        16230000
                               /************************************ */ 16240000
                               /* PROCESS HW OCCURENCE               */ 16250000
                               /************************************ */ 16260000
   CALL R700_INIT_HW_OCCURENCE;                                         16270000
   IF ¬SWITCH_EOC_PI_HW                                                 16280000
   &   SK_PI_HW_1 < SK_CURRENT_HW_1              /* JUST PRIME INPUT */ 16290000
   THEN                                                                 16300000
     DO;                                                                16310000
       SWITCH_PI_ONLY   = TRUE;                       /* SOC RC01326 */ 16311000
       SWITCH_BAU_ONLY  = FALSE;                                        16312000
       SWITCH_OO_ONLY   = FALSE;                                        16313000
       SWITCH_BAU_PI    = FALSE;                                        16314000
       SWITCH_BAU_OO    = FALSE;                      /* EOC RC01326 */ 16315000
       CALL R710_PROCESS_PI_HW;                                         16320000
       WRK_ORIGIN = '';                               /* SOC RC01326 */ 16330000
       WRK_SEQ_NO = '';                               /* EOC RC01326 */ 16340000
     END;                                                               16370000
   ELSE                                                                 16380000
     DO;                                                                16390000
       IF ¬SWITCH_EOC_INST_HW                        /* REGULAR CEDS */ 16400000
       |  ¬SWITCH_EOC_OO_HW                                             16410000
       THEN                                                             16420000
         DO;                                                            16430000
           CALL R720_PROCESS_REGULAR_HW;                                16480000
         END;                                                           16580000
                                           /* POSSIBLY TOGETHER WITH */ 16590000
       IF ¬SWITCH_EOC_PI_HW                                             16600000
       &   SK_PI_HW_1 = SK_CURRENT_HW_1               /* PRIME INPUT */ 16610000
       THEN                                                             16620000
         DO;                                                            16630000
           CALL R710_PROCESS_PI_HW;                                     16640000
           SWITCH_BAU_PI    = TRUE;                    /* SOC RC01326 */16641000
           SWITCH_PI_ONLY   = FALSE;                                    16642000
           SWITCH_BAU_ONLY  = FALSE;                                    16643000
           SWITCH_OO_ONLY   = FALSE;                                    16644000
           SWITCH_BAU_OO    = FALSE;                   /* EOC RC01326 */16645000
         END;                                                           16690000
     END;                                                               16700000
                                                                        16710000
   IF SWITCH_CURRENT_PERIOD_FOUND                                       16740000
   |  SW_PI                                                             16750000
   THEN                                                                 16760000
     DO;                                                                16770000
       CALL R730_APPLY_PRIORITY;     /* APPLY BAU-PI PRIORITY RB01308*/ 16780000
       CALL R740_FINISH_HW_OCCURENCE;                                   16790000
     END;                                                               16800000
 END;                                          /* WHILE HW PRODUCTS  */ 16810000
                                                      /* EOC RC01158 */ 16820000
                                                                        16830000
 CALL R849_END_PROCESSING;                                              16840000
                                    /* ONLY WHEN ADDRESS RESOLUTION  */ 16850000
 IF PARM_RCB005.ADDRESS_RES = '1'                                       16860000
 THEN                                                                   16870000
   DO;                                                                  16880000
     CALL R850_SORT_FOR_ADDR_RES;                                       16890000
                                                                        16900000
                              /************************************* */ 16910000
                              /* PROCESS SORTFILE                    */ 16920000
                              /************************************* */ 16930000
     CALL R860_INIT_PROCESS_SORT;                                       16940000
                                                                        16950000
     DO WHILE (  ¬ SWITCH_END_OF_RCBDRIJ                                16960000
               | ¬ SWITCH_END_OF_RCBDRG2  );                            16970000
                                                                        16980000
       SELECT;                                                          16990000
         WHEN(STRING(SK_RCBDRIJ) < STRING(SK_RCBDRG2))                  17000000
           DO;                                                          17010000
              CALL R651_PROC_NOT_EQUAL_BLC;                             17020000
              CALL R653_WRITE_RCBDRIK;                                  17030000
              CALL R658_READ_FILE_RCBDRIJ;                              17040000
           END;                                                         17050000
         WHEN(STRING(SK_RCBDRIJ) > STRING(SK_RCBDRG2))                  17060000
           DO;                                                          17070000
              CALL R659_READ_FILE_RCBDRG2;                              17080000
           END;                                                         17090000
         OTHERWISE                                                      17100000
           DO;                                                          17110000
             IF FILE_RCBDRG2.ICUSANO ¬= '000'  /* PTM 0415 */           17120000
             THEN                                                       17130000
               DO;                                                      17140000
                 CALL R655_PROCESS_ICUSANO;                             17150000
                 CALL R653_WRITE_RCBDRIK;                               17160000
                 CALL R658_READ_FILE_RCBDRIJ;                           17170000
               END;                                                     17180000
             ELSE                                                       17190000
               DO;                                                      17200000
                 CALL R659_READ_FILE_RCBDRG2;                           17210000
               END;                                                     17220000
           END;                                                         17230000
       END;                                                             17240000
     END;                                                               17250000
     CALL R870_END_PROCESS_SORT;                                        17260000
   END;                                                                 17270000
                                                                        17280000
 CALL R970_SORT_FOR_OUTPUT;                                             17290000
                                                                        17300000
 CALL R999_END_PROGRAM;                                                 17310000
                                                                        17320000
1/********************************************************************/ 17330000
 /*                                                                  */ 17340000
 /* MODULE NAME      : R001_LOCK_TABLES                              */ 17350000
 /*                                                                  */ 17360000
 /* DESCRIPTION      :                                               */ 17370000
 /*                                                                  */ 17380000
 /********************************************************************/ 17390000
 R001_LOCK_TABLES: PROC;                                                17400000
                                                                        17410000
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 17420000
                                                                        17430000
 /********************************************************************/ 17440000
                                                                        17450000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0030_CONTRACT';                     17460000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 17470000
                                                                        17480000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      17490000
               PTR_RETURN_AREA_BB,                                      17500000
               PTR_INT_AREA);                                           17510000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    17520000
   WHEN (0);                                                            17530000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 17540000
     DO;                                                                17550000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#001');                      17560000
     END;                                                               17570000
   OTHERWISE                                                            17580000
     DO;                                                                17590000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            17600000
                                 'DB2',                                 17610000
                                 '#002');                               17620000
     END;                                                               17630000
 END;                                                                   17640000
                                                                        17650000
                                                                        17660000
 /********************************************************************/ 17670000
                                                                        17680000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0051_PI_HW_PR';                     17690000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 17700000
                                                                        17710000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      17720000
               PTR_RETURN_AREA_BB,                                      17730000
               PTR_INT_AREA);                                           17740000
                                                                        17750000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    17760000
   WHEN (0);                                                            17770000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 17780000
     DO;                                                                17790000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#003');                      17800000
     END;                                                               17810000
   OTHERWISE                                                            17820000
     DO;                                                                17830000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            17840000
                                 'DB2',                                 17850000
                                 '#004');                               17860000
     END;                                                               17870000
 END;                                                                   17880000
                                                                        17890000
                                                                        17900000
 /********************************************************************/ 17910000
                                                                        17920000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0110_HW_STATUS';                    17930000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 17940000
                                                                        17950000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      17960000
               PTR_RETURN_AREA_BB,                                      17970000
               PTR_INT_AREA);                                           17980000
                                                                        17990000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18000000
   WHEN (0);                                                            18010000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18020000
     DO;                                                                18030000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#005');                      18040000
     END;                                                               18050000
   OTHERWISE                                                            18060000
     DO;                                                                18070000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18080000
                                 'DB2',                                 18090000
                                 '#006');                               18100000
     END;                                                               18110000
 END;                                                                   18120000
                                                      /* SOC RB01320 */ 18130000
 /********************************************************************/ 18140000
                                                                        18150000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0125_DMMY_REAL';                    18160000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18170000
                                                                        18180000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18190000
               PTR_RETURN_AREA_BB,                                      18200000
               PTR_INT_AREA);                                           18210000
                                                                        18220000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18230000
   WHEN (0);                                                            18240000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18250000
     DO;                                                                18260000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#105');                      18270000
     END;                                                               18280000
   OTHERWISE                                                            18290000
     DO;                                                                18300000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18310000
                                 'DB2',                                 18320000
                                 '#106');                               18330000
     END;                                                               18340000
 END;                                                                   18350000
                                                       /* EOC RB01320 */18360000
 /********************************************************************/ 18370000
                                                                        18380000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0170_OU_HW';                        18390000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18400000
                                                                        18410000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18420000
               PTR_RETURN_AREA_BB,                                      18430000
               PTR_INT_AREA);                                           18440000
                                                                        18450000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18460000
   WHEN (0);                                                            18470000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18480000
     DO;                                                                18490000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#007');                      18500000
     END;                                                               18510000
   OTHERWISE                                                            18520000
     DO;                                                                18530000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18540000
                                 'DB2',                                 18550000
                                 '#008');                               18560000
     END;                                                               18570000
 END;                                                                   18580000
                                                                        18590000
                                                                        18600000
 /********************************************************************/ 18610000
                                                                        18620000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      18630000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18640000
                                                                        18650000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18660000
               PTR_RETURN_AREA_BB,                                      18670000
               PTR_INT_AREA);                                           18680000
                                                                        18690000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18700000
   WHEN (0);                                                            18710000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18720000
     DO;                                                                18730000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#009');                      18740000
     END;                                                               18750000
   OTHERWISE                                                            18760000
     DO;                                                                18770000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18780000
                                 'DB2',                                 18790000
                                 '#010');                               18800000
     END;                                                               18810000
 END;                                                                   18820000
                                                                        18830000
                                                                        18840000
 /********************************************************************/ 18850000
                                                                        18860000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0220_SUPPL_CTR';                    18870000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18880000
                                                                        18890000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18900000
               PTR_RETURN_AREA_BB,                                      18910000
               PTR_INT_AREA);                                           18920000
                                                                        18930000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18940000
   WHEN (0);                                                            18950000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18960000
     DO;                                                                18970000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#011');                      18980000
     END;                                                               18990000
   OTHERWISE                                                            19000000
     DO;                                                                19010000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19020000
                                 'DB2',                                 19030000
                                 '#012');                               19040000
     END;                                                               19050000
 END;                                                                   19060000
                                                                        19070000
                                                                        19080000
 /********************************************************************/ 19090000
                                                                        19100000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0240_SERV_CTR';                     19110000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19120000
                                                                        19130000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19140000
               PTR_RETURN_AREA_BB,                                      19150000
               PTR_INT_AREA);                                           19160000
                                                                        19170000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19180000
   WHEN (0);                                                            19190000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19200000
     DO;                                                                19210000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#013');                      19220000
     END;                                                               19230000
   OTHERWISE                                                            19240000
     DO;                                                                19250000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19260000
                                 'DB2',                                 19270000
                                 '#014');                               19280000
     END;                                                               19290000
 END;                                                                   19300000
                                                                        19310000
                                                                        19320000
 /********************************************************************/ 19330000
                                                                        19340000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0241_PI_CTR';                       19350000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19360000
                                                                        19370000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19380000
               PTR_RETURN_AREA_BB,                                      19390000
               PTR_INT_AREA);                                           19400000
                                                                        19410000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19420000
   WHEN (0);                                                            19430000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19440000
     DO;                                                                19450000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#015');                      19460000
     END;                                                               19470000
   OTHERWISE                                                            19480000
     DO;                                                                19490000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19500000
                                 'DB2',                                 19510000
                                 '#016');                               19520000
     END;                                                               19530000
 END;                                                                   19540000
                                                                        19550000
                                                                        19560000
 /********************************************************************/ 19570000
                                                                        19580000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0260_HW_IN_ORD';                    19590000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19600000
                                                                        19610000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19620000
               PTR_RETURN_AREA_BB,                                      19630000
               PTR_INT_AREA);                                           19640000
                                                                        19650000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19660000
   WHEN (0);                                                            19670000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19680000
     DO;                                                                19690000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#017');                      19700000
     END;                                                               19710000
   OTHERWISE                                                            19720000
     DO;                                                                19730000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19740000
                                 'DB2',                                 19750000
                                 '#018');                               19760000
     END;                                                               19770000
 END;                                                                   19780000
                                                                        19790000
                                                                        19800000
 /********************************************************************/ 19810000
                                                                        19820000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0300_HW_REAL';                      19830000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19840000
                                                                        19850000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19860000
               PTR_RETURN_AREA_BB,                                      19870000
               PTR_INT_AREA);                                           19880000
                                                                        19890000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19900000
   WHEN (0);                                                            19910000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19920000
     DO;                                                                19930000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#019');                      19940000
     END;                                                               19950000
   OTHERWISE                                                            19960000
     DO;                                                                19970000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19980000
                                 'DB2',                                 19990000
                                 '#020');                               20000000
     END;                                                               20010000
 END;                                                                   20020000
                                                                        20030000
                                                                        20040000
 /********************************************************************/ 20050000
                                                                        20060000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0340_HW_ADDR';                      20070000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20080000
                                                                        20090000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20100000
               PTR_RETURN_AREA_BB,                                      20110000
               PTR_INT_AREA);                                           20120000
                                                                        20130000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20140000
   WHEN (0);                                                            20150000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20160000
     DO;                                                                20170000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#021');                      20180000
     END;                                                               20190000
   OTHERWISE                                                            20200000
     DO;                                                                20210000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20220000
                                 'DB2',                                 20230000
                                 '#022');                               20240000
     END;                                                               20250000
 END;                                                                   20260000
                                                                        20270000
                                                                        20280000
 /********************************************************************/ 20290000
                                                                        20300000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0380_HW_PR_MOD';                    20310000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20320000
                                                                        20330000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20340000
               PTR_RETURN_AREA_BB,                                      20350000
               PTR_INT_AREA);                                           20360000
                                                                        20370000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20380000
   WHEN (0);                                                            20390000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20400000
     DO;                                                                20410000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#023');                      20420000
     END;                                                               20430000
   OTHERWISE                                                            20440000
     DO;                                                                20450000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20460000
                                 'DB2',                                 20470000
                                 '#024');                               20480000
     END;                                                               20490000
 END;                                                                   20500000
                                                                        20510000
 /********************************************************************/ 20520000
                                                                        20530000
 PARM_RCB024M.VIEW_NAME      = 'RCBV0470_SERV_COND';                    20540000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20550000
                                                                        20560000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20570000
               PTR_RETURN_AREA_BB,                                      20580000
               PTR_INT_AREA);                                           20590000
                                                                        20600000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20610000
   WHEN (0);                                                            20620000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20630000
     DO;                                                                20640000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#025');                      20650000
     END;                                                               20660000
   OTHERWISE                                                            20670000
     DO;                                                                20680000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20690000
                                 'DB2',                                 20700000
                                 '#026');                               20710000
     END;                                                               20720000
 END;                                                                   20730000
                                                                        20740000
 /********************************************************************/ 20750000
                                                                        20760000
 PARM_RCB024M.VIEW_NAME      = 'RCBV0475_CTRY_COND';                    20770000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20780000
                                                                        20790000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20800000
               PTR_RETURN_AREA_BB,                                      20810000
               PTR_INT_AREA);                                           20820000
                                                                        20830000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20840000
   WHEN (0);                                                            20850000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20860000
     DO;                                                                20870000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#027');                      20880000
     END;                                                               20890000
   OTHERWISE                                                            20900000
     DO;                                                                20910000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20920000
                                 'DB2',                                 20930000
                                 '#028');                               20940000
     END;                                                               20950000
 END;                                                                   20960000
                                                                        20970000
 /********************************************************************/ 20980000
                                                                        20990000
 PARM_RCB024M.VIEW_NAME      = 'RCBV0610_TRANS_ATO';                    21000000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 21010000
                                                                        21020000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      21030000
               PTR_RETURN_AREA_BB,                                      21040000
               PTR_INT_AREA);                                           21050000
                                                                        21060000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    21070000
   WHEN (0);                                                            21080000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 21090000
     DO;                                                                21100000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#029');                      21110000
     END;                                                               21120000
   OTHERWISE                                                            21130000
     DO;                                                                21140000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            21150000
                                 'DB2',                                 21160000
                                 '#030');                               21170000
     END;                                                               21180000
 END;                                                                   21190000
                                                                        21200000
 /********************************************************************/ 21211000
                                                                        21221000
                                                                        21230000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0722_RCMS_HW';                      21240000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 21250000
                                                                        21260000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      21270000
               PTR_RETURN_AREA_BB,                                      21280000
               PTR_INT_AREA);                                           21290000
                                                                        21300000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    21310000
   WHEN (0);                                                            21320000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 21330000
     DO;                                                                21340000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#031');                      21350000
     END;                                                               21360000
   OTHERWISE                                                            21370000
     DO;                                                                21380000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            21390000
                                 'DB2',                                 21400000
                                 '#032');                               21410000
     END;                                                               21420000
 END;                                                 /* EOC RC01219 */ 21430000
                                                                        21440000
                                                 /* SOC CEDS00000505 */ 21450000
 /********************************************************************/ 21460000
                                                                        21470000
                                                                        21480000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0010_CUSTOMER';                     21490000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 21500000
                                                                        21510000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      21520000
               PTR_RETURN_AREA_BB,                                      21530000
               PTR_INT_AREA);                                           21540000
                                                                        21550000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    21560000
   WHEN (0);                                                            21570000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 21580000
     DO;                                                                21590000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#089');                      21600000
     END;                                                               21610000
   OTHERWISE                                                            21620000
     DO;                                                                21630000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            21640000
                                 'DB2',                                 21650000
                                 '#090');                               21660000
     END;                                                               21670000
 END;                                                                   21680000
                                                                        21690000
 /********************************************************************/ 21700000
                                                                        21710000
                                                                        21720000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0011_PI_CUST';                      21730000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 21740000
                                                                        21750000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      21760000
               PTR_RETURN_AREA_BB,                                      21770000
               PTR_INT_AREA);                                           21780000
                                                                        21790000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    21800000
   WHEN (0);                                                            21810000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 21820000
     DO;                                                                21830000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#091');                      21840000
     END;                                                               21850000
   OTHERWISE                                                            21860000
     DO;                                                                21870000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            21880000
                                 'DB2',                                 21890000
                                 '#092');                               21900000
     END;                                                               21910000
 END;                                                                   21920000
                                                                        21930000
 /********************************************************************/ 21940000
                                                                        21950000
                                                                        21960000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0645_CTRY_SVT';                     21970000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 21980000
                                                                        21990000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      22000000
               PTR_RETURN_AREA_BB,                                      22010000
               PTR_INT_AREA);                                           22020000
                                                                        22030000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    22040000
   WHEN (0);                                                            22050000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 22060000
     DO;                                                                22070000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#093');                      22080000
     END;                                                               22090000
   OTHERWISE                                                            22100000
     DO;                                                                22110000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            22120000
                                 'DB2',                                 22130000
                                 '#094');                               22140000
     END;                                                               22150000
 END;                                                                   22160000
                                                                        22170000
 /********************************************************************/ 22180000
                                                                        22190000
                                                                        22200000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0691_TRANS_OFF';                    22210000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 22220000
                                                                        22230000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      22240000
               PTR_RETURN_AREA_BB,                                      22250000
               PTR_INT_AREA);                                           22260000
                                                                        22270000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    22280000
   WHEN (0);                                                            22290000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 22300000
     DO;                                                                22310000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#095');                      22320000
     END;                                                               22330000
   OTHERWISE                                                            22340000
     DO;                                                                22350000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            22360000
                                 'DB2',                                 22370000
                                 '#096');                               22380000
     END;                                                               22390000
 END;                                                                   22400000
                                                                        22410000
 /********************************************************************/ 22420000
                                                                        22430000
                                                                        22440000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0120_MESE_HW';                      22450000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 22460000
                                                                        22470000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      22480000
               PTR_RETURN_AREA_BB,                                      22490000
               PTR_INT_AREA);                                           22500000
                                                                        22510000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    22520000
   WHEN (0);                                                            22530000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 22540000
     DO;                                                                22550000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#097');                      22560000
     END;                                                               22570000
   OTHERWISE                                                            22580000
     DO;                                                                22590000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            22600000
                                 'DB2',                                 22610000
                                 '#098');                               22620000
     END;                                                               22630000
 END;                                                                   22640000
                                                                        22650000
 /********************************************************************/ 22660000
                                                                        22670000
                                                                        22680000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0650_TRANS_SDF';                    22690000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 22700000
                                                                        22710000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      22720000
               PTR_RETURN_AREA_BB,                                      22730000
               PTR_INT_AREA);                                           22740000
                                                                        22750000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    22760000
   WHEN (0);                                                            22770000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 22780000
     DO;                                                                22790000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#099');                      22800000
     END;                                                               22810000
   OTHERWISE                                                            22820000
     DO;                                                                22830000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            22840000
                                 'DB2',                                 22850000
                                 '#100');                               22860000
     END;                                                               22870000
 END;                                            /* EOC CEDS00000505 */ 22880000
                                                      /* SOC RC01326 */ 22880100
 /********************************************************************/ 22880200
 PARM_RCB024M.VIEW_NAME      = 'RCBT0630_TRANS_HVC';                    22882000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 22883000
                                                                        22884000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      22885000
               PTR_RETURN_AREA_BB,                                      22886000
               PTR_INT_AREA);                                           22887000
                                                                        22888000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    22889000
   WHEN (0);                                                            22889100
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 22889200
     DO;                                                                22889300
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#107');                      22889400
     END;                                                               22889500
   OTHERWISE                                                            22889600
     DO;                                                                22889700
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            22889800
                                 'DB2',                                 22889900
                                 '#108');                               22890000
     END;                                                               22890100
 END;                                                                   22890200
                                                                        22890300
 /********************************************************************/ 22890400
                                                                        22890500
 PARM_RCB024M.VIEW_NAME      = 'RCBT0635_CTRY_HVC';                     22890600
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 22890700
                                                                        22890800
 CALL RCB024M (ADDR(PARM_RCB024M),                                      22890900
               PTR_RETURN_AREA_BB,                                      22891000
               PTR_INT_AREA);                                           22891100
                                                                        22891200
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    22891300
   WHEN (0);                                                            22891400
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 22891500
     DO;                                                                22891600
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#109');                      22891700
     END;                                                               22891800
   OTHERWISE                                                            22891900
     DO;                                                                22892000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            22892100
                                 'DB2',                                 22892200
                                 '#110');                               22892300
     END;                                                               22892400
 END;                                                 /* EOC RC01326 */ 22892500
 END R001_LOCK_TABLES;                                                  22893000
                                                                        22900000
1/********************************************************************/ 22910000
 /*                                                                  */ 22920000
 /* MODULE NAME      : R010_MAX_DATE                                 */ 22930000
 /*                                                                  */ 22940000
 /* DESCRIPTION      : DETERMINE MAXIMUM DATE                        */ 22950000
 /*                                                                  */ 22960000
 /********************************************************************/ 22970000
 R010_MAX_DATE:     PROC (FIRST_IN_DATE,                                22980000
                          SECOND_IN_DATE,                               22990000
                          THIRD_IN_DATE)                                23000000
                    RETURNS (CHAR(10));                                 23010000
 DCL FIRST_IN_DATE   CHAR (10);                                         23020000
 DCL SECOND_IN_DATE  CHAR (10);                                         23030000
 DCL THIRD_IN_DATE   CHAR (10);                                         23040000
 DCL OUT_DATE        CHAR (10);                                         23050000
                                                                        23060000
 OUT_DATE = FIRST_IN_DATE;                                              23070000
                                                                        23080000
 IF OUT_DATE < SECOND_IN_DATE                                           23090000
 THEN                                                                   23100000
   DO;                                                                  23110000
     OUT_DATE = SECOND_IN_DATE;                                         23120000
   END;                                                                 23130000
                                                                        23140000
 IF OUT_DATE < THIRD_IN_DATE                                            23150000
 THEN                                                                   23160000
   DO;                                                                  23170000
     OUT_DATE = THIRD_IN_DATE;                                          23180000
   END;                                                                 23190000
                                                                        23200000
 RETURN(OUT_DATE);                                                      23210000
                                                                        23220000
 END R010_MAX_DATE;                                                     23230000
1/********************************************************************/ 23240000
 /*                                                                  */ 23250000
 /* MODULE NAME      : R011_MIN_DATE                                 */ 23260000
 /*                                                                  */ 23270000
 /* DESCRIPTION      : DETERMINE MINIMUM DATE                        */ 23280000
 /*                                                                  */ 23290000
 /********************************************************************/ 23300000
 R011_MIN_DATE:     PROC (FIRST_IN_DATE,                                23310000
                          SECOND_IN_DATE,                               23320000
                          THIRD_IN_DATE)                                23330000
                    RETURNS (CHAR(10));                                 23340000
                                                                        23350000
 DCL FIRST_IN_DATE   CHAR (10);                                         23360000
 DCL SECOND_IN_DATE  CHAR (10);                                         23370000
 DCL THIRD_IN_DATE   CHAR (10);                                         23380000
 DCL OUT_DATE        CHAR (10);                                         23390000
                                                                        23400000
 OUT_DATE = FIRST_IN_DATE;                                              23410000
                                                                        23420000
 IF OUT_DATE > SECOND_IN_DATE                                           23430000
 THEN                                                                   23440000
   DO;                                                                  23450000
     OUT_DATE = SECOND_IN_DATE;                                         23460000
   END;                                                                 23470000
                                                                        23480000
 IF OUT_DATE > THIRD_IN_DATE                                            23490000
  & THIRD_IN_DATE ¬= ''                                                 23500000
 THEN                                                                   23510000
   DO;                                                                  23520000
     OUT_DATE = THIRD_IN_DATE;                                          23530000
   END;                                                                 23540000
                                                                        23550000
 RETURN(OUT_DATE);                                                      23560000
                                                                        23570000
 END R011_MIN_DATE;                                                     23580000
1/*********************************************************************/23590000
 /*                                                                   */23600000
 /* MODULE NAME      :  R012_TRANS_TIME                               */23610000
 /*                                                                   */23620000
 /* DESCRIPTION      : TRANSLATE DB2 TIME FORMAT TO EXTRACT FILE     */ 23630000
 /*                    TIME FORMAT                                   */ 23640000
 /*                                                                   */23650000
 /*********************************************************************/23660000
 R012_TRANS_TIME: PROC (DB2_TIME_IN)                                    23670000
                  RETURNS(FIXED DEC(3,0));                              23680000
                                                                        23690000
 DCL DB2_TIME_IN         CHAR(08);                                      23700000
 DCL EXTRACT_TIME_OUT    FIXED DEC(3,0);                    /*PTM1142*/ 23710000
 DCL 1 TIME_IN           BASED(ADDR(DB2_TIME_IN)),                      23720000
      3 HOURS            CHAR(02),                                      23730000
      3 POINT            CHAR(01),                                      23740000
      3 MINUTES          PIC'99';                                       23750000
 DCL TIME_OUT_CHAR       CHAR(03);                                      23760000
 /*DCL TIME_OUT_NUM        PIC'999' BASED(ADDR(TIME_OUT_CHAR))*PTM1142*/23770000
                                                    /* SOC * PTM1111 */ 23780000
 DCL PIC_TIME_OUT_CHAR   PIC'999'  BASED(ADDR(TIME_OUT_CHAR));          23790000
 DCL CALC_HOUR_PART      PIC'99V9';                                     23800000
 DCL HOUR_PART           PIC'999';                                      23810000
                                                    /* EOC * PTM1111 */ 23820000
                                                                        23830000
                              /* TRANSLATE                           */ 23840000
 TIME_OUT_CHAR = '';                                      /* PTM1111 */ 23850000
                                                                        23860000
 IF VERIFY(DB2_TIME_IN,'0123456789.') ¬= 0                              23870000
 THEN EXTRACT_TIME_OUT = 0;                                             23880000
 ELSE DO;                                                               23890000
                                                    /* SOC * PTM1111 */ 23900000
   SUBSTR(TIME_OUT_CHAR,1,2) = TIME_IN.HOURS;                           23910000
   CALC_HOUR_PART            = (TIME_IN.MINUTES / 6);                   23920000
   HOUR_PART                 = ROUND(CALC_HOUR_PART,0);                 23930000
   PIC_TIME_OUT_CHAR         = PIC_TIME_OUT_CHAR + HOUR_PART;           23940000
   EXTRACT_TIME_OUT          = PIC_TIME_OUT_CHAR;         /* PTM1142 */ 23950000
                                                    /* EOC * PTM1111 */ 23960000
 END;                                                                   23970000
                                                                        23980000
 RETURN(EXTRACT_TIME_OUT);                                              23990000
                                                                        24000000
 END R012_TRANS_TIME;                                                   24010000
1/********************************************************************/ 24020000
 /*                                                                  */ 24030000
 /* MODULE NAME      : R013_TRANS_DATE                               */ 24040000
 /*                                                                  */ 24050000
 /* DESCRIPTION      : TRANSLATE DB2 DATE FORMAT TO EXTRACT FILE     */ 24060000
 /*                    DATE FORMAT WITH RESPECT FOR OPEN END DATES   */ 24070000
 /*                                                                  */ 24080000
 /********************************************************************/ 24090000
 R013_TRANS_DATE: PROC (DB2_DATE_IN)                                    24100000
                       RETURNS (CHAR(08));                              24110000
                              /* DECLARE VARIABLES                   */ 24120000
 DCL DB2_DATE_IN         CHAR(10);                                      24130000
                                                                        24140000
 IF DB2_DATE_IN = WRK_OPEN_DATE_CH10                                    24150000
   THEN RETURN(WRK_OPEN_DATE_CH8);                                      24160000
   ELSE RETURN(TRANSLATE('CEYRMNDA',DB2_DATE_IN ,'CEYR-MN-DA'));        24170000
                                                                        24180000
                                                                        24190000
 END R013_TRANS_DATE;                                                   24200000
                                                                        24210000
1/*********************************************************************/24220000
 /*                                                       SOC RC01158 */24230000
 /* MODULE NAME      :  R014_DATE_CALC                                */24240000
 /*                                                                   */24250000
 /* DESCRIPTION      :                                                */24260000
 /*                                                                   */24270000
 /*********************************************************************/24280000
 R014_DATE_CALC: PROC (DB2_DATE_IN                                      24290000
                      ,WRK_AMOUNT)                                      24300000
                       RETURNS (CHAR(10));                              24310000
                                                                        24320000
 DCL DB2_DATE_IN         CHAR(10);                                      24330000
 DCL WRK_AMOUNT          FIXED BIN (31);                                24340000
                                                                        24350000
                                                                        24360000
 IF DB2_DATE_IN = '9999-12-31'                         /* SOC PTM1254 */24370000
 THEN DO;                              /* DO NOT CHANGE OPEN END DATE */24380000
   RETURN(DB2_DATE_IN);                                                 24390000
   END;                                                /* EOC PTM1254 */24400000
 ELSE DO;                                                               24410000
   PARM_DATE_CALC = '';                                                 24420000
   PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                               24430000
   PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                               24440000
   PARM_DATE_CALC.WD_FUNCTION    = 'C';                                 24450000
   PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                                 24460000
   PARM_DATE_CALC.WD_PERIOD      = WRK_AMOUNT;                          24470000
   PARM_DATE_CALC.WD_IN_DATE     = DB2_DATE_IN;                         24480000
                                                                        24490000
                                                                        24500000
   CALL RCB004M (ADDR(PARM_DATE_CALC));                                 24510000
                                                                        24520000
   IF PARM_DATE_CALC.WD_STATUS ¬= ''                                    24530000
   THEN                                                                 24540000
     DO;                                                                24550000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#033');                      24560000
     END;                                                               24570000
                                                                        24580000
   RETURN(PARM_DATE_CALC.WD_OUT_DATE);                                  24590000
   END;                                                                 24600000
                                                                        24610000
 END R014_DATE_CALC;                                   /* EOC RC01158 */24620000
1/*********************************************************************/24630000
 /*                                                       SOC RB01308 */24640000
 /* MODULE NAME      :  R018_DATE_CALC8                               */24650000
 /*                                                                   */24660000
 /* DESCRIPTION      :  ADD OR SUBTRACT THE NUMBER OF DAYS PASSED     */24670000
 /*                     THROUGH THE WRK_AMOUNT TO THE GIVEN 8 DIGIT   */24680000
 /*                     DATE (YYYMMDD)                                */24690000
 /*********************************************************************/24700000
 R018_DATE_CALC8: PROC (DATE_IN                                         24710000
                      ,WRK_AMOUNT)                                      24720000
                       RETURNS (CHAR(8));                               24730000
                                                                        24740000
 DCL DATE_IN         CHAR(8);                                           24750000
 DCL DB2_DATE_IN     CHAR(10);                                          24760000
 DCL WRK_AMOUNT      FIXED BIN (31);                                    24770000
                               /* CHANGE INPUT DATE TO 10 DIGIT DATE */ 24780000
 DB2_DATE_IN = SUBSTR(DATE_IN,1,4) || '-' ||                            24790000
               SUBSTR(DATE_IN,5,2) || '-' ||                            24800000
               SUBSTR(DATE_IN,7,2) ;                                    24810000
                                                                        24820000
 IF DB2_DATE_IN = '9999-12-31'                                          24830000
 THEN DO;                             /* DO NOT CHANGE OPEN END DATE */ 24840000
   RETURN('99991231');                                                  24850000
   END;                                                                 24860000
 ELSE IF DB2_DATE_IN = '9999-99-99'                                     24870000
 THEN DO;                             /* DO NOT CHANGE OPEN END DATE */ 24880000
   RETURN('99999999');                                                  24890000
   END;                                                                 24900000
 ELSE DO;                                                               24910000
  PARM_DATE_CALC = '';                                                  24920000
  PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                                24930000
  PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                                24940000
  PARM_DATE_CALC.WD_FUNCTION    = 'C';                                  24950000
  PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                                  24960000
  PARM_DATE_CALC.WD_PERIOD      = WRK_AMOUNT;                           24970000
  PARM_DATE_CALC.WD_IN_DATE     = DB2_DATE_IN;                          24980000
                                                                        24990000
  CALL RCB004M (ADDR(PARM_DATE_CALC));                                  25000000
                                                                        25010000
  IF PARM_DATE_CALC.WD_STATUS ¬= ''                                     25020000
  THEN                                                                  25030000
    DO;                                                                 25040000
      CALL RCBDRIM_ERROR (NULL, 'OTHER', '#102');                       25050000
    END;                                                                25060000
                          /* CONVERT BACK TO 8 DIGIT DATE AND RETURN */ 25070000
  RETURN(TRANSLATE('CEYRMNDA',                                          25080000
                    PARM_DATE_CALC.WD_OUT_DATE,'CEYR-MN-DA'));          25090000
  END;                                                                  25100000
                                                                        25110000
 END R018_DATE_CALC8;                                  /* EOC RB01308 */25120000
1/*********************************************************************/25130000
 /*                                                                   */25140000
 /* MODULE NAME      :  R015_TRANS_ATO                                */25150000
 /*                                                                   */25160000
 /* DESCRIPTION      : TRANSLATE AGREEMENT TYPE/OPTION INTO TYPE OF   */25170000
 /*                    MAINTENANCE AND SERVICE TYPE                   */25180000
 /*                    FOR RA01233 THE TYPE OF SERVICE IS NOW HELD IN */25190000
 /*                    THE SERV_DEL_M FIELD SO THE NAME AND LENGTH   */ 25200000
 /*                    HAVE BEEN CHANGED.                             */25210000
 /*                                                                   */25220000
 /*********************************************************************/25230000
 R015_TRANS_ATO: PROC (AGREEMENT_TYPE,                                  25240000
                       AGREEMENT_OPTION,                                25250000
                       TYPE_OF_MAINT,                                   25260000
                       SERVICE_DELIV_M,             /* RA01233  */      25270000
                       SOURCE_INDICATOR );          /* PTM 1318 */      25280000
                                                                        25290000
 DCL AGREEMENT_TYPE   CHAR (2);                                         25300000
 DCL AGREEMENT_OPTION CHAR (1);                                         25310000
 DCL TYPE_OF_MAINT    CHAR (1);                                         25320000
 DCL SERVICE_DELIV_M  CHAR (3);                     /* RA01233  */      25330000
 DCL SOURCE_INDICATOR CHAR (1);                     /* PTM 1318 */      25340000
                                                                        25350000
 TB_RCBV610                  = '';                                      25360000
 TB_RCBV610_I                = '';                                      25370000
 TB_RCBV610.COUNTRY_NUMBER   = WRK_CTRYNO;                              25380000
 TB_RCBV610.AGREEMENT_TYPE   = AGREEMENT_TYPE;                          25390000
 TB_RCBV610.AGREEMENT_OPTION = AGREEMENT_OPTION;                        25400000
                                                                        25410000
 CALL RCBI61M (ADDR(TB_RCBV610),                                        25420000
               ADDR(TB_RCBV610_I),                                      25430000
               ADDR(RETURN_AREA_BB),                                    25440000
               PTR_INT_AREA);                                           25450000
                                                                        25460000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   25470000
 WHEN (0)                                                               25480000
   DO;                                                                  25490000
     TYPE_OF_MAINT = TB_RCBV610.TYPE_OF_MAINT;                          25500000
     SERVICE_DELIV_M = TB_RCBV610.SERVICE_TYPE;           /* RA01233 */ 25510000
   END;                                                                 25520000
 WHEN (4)                                                               25530000
   DO;                                                                  25540000
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            25550000
     PARM_INT_AREA.MESSAGE_NUMBER    = 'I061';                          25560000
     PARM_INT_AREA.MSG_VAR_CODES     = '';                              25570000
     PARM_INT_AREA.MSG_VAR_CODE_1    = 'HW';                            25580000
     PARM_INT_AREA.MSG_VAR_VALUE_1   = SK_CURRENT_HW.PRODUCT_TYPE       25590000
                                     ||SK_CURRENT_HW.ORIGIN             25600000
                                     ||SK_CURRENT_HW.SEQUENCE_NUMBER;   25610000
     PARM_INT_AREA.MSG_VAR_CODE_6    = 'AT';                            25620000
     PARM_INT_AREA.MSG_VAR_VALUE_6   = AGREEMENT_TYPE;                  25630000
     PARM_INT_AREA.MSG_VAR_CODE_7    = 'AO';                            25640000
     PARM_INT_AREA.MSG_VAR_VALUE_7   = AGREEMENT_OPTION;                25650000
     CALL RCB0M1M (PTR_INT_AREA);                                       25660000
     TYPE_OF_MAINT = '2';               /*   PTM 1318  */               25670000
     IF SOURCE_INDICATOR = 'E'          /*   PTM 1318  */               25680000
     THEN DO;                                                           25690000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#034');                      25700000
     END;                                                               25710000
   END;                                                                 25720000
 OTHERWISE                                                              25730000
   DO;                                                                  25740000
     CALL RCBDRIM_ERROR (ADDR(RETURN_AREA_BB.RETURN_SQL),               25750000
                         'DB2',                                         25760000
                         '#035');                                       25770000
   END;                                                                 25780000
 END;                                                                   25790000
                                                                        25800000
 END R015_TRANS_ATO;                                                    25810000
1/*********************************************************************/25820000
 /*                                                       SOC RA01233*/ 25830000
 /* MODULE NAME      :  R016_FILL_COVERAGE_HOURS                      */25840000
 /*                                                                   */25850000
 /* DESCRIPTION      : TRANSLATE SERVICE LEVEL CODE INTO COVERAGE     */25860000
 /*                    HOURS                                          */25870000
 /*                                                                   */25880000
 /*********************************************************************/25890000
 R016_FILL_COVERAGE_HOURS: PROC (SERVICE_LVL_CODE,WRK_SET_HRS);         25900000
                                                                        25910000
 DCL SERVICE_LVL_CODE   CHAR(03);                                       25920000
 DCL WRK_SET_HRS        CHAR(1);                                        25930000
                                                                        25940000
 TB_RCBV470                  = '';                                      25950000
 TB_RCBV470_I                = '';                                      25960000
 TB_RCBV470.SERVICE_LVL_CODE = SERVICE_LVL_CODE;                        25970000
                                                                        25980000
 CALL RCBISRM (ADDR(TB_RCBV470),                                        25990000
               ADDR(TB_RCBV470_I),                                      26000000
               ADDR(RETURN_AREA_BB),                                    26010000
               PTR_INT_AREA);                                           26020000
                                                                        26030000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   26040000
 WHEN (0)                                                               26050000
   DO;                                                                  26060000
     WRK_PERIOD.SLC = SERVICE_LVL_CODE;                                 26070000
     WRK_PERIOD.SERV_DEL_M = TB_RCBV470.SERVICE_DLVR_METHD;             26080000
     WRK_PERIOD.TIMEZERO   = TB_RCBV470.TIME_ZERO_IND;                  26090000
     CALL R016B_TIME_TARGETS;                                           26100000
     WRK_PERIOD.COMMENT_TEXT = TB_RCBV470.COMMENT_TEXT;                 26110000
     IF WRK_SET_HRS = 'Y'                                               26120000
     THEN DO;                                                           26130000
       WRK_PERIOD.DAGRMFR(1) =                                          26140000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_1); 26150000
       WRK_PERIOD.DAGRMTO(1) =                                          26160000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_1);   26170000
       WRK_PERIOD.DAGRMFR(2) =                                          26180000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_2); 26190000
       WRK_PERIOD.DAGRMTO(2) =                                          26200000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_2);   26210000
       WRK_PERIOD.DAGRMFR(3) =                                          26220000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_3); 26230000
       WRK_PERIOD.DAGRMTO(3) =                                          26240000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_3);   26250000
       WRK_PERIOD.DAGRMFR(4) =                                          26260000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_4); 26270000
       WRK_PERIOD.DAGRMTO(4) =                                          26280000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_4);   26290000
       WRK_PERIOD.DAGRMFR(5) =                                          26300000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_5); 26310000
       WRK_PERIOD.DAGRMTO(5) =                                          26320000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_5);   26330000
       WRK_PERIOD.DAGRMFR(6) =                                          26340000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_6); 26350000
       WRK_PERIOD.DAGRMTO(6) =                                          26360000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_6);   26370000
       WRK_PERIOD.DAGRMFR(7) =                                          26380000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_START_7); 26390000
       WRK_PERIOD.DAGRMTO(7) =                                          26400000
                          R012_TRANS_TIME(TB_RCBV470.COVERAGE_END_7);   26410000
     END;                                                               26420000
   END;                                                                 26430000
 OTHERWISE                                                              26440000
   DO;                                                                  26450000
     CALL RCBDRIM_ERROR (ADDR(RETURN_AREA_BB.RETURN_SQL),               26460000
                         'DB2',                                         26470000
                         '#036');                                       26480000
   END;                                                                 26490000
 END;                                                                   26500000
                                                                        26510000
 END R016_FILL_COVERAGE_HOURS;                         /* EOC RA01233 */26520000
                                                                        26530000
1/*********************************************************************/26540000
 /*                                                       SOC RA01233 */26550000
 /* MODULE NAME      :  R016B_TIME_TARGETS                            */26560000
 /*                                                                   */26570000
 /* DESCRIPTION      : TRANSLATE SERVICE LEVEL CODE INTO              */26580000
 /*                    SERVICE_TYPE                                   */26590000
 /*                                                                   */26600000
 /*********************************************************************/26610000
 R016B_TIME_TARGETS: PROC;                                              26620000
 WRK_PERIOD.PRES_VALID = 'N';                                           26630000
 IF TB_RCBV470_I.INDNULL(18) = 0                                        26640000
 THEN DO;                                                               26650000
   WRK_PERIOD.CONTACT_TIME_QTY_1 = TB_RCBV470.CONTACT_TIME_QTY_1;       26660000
   WRK_PERIOD.CONTACT_TIME_UNT_1 = TB_RCBV470.CONTACT_TIME_UNT_1;       26670000
   WRK_PERIOD.CONTACT_TIME_COM_1 = TB_RCBV470.CONTACT_TIME_COM_1;       26680000
   WRK_PERIOD.PRES_VALID = 'Y';                                         26690000
 END;                                                                   26700000
 IF TB_RCBV470_I.INDNULL(21) = 0                                        26710000
 THEN DO;                                                               26720000
   WRK_PERIOD.CONTACT_TIME_QTY_2 = TB_RCBV470.CONTACT_TIME_QTY_2;       26730000
   WRK_PERIOD.CONTACT_TIME_UNT_2 = TB_RCBV470.CONTACT_TIME_UNT_2;       26740000
   WRK_PERIOD.CONTACT_TIME_COM_2 = TB_RCBV470.CONTACT_TIME_COM_2;       26750000
   WRK_PERIOD.PRES_VALID = 'Y';                                         26760000
 END;                                                                   26770000
 IF TB_RCBV470_I.INDNULL(24) = 0                                        26780000
 THEN DO;                                                               26790000
   WRK_PERIOD.CONTACT_TIME_QTY_3 = TB_RCBV470.CONTACT_TIME_QTY_3;       26800000
   WRK_PERIOD.CONTACT_TIME_UNT_3 = TB_RCBV470.CONTACT_TIME_UNT_3;       26810000
   WRK_PERIOD.CONTACT_TIME_COM_3 = TB_RCBV470.CONTACT_TIME_COM_3;       26820000
   WRK_PERIOD.PRES_VALID = 'Y';                                         26830000
 END;                                                                   26840000
 IF TB_RCBV470_I.INDNULL(27) = 0                                        26850000
 THEN DO;                                                               26860000
   WRK_PERIOD.ONSITE_RESP_QTY_1 = TB_RCBV470.ONSITE_RESP_QTY_1;         26870000
   WRK_PERIOD.ONSITE_RESP_UNT_1 = TB_RCBV470.ONSITE_RESP_UNT_1;         26880000
   WRK_PERIOD.ONSITE_RESP_COM_1 = TB_RCBV470.ONSITE_RESP_COM_1;         26890000
   WRK_PERIOD.PRES_VALID = 'Y';                                         26900000
 END;                                                                   26910000
 IF TB_RCBV470_I.INDNULL(30) = 0                                        26920000
 THEN DO;                                                               26930000
   WRK_PERIOD.ONSITE_RESP_QTY_2 = TB_RCBV470.ONSITE_RESP_QTY_2;         26940000
   WRK_PERIOD.ONSITE_RESP_UNT_2 = TB_RCBV470.ONSITE_RESP_UNT_2;         26950000
   WRK_PERIOD.ONSITE_RESP_COM_2 = TB_RCBV470.ONSITE_RESP_COM_2;         26960000
   WRK_PERIOD.PRES_VALID = 'Y';                                         26970000
 END;                                                                   26980000
 IF TB_RCBV470_I.INDNULL(33) = 0                                        26990000
 THEN DO;                                                               27000000
   WRK_PERIOD.ONSITE_RESP_QTY_3 = TB_RCBV470.ONSITE_RESP_QTY_3;         27010000
   WRK_PERIOD.ONSITE_RESP_UNT_3 = TB_RCBV470.ONSITE_RESP_UNT_3;         27020000
   WRK_PERIOD.ONSITE_RESP_COM_3 = TB_RCBV470.ONSITE_RESP_COM_3;         27030000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27040000
 END;                                                                   27050000
 IF TB_RCBV470_I.INDNULL(36) = 0                                        27060000
 THEN DO;                                                               27070000
   WRK_PERIOD.FIX_TIME_QTY_1 = TB_RCBV470.FIX_TIME_QTY_1;               27080000
   WRK_PERIOD.FIX_TIME_UNT_1 = TB_RCBV470.FIX_TIME_UNT_1;               27090000
   WRK_PERIOD.FIX_TIME_COM_1 = TB_RCBV470.FIX_TIME_COM_1;               27100000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27110000
 END;                                                                   27120000
 IF TB_RCBV470_I.INDNULL(39) = 0                                        27130000
 THEN DO;                                                               27140000
   WRK_PERIOD.FIX_TIME_QTY_2 = TB_RCBV470.FIX_TIME_QTY_2;               27150000
   WRK_PERIOD.FIX_TIME_UNT_2 = TB_RCBV470.FIX_TIME_UNT_2;               27160000
   WRK_PERIOD.FIX_TIME_COM_2 = TB_RCBV470.FIX_TIME_COM_2;               27170000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27180000
 END;                                                                   27190000
 IF TB_RCBV470_I.INDNULL(42) = 0                                        27200000
 THEN DO;                                                               27210000
   WRK_PERIOD.FIX_TIME_QTY_3 = TB_RCBV470.FIX_TIME_QTY_3;               27220000
   WRK_PERIOD.FIX_TIME_UNT_3 = TB_RCBV470.FIX_TIME_UNT_3;               27230000
   WRK_PERIOD.FIX_TIME_COM_3 = TB_RCBV470.FIX_TIME_COM_3;               27240000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27250000
 END;                                                                   27260000
 IF TB_RCBV470_I.INDNULL(45) = 0                                        27270000
 THEN DO;                                                               27280000
   WRK_PERIOD.TURN_AROUND_QTY_1 = TB_RCBV470.TURN_AROUND_QTY_1;         27290000
   WRK_PERIOD.TURN_AROUND_UNT_1 = TB_RCBV470.TURN_AROUND_UNT_1;         27300000
   WRK_PERIOD.TURN_AROUND_COM_1 = TB_RCBV470.TURN_AROUND_COM_1;         27310000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27320000
 END;                                                                   27330000
 IF TB_RCBV470_I.INDNULL(48) = 0                                        27340000
 THEN DO;                                                               27350000
   WRK_PERIOD.TURN_AROUND_QTY_2 = TB_RCBV470.TURN_AROUND_QTY_2;         27360000
   WRK_PERIOD.TURN_AROUND_UNT_2 = TB_RCBV470.TURN_AROUND_UNT_2;         27370000
   WRK_PERIOD.TURN_AROUND_COM_2 = TB_RCBV470.TURN_AROUND_COM_2;         27380000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27390000
 END;                                                                   27400000
 IF TB_RCBV470_I.INDNULL(51) = 0                                        27410000
 THEN DO;                                                               27420000
   WRK_PERIOD.TURN_AROUND_QTY_3 = TB_RCBV470.TURN_AROUND_QTY_3;         27430000
   WRK_PERIOD.TURN_AROUND_UNT_3 = TB_RCBV470.TURN_AROUND_UNT_3;         27440000
   WRK_PERIOD.TURN_AROUND_COM_3 = TB_RCBV470.TURN_AROUND_COM_3;         27450000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27460000
 END;                                                                   27470000
 IF TB_RCBV470_I.INDNULL(54) = 0                                        27480000
 THEN DO;                                                               27490000
   WRK_PERIOD.PRT_ONS_TIME_QTY_1 = TB_RCBV470.PRT_ONS_TIME_QTY_1;       27500000
   WRK_PERIOD.PRT_ONS_TIME_UNT_1 = TB_RCBV470.PRT_ONS_TIME_UNT_1;       27510000
   WRK_PERIOD.PRT_ONS_TIME_COM_1 = TB_RCBV470.PRT_ONS_TIME_COM_1;       27520000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27530000
 END;                                                                   27540000
 IF TB_RCBV470_I.INDNULL(57) = 0                                        27550000
 THEN DO;                                                               27560000
   WRK_PERIOD.PRT_ONS_TIME_QTY_2 = TB_RCBV470.PRT_ONS_TIME_QTY_2;       27570000
   WRK_PERIOD.PRT_ONS_TIME_UNT_2 = TB_RCBV470.PRT_ONS_TIME_UNT_2;       27580000
   WRK_PERIOD.PRT_ONS_TIME_COM_2 = TB_RCBV470.PRT_ONS_TIME_COM_2;       27590000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27600000
 END;                                                                   27610000
 IF TB_RCBV470_I.INDNULL(60) = 0                                        27620000
 THEN DO;                                                               27630000
   WRK_PERIOD.PRT_ONS_TIME_QTY_3 = TB_RCBV470.PRT_ONS_TIME_QTY_3;       27640000
   WRK_PERIOD.PRT_ONS_TIME_UNT_3 = TB_RCBV470.PRT_ONS_TIME_UNT_3;       27650000
   WRK_PERIOD.PRT_ONS_TIME_COM_3 = TB_RCBV470.PRT_ONS_TIME_COM_3;       27660000
   WRK_PERIOD.PRES_VALID = 'Y';                                         27670000
 END;                                                                   27680000
 END R016B_TIME_TARGETS;                               /* EOC RA01233 */27690000
1/*********************************************************************/27700000
 /*                                                       SOC PTM1401 */27710000
 /* MODULE NAME      :  R016C_FILL_PEW_SDF_DETAIL                     */27720000
 /*                                                                   */27730000
 /* DESCRIPTION      : TRANSLATE PEW SDF INTO COVERAGE HOURS, RESPONSE*/27740000
 /*                    TIMES ETC.                                     */27750000
 /*                                                                   */27760000
 /*********************************************************************/27770000
 R016C_FILL_PEW_SDF_DETAIL: PROC ;                                      27780000
                                                                        27790000
 COPY_HW_PI_SDF = SAVED_HW_PI.SERVICE_DELIV_FLAG;         /* RB01236*/  27800000
                                                                        27810000
 TB_RCBV680                  = '';                                      27820000
 TB_RCBV680_I                = '';                                      27830000
                                                                        27840000
 EXEC SQL                                                               27850000
      SELECT SDF ,                                                      27860000
             TOT_MONTHS ,                                               27870000
             PHASE ,                                                    27880000
             PHASE_DURATION ,                                           27890000
             SERVICE_DELIV ,                                            27900000
             WARR_MAINT_UPG ,                                           27910000
             LABOR_FLAG ,                                               27920000
             TRAVEL_FLAG ,                                              27930000
             PARTS_FLAG ,                                               27940000
             HC_MONTHS ,                                                27950000
             COVERAGE_HOURS ,                                           27960000
             COVERAGE_DAYS ,                                            27970000
             COVERAGE_MONTHS,                                           27980000
             RESPONSE_TIME ,                                            27990000
             RESPONSE_IND ,                                             28000000
             SDF_DESC ,                                                 28010000
             MON_START,                                                 28020000
             MON_STOP ,                                                 28030000
             TUE_START,                                                 28040000
             TUE_STOP ,                                                 28050000
             WED_START,                                                 28060000
             WED_STOP ,                                                 28070000
             THU_START,                                                 28080000
             THU_STOP ,                                                 28090000
             FRI_START,                                                 28100000
             FRI_STOP ,                                                 28110000
             SAT_START,                                                 28120000
             SAT_STOP ,                                                 28130000
             SUN_START,                                                 28140000
             SUN_STOP                                                   28150000
        INTO :TB_RCBV680                                                28160000
             :TB_RCBV680_I.INDNULL                                      28170000
        FROM RCBV0680_TRANS_PEW  T680                                   28180000
       WHERE T680.SDF = :COPY_HW_PI_SDF                   /* RB01236*/  28190000
         AND T680.PHASE = '1'                                           28200000
        WITH UR;                                                        28210000
                                                                        28220000
 SELECT(SQLCA.SQLCODE);                                                 28230000
   WHEN(0)                                                              28240000
     DO;                                                                28250000
       WRK_PERIOD.SLC          = TB_RCBV680.SDF;                        28260000
       WRK_PERIOD.SERV_DEL_M   = TB_RCBV680.SERVICE_DELIV;              28270000
       WRK_PERIOD.TIMEZERO     = '';                                    28280000
       IF WRK_SET_HRS = 'Y' THEN                                        28290000
         DO;                                                            28300000
           WRK_PERIOD.DAGRMFR(1) =                                      28310000
                                R012_TRANS_TIME(TB_RCBV680.MON_START);  28320000
           WRK_PERIOD.DAGRMTO(1) =                                      28330000
                                R012_TRANS_TIME(TB_RCBV680.MON_STOP);   28340000
           WRK_PERIOD.DAGRMFR(2) =                                      28350000
                                R012_TRANS_TIME(TB_RCBV680.TUE_START);  28360000
           WRK_PERIOD.DAGRMTO(2) =                                      28370000
                                R012_TRANS_TIME(TB_RCBV680.TUE_STOP);   28380000
           WRK_PERIOD.DAGRMFR(3) =                                      28390000
                                R012_TRANS_TIME(TB_RCBV680.WED_START);  28400000
           WRK_PERIOD.DAGRMTO(3) =                                      28410000
                                R012_TRANS_TIME(TB_RCBV680.WED_STOP);   28420000
           WRK_PERIOD.DAGRMFR(4) =                                      28430000
                                R012_TRANS_TIME(TB_RCBV680.THU_START);  28440000
           WRK_PERIOD.DAGRMTO(4) =                                      28450000
                                R012_TRANS_TIME(TB_RCBV680.THU_STOP);   28460000
           WRK_PERIOD.DAGRMFR(5) =                                      28470000
                                R012_TRANS_TIME(TB_RCBV680.FRI_START);  28480000
           WRK_PERIOD.DAGRMTO(5) =                                      28490000
                                R012_TRANS_TIME(TB_RCBV680.FRI_STOP);   28500000
           WRK_PERIOD.DAGRMFR(6) =                                      28510000
                                R012_TRANS_TIME(TB_RCBV680.SAT_START);  28520000
           WRK_PERIOD.DAGRMTO(6) =                                      28530000
                                R012_TRANS_TIME(TB_RCBV680.SAT_STOP);   28540000
           WRK_PERIOD.DAGRMFR(7) =                                      28550000
                                R012_TRANS_TIME(TB_RCBV680.SUN_START);  28560000
           WRK_PERIOD.DAGRMTO(7) =                                      28570000
                                R012_TRANS_TIME(TB_RCBV680.SUN_STOP);   28580000
         END;                                                           28590000
                                                                        28600000
       WRK_QTYD                      = TB_RCBV680.RESPONSE_TIME;        28610000
       IF TB_RCBV680.RESPONSE_IND = 'H' THEN                            28620000
         WRK_PERIOD.ONSITE_RESP_QTY_1 = WRK_QTYH;                       28630000
       ELSE                                                             28640000
         WRK_PERIOD.ONSITE_RESP_QTY_1 = WRK_QTYD;                       28650000
       WRK_PERIOD.ONSITE_RESP_UNT_1 = TB_RCBV680.RESPONSE_IND;          28660000
       WRK_PERIOD.ONSITE_RESP_COM_1 = '';                               28670000
                                                                        28680000
       WRK_PERIOD.PRES_VALID   = 'Y';                                   28690000
       WRK_PERIOD.COMMENT_TEXT = TB_RCBV680.SDF_DESC;                   28700000
     END;                                                               28710000
   WHEN(100);                                                           28720000
   OTHERWISE                                                            28730000
     DO;                                                                28740000
       CALL RCBDRIM_ERROR (ADDR(SQLCA),                                 28750000
                           'DB2',                                       28760000
                           '#037');                                     28770000
     END;                                                               28780000
 END;                                                                   28790000
                                                                        28800000
 END R016C_FILL_PEW_SDF_DETAIL;                        /* EOC PTM1401 */28810000
1/*********************************************************************/28820000
 /*                                                                   */28830000
 /* MODULE NAME      :  R400_RETR_ADD_CONTR_INFO                      */28840000
 /*                                                                   */28850000
 /* DESCRIPTION      :                                                */28860000
 /*                                                                   */28870000
 /*********************************************************************/28880000
 R400_RETR_ADD_CONTR_INFO: PROC;                                        28890000
                                                                        28900000
 IF TB_RCBV240.CONTRACT_NUMBER ¬= ''                                    28910000
 THEN                                                                   28920000
   DO;                                                                  28930000
     TB_RCBV030 = '';                                                   28940000
     WRK_TOC_V30_IND = 0;                                   /*RB01290 */28950000
                                                                        28960000
     EXEC SQL                                                           28970000
       SELECT TYPE_OF_CONTRACT                                          28980000
 /*      INTO :TB_RCBV030.TYPE_OF_CONTRACT    :WRK_INDNULL  /*RB01290 */28990000
         INTO :TB_RCBV030.TYPE_OF_CONTRACT :WRK_TOC_V30_IND /*RB01290 */29000000
         FROM RCBV0030_CONTRACT                                         29010000
        WHERE COUNTRY_NUMBER  = :WRK_CTRYNO                             29020000
          AND CONTRACT_NUMBER = :TB_RCBV240.CONTRACT_NUMBER             29030000
       ;                                                                29040000
                                                                        29050000
      SELECT (SQLCODE);                                                 29060000
       WHEN (0) ;                                                       29070000
       WHEN (100);                                                      29080000
       OTHERWISE                                                        29090000
         DO;                                                            29100000
           CALL RCBDRIM_ERROR (ADDR (SQLCA),                            29110000
                               'DB2',                                   29120000
                               '#038');                                 29130000
         END;                                                           29140000
     END;                                                               29150000
   END;                                                                 29170000
                                                                        29180000
 END R400_RETR_ADD_CONTR_INFO;                                          29190000
1/*********************************************************************/29200000
 /*                                                                   */29210000
 /* MODULE NAME      :  R402_FILL_SERV_CTR_PERIOD                     */29220000
 /*                                                                   */29230000
 /* DESCRIPTION      :                                                */29240000
 /*                                                                   */29250000
 /*********************************************************************/29260000
                                                      /* SOC PTM0988 */ 29270000
 R402_FILL_SERV_CTR_PERIOD: PROC (PARM_EFF_DATE                         29280000
                                 ,PARM_END_DATE);                       29290000
                                                                        29300000
 DCL PARM_EFF_DATE CHAR (10);                                           29310000
 DCL PARM_END_DATE CHAR (10);                                           29320000
                                                                        29330000
                                                                        29340000
 WRK_PERIOD.EFFDATE    = R013_TRANS_DATE(PARM_EFF_DATE);                29350000
 WRK_PERIOD.ENDDATE    = R013_TRANS_DATE(PARM_END_DATE);                29360000
                                                      /* EOC PTM0988 */ 29370000
                                                                        29380000
 WRK_PERIOD.TAKE_CEDS   = 'Y';                                          29390000
 WRK_PERIOD_HVP_QUANTITY= TB_RCBV240.HVP_QUANTITY;                      29400000
 WRK_PERIOD.IAGRNBR     = TB_RCBV240.CONTRACT_NUMBER;                   29410000
                                                                        29420000
   IF ((WRK_COVERAGE_START_1_IND                                        29430000
      + WRK_COVERAGE_START_2_IND                                        29440000
      + WRK_COVERAGE_START_3_IND                                        29450000
      + WRK_COVERAGE_START_4_IND                                        29460000
      + WRK_COVERAGE_START_5_IND                                        29470000
      + WRK_COVERAGE_START_6_IND                                        29480000
      + WRK_COVERAGE_START_7_IND                                        29490000
      + WRK_COVERAGE_END_1_IND                                          29500000
      + WRK_COVERAGE_END_2_IND                                          29510000
      + WRK_COVERAGE_END_3_IND                                          29520000
      + WRK_COVERAGE_END_4_IND                                          29530000
      + WRK_COVERAGE_END_5_IND                                          29540000
      + WRK_COVERAGE_END_6_IND                                          29550000
      + WRK_COVERAGE_END_7_IND                                          29560000
      = -14)                                                            29570000
      | (TB_RCBV240.COVERAGE_START_1 = '00.00.00'                       29580000
       & TB_RCBV240.COVERAGE_START_2 = '00.00.00'                       29590000
       & TB_RCBV240.COVERAGE_START_3 = '00.00.00'                       29600000
       & TB_RCBV240.COVERAGE_START_4 = '00.00.00'                       29610000
       & TB_RCBV240.COVERAGE_START_5 = '00.00.00'                       29620000
       & TB_RCBV240.COVERAGE_START_6 = '00.00.00'                       29630000
       & TB_RCBV240.COVERAGE_START_7 = '00.00.00'                       29640000
       & TB_RCBV240.COVERAGE_END_1   = '00.00.00'                       29650000
       & TB_RCBV240.COVERAGE_END_2   = '00.00.00'                       29660000
       & TB_RCBV240.COVERAGE_END_3   = '00.00.00'                       29670000
       & TB_RCBV240.COVERAGE_END_4   = '00.00.00'                       29680000
       & TB_RCBV240.COVERAGE_END_5   = '00.00.00'                       29690000
       & TB_RCBV240.COVERAGE_END_6   = '00.00.00'                       29700000
       & TB_RCBV240.COVERAGE_END_7   = '00.00.00'))                     29710000
 THEN                                                                   29720000
   WRK_SET_HRS = 'Y';       /* SET HOURS FROM SLC */                    29730000
 ELSE                                                                   29740000
   WRK_SET_HRS = 'N';                                                   29750000
                                                                        29760000
 IF (WRK_T240_SLC_IND ¬= -1)                          /* SOC RC01194 */ 29770000
 THEN                                                                   29780000
   CALL R016_FILL_COVERAGE_HOURS (TB_RCBV240.SERVICE_LVL_CODE,          29790000
                                    WRK_SET_HRS);                       29800000
 ELSE                                                                   29810000
   WRK_PERIOD.PRES_VALID = 'N';                                         29820000
                                                                        29830000
 /* IF THE SLC IN CONTRACT TABLE IS BLANK THEN GET    /* SOC RB01299 */ 29840000
 /* SDM DETAILS BASED ON SERVICE TYPE FROM T645                      */ 29850000
 IF TB_RCBV240.SERVICE_LVL_CODE = '' THEN                               29860000
    CALL R406_RETRIEVE_SRVICE_DLVRY_CONS;             /* EOC RB01299 */ 29870000
                                                                        29880000
 IF WRK_SET_HRS = 'N'       /* SET HOURS FROM T240, NOT FROM T470 */    29890000
 THEN DO;                                                               29900000
   WRK_PERIOD.DAGRMFR(1) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_1);29910000
   WRK_PERIOD.DAGRMTO(1) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_1);  29920000
   WRK_PERIOD.DAGRMFR(2) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_2);29930000
   WRK_PERIOD.DAGRMTO(2) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_2);  29940000
   WRK_PERIOD.DAGRMFR(3) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_3);29950000
   WRK_PERIOD.DAGRMTO(3) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_3);  29960000
   WRK_PERIOD.DAGRMFR(4) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_4);29970000
   WRK_PERIOD.DAGRMTO(4) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_4);  29980000
   WRK_PERIOD.DAGRMFR(5) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_5);29990000
   WRK_PERIOD.DAGRMTO(5) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_5);  30000000
   WRK_PERIOD.DAGRMFR(6) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_6);30010000
   WRK_PERIOD.DAGRMTO(6) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_6);  30020000
   WRK_PERIOD.DAGRMFR(7) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_START_7);30030000
   WRK_PERIOD.DAGRMTO(7) = R012_TRANS_TIME(TB_RCBV240.COVERAGE_END_7);  30040000
   END;                                                                 30050000
                                                                        30060000
                                                                        30070000
 IF SW_WARRANTY                                       /* SOC RC01158 */ 30080000
 THEN                                                                   30090000
   DO;                                                                  30100000
     WRK_PERIOD.TPMNT         = CURSOR_INST_HW_V220.TYPE_OF_WARRANTY;   30110000
 /* WHEN CONTRACT OVERLAPS WITH WARRANTY, SDM DETAILS /* SOC RB01299 */ 30120000
 /* SHOULD BE FILLED BASED ON CONTRACT/240 SLC                       */ 30130000
 /* WRK_PERIOD.SERV_DEL_M    = TB_RCBV240.SERVICE_TYPE;   /* RA01233 */ 30140000
                                                      /* EOC RB01299 */ 30150000
    IF WRK_PERIOD.EFFDATE <= WRK_RUN_DATE8  &         /* SOC RB01308 */ 30160000
       WRK_PERIOD.ENDDATE >= WRK_RUN_DATE8  THEN                        30170000
     FILE_RCBDRI1.BASE_WARRANTY_SLC =                                   30180000
                            TMP_BAU_BASE_WARRANTY_SLC;/* EOC RB01308 */ 30190000
   END;                                                                 30200000
 ELSE                                               /* SOC : RB01274 */ 30210000
   DO;                                                                  30220000
                                                      /* CEDS00000493 */30230000
   /*SWITCH_PIWARR_BAUCTR     = FALSE;                     /* RB01298 */30240000
   /*CALL R403_READ_RCBT0051;                        /* CEDS00000497 */ 30250000
                                                       /* SOC RB01298 */30260000
 /*  IF (VERIFY(WRK051_TYPE_OF_WARRANTY,WRK_TPMNT_VAL.TPMNT_WAR) = 0    30270000
       | VERIFY(WRK051_F_TYPE_OF_WARRANTY,                   /*RB01281*/30280000
 /*    SUBSTR(PARM_RCB063S.F_WARRANTY_MACHINE,1,1)) = 0)     /*RB01281*/30290000
 /*  &                                                                  30300000
        WRK_INDNULL ¬= -1 THEN                                        */30310000
                                                  /* SOC CEDS00000497 */30320000
 /*  IF ((VERIFY(WRK051_TYPE_OF_WARRANTY,WRK_TPMNT_VAL.TPMNT_WAR) = 0 */30330000
 /*  &                                                                */30340000
 /*     WRK_TOW_V051_IND ¬= -1)                                       */30350000
 /*    | ((VERIFY(WRK051_F_TYPE_OF_WARRANTY,WRK_FW_TOW) = 0)          */30360000
 /*    |  (VERIFY(WRK051_F_TYPE_OF_WARRANTY,WRK_HB_TOM) = 0)          */30370000
 /*  &                                                                */30380000
 /*     (WRK_FTOW_V051_IND ¬= -1))) THEN               /* EOC RB01298 */30390000
 /*   DO;                                                               30400000
 /*     WRK_PERIOD.TPMNT      = WRK051_TYPE_OF_WARRANTY;                30410000
                                                       /* SOC RB01299 */30420000
  /* WHEN CONTRACT OVERLAPS WITH WARRANTY, SDM DETAILS SHOULD BE      */30430000
  /* SHOULD BE FILLED BASED ON CONTRACT/240 SLC                       */30440000
  /*    WRK_PERIOD.SERV_DEL_M = TB_RCBV240.SERVICE_TYPE;              */30450000
                                                       /* EOC RB01299 */30460000
 /*     SWITCH_PIWARR_BAUCTR  = TRUE;                  /* SOC RB01298 */30470000
 /*     IF ((CURSOR_HW_PI.WARRANTY_SPLT_DATE <= WRK_RUN_DATE)         */30480000
 /*     &  (WRK051_F_TYPE_OF_WARRANTY ¬= '')) THEN                    */30490000
 /*        DO;                                                        */30500000
 /*          WRK_PERIOD.TPMNT = WRK051_F_TYPE_OF_WARRANTY;            */30510000
 /*        END;                                                       */30520000
                                                       /* EOC RB01298 */30530000
 /*   END;                                           /* EOC   RB01274 */30540000
 /*  ELSE                                                               30550000
 /*   DO;                                                             */30560000
                                                  /* EOC CEDS00000497 */30570000
                                                       /* SOC RB01308 */30580000
         /* IF INTERNAL OR LEASE RENTAL THEN */                         30590000
         /* T220 TOM AND BW_SLC WILL BE FILLED */                       30600000
                                                  /* SOC CEDS00000631 */30601000
    /*   IF SWITCH_INTERNAL | SWITCH_LEASE_RENTAL THEN */               30610000
         IF SWITCH_INTERNAL | SWITCH_LEASE_RENTAL |                     30611000
            SWITCH_INTERNAL_MACHINE_CTR  THEN                           30612000
                                                  /* EOC CEDS00000631 */30613000
          DO;                                                           30620000
           WRK_PERIOD.TPMNT  = CURSOR_INST_HW_V220.TYPE_OF_MAINT;       30630000
           IF WRK_PERIOD.EFFDATE <= WRK_RUN_DATE8  &                    30640000
              WRK_PERIOD.ENDDATE >= WRK_RUN_DATE8  THEN                 30650000
                                                 /* SOC CEDS00000648 */ 30651000
             DO;                                                        30652000
  /* BASE_WARRANTY_SLC  ASSIGNED BLANK WHEN                          */ 30652100
  /* SWITCH_INTERNAL_MACHINE_CTR  FLAG IS SET FOR TOM = 2            */ 30652200
              IF (SWITCH_INTERNAL_MACHINE_CTR &                         30654000
                 (WRK_PERIOD.TPMNT = '2')) THEN                         30655000
               TMP_BAU_BASE_WARRANTY_SLC = '';                          30656000
                                                 /* EOC CEDS00000648 */ 30657000
              FILE_RCBDRI1.BASE_WARRANTY_SLC =                          30660000
                                      TMP_BAU_BASE_WARRANTY_SLC;        30670000
             END;                                    /* CEDS00000648 */ 30671000
          END;                                                          30680000
                                                      /* EOC RB01308 */ 30690000
                                                 /* SOC CEDS00000623 */ 30691000
   /*    IF WRK_SERVICE_TYPE_IND >= 0            */                     30700000
   /*      THEN                                  */                     30710000
   /*      DO;                         /* IN CASE OF CHIS CONTRACT  */  30720000
                                                 /* EOC CEDS00000623 */ 30721000
             WRK_PERIOD.TPMNT     = CURSOR_INST_HW_V220.TYPE_OF_MAINT;  30730000
                                                     /* SOC RB01299 */  30740000
   /* IF THE SLC IN CONTRACT TABLE IS BLANK THEN ONLY IT SHOULD GET */  30750000
   /* SDM DETAILS BASED ON SERVICE TYPE FROM T645                       30760000
   /*        CALL R406_RETRIEVE_SRVICE_DLVRY_CONS;        /* RC01279 */ 30770000
                                                     /* EOC RB01299 */  30780000
  /*       END;                                  /* SOC CEDS00000623 */ 30790000
  /*       ELSE                                                      */ 30800000
       IF TB_RCBV240.SOURCE_INDICATOR = 'E'                             30801000
       THEN                                                             30802000
                                                 /* EOC CEDS00000623 */ 30803000
           DO;                         /* IN CASE OF EMACS CONTRACT */  30810000
             CALL R015_TRANS_ATO(TB_RCBV240.AGREEMENT_TYPE,             30820000
                                 TB_RCBV240.AGREEMENT_OPTION,           30830000
                                 WRK_PERIOD.TPMNT,                      30840000
                                 WRK_PERIOD.SERV_DEL_M,     /* RA01233*/30850000
                               TB_RCBV240.SOURCE_INDICATOR);/*PTM 1318*/30860000
           END;                                                         30870000
                                                      /* CEDS00000497 */30880000
   /*  END;                                            /* EOC RC01158 */30890000
   END;                                                    /* RB01274 */30900000
                                                                        30910000
 WRK_PERIOD.CAGRFOR     = TB_RCBV240.AGREEMENT_TYPE;                    30920000
 WRK_PERIOD.CAGROPT     = TB_RCBV240.AGREEMENT_OPTION;                  30930000
 WRK_PERIOD.CSLMRPQ     = TB_RCBV240.SPECIAL_OPTION;                    30940000
 WRK_PERIOD.IAGRIAH     = TB_RCBV240.AMENDM_COMB_CODE;                  30950000
                                                                        30960000
 WRK_PERIOD.IHSIESA(1)  = TB_RCBV240.SERVICE_MODULE_1;                  30970000
 WRK_PERIOD.IHSIESA(2)  = TB_RCBV240.SERVICE_MODULE_2;                  30980000
 WRK_PERIOD.IHSIESA(3)  = TB_RCBV240.SERVICE_MODULE_3;                  30990000
 WRK_PERIOD.IHSIESA(4)  = TB_RCBV240.SERVICE_MODULE_4;                  31000000
 WRK_PERIOD.IHSIESA(5)  = TB_RCBV240.SERVICE_MODULE_5;                  31010000
                                                                        31020000
 /* PTM478  USE SOURCE INDICATOR FROM TABLE T0240 INSTEAD OF T030 */    31030000
                                                                        31040000
 WRK_PERIOD.SSRCIND     = TB_RCBV240.SOURCE_INDICATOR;                  31050000
                                                                        31060000
 WRK_PERIOD.IAGRTCN     = TB_RCBV030.TYPE_OF_CONTRACT;                  31070000
                                                                        31080000
 END R402_FILL_SERV_CTR_PERIOD;                                         31090000
                                                                        31100000
1/*********************************************************************/31110000
 /*                                                       SOC RB01308 */31120000
 /* THIS PROC IS COMMENTED OUT AS PART OF RB01308 AND THE LOGIC IS    */31130000
 /* HANDLED IN R730_APPLY_PRIORITY                                    */31140000
 /*                                                    SOC : RB01274  */31150000
 /* MODULE NAME      :  R403_READ_RCBT0051                            */31160000
 /*                                                                   */31170000
 /* DESCRIPTION      :  READ THE EXACT REFERENCED ROW FROM RCBT0051   */31180000
 /*                                                                   */31190000
 /*********************************************************************/31200000
 /*R403_READ_RCBT0051: PROC;                                            31210000
                                                                        31220000
 /*WRK051_TYPE_OF_WARRANTY = '';                                        31230000
 /*WRK051_F_TYPE_OF_WARRANTY = '';                      /* RB01281    */31240000
                                                                        31250000
 /*EXEC SQL                                                             31260000
 /*   SELECT TYPE_OF_WARRANTY                         /* SOC RB01298 */ 31270000
 /*   INTO   :WRK051_TYPE_OF_WARRANTY   :WRK_INDNULL                    31280000
 /*         ,:WRK051_F_TYPE_OF_WARRANTY :WRK_INDNULL   /* RB01281    */ 31290000
 /*   SELECT TYPE_OF_WARRANTY,F_TYPE_OF_WARRANTY                        31300000
 /*   INTO   :WRK051_TYPE_OF_WARRANTY   :WRK_TOW_V051_IND               31310000
 /*         ,:WRK051_F_TYPE_OF_WARRANTY :WRK_FTOW_V051_IND              31320000
 /*                                                   /* EOC RB01298 */ 31330000
 /*   FROM   RCBV0051_PI_HW_PR                                          31340000
 /*   WHERE  COUNTRY_NUMBER  = :WRK_CTRYNO                              31350000
                                                 /* SOC CEDS00000497 */ 31360000
   /*   AND  PRODUCT_TYPE    = :CURSOR_INST_HW_V190.PRODUCT_TYPE     */ 31370000
   /*   AND  ORIGIN          = :CURSOR_INST_HW_V190.ORIGIN           */ 31380000
   /*   AND  SEQUENCE_NUMBER = :CURSOR_INST_HW_V190.SEQUENCE_NUMBER  */ 31390000
 /*     AND  PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE              31400000
 /*     AND  ORIGIN          = :SK_CURRENT_HW.ORIGIN                    31410000
 /*     AND  SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER           31420000
                                                 /* EOC CEDS00000497 */ 31430000
                                                       /*CEDS00000320*/ 31440000
   /*   AND  CUSTOMER_NUMBER = :CURSOR_INST_HW_V190.CUSTOMER_NUMBER */  31450000
 /*     AND  INSTALL_DATE <= :WRK_RUN_DATE                              31460000
 /*     AND  WARRANTY_EXP_DATE >= :WRK_RUN_DATE                         31470000
 /*                                                    /*CEDS00000320*/ 31480000
 /*    ;                                                                31490000
 /*SELECT (SQLCODE);                                                    31500000
 /*  WHEN (0)  ;                                                        31510000
 /*  WHEN (100);                                                        31520000
 /*  OTHERWISE                                                          31530000
 /*    DO;                                                              31540000
 /*      CALL RCBDRIM_ERROR (ADDR (SQLCA),                              31550000
 /*                        'DB2',                                       31560000
 /*                        '#039');                                     31570000
 /*  END;                                                               31580000
 /*END;                                                                 31590000
 /*END R403_READ_RCBT0051;                           /* EOC : RB01274 */31600000
                                                       /* EOC RB01308 */31610000
1/*********************************************************************/31620000
 /*                                                                   */31630000
 /* MODULE NAME      :  R404_PROCESS_FILLED_PERIOD                    */31640000
 /*                                                                   */31650000
 /* DESCRIPTION      :                                                */31660000
 /*                                                                   */31670000
 /*********************************************************************/31680000
 R404_PROCESS_FILLED_PERIOD: PROC;                                      31690000
                                                                        31700000
 SELECT;                                                                31710000
   WHEN (WRK_PERIOD.ENDDATE < WRK_RUN_DATE8)                            31720000
     DO;                                                                31730000
       WRK_CNT_HIST_PERIODS = WRK_CNT_HIST_PERIODS + 1;                 31740000
       IF WRK_CNT_HIST_PERIODS <= 2                                     31750000
         THEN                                                           31760000
           DO;                                                          31770000
             FILE_RCBDRI1.HF_SLOT(WRK_CNT_HIST_PERIODS) = WRK_PERIOD;   31780000
             BAU_FLAG(WRK_CNT_HIST_PERIODS) = WRK_BAU_FLAG;/* RB01308 */31790000
           END;                                                         31800000
         ELSE                                                           31810000
           DO;                                                          31820000
             FILE_RCBDRI1.HF_SLOT(1) =  FILE_RCBDRI1.HF_SLOT(2);        31830000
             FILE_RCBDRI1.HF_SLOT(2) = WRK_PERIOD;                      31840000
             BAU_FLAG(1) = BAU_FLAG(2);                    /* RB01308 */31850000
             BAU_FLAG(2) = WRK_BAU_FLAG;                   /* RB01308 */31860000
             WRK_CNT_HIST_PERIODS = 2;                                  31870000
           END;                                                         31880000
     END;                                                               31890000
   WHEN (WRK_PERIOD.EFFDATE > WRK_RUN_DATE8)                            31900000
     DO;                                                                31910000
       WRK_CNT_FUT_PERIODS = WRK_CNT_FUT_PERIODS + 1;                   31920000
       IF WRK_CNT_FUT_PERIODS <= 2                                      31930000
         THEN                                                           31940000
           DO;                                                          31950000
             FILE_RCBDRI1.HF_SLOT(2 + WRK_CNT_FUT_PERIODS) = WRK_PERIOD;31960000
             BAU_FLAG(2+WRK_CNT_FUT_PERIODS) = WRK_BAU_FLAG;/* RB01308*/31970000
           END;                                                         31980000
         ELSE                                                           31990000
           DO;                                                          32000000
             WRK_CNT_FUT_PERIODS = 2;                                   32010000
           END;                                                         32020000
     END;                                                               32030000
   OTHERWISE                                                            32040000
     DO;                                                                32050000
       BAU_FLAG(5) = WRK_BAU_FLAG; /*5 INDICATES CURRENT SLOT RB01308 */32060000
       FILE_RCBDRI1.SRCC0MD = WRK_PERIOD;                               32070000
       FILE_RCBDRI1.QCUOHVP = WRK_PERIOD_HVP_QUANTITY;                  32080000
     END;                                                               32090000
 END;                                                                   32100000
                                                                        32110000
                                                       /* SOC RB01308 */32120000
               /* ONLY CONTRACT FLAG MAY CHANGE BASED ON T240 CONTRACT*/32130000
               /* PERIOD & T220 WARRANTY PERIOD OVERLAP. IT WILL BE   */32140000
               /* AGAIN SET IN CHECK_GAP PROC IF THERE IS A CONTRACT  */32150000
               /* OVERLAP                                             */32160000
 WRK_BAU_FLAG.SW_BAU_CTR = FALSE;                      /* EOC RB01308 */32170000
 END R404_PROCESS_FILLED_PERIOD;                                        32180000
                                                                        32190000
1/*********************************************************************/32200000
 /*                                                                   */32210000
 /* MODULE NAME      :  R405_FILL_SUPPL_CTR_PERIOD                    */32220000
 /*                                                                   */32230000
 /* DESCRIPTION      :                                                */32240000
 /*                                                                   */32250000
 /*********************************************************************/32260000
                                                      /* SOC PTM0988 */ 32270000
 R405_FILL_SUPPL_CTR_PERIOD: PROC (PARM_EFF_DATE                        32280000
                                  ,PARM_END_DATE);                      32290000
                                                                        32300000
 DCL PARM_EFF_DATE CHAR (10);                                           32310000
 DCL PARM_END_DATE CHAR (10);                                           32320000
                                                                        32330000
                                                                        32340000
 WRK_PERIOD.EFFDATE    = R013_TRANS_DATE(PARM_EFF_DATE);                32350000
 WRK_PERIOD.ENDDATE    = R013_TRANS_DATE(PARM_END_DATE);                32360000
 WRK_PERIOD.SSRCIND     = ' ';           /* INDICATES SOF SOURCE */     32370000
                                                      /* EOC PTM0988 */ 32380000
                                                                        32390000
 SELECT;                                                                32400000
   WHEN (CURSOR_INST_HW_V220.TYPE_OF_MAINT ¬= '')                       32410000
     DO;                                                                32420000
        WRK_PERIOD.TPMNT = CURSOR_INST_HW_V220.TYPE_OF_MAINT;           32430000
     END;                                                               32440000
   WHEN (CURSOR_INST_HW_V220.TYPE_OF_WARRANTY ¬= '')                    32450000
     DO;                                                   /* RC01116 */32460000
       WRK_PERIOD.TPMNT = CURSOR_INST_HW_V220.TYPE_OF_WARRANTY;         32470000
     END;                                                               32480000
 END;                                                                   32490000
                                                                        32500000
 /* PER CALL OR WARRANTY PERIOD, THEN TAKE_CEDS OFF */                  32510000
 IF VERIFY (CURSOR_INST_HW_V220.TYPE_OF_MAINT, TPMNT_ST3) = 0 |         32520000
         CURSOR_INST_HW_V220.TYPE_OF_WARRANTY ¬= ' '                    32530000
 THEN                                                                   32540000
   WRK_PERIOD.TAKE_CEDS = 'N';                                          32550000
 ELSE                                                                   32560000
   WRK_PERIOD.TAKE_CEDS =  'Y';                                         32570000
                                                                        32580000
 IF WRK_T220_SLC_IND ¬= -1                             /* SOC RC01194 */32590000
 THEN DO;                                                               32600000
   WRK_SET_HRS = 'Y';                                                   32610000
   CALL R016_FILL_COVERAGE_HOURS(CURSOR_INST_HW_V220.SERVICE_LVL_CODE,  32620000
                                 WRK_SET_HRS);                          32630000
   END;                                                /* EOC RC01194 */32640000
 ELSE                                                                   32650000
   WRK_PERIOD.PRES_VALID = 'N';                                         32660000
                                                       /* SOC RB01298 */32670000
 /* IF THE MACHINE IS EFFECTIVE UNDER HB PERIOD THEN SLC2 FROM T220 IS*/32680000
 /* POPULATED AND CONTRACT NUMBER IS POPULATED AS 'HARDBUNDLE'        */32690000
                                                                        32700000
 IF (CURSOR_INST_HW_V220.TYPE_OF_WARRANTY = WRK_HB_TOM)                 32710000
 THEN DO;                                                               32720000
  WRK_SET_HRS = 'Y';                                                    32730000
  CALL R016_FILL_COVERAGE_HOURS(CURSOR_INST_HW_V220.SERVICE_LVL_CODE_2, 32740000
                                 WRK_SET_HRS);                          32750000
  WRK_PERIOD.IAGRNBR = 'HARDBUNDLE';                                    32760000
   END;                                                                 32770000
 /*ELSE                                           /* SOC CEDS00000491 */32780000
 /*WRK_PERIOD.PRES_VALID = 'N';*/                      /* EOC RB01298 */32790000
                                                  /* EOC CEDS00000491 */32800000
 END R405_FILL_SUPPL_CTR_PERIOD;                                        32810000
                                                                        32820000
1/*********************************************************************/32830000
 /*                                                       SOC RC01279 */32840000
 /* MODULE NAME      :  R406_RETRIEVE_SRVICE_DLVRY_CONS               */32850000
 /*                                                                   */32860000
 /* DESCRIPTION      :  QUERY 645 TABLE FOR CONSOLIDATED SERVICE TYPE */32870000
 /*                     IF IT IS PRESENT, SERVICE DELIVERY FILED WILL */32880000
 /*                     CONTAIN CORRESPONDING SDM FROM 645 TABLE ELSE */32890000
 /*                     IT WILL CONTAIN SERVICE TYPE FROM 240 TABLE   */32900000
 /*********************************************************************/32910000
                                                                        32920000
  R406_RETRIEVE_SRVICE_DLVRY_CONS: PROC;                                32930000
                                                                        32940000
  TB_RCBV645                  = '';                                     32950000
  TB_RCBV645_I.INDNULL(*)     = 0;                                      32960000
  TB_RCBV645.SERVICE_TYPE     = TB_RCBV240.SERVICE_TYPE;                32970000
                                                                        32980000
  EXEC SQL                                                              32990000
    SELECT * INTO : TB_RCBV645 :TB_RCBV645_I.INDNULL                    33000000
    FROM RCBT0645_CTRY_SVT                                              33010000
    WHERE     SERVICE_TYPE    =  :TB_RCBV645.SERVICE_TYPE               33020000
    AND       COUNTRY_NUMBER  =  :WRK_CTRYNO                            33030000
    AND       CONSOLIDATE_IND =  'Y' ;                                  33040000
                                                                        33050000
  SELECT (SQLCA.SQLCODE);                                               33060000
  WHEN (0)                                                              33070000
  DO;                                                                   33080000
    WRK_PERIOD.SERV_DEL_M  = TB_RCBV645.SERVICE_DLVR_METHD;             33090000
  END;                                                                  33100000
  WHEN (100)                                                            33110000
  DO;                                                                   33120000
    WRK_PERIOD.SERV_DEL_M = TB_RCBV240.SERVICE_TYPE;                    33130000
  END;                                                                  33140000
  OTHERWISE                                                             33150000
  DO;                                                                   33160000
    CALL RCBDRIM_ERROR (ADDR (SQLCA),'DB2','#040');                     33170000
  END;                                                                  33180000
  END;                                                                  33190000
  END R406_RETRIEVE_SRVICE_DLVRY_CONS;                 /* EOC RC01279 */33200000
1/*********************************************************************/33210000
 /*                                                                   */33220000
 /* MODULE NAME      :  R409_FETCH_CURSOR_SERV_CTR                    */33230000
 /*                                                                   */33240000
 /* DESCRIPTION      :                                                */33250000
 /*                                                                   */33260000
 /*********************************************************************/33270000
 R409_FETCH_CURSOR_SERV_CTR: PROC;                                      33280000
                                                                        33290000
 TB_RCBV240 = '';                                                       33320000
 TB_RCBV030 = '';                                                       33330000
 WRK_SERVICE_TYPE_IND = 0;                                              33340000
 WRK_CONTNO_V240_IND  = 0;                                 /* RB01290 */33350000
                                                                        33360000
 EXEC SQL                                                               33370000
   FETCH CURSOR_SERV_CTR                                                33380000
    INTO :TB_RCBV240.CONTRACT_NUMBER    :WRK_CONTNO_V240_IND /*RB01290*/33390000
 /* INTO :TB_RCBV240.CONTRACT_NUMBER    :WRK_INDNULL         /*RB01290*/33400000
        ,:TB_RCBV240.SUPPL_CTR_NUMBER   :WRK_INDNULL                    33410000
        ,:TB_RCBV240.SERVICE_MODULE_1   :WRK_INDNULL                    33420000
        ,:TB_RCBV240.SERVICE_MODULE_2   :WRK_INDNULL                    33430000
        ,:TB_RCBV240.SERVICE_MODULE_3   :WRK_INDNULL                    33440000
        ,:TB_RCBV240.SERVICE_MODULE_4   :WRK_INDNULL                    33450000
        ,:TB_RCBV240.SERVICE_MODULE_5   :WRK_INDNULL                    33460000
        ,:TB_RCBV240.AGREEMENT_TYPE     :WRK_INDNULL                    33470000
        ,:TB_RCBV240.AGREEMENT_OPTION   :WRK_INDNULL                    33480000
        ,:TB_RCBV240.SPECIAL_OPTION     :WRK_INDNULL                    33490000
        ,:TB_RCBV240.AMENDM_COMB_CODE   :WRK_INDNULL                    33500000
                                                      /* SOC RC01194 */ 33510000
        ,:TB_RCBV240.COVERAGE_START_1   :WRK_COVERAGE_START_1_IND       33520000
        ,:TB_RCBV240.COVERAGE_START_2   :WRK_COVERAGE_START_2_IND       33530000
        ,:TB_RCBV240.COVERAGE_START_3   :WRK_COVERAGE_START_3_IND       33540000
        ,:TB_RCBV240.COVERAGE_START_4   :WRK_COVERAGE_START_4_IND       33550000
        ,:TB_RCBV240.COVERAGE_START_5   :WRK_COVERAGE_START_5_IND       33560000
        ,:TB_RCBV240.COVERAGE_START_6   :WRK_COVERAGE_START_6_IND       33570000
        ,:TB_RCBV240.COVERAGE_START_7   :WRK_COVERAGE_START_7_IND       33580000
        ,:TB_RCBV240.COVERAGE_END_1     :WRK_COVERAGE_END_1_IND         33590000
        ,:TB_RCBV240.COVERAGE_END_2     :WRK_COVERAGE_END_2_IND         33600000
        ,:TB_RCBV240.COVERAGE_END_3     :WRK_COVERAGE_END_3_IND         33610000
        ,:TB_RCBV240.COVERAGE_END_4     :WRK_COVERAGE_END_4_IND         33620000
        ,:TB_RCBV240.COVERAGE_END_5     :WRK_COVERAGE_END_5_IND         33630000
        ,:TB_RCBV240.COVERAGE_END_6     :WRK_COVERAGE_END_6_IND         33640000
        ,:TB_RCBV240.COVERAGE_END_7     :WRK_COVERAGE_END_7_IND         33650000
                                                      /* EOC RC01194 */ 33660000
        ,:TB_RCBV240.SERVICE_TYPE       :WRK_SERVICE_TYPE_IND           33670000
        ,:TB_RCBV240.SERVICE_LVL_CODE   :WRK_T240_SLC_IND /* RC01194 */ 33680000
        ,:TB_RCBV240.HVP_QUANTITY       :WRK_INDNULL                    33690000
        ,:TB_RCBV240.SOURCE_INDICATOR   :WRK_INDNULL                    33700000
        ,:TB_RCBV240.EFFECTIVE_DATE     :WRK_INDNULL                    33710000
        ,:TB_RCBV240.END_DATE           :WRK_INDNULL                    33720000
     ;                                                                  33730000
                                                                        33740000
  SELECT (SQLCODE);                                                     33750000
   WHEN (0)                                                             33760000
     DO;                                                                33770000
       SWITCH_EOC_SERV_CTR = FALSE;                                     33780000
                                                      /* SOC RB01308 */ 33790000
       WRK_BAU_FLAG.SW_BAU_CTR = TRUE ;                                 33800000
                                                 /* SOC CEDS00000494 */ 33820000
  /*   IF (TB_RCBV240.EFFECTIVE_DATE <= WRK_RUN_DATE &                  33830000
         WRK_RUN_DATE <= TB_RCBV240.END_DATE)                           33840000
       THEN                                                             33850000
           CURRENT_BAU_CTR_FLAG =  TRUE; */      /* EOC CEDS00000494 */ 33860000
                                                      /* EOC RB01308 */ 33870000
                                                 /* SOC CEDS00000724 */ 33871100
 CURSOR_INST_HW_V220.TYPE_OF_MAINT  =  WRK220_TYPE_OF_MAINT;            33871200
                                                 /* EOC CEDS00000724 */ 33871300
                                                 /* SOC CEDS00000721 */ 33871400
       IF (SWITCH_INTERNAL_MACHINE_CTR = TRUE) &                        33872000
          (SW_MAINT_02 = TRUE) THEN                                     33873000
       DO;                                                              33874000
         IF ((TB_RCBV240.CONTRACT_NUMBER ¬= '') &                       33875000
             (WRK_CONTNO_V240_IND ¬= -1)) THEN                          33876000
         DO;                                                            33877000
           CALL R400_RETR_ADD_CONTR_INFO;                               33878000
           IF ((TB_RCBV030.TYPE_OF_CONTRACT ¬= '') &                    33879000
               (WRK_TOC_V30_IND ¬= -1)) THEN                            33879100
           DO;                                                          33879200
             CALL R615_FETCH_TOC_TOM_RCB070;                            33879300
           END;                                                         33879400
         END;                                                           33879500
       END;                                      /* EOC CEDS00000721 */ 33879600
     END;                                                               33880000
   WHEN (100)                                                           33890000
     DO;                                                                33900000
       SWITCH_EOC_SERV_CTR = TRUE;                                      33910000
     END;                                                               33920000
   OTHERWISE                                                            33930000
     DO;                                                                33940000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                33950000
                           'DB2',                                       33960000
                           '#041');                                     33970000
     END;                                                               33980000
 END;                                                                   33990000
                                                                        34000000
 END R409_FETCH_CURSOR_SERV_CTR;                                        34010000
1/*********************************************************************/34020000
 /*                                                       SOC PTM0988 */34030000
 /* MODULE NAME      :  R410_CHECK_GAP                                */34040000
 /*                                                                   */34050000
 /* DESCRIPTION      :                                                */34060000
 /*                                                                   */34070000
 /*********************************************************************/34080000
 R410_CHECK_GAP: PROC;                                                  34090000
 IF TB_RCBV240.EFFECTIVE_DATE <= HLP_EFF_DATE                           34100000
 THEN DO;                                                               34110000
   IF TB_RCBV240.END_DATE < SK_CURRENT_HW.END_DATE                      34120000
   THEN DO;                                                             34130000
                                                  /* SERVICE CONTRACT */34140000
     CALL R600_FILL_INST_PERIOD;                                        34150000
     CALL R400_RETR_ADD_CONTR_INFO;                                     34160000
     CALL R402_FILL_SERV_CTR_PERIOD(HLP_EFF_DATE                        34170000
                                   ,TB_RCBV240.END_DATE);               34180000
     WRK_BAU_FLAG.SW_BAU_CTR = TRUE;                      /* RB01308 */ 34190000
     CALL R404_PROCESS_FILLED_PERIOD;                                   34200000
                                                                        34210000
     HLP_EFF_DATE = R014_DATE_CALC(TB_RCBV240.END_DATE,+1);             34220000
                                                                        34230000
   END;                                                                 34240000
   ELSE DO;                                                             34250000
                                                  /* SERVICE CONTRACT */34260000
     CALL R600_FILL_INST_PERIOD;                                        34270000
     CALL R400_RETR_ADD_CONTR_INFO;                                     34280000
     CALL R402_FILL_SERV_CTR_PERIOD(HLP_EFF_DATE                        34290000
                                   ,SK_CURRENT_HW.END_DATE);            34300000
     WRK_BAU_FLAG.SW_BAU_CTR = TRUE;                      /* RB01308 */ 34310000
     CALL R404_PROCESS_FILLED_PERIOD;                                   34320000
                                                                        34330000
     HLP_EFF_DATE = R014_DATE_CALC(SK_CURRENT_HW.END_DATE,+1);          34340000
                                                                        34350000
   END;                                                                 34360000
 END;                                                                   34370000
 ELSE DO;                                                               34380000
   IF TB_RCBV240.END_DATE < SK_CURRENT_HW.END_DATE                      34390000
   THEN DO;                                                             34400000
                                                   /* SUPPLY CONTRACT */34410000
     CALL R600_FILL_INST_PERIOD;                                        34420000
                                                                        34430000
     CALL R405_FILL_SUPPL_CTR_PERIOD(HLP_EFF_DATE,                      34440000
                      R014_DATE_CALC(TB_RCBV240.EFFECTIVE_DATE,-1));    34450000
     WRK_BAU_FLAG.SW_BAU_CTR = FALSE;                     /* RB01308 */ 34460000
     CALL R404_PROCESS_FILLED_PERIOD;                                   34470000
                                                  /* SERVICE CONTRACT */34480000
     CALL R600_FILL_INST_PERIOD;                                        34490000
     CALL R400_RETR_ADD_CONTR_INFO;                                     34500000
     CALL R402_FILL_SERV_CTR_PERIOD(TB_RCBV240.EFFECTIVE_DATE           34510000
                                   ,TB_RCBV240.END_DATE);               34520000
     WRK_BAU_FLAG.SW_BAU_CTR = TRUE;                      /* RB01308 */ 34530000
     CALL R404_PROCESS_FILLED_PERIOD;                                   34540000
                                                                        34550000
     HLP_EFF_DATE = R014_DATE_CALC(TB_RCBV240.END_DATE,+1);             34560000
                                                                        34570000
   END;                                                                 34580000
   ELSE DO;                                                             34590000
                                                   /* SUPPLY CONTRACT */34600000
     CALL R600_FILL_INST_PERIOD;                                        34610000
     CALL R405_FILL_SUPPL_CTR_PERIOD(HLP_EFF_DATE,                      34620000
                      R014_DATE_CALC(TB_RCBV240.EFFECTIVE_DATE,-1));    34630000
     WRK_BAU_FLAG.SW_BAU_CTR = FALSE;                     /* RB01308 */ 34640000
     CALL R404_PROCESS_FILLED_PERIOD;                                   34650000
                                                  /* SERVICE CONTRACT */34660000
     CALL R600_FILL_INST_PERIOD;                                        34670000
     CALL R400_RETR_ADD_CONTR_INFO;                                     34680000
     CALL R402_FILL_SERV_CTR_PERIOD(TB_RCBV240.EFFECTIVE_DATE           34690000
                                   ,SK_CURRENT_HW.END_DATE);            34700000
     WRK_BAU_FLAG.SW_BAU_CTR = TRUE;                      /* RB01308 */ 34710000
     CALL R404_PROCESS_FILLED_PERIOD;                                   34720000
                                                                        34730000
     HLP_EFF_DATE = R014_DATE_CALC(SK_CURRENT_HW.END_DATE,+1);          34740000
                                                                        34750000
   END;                                                                 34760000
 END;                                                                   34770000
                                                                        34780000
 END R410_CHECK_GAP;                                   /* EOC PTM0988 */34790000
1/*********************************************************************/34800000
 /*                                                       SOC RC01158 */34810000
 /* MODULE NAME      :  R411_FILL_WARRANTY_PERIOD                     */34820000
 /*                                                                   */34830000
 /* DESCRIPTION      :                                                */34840000
 /*                                                                   */34850000
 /*********************************************************************/34860000
 R411_FILL_WARRANTY_PERIOD: PROC (PARM_EFF_DATE                         34870000
                                 ,PARM_END_DATE                         34880000
                                 ,SERVICE_LVL_CODE         /* RC01194 */34890000
                                 ,SERVICE_LVL_CODE_IND);   /* RC01194 */34900000
                                                                        34910000
 DCL PARM_EFF_DATE         CHAR      (10);                              34920000
 DCL PARM_END_DATE         CHAR      (10);                              34930000
 DCL SERVICE_LVL_CODE      CHAR      (03);                 /* RC01194 */34940000
 DCL SERVICE_LVL_CODE_IND  FIXED BIN (15);                 /* RC01194 */34950000
                                                                        34960000
 WRK_PERIOD = '';                                                       34970000
                                                                        34980000
 WRK_PERIOD.EFFDATE   = R013_TRANS_DATE(PARM_EFF_DATE);                 34990000
 WRK_PERIOD.ENDDATE   = R013_TRANS_DATE(PARM_END_DATE);                 35000000
 WRK_PERIOD.BUDIV     = '2';                                            35010000
 WRK_PERIOD.SSRCIND   = SAVED_HW_PI.SOURCE_INDICATOR;     /* RA01224 */ 35020000
 /*WRK_PERIOD.TPMNT     = SAVED_HW_PI.TYPE_OF_WARRANTY;*/               35030000
 IF SW_FW_PROCESS_W1 THEN                                 /* RB01281 */ 35040000
 DO;                                                                    35050000
  WRK_PERIOD.TPMNT     = SAVED_HW_PI.TYPE_OF_WARRANTY;                  35060000
  SW_FW_PROCESS_W1 = '0'B;                                              35070000
 END;                                                                   35080000
 ELSE                                                                   35090000
 DO;                                                                    35100000
                                                  /*SOC CEDS00000438 */ 35110000
 /* IF (CURSOR_HW_PI.F_TYPE_OF_WARRANTY ¬= '' &                         35120000
      CURSOR_HW_PI.TYPE_OF_WARRANTY   ¬=                                35130000
                       CURSOR_HW_PI.F_TYPE_OF_WARRANTY) &               35140000
      SW_FW_PROCESS_W2 THEN                                          */ 35150000
  IF (SAVED_HW_PI.F_TYPE_OF_WARRANTY ¬= '' &                            35160000
     SAVED_HW_PI.TYPE_OF_WARRANTY   ¬=                                  35170000
                      SAVED_HW_PI.F_TYPE_OF_WARRANTY) &                 35180000
      SW_FW_PROCESS_W2 THEN                       /*EOC CEDS00000438 */ 35190000
   DO;                                                                  35200000
    WRK_PERIOD.TPMNT     = SAVED_HW_PI.F_TYPE_OF_WARRANTY;              35210000
    SW_FW_PROCESS_W2 = '0'B;                                            35220000
                                                      /* SOC RB01298 */ 35230000
 /* IF A PI MACHINE IS EFFECTIVE UNDER HB PERIOD THEN CONTRACT NUMBER*/ 35240000
 /* IS POPULATED AS 'HARDBUNDLE'                                     */ 35250000
    IF (SAVED_HW_PI.F_TYPE_OF_WARRANTY = WRK_HB_TOM)                    35260000
    THEN                                                                35270000
      WRK_PERIOD.IAGRNBR = 'HARDBUNDLE';              /* EOC RB01298 */ 35280000
   END;                                                                 35290000
  ELSE                                                                  35300000
   DO;                                                                  35310000
 /*WRK_PERIOD.TPMNT     = SAVED_HW_PI.TYPE_OF_WARRANTY       RB01308 */ 35320000
   WRK_PERIOD.TPMNT     = SAVED_HW_PI.TYPE_OF_WARRANTY;   /* RB01308 */ 35330000
   END;                                                                 35340000
 END;                                                     /* RB01281 */ 35350000
 WRK_PERIOD.CUNOUSE   = SAVED_HW_PI.CUSTOMER_NUMBER;                    35360000
 WRK_PERIOD.BUCODE    = SAVED_HW_PI.OU_CODE;                            35370000
 WRK_PERIOD.TAKE_CEDS = 'N';                                            35380000
                                                                        35390000
 IF SERVICE_LVL_CODE_IND ¬= -1                         /* SOC RC01194 */35400000
 THEN DO;                                                               35410000
   WRK_SET_HRS = 'Y';                                                   35420000
   CALL R016_FILL_COVERAGE_HOURS(SERVICE_LVL_CODE, WRK_SET_HRS);        35430000
   END;                                                /* EOC RC01194 */35440000
 ELSE                                                                   35450000
   WRK_PERIOD.PRES_VALID = 'N';                                         35460000
                                                        /*SOC RC01295 */35470000
 /*CALL R750_CHECK_LENOVO (SAVED_HW_PI.INSTALL_DATE,   /* SOC RB01272 */35480000
 /*                       SAVED_HW_PI.WARRANTY_EXP_DATE,              */35490000
 CALL R750_CHECK_LENOVO (SAVED_HW_PI.WARRANTY_EXP_DATE, /*EOC RC01295 */35500000
                         '',                                            35510000
                         '',                                            35520000
                         '',                                            35530000
                         PARM_EFF_DATE,                /* EOC RB01272 */35540000
                         SAVED_HW_PI.WARRANTY_LIABILITY);  /* RB01283 */35550000
                                                                        35560000
 END R411_FILL_WARRANTY_PERIOD;                        /* EOC RC01158 */35570000
1/*********************************************************************/35580000
 /*                                                       SOC RC01158 */35590000
 /* MODULE NAME      :  R412_FILL_CTR_T241_PERIOD                     */35600000
 /*                                                                   */35610000
 /* DESCRIPTION      :                                                */35620000
 /*                                                                   */35630000
 /*********************************************************************/35640000
 R412_FILL_CTR_T241_PERIOD: PROC (PARM_EFF_DATE,                        35650000
                                  PARM_END_DATE,                        35660000
                                  CI);                    /* RB01236  */35670000
                                                                        35680000
 DCL PARM_EFF_DATE CHAR (10);                                           35690000
 DCL PARM_END_DATE CHAR (10);                                           35700000
 DCL CI            FIXED BIN(15);     /* SAVED T0241 INDEX - RB01236 */ 35710000
                                                                        35720000
 WRK_PERIOD = '';                                                       35730000
                                                                        35740000
 WRK_PERIOD.EFFDATE   = R013_TRANS_DATE(PARM_EFF_DATE);                 35750000
 WRK_PERIOD.ENDDATE   = R013_TRANS_DATE(PARM_END_DATE);                 35760000
 WRK_PERIOD.BUDIV     = '2';                                            35770000
 WRK_PERIOD.SSRCIND   = SAVED_CTR_PI(CI).SOURCE_INDICATOR; /* PTM1408 */35780000
 IF SWITCH_VENDOR_SERVICE THEN                       /* SOC : RB01278 */35790000
   DO;                                                                  35800000
                                                       /* SOC RB01308 */35810000
  /* CALL R755_READ_REV_DIV;                                          */35820000
  /* IF (SAVED_HW_PI.INSTALL_DATE  >= WRK_LENOVO_DATE                 */35830000
  /*    | SUBSTR (SAVED_HW_PI.ORIGIN, 1, 1) = 'L')                    */35840000
  /*    & TB_RCBV400.PROD_REVENUE_DIV = '44'                          */35850000
  /*    & SUBSTR(SAVED_CTR_PI(CI).AUTHORISATION_CODE,1,3) = 'LEN' THEN*/35860000
     IF SUBSTR(SAVED_CTR_PI(CI).AUTHORISATION_CODE,1,3) = 'LEN' THEN    35870000
                                                       /* EOC RB01308 */35880000
                                                     /* CEDS00000321 */ 35890000
       DO;                                                              35900000
   /*    WRK_PERIOD.TPMNT     = 'G'; */                   /* RC01362 */ 35910017
         SAVED_HW_PI.WARRANTY_LIABILITY = 'LEN';          /* RB01283 */ 35920000
       END;                                                             35930000
     ELSE                                                               35940000
         WRK_PERIOD.TPMNT     = '2';                                    35950000
   END;                                                                 35960000
 ELSE                                                /* EOC : RB01278 */35970000
   WRK_PERIOD.TPMNT     = '2';                                          35980000
                                                                        35990000
 WRK_PERIOD.IAGRNBR   = SAVED_CTR_PI(CI).CONTRACT_NUMBER;               36000000
 WRK_PERIOD.TAKE_CEDS = 'Y';                                            36010000
 IF SAV_SDF_IND ¬= -1                                                   36020000
 THEN                                                                   36030000
   WRK_PERIOD.SDF = SAVED_HW_PI.SERVICE_DELIV_FLAG;                     36040000
                                                      /* SOC RB01236*/  36050000
 IF (SAVED_CTR_PI(CI).COVERAGE_START_1 = '00.00.00'                     36060000
   & SAVED_CTR_PI(CI).COVERAGE_START_2 = '00.00.00'                     36070000
   & SAVED_CTR_PI(CI).COVERAGE_START_3 = '00.00.00'                     36080000
   & SAVED_CTR_PI(CI).COVERAGE_START_4 = '00.00.00'                     36090000
   & SAVED_CTR_PI(CI).COVERAGE_START_5 = '00.00.00'                     36100000
   & SAVED_CTR_PI(CI).COVERAGE_START_6 = '00.00.00'                     36110000
   & SAVED_CTR_PI(CI).COVERAGE_START_7 = '00.00.00'                     36120000
   & SAVED_CTR_PI(CI).COVERAGE_END_1 = '00.00.00'                       36130000
   & SAVED_CTR_PI(CI).COVERAGE_END_2 = '00.00.00'                       36140000
   & SAVED_CTR_PI(CI).COVERAGE_END_3 = '00.00.00'                       36150000
   & SAVED_CTR_PI(CI).COVERAGE_END_4 = '00.00.00'                       36160000
   & SAVED_CTR_PI(CI).COVERAGE_END_5 = '00.00.00'                       36170000
   & SAVED_CTR_PI(CI).COVERAGE_END_6 = '00.00.00'                       36180000
   & SAVED_CTR_PI(CI).COVERAGE_END_7 = '00.00.00')                      36190000
                                                      /* EOC RB01236*/  36200000
 THEN                                                                   36210000
   WRK_SET_HRS = 'Y';                                                   36220000
 ELSE                                                                   36230000
   WRK_SET_HRS = 'N';                                                   36240000
                                                                        36250000
 IF SAVED_CTR_PI(CI).SERVICE_LVL_CODE ¬= LOW(3)       /* SOC RC01194 */ 36260000
 THEN DO;                                                               36270000
   CALL R016_FILL_COVERAGE_HOURS (SAVED_CTR_PI(CI).SERVICE_LVL_CODE,    36280000
                                  WRK_SET_HRS);                         36290000
 END;                                               /* EOC RC01194 */   36300000
 ELSE                                                   /* PTM1408 */   36310000
   WRK_PERIOD.PRES_VALID = 'N';                         /* PTM1401 */   36320000
                                                                        36330000
 IF WRK_SET_HRS = 'N'                                                   36340000
 THEN DO;                            /* SET FROM T241, NOT FROM T470 */ 36350000
                                                      /* SOC RB01236*/  36360000
   WRK_PERIOD.DAGRMFR(1)=                                               36370000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_1);              36380000
   WRK_PERIOD.DAGRMFR(2)=                                               36390000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_2);              36400000
   WRK_PERIOD.DAGRMFR(3)=                                               36410000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_3);              36420000
   WRK_PERIOD.DAGRMFR(4)=                                               36430000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_4);              36440000
   WRK_PERIOD.DAGRMFR(5)=                                               36450000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_5);              36460000
   WRK_PERIOD.DAGRMFR(6)=                                               36470000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_6);              36480000
   WRK_PERIOD.DAGRMFR(7)=                                               36490000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_7);              36500000
   WRK_PERIOD.DAGRMTO(1)=                                               36510000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_1);                36520000
   WRK_PERIOD.DAGRMTO(2)=                                               36530000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_2);                36540000
   WRK_PERIOD.DAGRMTO(3)=                                               36550000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_3);                36560000
   WRK_PERIOD.DAGRMTO(4)=                                               36570000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_4);                36580000
   WRK_PERIOD.DAGRMTO(5)=                                               36590000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_5);                36600000
   WRK_PERIOD.DAGRMTO(6)=                                               36610000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_6);                36620000
   WRK_PERIOD.DAGRMTO(7)=                                               36630000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_7);                36640000
 END;                                                                   36650000
                                                                        36660000
 WRK_PERIOD.IHSIESA(1)= SAVED_CTR_PI(CI).SERVICE_MODULE_1;              36670000
 WRK_PERIOD.IHSIESA(2)= SAVED_CTR_PI(CI).SERVICE_MODULE_2;              36680000
 WRK_PERIOD.IHSIESA(3)= SAVED_CTR_PI(CI).SERVICE_MODULE_3;              36690000
 WRK_PERIOD.IHSIESA(4)= SAVED_CTR_PI(CI).SERVICE_MODULE_4;              36700000
 WRK_PERIOD.IHSIESA(5)= SAVED_CTR_PI(CI).SERVICE_MODULE_5;              36710000
 IF WRK_PERIOD.SERV_DEL_M = '' THEN                        /* RB01299 */36720000
    WRK_PERIOD.SERV_DEL_M = SAVED_CTR_PI(CI).SERVICE_TYPE; /* RA01233 */36730000
                                                       /* EOC RB01236 */36740000
                                                        /*SOC RC01295 */36750000
 /*CALL R750_CHECK_LENOVO (SAVED_HW_PI.INSTALL_DATE,  /* SOC RB01272  */36760000
 /*                        SAVED_HW_PI.WARRANTY_EXP_DATE,             */36770000
 CALL R750_CHECK_LENOVO (SAVED_HW_PI.WARRANTY_EXP_DATE, /*EOC RC01295 */36780000
                         SAVED_CTR_PI(CI).AUTHORISATION_CODE,           36790000
                         PARM_EFF_DATE,                                 36800000
                         PARM_END_DATE,                                 36810000
                         PARM_EFF_DATE,                /* EOC RB01272 */36820000
                         SAVED_HW_PI.WARRANTY_LIABILITY);  /* RB01283 */36830000
                                                                        36840000
 END R412_FILL_CTR_T241_PERIOD;                        /* EOC RC01158 */36850000
1/*********************************************************************/36860000
 /*                                                       SOC RC01158 */36870000
 /* MODULE NAME      :  R413_FILL_CTR_BOTH_PERIOD                     */36880000
 /*                                                                   */36890000
 /* DESCRIPTION      :                                                */36900000
 /*                                                                   */36910000
 /*********************************************************************/36920000
 R413_FILL_CTR_BOTH_PERIOD: PROC (PARM_EFF_DATE,                        36930000
                                  PARM_END_DATE,                        36940000
                                  CI);                    /* RB01236  */36950000
                                                                        36960000
 DCL PARM_EFF_DATE CHAR (10);                                           36970000
 DCL PARM_END_DATE CHAR (10);                                           36980000
 DCL CI            FIXED BIN(15);     /* SAVED T0241 INDEX - RB01236 */ 36990000
                                                                        37000000
 WRK_PERIOD = '';                                                       37010000
                                                                        37020000
 WRK_PERIOD.EFFDATE   = R013_TRANS_DATE(PARM_EFF_DATE);                 37030000
 WRK_PERIOD.ENDDATE   = R013_TRANS_DATE(PARM_END_DATE);                 37040000
 WRK_PERIOD.BUDIV     = '2';                                            37050000
 WRK_PERIOD.SSRCIND   = SAVED_CTR_PI(CI).SOURCE_INDICATOR; /* PTM1408 */37060000
                                                                        37070000
 IF SAV_SDF_IND ¬= -1                                                   37080000
 THEN                                                                   37090000
   WRK_PERIOD.SDF = SAVED_HW_PI.SERVICE_DELIV_FLAG;                     37100000
                                                          /* PTM1313 */ 37110000
                                                      /* SOC RB01308 */ 37120000
 /*IF (SAVED_HW_PI.TYPE_OF_MAINT ¬= '')  &          */                  37130000
 /*   (SAVED_HW_PI.TYPE_OF_MAINT ¬= '3')            */                  37140000
 /*THEN                                             */                  37150000
 /*  WRK_PERIOD.TPMNT   = SAVED_HW_PI.TYPE_OF_MAINT;*/                  37160000
 /*ELSE                                             */                  37170000
 /*  WRK_PERIOD.TPMNT   = '2';                      */                  37180000
                                                      /* SOC RC01362 */ 37190017
 /* IF SWITCH_VENDOR_SERVICE THEN                                       37200014
   DO;                                                                  37210000
                                                 /* SOC CEDS00000754 */ 37211012
 /*  IF SAVED_HW_PI.WARRANTY_LIABILITY                  = 'LEN' & */    37220010
 /*     SUBSTR(SAVED_CTR_PI(CI).AUTHORISATION_CODE,1,3) = 'LEN' THEN */ 37230010
 /*  IF SUBSTR(SAVED_CTR_PI(CI).AUTHORISATION_CODE,1,3) = 'LEN' THEN    37231014
                                                 /* EOC CEDS00000754 */ 37232012
 /*    DO;                                                              37240014
         WRK_PERIOD.TPMNT     = 'G';                                    37250000
       END;                                                             37260000
     ELSE                                                               37270000
         WRK_PERIOD.TPMNT     = '2';                                    37280000
   END;                                                                 37290000
 ELSE */                                              /* EOC RC01362 */ 37300017
   WRK_PERIOD.TPMNT     = '2';                                          37310000
                                                      /* EOC RB01308 */ 37320000
 WRK_PERIOD.CUNOUSE   = SAVED_HW_PI.CUSTOMER_NUMBER;                    37330000
 WRK_PERIOD.BUCODE    = SAVED_HW_PI.OU_CODE;                            37340000
 WRK_PERIOD.IAGRNBR   = SAVED_CTR_PI(CI).CONTRACT_NUMBER;               37350000
 WRK_PERIOD.TAKE_CEDS = 'Y';                                            37360000
                                                      /* SOC RB01236*/  37370000
 IF (SAVED_CTR_PI(CI).COVERAGE_START_1 = '00.00.00'                     37380000
   & SAVED_CTR_PI(CI).COVERAGE_START_2 = '00.00.00'                     37390000
   & SAVED_CTR_PI(CI).COVERAGE_START_3 = '00.00.00'                     37400000
   & SAVED_CTR_PI(CI).COVERAGE_START_4 = '00.00.00'                     37410000
   & SAVED_CTR_PI(CI).COVERAGE_START_5 = '00.00.00'                     37420000
   & SAVED_CTR_PI(CI).COVERAGE_START_6 = '00.00.00'                     37430000
   & SAVED_CTR_PI(CI).COVERAGE_START_7 = '00.00.00'                     37440000
   & SAVED_CTR_PI(CI).COVERAGE_END_1 = '00.00.00'                       37450000
   & SAVED_CTR_PI(CI).COVERAGE_END_2 = '00.00.00'                       37460000
   & SAVED_CTR_PI(CI).COVERAGE_END_3 = '00.00.00'                       37470000
   & SAVED_CTR_PI(CI).COVERAGE_END_4 = '00.00.00'                       37480000
   & SAVED_CTR_PI(CI).COVERAGE_END_5 = '00.00.00'                       37490000
   & SAVED_CTR_PI(CI).COVERAGE_END_6 = '00.00.00'                       37500000
   & SAVED_CTR_PI(CI).COVERAGE_END_7 = '00.00.00')                      37510000
                                                      /* EOC RB01236*/  37520000
 THEN                                                                   37530000
   WRK_SET_HRS = 'Y';                                                   37540000
 ELSE                                                                   37550000
   WRK_SET_HRS = 'N';                                                   37560000
                                                                        37570000
 IF SAVED_CTR_PI(CI).SERVICE_LVL_CODE ¬= LOW(3)       /* SOC RC01194 */ 37580000
 THEN DO;                                                               37590000
   CALL R016_FILL_COVERAGE_HOURS (SAVED_CTR_PI(CI).SERVICE_LVL_CODE,    37600000
                                  WRK_SET_HRS);                         37610000
 END;                                                 /* EOC RC01194 */ 37620000
 ELSE DO;                                                               37630000
   IF SAVED_CTR_PI(CI).SOURCE_INDICATOR = 'P' THEN        /* PTM1408 */ 37640000
     CALL R016C_FILL_PEW_SDF_DETAIL;                                    37650000
   ELSE                                                                 37660000
     WRK_PERIOD.PRES_VALID = 'N';                                       37670000
 END;                                                                   37680000
                                                                        37690000
 IF WRK_SET_HRS ='N'     /* SET FROM T241, NOT FROM T470 */             37700000
 THEN DO;                                                               37710000
                                                       /* SOC RB01236 */37720000
   WRK_PERIOD.DAGRMFR(1)=                                               37730000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_1);              37740000
   WRK_PERIOD.DAGRMFR(2)=                                               37750000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_2);              37760000
   WRK_PERIOD.DAGRMFR(3)=                                               37770000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_3);              37780000
   WRK_PERIOD.DAGRMFR(4)=                                               37790000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_4);              37800000
   WRK_PERIOD.DAGRMFR(5)=                                               37810000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_5);              37820000
   WRK_PERIOD.DAGRMFR(6)=                                               37830000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_6);              37840000
   WRK_PERIOD.DAGRMFR(7)=                                               37850000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_7);              37860000
   WRK_PERIOD.DAGRMTO(1)=                                               37870000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_1);                37880000
   WRK_PERIOD.DAGRMTO(2)=                                               37890000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_2);                37900000
   WRK_PERIOD.DAGRMTO(3)=                                               37910000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_3);                37920000
   WRK_PERIOD.DAGRMTO(4)=                                               37930000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_4);                37940000
   WRK_PERIOD.DAGRMTO(5)=                                               37950000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_5);                37960000
   WRK_PERIOD.DAGRMTO(6)=                                               37970000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_6);                37980000
   WRK_PERIOD.DAGRMTO(7)=                                               37990000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_7);                38000000
 END;                                                                   38010000
                                                                        38020000
 WRK_PERIOD.IHSIESA(1)= SAVED_CTR_PI(CI).SERVICE_MODULE_1;              38030000
 WRK_PERIOD.IHSIESA(2)= SAVED_CTR_PI(CI).SERVICE_MODULE_2;              38040000
 WRK_PERIOD.IHSIESA(3)= SAVED_CTR_PI(CI).SERVICE_MODULE_3;              38050000
 WRK_PERIOD.IHSIESA(4)= SAVED_CTR_PI(CI).SERVICE_MODULE_4;              38060000
 WRK_PERIOD.IHSIESA(5)= SAVED_CTR_PI(CI).SERVICE_MODULE_5;              38070000
 IF WRK_PERIOD.SERV_DEL_M = '' THEN                        /* RB01299 */38080000
    WRK_PERIOD.SERV_DEL_M = SAVED_CTR_PI(CI).SERVICE_TYPE; /* RA01233 */38090000
                                                       /* EOC RB01236 */38100000
                                                        /*SOC RC01295 */38110000
 /*CALL R750_CHECK_LENOVO (SAVED_HW_PI.INSTALL_DATE,   /* SOC RB01272 */38120000
 /*                      SAVED_HW_PI.WARRANTY_EXP_DATE,               */38130000
 CALL R750_CHECK_LENOVO (SAVED_HW_PI.WARRANTY_EXP_DATE, /*EOC RC01295 */38140000
                         SAVED_CTR_PI(CI).AUTHORISATION_CODE,           38150000
                         PARM_EFF_DATE,                                 38160000
                         PARM_END_DATE,                                 38170000
                         PARM_EFF_DATE,                /* EOC RB01272 */38180000
                         SAVED_HW_PI.WARRANTY_LIABILITY);  /* RB01283 */38190000
                                                                        38200000
 END R413_FILL_CTR_BOTH_PERIOD;                        /* EOC RC01158 */38210000
1/*********************************************************************/38220000
 /*                                                       SOC RC01158 */38230000
 /* MODULE NAME      :  R414_FILL_TPMNT_3_PERIOD                      */38240000
 /*                                                                   */38250000
 /* DESCRIPTION      :                                                */38260000
 /*                                                                   */38270000
 /*********************************************************************/38280000
 R414_FILL_TPMNT_3_PERIOD: PROC (PARM_EFF_DATE                          38290000
                                ,PARM_END_DATE                          38300000
                                ,SERVICE_LVL_CODE         /* RC01229 */ 38310000
                                ,SERVICE_LVL_CODE_IND);   /* RC01229 */ 38320000
                                                                        38330000
 DCL PARM_EFF_DATE CHAR (10);                                           38340000
 DCL PARM_END_DATE CHAR (10);                                           38350000
 DCL SERVICE_LVL_CODE  CHAR  (3);                                       38360000
 DCL SERVICE_LVL_CODE_IND FIXED BIN(15);                                38370000
                                                                        38380000
 WRK_PERIOD = '';                                                       38390000
                                                                        38400000
 WRK_PERIOD.EFFDATE   = R013_TRANS_DATE(PARM_EFF_DATE);                 38410000
 WRK_PERIOD.ENDDATE   = R013_TRANS_DATE(PARM_END_DATE);                 38420000
 WRK_PERIOD.BUDIV     = '2';                                            38430000
 WRK_PERIOD.SSRCIND   = SAVED_HW_PI.SOURCE_INDICATOR;   /* RA01224 */   38440000
 WRK_PERIOD.TPMNT     = '3';                                            38450000
 WRK_PERIOD.CUNOUSE   = SAVED_HW_PI.CUSTOMER_NUMBER;                    38460000
 WRK_PERIOD.BUCODE    = SAVED_HW_PI.OU_CODE;                            38470000
 WRK_PERIOD.TAKE_CEDS = 'N';                                            38480000
                                                                        38490000
 IF SERVICE_LVL_CODE_IND ¬= -1                                          38500000
 THEN DO;                                                               38510000
   WRK_SET_HRS = 'Y';                                                   38520000
   CALL R016_FILL_COVERAGE_HOURS(SERVICE_LVL_CODE, WRK_SET_HRS);        38530000
 END;                                                                   38540000
 ELSE                                                                   38550000
   WRK_PERIOD.PRES_VALID = 'N';                                         38560000
                                                                        38570000
 END R414_FILL_TPMNT_3_PERIOD;                         /* EOC RC01158 */38580000
1/*********************************************************************/38590000
 /*                                                       SOC RC01158 */38600000
 /* MODULE NAME      :  R415_FILL_WAR_CTR_PERIOD                      */38610000
 /*                                                                   */38620000
 /* DESCRIPTION      :                                                */38630000
 /*                                                                   */38640000
 /*********************************************************************/38650000
 R415_FILL_WAR_CTR_PERIOD: PROC (PARM_EFF_DATE,                         38660000
                                 PARM_END_DATE,                         38670000
                                 CI);                     /* RB01236  */38680000
                                                                        38690000
 DCL PARM_EFF_DATE CHAR (10);                                           38700000
 DCL PARM_END_DATE CHAR (10);                                           38710000
 DCL CI            FIXED BIN(15);     /* SAVED T0241 INDEX - RB01236 */ 38720000
                                                                        38730000
 WRK_PERIOD = '';                                                       38740000
                                                                        38750000
 WRK_PERIOD.EFFDATE   = R013_TRANS_DATE(PARM_EFF_DATE);                 38760000
 WRK_PERIOD.ENDDATE   = R013_TRANS_DATE(PARM_END_DATE);                 38770000
 WRK_PERIOD.BUDIV     = '2';                                            38780000
 WRK_PERIOD.SSRCIND   = SAVED_CTR_PI(CI).SOURCE_INDICATOR; /* PTM1408 */38790000
 WRK_PERIOD.TPMNT     = SAVED_HW_PI.TYPE_OF_WARRANTY;                   38800000
                                                       /* SOC RB01308 */38810000
 /*IF((SAVED_HW_PI.WARRANTY_SPLT_DATE <= WRK_RUN_DATE) /* SOC RB01298 */38820000
 IF((SAVED_HW_PI.WARRANTY_SPLT_DATE <= PARM_EFF_DATE)                   38830000
                                                       /* EOC RB01308 */38840000
 & (SAVED_HW_PI.F_TYPE_OF_WARRANTY ¬= ''))                              38850000
 THEN                                                                   38860000
   WRK_PERIOD.TPMNT   = SAVED_HW_PI.F_TYPE_OF_WARRANTY;                 38870000
                                                       /* EOC RB01298 */38880000
 WRK_PERIOD.CUNOUSE   = SAVED_HW_PI.CUSTOMER_NUMBER;                    38890000
 WRK_PERIOD.BUCODE    = SAVED_HW_PI.OU_CODE;                            38900000
 WRK_PERIOD.IAGRNBR   = SAVED_CTR_PI(CI).CONTRACT_NUMBER;               38910000
 WRK_PERIOD.TAKE_CEDS = 'Y';                                            38920000
 IF SAV_SDF_IND ¬= -1                                                   38930000
 THEN                                                                   38940000
   WRK_PERIOD.SDF = SAVED_HW_PI.SERVICE_DELIV_FLAG;                     38950000
                                                       /* SOC RB01236 */38960000
 IF (SAVED_CTR_PI(CI).COVERAGE_START_1 = '00.00.00'                     38970000
   & SAVED_CTR_PI(CI).COVERAGE_START_2 = '00.00.00'                     38980000
   & SAVED_CTR_PI(CI).COVERAGE_START_3 = '00.00.00'                     38990000
   & SAVED_CTR_PI(CI).COVERAGE_START_4 = '00.00.00'                     39000000
   & SAVED_CTR_PI(CI).COVERAGE_START_5 = '00.00.00'                     39010000
   & SAVED_CTR_PI(CI).COVERAGE_START_6 = '00.00.00'                     39020000
   & SAVED_CTR_PI(CI).COVERAGE_START_7 = '00.00.00'                     39030000
   & SAVED_CTR_PI(CI).COVERAGE_END_1 = '00.00.00'                       39040000
   & SAVED_CTR_PI(CI).COVERAGE_END_2 = '00.00.00'                       39050000
   & SAVED_CTR_PI(CI).COVERAGE_END_3 = '00.00.00'                       39060000
   & SAVED_CTR_PI(CI).COVERAGE_END_4 = '00.00.00'                       39070000
   & SAVED_CTR_PI(CI).COVERAGE_END_5 = '00.00.00'                       39080000
   & SAVED_CTR_PI(CI).COVERAGE_END_6 = '00.00.00'                       39090000
   & SAVED_CTR_PI(CI).COVERAGE_END_7 = '00.00.00')                      39100000
                                                       /* EOC RB01236 */39110000
 THEN                                                                   39120000
   WRK_SET_HRS = 'Y';                                                   39130000
 ELSE                                                                   39140000
   WRK_SET_HRS = 'N';                                                   39150000
                                                                        39160000
 IF SAVED_CTR_PI(CI).SERVICE_LVL_CODE ¬= LOW(3)       /* SOC RC01194 */ 39170000
 THEN DO;                                                               39180000
   CALL R016_FILL_COVERAGE_HOURS (SAVED_CTR_PI(CI).SERVICE_LVL_CODE,    39190000
                                  WRK_SET_HRS);                         39200000
 END;                                                 /* EOC RC01194 */ 39210000
 ELSE DO;                                                               39220000
   IF SAVED_CTR_PI(CI).SOURCE_INDICATOR = 'P' THEN         /* PTM1408 */39230000
     CALL R016C_FILL_PEW_SDF_DETAIL;                                    39240000
   ELSE                                                                 39250000
     WRK_PERIOD.PRES_VALID = 'N';                                       39260000
 END;                                                                   39270000
                                                                        39280000
 IF WRK_SET_HRS = 'N'                                                   39290000
 THEN DO;                                                               39300000
                                                       /* SOC RB01236 */39310000
   WRK_PERIOD.DAGRMFR(1)=                                               39320000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_1);              39330000
   WRK_PERIOD.DAGRMFR(2)=                                               39340000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_2);              39350000
   WRK_PERIOD.DAGRMFR(3)=                                               39360000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_3);              39370000
   WRK_PERIOD.DAGRMFR(4)=                                               39380000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_4);              39390000
   WRK_PERIOD.DAGRMFR(5)=                                               39400000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_5);              39410000
   WRK_PERIOD.DAGRMFR(6)=                                               39420000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_6);              39430000
   WRK_PERIOD.DAGRMFR(7)=                                               39440000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_START_7);              39450000
   WRK_PERIOD.DAGRMTO(1)=                                               39460000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_1);                39470000
   WRK_PERIOD.DAGRMTO(2)=                                               39480000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_2);                39490000
   WRK_PERIOD.DAGRMTO(3)=                                               39500000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_3);                39510000
   WRK_PERIOD.DAGRMTO(4)=                                               39520000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_4);                39530000
   WRK_PERIOD.DAGRMTO(5)=                                               39540000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_5);                39550000
   WRK_PERIOD.DAGRMTO(6)=                                               39560000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_6);                39570000
   WRK_PERIOD.DAGRMTO(7)=                                               39580000
       R012_TRANS_TIME(SAVED_CTR_PI(CI).COVERAGE_END_7);                39590000
 END;                                                                   39600000
                                                                        39610000
 WRK_PERIOD.IHSIESA(1)= SAVED_CTR_PI(CI).SERVICE_MODULE_1;              39620000
 WRK_PERIOD.IHSIESA(2)= SAVED_CTR_PI(CI).SERVICE_MODULE_2;              39630000
 WRK_PERIOD.IHSIESA(3)= SAVED_CTR_PI(CI).SERVICE_MODULE_3;              39640000
 WRK_PERIOD.IHSIESA(4)= SAVED_CTR_PI(CI).SERVICE_MODULE_4;              39650000
 WRK_PERIOD.IHSIESA(5)= SAVED_CTR_PI(CI).SERVICE_MODULE_5;              39660000
 IF WRK_PERIOD.SERV_DEL_M = '' THEN                        /* RB01299 */39670000
    WRK_PERIOD.SERV_DEL_M = SAVED_CTR_PI(CI).SERVICE_TYPE; /* RA01233 */39680000
                                                       /* EOC RB01236 */39690000
 IF WRK_PERIOD.EFFDATE <= WRK_RUN_DATE8 &              /* SOC RB01308 */39700000
    WRK_PERIOD.ENDDATE >= WRK_RUN_DATE8  THEN                           39710000
     USER_FILE_PI.BASE_WARRANTY_SLC = TMP_PI_BASE_WARRANTY_SLC;         39720000
                                                        /*EOC RB01308 */39730000
                                                        /*SOC RC01295 */39740000
 /*CALL R750_CHECK_LENOVO (SAVED_HW_PI.INSTALL_DATE,   /* SOC RB01272 */39750000
 /*                        SAVED_HW_PI.WARRANTY_EXP_DATE,             */39760000
 CALL R750_CHECK_LENOVO (SAVED_HW_PI.WARRANTY_EXP_DATE, /*EOC RC01295 */39770000
                         SAVED_CTR_PI(CI).AUTHORISATION_CODE,           39780000
                         PARM_EFF_DATE,                                 39790000
                         PARM_END_DATE,                                 39800000
                         PARM_EFF_DATE,                /* EOC RB01272 */39810000
                         SAVED_HW_PI.WARRANTY_LIABILITY);  /* RB01283 */39820000
                                                                        39830000
 END R415_FILL_WAR_CTR_PERIOD;                         /* EOC RC01158 */39840000
1/*********************************************************************/39850000
 /*                                                       SOC RC01158 */39860000
 /* MODULE NAME      :  R416_PROCESS_PERIOD                           */39870000
 /*                                                                   */39880000
 /* DESCRIPTION      :                                                */39890000
 /*                                                                   */39900000
 /*********************************************************************/39910000
 R416_PROCESS_PERIOD: PROC(CI);                           /* RB01236  */39920000
                                                                        39930000
 DCL CI            FIXED BIN(15);     /* SAVED T0241 INDEX - RB01236 */ 39940000
                                                                        39950000
 SELECT;                                                                39960000
   WHEN (WRK_PERIOD.ENDDATE < WRK_RUN_DATE8)                            39970000
   DO;                                                                  39980000
     WRK_CNT_HIST_PI = WRK_CNT_HIST_PI + 1;                             39990000
     IF WRK_CNT_HIST_PI <= 2                                            40000000
     THEN                                                               40010000
       DO;                                                              40020000
         USER_FILE_PI.HF_SLOT(WRK_CNT_HIST_PI) = WRK_PERIOD;            40030000
         PI_FLAG(WRK_CNT_HIST_PI) = WRK_PI_FLAG;          /* RB01308 */ 40040000
       END;                                                             40050000
     ELSE                                                               40060000
       DO;                                                              40070000
         USER_FILE_PI.HF_SLOT(1) =  USER_FILE_PI.HF_SLOT(2);            40080000
         USER_FILE_PI.HF_SLOT(2) = WRK_PERIOD;                          40090000
         PI_FLAG(1) = PI_FLAG(2);                     /* SOC RB01308 */ 40100000
         PI_FLAG(2) = WRK_PI_FLAG;                    /* EOC RB01308 */ 40110000
         WRK_CNT_HIST_PI = 2;                                           40120000
       END;                                                             40130000
   END;                                                                 40140000
   WHEN (WRK_PERIOD.EFFDATE > WRK_RUN_DATE8)                            40150000
   DO;                                                                  40160000
     WRK_CNT_FUT_PI = WRK_CNT_FUT_PI + 1;                               40170000
     IF WRK_CNT_FUT_PI <= 2                                             40180000
     THEN                                                               40190000
       DO;                                                              40200000
         USER_FILE_PI.HF_SLOT(2 + WRK_CNT_FUT_PI) = WRK_PERIOD;         40210000
         PI_FLAG(2 + WRK_CNT_FUT_PI) = WRK_PI_FLAG;       /* RB01308 */ 40220000
       END;                                                             40230000
     ELSE                                                               40240000
       DO;                                                              40250000
         WRK_CNT_FUT_PI = 2;                                            40260000
       END;                                                             40270000
   END;                                                                 40280000
   OTHERWISE                                                            40290000
   DO;                                                                  40300000
     USER_FILE_PI.SRCC0MD = WRK_PERIOD;                                 40310000
     SW_PI                = TRUE;                                       40320000
     PI_FLAG(5) = WRK_PI_FLAG;/*INDEX 5 INDICATES CURRENT SLOT RB01308*/40330000
                                                       /* SOC RB01236*/ 40340000
     IF SAV_PI_ORIGIN = 'T241'                                          40350000
      | SAV_PI_ORIGIN = 'BOTH'                                          40360000
     THEN DO;                                                           40370000
       IF CI = 0 THEN               /* NOT A CONTRACT PERIOD       */   40380000
         USER_FILE_PI.QCUOHVP = 1;                                      40390000
       ELSE                                                             40400000
         USER_FILE_PI.QCUOHVP = SAVED_CTR_PI(CI).HVP_QUANTITY;          40410000
     END;                                                               40420000
                                                       /* EOC RB01236*/ 40430000
   END;                                                                 40440000
 END;                                                                   40450000
                                                                        40460000
 END R416_PROCESS_PERIOD;                              /* EOC RC01158 */40470000
1/*********************************************************************/40480000
 /*                                                    /* SOC RB01281 */40490000
 /* MODULE NAME      :   R417_PROCESS_FW_MACHINE                      */40500000
 /*                                                                   */40510000
 /* DESCRIPTION      :   FOR FLEXIBLE WARRANTY MACHINES,BOTH BRAND    */40520000
 /*                      WARRANTY PERIOD AND ISS WARRANTY PERIOD ARE  */40530000
 /*                      OBTAINED IN A SINGLE FETCH (R609_FETCH_      */40540000
 /*                      CURSOR_INST_HW). FOR SKIPPING THE FETCH AND  */40550000
 /*                      TO PROCESS THE ISS WARRANTY, THIS R417_      */40560000
 /*                      PROCESS_FW_MACHINE IS CREATED. THIS IS A     */40570000
 /*                      PSEUDO-FETCH FOR MACHINES UNDER ISS WARRANTY */40580000
 /*                                                                   */40590000
 /*********************************************************************/40600000
 R417_PROCESS_FW_MACHINE: PROC;                                         40610000
                                                                        40620000
 /* GETBACK ORIGINAL END_DATE FROM THE FETCH                   */       40630000
 CURSOR_INST_HW_V220.END_DATE = WRK_FW_END_DATE_BAU;                    40640000
                                                                        40650000
                                                                        40660000
 /* RESET ISS WARRANTY EFFECTIVE DATE TO SPLIT_DATE PLUS 1 DAY */       40670000
                                                       /* SOC RB01298 */40680000
 /* CURSOR_INST_HW_V220.EFFECTIVE_DATE = R014_DATE_CALC                 40690000
                     (CURSOR_INST_HW_V220.F_SPLT_DATE,+1);     */       40700000
 CURSOR_INST_HW_V220.EFFECTIVE_DATE =                                   40710000
                     CURSOR_INST_HW_V220.F_SPLT_DATE;                   40720000
                                                       /* EOC RB01298 */40730000
                                                                        40740000
 /* RESET THE TYPE OF WARRANTY WITH THE F_TYPE_OF_WARRANTY     */       40750000
 CURSOR_INST_HW_V220.TYPE_OF_WARRANTY =                                 40760000
                      CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY;           40770000
                                                                        40780000
 SK_INST_HW.EFFECTIVE_DATE        =                                     40790000
                R010_MAX_DATE(CURSOR_INST_HW_V170.EFFECTIVE_DATE        40800000
                             ,CURSOR_INST_HW_V190.EFFECTIVE_DATE        40810000
                             ,CURSOR_INST_HW_V220.EFFECTIVE_DATE);      40820000
 SK_INST_HW.END_DATE              =                                     40830000
                R011_MIN_DATE(CURSOR_INST_HW_V170.END_DATE              40840000
                             ,CURSOR_INST_HW_V190.END_DATE              40850000
                             ,CURSOR_INST_HW_V220.END_DATE);            40860000
                                                                        40870000
 END R417_PROCESS_FW_MACHINE;                          /* EOC RB01281 */40880000
                                                                        40890000
 /*********************************************************************/40900000
 /*                                                                   */40910000
 /* MODULE NAME      :  R418_FILL_OFF_SNAME            /* SOC RB01301 */40920000
 /*                                                                   */40930000
 /* DESCRIPTION      :  FILL SERVICE EXTENSIONS FROM PI IF SPACE IS   */40940000
 /*                     AVAILABLE IN THE SERVICE_EXTENSIONS FIELD.    */40950000
 /*********************************************************************/40960000
 R418_FILL_OFF_SNAME: PROC(WRK_J);                                      40970000
                                                                        40980000
 DCL WRK_J   FIXED BIN(31);                                             40990000
 DCL WRK_K   FIXED BIN(31);                            /* SOC RB01308 */41000000
 WRK_K = 1;                                            /* EOC RB01308 */41010000
 WRK_X = 1;                                                             41020000
 WRK_Y = 3;                                                             41030000
 TB_RCBV650 = '';                               /* SOC CEDS00000536 */  41040000
 TB_RCBV650_I.INDNULL(*) = 0;                   /* EOC CEDS00000536 */  41050000
                                                                        41060000
 IF PI_PROCESS_SERV_EXT = TRUE THEN                                     41070000
 DO;                                                                    41080000
  EXEC SQL                                                              41090000
   SELECT *                                                             41100000
   INTO :TB_RCBV650                                                     41110000
        :TB_RCBV650_I.INDNULL                                           41120000
   FROM  RCBV0650_TRANS_SDF T650                                        41130000
   WHERE T650.SERVICE_DELIV_FLAG = :WRK051_SERVICE_DELIV_FLAG           41140000
    AND  T650.COUNTRY_NUMBER     = :WRK_CTRYNO                          41150000
   WITH UR;                                                             41160000
                                                                        41170000
   SELECT(SQLCA.SQLCODE);                                               41180000
     WHEN(0)                                                            41190000
       DO;                                                              41200000
        IF WRK_J ¬= 1 THEN                                              41210000
          DO;                                                           41220000
            IF TB_RCBV650_I.INDNULL(13)  = 0    THEN                    41230000
              DO WHILE (WRK_J <= 6                                      41240000
               & (SUBSTR(TB_RCBV650.SERVICE_EXTENSION,WRK_X,WRK_Y)      41250000
                                                       ¬= ' '));        41260000
                  IF (WRK_J <= 5 ) THEN                                 41270000
                    DO;                                                 41280000
                       TEMP_SERV_EXTENSION(WRK_J) =                     41290000
                       SUBSTR(TB_RCBV650.SERVICE_EXTENSION,WRK_X,WRK_Y);41300000
                    END;                                                41310000
                  ELSE                                                  41320000
                     TEMP_SERV_EXTENSION(5) = 'ME>';                    41330000
                                                                        41340000
               WRK_J = WRK_J + 1;                                       41350000
               WRK_X = WRK_X + 4;                                       41360000
                                                                        41370000
              END;                                                      41380000
          END;                                                          41390000
       ELSE                                                             41400000
          DO WHILE (WRK_J <= 5                                          41410000
           & (SUBSTR(TB_RCBV650.SERVICE_EXTENSION,WRK_X,WRK_Y)          41420000
                                                  ¬= ' '));             41430000
             TEMP_SERV_EXTENSION(WRK_J) =                               41440000
             SUBSTR(TB_RCBV650.SERVICE_EXTENSION,WRK_X,WRK_Y);          41450000
                                                                        41460000
             WRK_J = WRK_J + 1;                                         41470000
             WRK_X = WRK_X + 4;                                         41480000
          END;                                                          41490000
                                                      /* SOC RB01308 */ 41500000
            /* FILL ALL SERVICE EXTENSION FROM PI INTO USER_FILE_PI  */ 41510000
        WRK_X = 1;                                                      41520000
        IF TB_RCBV650_I.INDNULL(13) = 0 THEN                            41530000
         DO WHILE (WRK_K <= 5 &                                         41540000
                  (SUBSTR(TB_RCBV650.SERVICE_EXTENSION,WRK_X,WRK_Y)     41550000
                                                           ¬= ' '));    41560000
  /*        PI_SERV_EXTENSION(WRK_K) =              *//* SOC RC01326 */ 41570000
  /*        SUBSTR(TB_RCBV650.SERVICE_EXTENSION,WRK_X,WRK_Y);        */ 41580000
            PI_SERV_EXTENSION_SDF(WRK_K) =                              41590000
            SUBSTR(TB_RCBV650.SERVICE_EXTENSION,WRK_X,WRK_Y);           41600000
                                                      /* EOC RC01326 */ 41630000
            WRK_K = WRK_K + 1;                                          41640000
            WRK_X = WRK_X + 4;                                          41650000
         END;                                         /* EOC RB01308 */ 41660000
                                                      /* SOC RC01326 */ 41661000
         CNT_PI_WAR_SE = WRK_K - 1;                   /* EOC RC01326 */ 41670000
       END;                                                             41700000
     WHEN(100);                                                         41710000
     OTHERWISE                                                          41720000
       DO;                                                              41730000
      CALL RCBDRIM_ERROR (ADDR (SQLCA),                                 41740000
                          'DB2',                                        41750000
                          '#080');                                      41760000
                                                                        41770000
       END;                                                             41780000
     END;                                                               41790000
 END;                                                                   41800000
 END R418_FILL_OFF_SNAME;                               /* EOC RB01301*/41810000
1/*********************************************************************/41820000
 /*                                                                   */41830000
 /* MODULE NAME      :  R500_INIT_SERV_CTR_PERIOD                     */41840000
 /*                                                                   */41850000
 /* DESCRIPTION      :                                                */41860000
 /*                                                                   */41870000
 /*********************************************************************/41880000
 R500_INIT_SERV_CTR_PERIOD: PROC;                                       41890000
                                                                        41900000
                                      /* INIT CURSOR CURSOR_SERV_CTR */ 41910000
                                                      /* SOC RB01308 */ 41920000
 /*CURRENT_BAU_CTR_FLAG = FALSE;                     /* CEDS00000494 */ 41930000
                                                      /* EOC RB01308 */ 41940000
 EXEC SQL                                                               41950000
   OPEN CURSOR_SERV_CTR;                                                41960000
                                                                        41970000
 SELECT (SQLCODE);                                                      41980000
   WHEN (0);                                                            41990000
   OTHERWISE                                                            42000000
     DO;                                                                42010000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               42020000
                    'DB2',                                              42030000
                    '#042');                                            42040000
     END;                                                               42050000
 END;                                                                   42060000
                                                 /* SOC CEDS00000724 */ 42061000
 WRK220_TYPE_OF_MAINT   =  CURSOR_INST_HW_V220.TYPE_OF_MAINT;           42062000
                                                 /* EOC CEDS00000724 */ 42063000
               /* FETCH FIRST OCCURENCE OF CURSOR_CU                 */ 42070000
 CALL R409_FETCH_CURSOR_SERV_CTR;                                       42100000
                                                      /* SOC RB01290 */ 42110000
 /*IF ((SWITCH_INTERNAL_MACHINE_CTR = TRUE) &       SOC CEDS00000721 */ 42120000
 /*    (SW_MAINT_02 = TRUE)                 &                           42130000
     (SWITCH_EOC_SERV_CTR = FALSE)) THEN                                42140000
   DO;                                                                  42150000
     IF ((TB_RCBV240.CONTRACT_NUMBER ¬= '') &                           42160000
         (WRK_CONTNO_V240_IND ¬= -1)) THEN                              42170000
       DO;                                                              42180000
         CALL R400_RETR_ADD_CONTR_INFO;                                 42190000
         IF ((TB_RCBV030.TYPE_OF_CONTRACT ¬= '') &                      42200000
             (WRK_TOC_V30_IND ¬= -1)) THEN                              42210000
           DO;                                                          42220000
             CALL R615_FETCH_TOC_TOM_RCB070;                            42230000
           END;                                                         42240000
       END;                                                             42250000
   END;                                       */      /* EOC RB01290 */ 42260000
                                                 /* EOC CEDS00000721 */ 42261000
                                                                        42270000
 IF SWITCH_EOC_SERV_CTR                               /* SOC RC01158 */ 42280000
 THEN                                                                   42290000
   DO;                                                                  42300000
                                                    /* SOC * PTM1130 */ 42310000
     IF SW_MAINT_02                                                     42320000
     THEN                                                               42330000
       DO;                /* IF NO SERV CTR FOUND: ABEND           */   42340000
         PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                 42350000
         PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0186';               42360000
         PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                  42370000
         CALL RCB0M1M (PTR_INT_AREA);                                   42380000
         CALL RCBDRIM_ERROR (NULL, 'OTHER', '#043');                    42390000
       END;                                                             42400000
     ELSE                                                               42410000
       DO;                /* IF NO WARRANTY FOUND: SUPPLY CONTRACT */   42420000
       /*                                                SOC RB01308 */ 42430000
       /*IF PROCESS_BRAND_WARR THEN                  /* CEDS00000491 */ 42440000
       /*   DO;                                      /* CEDS00000491 */ 42450000
       /*     CALL R405_FILL_SUPPL_CTR_PERIOD                           42460000
       /*                          (SK_INST_HW.EFFECTIVE_DATE,          42470000
       /*                                SK_INST_HW.END_DATE);          42480000
       /*     CALL R404_PROCESS_FILLED_PERIOD;                          42490000
       /*   END;                                     /* CEDS00000491 */ 42500000
       /*HLP_EFF_DATE = SK_CURRENT_HW.END_DATE;           /* PTM0988 */ 42510000
         HLP_EFF_DATE = SK_CURRENT_HW.EFFECTIVE_DATE;                   42520000
       /*                                                EOC RB01308 */ 42530000
       END;                                                             42540000
                                                    /* EOC * PTM1130 */ 42550000
   END;                                               /* EOC RC01158 */ 42560000
 ELSE                                                                   42570000
   DO;                                                                  42580000
     HLP_EFF_DATE = SK_CURRENT_HW.EFFECTIVE_DATE;         /* PTM0988 */ 42590000
   END;                                                                 42600000
                                                                        42610000
 END R500_INIT_SERV_CTR_PERIOD;                                         42620000
1/*********************************************************************/42630000
 /*                                                                   */42640000
 /* MODULE NAME      :  R505_END_SERV_CTR_PERIOD                      */42650000
 /*                                                                   */42660000
 /* DESCRIPTION      :                                                */42670000
 /*                                                                   */42680000
 /*********************************************************************/42690000
 R505_END_SERV_CTR_PERIOD: PROC;                                        42700000
                                                                        42710000
                             /* CLOSE CURSOR CURSOR_SERV_CTR         */ 42720000
 EXEC SQL                                                               42730000
   CLOSE CURSOR_SERV_CTR;                                               42740000
                                                                        42750000
 SELECT (SQLCODE);                                                      42760000
   WHEN (0);                                                            42770000
   OTHERWISE                                                            42780000
     DO;                                                                42790000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               42800000
                            'DB2',                                      42810000
                            '#044');                                    42820000
     END;                                                               42830000
 END;                                                                   42840000
                                                                        42850000
 END R505_END_SERV_CTR_PERIOD;                                          42860000
1/*********************************************************************/42870000
 /*                                                                   */42880000
 /* MODULE NAME      :  R508_RETR_ADD_CURRENT_INFO                    */42890000
 /*                                                                   */42900000
 /* DESCRIPTION      :                                                */42910000
 /*                                                                   */42920000
 /*********************************************************************/42930000
 R508_RETR_ADD_CURRENT_INFO: PROC;                                      42940000
                                                                        42950000
                                                       /* SOC RC01326 */42970000
 IF SWITCH_BAU_ONLY | SWITCH_BAU_PI | SWITCH_BAU_OO THEN                42971000
 DO;                                                   /* EOC RC01326 */42972000
 IF WRK_BAU_REAL_SERIAL_NO_V125_IND = -1 THEN          /* SOC RB01320 */42980000
 DO;                                                                    43000000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 43020000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        43030000
 END;                                                                   43070000
 ELSE                                                                   43080000
   IF WRK_BAU_REAL_SERIAL_NO_V125_IND = 0 THEN             /* RC01326 */43090000
 DO;                                                                    43110000
    WRK_ORIGIN  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,1,2);              43130000
    WRK_SEQ_NO  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,3);                43140000
 END;                                                 /* EOC RB01320 */ 43180000
 END;                                                      /* RC01326 */43181000
                                                                        43190000
 TB_RCBV110 = '';                                                       43200000
                                                                        43210000
 EXEC SQL                                                               43220000
   SELECT STATUS                                                        43230000
     INTO :TB_RCBV110.STATUS                                            43240000
     FROM RCBV0110_HW_STATUS                                            43250000
    WHERE PRODUCT_TYPE   = :SK_CURRENT_HW.PRODUCT_TYPE                  43260000
                                                       /* SOC RB01320 */43270000
    /*AND ORIGIN          = :SK_CURRENT_HW.ORIGIN*/                     43280000
    /*AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER*/            43290000
      AND ORIGIN          = :WRK_ORIGIN                                 43300000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                /* EOC RB01320 */43310000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 43320000
                                                                        43330000
      AND STATUS          IN ('3','4')                                  43340000
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        43350000
                              AND END_DATE                              43360000
   ;                                                                    43370000
                                                                        43380000
  SELECT (SQLCODE);                                                     43390000
   WHEN (0) ;                                                           43400000
   WHEN (100);                                                          43410000
   OTHERWISE                                                            43420000
     DO;                                                                43430000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                43440000
                           'DB2',                                       43450000
                           '#045');                                     43460000
     END;                                                               43470000
 END;                                                                   43480000
                                                                        43490000
                                                                        43500000
 TB_RCBV300 = '';                                                       43510000
                                                                        43520000
 EXEC SQL                                                               43530000
   SELECT MODEL_NUMBER                                                  43540000
     INTO :TB_RCBV300.MODEL_NUMBER                                      43550000
     FROM RCBV0300_HW_REAL                                              43560000
    WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE                 43570000
                                                       /* SOC RB01320 */43580000
    /*AND ORIGIN          = :SK_CURRENT_HW.ORIGIN*/                     43590000
    /*AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER*/            43600000
      AND ORIGIN          = :WRK_ORIGIN                                 43610000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                 43620000
                                                       /* EOC RB01320 */43630000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 43640000
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        43650000
                              AND END_DATE                              43660000
   ;                                                                    43670000
                                                                        43680000
  SELECT (SQLCODE);                                                     43690000
   WHEN (0) ;                                                           43700000
   WHEN (100);                                                          43710000
   OTHERWISE                                                            43720000
     DO;                                                                43730000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                43740000
                           'DB2',                                       43750000
                           '#046');                                     43760000
     END;                                                               43770000
 END;                                                                   43780000
                                                                        43790000
 TB_RCBV380 = '';                                                       43800000
                                                                        43810000
                                                                        43820000
 EXEC SQL                                                               43830000
   SELECT MARKET_RESP_CODE                                              43840000
         ,INSTALLING_OU                                                 43850000
         ,DP_SYSTEM_NUMBER                                              43860000
         ,TYPE_OF_AGREEMENT                                             43870000
         ,CPU_TYPE                                                      43880000
     INTO :TB_RCBV380.MARKET_RESP_CODE    :WRK_INDNULL                  43890000
         ,:TB_RCBV380.INSTALLING_OU       :WRK_INDNULL                  43900000
         ,:TB_RCBV380.DP_SYSTEM_NUMBER    :WRK_INDNULL                  43910000
         ,:TB_RCBV380.TYPE_OF_AGREEMENT   :WRK_INDNULL                  43920000
         ,:TB_RCBV380.CPU_TYPE            :WRK_INDNULL                  43930000
     FROM RCBV0380_HW_PR_MOD                                            43940000
    WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE                 43950000
                                                       /* SOC RB01320 */43960000
    /*AND ORIGIN          = :SK_CURRENT_HW.ORIGIN*/                     43970000
    /*AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER*/            43980000
      AND ORIGIN          = :WRK_ORIGIN                                 43990000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                /* EOC RB01320 */44000000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 44010000
                                                                        44020000
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        44030000
                              AND END_DATE                              44040000
   ;                                                                    44050000
                                                                        44060000
  SELECT (SQLCODE);                                                     44070000
   WHEN (0) ;                                                           44080000
   WHEN (100);                                                          44090000
   OTHERWISE                                                            44100000
     DO;                                                                44110000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                44120000
                           'DB2',                                       44130000
                           '#047');                                     44140000
     END;                                                               44150000
 END;                                                                   44160000
                                                                        44170000
 TB_RCBV260 = '';                                                       44180000
                                                                        44181000
 IF SWITCH_OO_ONLY | SWITCH_BAU_OO THEN                /* SOC RC01326 */44190000
 DO;                                                   /* EOC RC01326 */44191000
 IF WRK_OO_REAL_SERIAL_NO_V125_IND = -1 THEN           /* SOC RB01320 */44200000
 DO;                                                                    44230000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 44240000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        44250000
 END;                                                                   44270000
 ELSE                                                                   44280000
 IF WRK_OO_REAL_SERIAL_NO_V125_IND = 0 THEN               /* RC01326 */ 44281000
 DO;                                                                    44290000
    WRK_ORIGIN  = SUBSTR(WRK_OO_REAL_SERIAL_NO_V125,1,2);               44320000
    WRK_SEQ_NO  = SUBSTR(WRK_OO_REAL_SERIAL_NO_V125,3);                 44330000
 END;                                                 /* EOC RB01320 */ 44350000
 END;                                                     /* RC01326 */ 44351000
                                                                        44360000
 EXEC SQL                                                               44370000
   SELECT ORDER_REF_NUMBER                                              44380000
     INTO :TB_RCBV260.ORDER_REF_NUMBER                                  44390000
     FROM RCBV0260_HW_IN_ORD                                            44400000
    WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE                 44410000
                                                       /* SOC RB01320 */44420000
    /*AND ORIGIN          = :SK_CURRENT_HW.ORIGIN*/                     44430000
    /*AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER*/            44440000
      AND ORIGIN          = :WRK_ORIGIN                                 44450000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                 44460000
                                                       /* EOC RB01320 */44470000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 44480000
      AND ORDER_DATE      =                                             44490000
         (                                                              44500000
          SELECT MAX(ORDER_DATE)                                        44510000
            FROM RCBV0260_HW_IN_ORD                                     44520000
           WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE          44530000
                                                       /* SOC RB01320 */44540000
         /*AND ORIGIN          = :SK_CURRENT_HW.ORIGIN*/                44550000
         /*AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER*/       44560000
             AND ORIGIN          = :WRK_ORIGIN                          44570000
             AND SEQUENCE_NUMBER = :WRK_SEQ_NO                          44580000
                                                       /* EOC RB01320 */44590000
             AND COUNTRY_NUMBER  = :WRK_CTRYNO                          44600000
             AND ORDER_DATE      < :SK_CURRENT_HW.EFFECTIVE_DATE        44610000
         )                                                              44620000
   ;                                                                    44630000
                                                                        44640000
  SELECT (SQLCODE);                                                     44650000
   WHEN (0) ;                                                           44660000
   WHEN (100);                                                          44670000
                 /* LEAVE ORDER REF SOMETIMES BLANK RATHER THAN ABEND */44680000
   WHEN (-811) TB_RCBV260.ORDER_REF_NUMBER = '';                        44690000
   OTHERWISE                                                            44700000
     DO;                                                                44710000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                44720000
                           'DB2',                                       44730000
                           '#048');                                     44740000
     END;                                                               44750000
 END;                                                                   44760000
                                                                        44770000
 IF PARM_RCB005.ADDRESS_RES = '1'                                       44780000
 THEN                                                                   44790000
   DO;                                                                  44800000
     TB_RCBV340 = '';                                                   44810000
                                                                        44820000
     EXEC SQL                                                           44830000
       SELECT ADDRESS_NUMBER                                            44840000
         INTO :TB_RCBV340.ADDRESS_NUMBER                                44850000
         FROM RCBV0340_HW_ADDR                                          44860000
        WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE             44870000
                                                      /* SOC RB01320 */ 44880000
        /*AND ORIGIN           = :SK_CURRENT_HW.ORIGIN                  44890000
          AND SEQUENCE_NUMBER  = :SK_CURRENT_HW.SEQUENCE_NUMBER*/       44900000
          AND ORIGIN           = :WRK_ORIGIN                            44910000
          AND SEQUENCE_NUMBER  = :WRK_SEQ_NO                            44920000
                                                      /* EOC RB01320 */ 44930000
          AND COUNTRY_NUMBER  = :WRK_CTRYNO                             44940000
          AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                    44950000
                                  AND END_DATE                          44960000
       ;                                                                44970000
                                                                        44980000
      SELECT (SQLCODE);                                                 44990000
       WHEN (0) ;                                                       45000000
       WHEN (100);                                                      45010000
       OTHERWISE                                                        45020000
         DO;                                                            45030000
           CALL RCBDRIM_ERROR (ADDR (SQLCA),                            45040000
                               'DB2',                                   45050000
                               '#049');                                 45060000
         END;                                                           45070000
     END;                                                               45080000
   END;                                                                 45090000
                                                                        45100000
 END R508_RETR_ADD_CURRENT_INFO;                                        45110000
1/*********************************************************************/45120000
 /*                                                                   */45130000
 /* MODULE NAME      :  R509_FILL_CURRENT_INFO                        */45140000
 /*                                                                   */45150000
 /* DESCRIPTION      :                                                */45160000
 /*                                                                   */45170000
 /*********************************************************************/45180000
 R509_FILL_CURRENT_INFO: PROC;                                          45190000
                                                                        45200000
 SWITCH_CURRENT_PERIOD_FOUND = TRUE;                                    45210000
                                                                        45220000
 FILE_RCBDRI1.IDEXRIF       = 'M362';                                   45230000
 FILE_RCBDRI1.TYPE          = SK_CURRENT_HW.PRODUCT_TYPE;               45240000
 FILE_RCBDRI1.SERNO         = SK_CURRENT_HW.ORIGIN||                    45250000
                                          SK_CURRENT_HW.SEQUENCE_NUMBER;45260000
 FILE_RCBDRI1.SERIAL_LNG    = WRK_BAU_REAL_SERIAL_NO_V125; /* RB01320 */45270000
 FILE_RCBDRI1.MOD           = TB_RCBV300.MODEL_NUMBER;                  45280000
 FILE_RCBDRI1.BUILT_TO_MOD  = TB_RCBV300.MODEL_NUMBER;                  45290000
 FILE_RCBDRI1.CPUTYPE       = TB_RCBV380.CPU_TYPE;                      45300000
 FILE_RCBDRI1.ICUSANO       = '000';                                    45310000
 STRING(FILE_RCBDRI1.MKBINA) = TB_RCBV380.INSTALLING_OU;                45320000
 FILE_RCBDRI1.ORDREF        = TB_RCBV260.ORDER_REF_NUMBER;              45330000
 FILE_RCBDRI1.TPAGR         = TB_RCBV380.TYPE_OF_AGREEMENT;             45340000
 FILE_RCBDRI1.DPSYSNO       = TB_RCBV380.DP_SYSTEM_NUMBER;              45350000
 FILE_RCBDRI1.WED           =                                           45360000
                 R013_TRANS_DATE(CURSOR_INST_HW_V220.WARRANTY_EXP_DATE);45370000
 FILE_RCBDRI1.DPIS          = TB_RCBV110.STATUS;                        45380000
                                                                        45390000
                                   /* DEFINE CURRENT PERIOD          */ 45400000
                                   /* DETERMINE EFF DATE             */ 45410000
                                                                        45420000
                                                                        45430000
                              /* FILL CURRENT PERIOD INFO            */ 45440000
 FILE_RCBDRI1.MKINSDAT =                                                45450000
                R013_TRANS_DATE(CURSOR_INST_HW_V190.MARKETING_INSTDAT); 45460000
 FILE_RCBDRI1.MKSCREMD =                                                45470000
                R013_TRANS_DATE(CURSOR_INST_HW_V190.SCHED_REMOVAL_DATE);45480000
                                                                        45490000
 IF PARM_RCB005.ADDRESS_RES = '1'                                       45500000
 THEN                                                                   45510000
   DO;                                                                  45520000
     FILE_RCBDRI1_AAS_ADD  = TB_RCBV340.ADDRESS_NUMBER;                 45530000
   END;                                                                 45540000
                                                                        45550000
 END R509_FILL_CURRENT_INFO;                                            45560000
                                                                        45570000
1/*********************************************************************/45580000
 /*                                                       SOC RC01194 */45590000
 /* MODULE NAME      :  R520_FILL_DATE_TABLE_FROM_T051                */45600000
 /*                                                                   */45610000
 /* DESCRIPTION      :  ADD START AND END DATE OF WARRANTY TO THE     */45620000
 /*                     DATE TABLE. THE END DATE IS INCREASED BY      */45630000
 /*                     ONE DAY, SO THE END DATE IN THE TABLE         */45640000
 /*                     WILL REPRESENT THE START DATE OF A PERIOD     */45650000
 /*                     WITHOUT WARRANTY.                             */45660000
 /*                                                                   */45670000
 /*********************************************************************/45680000
 R520_FILL_DATE_TABLE_FROM_T051: PROC;                                  45690000
                                       /* ADD START WARRANTY 1        */45700000
 CALL R526_ADD_DATE_TO_TABLE ('SW1', W_EFF);                            45710000
                                                                        45720000
 IF SAV_T051_SLC2_IND ¬= -1                                             45730000
 THEN DO;                              /* ADD START WARRANTY 2        */45740000
   CALL R526_ADD_DATE_TO_TABLE ('SW2', W_SPL);                          45750000
 END;                                                                   45760000
                                                                        45770000
                                       /* ADD END WARRANTY            */45780000
                                       /* PTM 1254   */                 45790000
 IF W_END = '9999-12-31'                                                45800000
 THEN                                                                   45810000
   CALL R526_ADD_DATE_TO_TABLE ('EW', W_END);                           45820000
 ELSE                                                                   45830000
   CALL R526_ADD_DATE_TO_TABLE ('EW', R014_DATE_CALC(W_END, +1));       45840000
                                                                        45850000
 END R520_FILL_DATE_TABLE_FROM_T051;                   /* EOC RC01194 */45860000
                                                                        45870000
1/*********************************************************************/45880000
 /*                                                       SOC RC01194 */45890000
 /* MODULE NAME      :  R521_FILL_DATE_TABLE_FROM_T241                */45900000
 /*                                                                   */45910000
 /* DESCRIPTION      :  ADD START AND END DATE OF SERVICE CONTRACT TO */45920000
 /*                     THE DATE TABLE. THE END DATE IS INCREASED BY*/  45930000
 /*                     ONE DAY, SO THE END DATE IN THE TABLE         */45940000
 /*                     WILL REPRESENT THE START DATE OF A PERIOD     */45950000
 /*                     WITHOUT SERVICE.                              */45960000
 /*                                                                   */45970000
 /*********************************************************************/45980000
 R521_FILL_DATE_TABLE_FROM_T241: PROC;                                  45990000
                                                        /* SOC RB01236*/46000000
 /*------ SAVE T0241 CONTRACT RECORD(S) ------------------------------*/46010000
                                                                        46020000
 CTR_COUNT = CTR_COUNT + 1;                                             46030000
                                                                        46040000
 SAVED_CTR_PI(CTR_COUNT) = CURSOR_CTR_PI, BY NAME;                      46050000
 IF WRK_COVERAGE_START_1_IND = -1 THEN                                  46060000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_START_1 = '00.00.00';               46070000
 IF WRK_COVERAGE_START_2_IND = -1 THEN                                  46080000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_START_2 = '00.00.00';               46090000
 IF WRK_COVERAGE_START_3_IND = -1 THEN                                  46100000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_START_3 = '00.00.00';               46110000
 IF WRK_COVERAGE_START_4_IND = -1 THEN                                  46120000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_START_4 = '00.00.00';               46130000
 IF WRK_COVERAGE_START_5_IND = -1 THEN                                  46140000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_START_5 = '00.00.00';               46150000
 IF WRK_COVERAGE_START_6_IND = -1 THEN                                  46160000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_START_6 = '00.00.00';               46170000
 IF WRK_COVERAGE_START_7_IND = -1 THEN                                  46180000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_START_7 = '00.00.00';               46190000
                                                                        46200000
 IF WRK_COVERAGE_END_1_IND = -1 THEN                                    46210000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_END_1 = '00.00.00';                 46220000
 IF WRK_COVERAGE_END_2_IND = -1 THEN                                    46230000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_END_2 = '00.00.00';                 46240000
 IF WRK_COVERAGE_END_3_IND = -1 THEN                                    46250000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_END_3 = '00.00.00';                 46260000
 IF WRK_COVERAGE_END_4_IND = -1 THEN                                    46270000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_END_4 = '00.00.00';                 46280000
 IF WRK_COVERAGE_END_5_IND = -1 THEN                                    46290000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_END_5 = '00.00.00';                 46300000
 IF WRK_COVERAGE_END_6_IND = -1 THEN                                    46310000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_END_6 = '00.00.00';                 46320000
 IF WRK_COVERAGE_END_7_IND = -1 THEN                                    46330000
   SAVED_CTR_PI(CTR_COUNT).COVERAGE_END_7 = '00.00.00';                 46340000
                                                                        46350000
 IF WRK_T241_SLC_IND = -1 THEN                                          46360000
   SAVED_CTR_PI(CTR_COUNT).SERVICE_LVL_CODE = LOW(3);                   46370000
                                                        /* EOC RB01236*/46380000
                                                                        46390000
                                       /* ADD START SERVICE CONTRACT  */46400000
 CALL R526_ADD_DATE_TO_TABLE ('SC', C_EFF);                             46410000
                                       /* ADD END SERVICE CONTRACT    */46420000
                                       /* PTM 1254   */                 46430000
                                                                        46440000
 IF C_END = '9999-12-31'                                                46450000
 THEN                                                                   46460000
   CALL R526_ADD_DATE_TO_TABLE ('EC', C_END);                           46470000
 ELSE                                                                   46480000
   CALL R526_ADD_DATE_TO_TABLE ('EC', R014_DATE_CALC(C_END, +1));       46490000
                                                                        46500000
 END R521_FILL_DATE_TABLE_FROM_T241;                   /* EOC RC01194 */46510000
                                                                        46520000
1/*********************************************************************/46530000
 /*                                                       SOC RC01194 */46540000
 /* MODULE NAME      :  R525_SORT_DATE_TABLE                          */46550000
 /*                                                                   */46560000
 /* DESCRIPTION      :  SORT THE DATE_TABLE ON FIELD DATE.            */46570000
 /*                     (BUBBLE-SORT)                                 */46580000
 /*                                                                   */46590000
 /*********************************************************************/46600000
 R525_SORT_DATE_TABLE: PROC;                                            46610000
                                                                        46620000
 DCL 1 I     FIXED BIN(31);                                             46630000
 DCL 1 J     FIXED BIN(31);                                             46640000
                                                                        46650000
 I = 1;                                                                 46660000
 DATES_SWAPPED = TRUE;                                                  46670000
 DO WHILE (DATES_SWAPPED & (I < NUMBER_OF_DATES));                      46680000
   J = NUMBER_OF_DATES;                                                 46690000
   DATES_SWAPPED = FALSE;                                               46700000
   DO WHILE (J > I);                                                    46710000
                                                       /* SOC RB01236*/ 46720000
 /* CONCATENATE TYPE, TO FORCE E(ND) BEFORE S(TART) WHEN EQUAL DATES */ 46730000
     IF DATE_TABLE(J).ISO_DATE   || SUBSTR(DATE_TABLE(J).TYPE,1,1)      46740000
        <                                                               46750000
        DATE_TABLE(J-1).ISO_DATE || SUBSTR(DATE_TABLE(J-1).TYPE,1,1)    46760000
                                                       /* EOC RB01236*/ 46770000
     THEN DO;                          /* SWAP DATES                  */46780000
       SAVE_DATE_ROW   = DATE_TABLE(J);                                 46790000
       DATE_TABLE(J)   = DATE_TABLE(J-1);                               46800000
       DATE_TABLE(J-1) = SAVE_DATE_ROW;                                 46810000
       DATES_SWAPPED   = TRUE;                                          46820000
       END;                                                             46830000
     J = J - 1;                                                         46840000
     END;                                                               46850000
   I = I + 1;                                                           46860000
   END;                                                                 46870000
                                                                        46880000
 END R525_SORT_DATE_TABLE;                             /* EOC RC01194 */46890000
                                                                        46900000
1/*********************************************************************/46910000
 /*                                                       SOC RC01194 */46920000
 /* MODULE NAME      :  R526_ADD_DATE_TO_TABLE                        */46930000
 /*                                                                   */46940000
 /* DESCRIPTION      :                                                */46950000
 /*                                                                   */46960000
 /*********************************************************************/46970000
 R526_ADD_DATE_TO_TABLE: PROC (TYPE, ISO_DATE);                         46980000
                                                                        46990000
   DCL TYPE       CHAR(03);                                             47000000
   DCL ISO_DATE   CHAR(10);                                             47010000
                                                                        47020000
   NUMBER_OF_DATES = NUMBER_OF_DATES + 1;                               47030000
                                                        /* SOC RB01236*/47040000
   IF TYPE = 'SC' | TYPE = 'EC' THEN                                    47050000
     DATE_TABLE(NUMBER_OF_DATES).CTR_INDEX = CTR_COUNT; /* SAVE INDEX */47060000
                                                        /* EOC RB01236*/47070000
   DATE_TABLE(NUMBER_OF_DATES).TYPE = TYPE;                             47080000
   DATE_TABLE(NUMBER_OF_DATES).ISO_DATE = ISO_DATE;                     47090000
                                                                        47100000
   IF NUMBER_OF_DATES >= MAX_NUMBER_OF_DATES - 1                        47110000
   THEN DO;                                /* NUMBER_OF_DATES EXCEEDS */47120000
                                           /* ARRAY SIZE              */47130000
     PARM_INT_AREA.MESSAGE_TYPE            = 'IS';                      47140000
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER = '0052';                    47150000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES  = ' ';                       47160000
     CALL RCB0M1M (PTR_INT_AREA);                                       47170000
   END;                                                                 47180000
                                                                        47190000
 END R526_ADD_DATE_TO_TABLE; /* EOC RC01194 */                          47200000
                                                                        47210000
1/*********************************************************************/47220000
 /*                                                       SOC RC01194 */47230000
 /* MODULE NAME      :  R527_PROCESS_DATE_TABLE                       */47240000
 /*                                                                   */47250000
 /* DESCRIPTION      :                                                */47260000
 /*                                                                   */47270000
 /*********************************************************************/47280000
 R527_PROCESS_DATE_TABLE: PROC;                                         47290000
                                                                        47300000
 DCL 1 I     FIXED BIN(31);                                             47310000
 DCL 1 J     FIXED BIN(31);                                             47320000
                                                                        47330000
 /* SET WARRANTY AND SEVICE INDICATORS IN DATE_TABLE                  */47340000
 DATE_TABLE(1).WARRANTY = '0';                                          47350000
 DATE_TABLE(1).SERVICE  = '0';                                          47360000
                                                                        47370000
 DO I = 1 TO NUMBER_OF_DATES;                                           47380000
   SELECT(SUBSTR(DATE_TABLE(I).TYPE,1,1));                              47390000
     WHEN ('S') DO;                    /* START DATE                  */47400000
       SELECT(SUBSTR(DATE_TABLE(I).TYPE,2,1));                          47410000
         WHEN ('W') DO;                /* ACTIVATE WARRANTY 1 OR 2    */47420000
           DATE_TABLE(I).WARRANTY = SUBSTR(DATE_TABLE(I).TYPE,3,1);     47430000
         END;                                                           47440000
         WHEN ('C') DO;                /* ACTIVATE SERVICE            */47450000
           DATE_TABLE(I).SERVICE  = '1';                                47460000
         END;                                                           47470000
         OTHERWISE;                                                     47480000
       END;                                                             47490000
     END;                                                               47500000
                                                                        47510000
     WHEN ('E') DO;                      /* END DATE */                 47520000
       SELECT(SUBSTR(DATE_TABLE(I).TYPE,2,1));                          47530000
         WHEN ('W') DO;          /* DEACTIVATE WARRANTY 1 OR 2 */       47540000
           DATE_TABLE(I).WARRANTY = '0';                                47550000
         END;                                                           47560000
         WHEN ('C') DO;                  /* DEACTIVATE SERVICE */       47570000
           DATE_TABLE(I).SERVICE  = '0';                                47580000
         END;                                                           47590000
         WHEN ('H') DO;                  /* DEACTIVATE SERVICE */       47600000
           DATE_TABLE(I).SERVICE  = '0';                                47610000
           DATE_TABLE(I).WARRANTY = '0';                                47620000
         END;                                                           47630000
         OTHERWISE;                                                     47640000
       END;                                                             47650000
     END;                                                               47660000
     OTHERWISE;                                                         47670000
   END;                                                                 47680000
   DATE_TABLE(I+1).WARRANTY = DATE_TABLE(I).WARRANTY;                   47690000
   DATE_TABLE(I+1).SERVICE  = DATE_TABLE(I).SERVICE;                    47700000
                                                       /* SOC RB01236*/ 47710000
   IF (DATE_TABLE(I+1).SERVICE   = '1' &               /* SERVICE &  */ 47720000
       DATE_TABLE(I+1).CTR_INDEX = '') THEN            /* NO INDEX ? */ 47730000
     DATE_TABLE(I+1).CTR_INDEX = DATE_TABLE(I).CTR_INDEX; /* COPY !! */ 47740000
                                                       /* EOC RB01236*/ 47750000
                                                                        47760000
 END;                                                                   47770000
                                                                        47780000
 /* MERGE ROWS WITH SAME DATE */                                        47790000
 DATES_COUNTER = NUMBER_OF_DATES;                                       47800000
 DO I = NUMBER_OF_DATES TO 2 BY -1;                                     47810000
   IF DATE_TABLE(I).ISO_DATE = DATE_TABLE(I-1).ISO_DATE                 47820000
   THEN                                                                 47830000
     DO;                                                                47840000
       DO J = I TO DATES_COUNTER;                                       47850000
         DATE_TABLE(J-1) = DATE_TABLE(J);                               47860000
       END;                                                             47870000
       DATE_TABLE(J) = '';                                              47880000
       DATES_COUNTER = DATES_COUNTER - 1;                               47890000
     END;                                                               47900000
 END;                                                                   47910000
 NUMBER_OF_DATES = DATES_COUNTER;                                       47920000
                                                                        47930000
                                                                        47940000
 /* FOR RCMS ONLY: IF THERE IS BOTH A 'WARRANTY_1 + SERVICE' SLOT     */47950000
 /* AND A CONSECUTIVE 'WARRANTY_2 + SERVICE' SLOT, THEN THERE ARE     */47960000
 /* NO DIFFERENCES BETWEEN THESE TWO SLOTS, BECAUSE THE SERVICE       */47970000
 /* DATA OVERRULES.                                                   */47980000
 /* THEREFOR, THESE TWO SLOTS MUST BECOME ONE BIG SLOT.               */47990000
                                                                        48000000
                                                       /* SOC RB01308 */48010000
        /* WHEN SPLIT WARRANTY IS OVERLAPPING WITH CONTRACT, TWO BASE */48020000
        /* WARRANTY SLC CAN RESULT, SO THE CODE IS COMMENTED OUT      */48030000
                                                                        48040000
 /* DO I = 2 TO (NUMBER_OF_DATES - 1);                                  48050000
 /*  IF ((DATE_TABLE(I).WARRANTY = '2')                                 48060000
 /*     & (DATE_TABLE(I).SERVICE = '1')                                 48070000
 /*     & (DATE_TABLE(I-1).WARRANTY = '1')                              48080000
 /*     & (DATE_TABLE(I-1).SERVICE = '1'))                              48090000
 /*  THEN                                                               48100000
 /*    DO;                                                              48110000
 /*      DO J = I TO NUMBER_OF_DATES - 1;                               48120000
 /*        DATE_TABLE(J) = DATE_TABLE(J+1);                             48130000
 /*      END;                                                           48140000
 /*      NUMBER_OF_DATES = NUMBER_OF_DATES - 1;                         48150000
 /*      DATE_TABLE(J+1) = '';                                          48160000
 /*    END;                                                             48170000
 /*END;                                                                 48180000
                                                       /* EOC RB01308 */48190000
                                                                        48200000
 /********************************************************************/ 48210000
                                                                        48220000
 PI_FLAG(*) = FALSE;                                      /* RB01308 */ 48230000
0/* PROCESS PI RECORDS */                                               48240000
 DO I = 1 TO (NUMBER_OF_DATES - 1);                                     48250000
   WRK_PI_FLAG = '0'B;                                    /* RB01308 */ 48260000
                                                                        48270000
   SELECT (DATE_TABLE(I).WARRANTY);                                     48280000
     WHEN ('0') DO;                    /* NO WARRANTY */                48290000
       SELECT (DATE_TABLE(I).SERVICE);                                  48300000
         WHEN ('0') DO;                /* NO SERVICE */                 48310000
           WRK_PI_FLAG.SW_PI_PERCALL = TRUE;              /* RB01308 */ 48320000
           IF DATE_TABLE(I+1).ISO_DATE = '9999-12-31' /* SOC PTM1317 */ 48330000
           THEN DO;                                                     48340000
             CALL R414_FILL_TPMNT_3_PERIOD                              48350000
                     (DATE_TABLE(I).ISO_DATE,                           48360000
                      DATE_TABLE(I+1).ISO_DATE,                         48370000
                      SAVED_HW_PI.SERVICE_LVL_CODE_C,                   48380000
                      SAV_T051_SLCC_IND);                               48390000
           END;                                                         48400000
           ELSE DO;                                   /* EOC PTM1317 */ 48410000
             CALL R414_FILL_TPMNT_3_PERIOD                              48420000
                     (DATE_TABLE(I).ISO_DATE,                           48430000
                      R014_DATE_CALC(DATE_TABLE(I+1).ISO_DATE, -1),     48440000
                      SAVED_HW_PI.SERVICE_LVL_CODE_C,                   48450000
                      SAV_T051_SLCC_IND);                               48460000
           END;                                                         48470000
           CALL R416_PROCESS_PERIOD                                     48480000
                         (DATE_TABLE(I).CTR_INDEX);      /* RB01236  */ 48490000
         END;                                                           48500000
         WHEN ('1') DO;                /* SERVICE */                    48510000
           WRK_PI_FLAG.SW_PI_CTR = TRUE;                  /* RB01308 */ 48520000
           IF SAV_PI_ORIGIN = 'T241'                                    48540000
           THEN DO;                                   /* SOC PTM1317 */ 48550000
             IF DATE_TABLE(I+1).ISO_DATE = '9999-12-31'                 48560000
             THEN DO;                                                   48570000
                CALL R412_FILL_CTR_T241_PERIOD                          48580000
                       (DATE_TABLE(I).ISO_DATE,                         48590000
                        DATE_TABLE(I+1).ISO_DATE,                       48600000
                        DATE_TABLE(I).CTR_INDEX);        /* RB01236  */ 48610000
             END;                                                       48620000
             ELSE DO;                                 /* EOC PTM1317 */ 48630000
                CALL R412_FILL_CTR_T241_PERIOD                          48640000
                       (DATE_TABLE(I).ISO_DATE,                         48650000
                        R014_DATE_CALC(DATE_TABLE(I+1).ISO_DATE,-1),    48660000
                        DATE_TABLE(I).CTR_INDEX);        /* RB01236  */ 48670000
             END;                                                       48680000
           END;                                                         48690000
           ELSE DO;                                    /* SOC PTM1317 */48700000
             IF DATE_TABLE(I+1).ISO_DATE = '9999-12-31'                 48710000
             THEN DO;                                                   48720000
               CALL R413_FILL_CTR_BOTH_PERIOD                           48730000
                      (DATE_TABLE(I).ISO_DATE,                          48740000
                       DATE_TABLE(I+1).ISO_DATE,                        48750000
                       DATE_TABLE(I).CTR_INDEX);         /* RB01236  */ 48760000
             END;                                                       48770000
             ELSE DO;                                  /* EOC PTM1317 */48780000
               CALL R413_FILL_CTR_BOTH_PERIOD                           48790000
                      (DATE_TABLE(I).ISO_DATE,                          48800000
                       R014_DATE_CALC(DATE_TABLE(I+1).ISO_DATE,-1),     48810000
                       DATE_TABLE(I).CTR_INDEX);         /* RB01236  */ 48820000
             END;                                                       48830000
           END;                                                         48840000
           CALL R416_PROCESS_PERIOD                                     48850000
                         (DATE_TABLE(I).CTR_INDEX);      /* RB01236  */ 48860000
         END;                                                           48870000
         OTHERWISE;                                                     48880000
       END;                                                             48890000
     END;                                                               48900000
                                                                        48910000
     WHEN ('1') DO;                    /* WARRANTY 1 */                 48920000
     SW_FW_PROCESS_W1 = '1'B;          /*RB01281 */                     48930000
     WRK_PI_FLAG.SW_PI_WARR = TRUE;                        /* RB01308 */48940000
       SELECT (DATE_TABLE(I).SERVICE);                                  48950000
         WHEN ('0') DO;                /* NO SERVICE */                 48960000
           IF DATE_TABLE(I+1).ISO_DATE = '9999-12-31'  /* SOC PTM1317 */48970000
           THEN DO;                                                     48980000
             CALL R411_FILL_WARRANTY_PERIOD                             48990000
                     (DATE_TABLE(I).ISO_DATE,                           49000000
                      DATE_TABLE(I+1).ISO_DATE,                         49010000
                      SAVED_HW_PI.SERVICE_LVL_CODE_1,                   49020000
                      SAV_T051_SLC1_IND);                               49030000
           END;                                                         49040000
           ELSE DO;                                    /* EOC PTM1317 */49050000
             CALL R411_FILL_WARRANTY_PERIOD                             49060000
                     (DATE_TABLE(I).ISO_DATE,                           49070000
                      R014_DATE_CALC(DATE_TABLE(I+1).ISO_DATE, -1),     49080000
                      SAVED_HW_PI.SERVICE_LVL_CODE_1,                   49090000
                      SAV_T051_SLC1_IND);                               49100000
           END;                                                         49110000
           CALL R416_PROCESS_PERIOD                                     49120000
                         (DATE_TABLE(I).CTR_INDEX);      /* RB01236  */ 49130000
         END;                                                           49140000
         WHEN ('1') DO;                /* SERVICE */                    49150000
           WRK_PI_FLAG.SW_PI_CTR = TRUE ;                  /* RB01308 */49160000
           IF DATE_TABLE(I+1).ISO_DATE = '9999-12-31'  /* SOC PTM1317 */49180000
           THEN DO;                                                     49190000
             CALL R415_FILL_WAR_CTR_PERIOD                              49200000
                     (DATE_TABLE(I).ISO_DATE,                           49210000
                      DATE_TABLE(I+1).ISO_DATE,                         49220000
                      DATE_TABLE(I).CTR_INDEX);           /* RB01236  */49230000
           END;                                                         49240000
           ELSE DO;                                    /* EOC PTM1317 */49250000
             CALL R415_FILL_WAR_CTR_PERIOD                              49260000
                     (DATE_TABLE(I).ISO_DATE,                           49270000
                      R014_DATE_CALC(DATE_TABLE(I+1).ISO_DATE,-1),      49280000
                      DATE_TABLE(I).CTR_INDEX);           /* RB01236  */49290000
           END;                                                         49300000
           CALL R416_PROCESS_PERIOD                                     49310000
                         (DATE_TABLE(I).CTR_INDEX);      /* RB01236  */ 49320000
         END;                                                           49330000
         OTHERWISE;                                                     49340000
       END;                                                             49350000
     END;                                                               49360000
                                                                        49370000
     WHEN ('2') DO;                    /* WARRANTY 2 */                 49380000
      SW_FW_PROCESS_W2 = '1'B;         /* RB01281 */                    49390000
      WRK_PI_FLAG.SW_PI_WARR = TRUE ;                      /* RB01308 */49400000
       SELECT (DATE_TABLE(I).SERVICE);                                  49410000
         WHEN ('0') DO;                /* NO SERVICE */                 49420000
           IF DATE_TABLE(I+1).ISO_DATE = '9999-12-31'  /* SOC PTM1317 */49430000
           THEN DO;                                                     49440000
              CALL R411_FILL_WARRANTY_PERIOD                            49450000
                      (DATE_TABLE(I).ISO_DATE,                          49460000
                       DATE_TABLE(I+1).ISO_DATE,                        49470000
                       SAVED_HW_PI.SERVICE_LVL_CODE_2,                  49480000
                       SAV_T051_SLC2_IND);                              49490000
           END;                                                         49500000
           ELSE DO;                                    /* EOC PTM1317 */49510000
             CALL R411_FILL_WARRANTY_PERIOD                             49520000
                     (DATE_TABLE(I).ISO_DATE,                           49530000
                      R014_DATE_CALC(DATE_TABLE(I+1).ISO_DATE, -1),     49540000
                      SAVED_HW_PI.SERVICE_LVL_CODE_2,                   49550000
                      SAV_T051_SLC2_IND);                               49560000
           END;                                                         49570000
           CALL R416_PROCESS_PERIOD                                     49580000
                         (DATE_TABLE(I).CTR_INDEX);      /* RB01236  */ 49590000
         END;                                                           49600000
         WHEN ('1') DO;                /* SERVICE */                    49610000
           WRK_PI_FLAG.SW_PI_CTR = TRUE;                   /* RB01308 */49620000
           IF DATE_TABLE(I+1).ISO_DATE = '9999-12-31'  /* SOC PTM1317 */49640000
           THEN DO;                                                     49650000
             CALL R415_FILL_WAR_CTR_PERIOD                              49660000
                     (DATE_TABLE(I).ISO_DATE,                           49670000
                      DATE_TABLE(I+1).ISO_DATE,                         49680000
                      DATE_TABLE(I).CTR_INDEX);           /* RB01236  */49690000
           END;                                                         49700000
           ELSE DO;                                    /* SOC PTM1317 */49710000
             CALL R415_FILL_WAR_CTR_PERIOD                              49720000
                     (DATE_TABLE(I).ISO_DATE,                           49730000
                      R014_DATE_CALC(DATE_TABLE(I+1).ISO_DATE,-1),      49740000
                      DATE_TABLE(I).CTR_INDEX);           /* RB01236  */49750000
           END;                                                         49760000
           CALL R416_PROCESS_PERIOD                                     49770000
                         (DATE_TABLE(I).CTR_INDEX);      /* RB01236  */ 49780000
         END;                                                           49790000
         OTHERWISE;                                                     49800000
       END;                                                             49810000
     END;                                                               49820000
   OTHERWISE;                                                           49830000
   END;                                                                 49840000
 END;                                                                   49850000
                                                                        49860000
 END R527_PROCESS_DATE_TABLE;                          /* EOC RC01194 */49870000
                                                                        49880000
1/*********************************************************************/49890000
 /*                                                                   */49900000
 /* MODULE NAME      :  R600_FILL_INST_PERIOD                         */49910000
 /*                                                                   */49920000
 /* DESCRIPTION      :                                                */49930000
 /*                                                                   */49940000
 /*********************************************************************/49950000
 R600_FILL_INST_PERIOD: PROC;                                           49960000
                                                                        49970000
 WRK_PERIOD = '';                                                       49980000
 WRK_PERIOD.EFFDATE = R013_TRANS_DATE(SK_CURRENT_HW.EFFECTIVE_DATE);    49990000
 WRK_PERIOD.ENDDATE = R013_TRANS_DATE(SK_CURRENT_HW.END_DATE);          50000000
 WRK_PERIOD.CUNOUSE = CURSOR_INST_HW_V190.CUSTOMER_NUMBER;              50010000
 WRK_PERIOD.BUDIV   = '2';                                              50020000
 WRK_PERIOD.BUCODE  = CURSOR_INST_HW_V170.OU_CODE;                      50030000
                                                                        50040000
 END R600_FILL_INST_PERIOD;                                             50050000
1/*********************************************************************/50060000
 /*                                                                   */50070000
 /* MODULE NAME      :  R609_FETCH_CURSOR_INST_HW                     */50080000
 /*                                                                   */50090000
 /* DESCRIPTION      :                                                */50100000
 /*                                                                   */50110000
 /*********************************************************************/50120000
 R609_FETCH_CURSOR_INST_HW: PROC;                                       50130000
                                                                        50140000
 CURSOR_INST_HW_V190 = '';                                              50150000
 CURSOR_INST_HW_V170 = '';                                              50160000
 CURSOR_INST_HW_V220 = '';                                              50170000
 WRK_END_DATE_SAVE   = '';                           /* CEDS00000491 */ 50180000
 PROCESS_BRAND_WARR = TRUE;                          /* CEDS00000491 */ 50190000
 SWITCH_INTERNAL_MACHINE_CTR = FALSE;                      /* RB01290 */50200000
                                                       /* SOC RB01320 */50210000
 WRK_BAU_REAL_SERIAL_NO_V125     = ' ';                                 50220000
 WRK_BAU_REAL_SERIAL_NO_V125_IND = ' ';                                 50230000
                                                       /* EOC RB01320 */50240000
 EXEC SQL                                                               50250000
   FETCH CURSOR_INST_HW                                                 50260000
     INTO                                                               50270000
          :CURSOR_INST_HW_V190.PRODUCT_TYPE       :WRK_INDNULL          50280000
         ,:CURSOR_INST_HW_V190.ORIGIN             :WRK_INDNULL          50290000
         ,:CURSOR_INST_HW_V190.SEQUENCE_NUMBER    :WRK_INDNULL          50300000
         ,:CURSOR_INST_HW_V190.CUSTOMER_NUMBER    :WRK_INDNULL          50310000
         ,:CURSOR_INST_HW_V190.MARKETING_INSTDAT  :WRK_INDNULL          50320000
         ,:CURSOR_INST_HW_V190.SCHED_REMOVAL_DATE :WRK_INDNULL          50330000
         ,:CURSOR_INST_HW_V190.EFFECTIVE_DATE     :WRK_INDNULL          50340000
         ,:CURSOR_INST_HW_V190.END_DATE           :WRK_INDNULL          50350000
         ,:CURSOR_INST_HW_V170.OU_CODE            :WRK_INDNULL          50360000
         ,:CURSOR_INST_HW_V170.EFFECTIVE_DATE     :WRK_INDNULL          50370000
         ,:CURSOR_INST_HW_V170.END_DATE           :WRK_INDNULL          50380000
         ,:CURSOR_INST_HW_V220.TYPE_OF_MAINT      :WRK_INDNULL          50390000
         ,:CURSOR_INST_HW_V220.TYPE_OF_WARRANTY   :WRK_INDNULL          50400000
                                                          /* RC01194 */ 50410000
         ,:CURSOR_INST_HW_V220.SERVICE_LVL_CODE   :WRK_T220_SLC_IND     50420000
         ,:CURSOR_INST_HW_V220.SOURCE_INDICATOR   :WRK_INDNULL          50430000
                                                          /* RB01290 */ 50440000
         ,:CURSOR_INST_HW_V220.EFFECTIVE_DATE     :WRK_INDNULL          50450000
         ,:CURSOR_INST_HW_V220.END_DATE           :WRK_INDNULL          50460000
         ,:CURSOR_INST_HW_V220.WARRANTY_EXP_DATE  :WRK_INDNULL          50470000
                                                      /* SOC RB01281 */ 50480000
         ,:CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY :WRK_INDNULL          50490000
         ,:CURSOR_INST_HW_V220.F_SPLT_DATE        :WRK_INDNULL          50500000
                                                      /* EOC RB01281 */ 50510000
         ,:CURSOR_INST_HW_V220.SERVICE_LVL_CODE_2 :WRK_SLC2_V220_IND    50520000
                                                       /* SOC RB01320 */50530000
         ,:WRK_BAU_REAL_SERIAL_NO_V125  :WRK_BAU_REAL_SERIAL_NO_V125_IND50540000
                                                       /* EOC RB01320 */50550000
       ;                                                                50560000
  SELECT (SQLCODE);                                                     50570000
   WHEN (0)                                                             50580000
     DO;                                                                50590000
       SWITCH_EOC_INST_HW = FALSE;                                      50600000
       SK_INST_HW.EOF             = '0';                                50610000
       SK_INST_HW.PRODUCT_TYPE    = CURSOR_INST_HW_V190.PRODUCT_TYPE;   50620000
       SK_INST_HW.ORIGIN          = CURSOR_INST_HW_V190.ORIGIN;         50630000
       SK_INST_HW.SEQUENCE_NUMBER = CURSOR_INST_HW_V190.SEQUENCE_NUMBER;50640000
                                                                        50650000
                                                      /* SOC RB01281 */ 50690000
       /* IDENTIFY RECORDS WITH FLEXIBLE WARRANTY   */                  50700000
                                                                        50710000
       IF (CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY ¬= '' &               50720000
                                                 /* SOC CEDS00000491 */ 50730000
     /*    CURSOR_INST_HW_V220.F_SPLT_DATE ¬= '') THEN */               50740000
           CURSOR_INST_HW_V220.F_SPLT_DATE ¬= '')                       50750000
         & (CURSOR_INST_HW_V220.F_SPLT_DATE <=                          50760000
                     CURSOR_INST_HW_V220.END_DATE) THEN                 50770000
                                                 /* EOC CEDS00000491 */ 50780000
       DO;                                                              50790000
                                                                        50800000
       /* SAVE THE ORIGINAL END DATE OF             */                  50810000
       /* THE FLEXIBLE WARRANTY RECORD              */                  50820000
                                                                        50830000
       WRK_FW_END_DATE_BAU = CURSOR_INST_HW_V220.END_DATE;              50840000
       WRK_END_DATE_SAVE   = CURSOR_INST_HW_V220.END_DATE;              50850000
                                                     /* CEDS00000491 */ 50860000
       /* IDENTIFY THE BRAND WARRANTY PERIOD IN THE */                  50870000
       /* CURRENT AND HISTORY SLOTS                 */                  50880000
       /* AND RESET THE END DATE WITH THE SPLIT DATE*/                  50890000
                                                                        50900000
       IF (WRK_RUN_DATE >= CURSOR_INST_HW_V220.EFFECTIVE_DATE &         50910000
                                                      /* SOC RB01298 */ 50920000
       /*  WRK_RUN_DATE <= CURSOR_INST_HW_V220.F_SPLT_DATE) | */        50930000
           WRK_RUN_DATE <  CURSOR_INST_HW_V220.F_SPLT_DATE) |           50940000
                                                      /* EOC RB01298 */ 50950000
                                                                        50960000
          (WRK_PERIOD_START_DATE >= CURSOR_INST_HW_V220.EFFECTIVE_DATE &50970000
           WRK_PERIOD_START_DATE <= CURSOR_INST_HW_V220.END_DATE) |     50980000
                                                                        50990000
          (WRK_PERIOD_START_DATE <= CURSOR_INST_HW_V220.EFFECTIVE_DATE &51000000
           WRK_RUN_DATE          >= CURSOR_INST_HW_V220.F_SPLT_DATE)    51010000
         THEN                                                           51020000
         DO;                                                            51030000
                                                 /* SOC CEDS00000491 */ 51040000
           IF CURSOR_INST_HW_V220.F_SPLT_DATE <                         51050000
                        CURSOR_INST_HW_V220.EFFECTIVE_DATE &            51060000
              CURSOR_INST_HW_V220.F_SPLT_DATE < WRK_RUN_DATE THEN       51070000
              DO;                                                       51080000
                SW_FW_PROCESS_BAU = '1'B;                               51090000
                PROCESS_BRAND_WARR = FALSE;                             51100000
              END;                                                      51110000
           ELSE                                  /* EOC CEDS00000491 */ 51120000
         /*  CURSOR_INST_HW_V220.END_DATE =           /* SOC RB01298 */ 51130000
         /*                         CURSOR_INST_HW_V220.F_SPLT_DATE; */ 51140000
              CURSOR_INST_HW_V220.END_DATE =                            51150000
                   R014_DATE_CALC(CURSOR_INST_HW_V220.F_SPLT_DATE,-1);  51160000
                                                      /* EOC RB01298 */ 51170000
         END;                                                           51180000
       END;                                                             51190000
                                                      /* EOC RB01281 */ 51200000
       SK_INST_HW.EFFECTIVE_DATE  =                                     51210000
                      R010_MAX_DATE(CURSOR_INST_HW_V170.EFFECTIVE_DATE  51220000
                                   ,CURSOR_INST_HW_V190.EFFECTIVE_DATE  51230000
                                   ,CURSOR_INST_HW_V220.EFFECTIVE_DATE);51240000
       SK_INST_HW.END_DATE        =                                     51250000
                      R011_MIN_DATE(CURSOR_INST_HW_V170.END_DATE        51260000
                                   ,CURSOR_INST_HW_V190.END_DATE        51270000
                                   ,CURSOR_INST_HW_V220.END_DATE);      51280000
                                                      /* SOC RB01290 */ 51290000
       IF (((CURSOR_INST_HW_V220.TYPE_OF_MAINT = '2') |                 51300000
            (CURSOR_INST_HW_V220.TYPE_OF_MAINT = 'A') |                 51310000
            (CURSOR_INST_HW_V220.TYPE_OF_MAINT = 'E') |   /* RB01308 */ 51320000
            (CURSOR_INST_HW_V220.TYPE_OF_MAINT = 'B'))&                 51330000
            (CURSOR_INST_HW_V220.SOURCE_INDICATOR = 'C')) THEN          51340000
         DO;                                                            51350000
           SWITCH_INTERNAL_MACHINE_CTR = TRUE;                          51360000
         END;                                         /* EOC RB01290 */ 51370000
     END;                                                               51380000
   WHEN (100)                                                           51390000
     DO;                                                                51400000
       SWITCH_EOC_INST_HW = TRUE;                                       51410000
       SK_INST_HW.EOF             = '1';                                51420000
     END;                                                               51430000
   OTHERWISE                                                            51440000
     DO;                                                                51450000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                51460000
                           'DB2',                                       51470000
                           '#050');                                     51480000
     END;                                                               51490000
 END;                                                                   51500000
                                                                        51510000
 END R609_FETCH_CURSOR_INST_HW;                                         51520000
1/*********************************************************************/51530000
 /*                                                                   */51540000
 /* MODULE NAME      :  R610_PROCESS_OO_HW                            */51550000
 /*                                                                   */51560000
 /* DESCRIPTION      :                                                */51570000
 /*                                                                   */51580000
 /*********************************************************************/51590000
 R610_PROCESS_OO_HW: PROC;                                              51600000
                                                                        51610000
 SWITCH_CURRENT_PERIOD_FOUND = TRUE;                                    51620000
                                                                        51630000
 FILE_RCBDRI1.IDEXRIF       = 'M362';                                   51640000
 FILE_RCBDRI1.TYPE          = SK_CURRENT_HW.PRODUCT_TYPE;               51650000
 FILE_RCBDRI1.SERNO         = SK_CURRENT_HW.ORIGIN||                    51660000
                                          SK_CURRENT_HW.SEQUENCE_NUMBER;51670000
 FILE_RCBDRI1.SERIAL_LNG    = WRK_OO_REAL_SERIAL_NO_V125;/* RB01320 */  51680000
 FILE_RCBDRI1.MOD           = CURSOR_OO_HW_V260.MODEL_NUMBER;           51690000
 FILE_RCBDRI1.CPUTYPE       = '0000';                                   51700000
 FILE_RCBDRI1.ICUSANO       = '000';                                    51710000
 STRING(FILE_RCBDRI1.MKBINA) = CURSOR_OO_HW_V260.INSTALLING_OU;         51720000
 FILE_RCBDRI1.ORDREF        = CURSOR_OO_HW_V260.ORDER_REF_NUMBER;       51730000
 FILE_RCBDRI1.TPAGR         = CURSOR_OO_HW_V260.TYPE_OF_AGREEMENT;      51740000
 FILE_RCBDRI1.DPSYSNO       = CURSOR_OO_HW_V260.DP_SYSTEM_NUMBER;       51750000
 FILE_RCBDRI1.DPIS          = '0';                                      51760000
                                                                        51770000
                                                                        51780000
                              /* FILL CURRENT PERIOD                 */ 51790000
 FILE_RCBDRI1.MKINSDAT = R013_TRANS_DATE(CURSOR_OO_HW_V260.ORDER_DATE); 51800000
 FILE_RCBDRI1.MKSCREMD =                                                51810000
                  R013_TRANS_DATE(CURSOR_OO_HW_V260.SCHED_REMOVAL_DATE);51820000
 FILE_RCBDRI1.SRCC0MD.EFFDATE =                                         51830000
                     R013_TRANS_DATE(SK_OO_HW.EFFECTIVE_DATE);          51840000
 FILE_RCBDRI1.SRCC0MD.ENDDATE =                                         51850000
                           R013_TRANS_DATE(SK_OO_HW.END_DATE);          51860000
 FILE_RCBDRI1.SRCC0MD.CUNOUSE    = CURSOR_OO_HW_V260.CUSTOMER_USER;     51870000
 FILE_RCBDRI1.SRCC0MD.BUDIV      = '2';                                 51880000
 FILE_RCBDRI1.SRCC0MD.BUCODE     = CURSOR_OO_HW_V260.OU_CODE;           51890000
 FILE_RCBDRI1.SRCC0MD.TAKE_CEDS  = 'N';                                 51900000
                                                                        51910000
                                                      /* SOC RC01158 */ 51920000
 /* TYPE OF WARRANTY HAS TO OVERRULE TYPE OF MAINTENANCE, IN CASE    */ 51930000
 /* BOTH ARE FILLED                                                  */ 51940000
 FILE_RCBDRI1.SRCC0MD.TPMNT = CURSOR_OO_HW_V260.TYPE_OF_MAINT;          51950000
 IF CURSOR_OO_HW_V260.TYPE_OF_WARRANTY ¬= ''                            51960000
  THEN                                                                  51970000
    DO;                                                                 51980000
      FILE_RCBDRI1.SRCC0MD.TPMNT = CURSOR_OO_HW_V260.TYPE_OF_WARRANTY;  51990000
    END;                                                                52000000
                                                      /* EOC RC01158 */ 52010000
                                                                        52020000
 END R610_PROCESS_OO_HW;                                                52030000
1/*********************************************************************/52040000
 /*                                                                   */52050000
 /* MODULE NAME      : R615_FETCH_TOC_TOM_RCB070       /* SOC RB01290 */52060000
 /*                                                                   */52070000
 /* DESCRIPTION      :                                                */52080000
 /*                                                                   */52090000
 /*********************************************************************/52100000
 R615_FETCH_TOC_TOM_RCB070: PROC;                                       52110000
                                                                        52120000
 TB_RCBV500   = '';                                                     52130000
 TB_RCBV500_I = '';                                                     52140000
 TB_RCBP70S.NUMBER   = 'RCB070';                                        52150000
 TB_RCBP70S.CTRYNO   = WRK_CTRYNO;                                      52160000
 TB_RCBP70S.TYPE_OF_CONTRACT   = TB_RCBV030.TYPE_OF_CONTRACT;           52170000
                                                                        52180000
 CALL RCBI50M ('U',                                                     52190000
               ADDR(TB_RCBV500),                                        52200000
               ADDR(TB_RCBV500_I),                                      52210000
               PTR_RETURN_AREA_BB,                                      52220000
               PTR_INT_AREA);                                           52230000
                                                                        52240000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    52250000
  WHEN (0)                                                              52260000
    DO;                                                                 52270000
      PARM_RCBP70S = TB_RCBP70S, BY NAME;                               52280000
      IF (PARM_RCBP70S.TOM_INTERNAL_CONTRACT ¬= '') THEN                52290000
        DO;                                                             52300000
          CURSOR_INST_HW_V220.TYPE_OF_MAINT =                           52310000
                                  PARM_RCBP70S.TOM_INTERNAL_CONTRACT;   52320000
        END;                                                            52330000
    END;                                                                52340000
  WHEN (4);                                                             52350000
  OTHERWISE                                                             52360000
    DO;                                                                 52370000
      CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),             52380000
                                  'DB2',                                52390000
                                  '#081');                              52400000
    END;                                                                52410000
 END;                                                                   52420000
                                                                        52430000
 END R615_FETCH_TOC_TOM_RCB070;                        /* EOC RB01290 */52440000
1/*********************************************************************/52450000
 /*                                                                   */52460000
 /* MODULE NAME      :  R619_FETCH_CURSOR_OO_HW                       */52470000
 /*                                                                   */52480000
 /* DESCRIPTION      :                                                */52490000
 /*                                                                   */52500000
 /*********************************************************************/52510000
 R619_FETCH_CURSOR_OO_HW: PROC;                                         52520000
                                                                        52530000
 CURSOR_OO_HW_V260 = '';                                                52540000
                                                       /* SOC RB01320 */52550000
 WRK_OO_REAL_SERIAL_NO_V125        = '';                                52560000
 WRK_OO_REAL_SERIAL_NO_V125_IND    = '';                                52570000
                                                       /* EOC RB01320 */52580000
                                                                        52590000
 EXEC SQL                                                               52600000
   FETCH CURSOR_OO_HW                                                   52610000
     INTO                                                               52620000
          :CURSOR_OO_HW_V260.PRODUCT_TYPE       :WRK_INDNULL            52630000
         ,:CURSOR_OO_HW_V260.ORIGIN             :WRK_INDNULL            52640000
         ,:CURSOR_OO_HW_V260.SEQUENCE_NUMBER    :WRK_INDNULL            52650000
         ,:CURSOR_OO_HW_V260.CUSTOMER_USER      :WRK_INDNULL            52660000
         ,:CURSOR_OO_HW_V260.MODEL_NUMBER       :WRK_INDNULL            52670000
         ,:CURSOR_OO_HW_V260.MARKET_RESP_CODE   :WRK_INDNULL            52680000
         ,:CURSOR_OO_HW_V260.INSTALLING_OU      :WRK_INDNULL            52690000
         ,:CURSOR_OO_HW_V260.ORDER_REF_NUMBER   :WRK_INDNULL            52700000
         ,:CURSOR_OO_HW_V260.TYPE_OF_WARRANTY   :WRK_INDNULL            52710000
         ,:CURSOR_OO_HW_V260.TYPE_OF_AGREEMENT  :WRK_INDNULL            52720000
         ,:CURSOR_OO_HW_V260.DP_SYSTEM_NUMBER   :WRK_INDNULL            52730000
         ,:CURSOR_OO_HW_V260.SCHED_REMOVAL_DATE :WRK_INDNULL            52740000
         ,:CURSOR_OO_HW_V260.OU_CODE            :WRK_INDNULL            52750000
         ,:CURSOR_OO_HW_V260.TYPE_OF_MAINT      :WRK_INDNULL            52760000
         ,:CURSOR_OO_HW_V260.ORDER_DATE         :WRK_INDNULL            52770000
         ,:CURSOR_OO_HW_V260.END_DATE           :WRK_INDNULL            52780000
                                                       /* SOC RB01320 */52790000
         ,:WRK_OO_REAL_SERIAL_NO_V125    :WRK_OO_REAL_SERIAL_NO_V125_IND52800000
                                                       /* EOC RB01320 */52810000
       ;                                                                52820000
                                                                        52830000
  SELECT (SQLCODE);                                                     52840000
   WHEN (0)                                                             52850000
     DO;                                                                52860000
       SWITCH_EOC_OO_HW = FALSE;                                        52870000
       SK_OO_HW.EOF               = '0';                                52880000
       SK_OO_HW.PRODUCT_TYPE      = CURSOR_OO_HW_V260.PRODUCT_TYPE;     52890000
       SK_OO_HW.ORIGIN            = CURSOR_OO_HW_V260.ORIGIN;           52900000
       SK_OO_HW.SEQUENCE_NUMBER =   CURSOR_OO_HW_V260.SEQUENCE_NUMBER;  52910000
       SK_OO_HW.EFFECTIVE_DATE    = CURSOR_OO_HW_V260.ORDER_DATE;       52920000
       SK_OO_HW.END_DATE          = CURSOR_OO_HW_V260.END_DATE;         52930000
     END;                                                               52950000
   WHEN (100)                                                           52960000
     DO;                                                                52970000
       SWITCH_EOC_OO_HW = TRUE;                                         52980000
       SK_OO_HW.EOF               = '1';                                52990000
     END;                                                               53000000
   OTHERWISE                                                            53010000
     DO;                                                                53020000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                53030000
                           'DB2',                                       53040000
                           '#051');                                     53050000
     END;                                                               53060000
 END;                                                                   53070000
                                                                        53080000
 END R619_FETCH_CURSOR_OO_HW;                                           53090000
                                                                        53100000
1/*********************************************************************/53110000
 /*                                                       SOC RC01158 */53120000
 /* MODULE NAME      :  R620_PROCESS_PI_PERIODS                       */53130000
 /*                                                                   */53140000
 /* DESCRIPTION      :                                                */53150000
 /*                                                                   */53160000
 /*********************************************************************/53170000
 R620_PROCESS_PI_PERIODS: PROC;                                         53180000
                                                        /* SOC RB01236*/53190000
 IF NUMBER_OF_DATES = 0                        /* SKIP AFTER 1ST PASS */53200000
 THEN DO;                                                               53210000
                           /* SAVE REAL OR DEFAULTED INVENTORY RECORD */53220000
   SAVED_HW_PI     = CURSOR_HW_PI, BY NAME;                             53230000
   IF WRK_PI_ORIGIN ¬= 'T241'                           /* PTM1414    */53240000
   THEN DO;                              /* ONLY IF T051 AVAILABLE !! */53250000
     SAV_SDF_IND       = WRK_SDF_IND;                                   53260000
     SAV_T051_SLC1_IND = WRK_T051_SLC1_IND;                             53270000
     SAV_T051_SLC2_IND = WRK_T051_SLC2_IND;                             53280000
     SAV_T051_SLCC_IND = WRK_T051_SLCC_IND;                             53290000
   END;                                                                 53300000
 END;                                                                   53310000
                                                       /* SOC RB01289 */53320000
 IF ((WRK_PI_ORIGIN = 'BOTH') | (WRK_PI_ORIGIN = 'T051'))               53330000
 THEN DO;                                                               53340000
   SELECT(CURSOR_HW_PI.SOURCE_INDICATOR);                               53350000
     WHEN('O')                                                          53360000
       DO;                                                              53370000
         IF (WRK_CUSTNO_V10_IND ¬= -1) THEN DO;                         53380000
            SAVED_HW_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V10;      53390000
 /*         USER_FILE_PI.ICUSANO        = ''         /* CEDS00000478  */53400000
            IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;   /* SOC RB01308 */53410000
              SAVED_HW_PI.OU_CODE       = WRK_OU_CODE_V170;             53420000
              USER_FILE_PI.ICUSANO      = '000';                        53430000
            END;                                       /* EOC RB01308 */53440000
            ELSE DO;                                    /* SOC RC01311*/53450000
    /*                                                    SOC RC01313 */53460000
    /*        CALL R350_RETR_CU_ENGG_OU(SAVED_HW_PI.CUSTOMER_NUMBER); */53470000
    /*        IF (TB_RCBV350.CU_ENGINEERING_OU ¬= '') THEN DO;        */53480000
    /*           SAVED_HW_PI.OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;  */53490000
    /*                                                    EOC RC01313 */53500000
                 USER_FILE_PI.ICUSANO = '000';                          53510000
    /*        END;                                            RC01313 */53520000
            END;                                        /* EOC RC01311*/53530000
         END;                                                           53540000
         ELSE DO;                                                       53550000
           IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;                      53560000
              SAVED_HW_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V190;   53570000
 /*           USER_FILE_PI.ICUSANO        = ''       /* CEDS00000478  */53580000
              IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO; /* SOC RB01308 */53590000
                SAVED_HW_PI.OU_CODE       = WRK_OU_CODE_V170;           53600000
                USER_FILE_PI.ICUSANO      = '000';                      53610000
              END;                                     /* EOC RB01308 */53620000
              ELSE DO;                                  /* SOC RC01311*/53630000
    /*                                                    SOC RC01313 */53640000
    /*         CALL R350_RETR_CU_ENGG_OU(SAVED_HW_PI.CUSTOMER_NUMBER);*/53650000
    /*          IF (TB_RCBV350.CU_ENGINEERING_OU ¬= '') THEN DO;      */53660000
    /*            SAVED_HW_PI.OU_CODE = TB_RCBV350.CU_ENGINEERING_OU; */53670000
    /*                                                    EOC RC01313 */53680000
                  USER_FILE_PI.ICUSANO = '000';                         53690000
    /*          END;                                          RC01313 */53700000
              END;                                      /* EOC RC01311*/53710000
           END;                                                         53720000
           ELSE DO;                                                     53730000
             IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                         53740000
                SAVED_HW_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V11;  53750000
           END;                                                         53760000
         END;                                                           53770000
       END;                                                             53780000
    /* WHEN('S') */                                    /* SOC RB01327 */53791000
       WHEN('S','D')                                   /* EOC RB01327 */53792000
       DO;                                                              53800000
         IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;                        53810000
            SAVED_HW_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V190;     53820000
 /*         USER_FILE_PI.ICUSANO        = ''         /* CEDS00000478  */53830000
            IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;   /* SOC RB01308 */53840000
              SAVED_HW_PI.OU_CODE       = WRK_OU_CODE_V170;             53850000
              USER_FILE_PI.ICUSANO      = '000';                        53860000
            END;                                       /* EOC RB01308 */53870000
            ELSE DO;                                    /* SOC RC01311*/53880000
    /*                                                    SOC RC01313 */53890000
    /*        CALL R350_RETR_CU_ENGG_OU(SAVED_HW_PI.CUSTOMER_NUMBER); */53900000
    /*        IF (TB_RCBV350.CU_ENGINEERING_OU ¬= '') THEN DO;        */53910000
    /*           SAVED_HW_PI.OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;  */53920000
    /*                                                    EOC RC01313 */53930000
                 USER_FILE_PI.ICUSANO = '000';                          53940000
    /*        END;                                            RC01313 */53950000
            END;                                        /* EOC RC01311*/53960000
         END;                                                           53970000
         ELSE DO;                                                       53980000
           IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                           53990000
             SAVED_HW_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V11;     54000000
         END;                                                           54010000
       END;                                                             54020000
       OTHERWISE                                                        54030000
       DO;                                                              54040000
         IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;                        54050000
           SAVED_HW_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V190;      54060000
 /*         USER_FILE_PI.ICUSANO        = ''         /* CEDS00000478  */54070000
           IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;    /* SOC RB01308 */54080000
             SAVED_HW_PI.OU_CODE       = WRK_OU_CODE_V170;              54090000
             USER_FILE_PI.ICUSANO      = '000';                         54100000
           END;                                        /* EOC RB01308 */54110000
           ELSE DO;                                     /* SOC RC01311*/54120000
    /*                                                    SOC RC01313 */54130000
    /*        CALL R350_RETR_CU_ENGG_OU(SAVED_HW_PI.CUSTOMER_NUMBER); */54140000
    /*        IF (TB_RCBV350.CU_ENGINEERING_OU ¬= '') THEN DO;        */54150000
    /*           SAVED_HW_PI.OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;  */54160000
    /*                                                    EOC RC01313 */54170000
                 USER_FILE_PI.ICUSANO = '000';                          54180000
    /*        END;                                            RC01313 */54190000
           END;                                         /* EOC RC01311*/54200000
         END;                                                           54210000
         ELSE DO;                                                       54220000
           IF (WRK_CUSTNO_V10_IND ¬= -1) THEN DO;                       54230000
             SAVED_HW_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V10;     54240000
 /*          USER_FILE_PI.ICUSANO        = ''        /* CEDS00000478  */54250000
    /*                                                    SOC RC01313 */54260000
    /*       IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;  /* SOC RB01308 */54270000
    /*         SAVED_HW_PI.OU_CODE       = WRK_OU_CODE_V170;          */54280000
    /*         USER_FILE_PI.ICUSANO      = '000';                     */54290000
    /*       END;                                      /* EOC RB01308 */54300000
    /*       ELSE DO;                                   /* SOC RC01311*/54310000
    /*        CALL R350_RETR_CU_ENGG_OU(SAVED_HW_PI.CUSTOMER_NUMBER); */54320000
    /*        IF (TB_RCBV350.CU_ENGINEERING_OU ¬= '') THEN DO;        */54330000
    /*           SAVED_HW_PI.OU_CODE = TB_RCBV350.CU_ENGINEERING_OU;  */54340000
    /*                                                    EOC RC01313 */54350000
               USER_FILE_PI.ICUSANO      = '000';                       54360000
    /*       END;                                             RC01313 */54370000
    /*      END;                            /*EOC RC01311*/ /*RC01313 */54380000
           END;                                                         54390000
         END;                                                           54400000
       END;                                                             54410000
     END;                                                               54420000
 END;                                                  /* EOC RB01289 */54430000
                                                                        54440000
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_PI_HW);                         54450000
 SAV_PI_ORIGIN = WRK_PI_ORIGIN;                                         54460000
                                                        /* EOC RB01236*/54470000
 C_EFF = CURSOR_CTR_PI.EFFECTIVE_DATE;                                  54480000
 C_END = CURSOR_CTR_PI.END_DATE;                                        54490000
 W_EFF = CURSOR_HW_PI.INSTALL_DATE;                                     54500000
 IF W_EFF > WRK_RUN_DATE THEN                                           54510000
   W_EFF = WRK_RUN_DATE ;                                  /* PTM1313 */54520000
 W_SPL = CURSOR_HW_PI.WARRANTY_SPLT_DATE;                  /* RC01194 */54530000
 W_END = CURSOR_HW_PI.WARRANTY_EXP_DATE;                                54540000
                                                                        54550000
 SELECT(SAV_PI_ORIGIN);                                                 54560000
                                                                        54570000
   WHEN ('T051') DO;                                                    54580000
     IF CURSOR_HW_PI.TYPE_OF_WARRANTY ¬= ''                             54590000
     THEN DO;                                                           54600000
       CALL R520_FILL_DATE_TABLE_FROM_T051;                /* RC01194 */54610000
                                                           /* RA01224 */54620000
       /* KEEP PER-CALLS FOR 5 YEARS IF CISCO OR INTERNAL */            54630000
       /* KEEP PER-CALLS FOR 6 YEARS IF ANYTHING ELSE     */            54640000
       /* THIS ALLOWS FOR 3 YEARS AFER BASE WARRANTY HAS  */            54650000
       /* ENDED, AS MOST WARRANTIES ARE FOR 3 YEARS       */            54660000
                                                                        54670000
       IF SUBSTR(CURSOR_HW_PI.CUSTOMER_NUMBER,1,2) = 'CI' |             54680000
          SUBSTR(CURSOR_HW_PI.CUSTOMER_NUMBER,3,2) = '99'               54690000
       THEN                                                             54700000
         H_END = R014_DATE_CALC(W_EFF, 1825);                           54710000
       ELSE                                                             54720000
         H_END = R014_DATE_CALC(W_EFF, 2190);              /* RC01234 */54730000
       IF H_END > W_END                                                 54740000
       THEN                                                             54750000
         SW_ADD_H_END = '1'B;                              /* RB01236 */54760000
       ELSE                                                             54770000
         SW_ADD_H_END = '0'B;                              /* RB01236 */54780000
     END;                                                               54790000
   END;                                                                 54800000
                                                                        54810000
   WHEN ('T241') DO;                                                    54820000
     IF (WRK_CUSTNO_V51_IND = -1) THEN                     /* RB01289 */54830000
       SAVED_HW_PI.CUSTOMER_NUMBER = '';                   /* RB01289 */54840000
     CALL R521_FILL_DATE_TABLE_FROM_T241;                  /* RC01194 */54850000
   END;                                                                 54860000
                                                                        54870000
   WHEN ('BOTH') DO;                                                    54880000
     IF CURSOR_HW_PI.TYPE_OF_WARRANTY = ''                              54890000
     THEN DO;                          /* NO WARRANTY                 */54900000
       CALL R521_FILL_DATE_TABLE_FROM_T241;                /* RC01194 */54910000
       H_END = C_END ;                 /* PREVENT USE                 */54920000
     END;                                                               54930000
     ELSE DO;                          /* WARRANTY AND SERVICE        */54940000
       IF NUMBER_OF_DATES > 0 THEN;    /* SKIP AFTER 1ST PASS. RB01236*/54950000
                                                                        54960000
       ELSE DO;                                                         54970000
         CALL R520_FILL_DATE_TABLE_FROM_T051;          /* SOC RC01194 */54980000
                                                           /* RA01224 */54990000
         /* KEEP PER-CALLS FOR 5 YEARS IF CISCO OR INTERNAL */          55000000
         /* KEEP PER-CALLS FOR 6 YEARS IF ANYTHING ELSE     */          55010000
         /* THIS ALLOWS FOR 3 YEARS AFER BASE WARRANTY HAS  */          55020000
         /* ENDED, AS MOST WARRANTIES ARE FOR 3 YEARS       */          55030000
         IF SUBSTR(CURSOR_HW_PI.CUSTOMER_NUMBER,1,2) = 'CI' |           55040000
            SUBSTR(CURSOR_HW_PI.CUSTOMER_NUMBER,3,2) = '99'             55050000
         THEN                                                           55060000
           H_END = R014_DATE_CALC(W_EFF, 1825);                         55070000
         ELSE                                                           55080000
           H_END = R014_DATE_CALC(W_EFF, 2190);            /* RC01234 */55090000
       END;                                                             55100000
                                                                        55110000
       IF C_END >= W_EFF               /* SERV. END AFTER WARR. START */55120000
       THEN DO;                                                         55130000
         IF C_EFF < W_EFF              /* SERV. START BEF. WARR. START*/55140000
         THEN DO;                                                       55150000
           C_EFF  = W_EFF;                                              55160000
         END;                                                           55170000
         CALL R521_FILL_DATE_TABLE_FROM_T241;                           55180000
       END;                                                             55190000
     END;                                                               55200000
                                                                        55210000
     IF (H_END > W_END) & (H_END > C_END)                               55220000
     THEN                                                               55230000
       SW_ADD_H_END = '1'B;                                /* RB01236 */55240000
     ELSE                                                               55250000
       SW_ADD_H_END = '0'B;        /* RESET EARLIER SETTING!! RB01236 */55260000
                                                      /*  EOC RC01194 */55270000
   END;                                                                 55280000
   OTHERWISE;                                                           55290000
 END;                                                                   55300000
                                                                        55310000
 END R620_PROCESS_PI_PERIODS;                          /* EOC RC01158 */55320000
 /*********************************************************************/55330000
 /* THIS PROC IS COMMENTED OUT AS PART OF RC01313         SOC RC01313 */55340000
 /*                                                       SOC RC01311 */55350000
 /* MODULE NAME      : R350_RETR_CU_ENGG_OU                           */55360000
 /*                                                                   */55370000
 /* DESCRIPTION      : RETRIEVE CU ENGINEERING OU CODE FROM TABLE     */55380000
 /*                    RCBT0350_CUST_MOD WHEN OU CODE COULD NOT BE    */55390000
 /*                    DETERMINED FROM TABLE RCBT0170_OU_HW           */55400000
 /*                                                                   */55410000
 /*********************************************************************/55420000
 /*R350_RETR_CU_ENGG_OU: PROC(CUSTOMER_NO);                             55430000
                                                                        55440000
                                        /* RETRIEVE CU ENGINEERING OU */55450000
 /*TB_RCBV350 = '';                                                   */55460000
 /*DCL CUSTOMER_NO CHAR(08);                                          */55470000
                                                                        55480000
 /* EXEC SQL                                                          */55490000
 /*SELECT CU_ENGINEERING_OU                             CEDS00000548  */55500000
 /*SELECT T350.CU_ENGINEERING_OU                     /* CEDS00000548  */55510000
 /*INTO :TB_RCBV350.CU_ENGINEERING_OU      :WRK_INDNULL                 55520000
 /*FROM RCBV0350_CUST_MOD                           SOC CEDS00000548  */55530000
 /*WHERE COUNTRY_NUMBER      = :WRK_CTRYNO                            */55540000
 /*AND CUSTOMER_NUMBER       = :CUSTOMER_NO                           */55550000
 /*AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                         */55560000
 /*                    AND END_DATE                                   */55570000
 /*FROM RCBV0350_CUST_MOD T350,                                         55580000
        RCBV0040_OU       T40                                           55590000
   WHERE T350.COUNTRY_NUMBER = :WRK_CTRYNO                              55600000
   AND T350.CUSTOMER_NUMBER  = :CUSTOMER_NO                             55610000
   AND :WRK_RUN_DATE   BETWEEN T350.EFFECTIVE_DATE                      55620000
                       AND T350.END_DATE                                55630000
   AND T40.COUNTRY_NUMBER    = T350.COUNTRY_NUMBER                      55640000
   AND T40.OU_CODE           = T350.CU_ENGINEERING_OU                   55650000
   AND :WRK_RUN_DATE   BETWEEN T40.EFFECTIVE_DATE                       55660000
                       AND T40.END_DATE  ;        /* EOC CEDS00000548 */55670000
 /*SELECT(SQLCODE);                                                     55680000
   WHEN(0);                                                             55690000
   WHEN(100);                                                           55700000
   OTHERWISE                                                            55710000
     DO;                                                                55720000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),'DB2','#078');                  55730000
     END;                                                               55740000
 END;                                                                   55750000
 END R350_RETR_CU_ENGG_OU;*/                           /* EOC RC01311 */55760000
 /*                                                       EOC RC01313 */55770000
1/*********************************************************************/55780000
 /*                                                       SOC RC01158 */55790000
 /* MODULE NAME      :  R621_PROCESS_USER_EXIT                        */55800000
 /*                                                                   */55810000
 /* DESCRIPTION      :                                                */55820000
 /*                                                                   */55830000
 /*********************************************************************/55840000
 R621_PROCESS_USER_EXIT: PROC;                                          55850000
 SAVE_AAS_ADD = FILE_RCBDRI1_AAS_ADD;                                   55860000
                                                                        55870000
 SAVE_TYPESER = STRING(FILE_RCBDRI1.TYPESER);                           55880000
                                                      /* SOC RB01308 */ 55890000
              /* COMMENTED OUT, IT IS HANDLED IN R730_APPLY_PRIORITY */ 55900000
 /* FILE_RCBDRI1.SRCC0MD.PI_PRIORITY,                                   55910000
 USER_FILE_PI.SRCC0MD.PI_PRIORITY,                                      55920000
 USER_FILE_BAU.SRCC0MD.PI_PRIORITY = 'N';                               55930000
 DO I = 1 TO 4;                                                         55940000
   FILE_RCBDRI1.HF_SLOT(I).PI_PRIORITY,                                 55950000
   USER_FILE_PI.HF_SLOT(I).PI_PRIORITY,                                 55960000
   USER_FILE_BAU.HF_SLOT(I).PI_PRIORITY = 'N';                          55970000
 END; */                                              /* EOC RB01308 */ 55980000
 USER_FILE_RCBDRI1 = FILE_RCBDRI1, BY NAME;                             55990000
                                           /* SOC RA01224     */        56000000
                                                      /* SOC RB01308 */ 56010000
 /*IF DATA_ORIGIN = '2'                                                 56020000
 /*THEN DO;                                                             56030000
              /* COMMENTED OUT, IT IS HANDLED IN R730_APPLY_PRIORITY */ 56040000
 /*CALL R624_CHECK_PI_PRIORITY;                           /* PTM1414 */ 56050000
           /* COMMENTED OUT, IT IS HANDLED IN R531_CHECK_SLOT_VALUES */ 56060000
 /*                                                                     56070000
 /*IF SUBSTR(USER_FILE_RCBDRI1.SRCC0MD.CUNOUSE,1,2) = 'CI'              56080000
 /*THEN DO;                                                             56090000
 /*  USER_FILE_RCBDRI1.SRCC0MD.CUNOUSE   =                              56100000
 /*                             USER_FILE_BAU.SRCC0MD.CUNOUSE;          56110000
 /*  USER_FILE_RCBDRI1.SRCC0MD.BUDIV     =                              56120000
 /*                             USER_FILE_BAU.SRCC0MD.BUDIV;            56130000
 /*  USER_FILE_RCBDRI1.SRCC0MD.BUCODE    =                              56140000
 /*                             USER_FILE_BAU.SRCC0MD.BUCODE;           56150000
 /*END; */                                                              56160000
 /*END; */                                            /* EOC RB01308 */ 56170000
                                           /* EOC RA01224   */          56180000
                                                                        56190000
 IF SWITCH_USER_EXIT = TRUE                                             56200000
 THEN DO;                                                               56210000
                                                                        56220000
   CALL RCBDRAU (ADDR(SWITCH_USER_EXIT)                                 56230000
                ,ADDR(DATA_ORIGIN)                                      56240000
                ,ADDR(USER_FILE_RCBDRI1)                                56250000
                ,ADDR(USER_FILE_PI)                                     56260000
                ,ADDR(USER_FILE_BAU)                                    56270000
                ,PTR_INT_AREA);                                         56280000
                                                                        56290000
 END;                                                                   56300000
                                                                        56310000
 FILE_RCBDRI1 = USER_FILE_RCBDRI1, BY NAME;                             56320000
                                                                        56330000
 /* THE TOS IS NOT ALLOWED TO BE OVERWRITTEN ! */                       56340000
 STRING(FILE_RCBDRI1.TYPESER) = SAVE_TYPESER;                           56350000
                                                                        56360000
 /* THE AAS_ADD IS NOT ALLOWED TO BE OVERWRITTEN ! */                   56370000
 FILE_RCBDRI1_AAS_ADD = SAVE_AAS_ADD;                                   56380000
                                                                        56390000
 END R621_PROCESS_USER_EXIT;                           /* EOC RC01158 */56400000
1/*********************************************************************/56410000
 /*                                                       SOC RB01308 */56420000
 /* THIS PROC IS COMMENTED OUT AS PART OF RB01308 AND THE LOGIC IS    */56430000
 /* HANDLED IN R730_APPLY_PRIORITY                                    */56440000
 /*                                                       SOC PTM1414 */56450000
 /* MODULE NAME      :  R624_CHECK_PI_PRIORITY                        */56460000
 /*                                                                   */56470000
 /* DESCRIPTION      :                                                */56480000
 /*                                                                   */56490000
 /*********************************************************************/56500000
 /*R624_CHECK_PI_PRIORITY: PROC;                                        56510000
                                                                        56520000
 /* -------    PREFER PI IF BAU HAS STATUS 3 AND PI NOT  ------- */     56530000
                                                                        56540000
 /*IF VERIFY(USER_FILE_BAU.SRCC0MD.TPMNT,             /* CURRENT BAU  */56550000
 /*          WRK_TPMNT_VAL.TPMNT_ST3) = '0'                             56560000
 /*THEN DO;                                                             56570000
 /*  IF VERIFY(USER_FILE_PI.SRCC0MD.TPMNT,                              56580000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0'         /* CURRENT PI   */56590000
 /*                                                   /* SOC RB01298  */56600000
 /* | (WRK_CNT_FUT_PI > 0                                               56610000
 /*    &                                                                56620000
 /*    USER_FILE_BAU.SRCC0MD.ENDDATE >                                  56630000
 /*         USER_FILE_PI.HF_SLOT(3).EFFDATE      /* BAU OVERLAP WITH:*/ 56640000
 /*    &                                                                56650000
 /*    VERIFY(USER_FILE_PI.HF_SLOT(3).TPMNT,         /* FUTURE_1 PI  */ 56660000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                          56670000
 /* | (WRK_CNT_FUT_PI > 1                                               56680000
 /*    &                                                                56690000
 /*    USER_FILE_BAU.SRCC0MD.ENDDATE >                                  56700000
 /*         USER_FILE_PI.HF_SLOT(4).EFFDATE      /* BAU OVERLAP WITH:*/ 56710000
 /*    &                                                                56720000
 /*    VERIFY(USER_FILE_PI.HF_SLOT(4).TPMNT,         /* FUTURE_2 PI  */ 56730000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')          EOC RB01298  */ 56740000
 /*THEN DO;                                                             56750000
 /*  IF PARM_RCB005.PI_TO_RCMS = 'N'                                    56760000
 /*  THEN DO;                                                           56770000
 /*    USER_FILE_BAU.SRCC0MD.PI_PRIORITY     = 'Y';                     56780000
 /*    USER_FILE_RCBDRI1.SRCC0MD.PI_PRIORITY = 'Y';                     56790000
 /*  END;                                                               56800000
 /*  ELSE DO;                                                           56810000
 /*    /*****************************************************/          56820000
 /*    /* CHANGE DEFAULT IF PI GIVES WARRANTY OR CONTRACT     */        56830000
 /*    /*    AND BAU GIVES PER CALL                           */        56840000
 /*    /*****************************************************/          56850000
 /*    USER_FILE_RCBDRI1= USER_FILE_PI, BY NAME ;                       56860000
 /*  END;                                                               56870000
 /*END;                                                                 56880000
 /*END;                                                                 56890000
 /*                                                                     56900000
 /*IF WRK_CNT_FUT_PERIODS > 0                                           56910000
 /*   &                                                                 56920000
 /*  VERIFY(USER_FILE_BAU.HF_SLOT(3).TPMNT,           /* FUTURE_1 BAU */56930000
 /*            WRK_TPMNT_VAL.TPMNT_ST3) = '0'                           56940000
 /*THEN DO;                                                             56950000
 /*  IF (USER_FILE_BAU.HF_SLOT(3).EFFDATE <                             56960000
 /*         USER_FILE_PI.SRCC0MD.ENDDATE         /* BAU OVERLAP WITH:*/ 56970000
 /*    &                                                                56980000
 /*    VERIFY(USER_FILE_PI.SRCC0MD.TPMNT,             /* CURRENT PI  */ 56990000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                          57000000
 /* | (WRK_CNT_FUT_PI > 0                                               57010000
 /*    &                                                                57020000
 /*    USER_FILE_BAU.HF_SLOT(3).EFFDATE <                               57030000
 /*         USER_FILE_PI.HF_SLOT(3).ENDDATE                             57040000
 /*    &                                                                57050000
 /*    USER_FILE_BAU.HF_SLOT(3).ENDDATE >                               57060000
 /*         USER_FILE_PI.HF_SLOT(3).EFFDATE      /* BAU OVERLAP WITH:*/ 57070000
 /*    &                                                                57080000
 /*    VERIFY(USER_FILE_PI.HF_SLOT(3).TPMNT,         /* FUTURE_1 PI  */ 57090000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                          57100000
 /* | (WRK_CNT_FUT_PI > 1                                               57110000
 /*    &                                                                57120000
 /*    USER_FILE_BAU.HF_SLOT(3).EFFDATE <                               57130000
 /*         USER_FILE_PI.HF_SLOT(4).ENDDATE                             57140000
 /*    &                                                                57150000
 /*    USER_FILE_BAU.HF_SLOT(3).ENDDATE >                               57160000
 /*         USER_FILE_PI.HF_SLOT(4).EFFDATE      /* BAU OVERLAP WITH:*/ 57170000
 /*    &                                                                57180000
 /*    VERIFY(USER_FILE_PI.HF_SLOT(4).TPMNT,         /* FUTURE_2 PI  */ 57190000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                          57200000
 /*THEN DO;                                                             57210000
 /*  IF PARM_RCB005.PI_TO_RCMS = 'N'                                    57220000
 /*  THEN DO;                                                           57230000
 /*    USER_FILE_BAU.HF_SLOT(3).PI_PRIORITY     = 'Y';                  57240000
 /*    USER_FILE_RCBDRI1.HF_SLOT(3).PI_PRIORITY = 'Y';                  57250000
 /*  END;                                                               57260000
 /*  ELSE DO;                                                           57270000
 /*    /*******************************************************/        57280000
 /*    /* NOTHING: NOT THE CURRENT SLOT, SO NO DEFAULT CHANGE */        57290000
 /*    /*******************************************************/        57300000
 /*  END;                                                               57310000
 /*END;                                                                 57320000
 /*END;                                                                 57330000
 /*                                                                     57340000
 /*IF WRK_CNT_FUT_PERIODS > 1                                           57350000
 /*   &                                                                 57360000
 /*  VERIFY(USER_FILE_BAU.HF_SLOT(4).TPMNT,           /* FUTURE_2 BAU */57370000
 /*            WRK_TPMNT_VAL.TPMNT_ST3) = '0'                           57380000
 /*THEN DO;                                                             57390000
 /*  IF (USER_FILE_BAU.HF_SLOT(4).EFFDATE <                             57400000
 /*         USER_FILE_PI.SRCC0MD.ENDDATE         /* BAU OVERLAP WITH:*/ 57410000
 /*    &                                                                57420000
 /*    VERIFY(USER_FILE_PI.SRCC0MD.TPMNT,             /* CURRENT PI  */ 57430000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                          57440000
 /* | (WRK_CNT_FUT_PI > 0                                               57450000
 /*    &                                                                57460000
 /*    USER_FILE_BAU.HF_SLOT(4).EFFDATE <                               57470000
 /*         USER_FILE_PI.HF_SLOT(3).ENDDATE                             57480000
 /*    &                                                                57490000
 /*    USER_FILE_BAU.HF_SLOT(4).ENDDATE >                               57500000
 /*         USER_FILE_PI.HF_SLOT(3).EFFDATE      /* BAU OVERLAP WITH:*/ 57510000
 /*    &                                                                57520000
 /*    VERIFY(USER_FILE_PI.HF_SLOT(3).TPMNT,         /* FUTURE_1 PI  */ 57530000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                          57540000
 /* | (WRK_CNT_FUT_PI > 1                                               57550000
 /*    &                                                                57560000
 /*    USER_FILE_BAU.HF_SLOT(4).EFFDATE <                               57570000
 /*         USER_FILE_PI.HF_SLOT(4).ENDDATE                             57580000
 /*    &                                                                57590000
 /*    USER_FILE_BAU.HF_SLOT(4).ENDDATE >                               57600000
 /*         USER_FILE_PI.HF_SLOT(4).EFFDATE      /* BAU OVERLAP WITH:*/ 57610000
 /*    &                                                                57620000
 /*    VERIFY(USER_FILE_PI.HF_SLOT(4).TPMNT,         /* FUTURE_2 PI  */ 57630000
 /*           WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                          57640000
 /*THEN DO;                                                             57650000
 /*  IF PARM_RCB005.PI_TO_RCMS = 'N'                                    57660000
 /*  THEN DO;                                                           57670000
 /*    USER_FILE_BAU.HF_SLOT(4).PI_PRIORITY     = 'Y';                  57680000
 /*    USER_FILE_RCBDRI1.HF_SLOT(4).PI_PRIORITY = 'Y';                  57690000
 /*  END;                                                               57700000
 /*  ELSE DO;                                                           57710000
 /*    /*******************************************************/        57720000
 /*    /* NOTHING: NOT THE CURRENT SLOT, SO NO DEFAULT CHANGE */        57730000
 /*    /*******************************************************/        57740000
 /*    END;                                                             57750000
 /*  END;                                                               57760000
 /*END;                                                                 57770000
 /*                                                                     57780000
 /* -----    PREFER PI IF BAU HAS WARRANTY AND PI A CONTRACT  -----  */ 57790000
 /*                                                                     57800000
 /*                                              /* SOC CEDS00000497 */ 57810000
 /*                                                                     57820000
 /*IF (VERIFY(USER_FILE_BAU.SRCC0MD.TPMNT,           /* CURRENT BAU  */ 57830000
 /*             WRK_TPMNT_VAL.TPMNT_WAR) = '0'                          57840000
 /*                                              /* SOC CEDS00000438 */ 57850000
 /* | VERIFY(CURSOR_HW_PI.F_TYPE_OF_WARRANTY,              /*RB01281*/  57860000
 /*                                                    /* SOC RB01298 */57870000
 /* | VERIFY(SAVED_HW_PI.F_TYPE_OF_WARRANTY,     /* EOC CEDS00000438 */ 57880000
 /*   SUBSTR(PARM_RCB063S.F_WARRANTY_MACHINE,1,1)) = 0       /*RB01281*/57890000
 /*| VERIFY(USER_FILE_BAU.SRCC0MD.TPMNT,                                57900000
 /*                             WRK_FW_TOW) = '0'                       57910000
 /*| VERIFY(USER_FILE_BAU.SRCC0MD.TPMNT,                                57920000
 /*                             WRK_HB_TOM) = '0')     /* EOC RB01298 */57930000
 /* & (SWITCH_PIWARR_BAUCTR = FALSE)                 /* CEDS00000487 */ 57940000
 /* THEN DO;                                                            57950000
 /*    IF (CURRENT_BAU_CTR_FLAG = FALSE) THEN DO;                       57960000
 /*                                                  /* SOC RB01298  */ 57970000
 /*IF USER_FILE_PI.SRCC0MD.IAGRNBR ¬= ''             /* CURRENT PI   */ 57980000
 /*IF (USER_FILE_PI.SRCC0MD.IAGRNBR ¬= ''                               57990000
 /*    &                                                                58000000
 /*    USER_FILE_PI.SRCC0MD.IAGRNBR ¬= 'HARDBUNDLE')                    58010000
 /* | (WRK_CNT_FUT_PI > 0                                               58020000
 /*    &                                                                58030000
 /*    USER_FILE_BAU.SRCC0MD.ENDDATE >                                  58040000
 /*         USER_FILE_PI.HF_SLOT(3).EFFDATE      /* BAU OVERLAP WITH:*/ 58050000
 /*    &                                                                58060000
 /*    USER_FILE_PI.HF_SLOT(3).IAGRNBR ¬= '')        /* FUTURE_1 PI  */ 58070000
 /* | (WRK_CNT_FUT_PI > 1                                               58080000
 /*    &                                                                58090000
 /*    USER_FILE_BAU.SRCC0MD.ENDDATE >                                  58100000
 /*         USER_FILE_PI.HF_SLOT(4).EFFDATE      /* BAU OVERLAP WITH:*/ 58110000
 /*    &                                                                58120000
 /*    USER_FILE_PI.HF_SLOT(4).IAGRNBR ¬= '')        /* FUTURE_2 PI  */ 58130000
 /*                                                  /* EOC RB01298  */ 58140000
 /*THEN DO;                                                             58150000
 /*  IF PARM_RCB005.PI_TO_RCMS = 'N'                                    58160000
 /*  THEN DO;                                                           58170000
 /*    USER_FILE_BAU.SRCC0MD.PI_PRIORITY     = 'Y';                     58180000
 /*    USER_FILE_RCBDRI1.SRCC0MD.PI_PRIORITY = 'Y';                     58190000
 /*  END;                                                               58200000
 /*  ELSE DO;                                                           58210000
 /*    /*****************************************************/          58220000
 /*    /* CHANGE DEFAULT IF PI GIVES CONTRACT AND BAU GIVES */          58230000
 /*    /*    BASE WARRANTY                                    */        58240000
 /*    /*****************************************************/          58250000
 /*                                                  /* SOC RB01298 */  58260000
 /*    /* WHEN THE MACHINE IS EFFECTIVE UNDER BAU WARRANTY AND      */  58270000
 /*    /* PI CONTRACT THEN WARRANTY,START DATE AND END DATE         */  58280000
 /*    /* SHOULD BE FROM BAU                                        */  58290000
 /*    USER_FILE_PI.SRCC0MD.TPMNT    =  USER_FILE_BAU.SRCC0MD.TPMNT;    58300000
 /*    USER_FILE_PI.MKINSDAT         =  USER_FILE_BAU.MKINSDAT;         58310000
 /*    USER_FILE_PI.WED              =  USER_FILE_BAU.WED;              58320000
 /*    USER_FILE_PI.SRCC0MD.EFFDATE  =  USER_FILE_BAU.SRCC0MD.EFFDATE;  58330000
 /*    USER_FILE_PI.SRCC0MD.ENDDATE  =  USER_FILE_BAU.SRCC0MD.ENDDATE;  58340000
 /*                                                   /* EOC RB01298 */ 58350000
 /**   USER_FILE_RCBDRI1 = USER_FILE_PI, BY NAME ;                      58360000
 /*    END;                                                             58370000
 /*  END;                                                               58380000
 /*END; */                                                              58390000
 /*                                                                     58400000
                                                      /* SOC RB01298 */ 58410000
 /* WHEN THE MACHINE IS EFFECTIVE UNDER PI WARRANTY AND BAU CONTRACT */ 58420000
 /* THE WARRANTY,START DATE AND END DATE FROM PI                     */ 58430000
 /* IF SWITCH_PIWARR_BAUCTR */                   /* SOC CEDS00000494 */ 58440000
 /*                                                                     58450000
 /*IF SWITCH_PIWARR_BAUCTR & CURRENT_BAU_CTR_FLAG/* EOC CEDS00000494 */ 58460000
 /*THEN DO;                                                             58470000
 /*USER_FILE_BAU.MKINSDAT             =  USER_FILE_PI.MKINSDAT;         58480000
 /*USER_FILE_BAU.WED                  =  USER_FILE_PI.WED;              58490000
 /*USER_FILE_BAU.SRCC0MD.EFFDATE      =  USER_FILE_PI.SRCC0MD.EFFDATE;  58500000
 /*USER_FILE_BAU.SRCC0MD.ENDDATE      =  USER_FILE_PI.SRCC0MD.ENDDATE;  58510000
 /*USER_FILE_RCBDRI1.MKINSDAT         =  USER_FILE_PI.MKINSDAT;         58520000
 /*USER_FILE_RCBDRI1.WED              =  USER_FILE_PI.WED;              58530000
 /*USER_FILE_RCBDRI1.SRCC0MD.EFFDATE  =  USER_FILE_PI.SRCC0MD.EFFDATE;  58540000
 /*USER_FILE_RCBDRI1.SRCC0MD.ENDDATE  =  USER_FILE_PI.SRCC0MD.ENDDATE;  58550000
 /*IF PARM_RCB005.PI_TO_RCMS = 'N'                                      58560000
 /*THEN DO;                                                             58570000
 /*    USER_FILE_BAU.SRCC0MD.PI_PRIORITY     = 'Y';                     58580000
 /*    USER_FILE_RCBDRI1.SRCC0MD.PI_PRIORITY = 'Y';                     58590000
 /*  END;                                                               58600000
 /*END;                                               /* EOC RB01298 */ 58610000
 /*IF (VERIFY(USER_FILE_BAU.SRCC0MD.TPMNT,WRK_TPMNT_VAL.TPMNT_WAR) = 0  58620000
 /*  | VERIFY(USER_FILE_BAU.SRCC0MD.TPMNT,WRK_FW_TOW) = 0               58630000
 /*  | VERIFY(USER_FILE_BAU.SRCC0MD.TPMNT, WRK_HB_TOM) = 0) THEN        58640000
 /*DO;                                                                  58650000
 /* IF (CURRENT_BAU_CTR_FLAG = FALSE) THEN                              58660000
 /* DO;                                                                 58670000
 /*    IF (USER_FILE_PI.SRCC0MD.IAGRNBR ¬= ''                           58680000
 /*      & USER_FILE_PI.SRCC0MD.IAGRNBR ¬= 'HARDBUNDLE')   THEN         58690000
 /*    DO;                                                              58700000
 /*     IF PARM_RCB005.PI_TO_RCMS = 'N' THEN                            58710000
 /*     DO;                                                             58720000
 /*       USER_FILE_BAU.SRCC0MD.PI_PRIORITY     = 'Y';                  58730000
 /*       USER_FILE_RCBDRI1.SRCC0MD.PI_PRIORITY = 'Y';                  58740000
 /*     END;                                                            58750000
 /*     ELSE                                                            58760000
 /*     DO;                                                             58770000
 /*     /*****************************************************/         58780000
 /*     /* CHANGE DEFAULT IF PI GIVES CONTRACT AND BAU GIVES */         58790000
 /*     /*    BASE WARRANTY                                  */         58800000
 /*     /*****************************************************/         58810000
 /*     /* WHEN THE MACHINE IS EFFECTIVE UNDER BAU WARRANTY AND      */ 58820000
 /*     /* PI CONTRACT THEN WARRANTY,START DATE AND END DATE         */ 58830000
 /*     /* SHOULD BE FROM BAU                                        */ 58840000
 /*      USER_FILE_PI.SRCC0MD.TPMNT    =  USER_FILE_BAU.SRCC0MD.TPMNT;  58850000
 /*      USER_FILE_PI.MKINSDAT         =  USER_FILE_BAU.MKINSDAT;       58860000
 /*      USER_FILE_PI.WED              =  USER_FILE_BAU.WED;            58870000
 /*      USER_FILE_PI.SRCC0MD.EFFDATE  =  USER_FILE_BAU.SRCC0MD.EFFDATE;58880000
 /*      USER_FILE_PI.SRCC0MD.ENDDATE  =  USER_FILE_BAU.SRCC0MD.ENDDATE;58890000
 /*                                                   /* SOC RB01301 */ 58900000
 /*      USER_FILE_PI.SERV_EXTENSION   =  USER_FILE_BAU.SERV_EXTENSION; 58910000
 /*      USER_FILE_PI.BASE_WARRANTY_SLC =                               58920000
 /*                                    USER_FILE_BAU.BASE_WARRANTY_SLC; 58930000
 /*                                                   /* EOC RB01301 */ 58940000
 /*      USER_FILE_RCBDRI1 = USER_FILE_PI, BY NAME ;                    58950000
 /*    END;                                                             58960000
 /*    END;                                                             58970000
 /*   END;                                                              58980000
 /*  END;                                                               58990000
 /*ELSE                                                                 59000000
 /*DO;                                                                  59010000
 /* CALL R403_READ_RCBT0051;                                            59020000
 /* IF ((VERIFY(WRK051_TYPE_OF_WARRANTY,WRK_TPMNT_VAL.TPMNT_WAR) = 0    59030000
 /*      & WRK_TOW_V051_IND ¬= -1)                                      59040000
 /*  | ((VERIFY(WRK051_F_TYPE_OF_WARRANTY,WRK_FW_TOW) = 0)              59050000
 /*  |  (VERIFY(WRK051_F_TYPE_OF_WARRANTY,WRK_HB_TOM) = 0)              59060000
 /*      &(WRK_FTOW_V051_IND ¬= -1))                                    59070000
 /*    &  CURRENT_BAU_CTR_FLAG ) THEN                                   59080000
 /* DO;                                                                 59090000
 /*  IF PARM_RCB005.PI_TO_RCMS = 'N'                                    59100000
 /*  THEN DO;                                                           59110000
 /*    USER_FILE_BAU.SRCC0MD.PI_PRIORITY     = 'Y';                     59120000
 /*    USER_FILE_RCBDRI1.SRCC0MD.PI_PRIORITY = 'Y';                     59130000
 /*  END;                                                               59140000
 /*  ELSE                                                               59150000
 /*  DO;                                                                59160000
 /*  USER_FILE_BAU.MKINSDAT             =  USER_FILE_PI.MKINSDAT;       59170000
 /*  USER_FILE_BAU.WED                  =  USER_FILE_PI.WED;            59180000
 /*  USER_FILE_BAU.SRCC0MD.EFFDATE      =  USER_FILE_PI.SRCC0MD.EFFDATE;59190000
 /*  USER_FILE_BAU.SRCC0MD.ENDDATE      =  USER_FILE_PI.SRCC0MD.ENDDATE;59200000
 /*  USER_FILE_BAU.SRCC0MD.TPMNT        =  WRK051_TYPE_OF_WARRANTY;     59210000
 /*  USER_FILE_RCBDRI1.MKINSDAT         =  USER_FILE_PI.MKINSDAT;       59220000
 /*  USER_FILE_RCBDRI1.WED              =  USER_FILE_PI.WED;            59230000
 /*  USER_FILE_RCBDRI1.SRCC0MD.EFFDATE  =  USER_FILE_PI.SRCC0MD.EFFDATE;59240000
 /*  USER_FILE_RCBDRI1.SRCC0MD.ENDDATE  =  USER_FILE_PI.SRCC0MD.ENDDATE;59250000
 /*  USER_FILE_RCBDRI1.SRCC0MD.TPMNT    =  WRK051_TYPE_OF_WARRANTY ;    59260000
 /*  IF ((CURSOR_HW_PI.WARRANTY_SPLT_DATE <= WRK_RUN_DATE)              59270000
 /*  &  (WRK051_F_TYPE_OF_WARRANTY ¬= '')) THEN                         59280000
 /*  DO;                                                                59290000
 /*     USER_FILE_BAU.SRCC0MD.TPMNT     = WRK051_F_TYPE_OF_WARRANTY ;   59300000
 /*     USER_FILE_RCBDRI1.SRCC0MD.TPMNT = WRK051_F_TYPE_OF_WARRANTY ;   59310000
 /*  END;                                                               59320000
 /* END;                                                                59330000
 /* END;                                                                59340000
 /*END;                                                                 59350000
 /*                                              /* EOC CEDS00000497 */ 59360000
 /*IF WRK_CNT_FUT_PERIODS > 0                                           59370000
 /* &                                                                   59380000
 /* VERIFY(USER_FILE_BAU.HF_SLOT(3).TPMNT,           /* FUTURE_1 BAU */ 59390000
 /*             WRK_TPMNT_VAL.TPMNT_WAR) = '0'                          59400000
 /*                                              /* SOC CEDS00000438 */ 59410000
 /* | VERIFY(CURSOR_HW_PI.F_TYPE_OF_WARRANTY,               /*RB01281*/ 59420000
                                                      /* SOC RB01298 */ 59430000
 /* | VERIFY(SAVED_HW_PI.F_TYPE_OF_WARRANTY,     /* EOC CEDS00000438 */ 59440000
 /*   SUBSTR(PARM_RCB063S.F_WARRANTY_MACHINE,1,1)) = 0      /*RB01281*/ 59450000
 /*| VERIFY(USER_FILE_BAU.HF_SLOT(3).TPMNT,                             59460000
 /*                                WRK_FW_TOW) = '0'                    59470000
 /*| VERIFY(USER_FILE_BAU.HF_SLOT(3).TPMNT,                             59480000
 /*                               WRK_HB_TOM) = '0'    /* EOC RB01298 */59490000
 /*THEN DO;                                                             59500000
 /*  IF (USER_FILE_BAU.HF_SLOT(3).EFFDATE <                             59510000
 /*         USER_FILE_PI.SRCC0MD.ENDDATE         /* BAU OVERLAP WITH:*/ 59520000
 /*    &                                                                59530000
 /*    USER_FILE_PI.SRCC0MD.IAGRNBR ¬= '')           /* CURRENT PI   */ 59540000
 /* | (WRK_CNT_FUT_PI > 0                                               59550000
 /*    &                                                                59560000
 /*    USER_FILE_BAU.HF_SLOT(3).EFFDATE <                               59570000
 /*         USER_FILE_PI.HF_SLOT(3).ENDDATE                             59580000
 /*    &                                                                59590000
 /*    USER_FILE_BAU.HF_SLOT(3).ENDDATE >                               59600000
 /*         USER_FILE_PI.HF_SLOT(3).EFFDATE      /* BAU OVERLAP WITH:*/ 59610000
 /*    &                                                                59620000
 /*    USER_FILE_PI.HF_SLOT(3).IAGRNBR ¬= '')        /* FUTURE_1 PI  */ 59630000
 /* | (WRK_CNT_FUT_PI > 1                                               59640000
 /*    &                                                                59650000
 /*    USER_FILE_BAU.HF_SLOT(3).EFFDATE <                               59660000
 /*         USER_FILE_PI.HF_SLOT(4).ENDDATE                             59670000
 /*    &                                                                59680000
 /*    USER_FILE_BAU.HF_SLOT(3).ENDDATE >                               59690000
 /*         USER_FILE_PI.HF_SLOT(4).EFFDATE      /* BAU OVERLAP WITH:*/ 59700000
 /*    &                                                                59710000
 /*    USER_FILE_PI.HF_SLOT(4).IAGRNBR ¬= '')        /* FUTURE_2 PI  */ 59720000
 /*THEN DO;                                                             59730000
 /*  IF PARM_RCB005.PI_TO_RCMS = 'N'                                    59740000
 /*  THEN DO;                                                           59750000
 /*    USER_FILE_BAU.HF_SLOT(3).PI_PRIORITY     = 'Y';                  59760000
 /*    USER_FILE_RCBDRI1.HF_SLOT(3).PI_PRIORITY = 'Y';                  59770000
 /*  END;                                                               59780000
 /*  ELSE DO;                                                           59790000
 /*    /*******************************************************/        59800000
 /*    /* NOTHING: NOT THE CURRENT SLOT, SO NO DEFAULT CHANGE */        59810000
 /*    /*******************************************************/        59820000
 /*    END;                                                             59830000
 /*  END;                                                               59840000
 /*END;                                                                 59850000
 /*                                                                     59860000
 /*IF WRK_CNT_FUT_PERIODS > 1                                           59870000
 /* &                                                                   59880000
 /* VERIFY(USER_FILE_BAU.HF_SLOT(4).TPMNT,           /* FUTURE_2 BAU */ 59890000
 /*             WRK_TPMNT_VAL.TPMNT_WAR) = '0'                          59900000
 /*                                              /* SOC CEDS00000438 */ 59910000
 /* | VERIFY(CURSOR_HW_PI.F_TYPE_OF_WARRANTY,            /*RB01281*/    59920000
 /*                                                   /* SOC RB01298 */ 59930000
 /* | VERIFY(SAVED_HW_PI.F_TYPE_OF_WARRANTY,     /* EOC CEDS00000438 */ 59940000
 /*   SUBSTR(PARM_RCB063S.F_WARRANTY_MACHINE,1,1)) = 0   /*RB01281*/    59950000
 /* | VERIFY(USER_FILE_BAU.HF_SLOT(4).TPMNT,                            59960000
 /*                               WRK_FW_TOW) = '0'                     59970000
 /* | VERIFY(USER_FILE_BAU.HF_SLOT(4).TPMNT,                            59980000
 /*                              WRK_HB_TOM) = '0'    /* EOC RB01298 */ 59990000
 /*THEN DO;                                                             60000000
 /*  IF (USER_FILE_BAU.HF_SLOT(4).EFFDATE <                             60010000
 /*         USER_FILE_PI.SRCC0MD.ENDDATE         /* BAU OVERLAP WITH:*/ 60020000
 /*    &                                                                60030000
 /*    USER_FILE_PI.SRCC0MD.IAGRNBR ¬= '')           /* CURRENT PI   */ 60040000
 /* | (WRK_CNT_FUT_PI > 0                                               60050000
 /*    &                                                                60060000
 /*    USER_FILE_BAU.HF_SLOT(4).EFFDATE <                               60070000
 /*         USER_FILE_PI.HF_SLOT(3).ENDDATE                             60080000
 /*    &                                                                60090000
 /*    USER_FILE_BAU.HF_SLOT(4).ENDDATE >                               60100000
 /*         USER_FILE_PI.HF_SLOT(3).EFFDATE      /* BAU OVERLAP WITH:*/ 60110000
 /*    &                                                                60120000
 /*    USER_FILE_PI.HF_SLOT(3).IAGRNBR ¬= '')        /* FUTURE_1 PI  */ 60130000
 /* | (WRK_CNT_FUT_PI > 1                                               60140000
 /*    &                                                                60150000
 /*    USER_FILE_BAU.HF_SLOT(4).EFFDATE <                               60160000
 /*         USER_FILE_PI.HF_SLOT(4).ENDDATE                             60170000
 /*    &                                                                60180000
 /*    USER_FILE_BAU.HF_SLOT(4).ENDDATE >                               60190000
 /*         USER_FILE_PI.HF_SLOT(4).EFFDATE      /* BAU OVERLAP WITH:*/ 60200000
 /*    &                                                                60210000
 /*    USER_FILE_PI.HF_SLOT(4).IAGRNBR ¬= '')        /* FUTURE_2 PI  */ 60220000
 /*THEN DO;                                                             60230000
 /*  IF PARM_RCB005.PI_TO_RCMS = 'N'                                    60240000
 /*  THEN DO;                                                           60250000
 /*    USER_FILE_BAU.HF_SLOT(4).PI_PRIORITY     = 'Y';                  60260000
 /*    USER_FILE_RCBDRI1.HF_SLOT(4).PI_PRIORITY = 'Y';                  60270000
 /*  END;                                                               60280000
 /*  ELSE DO;                                                           60290000
 /*    /*******************************************************/        60300000
 /*    /* NOTHING: NOT THE CURRENT SLOT, SO NO DEFAULT CHANGE */        60310000
 /*    /*******************************************************/        60320000
 /*    END;                                                             60330000
 /*  END;                                                               60340000
 /*END;                                                                 60350000
                                                                        60360000
 /*END R624_CHECK_PI_PRIORITY;                         /* EOC PTM1414 */60370000
                                                       /* EOC RB01308 */60380000
1/*********************************************************************/60390000
 /*                                                       SOC RB01308 */60400000
 /* MODULE NAME      : R730_APPLY_PRIORITY                            */60410000
 /*                                                                   */60420000
 /* DESCRIPTION      : THE CONSTRUCTED FILE_RCBDRI1 (BAU INFO) AND    */60430000
 /* USER_FILE_PI(PI INFO) ARE CHECKED FOR PRIORITY IF THE RECORD IS   */60440000
 /* ACTIVE IN BOTH BAU AND PI.                                        */60450000
 /* PRIORITY APPLIED O/P PRESENT IN FILE_RCBDRI1                      */60460000
 /* ORIGINAL BAU RECORD PRESENT IN USER_FILE_BAU                      */60470000
 /* ORIGINAL PI RECORD PRESENT IN USER_FILE_PI                        */60480000
 /*********************************************************************/60490000
 R730_APPLY_PRIORITY: PROC;                                             60500000
                                                                        60510000
                                                                        60520000
 DCL P     FIXED BIN(31);                                               60530000
 DCL N     FIXED BIN(31);                                               60540000
                                                                        60550000
 P = 1 ;                                                                60560000
 N = 1 ;                                                                60570000
                                                                        60580000
 WRK_BAU_PI_SRCC0MD = '';                                               60590000
 WRK_SAVE_SRCC0MD = '';                                                 60600000
                           /* FILE_RCBDRI1 IS MOVED TO USER_FILE_BAU */ 60610000
 USER_FILE_BAU = FILE_RCBDRI1, BY NAME;                                 60620000
                                                                        60630000
      /* ENTITLEMENT AND COVERAGE DETAILS OF FILE_RCBDRI1 IS CLEARED */ 60640000
 FILE_RCBDRI1.SRCC0MD = '';                                             60650000
 FILE_RCBDRI1.HF_SLOT(*) = '';                                          60660000
                   /* PI_PRIORITY IS ASSIGNED WITH DEFAULT VALUE 'N' */ 60670000
 USER_FILE_PI.SRCC0MD.PI_PRIORITY     = 'N';                            60680000
 USER_FILE_PI.HF_SLOT(*).PI_PRIORITY  = 'N';                            60690000
 USER_FILE_BAU.SRCC0MD.PI_PRIORITY    = 'N';                            60700000
 USER_FILE_BAU.HF_SLOT(*).PI_PRIORITY = 'N';                            60710000
                                                                        60720000
        /* EFFDATE AND ENDDATE+1 OF EACH SLOTS ARE TAKEN IN AN ARRAY */ 60730000
 CALL R528_FILL_DATE_ARRAY;                                             60740000
          /* DATES OF THE ARRAY ARE SORTED AND DUPLICATES ELIMINATED */ 60750000
 CALL R529_SORT_DATE_ARRAY;                                             60760000
          /* EACH DATE IN THE DATE ARRAY ARE PROCESSED TO FIND THE   */ 60770000
          /* RESPECTIVE SLOT IN USER_FILE_BAU AND USER_FILE_PI AND   */ 60780000
          /* PRIORITY RULES ARE APPLIED AND WRITTEN TO FILE_RCBDRI1  */ 60790000
 DO P = 1 TO NUM_OF_DATES BY 1;                                         60800000
       /* GET THE SRCC0MD DETAILS FOR BAU AND PI FOR THE DATE PASSED */ 60810000
  CALL R530_FIND_SLOT(DATE_ARRAY(P));                                   60820000
             /* PROCESS IF AT LEAST ANY ONE OF THE SLOT IS NOT BLANK */ 60830000
  IF (WRK_BAU_SRCC0MD.EFFDATE ¬= '' & WRK_BAU_SRCC0MD.ENDDATE ¬= '') |  60840000
     (WRK_PI_SRCC0MD.EFFDATE ¬= '' & WRK_PI_SRCC0MD.ENDDATE ¬= '') THEN 60850000
  DO;                                                                   60860000
                              /* VALIDATE THE FIELDS IN PI/BAU SLOTS */ 60870000
   CALL R531_CHECK_SLOT_VALUES;                                         60880000
                                               /* APPLY THE PRIORITY */ 60890000
   SELECT;                                                              60900000
    WHEN(WRK_BAU_FLAG.SW_BAU_OO)                      /* BAU ONORDER */ 60910000
    DO; /* BAU ON ORDER IS GIVEN PRECEDENCE EVEN PI DATA IS PRESENT  */ 60920000
      WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                     60930000
      CALL R511_FILL_CURRENT_BAU_INFO;                                  60940000
    END;                                                                60950000
    WHEN(WRK_BAU_FLAG.SW_BAU_WARR)                   /* BAU WARRANTY */ 60960000
     DO;                                                                60970000
      SELECT;                                                           60980000
      WHEN(WRK_BAU_FLAG.SW_BAU_CTR)            /* BAU WARR & BAU CTR */ 60990000
       DO;                                                              61000000
        WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                   61010000
        CALL R511_FILL_CURRENT_BAU_INFO;                                61020000
       END;                                                             61030000
      WHEN(WRK_PI_FLAG.SW_PI_CTR)               /* BAU WARR & PI CTR */ 61040000
       DO;                                                              61050000
        IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                            61060000
        DO;                                                             61070000
          WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;                  61080000
          WRK_BAU_PI_SRCC0MD.TPMNT = WRK_BAU_SRCC0MD.TPMNT;             61090000
                                                                        61100000
          DO N = 1 TO CTR_COUNT BY 1;                                   61110000
           IF ((SAVED_CTR_PI(N).EFFECTIVE_DATE <= DATE_ARRAY(P)) &      61120000
              (SAVED_CTR_PI(N).END_DATE >= DATE_ARRAY(P))) THEN         61130000
           DO;                                                          61140000
            WRK_BAU_PI_SRCC0MD.EFFDATE =                                61150000
              R010_MAX_DATE(WRK_BAU_SRCC0MD.EFFDATE,                    61160000
                  R013_TRANS_DATE(SAVED_CTR_PI(N).EFFECTIVE_DATE),'');  61170000
                                                                        61180000
            WRK_BAU_PI_SRCC0MD.ENDDATE =                                61190000
              R011_MIN_DATE(WRK_BAU_PI_SRCC0MD.ENDDATE,                 61200000
                  R013_TRANS_DATE(SAVED_CTR_PI(N).END_DATE),'');        61210000
            N = CTR_COUNT;                                              61220000
           END;                                                         61230000
          END;                                                          61240000
                                                                        61250000
          IF WRK_RUN_DATE8 >= WRK_BAU_PI_SRCC0MD.EFFDATE &              61260000
             WRK_RUN_DATE8 <= WRK_BAU_PI_SRCC0MD.ENDDATE THEN           61270000
           DO;                                                          61280000
            CALL R511_FILL_CURRENT_BAU_INFO;                            61290000
            FILE_RCBDRI1.QCUOHVP       = USER_FILE_PI.QCUOHVP;          61300000
            FILE_RCBDRI1.BASE_WARRANTY_SLC =                            61310000
                          TMP_BAU_BASE_WARRANTY_SLC;                    61320000
           END;                                                         61330000
        END;                                                            61340000
        ELSE                                                            61350000
        DO;                                                             61360000
         WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                  61370000
         WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y';                      61380000
         CALL R511_FILL_CURRENT_BAU_INFO;                               61390000
        END;                                                            61400000
       END;                                                             61410000
       OTHERWISE                            /* BAU WARR OVERRULES PI */ 61420000
       DO;                                                              61430000
        WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                   61440000
        CALL R511_FILL_CURRENT_BAU_INFO;                                61450000
       END;                                                             61460000
      END;                                                              61470000
     END;                                                               61480000
                                                                        61490000
    WHEN(WRK_PI_FLAG.SW_PI_WARR)                      /* PI WARRANTY */ 61500000
     DO;                                                                61510000
      SELECT;                                                           61520000
       WHEN(WRK_BAU_FLAG.SW_BAU_CTR)            /* PI WARR & BAU CTR */ 61530000
       DO;                                                              61540000
        WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                   61550000
                                                                        61560000
        IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                            61570000
        DO;                                                             61580000
          WRK_BAU_PI_SRCC0MD.TPMNT = WRK_PI_SRCC0MD.TPMNT;              61590000
                                                                        61600000
          WRK_BAU_PI_SRCC0MD.EFFDATE =                                  61610000
            R010_MAX_DATE(WRK_BAU_SRCC0MD.EFFDATE,                      61620000
                         R013_TRANS_DATE(W_EFF),'');                    61630000
          WRK_BAU_PI_SRCC0MD.ENDDATE =                                  61640000
            R011_MIN_DATE(WRK_BAU_PI_SRCC0MD.ENDDATE,                   61650000
                         R013_TRANS_DATE(W_END),'');                    61660000
                                                                        61670000
          IF WRK_RUN_DATE8 >= WRK_BAU_PI_SRCC0MD.EFFDATE &              61680000
             WRK_RUN_DATE8 <= WRK_BAU_PI_SRCC0MD.ENDDATE THEN           61690000
           DO;                                                          61700000
             CALL R510_FILL_CURRENT_PI_INFO;                            61710000
             FILE_RCBDRI1.QCUOHVP  = USER_FILE_BAU.QCUOHVP;             61720000
             FILE_RCBDRI1.BASE_WARRANTY_SLC =                           61730000
                                  TMP_PI_BASE_WARRANTY_SLC;             61740000
           END;                                                         61750000
        END;                                                            61760000
        ELSE                                                            61770000
        DO;                                                             61780000
         WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y';                      61790000
         CALL R511_FILL_CURRENT_BAU_INFO;                               61800000
        END;                                                            61810000
       END;                                                             61820000
       WHEN(WRK_PI_FLAG.SW_PI_CTR)               /* PI WARR & PI CTR */ 61830000
       DO;                                                              61840000
        IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                            61850000
         DO;                                                            61860000
           WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;                 61870000
           CALL R510_FILL_CURRENT_PI_INFO;                              61880000
         END;                                                           61890000
        ELSE                                                            61900000
         DO;                                                            61910000
          IF WRK_BAU_SRCC0MD.EFFDATE ¬= '' &                            61920000
             WRK_BAU_SRCC0MD.ENDDATE ¬= '' THEN                         61930000
           DO;                                                          61940000
    /*      WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y'; /* CEDS00000555 */61950000
            WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;               61960000
            WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y'; /* CEDS00000555 */61970000
            CALL R511_FILL_CURRENT_BAU_INFO;                            61980000
           END;                                                         61990000
         END;                                                           62000000
       END;                                                             62010000
       WHEN(WRK_BAU_FLAG.SW_INTERNAL     |  /* PI WARR & BAU INTERNAL */62020000
            WRK_BAU_FLAG.SW_LEASE_RENTAL |  /* PI WARR & BAU LEASE.R  */62030000
            WRK_BAU_FLAG.SW_BAU_PERCALL   ) /* PI WARR & BAU PERCALL  */62040000
       DO;                                                              62050000
        IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                            62060000
        DO;                                                             62070000
          WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;                  62080000
          CALL R510_FILL_CURRENT_PI_INFO;                               62090000
        END;                                                            62100000
        ELSE                                                            62110000
        DO;                                                             62120000
         WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                  62130000
         WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y';                      62140000
         CALL R511_FILL_CURRENT_BAU_INFO;                               62150000
        END;                                                            62160000
       END;                                                             62170000
       OTHERWISE                                /* PI WARR OVERRULES */ 62180000
       DO;                                                              62190000
        IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                            62200000
         DO;                                                            62210000
          WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;                  62220000
          CALL R510_FILL_CURRENT_PI_INFO;                               62230000
         END;                                                           62240000
       END;                                                             62250000
      END;                                                              62260000
     END;                                                               62270000
                                     /* BAU INTERNAL OR LEASE RENTAL */ 62280000
    WHEN(WRK_BAU_FLAG.SW_INTERNAL|WRK_BAU_FLAG.SW_LEASE_RENTAL)         62290000
     DO;                                                                62300000
      SELECT;                                                           62310000
       WHEN(WRK_BAU_FLAG.SW_BAU_CTR) /* BAU INTERNAL/LEASE & BAU CTR */ 62320000
        DO;                                                             62330000
         WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                  62340000
         CALL R511_FILL_CURRENT_BAU_INFO;                               62350000
        END;                                                            62360000
       WHEN(WRK_PI_FLAG.SW_PI_CTR)    /* BAU INTERNAL/LEASE & PI CTR */ 62370000
        DO;                                                             62380000
         IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                           62390000
          DO;                                                           62400000
           WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;                 62410000
           WRK_BAU_PI_SRCC0MD.TPMNT = WRK_BAU_SRCC0MD.TPMNT;            62420000
                                                                        62430000
           DO N = 1 TO CTR_COUNT BY 1;                                  62440000
            IF ((SAVED_CTR_PI(N).EFFECTIVE_DATE <= DATE_ARRAY(P)) &     62450000
               (SAVED_CTR_PI(N).END_DATE >= DATE_ARRAY(P))) THEN        62460000
            DO;                                                         62470000
             WRK_BAU_PI_SRCC0MD.EFFDATE =                               62480000
               R010_MAX_DATE(WRK_BAU_SRCC0MD.EFFDATE,                   62490000
                   R013_TRANS_DATE(SAVED_CTR_PI(N).EFFECTIVE_DATE),''); 62500000
                                                                        62510000
             WRK_BAU_PI_SRCC0MD.ENDDATE =                               62520000
               R011_MIN_DATE(WRK_BAU_PI_SRCC0MD.ENDDATE,                62530000
                   R013_TRANS_DATE(SAVED_CTR_PI(N).END_DATE),'');       62540000
             N = CTR_COUNT;                                             62550000
            END;                                                        62560000
           END;                                                         62570000
                                                                        62580000
           IF WRK_RUN_DATE8 > WRK_BAU_PI_SRCC0MD.EFFDATE &              62590000
              WRK_RUN_DATE8 < WRK_BAU_PI_SRCC0MD.ENDDATE THEN           62600000
            DO;                                                         62610000
              CALL R511_FILL_CURRENT_BAU_INFO;                          62620000
              FILE_RCBDRI1.QCUOHVP       = USER_FILE_PI.QCUOHVP;        62630000
              FILE_RCBDRI1.BASE_WARRANTY_SLC =                          62640000
                            TMP_BAU_BASE_WARRANTY_SLC;                  62650000
            END;                                                        62660000
          END;                                                          62670000
         ELSE                                                           62680000
          DO;                                                           62690000
           WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                62700000
           WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y';                    62710000
           CALL R511_FILL_CURRENT_BAU_INFO;                             62720000
          END;                                                          62730000
        END;                                                            62740000
       OTHERWISE                     /* BAU INTERNAL/LEASE OVERRULES */ 62750000
        DO;                                                             62760000
         WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                  62770000
         CALL R511_FILL_CURRENT_BAU_INFO;                               62780000
        END;                                                            62790000
      END;                                                              62800000
     END;                                                               62810000
    WHEN(WRK_BAU_FLAG.SW_BAU_CTR)                    /* BAU CONTRACT */ 62820000
     DO;                                                                62830000
      WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                     62840000
      CALL R511_FILL_CURRENT_BAU_INFO;                                  62850000
     END;                                                               62860000
    WHEN(WRK_PI_FLAG.SW_PI_CTR)                       /* PI CONTRACT */ 62870000
     DO;                                                                62880000
      IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                              62900000
       DO;                                                              62910000
         IF SAV_PI_ORIGIN = 'T241' THEN     /* WHEN ONLY T241 RECORD */ 62920000
          DO;                           /* PI CONTRACT & BAU PERCALL */ 62930000
           IF WRK_BAU_FLAG.SW_BAU_PERCALL THEN                          62940000
            DO;                                                         62950000
             WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;               62960000
             CALL R510_FILL_CURRENT_PI_INFO;                            62970000
            END;                                                        62980000
          END;                                                          62990000
         ELSE                                                           63000000
          DO;                   /* T241 RECORD ALONG WITH T051 RECORD*/ 63010000
            WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;                63020000
            CALL R510_FILL_CURRENT_PI_INFO;                             63030000
          END;                                                          63040000
       END;                             /* PI CONTRACT & BAU PERCALL */ 63050000
      ELSE IF WRK_BAU_FLAG.SW_BAU_PERCALL THEN                          63060000
       DO;                                                              63070000
    /*   WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y';    /* CEDS00000555 */63080000
         WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                  63090000
         WRK_BAU_PI_SRCC0MD.PI_PRIORITY     = 'Y';    /* CEDS00000555 */63100000
         CALL R511_FILL_CURRENT_BAU_INFO;                               63110000
       END;                                                             63120000
     END;                                                               63140000
    WHEN(WRK_BAU_FLAG.SW_BAU_PERCALL)                 /* BAU PERCALL */ 63150000
     DO;                                                                63160000
       WRK_BAU_PI_SRCC0MD = WRK_BAU_SRCC0MD,BY NAME;                    63170000
       CALL R511_FILL_CURRENT_BAU_INFO;                                 63180000
     END;                                                               63190000
    WHEN(WRK_PI_FLAG.SW_PI_PERCALL)                    /* PI PERCALL */ 63200000
     DO;                                                                63210000
      IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                              63220000
       DO;                                                              63230000
        WRK_BAU_PI_SRCC0MD = WRK_PI_SRCC0MD,BY NAME;                    63240000
        CALL R510_FILL_CURRENT_PI_INFO;                                 63250000
       END;                                                             63260000
     END;                                                               63270000
    OTHERWISE               /* ABEND IF NONE OF THE PI/BAU FLAGS SET */ 63280000
     DO;                                                                63290000
      CALL RCBDRIM_ERROR (NULL, 'OTHER', '#101');                       63300000
     END;                                                               63310000
   END;                                                                 63320000
                         /* CONTINUE IF RECORD CONSTRUCTED TO OUTPUT */ 63340000
   IF WRK_BAU_PI_SRCC0MD.EFFDATE ¬= '' &                                63350000
      WRK_BAU_PI_SRCC0MD.ENDDATE ¬= '' &                                63360000
      SAVE_SRCC0MD_STRNG ¬= BAU_PI_SRCC0MD_STRNG THEN                   63370000
    DO;                                                                 63380000
     IF WRK_SAVE_SRCC0MD.EFFDATE = '' &                                 63390000
        WRK_SAVE_SRCC0MD.ENDDATE = '' THEN                              63400000
      DO;                     /* SAVE OUTPUT SLOT FOR THE FIRST TIME */ 63410000
       WRK_SAVE_SRCC0MD = WRK_BAU_PI_SRCC0MD ;                          63420000
      END;                                                              63430000
     ELSE                                                               63440000
      DO;                  /* IF OVERLAPPING, TRUNCATE THE SAVED ONE */ 63450000
       IF WRK_SAVE_SRCC0MD.ENDDATE > WRK_BAU_PI_SRCC0MD.EFFDATE THEN    63460000
       DO;                                                              63470000
          WRK_SAVE_SRCC0MD.ENDDATE =                                    63480000
                    R018_DATE_CALC8(WRK_BAU_PI_SRCC0MD.EFFDATE, -1);    63490000
       END;                                                             63500000
 /* IF ALL THE FIELDS OF SAVED SLOT AND NEW SLOT ARE SAME EXCEPT THE*/  63510000
 /* EFFECTIVE AND END DATE, BOTH THE SLOTS ARE MERGED IF THE DATES  */  63520000
 /* ARE CONTINUOUS. ELSE THE SAVED SLOT WILL BE UPDATED INTO THE    */  63530000
 /* RESPECTIVE SLOT OF FILE_RCBDRI1 & NEW SLOT WILL BE MOVED TO SAVE*/  63540000
                                                                        63550000
       WRK_SAVE_EFF = WRK_SAVE_SRCC0MD.EFFDATE;                         63560000
       WRK_SAVE_END = WRK_SAVE_SRCC0MD.ENDDATE;                         63570000
         /* MAKE BOTH THE SLOT DATES EQUAL JUST TO COMPARE THE SLOTS */ 63580000
       WRK_SAVE_SRCC0MD.EFFDATE = WRK_BAU_PI_SRCC0MD.EFFDATE;           63590000
       WRK_SAVE_SRCC0MD.ENDDATE = WRK_BAU_PI_SRCC0MD.ENDDATE;           63600000
                                                                        63610000
       IF ( SAVE_SRCC0MD_STRNG = BAU_PI_SRCC0MD_STRNG         ) &       63620000
          ( WRK_BAU_PI_SRCC0MD.EFFDATE =                                63630000
                           R018_DATE_CALC8(WRK_SAVE_END, +1)) THEN      63640000
        DO;                                                             63650000
         WRK_SAVE_SRCC0MD.EFFDATE   = WRK_SAVE_EFF;                     63660000
         WRK_SAVE_SRCC0MD.ENDDATE   = WRK_BAU_PI_SRCC0MD.ENDDATE;       63670000
         WRK_BAU_PI_SRCC0MD.EFFDATE = WRK_SAVE_EFF;                     63680000
        END;                                                            63690000
       ELSE                                                             63700000
        DO;                                                             63710000
         WRK_SAVE_SRCC0MD.EFFDATE = WRK_SAVE_EFF;                       63720000
         WRK_SAVE_SRCC0MD.ENDDATE = WRK_SAVE_END;                       63730000
         CALL R419_PROCESS_RCBDRI1_PERIOD;                              63740000
         WRK_SAVE_SRCC0MD = WRK_BAU_PI_SRCC0MD ;                        63750000
        END;                                                            63760000
      END;                                                              63770000
    END;                                                                63780000
  END;                                                                  63800000
 END;                                                                   63820000
         /* WRITE THE FINAL SLOT WHICH IS NOT YET UPDATED TO RCBDRI1 */ 63840000
 IF WRK_BAU_PI_SRCC0MD.EFFDATE ¬= '' &                                  63850000
    WRK_BAU_PI_SRCC0MD.ENDDATE ¬= '' THEN                               63860000
  DO;                                                                   63870000
   WRK_SAVE_SRCC0MD = WRK_BAU_PI_SRCC0MD ;                              63880000
   CALL R419_PROCESS_RCBDRI1_PERIOD;                                    63890000
  END;                                                                  63900000
                                                                        63910000
   /* FOR A BAU REGISTERED MACHINE (EVEN IF PI WARRANTY OR CONTRACT */  63930000
   /* INFO IS USED) FOLL. DETAILS MUST BE RETRIEVED FROM BAU TABLES */  63940000
  IF STRING(USER_FILE_BAU.TYPESER) ¬= '' &                              63950000
     USER_FILE_BAU.SRCC0MD.EFFDATE ¬= '' &                              63960000
     USER_FILE_BAU.SRCC0MD.ENDDATE ¬= '' THEN                           63970000
  DO;                                                                   63980000
     FILE_RCBDRI1.CPUTYPE      = USER_FILE_BAU.CPUTYPE;                 63990000
     FILE_RCBDRI1.DPSYSNO      = USER_FILE_BAU.DPSYSNO;                 64000000
     FILE_RCBDRI1.MKSCREMD     = USER_FILE_BAU.MKSCREMD;                64010000
     FILE_RCBDRI1.ORDREF       = USER_FILE_BAU.ORDREF;                  64020000
     FILE_RCBDRI1.TPAGR        = USER_FILE_BAU.TPAGR;                   64030000
     FILE_RCBDRI1.DPIS         = USER_FILE_BAU.DPIS;                    64040000
     FILE_RCBDRI1.MKBINA       = USER_FILE_BAU.MKBINA;                  64050000
     FILE_RCBDRI1.MOD          = USER_FILE_BAU.MOD;                     64060000
     FILE_RCBDRI1.BUILT_TO_MOD = USER_FILE_BAU.BUILT_TO_MOD;            64070000
  END;                                                                  64080000
                                                                        64090000
   /* FOR A PI REGISTERED MACHINE (EVEN IF BAU WARRANTY & CONTRACT  */  64110000
   /* INFO IS USED) FOLL. DETAILS MUST BE RETRIEVED FROM BAU TABLES */  64120000
  IF STRING(USER_FILE_PI.TYPESER) ¬= '' &                               64130000
     USER_FILE_PI.SRCC0MD.EFFDATE ¬= '' &                               64140000
     USER_FILE_PI.SRCC0MD.ENDDATE ¬= '' THEN                            64150000
  DO;                                                                   64160000
    IF FILE_RCBDRI1.DEALER_NUMBER = '' &                                64170000
       PARM_RCB005.PI_TO_RCMS     = 'Y' THEN                            64180000
      FILE_RCBDRI1.DEALER_NUMBER = USER_FILE_PI.DEALER_NUMBER;          64190000
  END;                                                                  64200000
                                                                        64210000
 END R730_APPLY_PRIORITY;                              /* EOC RB01308 */64230000
1/*********************************************************************/64240000
 /*                                                      SOC RB01308  */64250000
 /* MODULE NAME      :  R510_FILL_CURRENT_PI_INFO                     */64260000
 /*                                                                   */64270000
 /* DESCRIPTION      :  FILL COMMON FIELDS RELATED TO CURRENT SLOT    */64280000
 /*                     FROM USER FILE PI                             */64290000
 /*********************************************************************/64300000
 R510_FILL_CURRENT_PI_INFO: PROC;                                       64310000
                                                                        64320000
 IF WRK_RUN_DATE8 >= WRK_BAU_PI_SRCC0MD.EFFDATE &                       64330000
    WRK_RUN_DATE8 <= WRK_BAU_PI_SRCC0MD.ENDDATE THEN                    64340000
  DO;                                                                   64350000
   FILE_RCBDRI1.IDEXRIF       = USER_FILE_PI.IDEXRIF;                   64360000
   FILE_RCBDRI1.TYPE          = USER_FILE_PI.TYPE;                      64370000
   FILE_RCBDRI1.SERNO         = USER_FILE_PI.SERNO;                     64380000
   FILE_RCBDRI1.SERIAL_LNG    = USER_FILE_PI.SERIAL_LNG;   /* RB01320 */64390000
   FILE_RCBDRI1.MKINSDAT      = USER_FILE_PI.MKINSDAT;                  64400000
   FILE_RCBDRI1.WED           = USER_FILE_PI.WED;                       64410000
   FILE_RCBDRI1.ADDRESS_NUMBER= USER_FILE_PI.ADDRESS_NUMBER;            64420000
   FILE_RCBDRI1.MOD           = USER_FILE_PI.MOD;                       64430000
   FILE_RCBDRI1.BUILT_TO_MOD  = USER_FILE_PI.BUILT_TO_MOD;              64440000
   FILE_RCBDRI1.ICUSANO       = USER_FILE_PI.ICUSANO;                   64450000
   FILE_RCBDRI1.MKBINA        = USER_FILE_PI.MKBINA;                    64460000
   FILE_RCBDRI1.DPIS          = USER_FILE_PI.DPIS;                      64470000
   FILE_RCBDRI1.QCUOHVP       = USER_FILE_PI.QCUOHVP;                   64480000
   FILE_RCBDRI1.DEALER_NUMBER = USER_FILE_PI.DEALER_NUMBER;             64490000
   FILE_RCBDRI1.CPUTYPE       = USER_FILE_PI.CPUTYPE;                   64500000
   FILE_RCBDRI1.DPSYSNO       = USER_FILE_PI.DPSYSNO;                   64510000
   FILE_RCBDRI1.MKSCREMD      = USER_FILE_PI.MKSCREMD;                  64520000
   FILE_RCBDRI1.ORDREF        = USER_FILE_PI.ORDREF;                    64530000
   FILE_RCBDRI1.TPAGR         = USER_FILE_PI.TPAGR;                     64540000
   FILE_RCBDRI1.BASE_WARRANTY_SLC                                       64550000
                              = USER_FILE_PI.BASE_WARRANTY_SLC;         64560000
  END;                                                                  64570000
 END R510_FILL_CURRENT_PI_INFO;                       /* EOC RB01308  */64580000
1/*********************************************************************/64590000
 /*                                                      SOC RB01308  */64600000
 /* MODULE NAME      :  R511_FILL_CURRENT_BAU_INFO                    */64610000
 /*                                                                   */64620000
 /* DESCRIPTION      :  FILL COMMON FIELDS RELATED TO CURRENT SLOT    */64630000
 /*                     FROM USER FILE BAU                            */64640000
 /*********************************************************************/64650000
 R511_FILL_CURRENT_BAU_INFO: PROC;                                      64660000
                                                                        64670000
 IF WRK_RUN_DATE8 >= WRK_BAU_PI_SRCC0MD.EFFDATE &                       64680000
    WRK_RUN_DATE8 <= WRK_BAU_PI_SRCC0MD.ENDDATE THEN                    64690000
  DO;                                                                   64700000
   FILE_RCBDRI1.IDEXRIF       = USER_FILE_BAU.IDEXRIF;                  64710000
   FILE_RCBDRI1.TYPE          = USER_FILE_BAU.TYPE;                     64720000
   FILE_RCBDRI1.SERNO         = USER_FILE_BAU.SERNO;                    64730000
   FILE_RCBDRI1.SERIAL_LNG    = USER_FILE_BAU.SERIAL_LNG;  /* RB01320 */64740000
   FILE_RCBDRI1.MKINSDAT      = USER_FILE_BAU.MKINSDAT;                 64750000
   FILE_RCBDRI1.WED           = USER_FILE_BAU.WED;                      64760000
   FILE_RCBDRI1.ADDRESS_NUMBER= USER_FILE_BAU.ADDRESS_NUMBER;           64770000
   FILE_RCBDRI1.MOD           = USER_FILE_BAU.MOD;                      64780000
   FILE_RCBDRI1.BUILT_TO_MOD  = USER_FILE_BAU.BUILT_TO_MOD;             64790000
   FILE_RCBDRI1.ICUSANO       = USER_FILE_BAU.ICUSANO;                  64800000
   FILE_RCBDRI1.MKBINA        = USER_FILE_BAU.MKBINA;                   64810000
   FILE_RCBDRI1.DPIS          = USER_FILE_BAU.DPIS;                     64820000
   FILE_RCBDRI1.QCUOHVP       = USER_FILE_BAU.QCUOHVP;                  64830000
   FILE_RCBDRI1.DEALER_NUMBER = USER_FILE_BAU.DEALER_NUMBER;            64840000
   FILE_RCBDRI1.CPUTYPE       = USER_FILE_BAU.CPUTYPE;                  64850000
   FILE_RCBDRI1.DPSYSNO       = USER_FILE_BAU.DPSYSNO;                  64860000
   FILE_RCBDRI1.MKSCREMD      = USER_FILE_BAU.MKSCREMD;                 64870000
   FILE_RCBDRI1.ORDREF        = USER_FILE_BAU.ORDREF;                   64880000
   FILE_RCBDRI1.TPAGR         = USER_FILE_BAU.TPAGR;                    64890000
   FILE_RCBDRI1.BASE_WARRANTY_SLC                                       64900000
                              = USER_FILE_BAU.BASE_WARRANTY_SLC;        64910000
  END;                                                                  64920000
 END R511_FILL_CURRENT_BAU_INFO;                      /* EOC RB01308  */64930000
1/*********************************************************************/64940000
 /*                                                       SOC RB01308 */64950000
 /* MODULE NAME      :  R419_PROCESS_RCBDRI1_PERIOD                   */64960000
 /*                                                                   */64970000
 /* DESCRIPTION      :  UPDATE THE PASSED SRCC0MD DETAILS INTO THE    */64980000
 /*                     RESPECTIVE SLOT OF FILE_RCBDRI1               */64990000
 /*********************************************************************/65000000
 R419_PROCESS_RCBDRI1_PERIOD: PROC;                                     65010000
                                                                        65020000
 SELECT;                                             /* HISTORY SLOT */ 65030000
   WHEN (WRK_SAVE_SRCC0MD.ENDDATE < WRK_RUN_DATE8)                      65040000
   DO;                                                                  65050000
     WRK_CNT_HIST = WRK_CNT_HIST + 1;                                   65060000
     IF WRK_CNT_HIST <= 2                                               65070000
     THEN                                                               65080000
       DO;                                                              65090000
         FILE_RCBDRI1.HF_SLOT(WRK_CNT_HIST) = WRK_SAVE_SRCC0MD;         65100000
       END;                                                             65110000
     ELSE                                                               65120000
       DO;                                                              65130000
         FILE_RCBDRI1.HF_SLOT(1) = FILE_RCBDRI1.HF_SLOT(2);             65140000
         FILE_RCBDRI1.HF_SLOT(2) = WRK_SAVE_SRCC0MD;                    65150000
         WRK_CNT_HIST = 2;                                              65160000
       END;                                                             65170000
   END;                                               /* FUTURE SLOT */ 65180000
   WHEN (WRK_SAVE_SRCC0MD.EFFDATE > WRK_RUN_DATE8)                      65190000
   DO;                                                                  65200000
    WRK_CNT_FUT = WRK_CNT_FUT + 1;                                      65210000
    IF WRK_CNT_FUT <= 2                                                 65220000
    THEN                                                                65230000
     DO;                                                                65240000
      FILE_RCBDRI1.HF_SLOT(2 + WRK_CNT_FUT) = WRK_SAVE_SRCC0MD;         65250000
     END;                                                               65260000
    ELSE                                                                65270000
     DO;                                                                65280000
      WRK_CNT_FUT = 2;                                                  65290000
     END;                                                               65300000
   END;                                                                 65310000
   OTHERWISE                                                            65320000
   DO;                                               /* CURRENT SLOT */ 65330000
     FILE_RCBDRI1.SRCC0MD = WRK_SAVE_SRCC0MD;                           65340000
   END;                                                                 65350000
 END;                                                                   65360000
                                                                        65370000
 END R419_PROCESS_RCBDRI1_PERIOD;                      /* EOC RB01308 */65380000
1/*********************************************************************/65390000
 /*                                                       SOC RB01308 */65400000
 /* MODULE NAME      :  R528_FILL_DATE_ARRAY                          */65410000
 /*                                                                   */65420000
 /* DESCRIPTION      :  FILL THE DATE_ARRAY WITH EFFDATE & ENDDATE+1  */65430000
 /*                     FROM ALL SLOTS OF BAU AND PI RECORD           */65440000
 /*********************************************************************/65450000
 R528_FILL_DATE_ARRAY: PROC;                                            65460000
                                                                        65470000
 DCL L   FIXED BIN(31);                                                 65480000
 DCL K   FIXED BIN(31);                                                 65490000
                                                                        65500000
 L = 0;                                                                 65510000
 K = 1;                                                                 65520000
                /* TAKE EFFDATE & ENDDATE+1 FROM THE HIST & FUT SLOTS*/ 65530000
 DO WHILE (K <= 4);                           /* TAKE DATES FROM BAU */ 65540000
  IF (USER_FILE_BAU.HF_SLOT(K).EFFDATE ¬= '' &                          65550000
      USER_FILE_BAU.HF_SLOT(K).ENDDATE ¬= '') THEN                      65560000
   DO;                                                                  65570000
    L = L + 1;                                                          65580000
    DATE_ARRAY(L) = USER_FILE_BAU.HF_SLOT(K).EFFDATE;                   65590000
    L = L + 1;                                                          65600000
    DATE_ARRAY(L) =                                                     65610000
               R018_DATE_CALC8(USER_FILE_BAU.HF_SLOT(K).ENDDATE, +1);   65620000
   END;                                                                 65630000
                                                /* TAKE DATES FROM PI */65640000
  IF (USER_FILE_PI.HF_SLOT(K).EFFDATE ¬= '' &                           65650000
      USER_FILE_PI.HF_SLOT(K).ENDDATE ¬= '') THEN                       65660000
   DO;                                                                  65670000
    L = L + 1;                                                          65680000
    DATE_ARRAY(L) = USER_FILE_PI.HF_SLOT(K).EFFDATE;                    65690000
    L = L + 1;                                                          65700000
    DATE_ARRAY(L) =                                                     65710000
               R018_DATE_CALC8(USER_FILE_PI.HF_SLOT(K).ENDDATE, +1);    65720000
   END;                                                                 65730000
    K = K + 1;                                                          65740000
 END;                                                                   65750000
               /* TAKE EFFDATE & ENDDATE+1 FROM THE BAU CURRENT SLOT */ 65760000
 IF (USER_FILE_BAU.SRCC0MD.EFFDATE ¬= '' &                              65770000
     USER_FILE_BAU.SRCC0MD.ENDDATE ¬= '') THEN                          65780000
  DO;                                                                   65790000
   L = L + 1;                                                           65800000
   DATE_ARRAY(L)   = USER_FILE_BAU.SRCC0MD.EFFDATE;                     65810000
   L = L + 1;                                                           65820000
   DATE_ARRAY(L) = R018_DATE_CALC8(USER_FILE_BAU.SRCC0MD.ENDDATE, +1);  65830000
  END;                                                                  65840000
                /* TAKE EFFDATE & ENDDATE+1 FROM THE PI CURRENT SLOT */ 65850000
 IF (USER_FILE_PI.SRCC0MD.EFFDATE ¬= '' &                               65860000
     USER_FILE_PI.SRCC0MD.ENDDATE ¬= '') THEN                           65870000
  DO;                                                                   65880000
   L = L + 1;                                                           65890000
   DATE_ARRAY(L) = USER_FILE_PI.SRCC0MD.EFFDATE;                        65900000
   L = L + 1;                                                           65910000
   DATE_ARRAY(L) = R018_DATE_CALC8(USER_FILE_PI.SRCC0MD.ENDDATE, +1);   65920000
  END;                                                                  65930000
                                                                        65940000
 NUM_OF_DATES  = L;                                                     65950000
                                                                        65960000
 END R528_FILL_DATE_ARRAY;                             /* EOC RB01308 */65970000
1/*********************************************************************/65980000
 /*                                                       SOC RB01308 */65990000
 /* MODULE NAME      :  R529_SORT_DATE_ARRAY                          */66000000
 /*                                                                   */66010000
 /* DESCRIPTION      :  SORT THE DATE_ARRAY IN ASCENDING ORDER        */66020000
 /*                     (BUBBLE-SORT) & ELIMINATE DUPLICATES          */66030000
 /*                                                                   */66040000
 /*********************************************************************/66050000
 R529_SORT_DATE_ARRAY: PROC;                                            66060000
                                                                        66070000
 DCL I     FIXED BIN(31);                                               66080000
 DCL J     FIXED BIN(31);                                               66090000
                                                                        66100000
 I = 1;                                                                 66110000
 DATES_SWAPPED = TRUE;                                                  66120000
 DO WHILE (DATES_SWAPPED & (I < NUM_OF_DATES));                         66130000
   J = NUM_OF_DATES;                                                    66140000
   DATES_SWAPPED = FALSE;                                               66150000
   DO WHILE (J > I);                                                    66160000
     IF DATE_ARRAY(J) < DATE_ARRAY(J-1)                                 66170000
     THEN DO;                                           /* SWAP DATES */66180000
       SAVE_DATE       = DATE_ARRAY(J);                                 66190000
       DATE_ARRAY(J)   = DATE_ARRAY(J-1);                               66200000
       DATE_ARRAY(J-1) = SAVE_DATE;                                     66210000
       DATES_SWAPPED   = TRUE;                                          66220000
       END;                                                             66230000
     J = J - 1;                                                         66240000
   END;                                                                 66250000
   I = I + 1;                                                           66260000
 END;                                                                   66270000
                                                                        66280000
 I = NUM_OF_DATES;                     /* ELIMINATING DUPLICATE DATES */66290000
 DO I = NUM_OF_DATES TO 2 BY -1;                                        66300000
   IF DATE_ARRAY(I) = DATE_ARRAY(I-1) THEN                              66310000
   DO;                                                                  66320000
     DO J = I TO NUM_OF_DATES;                                          66330000
       DATE_ARRAY(J-1) = DATE_ARRAY(J);                                 66340000
     END;                                                               66350000
     DATE_ARRAY(NUM_OF_DATES) = '';                                     66360000
     NUM_OF_DATES = NUM_OF_DATES - 1;                                   66370000
   END;                                                                 66380000
 END;                                                                   66390000
                                                                        66400000
 END R529_SORT_DATE_ARRAY;                             /* EOC RB01308 */66410000
1/*********************************************************************/66420000
 /*                                                       SOC RB01308 */66430000
 /* MODULE NAME      :  R530_FIND_SLOT                                */66440000
 /*                                                                   */66450000
 /* DESCRIPTION      :  FIND THE SLOTS IN WHICH THE DATE FALLS IN, AND*/66460000
 /*                     PASS THE RESPECTIVE PI-BAU SRCC0MD AND FLAG   */66470000
 /*                     DETAILS IN THE WORK VARIABLES                 */66480000
 /*********************************************************************/66490000
 R530_FIND_SLOT: PROC(CHK_DATE);                                        66500000
                                                                        66510000
 DCL CHK_DATE CHAR(08);                                                 66520000
 DCL M        FIXED BIN(15);                                            66530000
                                                                        66540000
 WRK_BAU_FLAG    = '0'B;                                                66550000
 WRK_PI_FLAG     = '0'B;                                                66560000
 WRK_BAU_SRCC0MD = '';                                                  66570000
 WRK_PI_SRCC0MD  = '';                                                  66580000
                                                                        66590000
                                                                        66600000
 M=1;                                                                   66610000
 DO WHILE (M <=4);             /* CHECK BAU HISTORY AND FUTURE SLOTS */ 66620000
  IF (CHK_DATE >= USER_FILE_BAU.HF_SLOT(M).EFFDATE &                    66630000
      CHK_DATE <= USER_FILE_BAU.HF_SLOT(M).ENDDATE ) THEN               66640000
   DO;                                                                  66650000
     WRK_BAU_FLAG = BAU_FLAG(M), BY NAME;                               66660000
     WRK_BAU_SRCC0MD = USER_FILE_BAU.HF_SLOT(M);                        66670000
   END;                                                                 66680000
                                /* CHECK PI HISTORY AND FUTURE SLOTS */ 66690000
  IF (CHK_DATE >= USER_FILE_PI.HF_SLOT(M).EFFDATE &                     66700000
      CHK_DATE <= USER_FILE_PI.HF_SLOT(M).ENDDATE ) THEN                66710000
   DO;                                                                  66720000
     WRK_PI_FLAG = PI_FLAG(M), BY NAME;                                 66730000
     WRK_PI_SRCC0MD = USER_FILE_PI.HF_SLOT(M);                          66740000
   END;                                                                 66750000
  M = M + 1;                                                            66760000
 END;                                                                   66770000
                                           /* CHECK BAU CURRENT SLOT */ 66780000
 IF (CHK_DATE >= USER_FILE_BAU.SRCC0MD.EFFDATE &                        66790000
     CHK_DATE <= USER_FILE_BAU.SRCC0MD.ENDDATE ) THEN                   66800000
  DO;              /* HERE INDEX 5, INDICATES THE CURRENT SLOT FLAGS */ 66810000
    WRK_BAU_FLAG = BAU_FLAG(5), BY NAME;                                66820000
    WRK_BAU_SRCC0MD = USER_FILE_BAU.SRCC0MD;                            66830000
  END;                                                                  66840000
                                           /* CHECK PI CURRENT SLOTS */ 66850000
 IF (CHK_DATE >= USER_FILE_PI.SRCC0MD.EFFDATE &                         66860000
     CHK_DATE <= USER_FILE_PI.SRCC0MD.ENDDATE ) THEN                    66870000
  DO;              /* HERE INDEX 5, INDICATES THE CURRENT SLOT FLAGS */ 66880000
    WRK_PI_FLAG = PI_FLAG(5), BY NAME;                                  66890000
    WRK_PI_SRCC0MD = USER_FILE_PI.SRCC0MD;                              66900000
  END;                                                                  66910000
  /* INITIALIZE THE EFFECTIVE DATE OF THE SLOT TO THE DATE WHAT IT IS*/ 66920000
  /* PROCESSING,BECAUSE THE SLOT TILL THAT DATE HAS ALREADY PROCESSED*/ 66930000
                           /* IF BAU REC PRESENT, INIT TO CHECK DATE */ 66940000
 IF WRK_BAU_SRCC0MD.EFFDATE ¬= '' THEN                                  66950000
    WRK_BAU_SRCC0MD.EFFDATE = CHK_DATE;                                 66960000
                           /* IF PI  REC PRESENT, INIT TO CHECK DATE */ 66970000
 IF WRK_PI_SRCC0MD.EFFDATE  ¬= '' THEN                                  66980000
    WRK_PI_SRCC0MD.EFFDATE  = CHK_DATE;                                 66990000
                                                                        67000000
   /* IF BOTH PI AND BAU PRESENT, THEN IT INDICATES PI & BAU OVERLAP */ 67010000
   /* SO THE MINIMUM OF THE END DATE WILL BE TAKEN                   */ 67020000
 IF WRK_BAU_SRCC0MD.ENDDATE ¬= '' &                                     67030000
    WRK_PI_SRCC0MD.ENDDATE  ¬= '' THEN                                  67040000
  DO;                                           /* TAKE MIN END DATE */ 67050000
    IF WRK_BAU_SRCC0MD.ENDDATE > WRK_PI_SRCC0MD.ENDDATE THEN            67060000
        WRK_BAU_SRCC0MD.ENDDATE = WRK_PI_SRCC0MD.ENDDATE ;              67070000
    ELSE                                                                67080000
        WRK_PI_SRCC0MD.ENDDATE  = WRK_BAU_SRCC0MD.ENDDATE ;             67090000
  END;                                                                  67100000
                                                                        67110000
 END R530_FIND_SLOT;                                  /* EOC RB01308 */ 67120000
1/*********************************************************************/67130000
 /*                                                       SOC RB01308 */67140000
 /* MODULE NAME      :  R531_CHECK_SLOT_VALUES                        */67150000
 /*                                                                   */67160000
 /* DESCRIPTION      :  CHECK FOR ANY VALIDATIONS RELATED TO FIELD    */67170000
 /*                     VALUES FOR THE PERTICULAR SLOT                */67180000
 /*********************************************************************/67190000
 R531_CHECK_SLOT_VALUES: PROC;                                          67200000
                    /* IF THE RECORD PRESENT IN BOTH PI AND BAU THEN */ 67210000
 IF WRK_BAU_SRCC0MD.EFFDATE ¬= '' &                                     67220000
    WRK_BAU_SRCC0MD.ENDDATE ¬= '' &                                     67230000
    WRK_PI_SRCC0MD.EFFDATE  ¬= '' &                                     67240000
    WRK_PI_SRCC0MD.ENDDATE  ¬= ''   THEN                                67250000
  DO;                                                                   67260000
                                                 /* SOC CEDS00000552 */ 67270000
      /* CUSTOMER DETAILS FROM BAU OVERRULES PI WHEN BOTH ARE ACTIVE */ 67280000
   WRK_PI_SRCC0MD.CUNOUSE = WRK_BAU_SRCC0MD.CUNOUSE; /* CUST A/C NUM */ 67290000
   WRK_PI_SRCC0MD.BUCODE  = WRK_BAU_SRCC0MD.BUCODE; /* BUSI UNIT DIV */ 67300000
   WRK_PI_SRCC0MD.BUDIV   = WRK_BAU_SRCC0MD.BUDIV; /* BUSI UNIT CODE */ 67310000
            /* ONLY IF BOTH THE SLOTS ARE EFFECTIVE FOR THE RUN_DATE */ 67320000
   IF WRK_RUN_DATE8 >= WRK_PI_SRCC0MD.EFFDATE  &                        67330000
      WRK_RUN_DATE8 <= WRK_PI_SRCC0MD.ENDDATE  &                        67340000
      WRK_RUN_DATE8 >= WRK_BAU_SRCC0MD.EFFDATE &                        67350000
      WRK_RUN_DATE8 <= WRK_BAU_SRCC0MD.ENDDATE THEN                     67360000
    DO;                                   /* CUSTOMER ADDRESS NUMBER */ 67370000
     USER_FILE_PI.ICUSANO  = USER_FILE_BAU.ICUSANO;                     67380000
    END;                                                                67390000
                                                                        67400000
          /* NOTE : DUE TO ABOVE CODE CORRECTION, THE FOLLOWING CODE */ 67410000
          /*        WILL BE REDUNDANT, SO ITS COMMENTED              */ 67420000
                                                                        67430000
 /*           /* IF THE RECORD PRESENT ONLY IN T241 THEN ASSIGN BAU  */ 67440000
 /*           /* CUSTOMER DETAILS IF BAU RECORD IS ACTIVE            */ 67450000
 /*IF SAV_PI_ORIGIN = 'T241' & WRK_PI_SRCC0MD.CUNOUSE = '' THEN         67460000
 /* DO;                                                                 67470000
 /*  WRK_PI_SRCC0MD.CUNOUSE = WRK_BAU_SRCC0MD.CUNOUSE;                  67480000
 /*  WRK_PI_SRCC0MD.BUCODE  = WRK_BAU_SRCC0MD.BUCODE;                   67490000
 /*  WRK_PI_SRCC0MD.BUDIV   = WRK_BAU_SRCC0MD.BUDIV;                    67500000
 /*         /* ONLY IF BOTH THE SLOTS ARE EFFECTIVE FOR THE RUN_DATE */ 67510000
 /*  IF WRK_RUN_DATE8 >= WRK_PI_SRCC0MD.EFFDATE  &                      67520000
 /*     WRK_RUN_DATE8 <= WRK_PI_SRCC0MD.ENDDATE  &                      67530000
 /*     WRK_RUN_DATE8 >= WRK_BAU_SRCC0MD.EFFDATE &                      67540000
 /*     WRK_RUN_DATE8 <= WRK_BAU_SRCC0MD.ENDDATE THEN                   67550000
 /*   DO;                                                               67560000
 /*    USER_FILE_PI.ICUSANO  = USER_FILE_BAU.ICUSANO;                   67570000
 /*   END;                                                              67580000
 /* END;                                                                67590000
 /*                                                                     67600000
 /*                  /* IF THE CUSTOMER NUMBER STARTS WITH 'CI' THEN */ 67610000
 /*                  /* ASSIGN BAU VALUES                            */ 67620000
 /*IF SUBSTR(WRK_PI_SRCC0MD.CUNOUSE,1,2) = 'CI' THEN                    67630000
 /* DO;                                                                 67640000
 /*  WRK_PI_SRCC0MD.CUNOUSE = WRK_BAU_SRCC0MD.CUNOUSE;                  67650000
 /*  WRK_PI_SRCC0MD.BUCODE  = WRK_BAU_SRCC0MD.BUCODE;                   67660000
 /*  WRK_PI_SRCC0MD.BUDIV   = WRK_BAU_SRCC0MD.BUDIV;                    67670000
 /*         /* ONLY IF BOTH THE SLOTS ARE EFFECTIVE FOR THE RUN_DATE */ 67680000
 /*  IF WRK_RUN_DATE8 >= WRK_PI_SRCC0MD.EFFDATE  &                      67690000
 /*     WRK_RUN_DATE8 <= WRK_PI_SRCC0MD.ENDDATE  &                      67700000
 /*     WRK_RUN_DATE8 >= WRK_BAU_SRCC0MD.EFFDATE &                      67710000
 /*     WRK_RUN_DATE8 <= WRK_BAU_SRCC0MD.ENDDATE THEN                   67720000
 /*   DO;                                                               67730000
 /*    USER_FILE_PI.ICUSANO  = USER_FILE_BAU.ICUSANO;                   67740000
 /*   END;                                                              67750000
 /* END;                                             EOC CEDS00000552 */67760000
  END;                                                                  67770000
 END R531_CHECK_SLOT_VALUES;                           /* EOC RB01308 */67780000
1/*********************************************************************/67790000
 /*                                                       SOC RC01158 */67800000
 /* MODULE NAME      :  R629_FETCH_CURSOR_PI_HW                       */67810000
 /*                                                                   */67820000
 /* DESCRIPTION      :                                                */67830000
 /*                                                                   */67840000
 /*********************************************************************/67850000
 R629_FETCH_CURSOR_PI_HW: PROC;                                         67860000
                                                                        67870000
 CURSOR_HW_PI  = '';                                                    67900000
 CURSOR_CTR_PI = '';                                                    67910000
 WRK_CUSTOMER_NUMBER_V10  = '';                        /* SOC RB01289*/ 67920000
 WRK_CUSTOMER_NUMBER_V11  = '';                                         67930000
 WRK_CUSTOMER_NUMBER_V190 = '';                        /* EOC RB01289*/ 67940000
 WRK_OU_CODE_V170         = '';                           /* RB01308 */ 67950000
                                                      /* SOC RB01320 */ 67960000
 WRK_PI_REAL_SERIAL_NO_V125     = '';                                   67970000
 WRK_PI_REAL_SERIAL_NO_V125_IND = '';                                   67980000
                                                      /* EOC RB01320 */ 67990000
 WRK_DSW_Y = WRK_DSW_X;                               /* SOC RB01327 */ 67991000
 WRK_DSW_X = '';                                      /* EOC RB01327 */ 67992000
                                                                        68000000
 EXEC SQL                                                               68010000
   FETCH CURSOR_PI_HW                                                   68020000
   INTO :CURSOR_HW_PI.PRODUCT_TYPE          :WRK_INDNULL                68030000
       ,:CURSOR_HW_PI.ORIGIN                :WRK_INDNULL                68040000
       ,:CURSOR_HW_PI.SEQUENCE_NUMBER       :WRK_INDNULL                68050000
       ,:WRK_PI_ORIGIN                      :WRK_INDNULL                68060000
       ,:CURSOR_HW_PI.MODEL_NUMBER          :WRK_INDNULL                68070000
       ,:CURSOR_HW_PI.BUILT_TO_MODEL_NR     :WRK_INDNULL                68080000
       ,:CURSOR_HW_PI.INSTALL_DATE          :WRK_INDNULL                68090000
       ,:CURSOR_HW_PI.TYPE_OF_MAINT         :WRK_INDNULL                68100000
 /*    ,:CURSOR_HW_PI.TYPE_OF_WARRANTY      :WRK_INDNULL  /* RB01298 */ 68110000
       ,:CURSOR_HW_PI.TYPE_OF_WARRANTY      :WRK_TOW_V051_IND           68120000
                                                          /* RB01298 */ 68130000
                                                      /* SOC RC01194 */ 68140000
       ,:CURSOR_HW_PI.SERVICE_LVL_CODE_1    :WRK_T051_SLC1_IND          68150000
       ,:CURSOR_HW_PI.WARRANTY_SPLT_DATE    :WRK_INDNULL                68160000
       ,:CURSOR_HW_PI.SERVICE_LVL_CODE_2    :WRK_T051_SLC2_IND          68170000
                                                      /* EOC RC01194 */ 68180000
       ,:CURSOR_HW_PI.SERVICE_LVL_CODE_C    :WRK_T051_SLCC_IND          68190000
                                                      /* EOC RC01194 */ 68200000
       ,:CURSOR_HW_PI.WARRANTY_EXP_DATE     :WRK_INDNULL                68210000
       ,:CURSOR_HW_PI.SERVICE_DELIV_FLAG    :WRK_SDF_IND                68220000
 /*    ,:CURSOR_HW_PI.CUSTOMER_NUMBER       :WRK_INDNULL   /* RB01289 */68230000
       ,:CURSOR_HW_PI.CUSTOMER_NUMBER       :WRK_CUSTNO_V51_IND         68240000
                                                           /* RB01289 */68250000
       ,:CURSOR_HW_PI.CUSTOMER_NR_EXTEND    :WRK_INDNULL                68260000
       ,:CURSOR_HW_PI.OU_CODE               :WRK_INDNULL                68270000
       ,:CURSOR_HW_PI.DEALER_NUMBER         :WRK_INDNULL                68280000
       ,:CURSOR_HW_PI.SOURCE_INDICATOR      :WRK_INDNULL                68290000
                                                       /* SOC RB01298 */68300000
   /*  ,:CURSOR_HW_PI.F_TYPE_OF_WARRANTY    :WRK_INDNULL   /* RB01281*/ 68310000
       ,:CURSOR_HW_PI.F_TYPE_OF_WARRANTY    :WRK_FTOW_V051_IND          68320000
                                                       /* EOC RB01298 */68330000
       ,:CURSOR_HW_PI.WARRANTY_LIABILITY    :WRK_INDNULL   /* RB01283 */68340000
       ,:CURSOR_CTR_PI.HVP_QUANTITY         :WRK_INDNULL                68350000
       ,:CURSOR_CTR_PI.CONTRACT_NUMBER      :WRK_INDNULL                68360000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_1     :WRK_INDNULL                68370000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_2     :WRK_INDNULL                68380000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_3     :WRK_INDNULL                68390000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_4     :WRK_INDNULL                68400000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_5     :WRK_INDNULL                68410000
                                                      /* SOC RC01194 */ 68420000
       ,:CURSOR_CTR_PI.COVERAGE_START_1     :WRK_COVERAGE_START_1_IND   68430000
       ,:CURSOR_CTR_PI.COVERAGE_START_2     :WRK_COVERAGE_START_2_IND   68440000
       ,:CURSOR_CTR_PI.COVERAGE_START_3     :WRK_COVERAGE_START_3_IND   68450000
       ,:CURSOR_CTR_PI.COVERAGE_START_4     :WRK_COVERAGE_START_4_IND   68460000
       ,:CURSOR_CTR_PI.COVERAGE_START_5     :WRK_COVERAGE_START_5_IND   68470000
       ,:CURSOR_CTR_PI.COVERAGE_START_6     :WRK_COVERAGE_START_6_IND   68480000
       ,:CURSOR_CTR_PI.COVERAGE_START_7     :WRK_COVERAGE_START_7_IND   68490000
       ,:CURSOR_CTR_PI.COVERAGE_END_1       :WRK_COVERAGE_END_1_IND     68500000
       ,:CURSOR_CTR_PI.COVERAGE_END_2       :WRK_COVERAGE_END_2_IND     68510000
       ,:CURSOR_CTR_PI.COVERAGE_END_3       :WRK_COVERAGE_END_3_IND     68520000
       ,:CURSOR_CTR_PI.COVERAGE_END_4       :WRK_COVERAGE_END_4_IND     68530000
       ,:CURSOR_CTR_PI.COVERAGE_END_5       :WRK_COVERAGE_END_5_IND     68540000
       ,:CURSOR_CTR_PI.COVERAGE_END_6       :WRK_COVERAGE_END_6_IND     68550000
       ,:CURSOR_CTR_PI.COVERAGE_END_7       :WRK_COVERAGE_END_7_IND     68560000
                                                      /* EOC RC01194 */ 68570000
       ,:CURSOR_CTR_PI.SERVICE_TYPE         :WRK_INDNULL                68580000
                                                          /* RC01194 */ 68590000
       ,:CURSOR_CTR_PI.SERVICE_LVL_CODE     :WRK_T241_SLC_IND           68600000
       ,:CURSOR_CTR_PI.SOURCE_INDICATOR     :WRK_INDNULL  /* PTM1408 */ 68610000
       ,:CURSOR_CTR_PI.EFFECTIVE_DATE       :WRK_INDNULL                68620000
       ,:CURSOR_CTR_PI.END_DATE             :WRK_INDNULL                68630000
       ,:CURSOR_CTR_PI.AUTHORISATION_CODE   :WRK_INDNULL  /* RB01272 */ 68640000
                                                       /* SOC RB01289 */68650000
       ,:WRK_CUSTOMER_NUMBER_V10            :WRK_CUSTNO_V10_IND         68660000
       ,:WRK_CUSTOMER_NUMBER_V11            :WRK_CUSTNO_V11_IND         68670000
       ,:WRK_CUSTOMER_NUMBER_V190           :WRK_CUSTNO_V190_IND        68680000
                                                       /* EOC RB01289 */68690000
                                                       /* SOC RB01308 */68700000
       ,:WRK_OU_CODE_V170                   :WRK_OU_CODE_V170_IND       68710000
                                                       /* EOC RB01308 */68720000
                                                       /* SOC RB01320 */68730000
       ,:WRK_PI_REAL_SERIAL_NO_V125      :WRK_PI_REAL_SERIAL_NO_V125_IND68740000
                                                       /* EOC RB01320 */68750000
   ;                                                                    68760000
                                                                        68770000
  SELECT (SQLCODE);                                                     68780000
   WHEN (0)                                                             68790000
     DO;                                                                68800000
       SWITCH_EOC_PI_HW         = FALSE;                                68810000
       SK_PI_HW                 = '';                                   68820000
       SK_PI_HW.EOF             = '0';                                  68830000
       SK_PI_HW.PRODUCT_TYPE    = CURSOR_HW_PI.PRODUCT_TYPE;            68840000
       SK_PI_HW.ORIGIN          = CURSOR_HW_PI.ORIGIN;                  68850000
       SK_PI_HW.SEQUENCE_NUMBER = CURSOR_HW_PI.SEQUENCE_NUMBER;         68860000
       SK_PI_HW.EFFECTIVE_DATE  = CURSOR_CTR_PI.EFFECTIVE_DATE;         68870000
       SK_PI_HW.END_DATE        = CURSOR_CTR_PI.END_DATE;               68880000
                                                      /* EOC RB01236 */ 68900000
       IF CURSOR_CTR_PI.AUTHORISATION_CODE = 'PA' &    /* SOC RB01327*/ 68901000
          CURSOR_HW_PI.WARRANTY_LIABILITY ¬= 'LEN'                      68902000
       THEN DO;                                                         68903000
            WRK_DSW_X = 'DSW';                         /* DSW SOURCE */ 68904000
       END;                                                             68905000
                                                       /* EOC RB01327*/ 68910000
       IF CURSOR_HW_PI.WARRANTY_SPLT_DATE = '3999-12-31'                68920000
       THEN DO;                                                         68930000
         CURSOR_HW_PI.WARRANTY_SPLT_DATE = '';                          68940000
       END;                                                             68950000
     END;                                                               68960000
   WHEN (100)                                                           68970000
     DO;                                                                68980000
       SWITCH_EOC_PI_HW         = TRUE;                                 69000000
       SK_PI_HW.EOF             = '1';                                  69010000
     END;                                                               69020000
   OTHERWISE                                                            69030000
     DO;                                                                69040000
       CALL RCBDRIM_ERROR (ADDR (SQLCA),                                69050000
                           'DB2',                                       69060000
                           '#052');                                     69070000
     END;                                                               69080000
 END;                                                                   69090000
                                                                        69100000
 END R629_FETCH_CURSOR_PI_HW;                          /* EOC RC01158 */69110000
 /*********************************************************************/69120000
 /*                                                    /*SOC  RB01301 */69130000
 /* MODULE NAME      :  R630_FETCH_T051_SDF                           */69140000
 /*                                                                   */69150000
 /* DESCRIPTION      :  READ SDF FROM  RCBT0051                       */69160000
 /*                                                                   */69170000
 /*********************************************************************/69180000
 R630_FETCH_T051_SDF: PROC;                                             69190000
 WRK051_SERVICE_DELIV_FLAG = '';                                        69200000
 PI_PROCESS_SERV_EXT = FALSE;                                           69210000
                                                       /* SOC RC01326 */69230100
 WRK_SOURCE = 'T051';                                                   69230200
                                                                        69230300
 CALL R950_PROCESS_PI_LONG_SER;                                         69230400
                                                                        69230500
 /*IF WRK_PI_REAL_SERIAL_NO_V125_IND = -1 THEN      */ /* SOC RB01320 */69231000
 /*DO;                                                                */69232000
 /* WRK_ORIGIN  = SK_HW_TEMP.ORIGIN;                                  */69233000
 /* WRK_SEQ_NO  = SK_HW_TEMP.SEQUENCE_NUMBER;                         */69234000
 /*END;                                                               */69235000
 /*ELSE                                                               */69236000
 /*DO;                                                                */69237000
 /* WRK_ORIGIN  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,1,2);             */69238000
 /* WRK_SEQ_NO  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,3);               */69239000
 /*END;                                                               */69239100
                                                       /* EOC RB01320 */69239300
                                                       /* EOC RC01326 */69239400
      EXEC SQL                                                          69440000
        SELECT SERVICE_DELIV_FLAG                                       69450000
        INTO  :WRK051_SERVICE_DELIV_FLAG :WRK_SDF_INDNULL               69460000
        FROM   RCBV0051_PI_HW_PR                                        69470000
        WHERE  COUNTRY_NUMBER           = :WRK_CTRYNO                   69480000
               AND  PRODUCT_TYPE        = :SK_HW_TEMP.PRODUCT_TYPE      69490000
                                                     /* SOC RB01320 */  69500000
              /*AND  ORIGIN             = :SK_HW_TEMP.ORIGIN            69510000
                AND  SEQUENCE_NUMBER    = :SK_HW_TEMP.SEQUENCE_NUMBER*/ 69520000
                AND   ORIGIN            = :WRK_ORIGIN                   69530000
                AND   SEQUENCE_NUMBER   = :WRK_SEQ_NO                   69540000
                                                       /* EOC RB01320 */69550000
                AND  INSTALL_DATE      <= :WRK_RUN_DATE                 69560000
                AND  WARRANTY_EXP_DATE >= :WRK_RUN_DATE ;               69570000
   SELECT (SQLCODE);                                                    69580000
    WHEN (0)                                                            69590000
      DO;                                                               69600000
       IF WRK_SDF_INDNULL ¬= -1 & WRK051_SERVICE_DELIV_FLAG ¬= ' '      69610000
       THEN DO;                                                         69620000
         PI_PROCESS_SERV_EXT = TRUE;                                    69630000
       END;                                                             69640000
      END;                                                              69650000
    WHEN (100);                                                         69660000
    OTHERWISE                                                           69670000
      DO;                                                               69680000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               69690000
                            'DB2',                                      69700000
                            '#085');                                    69710000
     END;                                                               69720000
  END;                                                                  69730000
                                                                        69740000
 END R630_FETCH_T051_SDF;                                /*EOC RB01301*/69750000
                                                                        69760000
1/*********************************************************************/69770000
 /*                                                                   */69780000
 /* MODULE NAME      :  R651_PROC_NOT_EQUAL_BLC                       */69790000
 /*                                                                   */69800000
 /* DESCRIPTION      :                                                */69810000
 /*                                                                   */69820000
 /*********************************************************************/69830000
 R651_PROC_NOT_EQUAL_BLC: PROC;                                         69840000
                                                                        69850000
 IF STRING(FILE_RCBDRI1.TYPESER) = '' |                                 69860000
    STRING(FILE_RCBDRI1.TYPESER) = '9999999999999'                      69870000
 THEN;                                                                  69880000
 ELSE                                                                   69890000
   FILE_RCBDRI1.ICUSANO = '000';                                        69900000
                                                                        69910000
 END R651_PROC_NOT_EQUAL_BLC;                                           69920000
1/*********************************************************************/69930000
 /*                                                                   */69940000
 /* MODULE NAME      :  R653_WRITE_RCBDRIK                            */69950000
 /*                                                                   */69960000
 /* DESCRIPTION      :                                                */69970000
 /*                                                                   */69980000
 /*********************************************************************/69990000
 R653_WRITE_RCBDRIK: PROC;                                              70000000
                                                                        70010000
 WRITE FILE(RCBDRIK) FROM (IO_AREA_RCBDRI1);                            70020000
                                                                        70030000
 IF STRING(FILE_RCBDRI1.TYPESER) = '' |                                 70040000
    STRING(FILE_RCBDRI1.TYPESER) = '9999999999999'                      70050000
 THEN;                                                                  70060000
 ELSE DO;                                                               70070000
                                                                        70080000
   CALL RCB018M (SUBSTR(FILE_RCBDRI1.TYPESER.SERNO,5,4),                70090000
               WRK_HASH_TOTAL_1,                                        70100000
               PTR_INT_AREA);                                           70110000
                                                                        70120000
   WRK_CNT_RCBDRIK = WRK_CNT_RCBDRIK + 1;                               70130000
                                                                        70140000
 END;                                                                   70150000
                                                                        70160000
                                                                        70170000
 END R653_WRITE_RCBDRIK;                                                70180000
1/*********************************************************************/70190000
 /*                                                                   */70200000
 /* MODULE NAME      :  R655_PROCESS_ICUSANO                          */70210000
 /*                                                                   */70220000
 /* DESCRIPTION      :                                                */70230000
 /*                                                                   */70240000
 /*********************************************************************/70250000
 R655_PROCESS_ICUSANO: PROC;                                            70260000
                                                                        70270000
 IF STRING(FILE_RCBDRI1.TYPESER) = '' |                                 70280000
    STRING(FILE_RCBDRI1.TYPESER) = '9999999999999'                      70290000
 THEN;                                                                  70300000
 ELSE                                                                   70310000
   FILE_RCBDRI1.ICUSANO = FILE_RCBDRG2.ICUSANO;                         70320000
                                                                        70330000
 END R655_PROCESS_ICUSANO;                                              70340000
1/*********************************************************************/70350000
 /*                                                                   */70360000
 /* MODULE NAME      :  R658_READ_FILE_RCBDRIJ                        */70370000
 /*                                                                   */70380000
 /* DESCRIPTION      :                                                */70390000
 /*                                                                   */70400000
 /*********************************************************************/70410000
 R658_READ_FILE_RCBDRIJ: PROC;                                          70420000
                                                                        70430000
 READ FILE (RCBDRIJ) INTO (IO_AREA_RCBDRI1);                            70440000
                                                                        70450000
 IF ¬SWITCH_END_OF_RCBDRIJ                                              70460000
 THEN                                                                   70470000
   DO;                                                                  70480000
     IF STRING(FILE_RCBDRI1.TYPESER) = '' |                             70490000
        STRING(FILE_RCBDRI1.TYPESER) = '9999999999999'                  70500000
     THEN;                                                              70510000
     ELSE                                                               70520000
       WRK_CNT_RCBDRIJ = WRK_CNT_RCBDRIJ + 1;                           70530000
                                                                        70540000
     SK_RCBDRIJ.CUSTOMER_NUMBER  = FILE_RCBDRI1.SRCC0MD.CUNOUSE;        70550000
     SK_RCBDRIJ.IODPDBU          = STRING(FILE_RCBDRI1.SRCC0MD.IODPDBU);70560000
     SK_RCBDRIJ.AAS_ADD          = FILE_RCBDRI1_AAS_ADD;                70570000
   END;                                                                 70580000
                                                                        70590000
 END R658_READ_FILE_RCBDRIJ;                                            70600000
1/*********************************************************************/70610000
 /*                                                                   */70620000
 /* MODULE NAME      :  R659_READ_FILE_RCBDRG2                        */70630000
 /*                                                                   */70640000
 /* DESCRIPTION      :                                                */70650000
 /*                                                                   */70660000
 /*********************************************************************/70670000
 R659_READ_FILE_RCBDRG2: PROC;                                          70680000
                                                                        70690000
 READ FILE (RCBDRG2) INTO (IO_AREA_RCBDRG2);                            70700000
                                                                        70710000
 IF ¬SWITCH_END_OF_RCBDRG2                                              70720000
  & FILE_RCBDRG2.IDEXRIF = 'M363'                                       70730000
 THEN                                                                   70740000
   DO;                                                                  70750000
     WRK_CNT_RCBDRG2 = WRK_CNT_RCBDRG2 + 1;                             70760000
                                                                        70770000
     SK_RCBDRG2.CUSTOMER_NUMBER  = FILE_RCBDRG2.CUNOUSE;                70780000
     SK_RCBDRG2.IODPDBU          = STRING(FILE_RCBDRG2.IODPDBU);        70790000
     SK_RCBDRG2.AAS_ADD          = FILE_RCBDRG2.AAS_ADD;                70800000
                                                                        70810000
                                              /* UPDATE HASH_TOTAL   */ 70820000
     CALL RCB018M (SUBSTR(FILE_RCBDRG2.CUNOUSE,3,4),                    70830000
                   WRK_HASH_TOTAL_2,                                    70840000
                   PTR_INT_AREA);                                       70850000
                                                                        70860000
   END;                                                                 70870000
                                                                        70880000
 END R659_READ_FILE_RCBDRG2;                                            70890000
1/*********************************************************************/70900000
 /*                                                                   */70910000
 /* MODULE NAME      :  R700_INIT_HW_OCCURENCE                        */70920000
 /*                                                                   */70930000
 /* DESCRIPTION      :                                                */70940000
 /*                                                                   */70950000
 /*********************************************************************/70960000
 R700_INIT_HW_OCCURENCE: PROC;                                          70970000
                                                                        70980000
 FILE_RCBDRI1 = '';                /* INIT FILE STRUCTURE            */ 70990000
                                                                        71000000
 SWITCH_CURRENT_PERIOD_FOUND = FALSE;                                   71010000
                                                    /* CEDS00000497 */  71020000
 /*SWITCH_PIWARR_BAUCTR        = FALSE;             /* CEDS00000494 */  71030000
                                                                        71040000
 WRK_CNT_HIST_PERIODS  = 0;                                             71050000
 WRK_CNT_FUT_PERIODS   = 0;                                             71060000
 WRK_CNT_HIST          = 0;                                /* RB01308 */71070000
 WRK_CNT_FUT           = 0;                                /* RB01308 */71080000
 WRK_PERIOD_HVP_QUANTITY = 1;                                           71090000
                                                                        71100000
                                                      /* SOC RC01158 */ 71110000
 USER_FILE_PI      = '';           /* INIT FILE STRUCTURE            */ 71120000
 USER_FILE_BAU     = '';           /* INIT FILE STRUCTURE - PTM1414  */ 71130000
 USER_FILE_RCBDRI1 = '';           /* INIT FILE STRUCTURE - PTM1414  */ 71140000
                                                                        71150000
 SW_PI = FALSE;                                                         71160000
                                                                        71170000
 WRK_CNT_HIST_PI       = 0;                                             71180000
 WRK_CNT_FUT_PI        = 0;                                             71190000
                                                      /* EOC RC01158 */ 71200000
 TMP_BAU_BASE_WARRANTY_SLC = '';                     /* SOC   RB01308 */71210000
 SWITCH_INTERNAL           = FALSE;                                     71220000
 SWITCH_LEASE_RENTAL       = FALSE;                                     71230000
 PI_FLAG(*)                = FALSE;                                     71240000
 WRK_PI_FLAG               = FALSE;                                     71250000
 BAU_FLAG(*)               = FALSE;                                     71260000
 WRK_BAU_FLAG              = FALSE;                  /* EOC   RB01308 */71270000
                                                                        71300000
 CALL R701_INIT_HW_PERIOD;                                              71310000
                                                                        71320000
 END R700_INIT_HW_OCCURENCE;                                            71330000
1/*********************************************************************/71340000
 /*                                                                   */71350000
 /* MODULE NAME      :  R701_INIT_HW_PERIOD                           */71360000
 /*                                                                   */71370000
 /* DESCRIPTION      :                                                */71380000
 /*                                                                   */71390000
 /*********************************************************************/71400000
 R701_INIT_HW_PERIOD: PROC;                                             71410000
 WRK_BAU_FLAG          = FALSE;                        /* SOC RB01308 */71420000
 SWITCH_INTERNAL       = FALSE;                                         71430000
 SWITCH_LEASE_RENTAL   = FALSE;                        /* EOC RB01308 */71440000
                                   /* DETERMINE CURRENT HW PERIOD    */ 71450000
 /*IF SK_INST_HW_2 < SK_OO_HW_2  */                    /* SOC RB01308 */71460000
 IF SK_INST_HW_2 <= SK_OO_HW_2                         /* EOC RB01308 */71470000
 THEN                                                                   71480000
   DO;                                                                  71490000
     IF SK_INST_HW_2 < SK_OO_HW_2  THEN                /* SOC RC01326 */71491000
     DO;                                               /* EOC RC01326 */71500000
     SK_CURRENT_HW = SK_INST_HW;                                        71500100
     SWITCH_BAU_ONLY = TRUE;                           /* SOC RC01326 */71500200
     SWITCH_PI_ONLY  = FALSE;                                           71500300
     SWITCH_OO_ONLY  = FALSE;                                           71500400
     SWITCH_BAU_PI   = FALSE;                                           71500500
     SWITCH_BAU_OO   = FALSE;                                           71500600
     END;                                                               71500700
     IF SK_INST_HW_2 = SK_OO_HW_2  THEN                                 71500800
     DO;                                                                71500900
        SK_CURRENT_HW = SK_INST_HW;                   /* CEDS00000634 */71501000
        SWITCH_BAU_OO   = TRUE;                                         71501100
        SWITCH_BAU_ONLY = FALSE;                                        71501200
        SWITCH_PI_ONLY  = FALSE;                                        71501300
        SWITCH_OO_ONLY  = FALSE;                                        71501400
        SWITCH_BAU_PI   = FALSE;                                        71501500
     END;                                              /* EOC RC01326 */71502000
   END;                                                                 71510000
 ELSE                                                                   71520000
   DO;                                                                  71530000
     SK_CURRENT_HW = SK_OO_HW;                                          71540000
     SWITCH_OO_ONLY = TRUE;                                /* RC01326 */71541000
   END;                                                                 71550000
                                                                        71560000
 PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_CURRENT_HW);     /* RC01141  */ 71570000
                                                                        71580000
 IF ((VERIFY(CURSOR_INST_HW_V220.TYPE_OF_MAINT,       /* SOC RB01308 */ 71590000
       WRK_TPMNT_VAL.TPMNT_INTERNAL ) = '0'     ) &                     71600000
     (CURSOR_INST_HW_V220.SOURCE_INDICATOR = '')  ) THEN                71610000
 DO;                                                                    71620000
  WRK_BAU_FLAG.SW_INTERNAL = TRUE ;                                     71630000
  SWITCH_INTERNAL      = TRUE ;                                         71640000
 END;                                                                   71650000
                                                                        71660000
 IF ((VERIFY(CURSOR_INST_HW_V220.TYPE_OF_MAINT,                         71670000
      WRK_TPMNT_VAL.TPMNT_ST1 ) = '0'          ) &                      71680000
     (CURSOR_INST_HW_V220.SOURCE_INDICATOR = '')  ) THEN                71690000
 DO;                                                                    71700000
  WRK_BAU_FLAG.SW_LEASE_RENTAL = TRUE ;                                 71710000
  SWITCH_LEASE_RENTAL      = TRUE ;                                     71720000
 END;                                                                   71730000
       /* SET BASE WARR SLC EQUAL TO T220.SLC1, IF THE T220 PERIOD IS */71740000
       /* CURRENTLY ACTIVE, THIS WILL BE UPDATED TO USER_FILE_BAU ONLY*/71750000
       /* WHEN CONTRACT OVERLAPS WITH WARRANTY FOR CURRENT SLOT       */71760000
 IF CURSOR_INST_HW_V220.EFFECTIVE_DATE <= WRK_RUN_DATE &                71770000
    CURSOR_INST_HW_V220.END_DATE       >= WRK_RUN_DATE &                71780000
    WRK_T220_SLC_IND                   ¬= -1           THEN             71790000
    TMP_BAU_BASE_WARRANTY_SLC =                                         71800000
                   CURSOR_INST_HW_V220.SERVICE_LVL_CODE;                71810000
                                                                        71820000
                          /* OVERWRITE BW SLC FOR FW/HB SECOND PERIOD */71830000
 IF CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY ¬= ''           &            71840000
    CURSOR_INST_HW_V220.F_SPLT_DATE        <= WRK_RUN_DATE &            71850000
    CURSOR_INST_HW_V220.END_DATE           >= WRK_RUN_DATE THEN         71860000
  DO;   /* OVERWRITE BW SLC WITH T220.SLC1, IF IT IS IN FW 2ND PERIOD */71870000
   IF CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY  = WRK_FW_TOW &            71880000
      WRK_T220_SLC_IND                       ¬= -1         THEN         71890000
      TMP_BAU_BASE_WARRANTY_SLC =                                       71900000
                  CURSOR_INST_HW_V220.SERVICE_LVL_CODE;                 71910000
                                                  /* SOC CEDS00000551 */71920000
  /*OLD /* OVERWRITE BW SLC WITH T220.SLC2, IF IT IS IN HB 2ND PERIOD */71930000
  /*NEW /* OVERWRITE BW SLC WITH BLANK, IF IT IS IN HB 2ND PERIOD     */71940000
                                                  /* EOC CEDS00000551 */71950000
   IF CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY  = WRK_HB_TOM &            71960000
      WRK_SLC2_V220_IND                      ¬= -1         THEN         71970000
                                                  /* SOC CEDS00000551 */71980000
  /*  TMP_BAU_BASE_WARRANTY_SLC =                                       71990000
                  CURSOR_INST_HW_V220.SERVICE_LVL_CODE_2;  */           72000000
      TMP_BAU_BASE_WARRANTY_SLC = '';                                   72010000
                                                  /* EOC CEDS00000551 */72020000
  END;                                                 /* EOC RB01308 */72030000
 END R701_INIT_HW_PERIOD;                                               72040000
1/*********************************************************************/72050000
 /*                                                       SOC RC01158 */72060000
 /* MODULE NAME      :  R710_PROCESS_PI_HW                            */72070000
 /*                                                                   */72080000
 /* DESCRIPTION      :                                                */72090000
 /*                                                                   */72100000
 /*********************************************************************/72110000
 R710_PROCESS_PI_HW: PROC;                                              72120000
                                                                        72130000
 USER_FILE_PI.IDEXRIF = 'M362';                                         72140000
                                                                        72150000
 USER_FILE_PI.TYPE    = CURSOR_HW_PI.PRODUCT_TYPE;                      72160000
 USER_FILE_PI.SERNO   = CURSOR_HW_PI.ORIGIN                             72170000
                     || CURSOR_HW_PI.SEQUENCE_NUMBER;                   72180000
                                                       /* SOC RB01320 */72190000
 USER_FILE_PI.SERIAL_LNG = WRK_PI_REAL_SERIAL_NO_V125;                  72200000
                                                       /* EOC RB01320 */72210000
 USER_FILE_PI.DPIS    = '3';                                            72220000
                                                                        72230000
 IF WRK_PI_ORIGIN = 'T051'                                              72240000
 |  WRK_PI_ORIGIN = 'BOTH'                                              72250000
 THEN DO;                                                               72260000
   USER_FILE_PI.MOD            = CURSOR_HW_PI.MODEL_NUMBER;             72270000
                                                      /* SOC RB01308 */ 72280000
   /*FILE_RCBDRI1.BUILT_TO_MOD   = CURSOR_HW_PI.BUILT_TO_MODEL_NR; */   72290000
   USER_FILE_PI.BUILT_TO_MOD   =                                        72300000
                          CURSOR_HW_PI.BUILT_TO_MODEL_NR;               72310000
                                                      /* EOC RB01308 */ 72320000
   USER_FILE_PI.MKINSDAT       = R013_TRANS_DATE                        72330000
                                (CURSOR_HW_PI.INSTALL_DATE);            72340000
   USER_FILE_PI.WED            = R013_TRANS_DATE                        72350000
                                (CURSOR_HW_PI.WARRANTY_EXP_DATE);       72360000
                                                       /* SOC RB01298 */72370000
 /* IF A MACHINE IS EFFECTIVE UNDER HB PERIOD THEN WED IS POPULATED   */72380000
 /* AS SPLT DATE-1                                                    */72390000
   IF (CURSOR_HW_PI.F_TYPE_OF_WARRANTY = WRK_HB_TOM)                    72400000
   THEN DO;                                                             72410000
     WRK_PI_HB_WED          =                                           72420000
                 R014_DATE_CALC(CURSOR_HW_PI.WARRANTY_SPLT_DATE,-1);    72430000
     USER_FILE_PI.WED       =                                           72440000
                 R013_TRANS_DATE(WRK_PI_HB_WED);                        72450000
   END;                                                /* EOC RB01298 */72460000
                                                       /* SOC RB01308 */72470000
          /* FOR WARR, BRAND WARR, SPLIT WARR PERIOD-1, FLEXIBLE WARR */72480000
          /* PERIOD-2, BASE WARR SLC IS TAKEN AS T051.SLC1.           */72490000
                                                  /* SOC CEDS00000551 */72500000
  /* OLD  /* FOR SPLIT WARR PERIOD-2 OR HARD BUNDLE PERID-2, BASE WARR*/72510000
  /* OLD  /* SLC IS TAKEN AS T051.SLC2.                               */72520000
  /* NEW  /* FOR SPLIT WARR PERIOD-2, BASE WARR SLC WILL BE T051.SLC2 */72530000
  /* NEW  /* FOR HARD BUNDLE PERIOD-2, BASE WARR SLC WILL BE BLANK    */72540000
                                                  /* EOC CEDS00000551 */72550000
          /* SAME WILL BE UPDATED TO USER_FILE_PI ONLY WHEN CONTRACT  */72560000
          /* OVERLAPS WITH WARR                                       */72570000
   TMP_PI_BASE_WARRANTY_SLC = '';                                       72580000
                                                                        72590000
   IF CURSOR_HW_PI.WARRANTY_EXP_DATE >= WRK_RUN_DATE THEN               72600000
    DO;                                     /* 2ND PERIOD OF WARRANTY */72610000
     IF (CURSOR_HW_PI.WARRANTY_SPLT_DATE ¬= '')           &             72620000
        (CURSOR_HW_PI.WARRANTY_SPLT_DATE <= WRK_RUN_DATE) THEN          72630000
      DO;                                                               72640000
       IF CURSOR_HW_PI.F_TYPE_OF_WARRANTY = WRK_FW_TOW THEN             72650000
        DO;                                                             72660000
         IF WRK_T051_SLC1_IND ¬= -1 THEN                                72670000
          TMP_PI_BASE_WARRANTY_SLC = CURSOR_HW_PI.SERVICE_LVL_CODE_1;   72680000
        END;                                                            72690000
       ELSE                                                             72700000
        DO;                                                             72710000
      /* IF WRK_T051_SLC2_IND ¬= -1 THEN */       /* SOC CEDS00000551 */72720000
         IF WRK_T051_SLC2_IND ¬= -1 &                                   72730000
            CURSOR_HW_PI.F_TYPE_OF_WARRANTY = '' &                      72740000
            CURSOR_HW_PI.F_TYPE_OF_WARRANTY ¬= WRK_HB_TOM THEN          72750000
                                                  /* EOC CEDS00000551 */72760000
          TMP_PI_BASE_WARRANTY_SLC = CURSOR_HW_PI.SERVICE_LVL_CODE_2;   72770000
        END;                                                            72780000
      END;                                                              72790000
     ELSE                                   /* 1ST PERIOD OF WARRANTY */72800000
      DO;                                                               72810000
       IF WRK_T051_SLC1_IND ¬= -1 THEN                                  72820000
        TMP_PI_BASE_WARRANTY_SLC = CURSOR_HW_PI.SERVICE_LVL_CODE_1;     72830000
      END;                                                              72840000
    END;                                                                72850000
                                                       /* EOC RB01308 */72860000
   USER_FILE_PI.ICUSANO        = CURSOR_HW_PI.CUSTOMER_NR_EXTEND;       72870000
   STRING(USER_FILE_PI.MKBINA) = CURSOR_HW_PI.OU_CODE;     /* PTM1202 */72880000
   USER_FILE_PI.DEALER_NUMBER  = CURSOR_HW_PI.DEALER_NUMBER;            72890000
 END;                                                                   72900000
                                                                        72910000
 IF PARM_RCB005.ADDRESS_RES = '1'                                       72920000
 THEN DO;                                                               72930000
   USER_FILE_PI_AAS_ADD     = 'PRIME';                                  72940000
 END;                                                                   72950000
                                                      /* SOC RB01236 */ 72960000
 NUMBER_OF_DATES = 0;                  /* INIT DATE_TABLE            */ 72970000
 DATE_TABLE(*)   = '';                                                  72980000
 SW_ADD_H_END    = '0'B;                                                72990000
 CTR_COUNT       = 0;                  /* INIT T0241-ROWS PER TOS    */ 73000000
 SAVED_CTR_PI(*) = '';                 /* CLEAR CONTRACT SAVE ARRAY  */ 73010000
 SAVED_HW_PI     = '';                 /* CLEAR INVENTORY SAVE AREA  */ 73020000
 SAV_T051_SLC1_IND = -1;               /* INIT. NULL-INDICATORS      */ 73030000
 SAV_T051_SLC2_IND = -1;                                                73040000
 SAV_T051_SLCC_IND = -1;                                                73050000
 SAV_SDF_IND       = -1;                                                73060000
                                                                        73070000
 SAV_PI_HW.PRODUCT_TYPE    = SK_PI_HW.PRODUCT_TYPE;    /* SAVE TOS   */ 73080000
 SAV_PI_HW.ORIGIN          = SK_PI_HW.ORIGIN;                           73090000
 SAV_PI_HW.SEQUENCE_NUMBER = SK_PI_HW.SEQUENCE_NUMBER;                  73100000
                                                                        73110000
 CALL R620_PROCESS_PI_PERIODS;                                          73120000
 CALL R629_FETCH_CURSOR_PI_HW;                                          73140000
 DO WHILE (SAV_PI_HW.PRODUCT_TYPE    = SK_PI_HW.PRODUCT_TYPE            73150000
        &  SAV_PI_HW.ORIGIN          = SK_PI_HW.ORIGIN                  73160000
        &  SAV_PI_HW.SEQUENCE_NUMBER = SK_PI_HW.SEQUENCE_NUMBER         73170000
        &  SWITCH_EOC_PI_HW          = FALSE);                          73180000
   CALL R620_PROCESS_PI_PERIODS;       /* PROCESS SAME TOS           */ 73190000
   CALL R629_FETCH_CURSOR_PI_HW;                                        73210000
 END;                                                                   73220000
                                                                        73230000
 IF SW_ADD_H_END = '1'B THEN                                            73240000
   CALL R526_ADD_DATE_TO_TABLE ('EH', H_END);             /* RA01224 */ 73250000
                                                                        73260000
 IF NUMBER_OF_DATES > 0                /* PERIODS TO BE PROCESSED ?  */ 73270000
 THEN DO;                                                               73280000
   IF NUMBER_OF_DATES > 2              /* WARRANTY + SERVICE         */ 73290000
   THEN DO;                                                             73300000
     CALL R525_SORT_DATE_TABLE;                                         73310000
   END;                                                                 73320000
   CALL R527_PROCESS_DATE_TABLE;                                        73330000
 END;                                                                   73340000
                                                      /* EOC RB01236 */ 73350000
 END R710_PROCESS_PI_HW;                               /* EOC RC01158 */73360000
1/*********************************************************************/73370000
 /*                                                       SOC RC01158 */73380000
 /* MODULE NAME      :  R720_PROCESS_REGULAR_HW                       */73390000
 /*                                                                   */73400000
 /* DESCRIPTION      :                                                */73410000
 /*                                                                   */73420000
 /*********************************************************************/73430000
 R720_PROCESS_REGULAR_HW: PROC;                                         73440000
                                                                        73450000
                                                                        73460000
 DO WHILE (  SK_INST_HW_1 = SK_CURRENT_HW_1                             73470000
           | SK_OO_HW_1 = SK_CURRENT_HW_1);                             73480000
                                                                        73490000
   SW_WARRANTY = FALSE;                                   /* PTM1114 */ 73500000
   SW_MAINT_02 = FALSE;                                   /* PTM1130 */ 73510000
 /*SWITCH_PIWARR_BAUCTR = FALSE;                     /* CEDS00000493 */ 73520000
                                                     /* CEDS00000494 */ 73530000
   CALL R701_INIT_HW_PERIOD;                                            73540000
   SELECT;                                                              73550000
                                     /****************************** */ 73560000
                                     /* PROCESS INSTALLED HW PERIOD  */ 73570000
                                     /****************************** */ 73580000
     WHEN (SK_INST_HW_2 <= SK_OO_HW_2)                                  73590000
       DO;                                                              73600000
         CALL R600_FILL_INST_PERIOD;                                    73610000
                                                                        73620000
                                      /* IF SERVICE CONTRACT         */ 73630000
 /*      IF CURSOR_INST_HW_V220.TYPE_OF_MAINT =       /* SOC RB01290 */ 73640000
 /*                                       WRK_TPMNT_VAL.TPMNT_ST2_DEF*/ 73650000
         IF ((CURSOR_INST_HW_V220.TYPE_OF_MAINT =                       73660000
                                       WRK_TPMNT_VAL.TPMNT_ST2_DEF)|    73670000
             (SWITCH_INTERNAL_MACHINE_CTR = TRUE))    /* EOC RB01290 */ 73680000
         THEN                                                           73690000
           DO;                        /* PROCESS SERV_CTR PERIODS    */ 73700000
             SW_MAINT_02 = TRUE;                          /* PTM1130 */ 73710000
             CALL R500_INIT_SERV_CTR_PERIOD;                            73730000
               DO WHILE (¬ SWITCH_EOC_SERV_CTR);                        73740000
                 CALL R600_FILL_INST_PERIOD;         /* CEDS00000327 */ 73750000
                 CALL R400_RETR_ADD_CONTR_INFO;                         73760000
                                                      /* SOC PTM0988 */ 73770000
                 CALL R402_FILL_SERV_CTR_PERIOD(                        73780000
                             R010_MAX_DATE(TB_RCBV240.EFFECTIVE_DATE,   73790000
                                           SK_CURRENT_HW.EFFECTIVE_DATE,73800000
                                           ''),                         73810000
                             R011_MIN_DATE(TB_RCBV240.END_DATE,         73820000
                                           SK_CURRENT_HW.END_DATE,      73830000
                                           ''));                        73840000
                                                      /* EOC PTM0988 */ 73850000
                 CALL R404_PROCESS_FILLED_PERIOD;                       73860000
                 CALL R409_FETCH_CURSOR_SERV_CTR;                       73870000
               END;                                                     73890000
             CALL R505_END_SERV_CTR_PERIOD;                             73900000
           END;                                                         73910000
         ELSE                                                           73920000
           DO;                        /* PROCESS WARRANTY PERIODS    */ 73930000
             IF VERIFY (CURSOR_INST_HW_V220.TYPE_OF_WARRANTY,           73940000
                        WRK_TPMNT_VAL.TPMNT_WAR) = 0                    73950000
                                                    /* SOC RB01281 */   73960000
              | VERIFY(CURSOR_INST_HW_V220. F_TYPE_OF_WARRANTY,         73970000
                                  WRK_FW_TOW) = 0   /* SOC RB01298 */   73980000
        /*      SUBSTR(PARM_RCB063S.F_WARRANTY_MACHINE,1,1)) = 0 */     73990000
                                                    /* EOC RB01281 */   74000000
              | VERIFY(CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY,          74010000
                                  WRK_HB_TOM) = 0                       74020000
                                                    /* EOC RB01298 */   74030000
              | SWITCH_INTERNAL | SWITCH_LEASE_RENTAL     /* RB01308 */ 74040000
             THEN                                                       74050000
               DO;                                                      74060000
                                                      /* SOC RB01308 */ 74070000
                  IF ¬SWITCH_INTERNAL & ¬SWITCH_LEASE_RENTAL THEN       74080000
                   DO;                                /* EOC RB01308 */ 74090000
                    SW_WARRANTY = TRUE;                                 74100000
                    WRK_BAU_FLAG.SW_BAU_WARR = TRUE;  /* SOC RB01308 */ 74120000
                   END;                               /* EOC RB01308 */ 74130000
                  CALL R500_INIT_SERV_CTR_PERIOD;                       74140000
                                                      /* SOC PTM0988 */ 74150000
                  DO WHILE (¬ SWITCH_EOC_SERV_CTR);                     74160000
                    IF PROCESS_BRAND_WARR THEN       /* CEDS00000491 */ 74170000
                      CALL R410_CHECK_GAP;                              74180000
                    CALL R409_FETCH_CURSOR_SERV_CTR;                    74200000
                  END;                                                  74210000
 /*               IF HLP_EFF_DATE < SK_CURRENT_HW.END_DATE   RB01308 */ 74220000
                  IF HLP_EFF_DATE <= SK_CURRENT_HW.END_DATE/*RB01308 */ 74230000
                  THEN DO;              /* IF SUPPLY CONTRACT        */ 74240000
                    IF PROCESS_BRAND_WARR THEN       /* CEDS00000491 */ 74250000
                    DO;                              /* CEDS00000491 */ 74260000
                      CALL R600_FILL_INST_PERIOD;                       74280000
                      CALL R405_FILL_SUPPL_CTR_PERIOD(HLP_EFF_DATE,     74290000
                                                SK_INST_HW.END_DATE);   74300000
                      CALL R404_PROCESS_FILLED_PERIOD;                  74310000
                    END;                             /* CEDS00000491 */ 74320000
                  END;                                                  74330000
                                                      /* EOC PTM0988 */ 74340000
                  CALL R505_END_SERV_CTR_PERIOD;                        74350000
               END;                                                     74360000
             ELSE                                                       74370000
               DO;                    /* IF SUPPLY CONTRACT          */ 74380000
                 WRK_BAU_FLAG.SW_BAU_PERCALL = TRUE ;     /* RB01308 */ 74390000
                 CALL R405_FILL_SUPPL_CTR_PERIOD(                       74410000
                                   SK_INST_HW.EFFECTIVE_DATE,           74420000
                                   SK_INST_HW.END_DATE);                74430000
                 CALL R404_PROCESS_FILLED_PERIOD;                       74440000
               END;                                                     74450000
           END;                                                         74460000
                                                                        74470000
                                     /* IF INST HW PERIOD IS CURRENT */ 74480000
         IF WRK_RUN_DATE >= SK_INST_HW.EFFECTIVE_DATE                   74490000
          & WRK_RUN_DATE <= SK_INST_HW.END_DATE                         74500000
         THEN                                                           74510000
           DO;                                                          74520000
              CALL R508_RETR_ADD_CURRENT_INFO;                          74540000
              CALL R509_FILL_CURRENT_INFO;                              74550000
           END;                                                         74560000
                                                                        74570000
                                                      /* SOC RB01281 */ 74580000
       /* FETCH THE NEXT RECORD                        */               74590000
       /* IF THE CURRENT RECORD IS NOT A FLEXIBLE      */               74600000
       /* WARRANTY RECORD       (OR)                   */               74610000
       /* IF THE ISS WARRANTY OF A FLEXIBLE WARRANTY   */               74620000
       /* RECORD IS ALREADY PROCESSED                  */               74630000
                                                                        74640000
         IF (CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY = '' &              74650000
             CURSOR_INST_HW_V220.F_SPLT_DATE = '')                      74660000
           |((CURSOR_INST_HW_V220.F_SPLT_DATE >  /* SOC CEDS00000491 */ 74670000
                         WRK_END_DATE_SAVE) &                           74680000
              (WRK_END_DATE_SAVE < WRK_RUN_DATE))/* EOC CEDS00000491 */ 74690000
           | SW_FW_PROCESS_BAU THEN                                     74700000
           DO;                                                          74710000
                                                 /* SOC CEDS00000491 */ 74720000
             IF ((CURSOR_INST_HW_V220.F_SPLT_DATE <                     74730000
                SK_INST_HW.EFFECTIVE_DATE ) &                           74740000
                (CURSOR_INST_HW_V220.F_SPLT_DATE <= WRK_RUN_DATE)) &    74750000
                PROCESS_BRAND_WARR = FALSE                              74760000
             THEN                                                       74770000
               DO;                                                      74780000
                 CURSOR_INST_HW_V220.F_SPLT_DATE =                      74790000
                           /* SK_INST_HW.EFFECTIVE_DATE      RB01308 */ 74800000
                              SK_INST_HW.EFFECTIVE_DATE;  /* RB01308 */ 74810000
                 CALL R417_PROCESS_FW_MACHINE;                          74820000
                 SW_FW_PROCESS_BAU = '1'B;                              74830000
                 PROCESS_BRAND_WARR = TRUE;                             74840000
               END;                                                     74850000
             ELSE                                                       74860000
               DO;                                                      74870000
                  SW_FW_PROCESS_BAU = '0'B;                             74880000
                  CALL R609_FETCH_CURSOR_INST_HW;                       74920000
               END;                              /* EOC CEDS00000491 */ 74930000
           END;                                                         74940000
                                                                        74950000
       /* SKIP THE FETCH FOR ISS WARRANTY PERIOD       */               74960000
       /* OF A FLEXIBLE WARRANTY MACHINE               */               74970000
                                                                        74980000
         ELSE                                                           74990000
           DO;                                                          75000000
             CALL R417_PROCESS_FW_MACHINE;                              75010000
             SW_FW_PROCESS_BAU = '1'B;  /* ISS WARRANTY IS PROCESSED */ 75020000
           END;                                                         75030000
                                                      /* EOC RB01281 */ 75040000
                                                                        75050000
         /*  FIX, IF KEYS ARE EQUAL THEN ONLY PROCESS  */               75060000
         /* THE INSTALLED PERIOD, SKIP THE ON ORDER   */                75070000
                                                                        75080000
         IF SK_INST_HW_2 = SK_OO_HW_2                                   75090000
         THEN                                                           75100000
           DO;                                                          75110000
             CALL R619_FETCH_CURSOR_OO_HW;                              75120000
           END;                                                         75130000
                                                                        75140000
       END;                                                             75150000
                                     /****************************** */ 75160000
                                     /* PROCESS ON ORDER HW PERIOD   */ 75170000
                                     /****************************** */ 75180000
     WHEN (SK_INST_HW_2 > SK_OO_HW_2)                                   75190000
       DO;                                                              75200000
         CALL R610_PROCESS_OO_HW;                                       75210000
         BAU_FLAG(5).SW_BAU_OO = TRUE;                    /* RB01308 */ 75220000
         CALL R619_FETCH_CURSOR_OO_HW;                                  75230000
       END;                                                             75240000
                                                                        75250000
   END;                                                                 75260000
 END;                                              /* WHILE SAME HW  */ 75270000
                                                                        75280000
 END R720_PROCESS_REGULAR_HW;                          /* EOC RC01158 */75290000
1/*********************************************************************/75300000
 /*                                                                   */75310000
 /* MODULE NAME      :  R740_FINISH_HW_OCCURENCE                      */75320000
 /*                                                                   */75330000
 /* DESCRIPTION      :                                                */75340000
 /*                                                                   */75350000
 /*********************************************************************/75360000
 R740_FINISH_HW_OCCURENCE: PROC;                                        75370000
                                                                        75380000
                                                      /* SOC RC01158 */ 75390000
 IF SWITCH_CURRENT_PERIOD_FOUND                                         75430000
 THEN DO;                                                               75440000
   IF SW_PI        /****** BOTH BAU AND PI PRESENTED TO RCBDRAU ******/ 75450000
   THEN DO;                                                             75460000
                                                                        75470000
   /*FILE_RCBDRI1.QHSIHIS = WRK_CNT_HIST_PERIODS;     /* SOC RB01308 */ 75480000
   /*FILE_RCBDRI1.QHSIFUT = WRK_CNT_FUT_PERIODS;                     */ 75490000
                                                                        75500000
     FILE_RCBDRI1.QHSIHIS = WRK_CNT_HIST;                               75510000
     FILE_RCBDRI1.QHSIFUT = WRK_CNT_FUT;                                75520000
                                                                        75530000
     USER_FILE_BAU.QHSIHIS = WRK_CNT_HIST_PERIODS;                      75540000
     USER_FILE_BAU.QHSIFUT = WRK_CNT_FUT_PERIODS;     /* EOC RB01308 */ 75550000
                                                                        75560000
     USER_FILE_PI.QHSIHIS = WRK_CNT_HIST_PI;                            75570000
     USER_FILE_PI.QHSIFUT = WRK_CNT_FUT_PI;                             75580000
                                                                        75590000
     /* THERE WAS ONLY A T241 ENTRY, GET RELEVANT INFO FROM BAU */      75600000
    /* IF USER_FILE_PI.SRCC0MD.CUNOUSE = ''            RB01289  */      75610000
                                                       /* SOC RB01308 */75620000
            /* COMMENTED OUT, IT IS HANDLED IN R531_CHECK_SLOT_VALUES */75630000
  /* IF SAV_PI_ORIGIN = 'T241'                         /* SOC RB01289 */75640000
  /* THEN DO;                                                         */75650000
  /*   IF USER_FILE_PI.SRCC0MD.CUNOUSE = '' THEN DO;                  */75660000
  /*     USER_FILE_PI.SRCC0MD.CUNOUSE = FILE_RCBDRI1.SRCC0MD.CUNOUSE; */75670000
  /*   END;                                            /* EOC RB01289 */75680000
  /*   USER_FILE_PI.SRCC0MD.BUCODE = FILE_RCBDRI1.SRCC0MD.BUCODE;     */75690000
  /*   USER_FILE_PI.SRCC0MD.TPMNT = FILE_RCBDRI1.SRCC0MD.TPMNT;       */75700000
  /* END;                                              /* EOC RB01308 */75710000
                                                                        75720000
     DATA_ORIGIN = '2';               /* ORIGIN OF DATA: BOTH        */ 75730000
                                                      /* SOC RB01301 */ 75740000
                                                                        75750000
                                                      /* SOC RB01308 */ 75760000
                                                                        75770000
   /*SK_HW_TEMP.PRODUCT_TYPE     = SK_CURRENT_HW.PRODUCT_TYPE           75780000
     SK_HW_TEMP.ORIGIN           = SK_CURRENT_HW.ORIGIN                 75790000
     SK_HW_TEMP.SEQUENCE_NUMBER  = SK_CURRENT_HW.SEQUENCE_NUMBER */     75800000
     SK_HW_TEMP.PRODUCT_TYPE     = SK_CURRENT_HW.PRODUCT_TYPE;          75810000
     SK_HW_TEMP.ORIGIN           = SK_CURRENT_HW.ORIGIN;                75820000
     SK_HW_TEMP.SEQUENCE_NUMBER  = SK_CURRENT_HW.SEQUENCE_NUMBER;       75830000
                                                      /* EOC RB01308 */ 75840000
     CALL R960_PROCESS_SERVICE_EXTN;                                    75940000
     FILE_RCBDRI1.SERV_EXTENSION = TEMP_SERV_EXTENSION;                 75950000
                                                      /* SOC RB01308 */ 75970000
     USER_FILE_BAU.SERV_EXTENSION = BAU_SERV_EXTENSION;                 75980000
     USER_FILE_PI.SERV_EXTENSION  = PI_SERV_EXTENSION;                  76000000
  /* CALL R965_FILL_BASE_WARANTY_SLC;                                */ 76020000
  /* FILE_RCBDRI1.BASE_WARRANTY_SLC = TEMP_BASE_WARRANTY_SLC;        */ 76030000
                                                      /* EOC RB01301 */ 76040000
  /*  USER_FILE_BAU = FILE_RCBDRI1, BY NAME;          /* EOC RB01308 */ 76050000
                                                                        76060000
     CALL R621_PROCESS_USER_EXIT;                                       76070000
     CALL R749_WRITE_RCBDRII;                                           76080000
   END;                                                                 76090000
   ELSE DO;               /****** ONLY BAU PRESENTED TO RCBDRAU ******/ 76100000
                                                                        76110000
   /*FILE_RCBDRI1.QHSIHIS = WRK_CNT_HIST_PERIODS;     /* SOC RB01308 */ 76120000
   /*FILE_RCBDRI1.QHSIFUT = WRK_CNT_FUT_PERIODS;                     */ 76130000
                                                                        76140000
     FILE_RCBDRI1.QHSIHIS = WRK_CNT_HIST;                               76150000
     FILE_RCBDRI1.QHSIFUT = WRK_CNT_FUT;                                76160000
                                                                        76170000
     USER_FILE_BAU.QHSIHIS = WRK_CNT_HIST_PERIODS;                      76180000
     USER_FILE_BAU.QHSIFUT = WRK_CNT_FUT_PERIODS;     /* EOC RB01308 */ 76190000
                                                                        76200000
     DATA_ORIGIN  = '0';              /* ORIGIN OF DATA: BAU CEDS    */ 76210000
                                                      /* SOC RB01301 */ 76220000
                                                                        76230000
                                                      /* SOC RB01308 */ 76240000
   /*SK_HW_TEMP.PRODUCT_TYPE     = SK_CURRENT_HW.PRODUCT_TYPE           76250000
     SK_HW_TEMP.ORIGIN           = SK_CURRENT_HW.ORIGIN                 76260000
     SK_HW_TEMP.SEQUENCE_NUMBER  = SK_CURRENT_HW.SEQUENCE_NUMBER  */    76270000
     SK_HW_TEMP.PRODUCT_TYPE     = SK_CURRENT_HW.PRODUCT_TYPE;          76280000
     SK_HW_TEMP.ORIGIN           = SK_CURRENT_HW.ORIGIN;                76290000
     SK_HW_TEMP.SEQUENCE_NUMBER  = SK_CURRENT_HW.SEQUENCE_NUMBER;       76300000
                                                      /* EOC RB01308 */ 76310000
                                                                        76320000
     CALL R960_PROCESS_SERVICE_EXTN;                                    76330000
     FILE_RCBDRI1.SERV_EXTENSION = TEMP_SERV_EXTENSION;                 76340000
                                                      /* SOC RB01308 */ 76370000
     USER_FILE_BAU.SERV_EXTENSION = BAU_SERV_EXTENSION;                 76380000
  /* CALL R965_FILL_BASE_WARANTY_SLC;                                */ 76410000
  /* FILE_RCBDRI1.BASE_WARRANTY_SLC = TEMP_BASE_WARRANTY_SLC;        */ 76420000
                                                      /* EOC RB01308 */ 76430000
                                                      /* EOC RB01301 */ 76440000
     USER_FILE_PI = '';                                                 76450000
  /* USER_FILE_BAU = FILE_RCBDRI1, BY NAME;               /* RB01308 */ 76470000
                                                                        76480000
     CALL R621_PROCESS_USER_EXIT;                                       76490000
     CALL R749_WRITE_RCBDRII;                                           76500000
   END;                                                                 76510000
 END;                                                                   76520000
 ELSE DO;                                                               76530000
                                                      /* SOC RB01308 */ 76540000
 /*IF SW_PI                /****** ONLY PI PRESENTED TO RCBDRAU ******/ 76550000
   IF SW_PI &              /****** ONLY PI PRESENTED TO RCBDRAU ******/ 76560000
      PARM_RCB005.PI_TO_RCMS = 'Y'                    /* EOC RB01308 */ 76570000
   THEN DO;                                                             76580000
                                                                        76590000
     /* THERE WAS ONLY A T241 ENTRY, DATA WILL NOT BE PASSED */         76610000
     /* IF USER_FILE_PI.SRCC0MD.CUNOUSE = ''                 RB01289 */ 76620000
     IF SAV_PI_ORIGIN = 'T241'                            /* RB01289 */ 76630000
     THEN DO;                                                           76640000
     END;                                                               76650000
     ELSE DO;                                                           76660000
       SK_HW_TEMP = SAV_PI_HW;                                          76670000
                                                                        76710000
       CALL R960_PROCESS_SERVICE_EXTN;                /* SOC RB01301 */ 76720000
                                                      /* SOC RB01308 */ 76730000
    /* USER_FILE_PI.SERV_EXTENSION  = TEMP_SERV_EXTENSION;           */ 76740000
       USER_FILE_PI.SERV_EXTENSION  = PI_SERV_EXTENSION;                76750000
       FILE_RCBDRI1.SERV_EXTENSION  = TEMP_SERV_EXTENSION;              76780000
    /* CALL R965_FILL_BASE_WARANTY_SLC;                              */ 76810000
    /* USER_FILE_PI.BASE_WARRANTY_SLC = TEMP_BASE_WARRANTY_SLC;      */ 76820000
                                                      /* EOC RB01308 */ 76830000
                                                      /* EOC RB01301 */ 76840000
 /*    FILE_RCBDRI1         = USER_FILE_PI, BY NAME;    SOC  RB01308 */ 76850000
                                                                        76860000
 /*    FILE_RCBDRI1.QHSIHIS = WRK_CNT_HIST_PI;  */                      76870000
 /*    FILE_RCBDRI1.QHSIFUT = WRK_CNT_FUT_PI;   */                      76880000
                                                                        76890000
       FILE_RCBDRI1.QHSIHIS = WRK_CNT_HIST;                             76900000
       FILE_RCBDRI1.QHSIFUT = WRK_CNT_FUT;                              76910000
                                                     /* EOC  RB01308 */ 76920000
       USER_FILE_PI.QHSIHIS = WRK_CNT_HIST_PI;            /* PTM1401 */ 76930000
       USER_FILE_PI.QHSIFUT = WRK_CNT_FUT_PI;             /* PTM1401 */ 76940000
                                                                        76950000
       DATA_ORIGIN  = '1';            /* ORIGIN OF DATA: PRIME INPUT */ 76960000
       USER_FILE_BAU = '';            /* RA01224                     */ 76970000
                                                                        76980000
       CALL R621_PROCESS_USER_EXIT;                                     76990000
       USER_FILE_PI = '';             /* RA01224 VISIBILITY IN RCBDRAU*/77000000
       CALL R749_WRITE_RCBDRII;                                         77010000
     END;                                                               77020000
   END;                                                                 77030000
 END;                                                                   77040000
                                                                        77050000
 SWITCH_CURRENT_PERIOD_FOUND = FALSE;                                   77060000
 SW_PI = FALSE;                                                         77070000
                                                      /* EOC RC01158 */ 77080000
 END R740_FINISH_HW_OCCURENCE;                                          77090000
1/*********************************************************************/77100000
 /*                                                                   */77110000
 /* MODULE NAME      :  R749_WRITE_RCBDRII                            */77120000
 /*                                                                   */77130000
 /* DESCRIPTION      :                                                */77140000
 /*                                                                   */77150000
 /*********************************************************************/77160000
 R749_WRITE_RCBDRII: PROC;                                              77170000
                                       /* IF ADDRESS RES. NOT ASKED  */ 77180000
                                       /* FOR, RCBDRCI = OUTPUT FILE */ 77190000
 IF PARM_RCB005.ADDRESS_RES ¬= '1'                                      77200000
   THEN DO;                             /* UPDATE HASH_TOTAL         */ 77210000
          CALL RCB018M (SUBSTR(FILE_RCBDRI1.TYPESER.SERNO,5,4),         77220000
                        WRK_HASH_TOTAL_1,                               77230000
                        PTR_INT_AREA);                                  77240000
        END;                                                            77250000
                                                                        77260000
 IF  WRK_DSW_Y = 'DSW'                                 /* SOC RB01327*/ 77261000
   THEN DO;                                                             77262000
                    /* UPDATING SOURCE INDICATOR 'D' FOR DSW MACHINES*/ 77263000
          SUBSTR(IO_AREA_RCBDRI1,109,1) = 'D';                          77264000
          WRK_DSW_Y = '';                                               77265000
        END;                                           /* EOC RB01327*/ 77266000
                                                       /* SOC RC01353 */77266100
 IF FILE_RCBDRI1.SRCC0MD.IAGRTCN     = 'SERVINT' THEN                   77267100
    FILE_RCBDRI1.SRCC0MD.SSRCIND     = 'I';                             77268000
                                                                        77269000
 IF FILE_RCBDRI1.HF_SLOT(1).IAGRTCN  = 'SERVINT' THEN                   77269100
    FILE_RCBDRI1.HF_SLOT(1).SSRCIND  = 'I';                             77269200
                                                                        77269300
 IF FILE_RCBDRI1.HF_SLOT(2).IAGRTCN  = 'SERVINT' THEN                   77269400
    FILE_RCBDRI1.HF_SLOT(2).SSRCIND  = 'I';                             77269500
                                                                        77269600
 IF FILE_RCBDRI1.HF_SLOT(3).IAGRTCN  = 'SERVINT' THEN                   77269700
    FILE_RCBDRI1.HF_SLOT(3).SSRCIND  = 'I';                             77269800
                                                                        77269900
 IF FILE_RCBDRI1.HF_SLOT(4).IAGRTCN  = 'SERVINT' THEN                   77270000
    FILE_RCBDRI1.HF_SLOT(4).SSRCIND  = 'I';                             77270100
                                                       /* SOC RC01359 */77270207
 IF FILE_RCBDRI1.SERIAL_LNG = FILE_RCBDRI1.TYPESER.SERNO THEN           77270303
  DO;                                                                   77270403
   IF (LENGTH(TRIM(FILE_RCBDRI1.TYPESER.SERNO)) = 9 &                   77270606
        SUBSTR(FILE_RCBDRI1.TYPESER.SERNO,3,2) ='00') THEN              77270703
    DO;                                                                 77270803
     FILE_RCBDRI1.SERIAL_LNG = SUBSTR(FILE_RCBDRI1.TYPESER.SERNO,1,2)|| 77270903
                               SUBSTR(FILE_RCBDRI1.TYPESER.SERNO,5,5);  77271003
    END;                                                                77271103
  END;                                                 /* EOC RC01359 */77271207
                                                       /* EOC RC01353 */77271300
 WRITE FILE(RCBDRII) FROM (IO_AREA_RCBDRI1);                            77272000
                                                                        77280000
 WRK_CNT_RCBDRII = WRK_CNT_RCBDRII + 1;                                 77290000
                                                                        77300000
 END R749_WRITE_RCBDRII;                                                77310000
1/*********************************************************************/77320000
 /*                                                                   */77330000
 /* MODULE NAME      : R750_CHECK_LENOVO                    RB01272   */77340000
 /*                                                                   */77350000
 /* DESCRIPTION      : CHECK THAT THE RETRIEVED PI DATA IS EITHER AN  */77360000
 /*                    IBM MACHINE OR A LENOVO MACHINE AND SET THE    */77370000
 /*                    SOURCE INDICATOR ACCORDINGLY.                  */77380000
 /*                                                                   */77390000
 /*                    THIS USES THE PLINCL RCBLENO WHICH CALCULATES  */77400000
 /*                    THE LENOVO TRANSACTION INDICATOR (LTI).        */77410000
 /*                    - A VALUE OF BLANK MEANS IT IS NOT LENOVO      */77420000
 /*                      THERFORE LEAVE THE SOURCE INDICATOR AS IS    */77430000
 /*                    - A VALUE OF '1' MEANS LENOVO BASE WARRANTY    */77440000
 /*                      CHANGE THE SOURCE INSICATOR TO 'Y'           */77450000
 /*                    - A VALUE OF '2' MEANS LENOVO SERVICE OFFERING */77460000
 /*                      CHANGE THE SOURCE INSICATOR TO 'Z'           */77470000
 /*                    - INCLUDED NEW VARIABLE 'ORIGIN' FOR CEDS 3.3  */77480000
 /*                                                                   */77490000
 /*********************************************************************/77500000
0/*R750_CHECK_LENOVO : PROC (WRK_INSTALL_DATE,          /*SOC RC01295 */77510000
 /*                         WRK_WARR_EXP_DATE,          /*EOC RC01295 */77520000
 R750_CHECK_LENOVO : PROC (WRK_WARR_EXP_DATE,                           77530000
                           WRK_AUTHORISATION_CODE,                      77540000
                           WRK_EFFECTIVE_DATE,                          77550000
                           WRK_END_DATE,                                77560000
                           WRK_PERIOD_DATE,                             77570000
                           WRK_WARRANTY_LIABILITY);        /* RB01283 */77580000
                                                                        77590000
 /*DCL WRK_INSTALL_DATE          CHAR(10);                 /* RC01295 */77600000
 DCL WRK_WARR_EXP_DATE         CHAR(10);                                77610000
 DCL WRK_AUTHORISATION_CODE    CHAR(10);                                77620000
 DCL WRK_EFFECTIVE_DATE        CHAR(10);                                77630000
 DCL WRK_END_DATE              CHAR(10);                                77640000
 DCL WRK_PERIOD_DATE           CHAR(10);                                77650000
 DCL WRK_LENOVO_TI             CHAR(01);                                77660000
 DCL WRK_WARRANTY_LIABILITY    CHAR(03);                   /* RB01283 */77670000
                                                                        77680000
 /*IF WRK_INSTALL_DATE >= WRK_LENOVO_DATE  THEN         /*SOC RC01295 */77690000
 /*DO;                                                  /*EOC RC01295 */77700000
                                                                        77710000
     WRK_LENOVO_TI = CALCULATE_LTI (WRK_WARR_EXP_DATE,                  77720000
                                    WRK_AUTHORISATION_CODE,             77730000
                                    WRK_EFFECTIVE_DATE,                 77740000
                                    WRK_END_DATE,                       77750000
                                    WRK_PERIOD_DATE,                    77760000
                                    WRK_WARRANTY_LIABILITY);            77770000
                                                           /* RB01283 */77780000
                                                                        77790000
     SELECT(WRK_LENOVO_TI);                                             77800000
       WHEN(' ');                                                       77810000
       WHEN('1')                                                        77820000
         WRK_PERIOD.SSRCIND = 'Y';                                      77830000
       WHEN('2')                                                        77840000
         WRK_PERIOD.SSRCIND = 'Z';                                      77850000
       OTHERWISE;                                                       77860000
     END;                                                               77870000
                                                                        77880000
 /*  END;                                                  /* RC01295 */77890000
                                                                        77900000
 END R750_CHECK_LENOVO;                                                 77910000
 %INCLUDE RCBLENO;                                                      77920000
 /* R755_READ_REV_DIV IS NOT USED ANY MORE. ITS COMMENTED SOC RB01308 */77930000
1/*********************************************************************/77940000
 /*                                                                   */77950000
 /* MODULE NAME      : R755_READ_REV_DIV                   RB01272    */77960000
 /*                                                                   */77970000
 /* DESCRIPTION      : READ THE EXACT REFERENCED ROW FROM RCBT0400    */77980000
 /*                    THIS RETRIEVES THE PRODUCT REVENUE DIVISION    */77990000
 /*                    LENOVO PRODUCTS WILL HAVE A VALUE OF '44'      */78000000
 /*                    IF AN EXACT MATCH IS NOT FOIUND ON MODEL NO    */78010000
 /*                    THEN THE DEFAULT (BLANK) MODEL NUMBER IS USED  */78020000
 /*                    TO RETRIVE THE ROW.                            */78030000
 /*                                                                   */78040000
 /*********************************************************************/78050000
 /*R755_READ_REV_DIV : PROC;                                            78060000
 /*                                                                     78070000
 /*DCL WRK_PRODUCT_TYPE  CHAR(04);                                      78080000
 /*DCL WRK_MODEL         CHAR(03);                                      78090000
 /*                                                                     78100000
 /*WRK_PRODUCT_TYPE  = USER_FILE_PI.TYPE;                               78110000
 /*WRK_MODEL         = USER_FILE_PI.MOD;                                78120000
 /*                                                                     78130000
 /*EXEC SQL                                                             78140000
 /*     SELECT PROD_REVENUE_DIV                                         78150000
 /*      INTO :TB_RCBV400.PROD_REVENUE_DIV                              78160000
 /*           :WRK_INDNULL                                              78170000
 /*      FROM  RCBV0400_PO_MOD1  T400                                   78180000
 /*     WHERE  T400.COUNTRY_NUMBER  = :WRK_CTRYNO                       78190000
 /*       AND  T400.PRODUCT_TYPE    = :WRK_PRODUCT_TYPE                 78200000
 /*       AND  T400.MODEL_NUMBER    = :WRK_MODEL                        78210000
 /*       AND :WRK_RUN_DATE    BETWEEN T400.EFFECTIVE_DATE              78220000
 /*                                AND T400.END_DATE                    78230000
 /*     WITH UR;                                                        78240000
 /*                                                                     78250000
 /*SELECT(SQLCODE);                                                     78260000
 /*  WHEN(0);                                                           78270000
 /*  WHEN(100)                                                          78280000
 /*    DO;                                                              78290000
 /*      EXEC SQL                                                       78300000
 /*           SELECT PROD_REVENUE_DIV                                   78310000
 /*            INTO :TB_RCBV400.PROD_REVENUE_DIV                        78320000
 /*                 :WRK_INDNULL                                        78330000
 /*            FROM  RCBV0400_PO_MOD1  T400                             78340000
 /*           WHERE  T400.COUNTRY_NUMBER  = :WRK_CTRYNO                 78350000
 /*             AND  T400.PRODUCT_TYPE    = :WRK_PRODUCT_TYPE           78360000
 /*             AND  T400.MODEL_NUMBER    = ''                          78370000
 /*             AND :WRK_RUN_DATE    BETWEEN T400.EFFECTIVE_DATE        78380000
 /*                                      AND T400.END_DATE              78390000
 /*           WITH UR;                                                  78400000
 /*                                                                     78410000
 /*      SELECT(SQLCODE);                                               78420000
 /*        WHEN(0);                                                     78430000
 /*        WHEN(100);                                                   78440000
 /*        OTHERWISE                                                    78450000
 /*          DO;                                                        78460000
 /*            CALL RCBDRIM_ERROR (ADDR (SQLCA),                        78470000
 /*                        'DB2',                                       78480000
 /*                        '#053');                                     78490000
 /*          END;                                                       78500000
 /*      END;                                                           78510000
 /*    END;                                                             78520000
 /*  OTHERWISE                                                          78530000
 /*    DO;                                                              78540000
 /*      CALL RCBDRIM_ERROR (ADDR (SQLCA),                              78550000
 /*                  'DB2',                                             78560000
 /*                  '#054');                                           78570000
 /*    END;                                                             78580000
 /*END;                                                                 78590000
 /*END R755_READ_REV_DIV;                             /* EOC RB01308 */ 78600000
1/********************************************************************/ 78610000
 /*                                                                  */ 78620000
 /* MODULE NAME      : R800_INIT_PROCESSING                          */ 78630000
 /*                                                                  */ 78640000
 /* DESCRIPTION      : OPEN AND INTITIAL FETCH CURSORS               */ 78650000
 /*                                                                  */ 78660000
 /********************************************************************/ 78670000
 R800_INIT_PROCESSING: PROC;                                            78680000
                                                      /* SOC RC01326 */ 78681000
 SWITCH_BAU_ONLY  = FALSE;                                              78682000
 SWITCH_PI_ONLY   = FALSE;                                              78683000
 SWITCH_OO_ONLY   = FALSE;                                              78684000
 SWITCH_BAU_PI    = FALSE;                                              78685000
 SWITCH_BAU_OO    = FALSE;                            /* EOC RC01326 */ 78686000
                                       /* INIT CURSOR CURSOR_INST_HW */ 78690000
 EXEC SQL                                                               78700000
   OPEN CURSOR_INST_HW;                                                 78710000
                                                                        78720000
 SELECT (SQLCODE);                                                      78730000
   WHEN (0);                                                            78740000
   OTHERWISE                                                            78750000
     DO;                                                                78760000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               78770000
                    'DB2',                                              78780000
                    '#055');                                            78790000
     END;                                                               78800000
 END;                                                                   78810000
               /* FETCH FIRST OCCURENCE OF CURSOR_CU                 */ 78820000
 CALL R609_FETCH_CURSOR_INST_HW;                                        78840000
                                                                        78850000
 EXEC SQL                                                               78860000
   OPEN CURSOR_OO_HW;                                                   78870000
                                                                        78880000
 SELECT (SQLCODE);                                                      78890000
   WHEN (0);                                                            78900000
   OTHERWISE                                                            78910000
     DO;                                                                78920000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               78930000
                    'DB2',                                              78940000
                    '#056');                                            78950000
     END;                                                               78960000
 END;                                                                   78970000
               /* FETCH FIRST OCCURENCE OF CURSOR_CU                 */ 78980000
 CALL R619_FETCH_CURSOR_OO_HW;                                          79000000
                                                                        79010000
                                                      /* SOC RC01158 */ 79020000
 EXEC SQL                              /* INIT CURSOR CURSOR_PI_HW   */ 79030000
   OPEN CURSOR_PI_HW;                                                   79040000
                                                                        79050000
 SELECT (SQLCODE);                                                      79060000
   WHEN (0);                                                            79070000
   OTHERWISE                                                            79080000
     DO;                                                                79090000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               79100000
                    'DB2',                                              79110000
                    '#057');                                            79120000
     END;                                                               79130000
 END;                                                                   79140000
                                                                        79150000
               /* FETCH FIRST OCCURENCE OF CURSOR_PI_HW              */ 79160000
 CALL R629_FETCH_CURSOR_PI_HW;                                          79180000
                                                      /* EOC RC01158 */ 79190000
                                                                        79200000
                                                                        79210000
                                                                        79220000
                                            /* OPEN FILE RCBDRII     */ 79230000
 OPEN FILE(RCBDRII);                                                    79240000
                                                                        79250000
                                         /* INIT AND FILL HEADER REC */ 79260000
 FILE_RCBDRI1 = '';                                                     79270000
 FILE_RCBDRI1_H.KEY                     = '';                           79280000
 FILE_RCBDRI1_H.PROCESS_NAME            = 'RCMS HW';                    79290000
 FILE_RCBDRI1_H.FILE_TYPE               = 'DELTA EXTR';                 79300000
 FILE_RCBDRI1_H.COUNTRY_NUMBER          = WRK_CTRYNO;                   79310000
 FILE_RCBDRI1_H.RUN_DATE                = WRK_RUN_DATE;                 79320000
 FILE_RCBDRI1_H.TIME_STAMP              = WRK_TIME_STAMP;               79330000
                                                                        79340000
 WRITE FILE(RCBDRII) FROM (IO_AREA_RCBDRI1);                            79350000
                                                                        79360000
                                                                        79370000
 END R800_INIT_PROCESSING;                                              79380000
1/********************************************************************/ 79390000
 /*                                                                  */ 79400000
 /* MODULE NAME      : R849_END_PROCESSING                           */ 79410000
 /*                                                                  */ 79420000
 /* DESCRIPTION      : CLOSE CURSOR                                  */ 79430000
 /*                                                                  */ 79440000
 /********************************************************************/ 79450000
 R849_END_PROCESSING: PROC;                                             79460000
                             /* CLOSE CURSOR CURSOR_INST_HW          */ 79470000
 EXEC SQL                                                               79480000
   CLOSE CURSOR_INST_HW;                                                79490000
                                                                        79500000
 SELECT (SQLCODE);                                                      79510000
   WHEN (0);                                                            79520000
   OTHERWISE                                                            79530000
     DO;                                                                79540000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               79550000
                            'DB2',                                      79560000
                            '#058');                                    79570000
     END;                                                               79580000
 END;                                                                   79590000
                                                                        79600000
                             /* CLOSE CURSOR CURSOR_OO_HW            */ 79610000
 EXEC SQL                                                               79620000
   CLOSE CURSOR_OO_HW;                                                  79630000
                                                                        79640000
 SELECT (SQLCODE);                                                      79650000
   WHEN (0);                                                            79660000
   OTHERWISE                                                            79670000
     DO;                                                                79680000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               79690000
                            'DB2',                                      79700000
                            '#059');                                    79710000
     END;                                                               79720000
 END;                                                                   79730000
                                                                        79740000
                                                                        79750000
                                         /* INIT AND FILL TRAILER REC*/ 79760000
 FILE_RCBDRI1 = '';                                                     79770000
 FILE_RCBDRI1_H.KEY                     = (20)'9';                      79780000
 FILE_RCBDRI1_H.PROCESS_NAME            = 'RCMS HW';                    79790000
 FILE_RCBDRI1_H.FILE_TYPE               = 'DELTA EXTR';                 79800000
 FILE_RCBDRI1_H.COUNTRY_NUMBER          = WRK_CTRYNO;                   79810000
 FILE_RCBDRI1_H.RUN_DATE                = WRK_RUN_DATE;                 79820000
 FILE_RCBDRI1_H.TIME_STAMP              = '';                           79830000
                                                                        79840000
                                     /* WRITE TRAILER REC TO RCBDRII*/  79850000
 WRITE FILE(RCBDRII) FROM (IO_AREA_RCBDRI1);                            79860000
                                                                        79870000
                               /* CLOSE FILE RCBDRII                 */ 79880000
 CLOSE FILE(RCBDRII);                                                   79890000
                                                                        79900000
 END R849_END_PROCESSING;                                               79910000
                                                                        79920000
1/*********************************************************************/79930000
 /*                                                                   */79940000
 /* MODULE NAME      :  R850_SORT_FOR_ADDR_RES                        */79950000
 /*                                                                   */79960000
 /* DESCRIPTION      :                                                */79970000
 /*                                                                   */79980000
 /*********************************************************************/79990000
 R850_SORT_FOR_ADDR_RES: PROC;                                          80000000
                                                                        80010000
                                                                        80020000
 UNSPEC (SORT_FIELDS.MAX_STORAGE) = '00000000'B || UNSPEC('MAX');       80030000
                                                                        80040000
                               /* SORT CUST/OU/AAS_ADD PTM 572  */      80050000
 CALL PLISRTA                                                           80060000
 (' SORT FIELDS=(110,16,CH,A,1293,5,CH,A),DYNALLOC ',                   80070000
 /* ' RECORD TYPE=F,LENGTH=(1312) ',                   /* SOC RC01302 */80080000
                                                       /* SOC RB01320 */80090000
 /* ' RECORD TYPE=F,LENGTH=(1330) ', */                /* EOC RC01302 */80100000
    ' RECORD TYPE=F,LENGTH=(1360) ',                                    80110000
                                                       /* EOC RB01320 */80120000
  SORT_FIELDS.MAX_STORAGE,                                              80130000
  SORT_FIELDS.RETURN_CODE,                                              80140000
  'ADDR');                                                              80150000
                                            /* EVALUATE SORT         */ 80160000
 CALL PLIRETC (SORT_FIELDS.RETURN_CODE);                                80170000
                                                                        80180000
 SELECT (SORT_FIELDS.RETURN_CODE);                                      80190000
 WHEN ('');                                                             80200000
 OTHERWISE                                                              80210000
   DO;                                                                  80220000
     PARM_INT_AREA.MESSAGE_TYPE = 'IS';                                 80230000
     PARM_INT_AREA.MESSAGE_NUMBER = '0011';                             80240000
     PARM_INT_AREA.MSG_VAR_CODES = ' ';                                 80250000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6 = 'RC';                      80260000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = SORT_FIELDS.RETURN_CODE;  80270000
     CALL RCB0M1M (PTR_INT_AREA);                                       80280000
     CALL RCBDRIM_ERROR (NULL, 'OTHER', '#060');                        80290000
   END;                                                                 80300000
 END;                                                                   80310000
                                                                        80320000
 END R850_SORT_FOR_ADDR_RES;                                            80330000
                                                                        80340000
1/********************************************************************/ 80350000
 /*                                                                  */ 80360000
 /* MODULE NAME      :  R860_INIT_PROCESS_SORT                       */ 80370000
 /*                                                                  */ 80380000
 /* DESCRIPTION      : INIT PROCESS SORT                             */ 80390000
 /*                    - OPEN/READ FIRST RECORD SORTFILE             */ 80400000
 /*                    - OPEN/READ HEADER COMPARE FILE               */ 80410000
 /*                    - CHECK HEADER                                */ 80420000
 /*                    - READ FIRST DATA RECORD COMPARE FILE         */ 80430000
 /*                    - OPEN OUTPUT FILE                            */ 80440000
 /*                                                                  */ 80450000
 /********************************************************************/ 80460000
 R860_INIT_PROCESS_SORT: PROC;                                          80470000
                                                                        80480000
 OPEN FILE (RCBDRIJ);                                                   80490000
 OPEN FILE (RCBDRIK);                                                   80500000
 OPEN FILE (RCBDRG2);                                                   80510000
                                                                        80520000
                                        /* READ HEADER CUSTOMER FILE */ 80530000
 CALL R659_READ_FILE_RCBDRG2;                                           80540000
                                                                        80550000
                                                /* CHECK HEADER      */ 80560000
                                 /* RETRIEVE PARAMETER RCB024        */ 80570000
 TB_RCBV500            = '';                                            80580000
 TB_RCBV500_I          = '';                                            80590000
 TB_RCBP24S.NUMBER     = 'RCB024';                                      80600000
 TB_RCBP24S.PROC_ID    = 'DR05';          /* = RCMS CUSTOMER EXTRACT */ 80610000
 TB_RCBP24S.CTRYNO     = WRK_CTRYNO;                                    80620000
 TB_RCBP24S.FILE_NAME  = WRK_FILE_NAME_G;                               80630000
                                                                        80640000
0CALL RCBI50M ('U',                                       /* RC01219 */ 80650000
               ADDR(TB_RCBV500),                                        80660000
               ADDR(TB_RCBV500_I),                                      80670000
               PTR_RETURN_AREA_BB,                                      80680000
               PTR_INT_AREA);                                           80690000
                                                                        80700000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    80710000
   WHEN (0)                                                             80720000
     DO;                                                                80730000
       PARM_RCB024 = TB_RCBP24S, BY NAME;                               80740000
                                                                        80750000
       IF PARM_RCB024.TIME_STAMP ¬= FILE_RCBDRG2_H.TIME_STAMP           80760000
       THEN                                                             80770000
         DO;                                                            80780000
           PARM_INT_AREA.MESSAGE_TYPE = 'IS';                           80790000
           PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER = '0174';              80800000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES = '';                   80810000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6 = 'FL';                80820000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = WRK_FILE_NAME_G;    80830000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7 = 'TS';                80840000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                     80850000
                                             PARM_RCB024.TIME_STAMP;    80860000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8 = 'TS';                80870000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8 =                     80880000
                                          FILE_RCBDRG2_H.TIME_STAMP;    80890000
           CALL RCB0M1M (PTR_INT_AREA);                                 80900000
           CALL RCBDRIM_ERROR (NULL, 'OTHER', '#061');                  80910000
         END;                                                           80920000
     END;                                                               80930000
   WHEN (4)                                                             80940000
     DO;                                                                80950000
       PARM_INT_AREA.MESSAGE_TYPE = 'IS';                               80960000
       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER = 'I050';                  80970000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES = ' ';                      80980000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6 = 'PN';                    80990000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                         81000000
                             TB_RCBV500.PARAMETER_NUMBER;               81010000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7 = 'PK';                    81020000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                         81030000
                               TB_RCBV500.PARAMETER_KEY;                81040000
       CALL RCB0M1M (PTR_INT_AREA);                                     81050000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#062');                      81060000
     END;                                                               81070000
   OTHERWISE                                                            81080000
     DO;                                                                81090000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            81100000
                           'DB2',                                       81110000
                           '#063');                                     81120000
     END;                                                               81130000
 END;                                                                   81140000
                                                                        81150000
                                  /* READ FIRST DATARECORDS          */ 81160000
 CALL R658_READ_FILE_RCBDRIJ;                                           81170000
 CALL R659_READ_FILE_RCBDRG2;                                           81180000
                                                                        81190000
 END R860_INIT_PROCESS_SORT;                                            81200000
                                                                        81210000
1/*********************************************************************/81220000
 /*                                                                   */81230000
 /* MODULE NAME      :  R870_END_PROCESS_SORT                         */81240000
 /*                                                                   */81250000
 /* DESCRIPTION      :                                                */81260000
 /*                                                                   */81270000
 /*********************************************************************/81280000
 R870_END_PROCESS_SORT: PROC;                                           81290000
                                                                        81300000
 CLOSE FILE (RCBDRG2);                                                  81310000
 CLOSE FILE (RCBDRIJ);                                                  81320000
 CLOSE FILE (RCBDRIK);                                                  81330000
                                                                        81340000
                                 /* CHECK HASH_TOTAL                 */ 81350000
 IF PARM_RCB024.HASH_TOTAL ¬= WRK_HASH_TOTAL_2                          81360000
 THEN                                                                   81370000
   DO;                                                                  81380000
     PARM_INT_AREA.MESSAGE_TYPE = 'IS';                                 81390000
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER = '0175';                    81400000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES = '';                         81410000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6 = 'FL';                      81420000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = WRK_FILE_NAME_G;          81430000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7 = 'HT';                      81440000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = PARM_RCB024.HASH_TOTAL;   81450000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_8 = 'HT';                      81460000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_8 = WRK_HASH_TOTAL_2;         81470000
     CALL RCB0M1M (PTR_INT_AREA);                                       81480000
     CALL RCBDRIM_ERROR (NULL,                                          81490000
                         'OTHER',                                       81500000
                         '#064');                                       81510000
   END;                                                                 81520000
                                                                        81530000
  IF WRK_CNT_RCBDRII ¬= WRK_CNT_RCBDRIJ               /* SOC RB01308 */ 81540000
  THEN                                                                  81550000
    DO;                                                                 81560000
      PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                           81570000
      PARM_INT_AREA.MESSAGE_NUMBER    = '0265';                         81580000
      PARM_INT_AREA.MSG_VAR_CODES     = '';                             81590000
      PARM_INT_AREA.MSG_VAR_CODE_6    = 'FL';                           81600000
      PARM_INT_AREA.MSG_VAR_VALUE_6   = 'RCBDRII';                      81610000
      PARM_INT_AREA.MSG_VAR_CODE_7    = 'C7';                           81620000
      PARM_INT_AREA.MSG_VAR_VALUE_7   = WRK_CNT_RCBDRII;                81630000
      PARM_INT_AREA.MSG_VAR_CODE_8    = 'FL';                           81640000
      PARM_INT_AREA.MSG_VAR_VALUE_8   = 'RCBDRIJ';                      81650000
      PARM_INT_AREA.MSG_VAR_CODE_9    = 'C8';                           81660000
      PARM_INT_AREA.MSG_VAR_VALUE_9   = WRK_CNT_RCBDRIJ;                81670000
      CALL RCB0M1M (PTR_INT_AREA);                                      81680000
      CALL RCBDRIM_ERROR (NULL, 'OTHER', '#103');                       81690000
    END;                                              /* EOC RB01308 */ 81700000
 END R870_END_PROCESS_SORT;                                             81710000
1/********************************************************************/ 81720000
 /*                                                                  */ 81730000
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 81740000
 /*                                                                  */ 81750000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 81760000
 /*                                                                  */ 81770000
 /********************************************************************/ 81780000
 R900_INIT_PROGRAM: PROC;                                               81790000
                                             /* INITIALISE POINTERS  */ 81800000
 PTR_INT_AREA       = ADDR(PARM_INT_AREA);                              81810000
 PTR_RETURN_AREA_BB = ADDR(RETURN_AREA_BB);                             81820000
 PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA);                              81830000
 PTR_RUN_DATE_AREA  = ADDR (RUN_DATE_AREA);                             81840000
                                             /* INITIALISE VARIABLES */ 81850000
 PARM_INT_AREA.MSG_AREA       = '';                                     81860000
 PARM_INT_AREA.ERR_AREA       = ' ';                                    81870000
 PARM_INT_AREA.MSG_REQUEST    = 'O';                                    81880000
 PARM_INT_AREA.MSG_TARGET     = 'F';                                    81890000
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                  81900000
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                           81910000
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           81920000
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      81930000
 PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                        81940000
 PARM_INT_AREA.TXN_CODE       = '';                                     81950000
 PARM_INT_AREA.VERSION        = '';                                     81960000
 PARM_INT_AREA.PTR_PCB_IO     = NULL;                                   81970000
 PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                   81980000
                                              /* OPEN MESSAGE FILE   */ 81990000
 CALL RCB0M1M(PTR_INT_AREA);                                            82000000
                                              /* RETR. SYSTEM DATE   */ 82010000
 CALL RCB0T1M(PTR_INT_AREA);                                            82020000
                                                                        82030000
                                              /* RETRIEVE COUNTRY    */ 82040000
 CALL RCB019M (PTR_COUNTRY_AREA,                                        82050000
               PTR_INT_AREA);                                           82060000
                                                                        82070000
 SELECT;                                      /* ONLY ONE COUNTRY    */ 82080000
   WHEN(COUNTRY_AREA.COUNT_CTRY = 0)                                    82090000
     DO;                                                                82100000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            82110000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            82120000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          82130000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                        82140000
       CALL RCB0M1M (PTR_INT_AREA);                                     82150000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#065');                      82160000
     END;                                                               82170000
   WHEN(COUNTRY_AREA.COUNT_CTRY > 1)                                    82180000
     DO;                                                                82190000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            82200000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            82210000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          82220000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0189';                        82230000
       CALL RCB0M1M (PTR_INT_AREA);                                     82240000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#066');                      82250000
     END;                                                               82260000
   OTHERWISE                                                            82270000
     DO;                                                                82280000
       WRK_PROC_ID  = COUNTRY_AREA.PROC_ID;                             82290000
       WRK_CTRYNO   = COUNTRY_AREA.CTRY_ARRAY(1).CTRYNO;                82300000
       WRK_PGR_TYPE = COUNTRY_AREA.CTRY_ARRAY(1).PGR_TYPE;              82310000
     END;                                                               82320000
 END;                                                                   82330000
                                 /* LOCK TABLES                      */ 82350000
 CALL R001_LOCK_TABLES;                                                 82360000
                                                /* RETRIEVE RUN DATE */ 82370000
 RUN_DATE_AREA.PROC_ID   =  WRK_PROC_ID;                                82380000
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 82390000
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               82400000
                                                                        82410000
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       82420000
               PTR_INT_AREA);                                           82430000
                                                                        82440000
 IF RUN_DATE_AREA.RUN_DATE = ''         /* NO RUN DATE RCB001 FOUND  */ 82450000
 THEN                                                                   82460000
   DO;                                                                  82470000
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          82480000
   END;                                                                 82490000
 ELSE                                                                   82500000
   DO;                                                                  82510000
     WRK_RUN_DATE  = RUN_DATE_AREA.RUN_DATE;                            82520000
   END;                                                                 82530000
                                                                        82540000
 PARM_INT_AREA.RUN_DATE = WRK_RUN_DATE;              /* CEDS00000735 */ 82541002
 WRK_RUN_DATE8 = R013_TRANS_DATE(WRK_RUN_DATE);                         82550000
                                                                        82570000
                                      /* WRITE MESSAGE WITH RUN DATE */ 82580000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           82590000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 82600000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               82610000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   82620000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 82630000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         82640000
 CALL RCB0M1M (PTR_INT_AREA);                                           82650000
                                                                        82660000
                           /* DETERMINE TIMESTAMP FOR HEADER + HASH  */ 82670000
 WRK_TIME_STAMP = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();           82680000
                                                                        82690000
                                                    /* SOC : RB01278 */ 82700000
 TB_RCBV500   = '';     /* RETRIEVE SERVICE ON BEHALF OF VENDOR PARM */ 82710000
 TB_RCBV500_I = '';                                                     82720000
 TB_RCBP103S.NUMBER   = 'RCB103';                                       82730000
 TB_RCBP103S.CTRYNO   = WRK_CTRYNO;                                     82740000
 TB_RCBP103S.PGR_TYPE = WRK_PGR_TYPE;                                   82750000
                                                                        82760000
0CALL RCBI50M ('U',                                                     82770000
               ADDR(TB_RCBV500),                                        82780000
               ADDR(TB_RCBV500_I),                                      82790000
               PTR_RETURN_AREA_BB,                                      82800000
               PTR_INT_AREA);                                           82810000
                                                                        82820000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    82830000
  WHEN (0)                                                              82840000
    DO;                                                                 82850000
      PARM_RCBP103S =  TB_RCBP103S, BY NAME;                            82860000
      IF PARM_RCBP103S.SRV_ON_BEHF_OF_VENDOR = 'Y' THEN                 82870000
         SWITCH_VENDOR_SERVICE = TRUE;                                  82880000
      ELSE                                                              82890000
         SWITCH_VENDOR_SERVICE = FALSE;                                 82900000
    END;                                                                82910000
  WHEN (4)                                    /* NO PARM RECORD FOUND */82920000
    DO;                                                                 82930000
      SWITCH_VENDOR_SERVICE = FALSE;                                    82940000
    END;                                                                82950000
  OTHERWISE DO;                                                         82960000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            82970000
                                 'DB2',                                 82980000
                                 '#067');                               82990000
            END;                                                        83000000
 END;                                               /* EOC : RB01278 */ 83010000
                                                                        83020000
                                       /* RETRIEVE RCMS EXTRACT PARM */ 83030000
 TB_RCBV500   = '';                                                     83040000
 TB_RCBV500_I = '';                                                     83050000
 TB_RCBP05S.NUMBER   = 'RCB005';                                        83060000
 TB_RCBP05S.CTRYNO   = WRK_CTRYNO;                                      83070000
 TB_RCBP05S.PGR_TYPE = WRK_PGR_TYPE;                                    83080000
                                                                        83090000
0CALL RCBI50M ('U',                                       /* RC01219 */ 83100000
               ADDR(TB_RCBV500),                                        83110000
               ADDR(TB_RCBV500_I),                                      83120000
               PTR_RETURN_AREA_BB,                                      83130000
               PTR_INT_AREA);                                           83140000
                                                                        83150000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    83160000
  WHEN (0)                                                              83170000
    DO;                                                                 83180000
       PARM_RCB005        = TB_RCBP05S, BY NAME;                        83190000
                                                                        83200000
    END;                                                                83210000
  WHEN (4)                            /* NO RCMS EXTR PARM FOUND     */ 83220000
    DO;                                                                 83230000
       PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                   83240000
       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = 'I050';                 83250000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                    83260000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                   83270000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                         83280000
                                       TB_RCBV500.PARAMETER_NUMBER;     83290000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'PK';                   83300000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                         83310000
                                       TB_RCBV500.PARAMETER_KEY;        83320000
       CALL RCB0M1M (PTR_INT_AREA);                                     83330000
       CALL RCBDRIM_ERROR (NULL, 'OTHER', '#068');                      83340000
    END;                                                                83350000
  OTHERWISE DO;                                                         83360000
       CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            83370000
                                 'DB2',                                 83380000
                                 '#069');                               83390000
            END;                                                        83400000
 END;                                                                   83410000
                                                                        83420000
                                         /* SOC RB01281 */              83430000
                                         /* RETRIEVE RCB063 PARM */     83440000
 TB_RCBV500   = '';                                                     83450000
 TB_RCBV500_I = '';                                                     83460000
 TB_RCB063S.NUMBER   = 'RCB063';                                        83470000
                                                                        83480000
 CALL RCBI50M ('U',                                                     83490000
               ADDR(TB_RCBV500),                                        83500000
               ADDR(TB_RCBV500_I),                                      83510000
               PTR_RETURN_AREA_BB,                                      83520000
               PTR_INT_AREA);                                           83530000
                                                                        83540000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    83550000
  WHEN (0)                                                              83560000
    DO;                                                                 83570000
       PARM_RCB063S        = TB_RCB063S, BY NAME;                       83580000
                                                                        83590000
    END;                                                                83600000
  WHEN (4)                                                              83610000
     DO;                                                                83620000
        PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                  83630000
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = 'I050';                83640000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                   83650000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                  83660000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                        83670000
                                        TB_RCBV500.PARAMETER_NUMBER;    83680000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'PK';                  83690000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                        83700000
                                        TB_RCBV500.PARAMETER_KEY;       83710000
        CALL RCB0M1M (PTR_INT_AREA);                                    83720000
        CALL RCBDRIM_ERROR (NULL, 'OTHER', '#076');                     83730000
     END;                                                               83740000
   OTHERWISE DO;                                                        83750000
        CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           83760000
                                  'DB2',                                83770000
                                  '#077');                              83780000
             END;                                                       83790000
  END;                                                                  83800000
                                    /* EOC RB01281 */                   83810000
                                                      /* SOC RB01298 */ 83820000
 /* IF COUNTRY LEVEL PARAMETER RCB064 IS AVAILABLE THEN OVERWRITE    */ 83830000
 /* THE VALUES OF RCB063 */                                             83840000
 WRK_FW_TOW                 = '';                                       83850000
 WRK_HB_TOM                 = '';                                       83860000
 TB_RCBV500                 = '';                                       83870000
 TB_RCBV500_I               = '';                                       83880000
 TB_RCBP64S.NUMBER          = 'RCB064';                                 83890000
 TB_RCBP64S.CTRYNO          = WRK_CTRYNO;                               83900000
                                                                        83910000
 CALL RCBI50M ('U',                                                     83920000
               ADDR (TB_RCBV500),                                       83930000
               ADDR (TB_RCBV500_I),                                     83940000
               PTR_RETURN_AREA_BB,                                      83950000
               PTR_INT_AREA);                                           83960000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   83970000
   WHEN(0)                                                              83980000
     DO;                                                                83990000
        PARM_RCBP64S = TB_RCBP64S, BY NAME;                             84000000
        WRK_FW_TOW   = PARM_RCBP64S.F_WARRANTY_MACHINE;                 84010000
        WRK_HB_TOM   = PARM_RCBP64S.HARDBUNDLE;                         84020000
     END;                                                               84030000
   WHEN(4)                                                              84040000
     DO;                                                                84050000
        WRK_FW_TOW = PARM_RCB063S.F_WARRANTY_MACHINE;                   84060000
        WRK_HB_TOM = PARM_RCB063S.HARDBUNDLE;                           84070000
     END;                                                               84080000
 END;                                                  /*EOC RB01298 */ 84090000
                           /* DETERMINE EXTRACT PERIOD               */ 84100000
                               /* HISTORY START DATE                 */ 84110000
 PARM_DATE_CALC = '';                                                   84120000
 PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                                 84130000
 PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                                 84140000
 PARM_DATE_CALC.WD_FUNCTION    = 'C';                                   84150000
 PARM_DATE_CALC.WD_PERIOD      = - PARM_RCB005.HIST_RET_PERIOD;         84160000
 PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                                   84170000
 PARM_DATE_CALC.WD_IN_DATE     = WRK_RUN_DATE;                          84180000
                                                                        84190000
 CALL RCB004M (ADDR(PARM_DATE_CALC));                                   84200000
                                                                        84210000
 IF PARM_DATE_CALC.WD_STATUS ¬= ''                                      84220000
 THEN                                                                   84230000
   DO;                                                                  84240000
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            84250000
     PARM_INT_AREA.MESSAGE_NUMBER    = '0012';                          84260000
     PARM_INT_AREA.MSG_VAR_CODES     = '';                              84270000
                                                                        84280000
     PARM_INT_AREA.MSG_VAR_CODE_6    = 'DN';                            84290000
     PARM_INT_AREA.MSG_VAR_VALUE_6   = 'RUN_DATE';                      84300000
     PARM_INT_AREA.MSG_VAR_CODE_7    = 'DT';                            84310000
     PARM_INT_AREA.MSG_VAR_VALUE_7   = PARM_DATE_CALC.WD_IN_DATE;       84320000
     PARM_INT_AREA.MSG_VAR_CODE_8    = 'RC';                            84330000
     PARM_INT_AREA.MSG_VAR_VALUE_8   = PARM_DATE_CALC.WD_STATUS;        84340000
     CALL RCB0M1M (PTR_INT_AREA);                                       84350000
     CALL RCBDRIM_ERROR (NULL, 'OTHER', '#070');                        84360000
   END;                                                                 84370000
                                                                        84380000
 WRK_PERIOD_START_DATE = PARM_DATE_CALC.WD_OUT_DATE;                    84390000
                                                                        84420000
                               /* HISTORY START DATE                 */ 84430000
 PARM_DATE_CALC = '';                                                   84440000
 PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                                 84450000
 PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                                 84460000
 PARM_DATE_CALC.WD_FUNCTION    = 'C';                                   84470000
 PARM_DATE_CALC.WD_PERIOD      = PARM_RCB005.FUT_RET_PERIOD;            84480000
 PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                                   84490000
 PARM_DATE_CALC.WD_IN_DATE     = WRK_RUN_DATE;                          84500000
                                                                        84510000
 CALL RCB004M (ADDR(PARM_DATE_CALC));                                   84520000
                                                                        84530000
 IF PARM_DATE_CALC.WD_STATUS ¬= ''                                      84540000
 THEN                                                                   84550000
   DO;                                                                  84560000
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            84570000
     PARM_INT_AREA.MESSAGE_NUMBER    = '0012';                          84580000
     PARM_INT_AREA.MSG_VAR_CODES     = '';                              84590000
                                                                        84600000
     PARM_INT_AREA.MSG_VAR_CODE_6    = 'DN';                            84610000
     PARM_INT_AREA.MSG_VAR_VALUE_6   = 'RUN_DATE';                      84620000
     PARM_INT_AREA.MSG_VAR_CODE_7    = 'DT';                            84630000
     PARM_INT_AREA.MSG_VAR_VALUE_7   = PARM_DATE_CALC.WD_IN_DATE;       84640000
     PARM_INT_AREA.MSG_VAR_CODE_8    = 'RC';                            84650000
     PARM_INT_AREA.MSG_VAR_VALUE_8   = PARM_DATE_CALC.WD_STATUS;        84660000
     CALL RCB0M1M (PTR_INT_AREA);                                       84670000
     CALL RCBDRIM_ERROR (NULL, 'OTHER', '#071');                        84680000
   END;                                                                 84690000
                                                                        84700000
 WRK_PERIOD_END_DATE = PARM_DATE_CALC.WD_OUT_DATE;                      84710000
                                                                        84740000
                                                                        84741000
                                                      /* SOC RB01308 */ 84750000
 /* WRK_LENOVO_DATE IS NOT USED ANYMORE                              */ 84760000
 /*TB_RCBV500   = '';                                 /* SOC RB01272 */ 84770000
 /*TB_RCBV500_I = '';                                                   84780000
 /*TB_RCBV500.PARAMETER_NUMBER   = 'RCB101';                            84790000
 /*                                                                     84800000
 /*CALL RCBI50M ('U',                                                   84810000
 /*              ADDR(TB_RCBV500),                                      84820000
 /*              ADDR(TB_RCBV500_I),                                    84830000
 /*              PTR_RETURN_AREA_BB,                                    84840000
 /*              PTR_INT_AREA);                                         84850000
 /*                                                                     84860000
 /*SELECT(RETURN_AREA_BB.RETURN_CODE);                                  84870000
 /* WHEN (0)                                                            84880000
 /*   DO;                                                               84890000
 /*     WRK_LENOVO_DATE = SUBSTR(TB_RCBV500.PARAMETER_VALUE,1,10);      84900000
 /*                                                                     84910000
 /*   END;                                                              84920000
 /* WHEN (4)                                /* NO LENOVO DATE FOUND */  84930000
 /*   DO;                                                               84940000
 /*     WRK_LENOVO_DATE = '2005-05-01';                                 84950000
 /*   END;                                                              84960000
 /* OTHERWISE DO;                                                       84970000
 /*      CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          84980000
 /*                                'DB2',                               84990000
 /*                                '#072');                             85000000
 /*           END;                                                      85010000
 /*END;                                               /* EOC RB01272 */ 85020000
                                                      /* EOC RB01308 */ 85030000
                                                                        85040000
 END R900_INIT_PROGRAM;                                                 85050000
 /*********************************************************************/85060000
 /*                                                    /* SOC RC01326 */85070000
 /* MODULE NAME      : R950_PROCESS_PI_LONG_SER                       */85080000
 /*                                                                   */85090000
 /* DESCRIPTION      : SELECT ORIGIN & SEQ_NO FOR PI SOURCE           */85100000
 /*                                                                   */85120000
 /*********************************************************************/85130000
 R950_PROCESS_PI_LONG_SER: PROC;                                        85140000
                                                                        85141000
 PI_ORIGIN       = ' ';                                                 85142000
 PI_SEQ_NO       = ' ';                                                 85143000
 PI_REAL_SERNO   = ' ';                                                 85144000
 PI_DUMMY_ORIGIN = ' ';                                                 85145000
 PI_DUMMY_SEQ_NO = ' ';                                                 85146000
                                                                        85146100
  SELECT(WRK_SOURCE);                                                   85146500
  WHEN('T051')                                                          85146600
   DO;                                                                  85146700
     EXEC SQL                                                           85146800
      SELECT  A.ORIGIN,                                                 85146900
              A.SEQUENCE_NUMBER,                                        85147000
              B.DUMMY_ORIGIN,                                           85147100
              B.DUMMY_SEQUENCE_NUM,                                     85147200
              B.REAL_SERIAL_NUMBER                                      85147300
      INTO    :PI_ORIGIN,                                               85147400
              :PI_SEQ_NO,                                               85147500
              :PI_DUMMY_ORIGIN,                                         85147600
              :PI_DUMMY_SEQ_NO,                                         85147700
              :PI_REAL_SERNO                                            85147800
      FROM RCBV0051_PI_HW_PR  A,                                        85147900
           RCBV0125_DMMY_REAL B                                         85148000
      WHERE A.PRODUCT_TYPE       = :SK_HW_TEMP.PRODUCT_TYPE             85148100
      AND   A.COUNTRY_NUMBER     = :WRK_CTRYNO                          85148200
      AND   A.COUNTRY_NUMBER     = B.COUNTRY_NUMBER                     85148300
      AND   B.DUMMY_ORIGIN       = :SK_HW_TEMP.ORIGIN                   85148400
      AND   B.DUMMY_SEQUENCE_NUM = :SK_HW_TEMP.SEQUENCE_NUMBER          85148500
      AND   A.PRODUCT_TYPE       = B.PRODUCT_TYPE                       85148600
      AND  ((A.ORIGIN||A.SEQUENCE_NUMBER = B.REAL_SERIAL_NUMBER)        85148700
      OR   (A.ORIGIN             = B.DUMMY_ORIGIN                       85148800
      AND   A.SEQUENCE_NUMBER    = B.DUMMY_SEQUENCE_NUM));              85148900
                                                                        85149300
    SELECT(SQLCODE);                                                    85149400
     WHEN(0);                                                           85149500
     WHEN(100);                                                         85149600
     OTHERWISE                                                          85149700
       DO;                                                              85149800
         CALL RCBDRIM_ERROR (ADDR (SQLCA),                              85149900
                            'DB2',                                      85150000
                            '#116');                                    85150100
       END;                                                             85150200
    END;                                                                85150300
   END;                                                                 85150400
  WHEN('T241')                                                          85150500
   DO;                                                                  85150600
     EXEC SQL                                                           85150700
      SELECT  A.ORIGIN,                                                 85150800
              A.SEQUENCE_NUMBER,                                        85150900
              B.DUMMY_ORIGIN,                                           85151000
              B.DUMMY_SEQUENCE_NUM,                                     85151100
              B.REAL_SERIAL_NUMBER                                      85151200
      INTO   :PI_ORIGIN,                                                85151300
             :PI_SEQ_NO,                                                85151400
             :PI_DUMMY_ORIGIN,                                          85151500
             :PI_DUMMY_SEQ_NO,                                          85151600
             :PI_REAL_SERNO                                             85151700
      FROM RCBV0241_PI_CTR    A,                                        85151800
           RCBV0125_DMMY_REAL B                                         85151900
      WHERE A.PRODUCT_TYPE       = :SK_HW_TEMP.PRODUCT_TYPE             85152000
      AND   A.COUNTRY_NUMBER     = :WRK_CTRYNO                          85152100
      AND   A.COUNTRY_NUMBER     = B.COUNTRY_NUMBER                     85152200
      AND   B.DUMMY_ORIGIN       = :SK_HW_TEMP.ORIGIN                   85152300
      AND   B.DUMMY_SEQUENCE_NUM = :SK_HW_TEMP.SEQUENCE_NUMBER          85152400
      AND   A.PRODUCT_TYPE       = B.PRODUCT_TYPE                       85152500
      AND  ((A.ORIGIN||A.SEQUENCE_NUMBER = B.REAL_SERIAL_NUMBER)        85152600
      OR   (A.ORIGIN             = B.DUMMY_ORIGIN                       85152700
                                                   /*SOC CEDS00000778*/ 85152827
   /* AND   A.SEQUENCE_NUMBER    = B.DUMMY_SEQUENCE_NUM)); */           85152927
      AND   A.SEQUENCE_NUMBER    = B.DUMMY_SEQUENCE_NUM))               85153028
      AND  :WRK_RUN_DATE BETWEEN A.EFFECTIVE_DATE AND A.END_DATE;       85153128
                                                   /*EOC CEDS00000778*/ 85153227
                                                                        85153327
    SELECT(SQLCODE);                                                    85153427
     WHEN(0);                                                           85153527
     WHEN(100);                                                         85153627
     OTHERWISE                                                          85153727
       DO;                                                              85153827
         CALL RCBDRIM_ERROR (ADDR (SQLCA),                              85153927
                            'DB2',                                      85154027
                            '#117');                                    85154127
       END;                                                             85154227
    END;                                                                85154327
   END;                                                                 85154427
  OTHERWISE                                                             85154527
   DO;                                                                  85154627
     CALL RCBDRIM_ERROR (ADDR (SQLCA),                                  85154727
                        'DB2',                                          85154827
                        '#118');                                        85154927
   END;                                                                 85155027
  END;                                                                  85155127
                                                                        85155227
 IF SWITCH_PI_ONLY THEN                                                 85155327
 DO;                                                                    85155427
   IF PI_REAL_SERNO ¬= ' ' & (PI_ORIGIN||PI_SEQ_NO = PI_REAL_SERNO)     85155700
   THEN                                                                 85155800
   DO;                                                                  85155900
     WRK_ORIGIN  = SUBSTR(PI_REAL_SERNO,1,2);                           85156000
     WRK_SEQ_NO  = SUBSTR(PI_REAL_SERNO,3);                             85156100
   END;                                                                 85156200
   ELSE                                                                 85156300
   DO;                                                                  85156400
     WRK_ORIGIN  = SK_HW_TEMP.ORIGIN;                                   85156600
     WRK_SEQ_NO  = SK_HW_TEMP.SEQUENCE_NUMBER;                          85156700
   END;                                                                 85156800
 END;                                                                   85156900
                                                                        85157000
 IF SWITCH_BAU_PI THEN                                                  85157100
 DO;                                                                    85157200
   IF ¬( PI_ORIGIN||PI_SEQ_NO = PI_REAL_SERNO) &                        85157300
       (SK_CURRENT_HW.ORIGIN = SK_HW_TEMP.ORIGIN &                      85157400
        SK_CURRENT_HW.SEQUENCE_NUMBER = SK_HW_TEMP.SEQUENCE_NUMBER)     85157500
   THEN                                                                 85157600
     DO;                                                                85157700
       WRK_ORIGIN = SK_HW_TEMP.ORIGIN ;                                 85157800
       WRK_SEQ_NO = SK_HW_TEMP.SEQUENCE_NUMBER ;                        85157900
     END;                                                               85158000
 END;                                                                   85158100
                                                                        85158200
 END R950_PROCESS_PI_LONG_SER;                                          85158700
                                                       /* EOC RC01326 */85158800
 /*********************************************************************/85158900
 /*                                                   /* SOC RB01301  */85159000
 /* MODULE NAME      : R960_PROCESS_SERVICE_EXTN                      */85159100
 /*                                                                   */85159200
 /* DESCRIPTION      : READ THE OFFERING SHORT NAMES FROM CURSOR      */85159300
 /*                    T120_SNAME_CURSOR AND FILL SERVICE_EXTENSION   */85159400
 /*                    FIELD                                          */85159500
 /*********************************************************************/85159600
 R960_PROCESS_SERVICE_EXTN: PROC;                                       85159700
                                                                        85159800
 DCL I FIXED BIN(31) ;                                                  85160000
                                                                        85161000
 DCL J FIXED BIN(31) ;                                /* SOC RC01326 */ 85170000
 J = 1;                                               /* EOC RC01326 */ 85180000
 I = 1;                                                                 85190000
 SWITCH_EOC_T120 = FALSE;                                               85200000
 /* TEMP_SERV_EXTENSION = ''; */                 /* SOC CEDS00000536 */ 85210000
 TEMP_SERV_EXTENSION(*) = '';                    /* EOC CEDS00000536 */ 85220000
 BAU_SERV_EXTENSION(*)  = '';                         /* SOC RB01308 */ 85230000
 PI_SERV_EXTENSION(*)   = '';                         /* EOC RB01308 */ 85240000
 BAU_SERV_EXTENSION_MESE(*) = '';                     /* SOC RC01326 */ 85250000
 PI_SERV_EXTENSION_SDF(*)   = '';                                       85260000
 SW_BAU_CTR_SE              = FALSE;                                    85270000
 SW_PI_CTR_SE               = FALSE;                                    85280000
 SW_PROCESS_SE              = FALSE;                                    85290000
 CNT_BAU_CTR_SE             = 0;                                        85300000
 CNT_BAU_WAR_SE             = 0;                                        85310000
 CNT_PI_CTR_SE              = 0;                                        85320000
 CNT_PI_WAR_SE              = 0;                                        85330000
 WRK_T240_SI                = '';                                       85340000
 WRK_T240_CTR               = '';                                       85350000
 WRK_T240_CTR_INDNULL       = 0;                                        85370000
                                                                        85380000
   EXEC SQL                                                             85640000
   SELECT  SOURCE_INDICATOR                                             85650000
          ,CONTRACT_NUMBER                                              85660000
    INTO   :WRK_T240_SI                                                 85670000
          ,:WRK_T240_CTR     :WRK_T240_CTR_INDNULL                      85680000
    FROM RCBT0240_SERV_CTR                                              85690000
    WHERE PRODUCT_TYPE     = :SK_HW_TEMP.PRODUCT_TYPE                   85700000
    AND   ORIGIN           = :WRK_ORIGIN                                85710000
    AND   SEQUENCE_NUMBER  = :WRK_SEQ_NO                                85720000
    AND   COUNTRY_NUMBER   = :WRK_CTRYNO                                85730000
    AND   (:WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE)           85740000
   ;                                                                    85750000
                                                                        85760000
   SELECT(SQLCA.SQLCODE);                                               85770000
    WHEN (0)                                                            85780000
    DO;                                                                 85790000
      IF (WRK_T240_CTR_INDNULL ¬= -1)                                   85800000
      THEN                                                              85810000
      DO;                                                               85820000
        IF (WRK_T240_SI = 'L') THEN                                     85830000
        DO;                                                             85840000
          TB_RCBV240.CONTRACT_NUMBER = WRK_T240_CTR;                    85870000
          CALL R400_RETR_ADD_CONTR_INFO;                                85880000
          IF WRK_TOC_V30_IND ¬= -1 THEN                                 85890000
          DO;                                                           85900000
            WRK_TOC = TB_RCBV030.TYPE_OF_CONTRACT;                      85910000
            CALL R961_PROCESS_BAU_CTR_SE;                               85920000
            TEMP_SERV_EXTENSION(*) = BAU_SERV_EXTENSION(*);             85930000
          END;                                                          85960000
        END;                                                            85970000
      END;                                                              85980000
    END;                                                                85990000
    WHEN (100)                                                          86000000
    DO;                                                                 86010000
      SW_PROCESS_SE = TRUE;                                             86020000
    END;                                                                86030000
    OTHERWISE                                                           86040000
    DO;                                                                 86050000
      CALL RCBDRIM_ERROR (ADDR (SQLCA),                                 86060000
                         'DB2',                                         86070000
                         '#111');                                       86080000
    END;                                                                86090000
   END;                                                                 86100000
                                                                        86120000
   IF SW_PROCESS_SE                                                     86130000
   THEN                                                                 86140000
   DO;                                                                  86150000
     CALL R962_PROCESS_PI_CTR_SE;                                       86170000
   END;                                                                 86180000
                                                                        86190000
   IF SW_BAU_CTR_SE                                                     86230000
   THEN                                                                 86240000
     I = WRK_P;                                                         86250000
   ELSE                                                                 86260000
   IF SW_PI_CTR_SE                                                      86270000
   THEN                                                                 86280000
     I = WRK_O;                                        /* EOC RC01326 */86290000
                                                                        86300000
   EXEC SQL                                                             86390000
      OPEN T120_SNAME_CURSOR;                                           86400000
                                                                        86410000
   SELECT(SQLCA.SQLCODE);                                               86420000
   WHEN (0);                                                            86430000
   OTHERWISE                                                            86440000
     DO;                                                                86450000
         CALL RCBDRIM_ERROR (ADDR (SQLCA),                              86460000
                       'DB2',                                           86470000
                       '#082');                                         86480000
     END;                                                               86490000
   END;                                                                 86500000
   DO WHILE (¬SWITCH_EOC_T120);                                         86510000
      EXEC SQL                                                          86520000
          FETCH T120_SNAME_CURSOR                                       86530000
          INTO :SNAME;                                                  86540000
                                                                        86550000
      SELECT(SQLCA.SQLCODE);                                            86560000
      WHEN(0)                                                           86570000
         DO;                                                            86580000
           IF I <= 5 THEN                                               86590000
           DO;                                            /* RC01326 */ 86610000
             TEMP_SERV_EXTENSION(I) = SNAME;                            86620000
             BAU_SERV_EXTENSION_MESE(J) = SNAME;      /* SOC RC01326 */ 86630000
           I= I + 1;                                                    86640000
           J= J + 1;                                                    86650000
           END;                                       /* EOC RC01326 */ 86660000
           ELSE                                                         86670000
            DO;                                                         86680000
            IF (SNAME ¬= '')                          /* SOC RC01326 */ 86690000
            THEN                                                        86700000
            DO;                                       /* EOC RC01326 */ 86710000
              TEMP_SERV_EXTENSION(5) = 'ME>';                           86720000
                IF (J <= 5) THEN                      /* SOC RC01326 */ 86740000
                DO;                                                     86750000
                  BAU_SERV_EXTENSION_MESE(J) = SNAME;                   86760000
                END;                                                    86770000
                ELSE                                                    86780000
                DO;                                                     86790000
                  BAU_SERV_EXTENSION_MESE(5) = 'ME>';                   86800000
                  SWITCH_EOC_T120 = TRUE;                               86810000
                END;                                                    86820000
                J = J + 1;                                              86840000
            END;                                                        86850000
            ELSE                                      /* EOC RC01326 */ 86860000
              SWITCH_EOC_T120 = TRUE;                                   86870000
            END;                                                        86880000
 /*        I= I + 1;                                  */  /* RC01326 */ 86881000
         END;                                                           86890000
      WHEN(100)                                                         86900000
         DO;                                                            86910000
            SWITCH_EOC_T120 = TRUE;                                     86920000
         END;                                                           86930000
      OTHERWISE                                                         86940000
         DO;                                                            86950000
            CALL RCBDRIM_ERROR (ADDR (SQLCA),                           86960000
                                'DB2',                                  86970000
                                '#083');                                86980000
         END;                                                           86990000
      END;                                                              87000000
     END;                                                               87010000
                                                                        87011000
 CNT_BAU_WAR_SE = J - 1;                                  /* RC01326 */ 87020000
                                                          /* RC01326 */ 87050000
   EXEC SQL                                                             87060000
    CLOSE T120_SNAME_CURSOR;                                            87070000
                                                                        87080000
    SELECT(SQLCA.SQLCODE);                                              87090000
      WHEN (0);                                                         87100000
      OTHERWISE                                                         87110000
      DO;                                                               87120000
        CALL RCBDRIM_ERROR (ADDR (SQLCA),                               87130000
                            'DB2',                                      87140000
                            '#084');                                    87150000
      END;                                                              87160000
    END;                                                                87170000
                                                      /* SOC RC01326 */ 87190000
 /*BAU_SERV_EXTENSION = TEMP_SERV_EXTENSION;          */  /* RB01308 */ 87200000
                                                      /* EOC RC01326 */ 87210000
                                                                        87230000
 IF (TEMP_SERV_EXTENSION(5) ¬= 'ME>')                                   87240000
 THEN                                                                   87250000
    DO;                                                                 87260000
       IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                             87270000
         DO;                                                            87280000
           CALL R630_FETCH_T051_SDF;                                    87290000
           CALL R418_FILL_OFF_SNAME(I);                                 87300000
         END;                                                           87310000
    END;                                                                87320000
                                                                        87330000
 CALL R963_FILL_SERV_EXTN;                             /* SOC RC01326 */87340000
                                                       /* EOC RC01326 */87350000
 END R960_PROCESS_SERVICE_EXTN;                         /*EOC RB01301*/ 87360000
 /*********************************************************************/87370000
 /*                                                    /* SOC RC01326 */87380000
 /* MODULE NAME      :  R961_PROCESS_BAU_CTR_SE                       */87390000
 /*                                                                   */87400000
 /* DESCRIPTION      :  FILL SERVICE EXTENSION FOR BAU CTR SERVICEPAC */87410000
 /*                                                                   */87420000
 /*********************************************************************/87430000
 R961_PROCESS_BAU_CTR_SE: PROC;                                         87440000
                                                                        87496000
 WRK_M = 1;                                                             87497000
 WRK_P = 1;                                                             87498000
 WRK_SERV_EXT            = '';                                          87498100
 TB_RCBV635              = '';                                          87498200
 TB_RCBV635_I.INDNULL(*) = 0;                                           87498300
 TB_RCBV630              = '';                                          87498400
 TB_RCBV630_I.INDNULL(*) = 0;                                           87498500
                                                                        87499000
 EXEC SQL                                                               87500000
  SELECT SERVICE_EXTENSION                                              87510000
   INTO  :TB_RCBV635.SERVICE_EXTENSION                                  87520000
         :TB_RCBV635_I.INDNULL                                          87521000
   FROM RCBT0635_CTRY_HVC                                               87530000
   WHERE HVP_CONTRACT_NUMBR = :WRK_TOC                                  87540000
   AND   COUNTRY_NUMBER     = :WRK_CTRYNO                               87550000
  ;                                                                     87560000
                                                                        87570000
  SELECT(SQLCA.SQLCODE);                                                87571000
   WHEN(0)                                                              87572000
   DO;                                                                  87573000
     WRK_SERV_EXT  = TB_RCBV635.SERVICE_EXTENSION;                      87573200
     SW_BAU_CTR_SE = TRUE;                                              87574000
   END;                                                                 87575000
   WHEN(100)                                                            87576000
   DO;                                                                  87576100
     EXEC SQL                                                           87576200
      SELECT SERVICE_EXTENSION                                          87576300
       INTO  :TB_RCBV630.SERVICE_EXTENSION                              87576400
             :TB_RCBV630_I.INDNULL                                      87576500
       FROM RCBT0630_TRANS_HVC                                          87576600
       WHERE HVP_CONTRACT_NUMBR = :WRK_TOC                              87576700
      ;                                                                 87576800
                                                                        87576900
     SELECT(SQLCA.SQLCODE);                                             87577000
       WHEN(0)                                                          87577100
       DO;                                                              87577200
         WRK_SERV_EXT  = TB_RCBV630.SERVICE_EXTENSION;                  87577400
         SW_BAU_CTR_SE = TRUE;                                          87577600
       END;                                                             87577700
       WHEN(100);                                                       87577800
       OTHERWISE                                                        87577900
       DO;                                                              87578000
         CALL RCBDRIM_ERROR (ADDR(SQLCA),                               87579000
                            'DB2',                                      87579100
                            '#112');                                    87579200
       END;                                                             87579300
     END;                                                               87579400
   END;                                                                 87579500
   OTHERWISE                                                            87579600
   DO;                                                                  87579700
     CALL RCBDRIM_ERROR (ADDR(SQLCA),                                   87579800
                        'DB2',                                          87579900
                        '#113');                                        87580000
   END;                                                                 87581000
  END;                                                                  87582000
                                                                        87590000
  IF SW_BAU_CTR_SE THEN                                                 87630000
  DO;                                                                   87730000
    IF (TB_RCBV635_I.INDNULL(4) = 0) | (TB_RCBV630_I.INDNULL(3) = 0)    87750000
    THEN                                                                87751000
    DO WHILE (WRK_P <= 5                                                87752000
           & (SUBSTR(WRK_SERV_EXT,WRK_M,3) ¬= ' '));                    87753000
      IF (WRK_P <= 5) THEN                                              87801000
       DO;                                                              87810000
         BAU_SERV_EXTENSION(WRK_P) = SUBSTR(WRK_SERV_EXT,WRK_M,3);      87820000
       END;                                                             87850000
                                                                        87940000
    WRK_P = WRK_P + 1;                                                  87950000
    WRK_M = WRK_M + 4;                                                  87960000
    END;                                                                87980000
  END;                                                                  87990000
                                                                        88010000
 CNT_BAU_CTR_SE = WRK_P - 1;                                            88090000
                                                                        88100000
 END R961_PROCESS_BAU_CTR_SE;                                           88110000
 /*********************************************************************/88120000
 /*                                                                   */88130000
 /* MODULE NAME      :  R962_PROCESS_PI_CTR_SE                        */88140000
 /*                                                                   */88150000
 /* DESCRIPTION      :  FILL SERVICE EXTENSION FOR PI CTR SERVICEPAC  */88160000
 /*                                                                   */88170000
 /*********************************************************************/88180000
 R962_PROCESS_PI_CTR_SE: PROC;                                          88190000
                                                                        88200000
 WRK_M = 1;                                                             88231000
 WRK_O = 1;                                                             88231200
 WRK_SERV_EXT            = '';                                          88231300
 TB_RCBV635              = '';                                          88231500
 TB_RCBV635_I.INDNULL(*) = 0;                                           88231600
 TB_RCBV630              = '';                                          88231700
 TB_RCBV630_I.INDNULL(*) = 0;                                           88231800
                                                                        88231900
 WRK_SOURCE              = 'T241';                                      88281000
 CALL R950_PROCESS_PI_LONG_SER;                                         88290000
                                                                        88300000
 EXEC SQL                                                               88400000
   SELECT A.SERVICE_EXTENSION                                           88410000
    INTO  :TB_RCBV635.SERVICE_EXTENSION                                 88420000
          :TB_RCBV635_I.INDNULL                                         88421000
    FROM RCBT0635_CTRY_HVC A                                            88430000
    LEFT OUTER JOIN RCBT0241_PI_CTR C                                   88440000
    ON    C.CONTRACT_NUMBER = A.HVP_CONTRACT_NUMBR                      88450000
    WHERE C.PRODUCT_TYPE    = :SK_HW_TEMP.PRODUCT_TYPE                  88460000
    AND   C.ORIGIN          = :WRK_ORIGIN                               88470000
    AND   C.SEQUENCE_NUMBER = :WRK_SEQ_NO                               88480000
    AND   C.COUNTRY_NUMBER  = :WRK_CTRYNO                               88490000
    AND   C.COUNTRY_NUMBER  = A.COUNTRY_NUMBER                          88500000
    AND   (:WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE)       88510000
   ;                                                                    88520000
                                                                        88540000
  SELECT(SQLCA.SQLCODE);                                                88540100
   WHEN(0)                                                              88540200
   DO;                                                                  88540300
     WRK_SERV_EXT = TB_RCBV635.SERVICE_EXTENSION;                       88540400
     SW_PI_CTR_SE = TRUE;                                               88540500
   END;                                                                 88540800
   WHEN(100)                                                            88540900
   DO;                                                                  88541000
     EXEC SQL                                                           88541100
      SELECT B.SERVICE_EXTENSION                                        88541200
       INTO  :TB_RCBV630.SERVICE_EXTENSION                              88541300
             :TB_RCBV630_I.INDNULL                                      88541400
       FROM RCBT0630_TRANS_HVC B                                        88541500
       LEFT OUTER JOIN RCBT0241_PI_CTR C                                88541600
       ON    C.CONTRACT_NUMBER = B.HVP_CONTRACT_NUMBR                   88541700
       WHERE C.PRODUCT_TYPE    = :SK_HW_TEMP.PRODUCT_TYPE               88541800
       AND   C.ORIGIN          = :WRK_ORIGIN                            88541900
       AND   C.SEQUENCE_NUMBER = :WRK_SEQ_NO                            88542000
       AND   C.COUNTRY_NUMBER  = :WRK_CTRYNO                            88542100
       AND   (:WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE)    88542200
      ;                                                                 88542300
                                                                        88542600
     SELECT(SQLCA.SQLCODE);                                             88542700
       WHEN(0)                                                          88542800
       DO;                                                              88542900
         WRK_SERV_EXT = TB_RCBV630.SERVICE_EXTENSION;                   88543000
         SW_PI_CTR_SE = TRUE;                                           88543100
       END;                                                             88543300
       WHEN(100);                                                       88543400
       OTHERWISE                                                        88543500
       DO;                                                              88543600
         CALL RCBDRIM_ERROR (ADDR(SQLCA),                               88543700
                            'DB2',                                      88543800
                            '#114');                                    88543900
       END;                                                             88544000
     END;                                                               88544100
   END;                                                                 88544200
   OTHERWISE                                                            88544300
   DO;                                                                  88544400
     CALL RCBDRIM_ERROR (ADDR(SQLCA),                                   88544500
                        'DB2',                                          88544600
                        '#115');                                        88544700
   END;                                                                 88544800
  END;                                                                  88544900
                                                                        88720000
  IF SW_PI_CTR_SE THEN                                                  88761000
  DO;                                                                   88762000
    IF (TB_RCBV635_I.INDNULL(4) = 0) | (TB_RCBV630_I.INDNULL(3) = 0)    88770000
    THEN                                                                88780000
    DO WHILE (WRK_O <= 5                                                88790000
           & (SUBSTR(WRK_SERV_EXT,WRK_M,3) ¬= ' '));                    88800000
      IF (WRK_O <= 5 ) THEN                                             88810000
       DO;                                                              88820000
         PI_SERV_EXTENSION(WRK_O) = SUBSTR(WRK_SERV_EXT,WRK_M,3);       88830000
       END;                                                             88860000
    WRK_O = WRK_O + 1;                                                  88930000
    WRK_M = WRK_M + 4;                                                  88940000
    END;                                                                88950000
       TEMP_SERV_EXTENSION(*) = PI_SERV_EXTENSION(*);                   88970000
  END;                                                                  88980000
                                                                        88990000
 CNT_PI_CTR_SE = WRK_O - 1;                                             89070000
                                                                        89080000
 END R962_PROCESS_PI_CTR_SE;                                            89090000
 /*********************************************************************/89100000
 /*                                                                   */89110000
 /* MODULE NAME      :  R963_FILL_SERV_EXTN                           */89120000
 /*                                                                   */89130000
 /* DESCRIPTION      :  FILL BAU & PI SERVICE EXTENSION TO USER FILE  */89140000
 /*                                                                   */89150000
 /*********************************************************************/89160000
 R963_FILL_SERV_EXTN: PROC;                                             89170000
                                                                        89180000
 DCL L FIXED BIN(31);                                                   89190000
 DCL Q FIXED BIN(31);                                                   89191000
 L = 1;                                                                 89191100
 Q = 1;                                                                 89191200
                                                                        89192000
 SELECT;                                                                89250000
  WHEN(CNT_BAU_CTR_SE ¬= 0 & CNT_BAU_WAR_SE ¬= 0)                       89260000
  DO;                                                                   89270000
    IF (CNT_BAU_CTR_SE <= 5) THEN                                       89290000
      DO WHILE(((CNT_BAU_CTR_SE + L) <= 6 )&                            89300000
                           (BAU_SERV_EXTENSION_MESE(L)¬='   '));        89310000
      IF L <= (5 - CNT_BAU_CTR_SE) THEN                                 89330000
        BAU_SERV_EXTENSION(CNT_BAU_CTR_SE + L) =                        89340000
                                  BAU_SERV_EXTENSION_MESE(L);           89350000
      ELSE                                                              89360000
          BAU_SERV_EXTENSION(5) = 'ME>';                                89390000
      L = L + 1;                                                        89420000
      END;                                                              89430000
  END;                                                                  89450000
  WHEN(CNT_BAU_WAR_SE ¬= 0)                                             89510000
  DO;                                                                   89520000
    BAU_SERV_EXTENSION(*) = BAU_SERV_EXTENSION_MESE(*);                 89530000
  END;                                                                  89550000
  OTHERWISE;                                                            89560000
 END;                                                                   89600000
                                                                        89615000
 SELECT;                                                                89620000
  WHEN(CNT_PI_CTR_SE ¬= 0 & CNT_PI_WAR_SE ¬= 0)                         89630000
  DO;                                                                   89640000
    IF (CNT_PI_CTR_SE <= 5) THEN                                        89660000
      DO WHILE((CNT_PI_CTR_SE + Q) <= 6 &                               89670000
                                 PI_SERV_EXTENSION_SDF(Q)¬='');         89680000
      IF Q <= (5 - CNT_PI_CTR_SE) THEN                                  89690000
      DO;                                                               89691000
        PI_SERV_EXTENSION(CNT_PI_CTR_SE + Q) =                          89700000
                                 PI_SERV_EXTENSION_SDF(Q);              89710000
      END;                                                              89711000
      ELSE                                                              89720000
        PI_SERV_EXTENSION(5) = 'ME>';                                   89730000
      Q = Q + 1;                                                        89750000
      END;                                                              89760000
  END;                                                                  89780000
  WHEN(CNT_PI_WAR_SE ¬= 0)                                              89840000
  DO;                                                                   89850000
    PI_SERV_EXTENSION(*) = PI_SERV_EXTENSION_SDF(*);                    89860000
  END;                                                                  89880000
  OTHERWISE;                                                            89890000
 END;                                                                   89930000
                                                                        89940000
 END R963_FILL_SERV_EXTN;                              /* EOC RC01326 */89950000
 /*********************************************************************/89960000
 /*                                                     /*SOC RB01301 */89970000
 /* MODULE NAME      :  R965_FILL_BASE_WARRANTY_SLC                   */89980000
 /*                                                                   */89990000
 /* DESCRIPTION      :  FETCH AND FILL BASE WARRANTY SLC FIELD.       */90000000
 /*                     CHECK FOR A CONTRACT WHEN A WARRANTY EXISTS   */90010000
 /*********************************************************************/90020000
 /*R965_FILL_BASE_WARANTY_SLC: PROC;                      SOC RB01308 */90030000
                                                                        90040000
 /*BAU_WAR_PI_CTR_BAU_CTR = FALSE;                                      90050000
 /*BAU_WAR_BAU_CTR = FALSE;                                             90060000
 /*PI_WAR_PI_CTR_BAU_CTR = FALSE;                                       90070000
 /*WRK_BAU_SLC1 = '';                                                   90080000
 /*WRK_BAU_FTOW = '';                                                   90090000
 /*WRK_BAU_FSDT = '';                                                   90100000
 /*WRK_BAU_SLC2 = '';                                                   90110000
 /*WRK_PI_SLC1 = '';                                                    90120000
 /*WRK_PI_FTOW = '';                                                    90130000
 /*WRK_PI_WSDT = '';                                                    90140000
 /*WRK_PI_SLC2 = '';                                                    90150000
 /*TEMP_BASE_WARRANTY_SLC = '';                                         90160000
 /*                                                                     90170000
 /*IF PARM_RCB005.PI_TO_RCMS = 'Y' THEN                                 90180000
 /*              /* PROCESS PI ALONG WITH BAU WHEN PI TO RCMS = 'Y' */  90190000
 /*/* DO;                                                               90200000
 /*    EXEC SQL                                                         90210000
 /*    SELECT SERVICE_LVL_CODE, F_TYPE_OF_WARRANTY,                     90220000
 /*           F_SPLT_DATE, SERVICE_LVL_CODE_2                           90230000
 /*    INTO    :WRK_BAU_SLC1       :WRK_BAU_SLC1_INDNULL,               90240000
 /*            :WRK_BAU_FTOW       :WRK_BAU_FTOW_INDNULL,               90250000
 /*            :WRK_BAU_FSDT       :WRK_BAU_FSDT_INDNULL,               90260000
 /*            :WRK_BAU_SLC2       :WRK_BAU_SLC2_INDNULL                90270000
 /*    FROM RCBV0220_SUPPL_CTR                                          90280000
 /*    WHERE  COUNTRY_NUMBER   =  :WRK_CTRYNO                           90290000
 /*      AND  PRODUCT_TYPE     =  :SK_HW_TEMP.PRODUCT_TYPE              90300000
 /*      AND  ORIGIN           =  :SK_HW_TEMP.ORIGIN                    90310000
 /*      AND  SEQUENCE_NUMBER  =  :SK_HW_TEMP.SEQUENCE_NUMBER           90320000
 /*      AND  TYPE_OF_MAINT IS NULL                                     90330000
 /*      AND  TYPE_OF_WARRANTY IS NOT NULL                              90340000
 /*      AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND   END_DATE        90350000
 /*      AND (                                                          90360000
 /*                                                                     90370000
 /*      EXISTS (                                                       90380000
 /*      SELECT *                                                       90390000
 /*      FROM RCBV0241_PI_CTR                                           90400000
 /*      WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                           90410000
 /*        AND PRODUCT_TYPE     = :SK_HW_TEMP.PRODUCT_TYPE              90420000
 /*        AND ORIGIN           = :SK_HW_TEMP.ORIGIN                    90430000
 /*        AND SEQUENCE_NUMBER  = :SK_HW_TEMP.SEQUENCE_NUMBER           90440000
 /*        AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE        90450000
 /*        )                                                            90460000
 /*      OR                                                             90470000
 /*      EXISTS (                                                       90480000
 /*      SELECT *                                                       90490000
 /*      FROM RCBV0240_SERV_CTR                                         90500000
 /*      WHERE PRODUCT_TYPE        = :SK_HW_TEMP.PRODUCT_TYPE           90510000
 /*        AND ORIGIN              = :SK_HW_TEMP.ORIGIN                 90520000
 /*        AND SEQUENCE_NUMBER     = :SK_HW_TEMP.SEQUENCE_NUMBER        90530000
 /*        AND COUNTRY_NUMBER      = :WRK_CTRYNO                        90540000
 /*         AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE       90550000
 /*         )                                                           90560000
 /*         )                                                           90570000
 /*   FETCH FIRST 1 ROW ONLY;                                           90580000
 /*                                                                     90590000
 /*SELECT(SQLCA.SQLCODE);                                               90600000
 /*   WHEN(0)                                                           90610000
 /*     DO;                                                             90620000
 /*     BAU_WAR_PI_CTR_BAU_CTR = TRUE;                                  90630000
 /*     END;                                                            90640000
 /*   WHEN(100);                                                        90650000
 /*   OTHERWISE                                                         90660000
 /*     DO;                                                             90670000
 /*       CALL RCBDRIM_ERROR (ADDR(SQLCA),                              90680000
 /*                           'DB2',                                    90690000
 /*                           '#086');                                  90700000
 /*     END;                                                            90710000
 /*END;                                                                 90720000
 /*IF BAU_WAR_PI_CTR_BAU_CTR = TRUE &                                   90730000
 /*           SWITCH_CURRENT_PERIOD_FOUND THEN                          90740000
 /*  /*BAU ACTIVE WARRANTY WITH PI(C) OR BAU(C)*/                       90750000
  /*  DO;                                                               90760000
 /*                                                                     90770000
 /*     IF (VERIFY(WRK_BAU_FTOW, WRK_HB_TOM) = '0' ) &                  90780000
 /*        ( WRK_BAU_FTOW_INDNULL ¬= -1 ) THEN                          90790000
 /*       DO;                                                           90800000
 /*         IF WRK_RUN_DATE > WRK_BAU_FSDT THEN                         90810000
 /*            TEMP_BASE_WARRANTY_SLC = WRK_BAU_SLC2;                   90820000
 /*         ELSE                                                        90830000
 /*            TEMP_BASE_WARRANTY_SLC = WRK_BAU_SLC1;                   90840000
 /*       END;                                                          90850000
 /*     ELSE                                                            90860000
 /*        TEMP_BASE_WARRANTY_SLC = WRK_BAU_SLC1;                       90870000
 /*   END;                                                              90880000
 /*ELSE                                                                 90890000
 /*   DO;                                                               90900000
 /*   /*PI ACTIVE WARRANTY WITH PI(C) OR BAU(C) */                      90910000
  /*    EXEC SQL                                                        90920000
 /*     SELECT  SERVICE_LVL_CODE_1, F_TYPE_OF_WARRANTY,                 90930000
 /*             WARRANTY_SPLT_DATE, SERVICE_LVL_CODE_2                  90940000
 /*     INTO    :WRK_PI_SLC1        :WRK_PI_SLC1_INDNULL,               90950000
 /*             :WRK_PI_FTOW        :WRK_PI_FTOW_INDNULL,               90960000
 /*             :WRK_PI_WSDT        :WRK_PI_WSDT_INDNULL,               90970000
 /*             :WRK_PI_SLC2        :WRK_PI_SLC2_INDNULL                90980000
 /*     FROM RCBV0051_PI_HW_PR                                          90990000
 /*     WHERE  COUNTRY_NUMBER   =  :WRK_CTRYNO                          91000000
 /*       AND  PRODUCT_TYPE     =  :SK_HW_TEMP.PRODUCT_TYPE             91010000
 /*       AND  ORIGIN           =  :SK_HW_TEMP.ORIGIN                   91020000
 /*       AND  SEQUENCE_NUMBER  =  :SK_HW_TEMP.SEQUENCE_NUMBER          91030000
 /*       AND  INSTALL_DATE <= :WRK_RUN_DATE                            91040000
 /*       AND  WARRANTY_EXP_DATE >= :WRK_RUN_DATE                       91050000
 /*     AND (                                                           91060000
 /*         EXISTS (                                                    91070000
 /*         SELECT *                                                    91080000
 /*         FROM RCBV0241_PI_CTR C                                      91090000
 /*         WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                        91100000
 /*           AND PRODUCT_TYPE     = :SK_HW_TEMP.PRODUCT_TYPE           91110000
 /*           AND ORIGIN           = :SK_HW_TEMP.ORIGIN                 91120000
 /*           AND SEQUENCE_NUMBER  = :SK_HW_TEMP.SEQUENCE_NUMBER        91130000
 /*           AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE     91140000
 /*           )                                                         91150000
 /*         OR                                                          91160000
 /*         EXISTS (                                                    91170000
 /*         SELECT *                                                    91180000
 /*         FROM RCBV0240_SERV_CTR                                      91190000
 /*         WHERE PRODUCT_TYPE        = :SK_HW_TEMP.PRODUCT_TYPE        91200000
 /*           AND ORIGIN              = :SK_HW_TEMP.ORIGIN              91210000
 /*           AND SEQUENCE_NUMBER     = :SK_HW_TEMP.SEQUENCE_NUMBER     91220000
 /*           AND COUNTRY_NUMBER      = :WRK_CTRYNO                     91230000
 /*           AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE     91240000
 /*           )                                                         91250000
 /*           )                                                         91260000
 /*     FETCH FIRST 1 ROW ONLY;                                         91270000
 /*                                                                     91280000
 /*     SELECT(SQLCA.SQLCODE);                                          91290000
 /*       WHEN(0)                                                       91300000
 /*       DO;                                                           91310000
 /*       PI_WAR_PI_CTR_BAU_CTR = TRUE;                                 91320000
 /*       END;                                                          91330000
 /*       WHEN(100);                                                    91340000
 /*       OTHERWISE                                                     91350000
 /*         DO;                                                         91360000
 /*           CALL RCBDRIM_ERROR (ADDR(SQLCA),                          91370000
 /*                               'DB2',                                91380000
 /*                               '#087');                              91390000
 /*         END;                                                        91400000
 /*     END;                                                            91410000
 /*                                                                     91420000
 /*    IF PI_WAR_PI_CTR_BAU_CTR = TRUE THEN                             91430000
 /*      /*PI ACCTIVE WARRANTY WITH PI(C) OR BAU(C)*/                   91440000
 /*/*  DO;                                                              91450000
 /*                                                                     91460000
 /*      IF (VERIFY(WRK_PI_FTOW, WRK_HB_TOM) = '0' ) &                  91470000
 /*         ( WRK_PI_FTOW_INDNULL ¬= -1 ) THEN                          91480000
 /*          DO;                                                        91490000
 /*          IF WRK_RUN_DATE > WRK_PI_WSDT THEN                         91500000
 /*             TEMP_BASE_WARRANTY_SLC = WRK_PI_SLC2;                   91510000
 /*          ELSE                                                       91520000
 /*             TEMP_BASE_WARRANTY_SLC = WRK_PI_SLC1;                   91530000
 /*          END;                                                       91540000
 /*      ELSE                                                           91550000
 /*         TEMP_BASE_WARRANTY_SLC = WRK_PI_SLC1;                       91560000
 /*    END;                                                             91570000
 /*   END;                                                              91580000
 /* END;                                                                91590000
 /*ELSE                                                                 91600000
 /*  /* PROCESS BAU ONLY WHEN PI TO RCMS = 'N' */                       91610000
 /* DO;                                                                 91620000
 /*  EXEC SQL                                                           91630000
 /*  SELECT SERVICE_LVL_CODE, F_TYPE_OF_WARRANTY,                       91640000
 /*         F_SPLT_DATE, SERVICE_LVL_CODE_2                             91650000
 /*  INTO    :WRK_BAU_SLC1       :WRK_BAU_SLC1_INDNULL,                 91660000
 /*          :WRK_BAU_FTOW       :WRK_BAU_FTOW_INDNULL,                 91670000
 /*          :WRK_BAU_FSDT       :WRK_BAU_FSDT_INDNULL,                 91680000
 /*          :WRK_BAU_SLC2       :WRK_BAU_SLC2_INDNULL                  91690000
 /*  FROM RCBV0220_SUPPL_CTR                                            91700000
 /*  WHERE  COUNTRY_NUMBER   =  :WRK_CTRYNO                             91710000
 /*    AND  PRODUCT_TYPE     =  :SK_HW_TEMP.PRODUCT_TYPE                91720000
 /*    AND  ORIGIN           =  :SK_HW_TEMP.ORIGIN                      91730000
 /*    AND  SEQUENCE_NUMBER  =  :SK_HW_TEMP.SEQUENCE_NUMBER             91740000
 /*    AND  TYPE_OF_MAINT IS NULL                                       91750000
 /*    AND  TYPE_OF_WARRANTY IS NOT NULL                                91760000
 /*    AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND   END_DATE          91770000
 /*    AND (                                                            91780000
 /*                                                                     91790000
 /*      EXISTS (                                                       91800000
 /*      SELECT *                                                       91810000
 /*      FROM RCBV0240_SERV_CTR                                         91820000
 /*      WHERE PRODUCT_TYPE        = :SK_HW_TEMP.PRODUCT_TYPE           91830000
 /*        AND ORIGIN              = :SK_HW_TEMP.ORIGIN                 91840000
 /*        AND SEQUENCE_NUMBER     = :SK_HW_TEMP.SEQUENCE_NUMBER        91850000
 /*        AND COUNTRY_NUMBER      = :WRK_CTRYNO                        91860000
 /*         AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE       91870000
 /*         )                                                           91880000
 /*         )                                                           91890000
 /*   FETCH FIRST 1 ROW ONLY;                                           91900000
 /*                                                                     91910000
 /*SELECT(SQLCA.SQLCODE);                                               91920000
 /*   WHEN(0)                                                           91930000
 /*     DO;                                                             91940000
 /*       BAU_WAR_BAU_CTR = TRUE;                                       91950000
 /*     END;                                                            91960000
 /*   WHEN(100);                                                        91970000
 /*   OTHERWISE                                                         91980000
 /*     DO;                                                             91990000
 /*       CALL RCBDRIM_ERROR (ADDR(SQLCA),                              92000000
 /*                           'DB2',                                    92010000
 /*                           '#088');                                  92020000
 /*     END;                                                            92030000
 /*END;                                                                 92040000
 /*                                                                     92050000
 /*IF BAU_WAR_BAU_CTR = TRUE THEN                                       92060000
 /*  /*BAU ACTIVE WARRANTY WITH BAU(C)*/                                92070000
  /*  DO;                                                               92080000
 /*                                                                     92090000
 /*     IF (VERIFY(WRK_BAU_FTOW, WRK_HB_TOM) = '0' ) &                  92100000
 /*        ( WRK_BAU_FTOW_INDNULL ¬= -1 ) THEN                          92110000
 /*       DO;                                                           92120000
 /*         IF WRK_RUN_DATE > WRK_BAU_FSDT THEN                         92130000
 /*            TEMP_BASE_WARRANTY_SLC = WRK_BAU_SLC2;                   92140000
 /*         ELSE                                                        92150000
 /*            TEMP_BASE_WARRANTY_SLC = WRK_BAU_SLC1;                   92160000
 /*       END;                                                          92170000
 /*     ELSE                                                            92180000
 /*        TEMP_BASE_WARRANTY_SLC = WRK_BAU_SLC1;                       92190000
 /*   END;                                                              92200000
 /*END;                                                                 92210000
                                                                        92220000
 /*END  R965_FILL_BASE_WARANTY_SLC;                     /* EOC RB01301*/92230000
                                                      /* EOC RB01308 */ 92240000
1/********************************************************************/ 92250000
 /*                                                                  */ 92260000
 /* MODULE NAME      : R970_SORT_FOR_OUTPUT                          */ 92270000
 /*                                                                  */ 92280000
 /* DESCRIPTION      : SORT FOR OUTPUT ON TOS.                       */ 92290000
 /*                    DEPENDING OF ADDRESS RESOLUTION, FILE         */ 92300000
 /*                    RCBDRII OR RCBDRIK IS SORTED TO RCBDRI1       */ 92310000
 /*                                                                  */ 92320000
 /********************************************************************/ 92330000
 R970_SORT_FOR_OUTPUT: PROC;                                            92340000
                                                                        92350000
                                                                        92360000
 IF PARM_RCB005.ADDRESS_RES = '1'                                       92370000
 THEN                                                                   92380000
   DO;                                                                  92390000
     UNSPEC (SORT_FIELDS.MAX_STORAGE) = '00000000'B || UNSPEC('MAX');   92400000
                                                                        92410000
                                            /* SORT TOS              */ 92420000
     CALL PLISRTA                                                       92430000
     (' SORT FIELDS=(6,13,CH,A),DYNALLOC ',                             92440000
 /*   ' RECORD TYPE=F,LENGTH=(1312) ',                /* SOC RC01302 */ 92450000
                                                      /* SOC RB01320 */ 92460000
 /*   ' RECORD TYPE=F,LENGTH=(1330) ', */             /* EOC RC01302 */ 92470000
      ' RECORD TYPE=F,LENGTH=(1360) ',                /* EOC RB01320 */ 92480000
      SORT_FIELDS.MAX_STORAGE,                                          92490000
      SORT_FIELDS.RETURN_CODE,                                          92500000
      'OUT1');                                                          92510000
                                            /* EVALUATE SORT         */ 92520000
     CALL PLIRETC (SORT_FIELDS.RETURN_CODE);                            92530000
     SELECT (SORT_FIELDS.RETURN_CODE);                                  92540000
       WHEN ('');                                                       92550000
       OTHERWISE                                                        92560000
         DO;                                                            92570000
           PARM_INT_AREA.MESSAGE_TYPE = 'IS';                           92580000
           PARM_INT_AREA.MESSAGE_NUMBER = '0011';                       92590000
           PARM_INT_AREA.MSG_VAR_CODES = ' ';                           92600000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6 = 'RC';                92610000
           PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                     92620000
                                                SORT_FIELDS.RETURN_CODE;92630000
           CALL RCB0M1M (PTR_INT_AREA);                                 92640000
           CALL RCBDRIM_ERROR (NULL, 'OTHER', '#073');                  92650000
         END;                                                           92660000
     END;                                                               92670000
                                                                        92680000
     OPEN FILE(RCBDRI1);                               /* SOC RB01308 */92690000
                                                                        92700000
     READ FILE (RCBDRI1) INTO (IO_AREA_RCBDRI1);                        92710000
                                                                        92720000
     DO WHILE (¬SWITCH_END_OF_RCBDRI1);                                 92730000
       IF STRING(FILE_RCBDRI1_H.KEY) ¬= ''      &                       92740000
          STRING(FILE_RCBDRI1_H.KEY) ¬= (20)'9'  THEN                   92750000
            WRK_CNT_RCBDRI1 = WRK_CNT_RCBDRI1 + 1;                      92760000
            READ FILE (RCBDRI1) INTO (IO_AREA_RCBDRI1);                 92770000
     END;                                                               92780000
                                                                        92790000
     CLOSE FILE(RCBDRI1);                                               92800000
                                                                        92810000
     IF WRK_CNT_RCBDRI1 ¬= WRK_CNT_RCBDRIK                              92820000
     THEN                                                               92830000
       DO;                                                              92840000
         PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                        92850000
         PARM_INT_AREA.MESSAGE_NUMBER    = '0265';                      92860000
         PARM_INT_AREA.MSG_VAR_CODES     = '';                          92870000
         PARM_INT_AREA.MSG_VAR_CODE_6    = 'FL';                        92880000
         PARM_INT_AREA.MSG_VAR_VALUE_6   = 'RCBDRI1';                   92890000
         PARM_INT_AREA.MSG_VAR_CODE_7    = 'C7';                        92900000
         PARM_INT_AREA.MSG_VAR_VALUE_7   = WRK_CNT_RCBDRI1;             92910000
         PARM_INT_AREA.MSG_VAR_CODE_8    = 'FL';                        92920000
         PARM_INT_AREA.MSG_VAR_VALUE_8   = 'RCBDRIK';                   92930000
         PARM_INT_AREA.MSG_VAR_CODE_9    = 'C8';                        92940000
         PARM_INT_AREA.MSG_VAR_VALUE_9   = WRK_CNT_RCBDRIK;             92950000
         CALL RCB0M1M (PTR_INT_AREA);                                   92960000
         CALL RCBDRIM_ERROR (NULL, 'OTHER', '#104');                    92970000
       END;                                           /* EOC RB01308 */ 92980000
   END;                                                                 92990000
 ELSE;                                                                  93000000
                              /* SAVE HASH TOTAL IN PARAMETER RCB024 */ 93010000
 TB_RCBV500 = '';                                                       93020000
 TB_RCBV500_I = '';                                                     93030000
 TB_RCBP24S.NUMBER     = 'RCB024';                                      93040000
 TB_RCBP24S.PROC_ID    = WRK_PROC_ID;                                   93050000
 TB_RCBP24S.CTRYNO     = WRK_CTRYNO;                                    93060000
 TB_RCBP24S.FILE_NAME  = WRK_FILE_NAME_1;                               93070000
 TB_RCBP24S.TIME_STAMP = WRK_TIME_STAMP;                                93080000
 TB_RCBP24S.HASH_TOTAL = WRK_HASH_TOTAL_1;                              93090000
 TB_RCBP24S.LENGTH_PARM = STG(TB_RCBP24S.TIME_STAMP) +                  93100000
                          STG(TB_RCBP24S.HASH_TOTAL);                   93110000
                                                                        93120000
 CALL RCBG50M (ADDR(TB_RCBV500),                                        93130000
               ADDR(TB_RCBV500_I),                                      93140000
               PTR_RETURN_AREA_BB,                                      93150000
               PTR_INT_AREA);                                           93160000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    93170000
 WHEN (0);                                                              93180000
 WHEN (4)                          /* WHEN NOT FOUND THEN INSERT  */    93190000
   DO;                                                                  93200000
     CALL RCBF50M (ADDR(TB_RCBV500),                                    93210000
                   ADDR(TB_RCBV500_I),                                  93220000
                   PTR_RETURN_AREA_BB,                                  93230000
                   PTR_INT_AREA);                                       93240000
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                93250000
     WHEN (0);                                                          93260000
     OTHERWISE                                                          93270000
       DO;                                                              93280000
         CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          93290000
                             'DB2',                                     93300000
                             '#074');                                   93310000
       END;                                                             93320000
     END;                                                               93330000
   END;                                                                 93340000
 OTHERWISE                                                              93350000
   DO;                                                                  93360000
     CALL RCBDRIM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              93370000
                         'DB2',                                         93380000
                         '#075');                                       93390000
   END;                                                                 93400000
 END;                                                                   93410000
                                                                        93420000
 END R970_SORT_FOR_OUTPUT;                                              93430000
1/********************************************************************/ 93440000
 /*                                                                  */ 93450000
 /* MODULE NAME      : R999_END_PROGRAM                              */ 93460000
 /*                                                                  */ 93470000
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 93480000
 /*                                                                  */ 93490000
 /********************************************************************/ 93500000
 R999_END_PROGRAM:  PROC;                                               93510000
                                    /* WRITE COUNT MESSAGE           */ 93520000
                                   /* RCBDRII WRITTEN                */ 93530000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     93540000
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0004';                   93550000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       93560000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'FL';                     93570000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = WRK_FILE_NAME_I;          93580000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C6';                     93590000
 WRK_PIC_10 = WRK_CNT_RCBDRII;                                          93600000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = WRK_PIC_10;               93610000
 CALL RCB0M1M (PTR_INT_AREA);                                           93620000
                                                                        93630000
 IF PARM_RCB005.ADDRESS_RES = '1'                                       93640000
 THEN DO;                                                               93650000
                                     /* RCBDRIJ READ                 */ 93660000
   PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                     93670000
   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = '0003';                   93680000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = '';                       93690000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'FL';                     93700000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   = WRK_FILE_NAME_J;          93710000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'C1';                     93720000
   WRK_PIC_10 = WRK_CNT_RCBDRIJ;                                        93730000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   = WRK_PIC_10;               93740000
   CALL RCB0M1M (PTR_INT_AREA);                                         93750000
                                                                        93760000
                                     /* RCBDRG2 READ                 */ 93770000
   PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                     93780000
   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = '0003';                   93790000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = '';                       93800000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'FL';                     93810000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   = WRK_FILE_NAME_G;          93820000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'C1';                     93830000
   WRK_PIC_10 = WRK_CNT_RCBDRG2;                                        93840000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   = WRK_PIC_10;               93850000
   CALL RCB0M1M (PTR_INT_AREA);                                         93860000
                                                                        93870000
                                     /* RCBDRIK WRITTEN              */ 93880000
   PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                     93890000
   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = '0004';                   93900000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = '';                       93910000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'FL';                     93920000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   = WRK_FILE_NAME_K;          93930000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'C6';                     93940000
   WRK_PIC_10 = WRK_CNT_RCBDRIK;                                        93950000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   = WRK_PIC_10;               93960000
   CALL RCB0M1M (PTR_INT_AREA);                                         93970000
                                                                        93980000
                                     /* RCBDRI1 WRITTEN              */ 93990000
   PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                     94000000
   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = '0004';                   94010000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = '';                       94020000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'FL';                     94030000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   = WRK_FILE_NAME_1;          94040000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'C6';                     94050000
   /*WRK_PIC_10 = WRK_CNT_RCBDRII;/* = SAME AS SORTIN     /* RB01308 */ 94060000
   WRK_PIC_10 = WRK_CNT_RCBDRI1;                          /* RB01308 */ 94070000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   = WRK_PIC_10;               94080000
   CALL RCB0M1M (PTR_INT_AREA);                                         94090000
 END;                                                                   94100000
                                                                        94110000
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 94120000
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  94130000
 PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                                94140000
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    94150000
 CALL RCB0M1M (PTR_INT_AREA);                                           94160000
                                                                        94170000
                                    /* CLOSE MESSAGE FILE            */ 94180000
 PARM_INT_AREA.MSG_REQUEST = 'C';                                       94190000
 CALL RCB0M1M (PTR_INT_AREA);                                           94200000
                                                                        94210000
 END R999_END_PROGRAM;                                                  94220000
1/********************************************************************/ 94230000
 /*                                                                  */ 94240000
 /* MODULE NAME      : RCBDRIM_ERROR                                 */ 94250000
 /*                                                                  */ 94260000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 94270000
 /*                    THE INPUT VARIABLES                           */ 94280000
 /*                                                                  */ 94290000
 /********************************************************************/ 94300000
 RCBDRIM_ERROR: PROC             (PTR_ERROR,                            94310000
                         ERR_TYPE,                                      94320000
                         CALL_ID);                                      94330000
 DCL PTR_ERROR    PTR;                                                  94340000
 DCL ERR_TYPE      CHAR(8);                                             94350000
 DCL CALL_ID       CHAR(4);                                             94360000
 PARM_INT_AREA.PTR_ERROR          = PTR_ERROR;                          94370000
 PARM_INT_AREA.ERR_TYPE           = ERR_TYPE;                           94380000
 PARM_INT_AREA.CALL_ID            = CALL_ID;                            94390000
 CALL RCB0E1M (ADDR(PARM_INT_AREA));                                    94400000
 END RCBDRIM_ERROR;                                                     94410000
1/*******************************************************************/  94420000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  94430000
 /*******************************************************************/  94440000
 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */   94450000
 $DAIMOD (RCBDRIM);                      /* MODULE TO BE COMPILED   */  94460000
 /*******************************************************************/  94470000
 /* END OF ABR BLOCK                                                */  94480000
 /*******************************************************************/  94490000
 END RCBDRIM;                                                           94500000