 /* RCBDRGM - RCMS CUSTOMER: COMPARE                                 */ 00010000
 /*                                                                  */ 00020000
 /********************************************************************/ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /********************************************************************/ 00070000
 /*                                                                  */ 00080000
 /* MODULE NAME      : RCBDRGM                                       */ 00090000
 /*                                                                  */ 00100000
 /* PROGRAM NAME     : RCBDRGP                                       */ 00110000
 /*                                                                  */ 00120000
 /* LANGUAGE         : PLISQL          I                             */ 00130000
 /*                                                                  */ 00140000
 /* TYPE             : BATCH                                         */ 00150000
 /*                                                                  */ 00160000
 /* DESCRIPTION      : CREATE FULL OR DELTA EXTRACT FILES FOR RCMS,  */ 00170000
 /*                    AND A NEW FULL IMAGE,                         */ 00180000
 /*                    BY COMPARING OF OLD FULL IMAGE WITH DELTA     */ 00190000
 /*                    EXTRACT AND TEMPORARY TABLE                   */ 00200000
 /*                                                                  */ 00210000
 /* INPUT            : RCBDRG0 - OLD FULL IMAGE                      */ 00220000
 /*                    RCBDRG1 - DELTA EXTRACT                       */ 00230000
 /*                    RCBV0721_RCMS_CU                              */ 00240000
 /*                    RCBV0040_OU  (VIA RCBDR1M)                    */ 00250000
 /*                    RCBV0130_OU_STRUCT (VIA RCBDR1M)              */ 00260000
 /*                    RCBV0500_PARM                                 */ 00270000
 /*                                                                  */ 00280000
 /* OUTPUT           : RCBDRG2 - NEW FULL IMAGE                      */ 00290000
 /*                    RCBDRGX - FULL OR DELTA FILES FOR RCMS        */ 00300000
 /*                              (X=A-L,N-U)                         */ 00310000
 /*                    RCB0M10 - MESSAGE FILE                        */ 00320000
 /*                                                                  */ 00330000
 /* EXTERNAL MODULES : RCB0M1M - MESSAGE MODULE                      */ 00340000
 /*                    RCB0E1M - ERROR MODULE                        */ 00350000
 /*                    RCB0T1M - RETRIEVE SYSTEM DATE                */ 00360000
 /*                    RCB018M - CALCULATE HASH TOTAL                */ 00370000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00380000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00390000
 /*                    RCBI50M   REFERENCE PARAMETER                 */ 00400000
 /*                    RCBF50M   INSERT PARAMETER                    */ 00410000
 /*                    RCBG50M   UPDATE PARAMETER                    */ 00420000
 /*                                                      SOC PTM1038 */ 00430000
 /*                    RCB022M   CHECK HORIZON DATE                  */ 00440000
 /*                                                      EOC PTM1038 */ 00450000
 /*                    RCBDR0M   CREATE HEADER TRAILER FOR RCMS      */ 00460000
 /*                    RCBDR1M   RETRIEVE OU STRUCTURE ARRAY         */ 00470000
 /*                    RCBDR2M   OU PARAMETER REPORT                 */ 00480000
 /*                    RCBDR5U   USER EXIT                           */ 00490000
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00500000
 /*                                                                  */ 00510000
 /* MESSAGES         : I050,0002,0003,0004,0005,0013,0014,0142,0168, */ 00520000
 /*                    0174,0175,0189,9999                           */ 00530000
 /*                                                                  */ 00540000
 /* DEPENDENCIES     :                                               */ 00550000
 /*                                                                  */ 00560000
 /* FREQUENCY        : USER DEPENDENT (ON REQUEST)                   */ 00570000
 /*                                                                  */ 00580000
 /* MAINTENANCE LOG :                                                */ 00590000
 /* ---------------                                                  */ 00600000
 /*                                                                  */ 00610000
 /* DATE       | WORK-ITEMNO. | DESCRIPTION                          */ 00620000
 /* ---------------------------------------------------------------  */ 00630000
 /* 1993-05-07 |              | CEDS R2.0                            */ 00640000
 /* 1993-09-20 | CED0009      | MONITOR FUNCTION CHANGED CNT_PIC10   */ 00650000
 /*            |              | FORM (10)9 INTO Z,ZZZ,ZZZ,ZZ9 FOR    */ 00660000
 /*            |              | MESSAGE 0004                         */ 00670000
 /* 1993-11-30 | CED0014      | CHANGE FETCH INTO CALL SEE PTM 374   */ 00680000
 /* 1994-02-10 | PTM456       | FILL CHANGE FLAGS DURING FULL EXTRACT*/ 00690000
 /*            |              | EVEN IF NOTHING CHANGED.             */ 00700000
 /* 1995-04-25 | PTM0661      | CHANGED C1 TO C6 FOR MESSAGE 0004    */ 00710000
 /*            |              |                                      */ 00720000
 /* 1995-04-28 | PTM0684      | FILL CHANGE FLAG FOR COUNTRY         */ 00730000
 /*            |              | MESSAGE IDENTIFIER (SEDQMSI)         */ 00740000
 /* 1995-05-08 | PTM0676      | SWITCH_USER_EXIT IS NOW TESTED AFTER */ 00750000
 /*            |              | CALL TO RCBDR5U                      */ 00760000
 /* 1995-09-14 | RC01141      | DISPLAY OFFENDING KEY          (DG)  */ 00770000
 /*     "      |    "         | MESSAGE FOR EXCLUDED CUSTOMERS       */ 00780000
 /* 1996-03-20 | PTM0907      | COMPARE TO WRONG FILE CORRECTED      */ 00790000
 /* 1996-11-15 | PTM0983      | CHANGE SUBSTR ON MSG 0202 TO 2,7     */ 00800000
 /* 1997-02-07 | PCR0029      | REPLACE 'CREATED BY PRIME INPUT' BY  */ 00810000
 /*            |              | BLANKS FOR RCMS CU-EXTRACT RECORDS.  */ 00820000
 /* 1997-04-11 | PTM1036      | CORRECTED PROLOG                     */ 00830000
 /* 1997-05-05 | PTM1038      | CORRECT NAMES                        */ 00840000
 /* 1998-03-25 | PTM1168      | DO NOT ALWAYS REPEAT DELETES         */ 00850000
 /* 1999-07-28 | RC01219      | DORO                                 */ 00860000
 /* 2000-02-11 | PTM1316      | CUSTOMER ID WRONG IN WARNING         */ 00870000
 /* 2004-07-01 | RB01254      | LAST PROCESSED DATE IN FULL IMAGE    */ 00880000
 /* 2010-09-22 | RB01308      | PCR P10-0232,CHANGE IN SERVICE       */ 00890000
 /*            |              | EXTENSTION IS CONSIDER A CHANGE FOR  */ 00900000
 /*            |              | FULL EXTRACT FILE.                   */ 00910000
 /* 2012-01-09 | CEDS00000572 | CHANGE DEFINITION OF OU FIELD FROM   */ 00920000
 /*            |              | BIN(15) TO BIN(31)                   */ 00930000
 /* 2014-07-30 | RC01343      | PCEDSP-0487, HANDLING OF LAST        */ 00931000
 /*            |              | PROCESSING DATE IN FULL FILE         */ 00932000
 /* 2014-11-03 | CEDS00000706 | HANDLING OF LAST PROCESSING DATE     */ 00933034
 /*            |              | DURING INSERT CASE AS PART OF        */ 00934034
 /*            |              | TEMEA-T081548                        */ 00935036
 /********************************************************************/ 00940000
 /********************************************************************/ 00950000
1RCBDRGM: PROC                                                          00960000
          OPTIONS (MAIN)                                                00970000
          REORDER;                                                      00980000
0/********************************************************************/ 00990000
 /* FILE DECLARATIONS (NON GSAM)                                     */ 01000000
 /********************************************************************/ 01010000
                                 /* ALL FILES LENGTH 256             */ 01020000
0DCL RCBDRG0  FILE RECORD INPUT; /* OLD FULL IMAGE FILE              */ 01030000
0DCL RCBDRG1  FILE RECORD INPUT; /* DELTA EXTRACT FILE               */ 01040000
 DCL RCBDRG2  FILE RECORD OUTPUT;/* NEW FULL IMAGE FILE              */ 01050000
0DCL RCBDRGA  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 01  */ 01060000
 DCL RCBDRGB  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 02  */ 01070000
 DCL RCBDRGC  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 03  */ 01080000
 DCL RCBDRGD  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 04  */ 01090000
 DCL RCBDRGE  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 05  */ 01100000
 DCL RCBDRGF  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 06  */ 01110000
 DCL RCBDRGG  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 07  */ 01120000
 DCL RCBDRGH  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 08  */ 01130000
 DCL RCBDRGI  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 09  */ 01140000
 DCL RCBDRGJ  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 10  */ 01150000
 DCL RCBDRGK  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 11  */ 01160000
 DCL RCBDRGL  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 12  */ 01170000
 DCL RCBDRGN  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 13  */ 01180000
 DCL RCBDRGO  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 14  */ 01190000
 DCL RCBDRGP  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 15  */ 01200000
 DCL RCBDRGQ  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 16  */ 01210000
 DCL RCBDRGR  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 17  */ 01220000
 DCL RCBDRGS  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 18  */ 01230000
 DCL RCBDRGT  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 19  */ 01240000
 DCL RCBDRGU  FILE RECORD OUTPUT;/* FULL/DELTA FILE FOR RCMS GRP 20  */ 01250000
0DCL RCBDRGX(20)    FILE         /* FILES A-L, N-U                   */ 01260000
                    VARIABLE;                                           01270000
0/********************************************************************/ 01280000
 /* RECORD STRUCTURES FOR INPUT FILES                                */ 01290000
 /********************************************************************/ 01300000
                                 /* IOAREA OLD FULL IMAGE            */ 01310000
 /* SOC RB01254: CHANGE 256 INTO 266 AND ADD LAST_PROCESSED_DATE     */ 01320000
 DCL IO_AREA_RCBDRG0        CHAR(266) ;                                 01330000
 DCL 1 FILE_RCBDRG0 BASED(ADDR(IO_AREA_RCBDRG0)),                       01340000
      %INCLUDE (RCBDRFS);,                                              01350000
      3 LAST_PROCESSED_DATE CHAR(10);;                                  01360000
 /* EOC RB01254 */                                                      01370000
                                                                        01380000
0                                /* FULL IMAGE HEADER/TRAILER        */ 01390000
 DCL 1 FILE_RCBDRG0_H BASED(ADDR(IO_AREA_RCBDRG0)),                     01400000
      %INCLUDE (RCBD01S);;                                              01410000
                                                                        01420000
                                 /* IOAREA DELTA EXTRACT             */ 01430000
 DCL IO_AREA_RCBDRG1        CHAR(256) ;                                 01440000
 DCL 1 FILE_RCBDRG1 BASED(ADDR(IO_AREA_RCBDRG1)),                       01450000
      %INCLUDE (RCBDRFS);;                                              01460000
0                                /* DELTA EXTRACT HEADER/TRAIL.      */ 01470000
 DCL 1 FILE_RCBDRG1_H BASED(ADDR(IO_AREA_RCBDRG1)),                     01480000
      %INCLUDE (RCBD01S);;                                              01490000
0/********************************************************************/ 01500000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01510000
 /********************************************************************/ 01520000
0DCL PTR_INT_AREA        PTR;                                           01530000
 DCL PTR_RETURN_AREA_BB  PTR;                                           01540000
 DCL PTR_COUNTRY_AREA    PTR;                                           01550000
 DCL PTR_RUN_DATE_AREA   PTR;                                           01560000
0DCL 1 PARM_INT_AREA,                          /* INTERFACE AREA     */ 01570000
       %INCLUDE (RCBZ01S);;                                             01580000
0DCL 1 RETURN_AREA_BB,                         /* RETURN AREA        */ 01590000
       %INCLUDE (RCBZ02S);;                                             01600000
0DCL 1 DATE_AREA,                              /* DATE AREA          */ 01610000
       %INCLUDE (RCBZ03S);;                                             01620000
0DCL 1 COUNTRY_AREA,                           /* COUNTRY AREA       */ 01630000
       %INCLUDE (RCBZ26S);;                                             01640000
0DCL 1 RUN_DATE_AREA,                          /* RUN DATE AREA      */ 01650000
       %INCLUDE (RCBZ28S);;                                             01660000
0DCL 1 PARM_RCB024M,                           /* RCB024M PARM       */ 01670000
       %INCLUDE (RCBZ33S);;                                             01680000
0/********************************************************************/ 01690000
 /* SPECIAL AREAS                                                    */ 01700000
 /********************************************************************/ 01710000
                                 /* IOAREA OLD FULL IMAGE            */ 01720000
 DCL IO_AREA_RCBDRG2         CHAR(256) ;                                01730000
 DCL 1 FILE_RCBDRG2 BASED(ADDR(IO_AREA_RCBDRG2)),                       01740000
      %INCLUDE (RCBDRFS);;                                              01750000
                                                       /*SOC RB01254 */ 01760000
                                 /* NEW FULL IMAGE AREA              */ 01770000
 DCL 1 NFI_AREA,                                                        01780000
      %INCLUDE (RCBDRFS);,                                              01790000
      3 LAST_PROCESSED_DATE CHAR(10);;                                  01800000
                                                       /*EOC RB01254 */ 01810000
                                                                        01820000
0                                /* FULL IMAGE HEADER/TRAILER        */ 01830000
 DCL 1 FILE_RCBDRG2_H BASED(ADDR(IO_AREA_RCBDRG2)),                     01840000
      %INCLUDE (RCBD01S);;                                              01850000
                                                                        01860000
                                 /* IOAREA RCMS FILES                */ 01870000
 DCL IO_AREA_RCBDRGX         CHAR(256) ;                                01880000
 DCL 1 FILE_RCBDRGX BASED(ADDR(IO_AREA_RCBDRGX)),                       01890000
      %INCLUDE (RCBDRFS);;                                              01900000
                                                                        01910000
0                                /* RCMS FILES HEADER/TRAILER        */ 01920000
 DCL 1 FILE_RCBDRGX_H BASED(ADDR(IO_AREA_RCBDRGX)),                     01930000
      2 DATA,                                                           01940000
      %INCLUDE (RCBDR0S1);;                                             01950000
                                                                        01960000
 DCL 1 RCBDR0S0,                 /* HEADER/TRAILER AREA RCMS         */ 01970000
      %INCLUDE RCBDR0S0;;                                               01980000
0DCL 1 RCBDR1S0,                 /* OU STRUCTURE ARRAY               */ 01990000
      %INCLUDE (RCBDR1S0);;                                             02000000
 DCL PTR_RCBDR1S  PTR;           /* OUTPUT FILE POINTER              */ 02010000
0DCL 1 RCBDR2S0,                 /* OU PARAMETER REPORT              */ 02020000
      %INCLUDE (RCBDR2S0);;                                             02030000
 DCL PTR_RCBDR2S  PTR;           /* OUTPUT FILE POINTER              */ 02040000
1/********************************************************************/ 02050000
 /*  USER EXIT FIELDS                                                */ 02060000
 /********************************************************************/ 02070000
 DCL USER_SWITCH_EXIT    BIT(1);                                        02080000
0DCL 1 USER_EXIT,                                                       02090000
      3 UDTEUEX          CHAR(8),                                       02100000
      3 UDTECUF          CHAR(30);                                      02110000
1/********************************************************************/ 02120000
 /* DB2 TABLE STRUCTURES                                             */ 02130000
 /********************************************************************/ 02140000
0DCL 1 TB_RCBV721,                                                      02150000
      %INCLUDE (RCB721S);;                                              02160000
0DCL 1 TB_RCBV500,                                                      02170000
      %INCLUDE (RCB500S);;                                              02180000
 DCL 1 TB_RCBV500_I,                                                    02190000
      %INCLUDE (RCB500SI);;                                             02200000
0DCL 1 TB_RCB010    BASED (ADDR(TB_RCBV500))                            02210000
                    UNALIGNED,                                          02220000
      %INCLUDE (RCBP10S);;                                              02230000
0DCL 1 TB_RCB011    BASED (ADDR(TB_RCBV500))                            02240000
                    UNALIGNED,                                          02250000
      %INCLUDE (RCBP11S);;                                              02260000
0DCL 1 TB_RCB014    BASED (ADDR(TB_RCBV500)),                           02270000
      %INCLUDE (RCBP14S);;                                              02280000
0DCL 1 TB_RCB016    BASED (ADDR(TB_RCBV500)),                           02290000
      %INCLUDE (RCBP16S);;                                              02300000
0DCL 1 TB_RCB024    BASED (ADDR(TB_RCBV500)),                           02310000
      %INCLUDE (RCBP24S);;                                              02320000
0DCL 1 TB_RCB037    BASED (ADDR(TB_RCBV500)),                           02330000
      %INCLUDE (RCBP37S);;                                              02340000
1/********************************************************************/ 02350000
 /* SORT KEYS                                                        */ 02360000
 /********************************************************************/ 02370000
0DCL 1 SK_NEW,                   /* SORT KEY NEW                     */ 02380000
      3 EOF              CHAR (1),                                      02390000
      3 KEY,                     /* SORT KEY CU                      */ 02400000
       5 CUSTOMER_NUMBER CHAR (8),                                      02410000
       5 IODPDBU         CHAR (8),                                      02420000
       5 ICUSANO         CHAR (3);                                      02430000
0DCL 1 SK0          LIKE SK_NEW; /* SORT KEY RCBDRG0                 */ 02440000
 DCL 1 SK1          LIKE SK_NEW; /* SORT KEY RCBDRG1                 */ 02450000
 DCL 1 SK2          LIKE SK_NEW; /* KEY RCBV0721_RCMS_CU             */ 02460000
 DCL 1 SK_OLD       LIKE SK_NEW; /* OLD SORT KEY                     */ 02470000
0DCL 1 SK0_KEY1     CHAR (9) DEFINED (SK0);                             02480000
0DCL 1 SK1_KEY1     CHAR (9) DEFINED (SK1);                             02490000
0DCL 1 SK2_KEY1     CHAR (9) DEFINED (SK2);                             02500000
0DCL 1 SK_NEW1      CHAR (9) DEFINED (SK_NEW);                          02510000
0DCL 1 SK_OLD1      CHAR (9) DEFINED (SK_OLD);                          02520000
1/********************************************************************/ 02530000
 /* EXTERNAL ENTRIES                                                 */ 02540000
 /********************************************************************/ 02550000
0DCL PLIXOPT   EXTERNAL                                                 02560000
               CHAR (30) VARYING INIT ('ISA(20K),NOSTAE');              02570000
0DCL RCB0M1M        EXT ENTRY;   /* MESSAGE MODULE                   */ 02580000
 DCL RCB0E1M        EXT ENTRY;   /* ERROR MODULE                     */ 02590000
 DCL RCB0T1M        EXT ENTRY;   /* RETRIEVE SYSTEM DATE             */ 02600000
 DCL RCB018M        EXT ENTRY;   /* HASH TOTAL CALCULATION           */ 02610000
 DCL RCB019M        EXT ENTRY;   /* RETRIEVE COUNTRY NUMBERS         */ 02620000
 DCL RCB020M        EXT ENTRY;   /* RETRIEVE RUN DATE                */ 02630000
                                                      /* SOC PTM1038 */ 02640000
 DCL RCB022M        EXT ENTRY;   /* CHECK HORIZON DATE               */ 02650000
                                                      /* EOC PTM1038 */ 02660000
 DCL RCBI50M        EXT ENTRY;   /* REFERENCE PARAMETER              */ 02670000
 DCL RCBF50M        EXT ENTRY;   /* INSERT PARAMETER                 */ 02680000
 DCL RCBG50M        EXT ENTRY;   /* UPDATE PARAMETER                 */ 02690000
 DCL RCBDR0M        EXT ENTRY;   /* CREATE HEADER/TRAILER            */ 02700000
 DCL RCBDR1M        EXT ENTRY;   /* OU STRUCTURE ARRAY               */ 02710000
 DCL RCBDR2M        EXT ENTRY;   /* OU PARAMETER REPORT              */ 02720000
 DCL RCBDR5U        EXT ENTRY;   /* USER EXIT                        */ 02730000
 DCL RCB024M        EXT ENTRY;   /* LOCK DB2 TABLE PARTITION         */ 02740000
0/********************************************************************/ 02750000
 /* BIT SWITCHES                                                     */ 02760000
 /********************************************************************/ 02770000
 DCL 1 SWITCHES,                                                        02780000
     3 TRUE             BIT(1)       INIT('1'B),                        02790000
     3 FALSE            BIT(1)       INIT('0'B),                        02800000
     3 SWITCH_USER_EXIT BIT(1)       INIT('1'B);                        02810000
 DCL WRITING_RCBDRGX_FLAG   BIT (1)  INIT('0'B); /* RC01343 */          02811000
0/********************************************************************/ 02820000
 /* MISCELLANEOUS FIELDS                                             */ 02830000
 /********************************************************************/ 02840000
0DCL WRK_MOD_NAME         CHAR (08)   INIT ('RCBDRGM ');                02850000
 DCL WRK_LEVEL            FIXED BIN (15);                               02860000
 DCL WRK_PGM_NAME         CHAR (08)   INIT ('RCBDRGP ');                02870000
 DCL WRK_SYSTEM_TYPE      CHAR (01)   INIT ('B');                       02880000
 DCL WRK_PGR_TYPE         CHAR (03);                                    02890000
 DCL WRK_PROC_ID          CHAR (04);                                    02900000
 DCL WRK_CTRYNO           CHAR (03)   INIT ('');                        02910000
 DCL WRK_RUN_DATE         CHAR (10);                                    02920000
 DCL WRK_LENGTH_PARM      FIXED BIN (15);                               02930000
 DCL WRK_TIME_STAMP       CHAR (20);                                    02940000
 DCL WRK_SYSTEM_ID        PIC'99';     /* WRK FIELD FOR MSG NR       */ 02950000
 DCL WRK_SYSTEM_ID_PIC4   BASED(ADDR(RCBDR0S0.SYSTEM_ID))               02960000
                  PIC'9999';           /* TO FILL CHAR FIELD WITH NUM*/ 02970000
 DCL WRK_RCBDRG0          CHAR (07)   INIT ('RCBDRG0');                 02980000
 DCL WRK_RCBDRG1          CHAR (07)   INIT ('RCBDRG1');                 02990000
 DCL WRK_RCBDRG2          CHAR (07)   INIT ('RCBDRG2');                 03000000
 DCL WRK_RCBDRF1          CHAR (07)   INIT ('RCBDRF1'); /* DELTA FILE*/ 03010000
 DCL WRK_INDNULL          FIXED BIN(15);                                03020000
 DCL WRK_HORIZON_DATE     CHAR (10);                                    03030000
                                                      /* SOC PCR0029 */ 03040000
 DCL WRK_CUSTNAM    CHAR(30) INIT(' ');/* SAVE-FIELD CUSTOMER-NAME   */ 03050000
                                                      /* EOC PCR0029 */ 03060000
 DCL WRK_OU_CODE    CHAR(7)  INIT(' ');/* OU_CODE WORK FIELD         */ 03070000
 DCL WRK_OU_CODE_O  CHAR(7)  INIT(' ');/* OU_CODE WORK FIELD PREV.   */ 03080000
 DCL 1 WRK_RCB014,                     /* SAVE FOR UPDATE RUN SEQ NO */ 03090000
      %INCLUDE (RCBP14S);;                                              03100000
 DCL WRK_OU_PARM_REP      CHAR (01);   /* OU PARM REPORT REQUESTED   */ 03110000
                                         /* SOC CEDS00000572         */ 03120000
 /*DCL OU_NR        FIXED BIN(15);       /* OU_NR WITHIN P11_ARRAY   */ 03130000
 /*DCL OU_NR_LOW    FIXED BIN(15);       /* LOWER BOUNDERY           */ 03140000
 /*DCL OU_NR_HIGH   FIXED BIN(15);       /* UPPER BOUNDERY           */ 03150000
 DCL OU_NR          FIXED BIN(31);       /* OU_NR WITHIN P11_ARRAY   */ 03160000
 DCL OU_NR_LOW      FIXED BIN(31);       /* LOWER BOUNDERY           */ 03170000
 DCL OU_NR_HIGH     FIXED BIN(31);       /* UPPER BOUNDERY           */ 03180000
                                         /* EOC CEDS00000572         */ 03190000
 DCL OU_FOUND       BIT(1);                                             03200000
0DCL SQLCODE_FETCH  FIXED BIN(31);     /* RESULT OF FETCH            */ 03210000
 DCL 1 P10_ARRAY(20),            /* SYSTEM ID ARRAY FROM P10         */ 03220000
      3 EXTRACT_TYPE             /* TYPE OF EXTRACT                  */ 03230000
                    CHAR(1);                                            03240000
 DCL 1 P11_ARRAY,                /* OU CODE ARRAY FROM P11           */ 03250000
      %INCLUDE RCBDR1S1;;                                               03260000
 DCL WRK_HASH_RCBDRG0     FIXED DEC (15,0);                             03270000
 DCL WRK_HASH_RCBDRG1     FIXED DEC (15,0);                             03280000
0DCL 1 COUNT,                                                           03290000
       3 RCBDRG0_HASH     FIXED DEC (15,0),                             03300000
       3 RCBDRG1_HASH     FIXED DEC (15,0),                             03310000
       3 RCBDRG2_HASH     FIXED DEC (15,0),                             03320000
       3 RCBDRGX_HASH(20) FIXED DEC (15,0),                             03330000
       3 RCBDRG0          FIXED BIN (31),                               03340000
       3 RCBDRG1          FIXED BIN (31),                               03350000
       3 RCBDRG2          FIXED BIN (31),                               03360000
       3 RCBDRGX(20)      FIXED BIN (31);                               03370000
 DCL CNT_TOT               FIXED DEC (9,0)     INIT (0);                03380000
 DCL CNT_PIC10             PIC 'Z,ZZZ,ZZZ,ZZ9'; /* WI CED0009 */        03390000
 DCL CNT_PIC15             PIC '(15)9';                                 03400000
 DCL TRUE           BIT(1)             INIT('1'B);                      03410000
 DCL FALSE          BIT(1)             INIT('0'B);                      03420000
1/********************************************************************/ 03430000
 /*  BUILTIN FUNCTIONS                                               */ 03440000
 /********************************************************************/ 03450000
0DCL (ADDR,                                                             03460000
     CSTG,                                                              03470000
     DATE,                                                              03480000
     NULL,                                                              03490000
     STG,                                                               03500000
     PLIRETC,                                                           03510000
     STRING,                                                            03520000
     SUBSTR,                                                            03530000
     TIME)                   BUILTIN;                                   03540000
1/********************************************************************/ 03550000
 /* ON ENDFILE                                                       */ 03560000
 /********************************************************************/ 03570000
0ON ENDFILE (RCBDRG0)                                                   03580000
   BEGIN;                                                               03590000
     SK0.EOF = '1';                                                     03600000
   END;                                                                 03610000
 ON ENDFILE (RCBDRG1)                                                   03620000
   BEGIN;                                                               03630000
     SK1.EOF = '1';                                                     03640000
   END;                                                                 03650000
0/********************************************************************/ 03660000
 /* ON ERROR CONDITIONS                                              */ 03670000
 /********************************************************************/ 03680000
 %INCLUDE RCB0E0M;                                                      03690000
 END;                                                                   03700000
1/********************************************************************/ 03710000
 /* DB2/SQL SQLCA                                                    */ 03720000
 /********************************************************************/ 03730000
0 EXEC SQL                                                              03740000
    INCLUDE SQLCA                                                       03750000
   ;                                                                    03760000
0/********************************************************************/ 03770000
 /* DB2/SQL CURSORS                                                  */ 03780000
 /********************************************************************/ 03790000
                                 /************************************/ 03800000
                                 /* CURSOR_1_V721                    */ 03810000
                                 /* RETRIEVE FROM TEMP.TABLE         */ 03820000
                                 /************************************/ 03830000
 EXEC SQL                                                               03840000
   DECLARE CURSOR_1_V721 CURSOR FOR                                     03850000
   SELECT DISTINCT CUSTOMER_NUMBER                                      03860000
   FROM RCBV0721_RCMS_CU                                                03870000
   WHERE COUNTRY_NUMBER = :WRK_CTRYNO                                   03880000
   ORDER BY CUSTOMER_NUMBER                                             03890000
   FOR FETCH ONLY                                         /* RC01219 */ 03900000
           ;                                                            03910000
                                 /************************************/ 03920000
                                 /* CURSOR_1_V500                    */ 03930000
                                 /* RETRIEVE FROM PARAMETER TABLE    */ 03940000
                                 /************************************/ 03950000
 EXEC SQL                                                               03960000
   DECLARE CURSOR_1_V500 CURSOR FOR                                     03970000
   SELECT *                                                             03980000
   FROM RCBV0500_PARM                                                   03990000
   WHERE PARAMETER_NUMBER     = :TB_RCBV500.PARAMETER_NUMBER            04000000
     AND PARAMETER_KEY     LIKE :TB_RCBV500.PARAMETER_KEY               04010000
   ORDER BY PARAMETER_KEY                                               04020000
   FOR FETCH ONLY                                         /* RC01219 */ 04030000
           ;                                                            04040000
1/********************************************************************/ 04050000
 /*                 S T A R T   P R O C E S S I N G                  */ 04060000
 /********************************************************************/ 04070000
 CALL R090_INIT_PROG;                        /* INIT PROGRAM         */ 04080000
 CALL R080_INIT_PROCESSING;                  /* INIT PROCESSING      */ 04090000
 DO WHILE (SK_NEW.EOF = '0');    /* WHILE NOT EOF                    */ 04100000
   CALL R001_INIT_CU;                                                   04110000
   DO WHILE (SK_NEW1 = SK_OLD1); /* WHILE SAME CUSTOMER              */ 04120000
     SELECT;                                                            04130000
                                             /* SITUATION 1          */ 04140000
       WHEN (STRING(SK0_KEY1) = STRING(SK1_KEY1) &                      04150000
             STRING(SK0_KEY1) = STRING(SK2_KEY1))                       04160000
         DO;                                                            04170000
           SELECT;                                                      04180000
                                             /* SAME IODPDBU         */ 04190000
             WHEN (STRING(SK0) = STRING(SK1))                           04200000
               DO;                                                      04210000
                 CALL R002_GET_SEL(SUBSTR(SK1.IODPDBU,2,7));            04220000
                               /* START OF RC01141 */                   04230000
                 IF OU_FOUND = FALSE THEN                               04240000
                 DO;                                                    04250000
                   PARM_INT_AREA.MESSAGE_TYPE             = 'BU';       04260000
                   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0202';     04270000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';         04280000
                   PARM_INT_AREA.MSG_AREA.COUNTRY_NUMBER  = WRK_CTRYNO; 04290000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'OU';       04300000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =             04310000
                                               SUBSTR(SK1.IODPDBU,2,7); 04320000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'CU';       04330000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =             04340000
                                      TB_RCBV721.CUSTOMER_NUMBER;       04350000
                   CALL RCB0M1M (PTR_INT_AREA);                         04360000
                 END;                                                   04370000
                               /* END   OF RC01141 */                   04380000
                 CALL R031_UPD;              /* CHANGED RECORD       */ 04390000
                 CALL R021_WRITE_RCBDRG2;    /* WRITE F.I.RECORD     */ 04400000
                 CALL R010_READ0;            /* READ F.I. RECORD     */ 04410000
                 CALL R011_READ1;            /* READ DELTA RECORD    */ 04420000
               END;                                                     04430000
                                             /* DELETE               */ 04440000
             WHEN (STRING(SK0) < STRING(SK1))                           04450000
               DO;                                                      04460000
                 CALL R002_GET_SEL(SUBSTR(SK0.IODPDBU,2,7));            04470000
                               /* START OF RC01141 */                   04480000
                 IF OU_FOUND = FALSE THEN                               04490000
                 DO;                                                    04500000
                   PARM_INT_AREA.MESSAGE_TYPE             = 'BU';       04510000
                   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0202';     04520000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';         04530000
                   PARM_INT_AREA.MSG_AREA.COUNTRY_NUMBER  = WRK_CTRYNO; 04540000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'OU';       04550000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =             04560000
                                               SUBSTR(SK0.IODPDBU,2,7); 04570000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'CU';       04580000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =             04590000
                                      TB_RCBV721.CUSTOMER_NUMBER;       04600000
                   CALL RCB0M1M (PTR_INT_AREA);                         04610000
                 END;                                                   04620000
                               /* END   OF RC01141 */                   04630000
                 CALL R032_DEL;              /* DELETE RECORD        */ 04640000
                 CALL R010_READ0;            /* READ F.I. RECORD     */ 04650000
               END;                                                     04660000
                                             /* INSERT               */ 04670000
             WHEN (STRING(SK1) < STRING(SK0))                           04680000
               DO;                                                      04690000
                 CALL R002_GET_SEL(SUBSTR(SK1.IODPDBU,2,7));            04700000
                               /* START OF RC01141 */                   04710000
                 IF OU_FOUND = FALSE THEN                               04720000
                 DO;                                                    04730000
                   PARM_INT_AREA.MESSAGE_TYPE             = 'BU';       04740000
                   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0202';     04750000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';         04760000
                   PARM_INT_AREA.MSG_AREA.COUNTRY_NUMBER  = WRK_CTRYNO; 04770000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'OU';       04780000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =             04790000
                                               SUBSTR(SK1.IODPDBU,2,7); 04800000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'CU';       04810000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =             04820000
                                      TB_RCBV721.CUSTOMER_NUMBER;       04830000
                   CALL RCB0M1M (PTR_INT_AREA);                         04840000
                 END;                                                   04850000
                               /* END   OF RC01141 */                   04860000
                 CALL R034_INSERT;           /* DELETE RECORD        */ 04870000
                 CALL R021_WRITE_RCBDRG2;    /* WRITE F.I.RECORD     */ 04880000
                 CALL R011_READ1;            /* READ DELTA RECORD    */ 04890000
               END;                                                     04900000
           END;                                                         04910000
         END;                                                           04920000
                                             /* SITUATION 2          */ 04930000
       WHEN (STRING(SK0_KEY1) = STRING(SK2_KEY1) &                      04940000
             STRING(SK0_KEY1) < STRING(SK1_KEY1))                       04950000
                                             /* DELETE               */ 04960000
         DO;                                                            04970000
           CALL R002_GET_SEL(SUBSTR(SK0.IODPDBU,2,7));                  04980000
                               /* START OF RC01141 */                   04990000
                 IF OU_FOUND = FALSE THEN                               05000000
                 DO;                                                    05010000
                   PARM_INT_AREA.MESSAGE_TYPE             = 'BU';       05020000
                   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0202';     05030000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';         05040000
                   PARM_INT_AREA.MSG_AREA.COUNTRY_NUMBER  = WRK_CTRYNO; 05050000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'OU';       05060000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =             05070000
                                               SUBSTR(SK0.IODPDBU,2,7); 05080000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'CU';       05090000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =             05100000
                                      TB_RCBV721.CUSTOMER_NUMBER;       05110000
                   CALL RCB0M1M (PTR_INT_AREA);                         05120000
                 END;                                                   05130000
                               /* END   OF RC01141 */                   05140000
           CALL R032_DEL;                    /* DELETE RECORD        */ 05150000
           CALL R010_READ0;                  /* READ F.I. RECORD     */ 05160000
         END;                                                           05170000
                                             /* SITUATION 3          */ 05180000
       WHEN (STRING(SK0_KEY1) < STRING(SK1_KEY1) &                      05190000
             STRING(SK0_KEY1) < STRING(SK2_KEY1))                       05200000
                                             /* NO CHANGE            */ 05210000
         DO;                                                            05220000
           CALL R002_GET_SEL(SUBSTR(SK0.IODPDBU,2,7));                  05230000
                               /* START OF RC01141 */                   05240000
                 IF OU_FOUND = FALSE THEN                               05250000
                 DO;                                                    05260000
                   PARM_INT_AREA.MESSAGE_TYPE             = 'BU';       05270000
                   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0202';     05280000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';         05290000
                   PARM_INT_AREA.MSG_AREA.COUNTRY_NUMBER  = WRK_CTRYNO; 05300000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'OU';       05310000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =             05320000
                                               SUBSTR(SK0.IODPDBU,2,7); 05330000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'CU';       05340000
                                              /* PTM 1316 */            05350000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =             05360000
                                      SK0.CUSTOMER_NUMBER;              05370000
                   CALL RCB0M1M (PTR_INT_AREA);                         05380000
                 END;                                                   05390000
                               /* END   OF RC01141 */                   05400000
           CALL R033_NO_CHANGE;              /* NO CHANGE            */ 05410000
           CALL R021_WRITE_RCBDRG2;          /* WRITE F.I.RECORD     */ 05420000
           CALL R010_READ0;                  /* READ F.I. RECORD     */ 05430000
         END;                                                           05440000
                                             /* SITUATION 4          */ 05450000
       WHEN (STRING(SK1_KEY1) < STRING(SK0_KEY1) &                      05460000
             STRING(SK1_KEY1) = STRING(SK2_KEY1))                       05470000
                                             /* INSERT               */ 05480000
         DO;                                                            05490000
           CALL R002_GET_SEL(SUBSTR(SK1.IODPDBU,2,7));                  05500000
                               /* START OF RC01141 */                   05510000
                 IF OU_FOUND = FALSE THEN                               05520000
                 DO;                                                    05530000
                   PARM_INT_AREA.MESSAGE_TYPE             = 'BU';       05540000
                   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0202';     05550000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';         05560000
                   PARM_INT_AREA.MSG_AREA.COUNTRY_NUMBER  = WRK_CTRYNO; 05570000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'OU';       05580000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =             05590000
                                               SUBSTR(SK1.IODPDBU,2,7); 05600000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'CU';       05610000
                   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =             05620000
                                      TB_RCBV721.CUSTOMER_NUMBER;       05630000
                   CALL RCB0M1M (PTR_INT_AREA);                         05640000
                 END;                                                   05650000
                               /* END   OF RC01141 */                   05660000
           CALL R034_INSERT;                 /* NO CHANGE            */ 05670000
           CALL R021_WRITE_RCBDRG2;          /* WRITE F.I.RECORD     */ 05680000
           CALL R011_READ1;                  /* READ DELTA RECORD    */ 05690000
         END;                                                           05700000
                                             /* SITUATION 5          */ 05710000
       WHEN (STRING(SK2_KEY1) < STRING(SK0_KEY1) &                      05720000
             STRING(SK2_KEY1) < STRING(SK1_KEY1))                       05730000
                                             /* IGNORE               */ 05740000
         DO;                                                            05750000
         END;                                                           05760000
     END;                                                               05770000
                                             /* DETERMINE SMALLEST   */ 05780000
                                             /* SORT KEY F.I.&DELTA  */ 05790000
     CALL R058_PROCESS_SK_2;                                            05800000
                                             /* IF NEW CUSTOMER      */ 05810000
     DO WHILE (STRING(SK_NEW1) > STRING(SK2_KEY1));                     05820000
       CALL R012_FETCH_CURSOR_1_V721;        /* READ TEMP.TAB. RECORD*/ 05830000
       CALL R059_PROCESS_SK;                 /* SORT KEY             */ 05840000
     END;                                                               05850000
   END;                                                                 05860000
 END;                                                                   05870000
 CALL R089_END_PROCESSING;                                              05880000
 CALL R099_TERM;                             /* TERMINATE PROGRAM    */ 05890000
1/********************************************************************/ 05900000
 /*                                                                  */ 05910000
 /* MODULE NAME      : R001_INIT_CU                                  */ 05920000
 /*                                                                  */ 05930000
 /* DESCRIPTION      : INITIALISATION OF CUSTOMER                    */ 05940000
 /*                                                                  */ 05950000
 /********************************************************************/ 05960000
 R001_INIT_CU: PROC;                                                    05970000
                                                                        05980000
 SK_OLD1 = SK_NEW1;              /* SAVE CUSTOMER KEY                */ 05990000
                                                                        06000000
 END R001_INIT_CU;                                                      06010000
1/********************************************************************/ 06020000
 /*                                                                  */ 06030000
 /* MODULE NAME      : R002_GET_SEL                                  */ 06040000
 /*                                                                  */ 06050000
 /* DESCRIPTION      : GET SELECTION FOR OU CODE                     */ 06060000
 /*                                                                  */ 06070000
 /********************************************************************/ 06080000
 R002_GET_SEL: PROC(OU_CODE);                                           06090000
                                                                        06100000
 DCL OU_CODE      CHAR(7);       /* OU CODE                         */  06110000
 OU_NR_LOW  = 1;                 /* SET BOUNDERIES                  */  06120000
 OU_NR_HIGH = RCBDR1S0.MAX_OU_SEQNR;                                    06130000
 OU_FOUND   = FALSE;                                                    06140000
                                 /* DO BINARY SEARCH FOR OU CODE    */  06150000
 DO WHILE (OU_NR_LOW <= OU_NR_HIGH);                                    06160000
   OU_NR = (OU_NR_HIGH + OU_NR_LOW) / 2;                                06170000
   SELECT;                       /* CHECK WHERE WE ARE              */  06180000
                                 /* WHERE WE WANT TO BE             */  06190000
     WHEN (P11_ARRAY.OU_CODE(OU_NR) = OU_CODE)                          06200000
       DO;                                                              06210000
                                 /* FORCE LOOP EXIT                 */  06220000
         OU_FOUND   = TRUE;                                             06230000
         OU_NR_HIGH = OU_NR_LOW - 1;                                    06240000
       END;                                                             06250000
                                 /* WE HAVE TO LOOK HIGHER          */  06260000
     WHEN (P11_ARRAY.OU_CODE(OU_NR) < OU_CODE)                          06270000
       DO;                                                              06280000
         OU_NR_LOW = OU_NR + 1;  /* MOVE LOWER BOUNDERY UP          */  06290000
       END;                                                             06300000
     OTHERWISE                                                          06310000
       DO;                       /* WE HAVE TO LOOK LOWER           */  06320000
         OU_NR_HIGH = OU_NR - 1; /* MOVE UPPER BOUNDERY DOWN        */  06330000
       END;                                                             06340000
     END;                                                               06350000
   END;                                                                 06360000
 END R002_GET_SEL;                                                      06370000
1/********************************************************************/ 06380000
 /*                                                                  */ 06390000
 /* MODULE NAME      : R010_READ0                                    */ 06400000
 /*                                                                  */ 06410000
 /* DESCRIPTION      : READ OLD FULL IMAGE                           */ 06420000
 /*                                                                  */ 06430000
 /********************************************************************/ 06440000
 R010_READ0: PROC;                                                      06450000
 IO_AREA_RCBDRG0 = '';                                                  06460000
 READ FILE(RCBDRG0) INTO (IO_AREA_RCBDRG0);                             06470000
 IF SK0.EOF = '0'                /* NOT YET EOF                      */ 06480000
   THEN                                                                 06490000
     DO;                                                                06500000
       SELECT(FILE_RCBDRG0_H.KEY);                                      06510000
         WHEN (' ');                                                    06520000
         WHEN ('99999999999999999999')                                  06530000
           DO;                                                          06540000
             SK0.EOF = '1';                                             06550000
           END;                                                         06560000
         OTHERWISE                                                      06570000
           DO;                                                          06580000
             COUNT.RCBDRG0 = COUNT.RCBDRG0 + 1;                         06590000
             CALL RCB018M (SUBSTR(FILE_RCBDRG0.CUNOUSE,3,4),            06600000
                           COUNT.RCBDRG0_HASH,                          06610000
                           PTR_INT_AREA);                               06620000
             SK0.KEY = '';                                              06630000
             SK0.CUSTOMER_NUMBER = FILE_RCBDRG0.CUNOUSE;                06640000
             SK0.IODPDBU         = STRING(FILE_RCBDRG0.IODPDBU);        06650000
             SK0.ICUSANO         = FILE_RCBDRG0.ICUSANO;                06660000
           END;                                                         06670000
       END;                                                             06680000
     END;                                                               06690000
 END R010_READ0;                                                        06700000
1/********************************************************************/ 06710000
 /*                                                                  */ 06720000
 /* MODULE NAME      : R011_READ1                                    */ 06730000
 /*                                                                  */ 06740000
 /* DESCRIPTION      : READ DELTA EXTRACT FILE                       */ 06750000
 /*                                                                  */ 06760000
 /********************************************************************/ 06770000
 R011_READ1: PROC;                                                      06780000
 IO_AREA_RCBDRG1 = '';                                                  06790000
 READ FILE(RCBDRG1) INTO (IO_AREA_RCBDRG1);                             06800000
 IF SK1.EOF = '0'                /* NOT YET EOF                      */ 06810000
   THEN                                                                 06820000
     DO;                                                                06830000
       SELECT(FILE_RCBDRG1_H.KEY);                                      06840000
         WHEN (' ');                                                    06850000
         WHEN ('99999999999999999999')                                  06860000
           DO;                                                          06870000
             SK1.EOF = '1';                                             06880000
           END;                                                         06890000
         OTHERWISE                                                      06900000
           DO;                                                          06910000
             COUNT.RCBDRG1 = COUNT.RCBDRG1 + 1;                         06920000
             CALL RCB018M (SUBSTR(FILE_RCBDRG1.CUNOUSE,3,4),            06930000
                           COUNT.RCBDRG1_HASH,                          06940000
                           PTR_INT_AREA);                               06950000
             SK1.KEY = '';                                              06960000
             SK1.CUSTOMER_NUMBER = FILE_RCBDRG1.CUNOUSE;                06970000
             SK1.IODPDBU         = STRING(FILE_RCBDRG1.IODPDBU);        06980000
             SK1.ICUSANO         = FILE_RCBDRG1.ICUSANO;                06990000
           END;                                                         07000000
       END;                                                             07010000
     END;                                                               07020000
 END R011_READ1;                                                        07030000
1/********************************************************************/ 07040000
 /*                                                                  */ 07050000
 /* MODULE NAME      : R012_FETCH_CURSOR_1_V721                      */ 07060000
 /*                                                                  */ 07070000
 /* DESCRIPTION      : FETCH CURSOR_1_V721                           */ 07080000
 /*                                                                  */ 07090000
 /********************************************************************/ 07100000
 R012_FETCH_CURSOR_1_V721: PROC;                                        07110000
0                                /* INIT STRUCTURES                  */ 07120000
 TB_RCBV721    = '';                                                    07130000
0                                /* FETCH CURSOR                     */ 07140000
 EXEC SQL                                                               07150000
   FETCH CURSOR_1_V721                                                  07160000
   INTO :TB_RCBV721.CUSTOMER_NUMBER        :WRK_INDNULL                 07170000
       ;                                                                07180000
0 SELECT (SQLCODE);                                                     07190000
   WHEN (0)                                                             07200000
     DO;                                                                07210000
       SK2.KEY             = '';                                        07220000
       SK2.CUSTOMER_NUMBER = TB_RCBV721.CUSTOMER_NUMBER;                07230000
     END;                                                               07240000
   WHEN (100)                                                           07250000
     DO;                                                                07260000
       SK2.EOF = '1';                                                   07270000
     END;                                                               07280000
   OTHERWISE                                                            07290000
     DO;                                                                07300000
       CALL R100_ERROR (ADDR (SQLCA),                                   07310000
                              'DB2',                                    07320000
                              '#001');                                  07330000
     END;                                                               07340000
 END;                                                                   07350000
                                                                        07360000
0 END R012_FETCH_CURSOR_1_V721;                                         07370000
1/********************************************************************/ 07380000
 /*                                                                  */ 07390000
 /* MODULE NAME      : R013_FETCH_CURSOR_1_V500                      */ 07400000
 /*                                                                  */ 07410000
 /* DESCRIPTION      : FETCH CURSOR_1_V500                           */ 07420000
 /*                                                                  */ 07430000
 /********************************************************************/ 07440000
 R013_FETCH_CURSOR_1_V500: PROC;                                        07450000
0                                /* FETCH CURSOR                     */ 07460000
 EXEC SQL                                                               07470000
   FETCH CURSOR_1_V500                                                  07480000
   INTO :TB_RCBV500  :TB_RCBV500_I.INDNULL                              07490000
   ;                                                                    07500000
 SQLCODE_FETCH = SQLCA.SQLCODE;  /* SAVE SQLCODE FROM FETCH         */  07510000
                                                                        07520000
0 SELECT (SQLCODE);                                                     07530000
   WHEN (0,100);                                                        07540000
   OTHERWISE                                                            07550000
     DO;                                                                07560000
       CALL R100_ERROR (ADDR (SQLCA),                                   07570000
                              'DB2',                                    07580000
                              '#002');                                  07590000
     END;                                                               07600000
 END;                                                                   07610000
                                                                        07620000
0 END R013_FETCH_CURSOR_1_V500;                                         07630000
1/********************************************************************/ 07640000
 /*                                                          RC01219 */ 07650000
 /* MODULE NAME      : R020_LOCK_TABLES                              */ 07660000
 /*                                                                  */ 07670000
 /* DESCRIPTION      : LOCK TABLES UNTIL PROGRAM ENDS                */ 07680000
 /*                                                                  */ 07690000
 /********************************************************************/ 07700000
 R020_LOCK_TABLES: PROC;                                                07710000
                                                                        07720000
                                                                        07730000
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 07740000
                                                                        07750000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0721_RCMS_CU';                      07760000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 07770000
                                                                        07780000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      07790000
               PTR_RETURN_AREA_BB,                                      07800000
               PTR_INT_AREA);                                           07810000
                                                                        07820000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    07830000
   WHEN (0);                                                            07840000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 07850000
     DO;                                                                07860000
       CALL R100_ERROR (NULL, 'OTHER', '#003');                         07870000
     END;                                                               07880000
   OTHERWISE                                                            07890000
     DO;                                                                07900000
       CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),               07910000
                                 'DB2',                                 07920000
                                 '#004');                               07930000
     END;                                                               07940000
 END;                                                                   07950000
                                                                        07960000
 END R020_LOCK_TABLES;                                                  07970000
1/********************************************************************/ 07980000
 /*                                                                  */ 07990000
 /* MODULE NAME      : R021_WRITE_RCBDRG2                            */ 08000000
 /*                                                                  */ 08010000
 /* DESCRIPTION      : WRITE NEW F.I.                                */ 08020000
 /*                                                                  */ 08030000
 /********************************************************************/ 08040000
 R021_WRITE_RCBDRG2: PROC;                                              08050000
                                                                        08060000
 /* SOC RB01254: ADD        */                                          08070000
 NFI_AREA = FILE_RCBDRG2, BY NAME;                                      08080000
 IF ¬WRITING_RCBDRGX_FLAG THEN                /* SOC RC01343 */         08090000
   DO;                                                                  08091000
     NFI_AREA.LAST_PROCESSED_DATE = FILE_RCBDRG0.LAST_PROCESSED_DATE;   08100000
   END;                                                                 08110000
 ELSE                                                                   08111000
   DO;                                                                  08111100
     NFI_AREA.LAST_PROCESSED_DATE = WRK_RUN_DATE;                       08112000
   END;                                       /* EOC RC01343 */         08113000
 WRITE FILE(RCBDRG2) FROM (NFI_AREA);                                   08120000
 NFI_AREA.LAST_PROCESSED_DATE = '';                                     08130000
                                                                        08140000
 COUNT.RCBDRG2 = COUNT.RCBDRG2 + 1;                                     08150000
 CALL RCB018M (SUBSTR(NFI_AREA.CUNOUSE,3,4),                            08160000
               COUNT.RCBDRG2_HASH,                                      08170000
               PTR_INT_AREA);                                           08180000
 /* EOC RB01254             */                                          08190000
                                                                        08200000
 END R021_WRITE_RCBDRG2;                                                08210000
1/********************************************************************/ 08220000
 /*                                                                  */ 08230000
 /* MODULE NAME      : R022_WRITE_RCBDRGX                            */ 08240000
 /*                                                                  */ 08250000
 /* DESCRIPTION      : WRITE RCMS FILE, REPLACE 'CREATED BY PRIME    */ 08260000
 /*                    INPUT' BY BLANKS FOR RCMS CUSTOMER-RECORDS    */ 08270000
 /*                                                                  */ 08280000
 /********************************************************************/ 08290000
 R022_WRITE_RCBDRGX: PROC;                                              08300000
                                                                        08310000
                                                      /* SOC PCR0029 */ 08320000
 IF FILE_RCBDRG2.CUNAME = 'CREATED BY PRIME INPUT'                      08330000
 THEN                                                                   08340000
   DO;                                                                  08350000
     WRK_CUSTNAM = ' ';                                                 08360000
     WRK_CUSTNAM = FILE_RCBDRG2.CUNAME;                                 08370000
     FILE_RCBDRG2.CUNAME = ' ';                                         08380000
     WRITE FILE(RCBDRGX(WRK_SYSTEM_ID)) FROM (IO_AREA_RCBDRG2);         08390000
     FILE_RCBDRG2.CUNAME = WRK_CUSTNAM;                                 08400000
   END;                                                                 08410000
 ELSE                                                                   08420000
   DO;                                                                  08430000
     WRITE FILE(RCBDRGX(WRK_SYSTEM_ID)) FROM (IO_AREA_RCBDRG2);         08440000
   END;                                                                 08450000
                                                      /* EOC PCR0029 */ 08460000
 COUNT.RCBDRGX(WRK_SYSTEM_ID)                                           08470000
               = COUNT.RCBDRGX(WRK_SYSTEM_ID)+ 1;                       08480000
 CALL RCB018M (SUBSTR(FILE_RCBDRG2.CUNOUSE,3,4),                        08490000
               COUNT.RCBDRGX_HASH(WRK_SYSTEM_ID),                       08500000
               PTR_INT_AREA);                                           08510000
                                                                        08520000
 END R022_WRITE_RCBDRGX;                                                08530000
1/********************************************************************/ 08540000
 /*                                                                  */ 08550000
 /* MODULE NAME      : R031_UPD                                      */ 08560000
 /*                                                                  */ 08570000
 /* DESCRIPTION      : PROCESS CHANGED RECORD                        */ 08580000
 /*                                                                  */ 08590000
 /********************************************************************/ 08600000
 R031_UPD: PROC;                                                        08610000
                                                                        08620000
 WRITING_RCBDRGX_FLAG = '0'B;                            /* RC01343 */  08630000
 /* SOC RB01254: ADD LAST_PROCESSED_DATE                            */  08640000
 NFI_AREA.LAST_PROCESSED_DATE = WRK_RUN_DATE;                           08650000
 /* EOC RB01254                                                      */ 08660000
                                 /* INPUT TO OUTPUT                  */ 08670000
 IO_AREA_RCBDRG2 = IO_AREA_RCBDRG1;                                     08680000
                                                                        08690000
 IF OU_FOUND                                                            08700000
   THEN                                                                 08710000
     DO;                                                                08720000
                                 /* PROCESS SYSTEM ID'S              */ 08730000
       DO WRK_SYSTEM_ID = 1 TO 20;                                      08740000
         IF P10_ARRAY(WRK_SYSTEM_ID).EXTRACT_TYPE ¬= ' '                08750000
           THEN                                                         08760000
             DO;                                                        08770000
               SELECT (P11_ARRAY.UPDATE_TYPE                            08780000
                                         (OU_NR,WRK_SYSTEM_ID));        08790000
                 WHEN ('E')                                             08800000
                   DO;                                                  08810000
                                              /* PTM1168 NO RE-DELETE*/ 08820000
                     IF FILE_RCBDRG0.CDBSCHG ¬= 'D'                     08830000
                     THEN DO;                                           08840000
                       FILE_RCBDRG2.CDBSCHG = 'D';                      08850000
                       CALL R022_WRITE_RCBDRGX;                         08860000
                       WRITING_RCBDRGX_FLAG = '1'B; /* RC01343 */       08870000
                     END;                                               08880000
                   END;                                                 08890000
                 WHEN ('F')                                             08900000
                   DO;                                                  08910000
                     FILE_RCBDRG2.CDBSCHG = 'M';                        08920000
                     IF SWITCH_USER_EXIT = TRUE                         08930000
                       THEN                                             08940000
                         DO;                                            08950000
                                 /* CALL USER EXIT                   */ 08960000
                           USER_SWITCH_EXIT = SWITCH_USER_EXIT;         08970000
                           CALL RCBDR5U (ADDR(USER_SWITCH_EXIT),        08980000
                                         ADDR(FILE_RCBDRG2),            08990000
                                         ADDR(USER_EXIT.UDTEUEX),       09000000
                                         ADDR(USER_EXIT.UDTECUF),       09010000
                                         PTR_INT_AREA);                 09020000
                           SWITCH_USER_EXIT = USER_SWITCH_EXIT;         09030000
                           IF SWITCH_USER_EXIT = TRUE                   09040000
                             THEN                                       09050000
                               DO;                                      09060000
                                 FILE_RCBDRG2.UDTEUEX =                 09070000
                                                     USER_EXIT.UDTEUEX; 09080000
                                 FILE_RCBDRG2.UDTECUF =                 09090000
                                                     USER_EXIT.UDTECUF; 09100000
                               END;                                     09110000
                         END;                                           09120000
                     FILE_RCBDRG2.FCUSNAM = '1';                        09130000
                     FILE_RCBDRG2.FCUSSTR = '1';                        09140000
                     FILE_RCBDRG2.FCUSCIT = '1';                        09150000
                     FILE_RCBDRG2.FCUS3AD = '1';                        09160000
                     FILE_RCBDRG2.FCUSZIP = '1';                        09170000
                     FILE_RCBDRG2.FCUACOD = '1';                        09180000
                     FILE_RCBDRG2.FPTDSAD = '1';                        09190000
                     FILE_RCBDRG2.FDTEUEX = '1';                        09200000
                     FILE_RCBDRG2.FDTECUF = '1';                        09210000
                     FILE_RCBDRG2.FCUSCCC = '1';                        09220000
                     FILE_RCBDRG2.FCUSTOC = '1';                        09230000
                     FILE_RCBDRG2.FCUSHSI = '1';                        09240000
                     FILE_RCBDRG2.FCUSCLC = '1';                        09250000
                     FILE_RCBDRG2.SEDQEMB = '1';                        09260000
                     FILE_RCBDRG2.FAGRCLA = '1';                        09270000
                     FILE_RCBDRG2.FSEDQMS = '1';  /* PTM 0684  */       09280000
                     CALL R022_WRITE_RCBDRGX;                           09290000
                     WRITING_RCBDRGX_FLAG = '1'B; /* RC01343 */         09300000
                   END;                                                 09310000
                 WHEN ('D')                                             09320000
                   DO;                                                  09330000
                                              /* PTM1168  LEAVE 'D'*/   09340000
                     IF FILE_RCBDRG0.CDBSCHG ¬= 'D'                     09350000
                     THEN                                               09360000
                       FILE_RCBDRG2.CDBSCHG = '';                       09370000
                     FILE_RCBDRG2.FDTEUEX = '0';                        09380000
                     FILE_RCBDRG2.FDTECUF = '0';                        09390000
                     IF SWITCH_USER_EXIT = TRUE                         09400000
                       THEN                                             09410000
                         DO;                                            09420000
                                 /* CALL USER EXIT                   */ 09430000
                           USER_SWITCH_EXIT = SWITCH_USER_EXIT;         09440000
                           CALL RCBDR5U (ADDR(USER_SWITCH_EXIT),        09450000
                                         ADDR(FILE_RCBDRG2),            09460000
                                         ADDR(USER_EXIT.UDTEUEX),       09470000
                                         ADDR(USER_EXIT.UDTECUF),       09480000
                                         PTR_INT_AREA);                 09490000
                           SWITCH_USER_EXIT = USER_SWITCH_EXIT;         09500000
                           IF SWITCH_USER_EXIT = TRUE  /* PTM 676    */ 09510000
                             THEN                                       09520000
                               DO;                                      09530000
                                   FILE_RCBDRG2.UDTEUEX =               09540000
                                                 USER_EXIT.UDTEUEX;     09550000
                                   FILE_RCBDRG2.UDTECUF =               09560000
                                                 USER_EXIT.UDTECUF;     09570000
                               END;                                     09580000
                         END;                                           09590000
                                                                        09600000
                     IF FILE_RCBDRG2.UDTEUEX ¬=                         09610000
                                   FILE_RCBDRG0.UDTEUEX   /* PTM 907 */ 09620000
                       THEN                                             09630000
                         DO;                                            09640000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  09650000
                           FILE_RCBDRG2.FDTEUEX = '1';                  09660000
                         END;                                           09670000
                     IF FILE_RCBDRG2.UDTECUF ¬=                         09680000
                                   FILE_RCBDRG0.UDTECUF   /* PTM 907 */ 09690000
                       THEN                                             09700000
                         DO;                                            09710000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  09720000
                           FILE_RCBDRG2.FDTECUF = '1';                  09730000
                         END;                                           09740000
                                                                        09750000
                     IF FILE_RCBDRG1.CUNAME = FILE_RCBDRG0.CUNAME       09760000
                       THEN                                             09770000
                         DO;                                            09780000
                           FILE_RCBDRG2.FCUSNAM = '0';                  09790000
                         END;                                           09800000
                       ELSE                                             09810000
                         DO;                                            09820000
                           FILE_RCBDRG2.FCUSNAM = '1';                  09830000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  09840000
                         END;                                           09850000
                     IF FILE_RCBDRG1.NCUSSTR = FILE_RCBDRG0.NCUSSTR     09860000
                       THEN                                             09870000
                         DO;                                            09880000
                           FILE_RCBDRG2.FCUSSTR = '0';                  09890000
                         END;                                           09900000
                       ELSE                                             09910000
                         DO;                                            09920000
                           FILE_RCBDRG2.FCUSSTR = '1';                  09930000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  09940000
                         END;                                           09950000
                     IF FILE_RCBDRG1.ICUSCTY = FILE_RCBDRG0.ICUSCTY     09960000
                       THEN                                             09970000
                         DO;                                            09980000
                           FILE_RCBDRG2.FCUSCIT = '0';                  09990000
                         END;                                           10000000
                       ELSE                                             10010000
                         DO;                                            10020000
                           FILE_RCBDRG2.FCUSCIT = '1';                  10030000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10040000
                         END;                                           10050000
                     IF FILE_RCBDRG1.ICUS3AD = FILE_RCBDRG0.ICUS3AD     10060000
                       THEN                                             10070000
                         DO;                                            10080000
                           FILE_RCBDRG2.FCUS3AD = '0';                  10090000
                         END;                                           10100000
                       ELSE                                             10110000
                         DO;                                            10120000
                           FILE_RCBDRG2.FCUS3AD = '1';                  10130000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10140000
                         END;                                           10150000
                     IF FILE_RCBDRG1.ICUSGZC = FILE_RCBDRG0.ICUSGZC     10160000
                       THEN                                             10170000
                         DO;                                            10180000
                           FILE_RCBDRG2.FCUSZIP = '0';                  10190000
                         END;                                           10200000
                       ELSE                                             10210000
                         DO;                                            10220000
                           FILE_RCBDRG2.FCUSZIP = '1';                  10230000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10240000
                         END;                                           10250000
                     IF FILE_RCBDRG1.CCUACOD = FILE_RCBDRG0.CCUACOD     10260000
                       THEN                                             10270000
                         DO;                                            10280000
                           FILE_RCBDRG2.FCUACOD = '0';                  10290000
                         END;                                           10300000
                       ELSE                                             10310000
                         DO;                                            10320000
                           FILE_RCBDRG2.FCUACOD = '1';                  10330000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10340000
                         END;                                           10350000
                     IF FILE_RCBDRG1.CPTDSAD = FILE_RCBDRG0.CPTDSAD     10360000
                       THEN                                             10370000
                         DO;                                            10380000
                           FILE_RCBDRG2.FPTDSAD = '0';                  10390000
                         END;                                           10400000
                       ELSE                                             10410000
                         DO;                                            10420000
                           FILE_RCBDRG2.FPTDSAD = '1';                  10430000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10440000
                         END;                                           10450000
                     IF FILE_RCBDRG1.FCUSCDC = FILE_RCBDRG0.FCUSCDC     10460000
                       THEN                                             10470000
                         DO;                                            10480000
                           FILE_RCBDRG2.FCUSCCC = '0';                  10490000
                         END;                                           10500000
                       ELSE                                             10510000
                         DO;                                            10520000
                           FILE_RCBDRG2.FCUSCCC = '1';                  10530000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10540000
                         END;                                           10550000
                     IF FILE_RCBDRG1.CCUSTOC = FILE_RCBDRG0.CCUSTOC     10560000
                       THEN                                             10570000
                         DO;                                            10580000
                           FILE_RCBDRG2.FCUSTOC = '0';                  10590000
                         END;                                           10600000
                       ELSE                                             10610000
                         DO;                                            10620000
                           FILE_RCBDRG2.FCUSTOC = '1';                  10630000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10640000
                         END;                                           10650000
                     IF FILE_RCBDRG1.FHSISOI = FILE_RCBDRG0.FHSISOI     10660000
                       THEN                                             10670000
                         DO;                                            10680000
                           FILE_RCBDRG2.FCUSHSI = '0';                  10690000
                         END;                                           10700000
                       ELSE                                             10710000
                         DO;                                            10720000
                           FILE_RCBDRG2.FCUSHSI = '1';                  10730000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10740000
                         END;                                           10750000
                     IF FILE_RCBDRG1.FCUSEMB = FILE_RCBDRG0.FCUSEMB     10760000
                       THEN                                             10770000
                         DO;                                            10780000
                           FILE_RCBDRG2.SEDQEMB = '0';                  10790000
                         END;                                           10800000
                       ELSE                                             10810000
                         DO;                                            10820000
                           FILE_RCBDRG2.SEDQEMB = '1';                  10830000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10840000
                         END;                                           10850000
                     IF FILE_RCBDRG1.CCUSCLC = FILE_RCBDRG0.CCUSCLC     10860000
                       THEN                                             10870000
                         DO;                                            10880000
                           FILE_RCBDRG2.FCUSCLC = '0';                  10890000
                         END;                                           10900000
                       ELSE                                             10910000
                         DO;                                            10920000
                           FILE_RCBDRG2.FCUSCLC = '1';                  10930000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  10940000
                         END;                                           10950000
                     IF FILE_RCBDRG1.AAGRCLA = FILE_RCBDRG0.AAGRCLA     10960000
                       THEN                                             10970000
                         DO;                                            10980000
                           FILE_RCBDRG2.FAGRCLA = '0';                  10990000
                         END;                                           11000000
                       ELSE                                             11010000
                         DO;                                            11020000
                           FILE_RCBDRG2.FAGRCLA = '1';                  11030000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  11040000
                         END;                                           11050000
                                                      /* SOC RB01308 */ 11060000
                     IF ((FILE_RCBDRG1.SERV_EXTENSION(1) =              11070000
                                        FILE_RCBDRG0.SERV_EXTENSION(1))&11080000
                         (FILE_RCBDRG1.SERV_EXTENSION(2) =              11090000
                                        FILE_RCBDRG0.SERV_EXTENSION(2))&11100000
                         (FILE_RCBDRG1.SERV_EXTENSION(3) =              11110000
                                        FILE_RCBDRG0.SERV_EXTENSION(3))&11120000
                         (FILE_RCBDRG1.SERV_EXTENSION(4) =              11130000
                                        FILE_RCBDRG0.SERV_EXTENSION(4))&11140000
                         (FILE_RCBDRG1.SERV_EXTENSION(5) =              11150000
                                        FILE_RCBDRG0.SERV_EXTENSION(5)))11160000
                       THEN                                             11170000
                         DO;                                            11180000
                           FILE_RCBDRG2.FCUSCLC = '0';                  11190000
                         END;                                           11200000
                       ELSE                                             11210000
                         DO;                                            11220000
                           FILE_RCBDRG2.FCUSCLC = '1';                  11230000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  11240000
                         END;                                           11250000
                                                      /* EOC RB01308 */ 11260000
                                                                        11270000
                                   /* PTM 0684                       */ 11280000
                     IF FILE_RCBDRG1.SEDQMSI = FILE_RCBDRG0.SEDQMSI     11290000
                       THEN                                             11300000
                         DO;                                            11310000
                           FILE_RCBDRG2.FSEDQMS = '0';                  11320000
                         END;                                           11330000
                       ELSE                                             11340000
                         DO;                                            11350000
                           FILE_RCBDRG2.FSEDQMS = '1';                  11360000
                           FILE_RCBDRG2.CDBSCHG = 'M';                  11370000
                         END;                                           11380000
                                   /* CHANGES FOUND OR FLAGS SET     */ 11390000
                     IF FILE_RCBDRG2.CDBSCHG = 'M'                      11400000
                       THEN                                             11410000
                         DO;                                            11420000
                           CALL R022_WRITE_RCBDRGX;                     11430000
                           WRITING_RCBDRGX_FLAG = '1'B;/* RC01343 */    11440000
                         END;                                           11450000
                   END;                                                 11460000
                 OTHERWISE;                                             11470000
                 END;                                                   11480000
           END;                                                         11490000
       END;                                                             11500000
     END;                                                               11510000
                                                                        11520000
 END R031_UPD;                                                          11530000
1/********************************************************************/ 11540000
 /*                                                                  */ 11550000
 /* MODULE NAME      : R032_DEL                                      */ 11560000
 /*                                                                  */ 11570000
 /* DESCRIPTION      : PROCESS OBSOLETE RECORD                       */ 11580000
 /*                                                                  */ 11590000
 /********************************************************************/ 11600000
 R032_DEL: PROC;                                                        11610000
                                 /* INPUT TO OUTPUT                  */ 11620000
 IO_AREA_RCBDRG2 = IO_AREA_RCBDRG0;                                     11630000
                                                                        11640000
 IF OU_FOUND                                                            11650000
   THEN                                                                 11660000
     DO;                                                                11670000
                                 /* PROCESS SYSTEM ID'S              */ 11680000
       DO WRK_SYSTEM_ID = 1 TO 20;                                      11690000
         IF P10_ARRAY(WRK_SYSTEM_ID).EXTRACT_TYPE ¬= ' '                11700000
          & (P11_ARRAY.UPDATE_TYPE(OU_NR,WRK_SYSTEM_ID) = 'E'           11710000
           | P11_ARRAY.UPDATE_TYPE(OU_NR,WRK_SYSTEM_ID) = 'D')          11720000
         THEN                                                           11730000
           DO;                                                          11740000
             FILE_RCBDRG2.CDBSCHG = 'D';                                11750000
             CALL R022_WRITE_RCBDRGX;                                   11760000
           END;                                                         11770000
       END;                                                             11780000
     END;                                                               11790000
 END R032_DEL;                                                          11800000
1/********************************************************************/ 11810000
 /*                                                                  */ 11820000
 /* MODULE NAME      : R033_NO_CHANGE                                */ 11830000
 /*                                                                  */ 11840000
 /* DESCRIPTION      : PROCESS UNCHANGED RECORD                      */ 11850000
 /*                                                                  */ 11860000
 /********************************************************************/ 11870000
 R033_NO_CHANGE: PROC;                                                  11880000
 WRITING_RCBDRGX_FLAG = '0'B;                         /* CEDS00000706*/ 11881034
 /* SOC RB01254                                                         11890000
 /* WHEN OLD FULL IMAGE RECORD DOES NOT CHANGE:                      */ 11900000
 /* COPY 'OLD' LAST_PROCESSED_DATE TO NEW FULL IMAGE RECORD          */ 11910000
 NFI_AREA.LAST_PROCESSED_DATE = FILE_RCBDRG0.LAST_PROCESSED_DATE;       11920000
 /* EOC RB01254                                                      */ 11930000
 IO_AREA_RCBDRG2 = IO_AREA_RCBDRG0;                                     11940000
                                                                        11950000
 IF OU_FOUND                                                            11960000
   THEN                                                                 11970000
     DO;                                                                11980000
                                 /* PROCESS SYSTEM ID'S              */ 11990000
       DO WRK_SYSTEM_ID = 1 TO 20;                                      12000000
         IF P10_ARRAY(WRK_SYSTEM_ID).EXTRACT_TYPE ¬= ' '                12010000
           THEN                                                         12020000
             DO;                                                        12030000
               SELECT(P11_ARRAY.UPDATE_TYPE(OU_NR,WRK_SYSTEM_ID));      12040000
                 WHEN('F')                                              12050000
                   DO;                                                  12060000
                     FILE_RCBDRG2.CDBSCHG = 'M';                        12070000
                     FILE_RCBDRG2.FCUSNAM = '1';   /* START PTM456 */   12080000
                     FILE_RCBDRG2.FCUSSTR = '1';   /* FILL ALL THE */   12090000
                     FILE_RCBDRG2.FCUSCIT = '1';   /* CHANGE FLAGS */   12100000
                     FILE_RCBDRG2.FCUS3AD = '1';                        12110000
                     FILE_RCBDRG2.FCUSZIP = '1';                        12120000
                     FILE_RCBDRG2.FCUACOD = '1';                        12130000
                     FILE_RCBDRG2.FPTDSAD = '1';                        12140000
                     FILE_RCBDRG2.FDTEUEX = '1';                        12150000
                     FILE_RCBDRG2.FDTECUF = '1';                        12160000
                     FILE_RCBDRG2.FCUSCCC = '1';                        12170000
                     FILE_RCBDRG2.FCUSTOC = '1';                        12180000
                     FILE_RCBDRG2.FCUSHSI = '1';                        12190000
                     FILE_RCBDRG2.FCUSCLC = '1';                        12200000
                     FILE_RCBDRG2.SEDQEMB = '1';                        12210000
                     FILE_RCBDRG2.FAGRCLA = '1';   /* END PTM456 */     12220000
                     FILE_RCBDRG2.FSEDQMS = '1';   /* PTM 0684   */     12230000
                     CALL R022_WRITE_RCBDRGX;                           12240000
                   END;                                                 12250000
                 WHEN('E')                                              12260000
                   DO;                                                  12270000
                                              /* PTM1168 NO RE-DELETE*/ 12280000
                     IF FILE_RCBDRG0.CDBSCHG ¬= 'D'                     12290000
                     THEN DO;                                           12300000
                       FILE_RCBDRG2.CDBSCHG = 'D';                      12310000
                       CALL R022_WRITE_RCBDRGX;                         12320000
                     END;                                               12330000
                   END;                                                 12340000
                 WHEN('D')                                              12350000
                   DO;                                                  12360000
                   END;                                                 12370000
                 OTHERWISE;                                             12380000
               END;                                                     12390000
             END;                                                       12400000
       END;                                                             12410000
     END;                                                               12420000
                                                                        12430000
 END R033_NO_CHANGE;                                                    12440000
1/********************************************************************/ 12450000
 /*                                                                  */ 12460000
 /* MODULE NAME      : R034_INSERT                                   */ 12470000
 /*                                                                  */ 12480000
 /* DESCRIPTION      : PROCESS NEW RECORD                            */ 12490000
 /*                                                                  */ 12500000
 /********************************************************************/ 12510000
 R034_INSERT: PROC;                                                     12520000
                                                                        12530000
 WRITING_RCBDRGX_FLAG = '1'B;                         /* CEDS00000706*/ 12531034
 /* SOC RB01254                                                      */ 12540000
 NFI_AREA.LAST_PROCESSED_DATE = WRK_RUN_DATE;                           12550000
 /* EOC RB01254                                                      */ 12560000
                                 /* INPUT TO OUTPUT                  */ 12570000
 IO_AREA_RCBDRG2 = IO_AREA_RCBDRG1;                                     12580000
                                                                        12590000
 IF OU_FOUND                                                            12600000
   THEN                                                                 12610000
     DO;                                                                12620000
                                 /* PROCESS SYSTEM ID'S              */ 12630000
       DO WRK_SYSTEM_ID = 1 TO 20;                                      12640000
         IF P10_ARRAY(WRK_SYSTEM_ID).EXTRACT_TYPE ¬= ' '                12650000
          & (P11_ARRAY.UPDATE_TYPE(OU_NR,WRK_SYSTEM_ID) = 'F'           12660000
           | P11_ARRAY.UPDATE_TYPE(OU_NR,WRK_SYSTEM_ID) = 'D')          12670000
         THEN                                                           12680000
           DO;                                                          12690000
             FILE_RCBDRG2.CDBSCHG = 'M';                                12700000
             IF SWITCH_USER_EXIT = TRUE                                 12710000
               THEN                                                     12720000
                 DO;                                                    12730000
                                 /* CALL USER EXIT                   */ 12740000
                   USER_SWITCH_EXIT = SWITCH_USER_EXIT;                 12750000
                   CALL RCBDR5U (ADDR(USER_SWITCH_EXIT),                12760000
                                 ADDR(FILE_RCBDRG2),                    12770000
                                 ADDR(USER_EXIT.UDTEUEX),               12780000
                                 ADDR(USER_EXIT.UDTECUF),               12790000
                                 PTR_INT_AREA);                         12800000
                   SWITCH_USER_EXIT = USER_SWITCH_EXIT;                 12810000
                   IF SWITCH_USER_EXIT = TRUE                           12820000
                     THEN                                               12830000
                       DO;                                              12840000
                         FILE_RCBDRG2.UDTEUEX = USER_EXIT.UDTEUEX;      12850000
                         FILE_RCBDRG2.UDTECUF = USER_EXIT.UDTECUF;      12860000
                       END;                                             12870000
                 END;                                                   12880000
             FILE_RCBDRG2.FCUSNAM = '1';                                12890000
             FILE_RCBDRG2.FCUSSTR = '1';                                12900000
             FILE_RCBDRG2.FCUSCIT = '1';                                12910000
             FILE_RCBDRG2.FCUS3AD = '1';                                12920000
             FILE_RCBDRG2.FCUSZIP = '1';                                12930000
             FILE_RCBDRG2.FCUACOD = '1';                                12940000
             FILE_RCBDRG2.FPTDSAD = '1';                                12950000
             FILE_RCBDRG2.FDTEUEX = '1';                                12960000
             FILE_RCBDRG2.FDTECUF = '1';                                12970000
             FILE_RCBDRG2.FCUSCCC = '1';                                12980000
             FILE_RCBDRG2.FCUSTOC = '1';                                12990000
             FILE_RCBDRG2.FCUSHSI = '1';                                13000000
             FILE_RCBDRG2.FCUSCLC = '1';                                13010000
             FILE_RCBDRG2.SEDQEMB = '1';                                13020000
             FILE_RCBDRG2.FAGRCLA = '1';                                13030000
             FILE_RCBDRG2.FSEDQMS = '1';  /* PTM 0684  */               13040000
             CALL R022_WRITE_RCBDRGX;                                   13050000
           END;                                                         13060000
       END;                                                             13070000
     END;                                                               13080000
                                                                        13090000
 END R034_INSERT;                                                       13100000
1/********************************************************************/ 13110000
 /*                                                                  */ 13120000
 /* MODULE NAME      : R058_PROCESS_SK_2                             */ 13130000
 /*                                                                  */ 13140000
 /* DESCRIPTION      : DETERMINE SMALLEST SORT KEY AND PROCESS KEY   */ 13150000
 /*                                                                  */ 13160000
 /********************************************************************/ 13170000
 R058_PROCESS_SK_2: PROC;                                               13180000
                                 /* DETERMINE SMALLEST SORT KEY      */ 13190000
 IF STRING(SK0) < STRING(SK1)                                           13200000
   THEN                                                                 13210000
     DO;                                                                13220000
       SK_NEW = SK0;                                                    13230000
     END;                                                               13240000
   ELSE                                                                 13250000
     DO;                                                                13260000
       SK_NEW = SK1;                                                    13270000
     END;                                                               13280000
                                                                        13290000
   PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_NEW);          /* RC01141  */ 13300000
                                                                        13310000
 END R058_PROCESS_SK_2;                                                 13320000
1/********************************************************************/ 13330000
 /*                                                                  */ 13340000
 /* MODULE NAME      : R059_PROCESS_SK                               */ 13350000
 /*                                                                  */ 13360000
 /* DESCRIPTION      : DETERMINE SMALLEST SORT KEY AND PROCESS KEY   */ 13370000
 /*                                                                  */ 13380000
 /********************************************************************/ 13390000
 R059_PROCESS_SK: PROC;                                                 13400000
                                 /* DETERMINE SMALLEST SORT KEY      */ 13410000
 IF STRING(SK0) < STRING(SK1)                                           13420000
   THEN                                                                 13430000
     DO;                                                                13440000
       IF STRING(SK0) < STRING(SK2)                                     13450000
         THEN                                                           13460000
           DO;                                                          13470000
             SK_NEW = SK0;       /* SITUATION 3                      */ 13480000
           END;                                                         13490000
         ELSE                                                           13500000
           DO;                                                          13510000
             SK_NEW = SK2;       /* SITUATION 5                      */ 13520000
           END;                                                         13530000
     END;                                                               13540000
   ELSE                          /* I.E. SK1 <= SK0                  */ 13550000
     DO;                                                                13560000
       IF STRING(SK1) < STRING(SK2)                                     13570000
         THEN                                                           13580000
           DO;                                                          13590000
             SK_NEW = SK1;       /* SITUATION 6                      */ 13600000
           END;                                                         13610000
         ELSE                    /* I.E. SK1 <= SK0 & SK2 <= SK1     */ 13620000
           DO;                                                          13630000
             SK_NEW = SK2;       /* SITUATION 1/2/4                  */ 13640000
           END;                                                         13650000
     END;                                                               13660000
                                                                        13670000
   PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_NEW);          /* RC01141  */ 13680000
                                                                        13690000
 END R059_PROCESS_SK;                                                   13700000
1/********************************************************************/ 13710000
 /*                                                                  */ 13720000
 /* MODULE NAME      : R080_INIT_PROCESSING                          */ 13730000
 /*                                                                  */ 13740000
 /* DESCRIPTION      : OPEN AND INTITIAL FETCH CURSORS               */ 13750000
 /*                                                                  */ 13760000
 /********************************************************************/ 13770000
 R080_INIT_PROCESSING: PROC;                                            13780000
                                                                        13790000
                                 /************************************/ 13800000
                                 /* INIT SORT KEYS AND COUNT         */ 13810000
                                 /************************************/ 13820000
 SK_NEW             = '';                                               13830000
 SK_NEW.EOF         = '0';                                              13840000
 SK_OLD             = '';                                               13850000
 SK_OLD.EOF         = '0';                                              13860000
 SK0                = '';                                               13870000
 SK0.EOF            = '0';                                              13880000
 SK1                = '';                                               13890000
 SK1.EOF            = '0';                                              13900000
 SK2                = '';                                               13910000
 SK2.EOF            = '0';                                              13920000
 COUNT              = 0;                                                13930000
                                 /************************************/ 13940000
0                                /* INIT CURSOR CURSOR_1_V721        */ 13950000
                                 /************************************/ 13960000
 EXEC SQL                                                               13970000
   OPEN CURSOR_1_V721;                                                  13980000
                                                                        13990000
 SELECT (SQLCODE);                                                      14000000
   WHEN (0);                                                            14010000
   OTHERWISE                                                            14020000
     DO;                                                                14030000
       CALL R100_ERROR (ADDR (SQLCA),                                   14040000
                              'DB2',                                    14050000
                              '#005');                                  14060000
     END;                                                               14070000
 END;                                                                   14080000
                                 /************************************/ 14090000
                                 /* FILL FILE ARRAY                  */ 14100000
                                 /************************************/ 14110000
 RCBDRGX(01) = RCBDRGA;                                                 14120000
 RCBDRGX(02) = RCBDRGB;                                                 14130000
 RCBDRGX(03) = RCBDRGC;                                                 14140000
 RCBDRGX(04) = RCBDRGD;                                                 14150000
 RCBDRGX(05) = RCBDRGE;                                                 14160000
 RCBDRGX(06) = RCBDRGF;                                                 14170000
 RCBDRGX(07) = RCBDRGG;                                                 14180000
 RCBDRGX(08) = RCBDRGH;                                                 14190000
 RCBDRGX(09) = RCBDRGI;                                                 14200000
 RCBDRGX(10) = RCBDRGJ;                                                 14210000
 RCBDRGX(11) = RCBDRGK;                                                 14220000
 RCBDRGX(12) = RCBDRGL;                                                 14230000
 RCBDRGX(13) = RCBDRGN;                                                 14240000
 RCBDRGX(14) = RCBDRGO;                                                 14250000
 RCBDRGX(15) = RCBDRGP;                                                 14260000
 RCBDRGX(16) = RCBDRGQ;                                                 14270000
 RCBDRGX(17) = RCBDRGR;                                                 14280000
 RCBDRGX(18) = RCBDRGS;                                                 14290000
 RCBDRGX(19) = RCBDRGT;                                                 14300000
 RCBDRGX(20) = RCBDRGU;                                                 14310000
                                 /************************************/ 14320000
                                 /* FILL DEFAULT HEADER FOR 20 FILES */ 14330000
                                 /************************************/ 14340000
 IO_AREA_RCBDRGX         = '';   /* INIT IO AREA                     */ 14350000
 RCBDR0S0.KIND_OF_RECORD = 'H';                                         14360000
 RCBDR0S0.EXTRACT_DATE   = WRK_RUN_DATE;                                14370000
 RCBDR0S0.RUN_SEQ_NUMBER = WRK_RCB014.RUN_SEQ_NO;                       14380000
 RCBDR0S0.FILE_NAME      = 'RCCCUS';                                    14390000
 RCBDR0S0.FILE_DESCR     = 'CUSTOMER';                                  14400000
 RCBDR0S0.CTRYNO         = WRK_CTRYNO;                                  14410000
                                 /************************************/ 14420000
                                 /* GET EXTRACT CODES FOR SELECTED   */ 14430000
                                 /* SYSTEM ID'S AND INIT             */ 14440000
                                 /* CORRESPONDING FILES              */ 14450000
                                 /************************************/ 14460000
 P10_ARRAY                = '';  /* INIT SYSTEM ID TABLE             */ 14470000
 TB_RCBV500               = '';  /* INIT TABLESTRUCTURE              */ 14480000
 TB_RCBV500_I             = '';                                         14490000
 TB_RCB010.NUMBER         = 'RCB010';                                   14500000
 TB_RCBV500.PARAMETER_KEY = (20)'_';                                    14510000
 TB_RCB010.CTRYNO         = WRK_CTRYNO;                                 14520000
 TB_RCB010.PGR_TYPE       = WRK_PGR_TYPE;                               14530000
                                                                        14540000
 CALL R081_OPEN_CURSOR_1_V500 ;  /* OPEN CURSOR 2 (AFTER INIT KEYS)  */ 14550000
 CALL R013_FETCH_CURSOR_1_V500;  /* FETCH FIRST RCB010 PARAMETER     */ 14560000
 DO WHILE (SQLCODE_FETCH = 0);   /* WHILE ROW FOUND                  */ 14570000
   IF TB_RCB010.SYSTEM_ID >= 1   /* SYSTEM ID WITHIN LIMITS          */ 14580000
    & TB_RCB010.SYSTEM_ID <= 20                                         14590000
   THEN                                                                 14600000
     DO;                         /* OPEN FILE AND CREATE HEADER      */ 14610000
       OPEN FILE (RCBDRGX(TB_RCB010.SYSTEM_ID));                        14620000
       WRK_SYSTEM_ID_PIC4       = TB_RCB010.SYSTEM_ID;                  14630000
       RCBDR0S0.KIND_OF_EXTRACT = TB_RCB010.EXTRACT_TYPE;               14640000
       P10_ARRAY(TB_RCB010.SYSTEM_ID).EXTRACT_TYPE                      14650000
                                = TB_RCB010.EXTRACT_TYPE;               14660000
       CALL RCBDR0M (PTR_INT_AREA,                                      14670000
                     ADDR(RCBDR0S0),                                    14680000
                     ADDR(FILE_RCBDRGX_H.DATA));                        14690000
       WRITE FILE (RCBDRGX(TB_RCB010.SYSTEM_ID)) FROM                   14700000
                    (IO_AREA_RCBDRGX);                                  14710000
     END;                                                               14720000
   ELSE                                                                 14730000
     DO;                         /* SYSTEM ID INVALID                */ 14740000
       PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                   14750000
       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0142';                 14760000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                     14770000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                   14780000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                         14790000
                             TB_RCBV500.PARAMETER_NUMBER;               14800000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'PK';                   14810000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                         14820000
                             TB_RCBV500.PARAMETER_KEY;                  14830000
       CALL RCB0M1M (PTR_INT_AREA);                                     14840000
       CALL R100_ERROR (NULL(),                                         14850000
                        'OTHER',                                        14860000
                        '#006');                                        14870000
     END;                                                               14880000
   CALL R013_FETCH_CURSOR_1_V500;/* FETCH NEXT RCB010 PARAMETER      */ 14890000
   END;                                                                 14900000
 CALL R088_CLOSE_CURSOR_1_V500;  /* CLOSE CURSOR                     */ 14910000
                                                                        14920000
                                 /* FILL OU STRUCTURE TABLE          */ 14930000
 PTR_RCBDR1S = ADDR(RCBDR1S0);                                          14940000
 RCBDR1S0.CTRYNO        = WRK_CTRYNO;                                   14950000
 RCBDR1S0.PGR_TYPE      = WRK_PGR_TYPE;                                 14960000
 RCBDR1S0.EXTRACT_DATE  = WRK_RUN_DATE;                                 14970000
                                                                        14980000
 CALL RCBDR1M(PTR_INT_AREA,                                             14990000
              PTR_RCBDR1S,                                              15000000
              ADDR(P11_ARRAY));                                         15010000
 DO WRK_SYSTEM_ID = 1 TO 20;                                            15020000
 END;                                                                   15030000
                                 /* GENERATE OU PARAMETER REPORT     */ 15040000
                                 /* IF ASKED FOR                     */ 15050000
 IF WRK_OU_PARM_REP = 'Y'                                               15060000
   THEN                                                                 15070000
     DO;                                                                15080000
       PTR_RCBDR2S               = ADDR(RCBDR2S0);                      15090000
       RCBDR2S0.CTRYNO           = WRK_CTRYNO;                          15100000
       RCBDR2S0.PGR_TYPE         = WRK_PGR_TYPE;                        15110000
       RCBDR2S0.EXTRACT_DATE     = RCBDR0S0.EXTRACT_DATE;               15120000
       CALL RCBDR2M(PTR_INT_AREA,                                       15130000
                    PTR_RCBDR2S,                                        15140000
                    ADDR(P11_ARRAY));                                   15150000
     END;                                                               15160000
                                                                        15170000
                                 /************************************/ 15180000
                                 /* DETERMINE TIMESTAMP              */ 15190000
                                 /* FOR HEADER + HASH                */ 15200000
                                 /* AND PARAMETER LENGTH             */ 15210000
                                 /************************************/ 15220000
 WRK_TIME_STAMP  = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();          15230000
 WRK_LENGTH_PARM = CSTG (TB_RCB024.TIME_STAMP) +                        15240000
                   CSTG (TB_RCB024.HASH_TOTAL);                         15250000
                                                                        15260000
                                 /************************************/ 15270000
                                 /* OPEN OTHER FILES                 */ 15280000
                                 /************************************/ 15290000
 OPEN FILE (RCBDRG0);                                                   15300000
 OPEN FILE (RCBDRG1);                                                   15310000
 OPEN FILE (RCBDRG2);                                                   15320000
                                 /************************************/ 15330000
                                 /* READ HEADER RECORD OLD FULL IMAGE*/ 15340000
                                 /************************************/ 15350000
 CALL R010_READ0;                                                       15360000
 IF SK0.EOF = '1'                /* EMPTY FILE                       */ 15370000
   THEN                                                                 15380000
     DO;                                                                15390000
       PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                            15400000
       PARM_INT_AREA.MESSAGE_NUMBER  = '0013';                          15410000
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              15420000
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                            15430000
       PARM_INT_AREA.MSG_VAR_VALUE_6 = 'RCBDRG0';                       15440000
       CALL RCB0M1M (PTR_INT_AREA);                                     15450000
       CALL R100_ERROR (NULL(), 'OTHER', '#007');                       15460000
     END;                                                               15470000
                                 /************************************/ 15480000
                                 /* CHECK HEADER RECORD OLD F.I.     */ 15490000
                                 /************************************/ 15500000
 IF FILE_RCBDRG0_H.PROCESS_NAME   ¬= 'RCMS CU'                          15510000
  | FILE_RCBDRG0_H.FILE_TYPE      ¬= 'FULL IMAGE'                       15520000
  | FILE_RCBDRG0_H.COUNTRY_NUMBER ¬= WRK_CTRYNO                         15530000
 THEN                                                                   15540000
   DO;                                                                  15550000
     PARM_INT_AREA.MESSAGE_TYPE                    = 'IS';              15560000
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER         = '0014';            15570000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES          = '';                15580000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6         = 'FL';              15590000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6        = 'RCBDRG0';         15600000
     CALL RCB0M1M (PTR_INT_AREA);                                       15610000
     CALL R100_ERROR (NULL(),                                           15620000
                      'OTHER',                                          15630000
                      '#008');                                          15640000
   END;                                                                 15650000
                                                                        15660000
0                                /* RETRIEVE PARAMETER RCB024        */ 15670000
 TB_RCBV500            = '';     /* INIT TABLESTRUCTURE              */ 15680000
 TB_RCBV500_I          = '';                                            15690000
 TB_RCB024.NUMBER      = 'RCB024';                                      15700000
 TB_RCB024.PROC_ID     = WRK_PROC_ID;                                   15710000
 TB_RCB024.CTRYNO      = WRK_CTRYNO;                                    15720000
 TB_RCB024.FILE_NAME   = WRK_RCBDRG2;                                   15730000
 TB_RCB024.SEQ_NUMBER = '  ';                                           15740000
                                 /* INPUT FILE TIMESTAMP + HASH TOTAL*/ 15750000
0CALL RCBI50M ('R',                                       /* RC01219 */ 15760000
               ADDR (TB_RCBV500),                                       15770000
               ADDR (TB_RCBV500_I),                                     15780000
               PTR_RETURN_AREA_BB,                                      15790000
               PTR_INT_AREA);                                           15800000
0SELECT(RETURN_AREA_BB.RETURN_CODE);                                    15810000
   WHEN (0)                                                             15820000
     DO;                                                                15830000
       IF TB_RCB024.TIME_STAMP ¬= FILE_RCBDRG0_H.TIME_STAMP             15840000
         THEN                                                           15850000
           DO;                                                          15860000
             PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                      15870000
             PARM_INT_AREA.MESSAGE_NUMBER  = '0174';                    15880000
             PARM_INT_AREA.MSG_VAR_CODES   = '';                        15890000
             PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                      15900000
             PARM_INT_AREA.MSG_VAR_VALUE_6 = 'RCBDRG0';                 15910000
             PARM_INT_AREA.MSG_VAR_CODE_7  = 'TS';                      15920000
             PARM_INT_AREA.MSG_VAR_VALUE_7 = FILE_RCBDRG0_H.TIME_STAMP; 15930000
             PARM_INT_AREA.MSG_VAR_CODE_8  = 'PM';                      15940000
             PARM_INT_AREA.MSG_VAR_VALUE_8 = 'RCBDRG0';                 15950000
             PARM_INT_AREA.MSG_VAR_CODE_9  = 'TS';                      15960000
             PARM_INT_AREA.MSG_VAR_VALUE_9 = TB_RCB024.TIME_STAMP;      15970000
             CALL RCB0M1M (PTR_INT_AREA);                               15980000
             CALL R100_ERROR (NULL(), 'OTHER', '#009');                 15990000
           END;                                                         16000000
         ELSE                                                           16010000
           DO;                                                          16020000
             WRK_HASH_RCBDRG0 = TB_RCB024.HASH_TOTAL;                   16030000
           END;                                                         16040000
     END;                                                               16050000
   OTHERWISE                                                            16060000
     DO;                                                                16070000
       CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),               16080000
                              'DB2',                                    16090000
                              '#010');                                  16100000
     END;                                                               16110000
 END;                                                                   16120000
                                 /************************************/ 16130000
                                 /* SET HEADER RECORD NEW FULL IMAGE*/  16140000
                                 /************************************/ 16150000
 FILE_RCBDRG2   = '';                                                   16160000
 FILE_RCBDRG2_H = '';                                                   16170000
 FILE_RCBDRG2_H.KEY            = ' ';                                   16180000
 FILE_RCBDRG2_H.PROCESS_NAME   = 'RCMS CU';                             16190000
 FILE_RCBDRG2_H.FILE_TYPE      = 'FULL IMAGE';                          16200000
 FILE_RCBDRG2_H.COUNTRY_NUMBER = WRK_CTRYNO;                            16210000
 FILE_RCBDRG2_H.RUN_DATE       = WRK_RUN_DATE;                          16220000
 FILE_RCBDRG2_H.TIME_STAMP     = WRK_TIME_STAMP;                        16230000
                                                                        16240000
 /* SOC RB01254 */                                                      16250000
 NFI_AREA = FILE_RCBDRG2, BY NAME;                                      16260000
 WRITE FILE(RCBDRG2) FROM (NFI_AREA);                                   16270000
 NFI_AREA.LAST_PROCESSED_DATE = '';                                     16280000
 /* WRITE FILE(RCBDRG2) FROM (IO_AREA_RCBDRG2);                         16290000
 /* EOC RB01254 */                                                      16300000
                                 /************************************/ 16310000
                                 /* READ HEADER RECORD DELTA EXTRACT */ 16320000
                                 /************************************/ 16330000
 CALL R011_READ1;                                                       16340000
 IF SK1.EOF = '1'                /* EMPTY FILE                       */ 16350000
   THEN                                                                 16360000
     DO;                                                                16370000
       PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                            16380000
       PARM_INT_AREA.MESSAGE_NUMBER  = '0013';                          16390000
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              16400000
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                            16410000
       PARM_INT_AREA.MSG_VAR_VALUE_6 = 'RCBDRG1';                       16420000
       CALL RCB0M1M (PTR_INT_AREA);                                     16430000
       CALL R100_ERROR (NULL(), 'OTHER', '#011');                       16440000
     END;                                                               16450000
                                 /************************************/ 16460000
                                 /* CHECK HEADER RECORD DELTA EXTRACT*/ 16470000
                                 /************************************/ 16480000
 IF FILE_RCBDRG1_H.PROCESS_NAME   ¬= 'RCMS CU'                          16490000
  | FILE_RCBDRG1_H.FILE_TYPE      ¬= 'DELTA EXTR'                       16500000
  | FILE_RCBDRG1_H.COUNTRY_NUMBER ¬= WRK_CTRYNO                         16510000
 THEN                                                                   16520000
   DO;                                                                  16530000
     PARM_INT_AREA.MESSAGE_TYPE                    = 'IS';              16540000
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER         = '0014';            16550000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES          = '';                16560000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6         = 'FL';              16570000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6        = 'RCBDRG1';         16580000
     CALL RCB0M1M (PTR_INT_AREA);                                       16590000
     CALL R100_ERROR (NULL(),                                           16600000
                      'OTHER',                                          16610000
                      '#012');                                          16620000
   END;                                                                 16630000
                                                                        16640000
0                                /* RETRIEVE PARAMETER RCB024        */ 16650000
 TB_RCBV500            = '';     /* INIT TABLESTRUCTURE              */ 16660000
 TB_RCBV500_I          = '';                                            16670000
 TB_RCB024.NUMBER      = 'RCB024';                                      16680000
 TB_RCB024.PROC_ID     = WRK_PROC_ID;                                   16690000
 TB_RCB024.CTRYNO      = WRK_CTRYNO;                                    16700000
 TB_RCB024.FILE_NAME   = WRK_RCBDRF1;                                   16710000
 TB_RCB024.SEQ_NUMBER = '  ';                                           16720000
                                 /* INPUT FILE TIMESTAMP + HASH TOTAL*/ 16730000
0CALL RCBI50M ('U',                                       /* RC01219 */ 16740000
               ADDR (TB_RCBV500),                                       16750000
               ADDR (TB_RCBV500_I),                                     16760000
               PTR_RETURN_AREA_BB,                                      16770000
               PTR_INT_AREA);                                           16780000
0SELECT(RETURN_AREA_BB.RETURN_CODE);                                    16790000
   WHEN (0)                                                             16800000
     DO;                                                                16810000
       IF TB_RCB024.TIME_STAMP ¬= FILE_RCBDRG1_H.TIME_STAMP             16820000
         THEN                                                           16830000
           DO;                                                          16840000
             PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                      16850000
             PARM_INT_AREA.MESSAGE_NUMBER  = '0174';                    16860000
             PARM_INT_AREA.MSG_VAR_CODES   = '';                        16870000
             PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                      16880000
             PARM_INT_AREA.MSG_VAR_VALUE_6 = 'RCBDRG1';                 16890000
             PARM_INT_AREA.MSG_VAR_CODE_7  = 'TS';                      16900000
             PARM_INT_AREA.MSG_VAR_VALUE_7 = TB_RCB024.TIME_STAMP;      16910000
             PARM_INT_AREA.MSG_VAR_CODE_8  = 'TS';                      16920000
             PARM_INT_AREA.MSG_VAR_VALUE_8 = FILE_RCBDRG1_H.TIME_STAMP; 16930000
             CALL RCB0M1M (PTR_INT_AREA);                               16940000
             CALL R100_ERROR (NULL(), 'OTHER', '#013');                 16950000
           END;                                                         16960000
         ELSE                                                           16970000
           DO;                                                          16980000
             WRK_HASH_RCBDRG1 = TB_RCB024.HASH_TOTAL;                   16990000
           END;                                                         17000000
     END;                                                               17010000
   OTHERWISE                                                            17020000
     DO;                                                                17030000
       CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),               17040000
                              'DB2',                                    17050000
                              '#014');                                  17060000
     END;                                                               17070000
 END;                                                                   17080000
                                 /************************************/ 17090000
                                 /* READ NEXT RECORD OLD F.I.& DELTA */ 17100000
                                 /************************************/ 17110000
 CALL R010_READ0;                                                       17120000
 CALL R011_READ1;                                                       17130000
                                 /************************************/ 17140000
                                 /* READ FIRST RECORD IN TEMP. TABLE */ 17150000
                                 /************************************/ 17160000
 CALL R012_FETCH_CURSOR_1_V721;                                         17170000
                                 /************************************/ 17180000
                                 /* DETERMINE SMALLEST SORT KEY      */ 17190000
                                 /************************************/ 17200000
 CALL R059_PROCESS_SK;                                                  17210000
 END R080_INIT_PROCESSING;                                              17220000
1/********************************************************************/ 17230000
 /*                                                                  */ 17240000
 /* MODULE NAME      : R081_OPEN_CURSOR_1_V500                       */ 17250000
 /*                                                                  */ 17260000
 /* DESCRIPTION      : OPEN CURSOR_1_V500                            */ 17270000
 /*                                                                  */ 17280000
 /********************************************************************/ 17290000
 R081_OPEN_CURSOR_1_V500: PROC;                                         17300000
                                 /************************************/ 17310000
                                 /* INIT CURSOR CURSOR_1_V500        */ 17320000
                                 /************************************/ 17330000
 EXEC SQL                                                               17340000
   OPEN CURSOR_1_V500;                                                  17350000
                                                                        17360000
 SELECT (SQLCODE);                                                      17370000
   WHEN (0);                                                            17380000
   OTHERWISE                                                            17390000
     DO;                                                                17400000
       CALL R100_ERROR (ADDR (SQLCA),                                   17410000
                              'DB2',                                    17420000
                              '#015');                                  17430000
     END;                                                               17440000
 END;                                                                   17450000
 END R081_OPEN_CURSOR_1_V500;                                           17460000
1/********************************************************************/ 17470000
 /*                                                                  */ 17480000
 /* MODULE NAME      : R088_CLOSE_CURSOR_1_V500                      */ 17490000
 /*                                                                  */ 17500000
 /* DESCRIPTION      : CLOSE CURSOR_1_V500                           */ 17510000
 /*                                                                  */ 17520000
 /********************************************************************/ 17530000
 R088_CLOSE_CURSOR_1_V500: PROC;                                        17540000
                                 /************************************/ 17550000
                                 /* CLOSE CURSOR CURSOR_1_V500       */ 17560000
                                 /************************************/ 17570000
 EXEC SQL                                                               17580000
   CLOSE CURSOR_1_V500;                                                 17590000
                                                                        17600000
 SELECT (SQLCODE);                                                      17610000
   WHEN (0);                                                            17620000
   OTHERWISE                                                            17630000
     DO;                                                                17640000
       CALL R100_ERROR (ADDR (SQLCA),                                   17650000
                              'DB2',                                    17660000
                              '#016');                                  17670000
     END;                                                               17680000
 END;                                                                   17690000
 END R088_CLOSE_CURSOR_1_V500;                                          17700000
1/********************************************************************/ 17710000
 /*                                                                  */ 17720000
 /* MODULE NAME      : R089_END_PROCESSING                           */ 17730000
 /*                                                                  */ 17740000
 /* DESCRIPTION      : CLOSE CURSOR                                  */ 17750000
 /*                                                                  */ 17760000
 /********************************************************************/ 17770000
 R089_END_PROCESSING: PROC;                                             17780000
                                 /************************************/ 17790000
                                 /* CLOSE CURSOR CURSOR_1_V721       */ 17800000
                                 /************************************/ 17810000
 EXEC SQL                                                               17820000
   CLOSE CURSOR_1_V721;                                                 17830000
                                                                        17840000
 SELECT (SQLCODE);                                                      17850000
   WHEN (0);                                                            17860000
   OTHERWISE                                                            17870000
     DO;                                                                17880000
       CALL R100_ERROR (ADDR (SQLCA),                                   17890000
                              'DB2',                                    17900000
                              '#017');                                  17910000
     END;                                                               17920000
 END;                                                                   17930000
                                 /************************************/ 17940000
                                 /* FULL IMAGE:                      */ 17950000
                                 /* SAVE HASH TOTAL AND              */ 17960000
                                 /* TIMESTAMP IN PARAMETER RCB024    */ 17970000
                                 /************************************/ 17980000
 TB_RCBV500   = '';                                                     17990000
 TB_RCBV500_I = '';                                                     18000000
 TB_RCB024.NUMBER      = 'RCB024';                                      18010000
 TB_RCB024.PROC_ID     = WRK_PROC_ID;                                   18020000
 TB_RCB024.CTRYNO      = WRK_CTRYNO;                                    18030000
 TB_RCB024.FILE_NAME   = WRK_RCBDRG2;                                   18040000
 TB_RCB024.SEQ_NUMBER  = '  ';                                          18050000
 TB_RCB024.LENGTH_PARM = WRK_LENGTH_PARM;                               18060000
 TB_RCB024.TIME_STAMP  = WRK_TIME_STAMP;                                18070000
 TB_RCB024.HASH_TOTAL  = COUNT.RCBDRG2_HASH;                            18080000
0CALL RCBG50M (ADDR (TB_RCBV500),                                       18090000
               ADDR (TB_RCBV500_I),                                     18100000
               PTR_RETURN_AREA_BB,                                      18110000
               PTR_INT_AREA);                                           18120000
                                                                        18130000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18140000
   WHEN (0)                                                             18150000
     DO;                                                                18160000
     END;                                                               18170000
   WHEN (4)                        /* WHEN NOT FOUND THEN INSERT  */    18180000
     DO;                                                                18190000
       CALL RCBF50M (ADDR(TB_RCBV500),                                  18200000
                     ADDR(TB_RCBV500_I),                                18210000
                     PTR_RETURN_AREA_BB,                                18220000
                     PTR_INT_AREA);                                     18230000
       SELECT(RETURN_AREA_BB.RETURN_CODE);                              18240000
         WHEN (0);                                                      18250000
         OTHERWISE                                                      18260000
           DO;                                                          18270000
             CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),         18280000
                              'DB2',                                    18290000
                              '#018');                                  18300000
           END;                                                         18310000
       END;                                                             18320000
     END;                                                               18330000
   OTHERWISE                                                            18340000
     DO;                                                                18350000
        CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              18360000
                               'DB2',                                   18370000
                               '#019');                                 18380000
     END;                                                               18390000
 END;                                                                   18400000
                                 /************************************/ 18410000
                                 /* SAVE PARAMETER RCB037            */ 18420000
                                 /* TO INDICATE END OF RCMS CU EXTR. */ 18430000
                                 /************************************/ 18440000
 TB_RCBV500   = '';                                                     18450000
 TB_RCBV500_I = '';                                                     18460000
 TB_RCB037.NUMBER         = 'RCB037';                                   18470000
 TB_RCB037.PROC_ID        = WRK_PROC_ID;                                18480000
 TB_RCB037.CTRYNO         = WRK_CTRYNO;                                 18490000
 TB_RCB037.LENGTH_PARM    = CSTG (TB_RCB037.LAST_EXTR_DATE);            18500000
 TB_RCB037.LAST_EXTR_DATE = WRK_RUN_DATE;                               18510000
0CALL RCBG50M (ADDR (TB_RCBV500),                                       18520000
               ADDR (TB_RCBV500_I),                                     18530000
               PTR_RETURN_AREA_BB,                                      18540000
               PTR_INT_AREA);                                           18550000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18560000
   WHEN (0)                                                             18570000
     DO;                                                                18580000
     END;                                                               18590000
   OTHERWISE                                                            18600000
     DO;                                                                18610000
        CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              18620000
                               'DB2',                                   18630000
                               '#020');                                 18640000
     END;                                                               18650000
 END;                                                                   18660000
 END R089_END_PROCESSING;                                               18670000
1/********************************************************************/ 18680000
 /*                                                                  */ 18690000
 /* MODULE NAME      : R090_INIT_PROG                                */ 18700000
 /*                                                                  */ 18710000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 18720000
 /*                                                                  */ 18730000
 /********************************************************************/ 18740000
 R090_INIT_PROG: PROC;                                                  18750000
                                 /************************************/ 18760000
                                 /* INITIALIZE POINTERS              */ 18770000
                                 /************************************/ 18780000
 PTR_INT_AREA       =  ADDR (PARM_INT_AREA);                            18790000
 PTR_RETURN_AREA_BB =  ADDR (RETURN_AREA_BB);                           18800000
 PTR_COUNTRY_AREA   =  ADDR (COUNTRY_AREA);                             18810000
 PTR_RUN_DATE_AREA  =  ADDR (RUN_DATE_AREA);                            18820000
                                 /************************************/ 18830000
                                 /* INITIALIZE VARIABLES             */ 18840000
                                 /************************************/ 18850000
 PARM_INT_AREA.MSG_AREA = '';                                           18860000
 PARM_INT_AREA.ERR_AREA = '';                                           18870000
                                                                        18880000
 PARM_INT_AREA.MSG_REQUEST     = 'O';                                   18890000
 PARM_INT_AREA.MSG_TARGET      = 'F';                                   18900000
                                                                        18910000
 PARM_INT_AREA.ID_SOURCE_APPL  = 'RCB';                                 18920000
 PARM_INT_AREA.ID_SOURCE_PROG  = WRK_PGM_NAME;                          18930000
 PARM_INT_AREA.ID_MOD_PATH (1) = WRK_MOD_NAME;                          18940000
 PARM_INT_AREA.ID_MOD_LEVEL    = 1;                                     18950000
 PARM_INT_AREA.PTR_PCB_IO      = NULL;                                  18960000
 PARM_INT_AREA.PTR_PCB_ALT     = NULL;                                  18970000
 PARM_INT_AREA.SYSTEM_TYPE     = 'B';                                   18980000
                                 /************************************/ 18990000
                                 /* OPEN MESSAGE FILE                */ 19000000
                                 /************************************/ 19010000
 CALL RCB0M1M (PTR_INT_AREA);                                           19020000
                                 /************************************/ 19030000
                                 /* RETRIEVE SYSTEM DATE             */ 19040000
                                 /************************************/ 19050000
 CALL RCB0T1M (PTR_INT_AREA);                                           19060000
                                 /************************************/ 19070000
                                 /* RETRIEVE COUNTRY NUMBERS         */ 19080000
                                 /************************************/ 19090000
 CALL RCB019M (PTR_COUNTRY_AREA,                                        19100000
                   PTR_INT_AREA);                                       19110000
                                                                        19120000
 SELECT;                         /* ONLY ONE COUNTRY                 */ 19130000
   WHEN(COUNTRY_AREA.COUNT_CTRY = 0)                                    19140000
     DO;                                                                19150000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            19160000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            19170000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          19180000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                        19190000
       CALL RCB0M1M (PTR_INT_AREA);                                     19200000
       CALL R100_ERROR (NULL, 'OTHER', '#021');                         19210000
     END;                                                               19220000
   WHEN(COUNTRY_AREA.COUNT_CTRY > 1)                                    19230000
     DO;                                                                19240000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            19250000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            19260000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          19270000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0189';                        19280000
       CALL RCB0M1M (PTR_INT_AREA);                                     19290000
       CALL R100_ERROR (NULL, 'OTHER', '#022');                         19300000
     END;                                                               19310000
   OTHERWISE                                                            19320000
     DO;                                                                19330000
       WRK_PROC_ID  = COUNTRY_AREA.PROC_ID;                             19340000
       WRK_CTRYNO   = COUNTRY_AREA.CTRY_ARRAY(1).CTRYNO;                19350000
       WRK_PGR_TYPE = COUNTRY_AREA.CTRY_ARRAY(1).PGR_TYPE;              19360000
     END;                                                               19370000
 END;                                                                   19380000
                                                                        19390000
 CALL R020_LOCK_TABLES;                                   /* RC01219 */ 19400000
                                                                        19410000
                                 /************************************/ 19420000
                                 /* RETRIEVE RUN DATE                */ 19430000
                                 /************************************/ 19440000
 RUN_DATE_AREA.PROC_ID   =  WRK_PROC_ID;                                19450000
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 19460000
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               19470000
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       19480000
                    PTR_INT_AREA);                                      19490000
                                                                        19500000
 IF RUN_DATE_AREA.RUN_DATE = ''  /* NO RUN DATE RCB001 FOUND         */ 19510000
   THEN                                                                 19520000
     DO;                                                                19530000
       WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                        19540000
     END;                                                               19550000
   ELSE                                                                 19560000
     DO;                                                                19570000
       WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                           19580000
     END;                                                               19590000
                                 /* WRITE MESSAGE WITH RUN DATE      */ 19600000
 PARM_INT_AREA.COUNTRY_NUMBER  = WRK_CTRYNO;                            19610000
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  19620000
 PARM_INT_AREA.MESSAGE_NUMBER  = '0002';                                19630000
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    19640000
 PARM_INT_AREA.MSG_VAR_CODE_6  = 'DT';                                  19650000
 PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_RUN_DATE;                          19660000
 CALL RCB0M1M (PTR_INT_AREA);                                           19670000
                                 /************************************/ 19680000
                                 /* CHECK HORIZON DATE               */ 19690000
                                 /************************************/ 19700000
 CALL RCB022M (ADDR(WRK_CTRYNO),                          /* PTM1038 */ 19710000
               ADDR(WRK_RUN_DATE),                                      19720000
               ADDR(WRK_HORIZON_DATE),                                  19730000
               PTR_INT_AREA);                                           19740000
 IF WRK_HORIZON_DATE ¬= ''       /* HORIZON DATE > RUN DATE          */ 19750000
 THEN                                                                   19760000
   DO;                                                                  19770000
      PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                             19780000
      PARM_INT_AREA.MESSAGE_NUMBER  = '0168';                           19790000
      PARM_INT_AREA.MSG_VAR_CODES   = '';                               19800000
      PARM_INT_AREA.MSG_VAR_CODE_6  = 'D1';                             19810000
      PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_RUN_DATE;                     19820000
      PARM_INT_AREA.MSG_VAR_CODE_7  = 'D2';                             19830000
      PARM_INT_AREA.MSG_VAR_VALUE_7 = WRK_HORIZON_DATE;                 19840000
      CALL RCB0M1M (PTR_INT_AREA);                                      19850000
      CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),                19860000
                         'DB2',                                         19870000
                         '#023');                                       19880000
   END;                                                                 19890000
  /* SOC RB01254 */                                                     19900000
                                /************************************/  19910000
                                /* INITIALIZE NEW FULL IMAGE AREA   */  19920000
                                /************************************/  19930000
  NFI_AREA = '';                                                        19940000
  /* EOC RB01254*/                                                      19950000
                                 /************************************/ 19960000
                                 /* RETRIEVE PARAMETER RCB014        */ 19970000
                                 /************************************/ 19980000
 TB_RCBV500          = '';                                              19990000
 TB_RCBV500_I        = '';                                              20000000
 TB_RCB014.NUMBER   = 'RCB014';                                         20010000
 TB_RCB014.PROC_ID  = WRK_PROC_ID;                                      20020000
 TB_RCB014.CTRYNO   = WRK_CTRYNO;                                       20030000
                                                                        20040000
0CALL RCBI50M ('R',                                       /* RC01219 */ 20050000
               ADDR (TB_RCBV500),                                       20060000
               ADDR (TB_RCBV500_I),                                     20070000
               PTR_RETURN_AREA_BB,                                      20080000
               PTR_INT_AREA);                                           20090000
                                                                        20100000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20110000
   WHEN (0)                                                             20120000
     DO;                                                                20130000
       WRK_RCB014 = TB_RCB014, BY NAME;                                 20140000
     END;                                                               20150000
   WHEN (4)                                                             20160000
     DO;                                                                20170000
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                20180000
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              20190000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 20200000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                20210000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      20220000
                                       TB_RCBV500.PARAMETER_NUMBER;     20230000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                20240000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      20250000
                                       TB_RCBV500.PARAMETER_KEY;        20260000
        CALL RCB0M1M (PTR_INT_AREA);                                    20270000
        CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              20280000
                               'OTHER',                                 20290000
                               '#024');                                 20300000
     END;                                                               20310000
   OTHERWISE                                                            20320000
     DO;                                                                20330000
        CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              20340000
                               'DB2',                                   20350000
                               '#025');                                 20360000
     END;                                                               20370000
 END;                                                                   20380000
                                 /************************************/ 20390000
                                 /* RETRIEVE PARAMETER RCB016        */ 20400000
                                 /************************************/ 20410000
 TB_RCBV500          = '';                                              20420000
 TB_RCBV500_I        = '';                                              20430000
 TB_RCB016.NUMBER   = 'RCB016';                                         20440000
 TB_RCB016.PROC_ID  = WRK_PROC_ID;                                      20450000
 TB_RCB016.CTRYNO   = WRK_CTRYNO;                                       20460000
 TB_RCB016.PGR_TYPE = WRK_PGR_TYPE;                                     20470000
                                                                        20480000
0CALL RCBI50M ('U',                                       /* RC01219 */ 20490000
               ADDR (TB_RCBV500),                                       20500000
               ADDR (TB_RCBV500_I),                                     20510000
               PTR_RETURN_AREA_BB,                                      20520000
               PTR_INT_AREA);                                           20530000
                                                                        20540000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20550000
   WHEN (0)                                                             20560000
     DO;                                                                20570000
       WRK_OU_PARM_REP = TB_RCB016.OU_PARM_REP;                         20580000
     END;                                                               20590000
   WHEN (4)                                                             20600000
     DO;                                                                20610000
                                 /* DEFAULT TO Y                     */ 20620000
       WRK_OU_PARM_REP = 'Y';                                           20630000
     END;                                                               20640000
   OTHERWISE                                                            20650000
     DO;                                                                20660000
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                20670000
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              20680000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 20690000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                20700000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      20710000
                                       TB_RCBV500.PARAMETER_NUMBER;     20720000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                20730000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      20740000
                                       TB_RCBV500.PARAMETER_KEY;        20750000
        CALL RCB0M1M (PTR_INT_AREA);                                    20760000
        CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              20770000
                               'DB2',                                   20780000
                               '#026');                                 20790000
     END;                                                               20800000
 END;                                                                   20810000
                                                                        20820000
 END R090_INIT_PROG;                                                    20830000
1/********************************************************************/ 20840000
 /*                                                                  */ 20850000
 /* MODULE NAME      : R099_TERM                                     */ 20860000
 /*                                                                  */ 20870000
 /* DESCRIPTION      : TERMINATE PROGRAM                             */ 20880000
 /*                                                                  */ 20890000
 /********************************************************************/ 20900000
 R099_TERM: PROC;                                                       20910000
                                 /************************************/ 20920000
                                 /* CHECK HASH TOTALS OLD FULL IMAGE */ 20930000
                                 /************************************/ 20940000
 IF WRK_HASH_RCBDRG0 ¬= COUNT.RCBDRG0_HASH                              20950000
   THEN                                                                 20960000
     DO;                                                                20970000
       PARM_INT_AREA.COUNTRY_NUMBER  = '   ';                           20980000
       PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                            20990000
       PARM_INT_AREA.MESSAGE_NUMBER  = '0175';                          21000000
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              21010000
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                            21020000
       PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_RCBDRG0;                     21030000
       PARM_INT_AREA.MSG_VAR_CODE_7  = 'HT';                            21040000
       CNT_PIC15                     = COUNT.RCBDRG0_HASH;              21050000
       PARM_INT_AREA.MSG_VAR_VALUE_7 = CNT_PIC15;                       21060000
       PARM_INT_AREA.MSG_VAR_CODE_8  = 'HT';                            21070000
       CNT_PIC15                     = WRK_HASH_RCBDRG0;                21080000
       PARM_INT_AREA.MSG_VAR_VALUE_8 = CNT_PIC15;                       21090000
       CALL RCB0M1M (PTR_INT_AREA);                                     21100000
       CALL R100_ERROR (NULL, 'OTHER', '#027');                         21110000
     END;                                                               21120000
                                 /************************************/ 21130000
                                 /* CHECK HASH TOTALS DELTA EXTRACT  */ 21140000
                                 /************************************/ 21150000
 IF WRK_HASH_RCBDRG1 ¬= COUNT.RCBDRG1_HASH                              21160000
   THEN                                                                 21170000
     DO;                                                                21180000
       PARM_INT_AREA.COUNTRY_NUMBER  = '   ';                           21190000
       PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                            21200000
       PARM_INT_AREA.MESSAGE_NUMBER  = '0175';                          21210000
       PARM_INT_AREA.MSG_VAR_CODES   = '';                              21220000
       PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                            21230000
       PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_RCBDRG1;                     21240000
       PARM_INT_AREA.MSG_VAR_CODE_7  = 'HT';                            21250000
       CNT_PIC15                     = COUNT.RCBDRG1_HASH;              21260000
       PARM_INT_AREA.MSG_VAR_VALUE_7 = CNT_PIC15;                       21270000
       PARM_INT_AREA.MSG_VAR_CODE_8  = 'HT';                            21280000
       CNT_PIC15                     = WRK_HASH_RCBDRG1;                21290000
       PARM_INT_AREA.MSG_VAR_VALUE_8 = CNT_PIC15;                       21300000
       CALL RCB0M1M (PTR_INT_AREA);                                     21310000
       CALL R100_ERROR (NULL, 'OTHER', '#028');                         21320000
     END;                                                               21330000
                                 /************************************/ 21340000
                                 /* CREATE TRAILER RECORD NEW F.I.   */ 21350000
                                 /************************************/ 21360000
 FILE_RCBDRG2 = '';                                                     21370000
 FILE_RCBDRG2_H ='';                                                    21380000
 FILE_RCBDRG2_H.KEY            = (20)'9';                               21390000
 FILE_RCBDRG2_H.PROCESS_NAME   = 'RCMS CU';                             21400000
 FILE_RCBDRG2_H.FILE_TYPE      = 'FULL IMAGE';                          21410000
 FILE_RCBDRG2_H.COUNTRY_NUMBER = WRK_CTRYNO;                            21420000
                                                                        21430000
 /* SOC RB01254 */                                                      21440000
 NFI_AREA = FILE_RCBDRG2, BY NAME;                                      21450000
 WRITE FILE(RCBDRG2) FROM (NFI_AREA);                                   21460000
 NFI_AREA.LAST_PROCESSED_DATE = '';                                     21470000
 /* WRITE FILE(RCBDRG2) FROM (IO_AREA_RCBDRG2);                         21480000
 /* EOC RB01254 */                                                      21490000
                                 /************************************/ 21500000
                                 /* CREATE TRAILER RECORDS RCMS FILES*/ 21510000
                                 /************************************/ 21520000
 RCBDR0S0.KIND_OF_RECORD = 'T';  /* FILL TRAILER INTERFACE           */ 21530000
 DO WRK_SYSTEM_ID = 1 TO 20;                                            21540000
   IF P10_ARRAY(WRK_SYSTEM_ID).EXTRACT_TYPE ¬= ' '                      21550000
     THEN                                                               21560000
       DO;                                                              21570000
         WRK_SYSTEM_ID_PIC4  = WRK_SYSTEM_ID;                           21580000
         RCBDR0S0.KIND_OF_EXTRACT                                       21590000
                             = P10_ARRAY(WRK_SYSTEM_ID).EXTRACT_TYPE;   21600000
         RCBDR0S0.HASH_TOTAL = COUNT.RCBDRGX_HASH(WRK_SYSTEM_ID);       21610000
                                                                        21620000
         CALL RCBDR0M (PTR_INT_AREA,                                    21630000
                       ADDR(RCBDR0S0),                                  21640000
                       ADDR(FILE_RCBDRGX_H.DATA));                      21650000
                                                                        21660000
         WRITE FILE (RCBDRGX(WRK_SYSTEM_ID)) FROM (IO_AREA_RCBDRGX);    21670000
                                                                        21680000
         CLOSE FILE (RCBDRGX(WRK_SYSTEM_ID));                           21690000
                                                                        21700000
       END;                                                             21710000
 END;                                                                   21720000
                                 /************************************/ 21730000
                                 /* CLOSE OTHER FILES                */ 21740000
                                 /************************************/ 21750000
0CLOSE FILE (RCBDRG0);                                                  21760000
 CLOSE FILE (RCBDRG1);                                                  21770000
 CLOSE FILE (RCBDRG2);                                                  21780000
                                 /************************************/ 21790000
                                 /* WRITE COUNT MESSAGE RCBDRG0      */ 21800000
                                 /************************************/ 21810000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     21820000
 PARM_INT_AREA.MESSAGE_NUMBER               = '0003';                   21830000
 PARM_INT_AREA.MSG_VAR_CODES                = '';                       21840000
 PARM_INT_AREA.MSG_VAR_CODE_6               = 'FL';                     21850000
 PARM_INT_AREA.MSG_VAR_VALUE_6              = 'RCBDRG0';                21860000
 PARM_INT_AREA.MSG_VAR_CODE_7               = 'C1';                     21870000
 CNT_PIC10                                  = COUNT.RCBDRG0;            21880000
 PARM_INT_AREA.MSG_VAR_VALUE_7              = CNT_PIC10;                21890000
 CALL RCB0M1M (PTR_INT_AREA);                                           21900000
                                 /************************************/ 21910000
                                 /* WRITE COUNT MESSAGE DELTA EXTRACT*/ 21920000
                                 /************************************/ 21930000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     21940000
 PARM_INT_AREA.MESSAGE_NUMBER               = '0003';                   21950000
 PARM_INT_AREA.MSG_VAR_CODES                = '';                       21960000
 PARM_INT_AREA.MSG_VAR_CODE_6               = 'FL';                     21970000
 PARM_INT_AREA.MSG_VAR_VALUE_6              = 'RCBDRG1';                21980000
 PARM_INT_AREA.MSG_VAR_CODE_7               = 'C1';                     21990000
 CNT_PIC10                                  = COUNT.RCBDRG1;            22000000
 PARM_INT_AREA.MSG_VAR_VALUE_7              = CNT_PIC10;                22010000
 CALL RCB0M1M (PTR_INT_AREA);                                           22020000
                                 /************************************/ 22030000
                                 /* WRITE COUNT MESSAGE NEW F.I.     */ 22040000
                                 /************************************/ 22050000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     22060000
 PARM_INT_AREA.MESSAGE_NUMBER               = '0004';                   22070000
 PARM_INT_AREA.MSG_VAR_CODES                = '';                       22080000
 PARM_INT_AREA.MSG_VAR_CODE_6               = 'FL';                     22090000
 PARM_INT_AREA.MSG_VAR_VALUE_6              = 'RCBDRG2';                22100000
 PARM_INT_AREA.MSG_VAR_CODE_7               = 'C6';       /* PTM 661 */ 22110000
 CNT_PIC10                                  = COUNT.RCBDRG2;            22120000
 PARM_INT_AREA.MSG_VAR_VALUE_7              = CNT_PIC10;                22130000
 CALL RCB0M1M (PTR_INT_AREA);                                           22140000
                                 /************************************/ 22150000
                                 /* WRITE COUNT MESSAGE RCMS FILES   */ 22160000
                                 /* RCBDRGX(1-20)                    */ 22170000
                                 /************************************/ 22180000
 CNT_TOT = 0;                                                           22190000
 DO WRK_SYSTEM_ID = 1 TO 20;                                            22200000
   IF P10_ARRAY(WRK_SYSTEM_ID).EXTRACT_TYPE ¬= ' '                      22210000
     THEN                                                               22220000
       DO;                                                              22230000
         PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                          22240000
         PARM_INT_AREA.MESSAGE_NUMBER  = '0004';                        22250000
         PARM_INT_AREA.MSG_VAR_CODES   = '';                            22260000
         PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                          22270000
         PARM_INT_AREA.MSG_VAR_VALUE_6 =                                22280000
                                    'RCBDRGX '||'GR'||WRK_SYSTEM_ID;    22290000
         PARM_INT_AREA.MSG_VAR_CODE_7  = 'C6';                          22300000
         CNT_TOT = CNT_TOT + COUNT.RCBDRGX(WRK_SYSTEM_ID);              22310000
         CNT_PIC10                     = COUNT.RCBDRGX(WRK_SYSTEM_ID);  22320000
         PARM_INT_AREA.MSG_VAR_VALUE_7 = CNT_PIC10;                     22330000
                                                                        22340000
         CALL RCB0M1M (PTR_INT_AREA);                                   22350000
       END;                                                             22360000
 END;                                                                   22370000
                                                                        22380000
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  22390000
 PARM_INT_AREA.MESSAGE_NUMBER  = '0004';                                22400000
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    22410000
 PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                                  22420000
 PARM_INT_AREA.MSG_VAR_VALUE_6 = 'RCBDRGX';                             22430000
 PARM_INT_AREA.MSG_VAR_CODE_7  = 'C6';                                  22440000
 CNT_PIC10                     = CNT_TOT;                               22450000
 PARM_INT_AREA.MSG_VAR_VALUE_7 = CNT_PIC10;                             22460000
                                                                        22470000
 CALL RCB0M1M (PTR_INT_AREA);                                           22480000
                                 /************************************/ 22490000
                                 /* INCREASE PARAMETER RUN SEQ. NO   */ 22500000
                                 /************************************/ 22510000
 WRK_RCB014.RUN_SEQ_NO = WRK_RCB014.RUN_SEQ_NO + 1;                     22520000
 TB_RCBV500            = '';     /* INIT TABLESTRUCTURE              */ 22530000
 TB_RCBV500_I          = '';                                            22540000
 TB_RCB014             = WRK_RCB014;                                    22550000
                                                                        22560000
                                 /* UPDATE RUN SEQUENCE NUMBER       */ 22570000
0CALL RCBG50M (ADDR (TB_RCBV500),                                       22580000
               ADDR (TB_RCBV500_I),                                     22590000
               PTR_RETURN_AREA_BB,                                      22600000
               PTR_INT_AREA);                                           22610000
                                                                        22620000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    22630000
   WHEN (0);                                                            22640000
   OTHERWISE                                                            22650000
     DO;                                                                22660000
       CALL R100_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),               22670000
                              'DB2',                                    22680000
                              '#029');                                  22690000
     END;                                                               22700000
 END;                                                                   22710000
                                 /************************************/ 22720000
                                 /* PROGRAM SUCC. ENDED              */ 22730000
                                 /************************************/ 22740000
0PARM_INT_AREA.MESSAGE_TYPE         = 'IS';                             22750000
 PARM_INT_AREA.MESSAGE_NUMBER       = '9999';                           22760000
 PARM_INT_AREA.MSG_VAR_CODES        = ' ';                              22770000
0CALL RCB0M1M (PTR_INT_AREA);                                           22780000
                                 /************************************/ 22790000
                                 /* CLOSE MESSAGE FILE               */ 22800000
                                 /************************************/ 22810000
 PARM_INT_AREA.MSG_REQUEST = 'C';                                       22820000
 CALL RCB0M1M (PTR_INT_AREA);                                           22830000
                                                                        22840000
 END R099_TERM;                                                         22850000
1/********************************************************************/ 22860000
 /*                                                                  */ 22870000
 /* MODULE NAME      : R100_ERROR                                    */ 22880000
 /*                                                                  */ 22890000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 22900000
 /*                    THE INPUT VARIABLES                           */ 22910000
 /*                                                                  */ 22920000
 /********************************************************************/ 22930000
0 R100_ERROR: PROC (PTR_ERROR,                                          22940000
                            ERR_TYPE,                                   22950000
                            CALL_ID);                                   22960000
0DCL PTR_ERROR    PTR;                                                  22970000
 DCL ERR_TYPE     CHAR(8);                                              22980000
 DCL CALL_ID      CHAR(4);                                              22990000
0PARM_INT_AREA.PTR_ERROR         = PTR_ERROR;                           23000000
 PARM_INT_AREA.ERR_TYPE          = ERR_TYPE;                            23010000
 PARM_INT_AREA.CALL_ID           = CALL_ID;                             23020000
0CALL RCB0E1M (PTR_INT_AREA);                                           23030000
0END R100_ERROR;                                                        23040000
1/*******************************************************************/  23050000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  23060000
 /*******************************************************************/  23070000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  23080000
 $DAIMOD (RCBDRGM);                      /* MODULE TO BE COMPILED   */  23090000
0/*******************************************************************/  23100000
 /* END OF ABR BLOCK                                                */  23110000
 /*******************************************************************/  23120000
 END RCBDRGM;                                                           23130000