 /********************************************************************/ 00013025
 /* RCBDSBM - CCMS CONTRACTS: EXTRACT                                */ 00020025
 /********************************************************************/ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /********************************************************************/ 00070000
 /* PROGRAM          : RCBDSBM                                       */ 00080000
 /*                                                                  */ 00090000
 /* LANGUAGE         : PLISQL                                        */ 00100000
 /*                                                                  */ 00110000
 /* TYPE             : BATCH                                         */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION      : THE EXTRACT OF CCMS CONTRACT RELATED DATA     */ 00140000
 /*                    FOR THE COUNTRIES ASKED FOR.                  */ 00150000
 /*                    CCMS CONTRACTS ARE DETERMINED FROM CHIS AND   */ 00160000
 /*                    CEDS. FOR CHIS ALL CCMS CONTRACTS ARE HANDLED,*/ 00170000
 /*                    SINCE IT IS IMPOSSIBLE TO DETERMINE ONLY THE  */ 00180000
 /*                    CHANGED CCMS CONTRACTS WITHIN CHIS.           */ 00190000
 /*                    FOR CEDS ONLY THOSE CCMS CONTRACTS ARE HANDLED*/ 00200000
 /*                    FOR WHICH INFORMATION HAS CHANGED SINCE THE   */ 00210000
 /*                    LAST CCMS CONTRACTS EXTRACT.                  */ 00220000
 /*                                                                  */ 00230000
 /* INPUT            : - DB2   : RCBV0010_CUSTOMER     RB01289       */ 00240000
 /*                              RCBV0011_PI_CUST                    */ 00250000
 /*                              RCBV0030_CONTRACT                   */ 00260000
 /*                              RCBV0035_CUST_CTR                   */ 00270000
 /*                              RCBV0051_PI_HW_PR                   */ 00280000
 /*                              RCBV0125_DMMY_REAL    RB01320       */ 00290005
 /*                              RCBV0075_SE_PO                      */ 00300000
 /*                              RCBV0150_CUST_ADDR                  */ 00310000
 /*                              RCBV0190_HW_CUST                    */ 00320000
 /*                              RCBV0200_SW_CUST                    */ 00330000
 /*                              RCBV0210_ADD_SERV                   */ 00340000
 /*                              RCBV0240_SERV_CTR                   */ 00350000
 /*                              RCBV0241_PI_CTR                     */ 00360000
 /*                              RCBV0280_ADDR_LINE                  */ 00370000
 /*                              RCBV0300_HW_REAL                    */ 00380000
 /*                              RCBV0320_SW_ON_HW                   */ 00390000
 /*                              RCBV0340_HW_ADDR                    */ 00400000
 /*                              RCBV0470_SERV_COND                  */ 00410000
 /*                              RCBV0500_PARM                       */ 00420000
 /*                              RCBT0660_CCMS_OFF                   */ 00430000
 /*                              RCBT0670_CCMS_KEYS                  */ 00440000
 /*                              RCBT0728_CCMS_CO                    */ 00450000
 /*                              CHIS TABLES                         */ 00460000
 /*                                                                  */ 00470000
 /* OUTPUT           : - FILE  : RCBDSB1                             */ 00480000
 /*                              RCB0M10                             */ 00490000
 /*                                                                  */ 00500000
 /*                    - DB2   : RCBT0670_CCMS_KEYS                  */ 00510000
 /*                                                                  */ 00520000
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00530000
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00540000
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00550000
 /*                    RCB018M   UPDATE HASH TOTAL                   */ 00560000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00570000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00580000
 /*                    RCBI50M   RETRIEVE PARAMETER                  */ 00590000
 /*                    RCBF50M   INSERT PARAMETER                    */ 00600000
 /*                    RCBG50M   UPDATE PARAMETER                    */ 00610000
 /*                    RCBF67M   INSERT CCMS KEY                     */ 00620000
 /*                    RCBI67M   RETRIEVE CCMS KEY                   */ 00630000
 /*                    RCBDS2U   USER EXIT                           */ 00640000
 /*                    RCBDS4U   USER EXIT                           */ 00650000
 /*                    QCH0CMM   CHIS LAM                            */ 00660000
 /*                    QCH0SCM   CHIS LAM                            */ 00670000
 /*                    QCH0RSM   CHIS LAM                            */ 00680000
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00690000
 /*                                                                  */ 00700000
 /* MESSAGES         :                                               */ 00710000
 /*                                                                  */ 00720000
 /* DEPENDENCIES     : NONE                                          */ 00730000
 /*                                                                  */ 00740000
 /* FREQUENCY        : USER DEPENDENT                                */ 00750000
 /*                                                                  */ 00760000
 /* MAINTENANCE LOG  :                                               */ 00770000
 /* ---------------                                                  */ 00780000
 /*                                                                  */ 00790000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00800000
 /* --------------------------------------------------------------   */ 00810000
 /* 1998-10-08| RA01214      | NEW INTERFACE TO CCMS                 */ 00820000
 /* 1999-02-04| PTM1246      | CORRECTION ON HANDLING SHRINKWRAP     */ 00830000
 /* 1999-07-06| PTM1273      | SEVERAL CHANGES AND PERFORMANCE       */ 00840000
 /* 1999-07-06| RC01219      | DORO                                  */ 00850000
 /* 1999-10-04| RA01220      | - ADD MAIN OBJECT TO CHIS UNIQUE KEY  */ 00860000
 /*           |              | - PASS QCH0CMSO RECORD WHEN CALLING   */ 00870000
 /*           |              |   RCBDSB2U WITH TYPE_IND 'N'          */ 00880000
 /* 2000-01-21| RA01221      | REFORMAT CHIS TOS FOR CCMS            */ 00890000
 /* 2000-06-29| RA01223      | UPDATE TABLE RCBT0660_CCMS_OFF        */ 00900000
 /* 2004-04-28| RB01256      | ALIGN SLC ENTITY NAMES                */ 00910000
 /* 2004-08-19| RB01242      | SEQUENCE NUMBER FROM 7 TO 28 CHAR.    */ 00920000
 /* 2006-11-08| CEDS00000311 | CHANGED EFFECTIVE_DATE TO             */ 00930000
 /*           |              | MARKETING_INSTDAT FOR LICENCES        */ 00940000
 /* 2008-03-02| RB01289      | PRIME INPUT CUSTOMER NUMBER           */ 00950000
 /* 2008-10-07| CEDS00000444 | CHIS 7.1 FOR CCMS AND SDF SWMA        */ 00960000
 /* 2009-05-25| CEDS00000468 | ADDED TYPE_OF_RELATION = U CHECK WHILE*/ 00970000
 /*           |              | RETRIEVING CUSTOMER NUMBER FROM T190  */ 00980000
 /* 2012-02-29| RB01320      | CEDS 3.3 A17 RELEASE: SUPPORT FOR     */ 00990008
 /*           |              | LONG SERIAL IN DOWNSTREAMS            */ 00991008
 /* 2014-07-11| RB01341      | CEDS 3.3 A22 RELEASE - ISRAEL COUNTRY */ 00992017
 /*           |              | CONVERSION                            */ 00993013
 /********************************************************************/ 01000000
1/********************************************************************/ 01010000
 /* DEBUGGING                                                        */ 01020000
 /*                                                                  */ 01030000
 /* PROGRAMFLOW TRACING : PUT 'RCBDSBM_CHECK' ON 'Y'                 */ 01040000
 /* (DON'T FORGET: DCL SYSPRINT FILE EXTERNAL PRINT)                 */ 01050000
 /*                                                                  */ 01060000
 /* >>> FOR RELEASE VALUE MUST BE 'N'       <<<                      */ 01070000
 /*                                                                  */ 01080000
 /********************************************************************/ 01090000
 %DCL RCBDSBM_CHECK CHAR;                                               01100000
 %RCBDSBM_CHECK = 'N';                                                  01110000
0%IF ( RCBDSBM_CHECK = 'Y' ) %THEN                                      01120000
 %DO;                                                                   01130000
   (CHECK(                                                              01140000
          RCBDSBM                 ,                                     01150000
          R001_LOCK_TABLES        ,                                     01160000
          R002_RCBBLA0_CTRS       ,                                     01170000
          R003_ESASSA_CTRS        ,                                     01180000
          R004_PSEUDO_HW          ,                                     01190000
          R005_LICENSES           ,                                     01200000
          R006_SHRINKWRAP_SOF     ,                                     01210000
          R007_SHRINKWRAP_PI      ,                                     01220000
          R008_CHIS_CTRS          ,                                     01230000
          R009_DATA_MAPPING       ,                                     01240000
          R010_CURSOR_RCBBLA0     ,                                     01250000
          R011_CURSOR_PSEUDO_HW   ,                                     01260000
          R012_CURSOR_SHRINK_N    ,                                     01270000
          R013_CURSOR_SHRINK_PI   ,                                     01280000
          R014_ADDRESS_LINES      ,                                     01290000
          R015_CURSOR_LICENSES    ,                                     01300000
          R016_CURSOR_ESA_SSA     ,                                     01310000
          R017_CURSOR_SOURCE_ID   ,                                     01320000
          R018_CCMS_CONTRACT      ,                                     01330000
          R019_SELECT_RCBV0340    ,                                     01340000
          R020_SELECT_RCBV011     ,                                     01350000
          R021_SELECT_RCBV0470    ,                                     01360000
          R022_SELECT_RCBV0150    ,                                     01370000
          R023_SELECT_RCBV0320    ,                                     01380000
          R029_T125_RETRIEVE      ,                      /* RB01320 */  01381005
          R024_QCH0CMSO           ,                                     01390000
          R025_QCH0SCSO           ,                                     01400000
          R027_QCH0RSSO           ,                                     01410000
          R028_USEREXIT_RCBDS4U   ,                                     01420000
          R030_PROCESS_USEREXIT_N ,                                     01430000
          R031_PROCESS_USEREXIT_R ,                                     01440000
          R032_PROCESS_USEREXIT_O ,                                     01450000
          R033_PROCESS_USEREXIT_Y ,                                     01460000
          R035_FILL_RCBDSB1       ,                                     01470000
          R038_DETERMINE_SEQ_NR_KEY,                                    01480000
          R040_T010_CUSTOMER,                        /* SOC RB01289 */  01490000
          R041_T190_OR_T011_CUSTOMER,                                   01500000
          R042_BAU_CUSTOMER_INFO,                                       01510000
          R043_PI_CUSTOMER_INFO,                     /* EOC RB01289 */  01520000
          R705_WRITE_RCBDSB1_RECORD ,                                   01530000
          R799_END_COUNTRY        ,                                     01540000
          R031_PROCESS_USEREXIT_R ,                                     01550000
          R800_INIT_PROCESSING    ,                                     01560000
          R899_END_PROCESSING     ,                                     01570000
          R900_INIT_PROGRAM                                             01580000
   )):                                                                  01590000
 %END;                                                                  01600000
1RCBDSBM: PROC                                                          01610000
          OPTIONS (MAIN)                                                01620000
          REORDER;                                                      01630000
 DEFAULT RANGE (*)        STATIC;                                       01640000
1/********************************************************************/ 01650000
 /*  PARAMETERS                                                      */ 01660000
 /********************************************************************/ 01670000
0DCL PTR_INT_AREA        PTR;                 /* INTERFACE AREA      */ 01680000
0DCL PTR_RETURN_AREA_BB  PTR;                 /* RETURN AREA FROM BB */ 01690000
0DCL PTR_COUNTRY_AREA    PTR;                 /* INTERFACE RCB019M   */ 01700000
0DCL PTR_RUN_DATE_AREA   PTR;                 /* INTERFACE RCB020M   */ 01710000
0DCL PTR_SEARCH_QCH0CMSI PTR;                 /* POINTER TO QCH0CMM  */ 01720000
0DCL PTR_SEARCH_QCH0RSSI PTR;                 /* POINTER TO QCH0RSM  */ 01730000
0DCL PTR_SEARCH_QCH0SCSI PTR;                 /* POINTER TO QCH0SCM  */ 01740000
0DCL 1 PARM_INT_AREA,                         /* INTERFACE AREA      */ 01750000
       %INCLUDE (RCBZ01S);;                                             01760000
0DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 01770000
       %INCLUDE (RCBZ02S);;                                             01780000
0DCL 1 COUNTRY_AREA,                          /* COUNTRY AREA        */ 01790000
       %INCLUDE (RCBZ26S);;                                             01800000
0DCL 1 RUN_DATE_AREA,                         /* RUN DATE AREA       */ 01810000
       %INCLUDE (RCBZ28S);;                                             01820000
 DCL 1 PARM_RCB005,                           /* EXTR PARAMETER      */ 01830000
      %INCLUDE (RCBP05S);;                                              01840000
 DCL 1 PARM_RCB027,                           /* MAX SEQ NR PARM     */ 01850000
      %INCLUDE (RCBP27S);;                                              01860000
 DCL 1 PARM_RCB024M,                           /* RCB024M PARM       */ 01870000
      %INCLUDE (RCBZ33S);;                                              01880000
1/********************************************************************/ 01890000
 /* EXTERNAL ENTRIES                                                 */ 01900000
 /********************************************************************/ 01910000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01920000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 01930000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 01940000
 DCL RCB018M   ENTRY  EXTERNAL;          /* UPDATE HASH TOTAL        */ 01950000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01960000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01970000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01980000
 DCL RCBF50M   ENTRY  EXTERNAL;          /* INSERT PARAMETER         */ 01990000
 DCL RCBG50M   ENTRY  EXTERNAL;          /* UPDATE PARAMETER         */ 02000000
 DCL RCBF67M   ENTRY  EXTERNAL;          /* RETRIEVE CCMS KEY        */ 02010000
 DCL RCBI67M   ENTRY  EXTERNAL;          /* INSERT CCMS KEY          */ 02020000
 DCL RCBDS2U   ENTRY  EXTERNAL;          /* USER EXIT                */ 02030000
 DCL RCBDS4U   ENTRY  EXTERNAL;          /* USER EXIT                */ 02040000
 DCL QCH0CMM   ENTRY  EXTERNAL;          /* CHIS LAM                 */ 02050000
 DCL QCH0SCM   ENTRY  EXTERNAL;          /* CHIS LAM                 */ 02060000
 DCL QCH0RSM   ENTRY  EXTERNAL;          /* CHIS LAM                 */ 02070000
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 02080000
1/********************************************************************/ 02090000
 /*  FILE DECLARATIONS                                               */ 02100000
 /********************************************************************/ 02110000
 DCL RCBDSB1        FILE         /* EXTRACT (CEDS)                   */ 02120000
                    RECORD                                              02130000
                    OUTPUT                                              02140000
                    SEQUENTIAL;                                         02150000
1/********************************************************************/ 02160000
 /* CHIS LAM STRUCTURES                                              */ 02170000
 /********************************************************************/ 02180000
 DCL 1 QCH0CMSO,                                                        02190000
       %INCLUDE (QCH0CMSO);;                                            02200000
 DCL 1 QCH0RSSO,                                                        02210000
       %INCLUDE (QCH0RSSO);;                                            02220000
 DCL 1 QCH0SCSO,                                                        02230000
       %INCLUDE (QCH0SCSO);;                                            02240000
1/********************************************************************/ 02250000
 /* DB2 TABLE STRUCTURES                                             */ 02260000
 /********************************************************************/ 02270000
 DCL 1 TB_RCBV010,                                        /* RB01289 */ 02280000
      %INCLUDE (RCB010S);;                                /* RB01289 */ 02290000
 DCL 1 TB_RCBV011,                                                      02300000
      %INCLUDE (RCB011S);;                                              02310000
 DCL 1 TB_RCBV030,                                                      02320000
    %INCLUDE (RCB030S);;                                                02330000
 DCL 1 TB_RCBV035,                                                      02340000
    %INCLUDE (RCB035S);;                                                02350000
 DCL 1 TB_RCBV051,                                                      02360000
    %INCLUDE (RCB051S);;                                                02370000
 DCL 1 TB_RCBV075,                                                      02380000
    %INCLUDE (RCB075S);;                                                02390000
 DCL 1 TB_RCBV125,                                    /* SOC RB01320 */ 02400005
    %INCLUDE (RCB125S);;                              /* EOC RB01320 */ 02410005
 DCL 1 TB_RCBV150,                                                      02420000
    %INCLUDE (RCB150S);;                                                02430000
 DCL 1 TB_RCBV190,                      /* STRUCTURE FOR CURRENT CTRS*/ 02440000
      %INCLUDE (RCB190S);;                                              02450000
 DCL 1 TB_RCBV200,                                                      02460000
      %INCLUDE (RCB200S);;                                              02470000
 DCL 1 TB_RCBV210,                                                      02480000
      %INCLUDE (RCB210S);;                                              02490000
 DCL 1 TB_RCBV240,                      /* STRUCTURE FOR CURRENT CTRS*/ 02500000
      %INCLUDE (RCB240S);;                                              02510000
 DCL 1 TB_RCBV241,                                                      02520000
      %INCLUDE (RCB241S);;                                              02530000
 DCL 1 TB_RCBV280,                                                      02540000
      %INCLUDE (RCB280S);;                                              02550000
 DCL 1 TB_RCBV300,                                                      02560000
      %INCLUDE (RCB300S);;                                              02570000
 DCL 1 TB_RCBV320,                                                      02580000
      %INCLUDE (RCB320S);;                                              02590000
 DCL 1 TB_RCBV340,                                                      02600000
      %INCLUDE (RCB340S);;                                              02610000
 DCL 1 TB_RCBV470,                                                      02620000
      %INCLUDE (RCB470S);;                                              02630000
 DCL 1 TB_RCBV500,                                                      02640000
      %INCLUDE (RCB500S);;                                              02650000
 DCL 1 TB_RCBV500_I,                                                    02660000
      %INCLUDE (RCB500SI);;                                             02670000
 DCL 1 TB_RCBV660,                                                      02680000
      %INCLUDE (RCB660S);;                                              02690000
 DCL 1 TB_RCBV660_I,                                                    02700000
      %INCLUDE (RCB660SI);;                                             02710000
 DCL 1 TB_RCBV670,                                                      02720000
      %INCLUDE (RCB670S);;                                              02730000
 DCL 1 TB_RCBV670_I,                                                    02740000
      %INCLUDE (RCB670SI);;                                             02750000
 DCL 1 TB_RCBV728,                                                      02760000
      %INCLUDE (RCB728S);;                                              02770000
 DCL 1 TB_RCBP14S            BASED (ADDR(TB_RCBV500)),                  02780000
      %INCLUDE (RCBP14S);;                                              02790000
 DCL 1 TB_RCBP24S            BASED (ADDR(TB_RCBV500)),                  02800000
      %INCLUDE (RCBP24S);;                                              02810000
 DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  02820000
      %INCLUDE (RCBP05S);;                                              02830000
 DCL 1 TB_RCBP27S            BASED (ADDR(TB_RCBV500)),                  02840000
      %INCLUDE (RCBP27S);;                                              02850000
 /********************************************************************/ 02860000
 /*  RECORD STRUCTURES                                               */ 02870000
 /********************************************************************/ 02880000
 DCL 1 FILE_RCBDSB1,             /* SW_INV RECORD                    */ 02890000
      %INCLUDE (RCBDSBS);;                                              02900000
                                                                        02910000
 DCL 1 FILE_RCBDSB1_H BASED (ADDR(FILE_RCBDSB1)),/* HEADER/TRAILER   */ 02920000
      %INCLUDE (RCBD01S);;                                              02930000
                                                                        02940000
 DCL 1 USER_FILE_RCBDSB1 LIKE FILE_RCBDSB1;                             02950000
1/********************************************************************/ 02960000
 /*  PROGRAM CONTROL PARAMETERS                                      */ 02970000
 /********************************************************************/ 02980000
 DCL 1 SEARCH_ARG_QCH0CMSI,                                             02990000
       %INCLUDE QCH0CMSI;;                                              03000000
 DCL 1 SEARCH_ARG_QCH0RSSI,                                             03010000
       %INCLUDE QCH0RSSI;;                                              03020000
 DCL 1 SEARCH_ARG_QCH0SCSI,                                             03030000
       %INCLUDE QCH0SCSI;;                                              03040000
 /********************************************************************/ 03050000
 /*  BIT SWITCHES                                                    */ 03060000
 /********************************************************************/ 03070000
 DCL TRUE                BIT (1)         INIT ('1'B);                   03080000
 DCL FALSE               BIT (1)         INIT ('0'B);                   03090000
 DCL SWITCH_LONG_SER     BIT (1)         INIT ('0'B);     /* RB01320 */ 03100005
 DCL SWITCH_USER_EXIT_2  BIT (1)         INIT ('1'B);     /* RCBDS2U */ 03120000
 DCL SWITCH_USER_EXIT_4  BIT (1)         INIT ('1'B);     /* RCBDS4U */ 03130000
 DCL T010_CUSTOMER_FLAG  BIT (1)         INIT ('0'B); /* SOC RB01289 */ 03140000
 DCL T011_CUSTOMER_FLAG  BIT (1)         INIT ('0'B);                   03150000
 DCL T0190_CUSTOMER_FLAG BIT (1)         INIT ('0'B); /* EOC RB01289 */ 03160000
 /********************************************************************/ 03170000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 03180000
 /********************************************************************/ 03190000
 DCL 1 COUNT,                                                           03200000
       3 CNT_CTRY,                                                      03210000
         5 IN_QCH0CMSO      FIXED BIN(31),                              03220000
         5 IN_QCH0SCSO      FIXED BIN(31),                              03230000
         5 IN_QCH0RSSO      FIXED BIN(31),                              03240000
       3 CNT_TOT,                                                       03250000
         5 IN_QCH0CMSO      FIXED BIN(31),                              03260000
         5 IN_QCH0SCSO      FIXED BIN(31),                              03270000
         5 IN_QCH0RSSO      FIXED BIN(31);                              03280000
 DCL I                      FIXED BIN(15);                              03290000
 DCL @OPEN                  CHAR (05)  INIT ('OPEN ');                  03300000
 DCL @FETCH                 CHAR (05)  INIT ('FETCH');                  03310000
 DCL @CLOSE                 CHAR (05)  INIT ('CLOSE');                  03320000
 DCL WRK_MOD_NAME           CHAR (08)  INIT ('RCBDSBM');                03330000
 DCL WRK_PRG_NAME           CHAR (08)  INIT ('RCBDSBP');                03340000
 DCL WRK_FILE_NAME          CHAR (07)  INIT ('RCBDSB1');                03350000
 DCL WRK_SYSTEM_TYPE        CHAR (01)  INIT ('B');                      03360000
 DCL WRK_PROC_ID            CHAR (04);                                  03370000
 DCL WRK_CTRYNO             CHAR (03);                                  03380000
 DCL WRK_PGR_TYPE           CHAR (03);                                  03390000
 DCL WRK_RUN_DATE           CHAR (10);                                  03400000
 DCL WRK_TIME_STAMP         CHAR(20);                                   03410000
 DCL WRK_CTRYNO_NO          FIXED BIN(15) INIT(1);                      03420000
 DCL WRK_CNT_COUNTRY        FIXED BIN(31) INIT(0);                      03430000
 DCL WRK_SQLCODE_CURRENT    FIXED BIN(31);                              03440000
 DCL WRK_INDNULL            FIXED BIN(15);                              03450000
 DCL WRK_INDNULL_CALLBCK    FIXED BIN(15);                              03460000
 DCL WRK_SLC_NULL           FIXED BIN(15);                              03470000
 DCL WRK_CNT_RCBDSB1        FIXED BIN(31) INIT(0);                      03480000
 DCL WRK_HASH_TOTAL         FIXED DEC(15) INIT(0);                      03490000
 DCL WRK_PIC_10             PIC 'Z,ZZZ,ZZZ,ZZ9';                        03500000
 DCL WRK_LDBSOSN_PIC_09     PIC '(9)9';                                 03510000
 DCL WRK_LOVCIDX_PIC_15     PIC '(15)9';                                03520000
 DCL WRK_MAX_KEY            PIC '(15)9'   INIT(0);                      03530000
 DCL WRK_SEQ_NR_KEY         PIC '(15)9';                                03540000
 DCL WRK_CEDS_LONG_KEY      CHAR (83);                     /* RA01220 */03550000
 DCL WRK_TYPE_IND           CHAR (01);                                  03560000
 DCL WRK_ACCEPT_IND         CHAR (01);                                  03570000
 DCL 1 WRK_KEY_CURRENT,                                                 03580000
       3 PRODUCT_TYPE       CHAR(04),                                   03590000
       3 ORIGIN             CHAR(02),                                   03600000
       3 SEQUENCE_NUMBER    CHAR(28);                     /* RB01242 */ 03610000
 DCL 1 WRK_ADDRESS_LINES,                                               03620000
       3 LINE(9)            CHAR(30);                                   03630000
 DCL WRK_ADDRESS_NUMBER     CHAR(05);                                   03640000
 DCL WRK_DUMMY_ORIGIN_IND   FIXED BIN(15);                /* RB01320 */ 03641005
 DCL WRK_DUMMY_SEQ_NUM_IND  FIXED BIN(15);                /* RB01320 */ 03642005
                                                      /* SOC RA01223 */ 03650000
 DCL POS_TYPE               FIXED BIN(15) INIT(0);                      03660000
 DCL POS_ORIGIN             FIXED BIN(15) INIT(0);                      03670000
 DCL POS_SER5               FIXED BIN(15) INIT(0);                      03680000
 DCL POS_SER7               FIXED BIN(15) INIT(0);                      03690000
                                                      /* SOC RA01223 */ 03700000
 DCL WRK_T0190_CUSTOMER_NUMBER CHAR(08);                  /* RB01289 */ 03710000
 DCL WRK_T011_CUSTOMER_NUMBER CHAR(08);                   /* RB01289 */ 03720000
 DCL WRK_PRODUCT_TYPE  CHAR(4);                           /* RB01320 */ 03721005
 DCL WRK_SERIAL_NUMBER CHAR(30);                          /* RB01320 */ 03722005
                                                                        03730000
1/********************************************************************/ 03740000
 /*  BUILTIN FUNCTIONS                                               */ 03750000
 /********************************************************************/ 03760000
 DCL (ADDR,                                                             03770000
     CSTG,                                                              03780000
     DATE,                                                              03790000
     NULL,                                                              03800000
     STG,                                                               03810000
     STRING,                                                            03820000
     SUBSTR,                                                            03830000
     TRANSLATE,                                                         03840000
     LOW,                                                               03850000
     HIGH,                                                              03860000
     INDEX,                                                             03870000
     TIME)                   BUILTIN;                                   03880000
1/********************************************************************/ 03890000
 /* ON ERROR CONDITIONS                                              */ 03900000
 /********************************************************************/ 03910000
 %INCLUDE (RCB0E0M);                                                    03920000
 END;                                                                   03930000
1/********************************************************************/ 03940000
 /* DB2/SQL SQLCA                                                    */ 03950000
 /********************************************************************/ 03960000
 EXEC SQL                                                               03970000
   INCLUDE SQLCA                                                        03980000
   ;                                                                    03990000
 /********************************************************************/ 04000000
 /* DB2/SQL CURSORS                                                  */ 04010000
 /********************************************************************/ 04020000
                                                                        04030000
 /********************************************************************/ 04040000
 /*                                                                  */ 04050000
 /* CURSOR FOR SELECTINGALL (DISTINCT) SOURCE TYPE IDENTIFIERS      */  04060000
 /* TO EXTRACT THE CHANGED/NEW CONTRACTS FROM THE CEDS AND CHIS      */ 04070000
 /* DATABASE                                                         */ 04080000
 /********************************************************************/ 04090000
 EXEC SQL                                                               04100000
    DECLARE CURS_RCBV0660                                               04110000
    CURSOR FOR                                                          04120000
    SELECT DISTINCT(SOURCE_TYPE_ID)                                     04130000
    FROM RCBV0660_CCMS_OFF                                              04140000
    WHERE COUNTRY_NUMBER   = :TB_RCBV660.COUNTRY_NUMBER                 04150000
      AND DELETE_IND       = :TB_RCBV660.DELETE_IND                     04160000
    ORDER BY SOURCE_TYPE_ID                                             04170000
    FOR FETCH ONLY                                                      04180000
 ;                                                                      04190000
                                                                        04200000
 /********************************************************************/ 04210000
 /*                                                                  */ 04220000
 /* CURSOR FOR SELECTING ALL EFFECTIVE CHANGED RCBBLA0 RECORDS       */ 04230000
 /*                                                                  */ 04240000
 /********************************************************************/ 04250000
 EXEC SQL                                                               04260000
    DECLARE CURS_RCBBLA0                                                04270000
    CURSOR FOR                                                          04280000
    SELECT T210.CONTRACT_NUMBER,                                        04290000
           T210.CUSTOMER_NUMBER,                                        04300000
           T210.SERVICE_NUMBER,                                         04310000
           T210.GROUP_ID,                                               04320000
           T210.EFFECTIVE_DATE,                                         04330000
           T210.QTY_MU_CONTRACTED,                                      04340000
           T210.QTY_MU_ACCOMPLISH,                                      04350000
           T210.END_DATE,                                               04360000
           T210.COVERAGE_START_1,                                       04370000
           T210.COVERAGE_END_1,                                         04380000
           T210.COVERAGE_START_2,                                       04390000
           T210.COVERAGE_END_2,                                         04400000
           T210.COVERAGE_START_3,                                       04410000
           T210.COVERAGE_END_3,                                         04420000
           T210.COVERAGE_START_4,                                       04430000
           T210.COVERAGE_END_4,                                         04440000
           T210.COVERAGE_START_5,                                       04450000
           T210.COVERAGE_END_5,                                         04460000
           T210.COVERAGE_START_6,                                       04470000
           T210.COVERAGE_END_6,                                         04480000
           T210.COVERAGE_START_7,                                       04490000
           T210.COVERAGE_END_7,                                         04500000
           T075.MEASUREMENT_UNIT                                        04510000
    FROM RCBV0210_ADD_SERV T210,                                        04520000
         RCBV0728_CCMS_CO  T728,                                        04530000
         RCBV0075_SE_PO    T075,                                        04540000
         RCBV0660_CCMS_OFF T660                                         04550000
    WHERE T660.COUNTRY_NUMBER           = :TB_RCBV660.COUNTRY_NUMBER    04560000
      AND T660.DELETE_IND               = :TB_RCBV660.DELETE_IND        04570000
      AND T660.SOURCE_TYPE_ID           = :TB_RCBV660.SOURCE_TYPE_ID    04580000
      AND T660.CCMS_OFFERING_ID         = T210.SERVICE_NUMBER           04590000
      AND T075.COUNTRY_NUMBER           = T660.COUNTRY_NUMBER           04600000
      AND T075.SERVICE_NUMBER           = T210.SERVICE_NUMBER           04610000
      AND T728.COUNTRY_NUMBER           = T660.COUNTRY_NUMBER           04620000
      AND T728.SOURCE_TYPE_ID           = T660.SOURCE_TYPE_ID           04630000
      AND T728.CONTRACT_NUMBER          = T210.CONTRACT_NUMBER          04640000
      AND T728.CUSTOMER_NUMBER          = T210.CUSTOMER_NUMBER          04650000
      AND T728.SERVICE_NUMBER           = T210.SERVICE_NUMBER           04660000
      AND T728.GROUP_ID                 = T210.GROUP_ID                 04670000
      AND T210.COUNTRY_NUMBER           = T660.COUNTRY_NUMBER           04680000
      AND :WRK_RUN_DATE BETWEEN T210.EFFECTIVE_DATE AND T210.END_DATE   04690000
    FOR FETCH ONLY                                                      04700000
 ;                                                                      04710000
                                                                        04720000
 /********************************************************************/ 04730000
 /*                                                                  */ 04740000
 /* CURSOR FOR SELECTING ALL EFFECTIVE CHANGED PSEUDO HW RECORDS     */ 04750000
 /*                                                                  */ 04760000
 /********************************************************************/ 04770000
                                                                        04780000
                                  /* REMOVED DUPLICATE WHERE *RC01219*/ 04790000
                                  /* CLAUSE FOR T190.CTRYNO  *RC01219*/ 04800000
 EXEC SQL                                                               04810000
    DECLARE CURS_PSEUDO_HW                                              04820000
    CURSOR FOR                                                          04830000
    SELECT T240.PRODUCT_TYPE,                                           04840000
           T240.ORIGIN,                                                 04850000
           T240.SEQUENCE_NUMBER,                                        04860000
           T240.CONTRACT_NUMBER,                                        04870000
           T240.COVERAGE_START_1,                                       04880000
           T240.COVERAGE_END_1,                                         04890000
           T240.COVERAGE_START_2,                                       04900000
           T240.COVERAGE_END_2,                                         04910000
           T240.COVERAGE_START_3,                                       04920000
           T240.COVERAGE_END_3,                                         04930000
           T240.COVERAGE_START_4,                                       04940000
           T240.COVERAGE_END_4,                                         04950000
           T240.COVERAGE_START_5,                                       04960000
           T240.COVERAGE_END_5,                                         04970000
           T240.COVERAGE_START_6,                                       04980000
           T240.COVERAGE_END_6,                                         04990000
           T240.COVERAGE_START_7,                                       05000000
           T240.COVERAGE_END_7,                                         05010000
           T240.EFFECTIVE_DATE,                                         05020000
           T240.END_DATE,                                               05030000
           T190.CUSTOMER_NUMBER,                                        05040000
           T300.MODEL_NUMBER                                            05050000
    FROM RCBV0660_CCMS_OFF T660,                                        05060000
     /*  RCBV0728_CCMS_CO  T728, */                        /* RB01320 */05070009
         RCBV0240_SERV_CTR T240,                                        05080000
         RCBV0300_HW_REAL  T300,                                        05090000
         RCBV0190_HW_CUST  T190                                         05100000
        ,RCBV0728_CCMS_CO  T728                        /* SOC RB01320 */05101005
                                                                        05101100
   LEFT OUTER JOIN RCBV0125_DMMY_REAL T125                              05102000
     ON    T125.PRODUCT_TYPE            = T728.PRODUCT_TYPE             05103000
     AND   T125.DUMMY_ORIGIN            = T728.ORIGIN                   05104002
     AND   T125.DUMMY_SEQUENCE_NUM      = T728.SEQUENCE_NUMBER          05105002
     AND   T125.COUNTRY_NUMBER          = T728.COUNTRY_NUMBER           05106000
                                                       /* EOC RB01320 */05110005
    WHERE T660.COUNTRY_NUMBER           = :TB_RCBV660.COUNTRY_NUMBER    05120000
      AND T660.DELETE_IND               = :TB_RCBV660.DELETE_IND        05130000
      AND T660.SOURCE_TYPE_ID           = :TB_RCBV660.SOURCE_TYPE_ID    05140000
      AND T660.CCMS_OFFERING_ID         = T300.PRODUCT_TYPE ||          05150000
                                          T300.MODEL_NUMBER             05160000
      AND T728.COUNTRY_NUMBER           = T660.COUNTRY_NUMBER           05170000
      AND T728.SOURCE_TYPE_ID           = T660.SOURCE_TYPE_ID           05180000
      AND T660.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           05190000
      AND T728.PRODUCT_TYPE             = T240.PRODUCT_TYPE             05200000
                                                       /* SOC RB01320 */05200105
   /* AND T728.ORIGIN                   = T240.ORIGIN                   05201000
      AND T728.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER */       05202000
      AND ((T728.ORIGIN                 = T240.ORIGIN                   05220009
      AND T728.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER)         05230009
      OR  (T125.COUNTRY_NUMBER          = T728.COUNTRY_NUMBER           05240000
      AND  T240.PRODUCT_TYPE            = T728.PRODUCT_TYPE             05252000
      AND  T125.REAL_SERIAL_NUMBER      = T240.ORIGIN||                 05260000
                                          T240.SEQUENCE_NUMBER          05270000
      AND  T125.DUMMY_ORIGIN            = T728.ORIGIN                   05280000
      AND  T125.DUMMY_SEQUENCE_NUM      = T728.SEQUENCE_NUMBER))        05290000
                                                       /* EOC RB01320 */05300005
      AND T300.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           05310000
      AND T300.PRODUCT_TYPE             = T240.PRODUCT_TYPE             05320000
      AND T300.ORIGIN                   = T240.ORIGIN                   05330000
      AND T300.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER          05340000
      AND T190.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           05350000
      AND T190.PRODUCT_TYPE             = T240.PRODUCT_TYPE             05360000
      AND T190.ORIGIN                   = T240.ORIGIN                   05370000
      AND T190.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER          05380000
      AND T190.TYPE_OF_RELATION         = :TB_RCBV190.TYPE_OF_RELATION  05390000
      AND :WRK_RUN_DATE BETWEEN T240.EFFECTIVE_DATE AND                 05400000
                               T240.END_DATE                            05410000
      AND :WRK_RUN_DATE BETWEEN T300.EFFECTIVE_DATE AND                 05420000
                               T300.END_DATE                            05430000
      AND :WRK_RUN_DATE BETWEEN T190.EFFECTIVE_DATE AND                 05440000
                               T190.END_DATE                            05450000
    FOR FETCH ONLY                                                      05460000
 ;                                                                      05470000
                                                                        05480000
 /********************************************************************/ 05490000
 /*                                                                  */ 05500000
 /* CURSOR FOR SELECTING ALL EFFECTIVE CHANGED ESA/SSA RECORDS       */ 05510000
 /* READ ALL EFFECTIVE ESA/SSA CONTRACTS WHICH ARE CHANGED OR NEW.   */ 05520000
 /********************************************************************/ 05530000
                                                      /* SOC PTM1273 */ 05540000
 EXEC SQL                                                               05550000
    DECLARE CURS_ESA_SSA                                                05560000
    CURSOR FOR                                                          05570000
    SELECT T240.PRODUCT_TYPE,                                           05580000
           T240.ORIGIN,                                                 05590000
           T240.SEQUENCE_NUMBER,                                        05600000
           T240.CONTRACT_NUMBER,                                        05610000
           T240.COVERAGE_START_1,                                       05620000
           T240.COVERAGE_END_1,                                         05630000
           T240.COVERAGE_START_2,                                       05640000
           T240.COVERAGE_END_2,                                         05650000
           T240.COVERAGE_START_3,                                       05660000
           T240.COVERAGE_END_3,                                         05670000
           T240.COVERAGE_START_4,                                       05680000
           T240.COVERAGE_END_4,                                         05690000
           T240.COVERAGE_START_5,                                       05700000
           T240.COVERAGE_END_5,                                         05710000
           T240.COVERAGE_START_6,                                       05720000
           T240.COVERAGE_END_6,                                         05730000
           T240.COVERAGE_START_7,                                       05740000
           T240.COVERAGE_END_7,                                         05750000
           T240.EFFECTIVE_DATE,                                         05760000
           T240.END_DATE,                                               05770000
           T190.MARKETING_INSTDAT,                                      05780000
           T190.CUSTOMER_NUMBER                                         05790000
                                                       /* SOC RB01320 */05790105
          ,T125.DUMMY_ORIGIN                                            05790204
          ,T125.DUMMY_SEQUENCE_NUM                                      05790304
  /*FROM RCBV0728_CCMS_CO  T728,                                        05800000
         RCBV0240_SERV_CTR T240, */                                     05810000
    FROM RCBV0240_SERV_CTR T240,                       /* EOC RB01320 */05811005
         RCBV0190_HW_CUST  T190,                                        05820000
         RCBV0035_CUST_CTR T035                                         05830000
        ,RCBV0728_CCMS_CO  T728                        /* SOC RB01320 */05831005
                                                                        05840000
   LEFT OUTER JOIN RCBV0125_DMMY_REAL T125                              05841000
     ON    T728.PRODUCT_TYPE            = T125.PRODUCT_TYPE             05842000
     AND   T728.ORIGIN                  = T125.DUMMY_ORIGIN             05843000
     AND   T728.SEQUENCE_NUMBER         = T125.DUMMY_SEQUENCE_NUM       05844000
     AND   T728.COUNTRY_NUMBER          = T125.COUNTRY_NUMBER           05845000
                                                       /* EOC RB01320 */05846005
    WHERE T728.COUNTRY_NUMBER           = :TB_RCBV728.COUNTRY_NUMBER    05850000
      AND T728.SOURCE_TYPE_ID           = :TB_RCBV728.SOURCE_TYPE_ID    05860000
      AND T728.PRODUCT_TYPE             = T240.PRODUCT_TYPE             05870000
                                                       /* SOC RB01320 */05870105
   /* AND T728.ORIGIN                   = T240.ORIGIN                   05871000
      AND T728.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER */       05872000
      AND ((T728.ORIGIN                 = T240.ORIGIN                   05890000
      AND T728.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER)         05900000
      OR  (T125.COUNTRY_NUMBER          = T728.COUNTRY_NUMBER           05910000
      AND  T125.PRODUCT_TYPE            = T728.PRODUCT_TYPE             05920000
      AND (T125.REAL_SERIAL_NUMBER      = T240.ORIGIN||                 05930000
                                          T240.SEQUENCE_NUMBER)         05940000
      AND  T125.DUMMY_ORIGIN            = T728.ORIGIN                   05950000
      AND  T125.DUMMY_SEQUENCE_NUM      = T728.SEQUENCE_NUMBER))        05960000
                                                       /* EOC RB01320 */05970005
      AND T728.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           05980000
      AND T190.PRODUCT_TYPE             = T240.PRODUCT_TYPE             05990000
      AND T190.ORIGIN                   = T240.ORIGIN                   06000000
      AND T190.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER          06010000
      AND T190.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           06020000
      AND T190.TYPE_OF_RELATION         = :TB_RCBV190.TYPE_OF_RELATION  06030000
      AND :WRK_RUN_DATE                 <= T240.END_DATE                06040000
      AND :WRK_RUN_DATE BETWEEN T190.EFFECTIVE_DATE AND T190.END_DATE   06050000
      AND T035.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           06060000
      AND T035.CUSTOMER_NUMBER          = T190.CUSTOMER_NUMBER          06070000
      AND T035.CONTRACT_NUMBER          = T240.CONTRACT_NUMBER          06080000
      AND T035.SA_CONTRACT_IND          = 'Y'                           06090000
    ORDER BY T240.PRODUCT_TYPE, T240.ORIGIN, T240.SEQUENCE_NUMBER,      06100000
             T240.EFFECTIVE_DATE                                        06110000
    FOR FETCH ONLY                                                      06120000
                                                      /* EOC PTM1273 */ 06130000
 ;                                                                      06140000
                                                                        06150000
 /********************************************************************/ 06160000
 /*                                                                  */ 06170000
 /* CURSOR FOR SELECTING ALL EFFECTIVE CHANGED SHRINKWRAP CONTRACTS  */ 06180000
 /* IN SOF/CHIS MODE                                                 */ 06190000
 /********************************************************************/ 06200000
                         /* ADD SELECTION OF TYPE_OF_CONTRACT*PTM1246*/ 06210000
 EXEC SQL                                                               06220000
    DECLARE CURS_SHRINK_N                                               06230000
    CURSOR FOR                                                          06240000
    SELECT T240.PRODUCT_TYPE,                                           06250000
           T240.ORIGIN,                                                 06260000
           T240.SEQUENCE_NUMBER,                                        06270000
           T030.CONTRACT_NUMBER,                                        06280000
           T030.TYPE_OF_CONTRACT,                                       06290000
           T240.COVERAGE_START_1,                                       06300000
           T240.COVERAGE_END_1,                                         06310000
           T240.COVERAGE_START_2,                                       06320000
           T240.COVERAGE_END_2,                                         06330000
           T240.COVERAGE_START_3,                                       06340000
           T240.COVERAGE_END_3,                                         06350000
           T240.COVERAGE_START_4,                                       06360000
           T240.COVERAGE_END_4,                                         06370000
           T240.COVERAGE_START_5,                                       06380000
           T240.COVERAGE_END_5,                                         06390000
           T240.COVERAGE_START_6,                                       06400000
           T240.COVERAGE_END_6,                                         06410000
           T240.COVERAGE_START_7,                                       06420000
           T240.COVERAGE_END_7,                                         06430000
           T240.EFFECTIVE_DATE,                                         06440000
           T240.END_DATE,                                               06450000
           T190.CUSTOMER_NUMBER                                         06460000
    FROM RCBV0660_CCMS_OFF T660,                                        06470000
         RCBV0030_CONTRACT T030,                                        06480000
      /* RCBV0728_CCMS_CO  T728, */                        /* RB01320 */06490005
         RCBV0240_SERV_CTR T240,                                        06500000
         RCBV0190_HW_CUST  T190                                         06510000
        ,RCBV0728_CCMS_CO  T728                        /* SOC RB01320 */06520005
                                                                        06520103
   LEFT OUTER JOIN RCBV0125_DMMY_REAL T125                              06521000
     ON    T125.PRODUCT_TYPE            = T728.PRODUCT_TYPE             06522000
     AND   T125.DUMMY_ORIGIN            = T728.ORIGIN                   06523002
     AND   T125.DUMMY_SEQUENCE_NUM      = T728.SEQUENCE_NUMBER          06524002
     AND   T125.COUNTRY_NUMBER          = T728.COUNTRY_NUMBER           06525000
                                                       /* EOC RB01320 */06526005
    WHERE T660.COUNTRY_NUMBER           = :TB_RCBV660.COUNTRY_NUMBER    06530000
      AND T660.DELETE_IND               = :TB_RCBV660.DELETE_IND        06540000
      AND T660.SOURCE_TYPE_ID           = :TB_RCBV660.SOURCE_TYPE_ID    06550000
      AND T030.COUNTRY_NUMBER           = T660.COUNTRY_NUMBER           06560000
      AND T030.CONTRACT_NUMBER          = T240.CONTRACT_NUMBER          06570000
      AND T030.TYPE_OF_CONTRACT         = T660.CCMS_OFFERING_ID         06580000
      AND T728.COUNTRY_NUMBER           = T660.COUNTRY_NUMBER           06590000
      AND T728.SOURCE_TYPE_ID           = T660.SOURCE_TYPE_ID           06600000
      AND T660.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           06610000
      AND T728.PRODUCT_TYPE             = T240.PRODUCT_TYPE             06620000
                                                       /* SOC RB01320 */06620105
   /* AND T728.ORIGIN                   = T240.ORIGIN                   06620200
      AND T728.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER */       06620300
      AND ((T728.ORIGIN                 = T240.ORIGIN                   06630000
      AND T728.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER)         06640000
      OR (T125.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           06650000
      AND  T125.PRODUCT_TYPE            = T240.PRODUCT_TYPE             06660000
      AND (T125.REAL_SERIAL_NUMBER      = T240.ORIGIN||                 06661000
                                          T240.SEQUENCE_NUMBER)         06662000
      AND T125.DUMMY_ORIGIN             = T728.ORIGIN                   06670000
      AND T125.DUMMY_SEQUENCE_NUM       = T728.SEQUENCE_NUMBER))        06680000
                                                       /* EOC RB01320 */06681005
      AND T660.CPU_TYPE                 = T240.PRODUCT_TYPE             06690000
      AND T190.PRODUCT_TYPE             = T240.PRODUCT_TYPE             06700000
      AND T190.ORIGIN                   = T240.ORIGIN                   06710000
      AND T190.SEQUENCE_NUMBER          = T240.SEQUENCE_NUMBER          06720000
      AND T190.COUNTRY_NUMBER           = T240.COUNTRY_NUMBER           06730000
      AND T190.TYPE_OF_RELATION         = :TB_RCBV190.TYPE_OF_RELATION  06740000
      AND :WRK_RUN_DATE BETWEEN T240.EFFECTIVE_DATE AND                 06750000
                               T240.END_DATE                            06760000
      AND :WRK_RUN_DATE BETWEEN T190.EFFECTIVE_DATE AND                 06770000
                               T190.END_DATE                            06780000
    FOR FETCH ONLY                                                      06790000
 ;                                                                      06800000
                                                                        06810000
 /********************************************************************/ 06820000
 /*                                                                  */ 06830000
 /* CURSOR FOR SELECTING ALL EFFECTIVE CHANGED SHRINKWRAP CONTRACTS  */ 06840000
 /* IN PRIME INPUT MODE                                              */ 06850000
 /********************************************************************/ 06860000
 EXEC SQL                                                               06870000
    DECLARE CURS_SHRINK_PI                                              06880000
    CURSOR FOR                                                          06890000
    SELECT T241.PRODUCT_TYPE,                                           06900000
           T241.ORIGIN,                                                 06910000
           T241.SEQUENCE_NUMBER,                                        06920000
           T241.CONTRACT_NUMBER,                                        06930000
           T241.COVERAGE_START_1,                                       06940000
           T241.COVERAGE_END_1,                                         06950000
           T241.COVERAGE_START_2,                                       06960000
           T241.COVERAGE_END_2,                                         06970000
           T241.COVERAGE_START_3,                                       06980000
           T241.COVERAGE_END_3,                                         06990000
           T241.COVERAGE_START_4,                                       07000000
           T241.COVERAGE_END_4,                                         07010000
           T241.COVERAGE_START_5,                                       07020000
           T241.COVERAGE_END_5,                                         07030000
           T241.COVERAGE_START_6,                                       07040000
           T241.COVERAGE_END_6,                                         07050000
           T241.COVERAGE_START_7,                                       07060000
           T241.COVERAGE_END_7,                                         07070000
           T241.EFFECTIVE_DATE,                                         07080000
           T241.END_DATE,                                               07090000
           T241.SERVICE_LVL_CODE,                                       07100000
           T051.CUSTOMER_NUMBER,                                        07110000
           T051.CUSTOMER_NR_EXTEND,                                     07120000
           T051.SOURCE_INDICATOR                         /* RB01289 */  07130000
                                                                        07140000
    FROM RCBV0660_CCMS_OFF T660,                                        07150000
     /*  RCBV0728_CCMS_CO  T728,*/                         /* RB01320 */07160005
         RCBV0241_PI_CTR   T241,                                        07170000
         RCBV0051_PI_HW_PR T051                                         07180000
        ,RCBV0728_CCMS_CO  T728                        /* SOC RB01320 */07190005
                                                                        07190103
   LEFT OUTER JOIN RCBV0125_DMMY_REAL T125                              07191000
     ON    T125.PRODUCT_TYPE            = T728.PRODUCT_TYPE             07192000
     AND   T125.DUMMY_ORIGIN            = T728.ORIGIN                   07193002
     AND   T125.DUMMY_SEQUENCE_NUM      = T728.SEQUENCE_NUMBER          07194002
     AND   T125.COUNTRY_NUMBER          = T728.COUNTRY_NUMBER           07195000
                                                       /* EOC RB01320 */07196005
    WHERE T660.COUNTRY_NUMBER           = :TB_RCBV660.COUNTRY_NUMBER    07200000
      AND T660.DELETE_IND               = :TB_RCBV660.DELETE_IND        07210000
      AND T660.SOURCE_TYPE_ID           = :TB_RCBV660.SOURCE_TYPE_ID    07220000
      AND T728.COUNTRY_NUMBER           = T660.COUNTRY_NUMBER           07230000
      AND T728.SOURCE_TYPE_ID           = T660.SOURCE_TYPE_ID           07240000
      AND T728.COUNTRY_NUMBER           = T241.COUNTRY_NUMBER           07250000
      AND T728.PRODUCT_TYPE             = T241.PRODUCT_TYPE             07260000
                                                       /* SOC RB01320 */07260105
  /*  AND T728.ORIGIN                   = T241.ORIGIN                   07260200
      AND T728.SEQUENCE_NUMBER          = T241.SEQUENCE_NUMBER */       07260300
      AND ((T728.ORIGIN                 = T241.ORIGIN                   07270000
      AND T728.SEQUENCE_NUMBER          = T241.SEQUENCE_NUMBER)         07280000
      OR  (T125.COUNTRY_NUMBER          = T241.COUNTRY_NUMBER           07290000
      AND  T125.PRODUCT_TYPE            = T241.PRODUCT_TYPE             07300000
      AND (T125.REAL_SERIAL_NUMBER      = T241.ORIGIN||                 07301000
                                          T241.SEQUENCE_NUMBER)         07302000
      AND T125.DUMMY_ORIGIN             = T728.ORIGIN                   07310000
      AND T125.DUMMY_SEQUENCE_NUM       = T728.SEQUENCE_NUMBER))        07320000
                                                       /* EOC RB01320 */07321005
      AND T660.CCMS_OFFERING_ID         = T241.CONTRACT_NUMBER          07330000
      AND T051.COUNTRY_NUMBER           = T241.COUNTRY_NUMBER           07340000
      AND T051.PRODUCT_TYPE             = T241.PRODUCT_TYPE             07350000
      AND T051.ORIGIN                   = T241.ORIGIN                   07360000
      AND T051.SEQUENCE_NUMBER          = T241.SEQUENCE_NUMBER          07370000
      AND :WRK_RUN_DATE BETWEEN T241.EFFECTIVE_DATE AND                 07380000
                               T241.END_DATE                            07390000
    FOR FETCH ONLY                                                      07400000
 ;                                                                      07410000
                                                                        07420000
                                                                        07430000
 /********************************************************************/ 07440000
 /*                                                                  */ 07450000
 /* CURSOR FOR SELECTING ALL EFFECTIVE CHANGED LICENSES              */ 07460000
 /*                                                                  */ 07470000
 /********************************************************************/ 07480000
                                                      /* SOC PTM1273 */ 07490000
 EXEC SQL                                                               07500000
    DECLARE CURS_LICENSES                                               07510000
    CURSOR FOR                                                          07520000
    SELECT T200.PRODUCT_TYPE,                                           07530000
           T200.MODEL_NUMBER,                                           07540000
           T200.ORIGIN,                                                 07550000
           T200.SEQUENCE_NUMBER,                                        07560000
           T200.CUSTOMER_USER,                                          07570000
           T200.MARKETING_INSTDAT,                    /* CEDS00000311 */07580000
           T200.END_DATE                                                07590000
    FROM RCBV0728_CCMS_CO  T728,                                        07600000
         RCBV0200_SW_CUST  T200                                         07610000
    WHERE T728.COUNTRY_NUMBER           = :TB_RCBV200.COUNTRY_NUMBER    07620000
      AND T728.SOURCE_TYPE_ID           = :TB_RCBV728.SOURCE_TYPE_ID    07630000
      AND T728.PRODUCT_TYPE             = T200.PRODUCT_TYPE             07640000
      AND T728.ORIGIN                   = T200.ORIGIN                   07650000
      AND T728.SEQUENCE_NUMBER          = T200.SEQUENCE_NUMBER          07660000
      AND T728.MODEL_NUMBER             = T200.MODEL_NUMBER             07670000
      AND T728.COUNTRY_NUMBER           = T200.COUNTRY_NUMBER           07680000
      AND (:WRK_RUN_DATE BETWEEN T200.EFFECTIVE_DATE AND                07690000
                                 T200.END_DATE                          07700000
                                                /* SOC CEDS00000311 */  07710000
      OR   :WRK_RUN_DATE BETWEEN T200.MARKETING_INSTDAT AND             07720000
                                 T200.END_DATE)                         07730000
                                                /* EOC CEDS00000311 */  07740000
    FOR FETCH ONLY                                                      07750000
 ;                                                                      07760000
                                                      /* EOC PTM1273 */ 07770000
 /********************************************************************/ 07780000
 /*                                                                  */ 07790000
 /* CURSOR FOR SELECTING ALL ADDRESS LINES                           */ 07800000
 /*                                                                  */ 07810000
 /********************************************************************/ 07820000
 EXEC SQL                                                               07830000
    DECLARE CURS_ADDR_LINES                                             07840000
    CURSOR FOR                                                          07850000
    SELECT T280.TEXT,                                                   07860000
           T280.LINE_NUMBER                                             07870000
    FROM RCBV0280_ADDR_LINE  T280                                       07880000
    WHERE T280.COUNTRY_NUMBER           = :TB_RCBV280.COUNTRY_NUMBER    07890000
      AND T280.CUSTOMER_NUMBER          = :TB_RCBV280.CUSTOMER_NUMBER   07900000
      AND T280.ADDRESS_NUMBER           = :TB_RCBV280.ADDRESS_NUMBER    07910000
    ORDER BY LINE_NUMBER                                                07920000
    FOR FETCH ONLY                                                      07930000
 ;                                                                      07940000
1/********************************************************************/ 07950000
 /*                 S T A R T   P R O C E S S I N G                  */ 07960000
 /********************************************************************/ 07970000
                                                                        07980000
 CALL R900_INIT_PROGRAM;                                                07990000
 CALL R800_INIT_PROCESSING;                                             08000000
                                                                        08010000
 DO WHILE (WRK_CTRYNO_NO <= COUNTRY_AREA.COUNT_CTRY);        /* MCO */  08020000
                                                                        08030000
   CALL R700_INIT_COUNTRY;                                              08040000
                                                                        08050000
   TB_RCBV660                = '';                                      08080000
   TB_RCBV660.COUNTRY_NUMBER = WRK_CTRYNO;                              08090000
   TB_RCBV660.DELETE_IND     = 'N';                                     08100000
   CALL R017_CURSOR_SOURCE_ID(@OPEN); /* OPEN CURSOR                 */ 08110000
   CALL R017_CURSOR_SOURCE_ID(@FETCH);/* GET ALL UNIQUE SOURCE TYPES */ 08120000
                                                                        08130000
   DO WHILE(SQLCODE = 0);                                               08140000
     SELECT(TB_RCBV660.SOURCE_TYPE_ID);                                 08150000
       WHEN('A')                             /* RCBBLA0 RECORDS      */ 08160000
       DO;                                                              08170000
         CALL R002_RCBBLA0_CTRS;                                        08180000
       END;                                                             08190000
       WHEN('E')                             /* ESA/SSA RECORDS      */ 08200000
       DO;                                                              08210000
         CALL R003_ESASSA_CTRS;                                         08230000
       END;                                                             08240000
       WHEN('H')                             /* PSEUDO-HW RECORDS    */ 08250000
       DO;                                                              08260000
         CALL R004_PSEUDO_HW;                                           08280000
       END;                                                             08290000
       WHEN('L')                             /* LICENSES             */ 08300000
       DO;                                                              08310000
         CALL R005_LICENSES;                 /* GET ALL LICENSES     */ 08320000
       END;                                                             08330000
       WHEN('N')                             /* SHRINKWRAP (SOF/CHIS)*/ 08340000
       DO;                                                              08350000
         CALL R006_SHRINKWRAP_SOF;                                      08360000
       END;                                                             08370000
       WHEN('S')                             /* SHRINKWRAP (PRIME    */ 08380000
       DO;                                   /* INPUT)               */ 08390000
         CALL R007_SHRINKWRAP_PI;                                       08400000
       END;                                                             08410000
       WHEN('C')                             /* PROCESS CHIS (CCMS)  */ 08420000
       DO;                                   /* CONTRACTS            */ 08430000
         CALL R024_QCH0CMSO(@OPEN);          /* OPEN CHIS TABLE      */ 08440000
         CALL R024_QCH0CMSO(@FETCH);         /* FETCH FIRST CCMS-CO  */ 08450000
         DO WHILE(SQLCODE = 0);                                         08460000
           CALL R008_CHIS_CTRS;              /* HANDLE CHIS RECORDS  */ 08470000
           CALL R024_QCH0CMSO(@FETCH);       /* FETCH NEXT CHIS-ROW  */ 08480000
         END;                                                           08490000
         CALL R024_QCH0CMSO(@CLOSE);                                    08500000
       END;                                                             08510000
       OTHERWISE;                            /* NON CCMS SOURCE TYPE */ 08520000
     END;                                                               08530000
     CALL R017_CURSOR_SOURCE_ID(@FETCH);     /* GET NEXT SOURCE TYPE */ 08540000
   END;                                                                 08550000
   CALL R017_CURSOR_SOURCE_ID(@CLOSE);       /* CLOSE CURSOR         */ 08560000
   CALL R799_END_COUNTRY;                                               08570000
 END;                                                                   08580000
                                                                        08590000
 CALL R899_END_PROCESSING;                                              08600000
 CALL R999_END_PROGRAM;                                                 08610000
                                                                        08620000
1/********************************************************************/ 08630000
 /*                                                                  */ 08640000
 /* MODULE NAME      : R001_LOCK_TABLES                              */ 08650000
 /*                                                                  */ 08660000
 /* DESCRIPTION      :                                               */ 08670000
 /*                                                                  */ 08680000
 /********************************************************************/ 08690000
 R001_LOCK_TABLES: PROC;                                                08700000
                                                                        08710000
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 08720000
                                                                        08730000
 /********************************************************************/ 08740000
                                                                        08750000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0011_PI_CUST';                      08760000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08770000
                                                                        08780000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08790000
               PTR_RETURN_AREA_BB,                                      08800000
               PTR_INT_AREA);                                           08810000
                                                                        08820000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08830000
   WHEN (0);                                                            08840000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08850000
     DO;                                                                08860000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#002');                      08870000
     END;                                                               08880000
   OTHERWISE                                                            08890000
     DO;                                                                08900000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08910000
                                 'DB2',                                 08920000
                                 '#003');                               08930000
     END;                                                               08940000
 END;                                                                   08950000
                                                                        08960000
 /********************************************************************/ 08970000
                                                                        08980000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0030_CONTRACT';                     08990000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09000000
                                                                        09010000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09020000
               PTR_RETURN_AREA_BB,                                      09030000
               PTR_INT_AREA);                                           09040000
                                                                        09050000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09060000
   WHEN (0);                                                            09070000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09080000
     DO;                                                                09090000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#004');                      09100000
     END;                                                               09110000
   OTHERWISE                                                            09120000
     DO;                                                                09130000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09140000
                                 'DB2',                                 09150000
                                 '#005');                               09160000
     END;                                                               09170000
 END;                                                                   09180000
                                                                        09190000
 /********************************************************************/ 09200000
                                                                        09210000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0035_CUST_CTR';                     09220000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09230000
                                                                        09240000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09250000
               PTR_RETURN_AREA_BB,                                      09260000
               PTR_INT_AREA);                                           09270000
                                                                        09280000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09290000
   WHEN (0);                                                            09300000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09310000
     DO;                                                                09320000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#006');                      09330000
     END;                                                               09340000
   OTHERWISE                                                            09350000
     DO;                                                                09360000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09370000
                                 'DB2',                                 09380000
                                 '#007');                               09390000
     END;                                                               09400000
 END;                                                                   09410000
                                                                        09420000
 /********************************************************************/ 09430000
                                                                        09440000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0051_PI_HW_PR';                     09450000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09460000
                                                                        09470000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09480000
               PTR_RETURN_AREA_BB,                                      09490000
               PTR_INT_AREA);                                           09500000
                                                                        09510000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09520000
   WHEN (0);                                                            09530000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09540000
     DO;                                                                09550000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#008');                      09560000
     END;                                                               09570000
   OTHERWISE                                                            09580000
     DO;                                                                09590000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09600000
                                 'DB2',                                 09610000
                                 '#009');                               09620000
     END;                                                               09630000
 END;                                                                   09640000
                                                                        09650000
 /********************************************************************/ 09660000
                                                                        09670000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0075_SE_PO';                        09680000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09690000
                                                                        09700000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09710000
               PTR_RETURN_AREA_BB,                                      09720000
               PTR_INT_AREA);                                           09730000
                                                                        09740000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09750000
   WHEN (0);                                                            09760000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09770000
     DO;                                                                09780000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#010');                      09790000
     END;                                                               09800000
   OTHERWISE                                                            09810000
     DO;                                                                09820000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09830000
                                 'DB2',                                 09840000
                                 '#011');                               09850000
     END;                                                               09860000
 END;                                                                   09870000
                                                                        09880000
 /********************************************************************/ 09890000
                                                                        09900000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0150_CUST_ADDR';                    09910000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09920000
                                                                        09930000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09940000
               PTR_RETURN_AREA_BB,                                      09950000
               PTR_INT_AREA);                                           09960000
                                                                        09970000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09980000
   WHEN (0);                                                            09990000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10000000
     DO;                                                                10010000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#012');                      10020000
     END;                                                               10030000
   OTHERWISE                                                            10040000
     DO;                                                                10050000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10060000
                                 'DB2',                                 10070000
                                 '#013');                               10080000
     END;                                                               10090000
 END;                                                                   10100000
                                                                        10110000
 /********************************************************************/ 10120000
                                                      /* SOC RB01320 */ 10130005
 PARM_RCB024M.VIEW_NAME      = 'RCBT0125_DMMY_REAL';                    10140000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10150000
                                                                        10160000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10170000
               PTR_RETURN_AREA_BB,                                      10180000
               PTR_INT_AREA);                                           10190000
                                                                        10200000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10210000
   WHEN (0);                                                            10220000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10230000
     DO;                                                                10240000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#012');                      10250000
     END;                                                               10260000
   OTHERWISE                                                            10270000
     DO;                                                                10280000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10290000
                                 'DB2',                                 10300000
                                 '#013');                               10310000
     END;                                                               10320000
 END;                                                                   10330000
                                                      /* EOC RB01320 */ 10340005
                                                                        10350000
 /********************************************************************/ 10360000
                                                                        10370000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      10380000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10390000
                                                                        10400000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10410000
               PTR_RETURN_AREA_BB,                                      10420000
               PTR_INT_AREA);                                           10430000
                                                                        10440000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10450000
   WHEN (0);                                                            10460000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10470000
     DO;                                                                10480000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#014');                      10490000
     END;                                                               10500000
   OTHERWISE                                                            10510000
     DO;                                                                10520000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10530000
                                 'DB2',                                 10540000
                                 '#015');                               10550000
     END;                                                               10560000
 END;                                                                   10570000
                                                                        10580000
 /********************************************************************/ 10590000
                                                                        10600000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0200_SW_CUST';                      10610000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10620000
                                                                        10630000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10640000
               PTR_RETURN_AREA_BB,                                      10650000
               PTR_INT_AREA);                                           10660000
                                                                        10670000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10680000
   WHEN (0);                                                            10690000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10700000
     DO;                                                                10710000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#016');                      10720000
     END;                                                               10730000
   OTHERWISE                                                            10740000
     DO;                                                                10750000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10760000
                                 'DB2',                                 10770000
                                 '#017');                               10780000
     END;                                                               10790000
 END;                                                                   10800000
                                                                        10810000
 /********************************************************************/ 10820000
                                                                        10830000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0210_ADD_SERV';                     10840000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10850000
                                                                        10860000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10870000
               PTR_RETURN_AREA_BB,                                      10880000
               PTR_INT_AREA);                                           10890000
                                                                        10900000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10910000
   WHEN (0);                                                            10920000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10930000
     DO;                                                                10940000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#018');                      10950000
     END;                                                               10960000
   OTHERWISE                                                            10970000
     DO;                                                                10980000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10990000
                                 'DB2',                                 11000000
                                 '#019');                               11010000
     END;                                                               11020000
 END;                                                                   11030000
                                                                        11040000
 /********************************************************************/ 11050000
                                                                        11060000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0240_SERV_CTR';                     11070000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11080000
                                                                        11090000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11100000
               PTR_RETURN_AREA_BB,                                      11110000
               PTR_INT_AREA);                                           11120000
                                                                        11130000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11140000
   WHEN (0);                                                            11150000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11160000
     DO;                                                                11170000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#020');                      11180000
     END;                                                               11190000
   OTHERWISE                                                            11200000
     DO;                                                                11210000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11220000
                                 'DB2',                                 11230000
                                 '#021');                               11240000
     END;                                                               11250000
 END;                                                                   11260000
                                                                        11270000
 /********************************************************************/ 11280000
                                                                        11290000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0241_PI_CTR';                       11300000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11310000
                                                                        11320000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11330000
               PTR_RETURN_AREA_BB,                                      11340000
               PTR_INT_AREA);                                           11350000
                                                                        11360000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11370000
   WHEN (0);                                                            11380000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11390000
     DO;                                                                11400000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#022');                      11410000
     END;                                                               11420000
   OTHERWISE                                                            11430000
     DO;                                                                11440000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11450000
                                 'DB2',                                 11460000
                                 '#023');                               11470000
     END;                                                               11480000
 END;                                                                   11490000
                                                                        11500000
 /********************************************************************/ 11510000
                                                                        11520000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0280_ADDR_LINE';                    11530000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11540000
                                                                        11550000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11560000
               PTR_RETURN_AREA_BB,                                      11570000
               PTR_INT_AREA);                                           11580000
                                                                        11590000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11600000
   WHEN (0);                                                            11610000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11620000
     DO;                                                                11630000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#024');                      11640000
     END;                                                               11650000
   OTHERWISE                                                            11660000
     DO;                                                                11670000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11680000
                                 'DB2',                                 11690000
                                 '#025');                               11700000
     END;                                                               11710000
 END;                                                                   11720000
                                                                        11730000
 /********************************************************************/ 11740000
                                                                        11750000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0300_HW_REAL';                      11760000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11770000
                                                                        11780000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11790000
               PTR_RETURN_AREA_BB,                                      11800000
               PTR_INT_AREA);                                           11810000
                                                                        11820000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11830000
   WHEN (0);                                                            11840000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11850000
     DO;                                                                11860000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#026');                      11870000
     END;                                                               11880000
   OTHERWISE                                                            11890000
     DO;                                                                11900000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11910000
                                 'DB2',                                 11920000
                                 '#027');                               11930000
     END;                                                               11940000
 END;                                                                   11950000
                                                                        11960000
 /********************************************************************/ 11970000
                                                                        11980000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0320_SW_ON_HW';                     11990000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12000000
                                                                        12010000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12020000
               PTR_RETURN_AREA_BB,                                      12030000
               PTR_INT_AREA);                                           12040000
                                                                        12050000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12060000
   WHEN (0);                                                            12070000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12080000
     DO;                                                                12090000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#028');                      12100000
     END;                                                               12110000
   OTHERWISE                                                            12120000
     DO;                                                                12130000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12140000
                                 'DB2',                                 12150000
                                 '#029');                               12160000
     END;                                                               12170000
 END;                                                                   12180000
                                                                        12190000
 /********************************************************************/ 12200000
                                                                        12210000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0340_HW_ADDR';                      12220000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12230000
                                                                        12240000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12250000
               PTR_RETURN_AREA_BB,                                      12260000
               PTR_INT_AREA);                                           12270000
                                                                        12280000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12290000
   WHEN (0);                                                            12300000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12310000
     DO;                                                                12320000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#030');                      12330000
     END;                                                               12340000
   OTHERWISE                                                            12350000
     DO;                                                                12360000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12370000
                                 'DB2',                                 12380000
                                 '#031');                               12390000
     END;                                                               12400000
 END;                                                                   12410000
                                                                        12420000
 /********************************************************************/ 12430000
                                                                        12440000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0660_CCMS_OFF';                     12450000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12460000
                                                                        12470000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12480000
               PTR_RETURN_AREA_BB,                                      12490000
               PTR_INT_AREA);                                           12500000
                                                                        12510000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12520000
   WHEN (0);                                                            12530000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12540000
     DO;                                                                12550000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#032');                      12560000
     END;                                                               12570000
   OTHERWISE                                                            12580000
     DO;                                                                12590000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12600000
                                 'DB2',                                 12610000
                                 '#033');                               12620000
     END;                                                               12630000
 END;                                                                   12640000
                                                                        12650000
 /********************************************************************/ 12660000
                                                                        12670000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0670_CCMS_KEYS';                    12680000
 PARM_RCB024M.LOCK_MODE      = 'E';                /* EXCLUSIVE MODE */ 12690000
                                                                        12700000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12710000
               PTR_RETURN_AREA_BB,                                      12720000
               PTR_INT_AREA);                                           12730000
                                                                        12740000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12750000
   WHEN (0);                                                            12760000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12770000
     DO;                                                                12780000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#034');                      12790000
     END;                                                               12800000
   OTHERWISE                                                            12810000
     DO;                                                                12820000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12830000
                                 'DB2',                                 12840000
                                 '#035');                               12850000
     END;                                                               12860000
 END;                                                                   12870000
                                                                        12880000
 /********************************************************************/ 12890000
                                                                        12900000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0728_CCMS_CO';                      12910000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12920000
                                                                        12930000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12940000
               PTR_RETURN_AREA_BB,                                      12950000
               PTR_INT_AREA);                                           12960000
                                                                        12970000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12980000
   WHEN (0);                                                            12990000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 13000000
     DO;                                                                13010000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#036');                      13020000
     END;                                                               13030000
   OTHERWISE                                                            13040000
     DO;                                                                13050000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            13060000
                                 'DB2',                                 13070000
                                 '#037');                               13080000
     END;                                                               13090000
 END;                                                 /* EOC RC01219 */ 13100000
                                                                        13110000
 END R001_LOCK_TABLES;                                                  13120000
                                                                        13130000
1/********************************************************************/ 13140000
 /*                                                                  */ 13150000
 /* MODULE NAME      : R002_RCBBLA0_CTRS                             */ 13160000
 /*                                                                  */ 13170000
 /* DESCRIPTION      : HANDLE RCBBLA0 CONTRACT ITEMS                 */ 13180000
 /* - RETRIEVE CONTRACT FROM TABLE RCBT0210_ADD_SERV AND MEASUREMENT */ 13190000
 /*   UNIT FROM TABLE RCBT0075_SE_PO                                 */ 13200000
 /* - RETRIEVE THE CCMS EXTERNAL KEY FROM TABLE RCBT0670_CCMS_KEYS,  */ 13210000
 /*   OR INSERT A NEW ONE IF NOT PRESENT.                            */ 13220000
 /* - CONSTRUCT & WRITE CONTRACT RECORD TO RCBDSB1                   */ 13230000
 /********************************************************************/ 13240000
 R002_RCBBLA0_CTRS: PROC;                                               13250000
                                                                        13260000
   TB_RCBV660 = '';                                                     13270000
   TB_RCBV728 = '';                                                     13280000
   TB_RCBV210 = '';                                                     13290000
   TB_RCBV075 = '';                                                     13300000
                                                                        13310000
   TB_RCBV660.COUNTRY_NUMBER = WRK_CTRYNO;                              13320000
   TB_RCBV660.DELETE_IND     = 'N';                                     13330000
   TB_RCBV660.SOURCE_TYPE_ID = 'A';                                     13340000
   TB_RCBV728.SOURCE_TYPE_ID = 'A';                                     13350000
   TB_RCBV210.COUNTRY_NUMBER = WRK_CTRYNO;                              13360000
   TB_RCBV728.COUNTRY_NUMBER = WRK_CTRYNO;                              13370000
   TB_RCBV075.COUNTRY_NUMBER = WRK_CTRYNO;                              13380000
                                                                        13390000
   CALL R010_CURSOR_RCBBLA0(@OPEN);                                     13400000
   CALL R010_CURSOR_RCBBLA0(@FETCH);                                    13410000
                                                                        13420000
   DO WHILE(SQLCODE = 0);                                               13430000
     FILE_RCBDSB1 = '';                                                 13440000
     FILE_RCBDSB1.COUNTRY_NUMBER  = WRK_CTRYNO;                         13450000
     FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV210.CUSTOMER_NUMBER;         13460000
     FILE_RCBDSB1.PRODUCT_DEF_ID  = TB_RCBV210.SERVICE_NUMBER;          13470000
     FILE_RCBDSB1.CONTRACT_NUMBER = 'A' || WRK_CTRYNO ||                13480000
                                    TB_RCBV210.CONTRACT_NUMBER;         13490000
     FILE_RCBDSB1.BALANCE         = TB_RCBV210.QTY_MU_CONTRACTED -      13500000
                                    TB_RCBV210.QTY_MU_ACCOMPLISH;       13510000
     FILE_RCBDSB1.START_DATE      = TB_RCBV210.EFFECTIVE_DATE;          13520000
     FILE_RCBDSB1.END_DATE        = TB_RCBV210.END_DATE;                13530000
                                                                        13540000
     FILE_RCBDSB1.HOURS_FROM(1)   =                                     13550000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_START_7);      13560000
     FILE_RCBDSB1.HOURS_TO(1)     =                                     13570000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_END_7);        13580000
     FILE_RCBDSB1.HOURS_FROM(2)   =                                     13590000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_START_1);      13600000
     FILE_RCBDSB1.HOURS_TO(2)     =                                     13610000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_END_1);        13620000
     FILE_RCBDSB1.HOURS_FROM(3)   =                                     13630000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_START_2);      13640000
     FILE_RCBDSB1.HOURS_TO(3)     =                                     13650000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_END_2);        13660000
     FILE_RCBDSB1.HOURS_FROM(4)   =                                     13670000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_START_3);      13680000
     FILE_RCBDSB1.HOURS_TO(4)     =                                     13690000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_END_3);        13700000
     FILE_RCBDSB1.HOURS_FROM(5)   =                                     13710000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_START_4);      13720000
     FILE_RCBDSB1.HOURS_TO(5)     =                                     13730000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_END_4);        13740000
     FILE_RCBDSB1.HOURS_FROM(6)   =                                     13750000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_START_5);      13760000
     FILE_RCBDSB1.HOURS_TO(6)     =                                     13770000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_END_5);        13780000
     FILE_RCBDSB1.HOURS_FROM(7)   =                                     13790000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_START_6);      13800000
     FILE_RCBDSB1.HOURS_TO(7)     =                                     13810000
                R037_ISOTIME2MINUTES(TB_RCBV210.COVERAGE_END_6);        13820000
                                                                        13830000
     FILE_RCBDSB1.BALANCE_UNITS = TB_RCBV075.MEASUREMENT_UNIT;          13840000
                                                                        13850000
     /* DETERMINE UNIQUE KEY AND EXTERNAL KEY                       */  13860000
     FILE_RCBDSB1.KEY.COUNTRY_NUMBER = WRK_CTRYNO;                      13870000
     FILE_RCBDSB1.KEY.SOURCE_ID   = 'A';                                13880000
     FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV210.CONTRACT_NUMBER ||       13890000
                                    TB_RCBV210.CUSTOMER_NUMBER ||       13900000
                                    TB_RCBV210.SERVICE_NUMBER  ||       13910000
                                    TB_RCBV210.GROUP_ID;                13920000
     WRK_CEDS_LONG_KEY            = '';                                 13930000
     WRK_CEDS_LONG_KEY            = FILE_RCBDSB1.KEY.UNIQUE_KEY;        13940000
                                                                        13950000
     WRK_MAX_KEY                  = PARM_RCB027.MAX_KEY_LA0;            13960000
     CALL R038_DETERMINE_SEQ_NR_KEY;                                    13970000
     PARM_RCB027.MAX_KEY_LA0      = WRK_MAX_KEY;                        13980000
                                                                        13990000
     FILE_RCBDSB1.EXTERNAL_KEY    = 'A' || WRK_CTRYNO ||                14000000
                                    WRK_SEQ_NR_KEY;                     14010000
                                                                        14020000
     CALL R705_WRITE_RCBDSB1_RECORD;                                    14030000
                                                                        14040000
     CALL R010_CURSOR_RCBBLA0(@FETCH);                                  14050000
   END;                                                                 14060000
                                                                        14070000
   CALL R010_CURSOR_RCBBLA0(@CLOSE);                                    14080000
                                                                        14090000
 END R002_RCBBLA0_CTRS;                                                 14100000
1/********************************************************************/ 14110000
 /*                                                                  */ 14120000
 /* MODULE NAME      : R003_ESASSA_CTRS                              */ 14130000
 /*                                                                  */ 14140000
 /* DESCRIPTION      : HANDLE ESA/SSA CONTRACT ITEMS                 */ 14150000
 /* - RETRIEVE CONTRACT FROM TABLE RCBT0240_SERV_CTR AND             */ 14160000
 /*   RETRIEVE CUSTOMERNUMBER FROM TABLE RCBT0190_HW_CUST            */ 14170000
 /*   IF NO CURRENT CONTRACT FOR A CERTAIN KEY CAN BE FOUND THE      */ 14180000
 /*   FIRST FUTURE CONTRACT WILL BE TAKEN, IF ANY.                   */ 14190000
 /*   THROUGH NOT HANDLING ANY CONTRACT FOR THE SAME TOS AS BEFORE,  */ 14200000
 /*   DOUBLE TOS'SES ARE AVOIDED                                     */ 14210000
 /* - IF FUTURE CONTRACT, RETRIEVE MARKETING INSTALLATION DATE TOO   */ 14220000
 /* - RETRIEVE INSTALLATION ADDRESS                                  */ 14230000
 /* - FORMAT INSTALLATION ADDRESS VIA USEREXIT RCBDS4U               */ 14240000
 /* - CONSTRUCT & WRITE CONTRACT RECORD TO RCBDSB1                   */ 14250000
 /********************************************************************/ 14260000
 R003_ESASSA_CTRS: PROC;                                                14270000
                                                                        14280000
   TB_RCBV728 = '';                                                     14290000
   TB_RCBV240 = '';                                                     14300000
   TB_RCBV190 = '';                                                     14310000
   TB_RCBV035 = '';                                                     14320000
                                                                        14330000
   TB_RCBV728.COUNTRY_NUMBER   = WRK_CTRYNO;                            14340000
   TB_RCBV728.SOURCE_TYPE_ID   = 'E';                                   14350000
   TB_RCBV240.COUNTRY_NUMBER   = WRK_CTRYNO;                            14360000
   TB_RCBV190.COUNTRY_NUMBER   = WRK_CTRYNO;                            14370000
   TB_RCBV190.TYPE_OF_RELATION = 'U';                                   14380000
   TB_RCBV035.COUNTRY_NUMBER   = WRK_CTRYNO;                            14390000
   TB_RCBV035.SA_CONTRACT_IND  = 'Y';                                   14400000
                                                                        14410000
   WRK_KEY_CURRENT = '';                                                14440000
   CALL R016_CURSOR_ESA_SSA(@OPEN);             /* SELECT CURRENT    */ 14450000
   CALL R016_CURSOR_ESA_SSA(@FETCH);            /*   AND FUTURE      */ 14460000
                                                                        14470000
   DO WHILE(WRK_SQLCODE_CURRENT = 0 );                                  14480000
     CALL R035_FILL_RCBDSB1;                                            14500000
     IF TB_RCBV190.MARKETING_INSTDAT > ''      &                        14510000
        TB_RCBV240.EFFECTIVE_DATE > WRK_RUN_DATE                        14520000
     THEN DO;                                                           14530000
       FILE_RCBDSB1.START_DATE = TB_RCBV190.MARKETING_INSTDAT;          14540000
     END;                                                               14550000
                                                                        14560000
     IF SWITCH_USER_EXIT_4 = TRUE                                       14570000
     THEN DO;                                                           14580000
       CALL R028_USEREXIT_RCBDS4U;                                      14590000
     END;                                                               14600000
                                                                        14610000
     CALL R705_WRITE_RCBDSB1_RECORD;                                    14620000
     CALL R016_CURSOR_ESA_SSA(@FETCH);          /* CURRENT RECORDS   */ 14640000
   END;                                                                 14650000
                                                                        14660000
   CALL R016_CURSOR_ESA_SSA(@CLOSE);                                    14670000
                                                                        14680000
 END R003_ESASSA_CTRS;                                                  14690000
1/********************************************************************/ 14700000
 /*                                                                  */ 14710000
 /* MODULE NAME      : R004_PSEUDO_HW                                */ 14720000
 /*                                                                  */ 14730000
 /* DESCRIPTION      : HANDLE PSEUDO-HW CONTRACTS                    */ 14740000
 /* - RETRIEVE CONTRACT FROM TABLE RCBT0240_SERV_CTR                 */ 14750000
 /* - RETRIEVE CUSTOMERNUMBER FROM TABLE RCBT0150_CUST_ADDR AND      */ 14760000
 /*   TABLE RCBT0280_ADDR_LINE                                       */ 14770000
 /* - RETRIEVE INSTALLATION ADDRESS AND FORMAT IT VIA USEREXIT       */ 14780000
 /*   RCBDS4U                                                        */ 14790000
 /* - CONSTRUCT & WRITE CONTRACT RECORD TO RCBDSB1                   */ 14800000
 /********************************************************************/ 14810000
 R004_PSEUDO_HW: PROC;                                                  14820000
                                                                        14830000
   TB_RCBV660 = '';                                                     14840000
   TB_RCBV728 = '';                                                     14850000
   TB_RCBV240 = '';                                                     14860000
   TB_RCBV300 = '';                                                     14870000
   TB_RCBV190 = '';                                                     14880000
                                                                        14890000
   TB_RCBV660.COUNTRY_NUMBER   = WRK_CTRYNO;                            14900000
   TB_RCBV660.DELETE_IND       = 'N';                                   14910000
   TB_RCBV660.SOURCE_TYPE_ID   = 'H';                                   14920000
   TB_RCBV728.SOURCE_TYPE_ID   = 'H';                                   14930000
   TB_RCBV728.COUNTRY_NUMBER   = WRK_CTRYNO;                            14940000
   TB_RCBV240.COUNTRY_NUMBER   = WRK_CTRYNO;                            14950000
   TB_RCBV300.COUNTRY_NUMBER   = WRK_CTRYNO;                            14960000
   TB_RCBV190.COUNTRY_NUMBER   = WRK_CTRYNO;                            14970000
   TB_RCBV190.TYPE_OF_RELATION = 'U';                                   14980000
                                                                        14990000
   CALL R011_CURSOR_PSEUDO_HW(@OPEN);                                   15000000
   CALL R011_CURSOR_PSEUDO_HW(@FETCH);                                  15010000
                                                                        15020000
                                                                        15022000
   DO WHILE(SQLCODE = 0);                                               15030000
                                                       /* SOC RB01320 */15032005
      WRK_PRODUCT_TYPE  = TB_RCBV240.PRODUCT_TYPE;                      15040100
      WRK_SERIAL_NUMBER = TB_RCBV240.ORIGIN||                           15040200
                          TB_RCBV240.SEQUENCE_NUMBER;                   15040300
                                                                        15040400
      CALL R029_T125_RETRIEVE;                                          15040500
                                                       /* EOC RB01320 */15040605
     FILE_RCBDSB1 = '';                                                 15050000
     FILE_RCBDSB1.KEY.COUNTRY_NUMBER = WRK_CTRYNO;                      15060000
     FILE_RCBDSB1.KEY.SOURCE_ID   = 'H';                                15070000
                                                                        15071000
     IF ¬ SWITCH_LONG_SER THEN                         /* SOC RB01320 */15080005
     DO;                                               /* EOC RB01320 */15090005
     FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV240.PRODUCT_TYPE    ||       15110000
                                    TB_RCBV240.ORIGIN          ||       15120000
                                    TB_RCBV240.SEQUENCE_NUMBER;         15130000
     END;                                              /* SOC RB01320 */15140005
     ELSE                                                               15150000
     DO;                                                                15160000
        FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV125.PRODUCT_TYPE    ||    15180000
                                       TB_RCBV125.DUMMY_ORIGIN    ||    15190000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   15200000
     END;                                              /* EOC RB01320 */15220005
                                                                        15221000
     FILE_RCBDSB1.COUNTRY_NUMBER  = WRK_CTRYNO;                         15230000
     FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;         15240000
     FILE_RCBDSB1.PRODUCT_DEF_ID  = TB_RCBV240.PRODUCT_TYPE ||          15250000
                                    TB_RCBV300.MODEL_NUMBER;            15260000
     FILE_RCBDSB1.CONTRACT_NUMBER = 'H' || WRK_CTRYNO ||                15270000
                                    TB_RCBV240.CONTRACT_NUMBER;         15280000
     FILE_RCBDSB1.START_DATE      = TB_RCBV240.EFFECTIVE_DATE;          15290000
     FILE_RCBDSB1.END_DATE        = TB_RCBV240.END_DATE;                15300000
                                                                        15301000
     IF ¬ SWITCH_LONG_SER THEN                         /* SOC RB01320 */15310005
     DO;                                               /* EOC RB01320 */15320005
     FILE_RCBDSB1.EXTERNAL_KEY    = 'H' || WRK_CTRYNO       ||          15340000
                                    TB_RCBV240.PRODUCT_TYPE ||          15350000
                                    TB_RCBV240.ORIGIN       ||          15360000
                                    TB_RCBV240.SEQUENCE_NUMBER;         15370000
     END;                                              /* SOC RB01320 */15380005
     ELSE                                                               15390000
     DO;                                                                15400000
        FILE_RCBDSB1.EXTERNAL_KEY    = 'H' || WRK_CTRYNO       ||       15420000
                                       TB_RCBV125.PRODUCT_TYPE ||       15430000
                                       TB_RCBV125.DUMMY_ORIGIN ||       15440000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   15450000
     END;                                              /* EOC RB01320 */15470005
                                                                        15471000
     FILE_RCBDSB1.HOURS_FROM(1)   =                                     15480000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_7);      15490000
     FILE_RCBDSB1.HOURS_TO(1)     =                                     15500000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_7);        15510000
     FILE_RCBDSB1.HOURS_FROM(2)   =                                     15520000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_1);      15530000
     FILE_RCBDSB1.HOURS_TO(2)     =                                     15540000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_1);        15550000
     FILE_RCBDSB1.HOURS_FROM(3)   =                                     15560000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_2);      15570000
     FILE_RCBDSB1.HOURS_TO(3)     =                                     15580000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_2);        15590000
     FILE_RCBDSB1.HOURS_FROM(4)   =                                     15600000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_3);      15610000
     FILE_RCBDSB1.HOURS_TO(4)     =                                     15620000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_3);        15630000
     FILE_RCBDSB1.HOURS_FROM(5)   =                                     15640000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_4);      15650000
     FILE_RCBDSB1.HOURS_TO(5)     =                                     15660000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_4);        15670000
     FILE_RCBDSB1.HOURS_FROM(6)   =                                     15680000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_5);      15690000
     FILE_RCBDSB1.HOURS_TO(6)     =                                     15700000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_5);        15710000
     FILE_RCBDSB1.HOURS_FROM(7)   =                                     15720000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_6);      15730000
     FILE_RCBDSB1.HOURS_TO(7)     =                                     15740000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_6);        15750000
                                                                        15760000
     IF ¬ SWITCH_LONG_SER THEN                       /* SOC RB01320 */  15770005
     DO;                                             /* EOC RB01320 */  15780005
     FILE_RCBDSB1.CPU             = TB_RCBV240.PRODUCT_TYPE  ||         15790000
                                    TB_RCBV240.ORIGIN        ||         15800000
                                    TB_RCBV240.SEQUENCE_NUMBER;         15810000
     END;                                            /* SOC RB01320 */  15830005
     ELSE                                                               15840000
     DO;                                                                15850000
        FILE_RCBDSB1.CPU             = TB_RCBV125.PRODUCT_TYPE  ||      15870000
                                       TB_RCBV125.DUMMY_ORIGIN  ||      15880000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   15890000
     END;                                            /* EOC RB01320 */  15910005
                                                                        15920000
     TB_RCBV150        = '';                                            15930000
     WRK_ADDRESS_LINES = '';                                            15940000
     TB_RCBV150.COUNTRY_NUMBER  = WRK_CTRYNO;                           15950000
     TB_RCBV150.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;           15960000
                                                                        15970000
     CALL R022_SELECT_RCBV0150;                                         15980000
                                                                        15990000
     IF SQLCODE = 0                                                     16000000
     THEN DO;                                                           16010000
       FILE_RCBDSB1.ZIP_CODE      = TB_RCBV150.ZIP_CODE;                16020000
       TB_RCBV280 = '';                                                 16030000
       TB_RCBV280.COUNTRY_NUMBER  = WRK_CTRYNO;                         16040000
       TB_RCBV280.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;         16050000
       TB_RCBV280.ADDRESS_NUMBER  = TB_RCBV150.ADDRESS_NUMBER;          16060000
                                                                        16070000
       CALL R014_ADDRESS_LINES(@OPEN);                                  16080000
       CALL R014_ADDRESS_LINES(@FETCH);                                 16090000
       DO I = 1 TO 9 WHILE(SQLCODE = 0);                                16100000
         WRK_ADDRESS_LINES.LINE(I) = TB_RCBV280.TEXT;                   16110000
         CALL R014_ADDRESS_LINES(@FETCH);                               16120000
       END;                                                             16130000
       CALL R014_ADDRESS_LINES(@CLOSE);                                 16140000
                                                                        16150000
       DO I = 1 TO 5;                                                   16160000
         FILE_RCBDSB1.ADDRESS_LINES(I) = WRK_ADDRESS_LINES.LINE(I);     16170000
       END;                                                             16180000
     END;                                                               16190000
                                                                        16200000
     IF SWITCH_USER_EXIT_4 = TRUE                                       16210000
     THEN DO;                                                           16220000
       CALL R028_USEREXIT_RCBDS4U;                                      16230000
     END;                                                               16240000
                                                                        16250000
                                                                        16260000
     CALL R705_WRITE_RCBDSB1_RECORD;                                    16280000
                                                                        16290000
     CALL R011_CURSOR_PSEUDO_HW(@FETCH);                                16300000
   END;                                                                 16310000
                                                                        16320000
   CALL R011_CURSOR_PSEUDO_HW(@CLOSE);                                  16330000
                                                                        16340000
 END R004_PSEUDO_HW;                                                    16350000
1/********************************************************************/ 16360000
 /*                                                                  */ 16370000
 /* MODULE NAME      : R005_LICENSES                                 */ 16380000
 /*                                                                  */ 16390000
 /* DESCRIPTION      : HANDLE LICENSES (INCLUDING TIVOLI)            */ 16400000
 /* - RETRIEVE LICENSES FROM TABLE RCBT0200_SW_CUST                  */ 16410000
 /* - RETRIEVE HARDWARE TOS FROM TABLE RCBT0320_SW_ON_HW             */ 16420000
 /* - RETRIEVE INSTALLATION ADDRESS AND FORMAT IT VIA USEREXIT       */ 16430000
 /*   RCBDS4U                                                        */ 16440000
 /*   - IF THE ADDRESS RESOLUTION FROM PARAMETER RCB005 IS EQUAL TO  */ 16450000
 /*     '1' THE ADDRESS MUST BE DETERMINED VIA TABLE RCBT0340.       */ 16460000
 /*   - IF THE ADDRESS RESOLUTION FROM PARAMETER RCB005 IS EQUAL TO  */ 16470000
 /*     '0' OR NO ADDRESS COULD BE DETERMINED VIA TABLE RCBT0340     */ 16480000
 /*     THE ADDRESS MUST BE DETERMINED VIA TABLE RCBT0150.           */ 16490000
 /*   THE ADDRESS IS DERIVED FROM TABLE RCBT0280. BECAUSE TABLE      */ 16500000
 /*   RCBT0280 CAN CONTAIN 9 ADDRESS LINES AND THE CCMS INTERFACE    */ 16510000
 /*   CAN ONLY HAVE 5 ADDRESS LINES, USER EXIT RCBDS4U IS CALLED     */ 16520000
 /*   TO SELECT THE 5 CORRECT ADDRESS LINES.                         */ 16530000
 /* - CONSTRUCT & WRITE CONTRACT RECORD TO RCBDSB1                   */ 16540000
 /********************************************************************/ 16550000
 R005_LICENSES: PROC;                                                   16560000
                                                                        16570000
   TB_RCBV728 = '';                                                     16580000
   TB_RCBV200 = '';                                                     16590000
                                                                        16600000
   TB_RCBV728.COUNTRY_NUMBER = WRK_CTRYNO;                              16610000
   TB_RCBV728.SOURCE_TYPE_ID = 'L';                                     16620000
   TB_RCBV200.COUNTRY_NUMBER = WRK_CTRYNO;                              16630000
                                                                        16640000
   CALL R015_CURSOR_LICENSES(@OPEN);                                    16650000
   CALL R015_CURSOR_LICENSES(@FETCH);                                   16660000
                                                                        16670000
   DO WHILE(SQLCODE = 0);                                               16680000
     FILE_RCBDSB1 = '';                                                 16690000
     FILE_RCBDSB1.KEY.COUNTRY_NUMBER = WRK_CTRYNO;                      16700000
     FILE_RCBDSB1.KEY.SOURCE_ID   = 'L';                                16710000
     FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV200.PRODUCT_TYPE    ||       16720000
                                    TB_RCBV200.ORIGIN          ||       16730000
                                    TB_RCBV200.SEQUENCE_NUMBER ||       16740000
                                    TB_RCBV200.MODEL_NUMBER;            16750000
     FILE_RCBDSB1.COUNTRY_NUMBER  = WRK_CTRYNO;                         16760000
     FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV200.CUSTOMER_USER;           16770000
     FILE_RCBDSB1.PRODUCT_DEF_ID  = TB_RCBV200.PRODUCT_TYPE ||          16780000
                                    TB_RCBV200.MODEL_NUMBER;            16790000
     FILE_RCBDSB1.CONTRACT_NUMBER = 'L' || WRK_CTRYNO       ||          16800000
                                    TB_RCBV200.PRODUCT_TYPE ||          16810000
                                    TB_RCBV200.MODEL_NUMBER ||          16820000
                                    TB_RCBV200.ORIGIN       ||          16830000
                                    TB_RCBV200.SEQUENCE_NUMBER;         16840000
                                                  /* SOC CEDS00000311 */16850000
     FILE_RCBDSB1.START_DATE      = TB_RCBV200.MARKETING_INSTDAT;       16860000
                                                  /* EOC CEDS00000311 */16870000
     FILE_RCBDSB1.END_DATE        = TB_RCBV200.END_DATE;                16880000
     FILE_RCBDSB1.EXTERNAL_KEY    = 'L' || WRK_CTRYNO       ||          16890000
                                    TB_RCBV200.PRODUCT_TYPE ||          16900000
                                    TB_RCBV200.MODEL_NUMBER ||          16910000
                                    TB_RCBV200.ORIGIN       ||          16920000
                                    TB_RCBV200.SEQUENCE_NUMBER;         16930000
                                                                        16940000
     WRK_ADDRESS_NUMBER   = '';                                         16950000
     WRK_ADDRESS_LINES    = '';                                         16960000
     TB_RCBV320           = '';                                         16970000
                                                                        16980000
     TB_RCBV320.COUNTRY_NUMBER     = WRK_CTRYNO;                        16990000
     TB_RCBV320.PRODUCT_TYPE_SW    = TB_RCBV200.PRODUCT_TYPE;           17000000
     TB_RCBV320.MODEL_NUMBER_SW    = TB_RCBV200.MODEL_NUMBER;           17010000
     TB_RCBV320.ORIGIN_SW          = TB_RCBV200.ORIGIN;                 17020000
     TB_RCBV320.SEQUENCE_NUMBER_SW = TB_RCBV200.SEQUENCE_NUMBER;        17030000
                                                                        17040000
     CALL R023_SELECT_RCBV0320;                                         17050000
                                                                        17060000
     IF SQLCODE = 0                                                     17070000
     THEN DO;                                                           17080000
       FILE_RCBDSB1.CPU = TB_RCBV320.PRODUCT_TYPE_HW    ||              17090000
                          TB_RCBV320.ORIGIN_HW          ||              17100000
                          TB_RCBV320.SEQUENCE_NUMBER_HW;                17110000
       IF PARM_RCB005.ADDRESS_RES = '1'                                 17120000
       THEN DO;                         /* RETRIEVE ADDRESS NUMBER   */ 17130000
         TB_RCBV150.COUNTRY_NUMBER  = WRK_CTRYNO;                       17140000
         TB_RCBV340.COUNTRY_NUMBER  = WRK_CTRYNO;                       17150000
         TB_RCBV340.PRODUCT_TYPE    = TB_RCBV320.PRODUCT_TYPE_HW;       17160000
         TB_RCBV340.ORIGIN          = TB_RCBV320.ORIGIN_HW;             17170000
         TB_RCBV340.SEQUENCE_NUMBER = TB_RCBV320.SEQUENCE_NUMBER_HW;    17180000
         TB_RCBV340.CUSTOMER_USER   = TB_RCBV200.CUSTOMER_USER;         17190000
         TB_RCBV150.CUSTOMER_NUMBER = TB_RCBV200.CUSTOMER_USER;         17200000
                                                                        17210000
         CALL R019_SELECT_RCBV0340;                                     17220000
                                                                        17230000
         IF SQLCODE = 0                                                 17240000
         THEN DO;                                                       17250000
           FILE_RCBDSB1.ZIP_CODE = TB_RCBV150.ZIP_CODE;                 17260000
           WRK_ADDRESS_NUMBER = TB_RCBV340.ADDRESS_NUMBER;              17270000
         END;                                                           17280000
       END;                                                             17290000
     END;                                                               17300000
                                                                        17310000
     IF WRK_ADDRESS_NUMBER = ''                                         17320000
     THEN DO;                          /* RETRIEVE ADDRESS NUMBER    */ 17330000
       TB_RCBV150.COUNTRY_NUMBER  = WRK_CTRYNO;                         17340000
       TB_RCBV150.CUSTOMER_NUMBER = TB_RCBV200.CUSTOMER_USER;           17350000
                                                                        17360000
       CALL R022_SELECT_RCBV0150;                                       17370000
                                                                        17380000
       IF SQLCODE = 0                                                   17390000
       THEN DO;                                                         17400000
         FILE_RCBDSB1.ZIP_CODE = TB_RCBV150.ZIP_CODE;                   17410000
         WRK_ADDRESS_NUMBER    = TB_RCBV150.ADDRESS_NUMBER;             17420000
       END;                                                             17430000
     END;                                                               17440000
                                                                        17450000
     IF WRK_ADDRESS_NUMBER > ''       /* RETRIEVE ADDRESS LINES      */ 17460000
     THEN DO;                                                           17470000
       TB_RCBV280.COUNTRY_NUMBER  = WRK_CTRYNO;                         17480000
       TB_RCBV280.CUSTOMER_NUMBER = TB_RCBV200.CUSTOMER_USER;           17490000
       TB_RCBV280.ADDRESS_NUMBER  = WRK_ADDRESS_NUMBER;                 17500000
                                                                        17510000
       CALL R014_ADDRESS_LINES(@OPEN);                                  17520000
       CALL R014_ADDRESS_LINES(@FETCH);                                 17530000
       DO I = 1 TO 9 WHILE(SQLCODE = 0);                                17540000
         WRK_ADDRESS_LINES.LINE(I) = TB_RCBV280.TEXT;                   17550000
         CALL R014_ADDRESS_LINES(@FETCH);                               17560000
       END;                                                             17570000
       CALL R014_ADDRESS_LINES(@CLOSE);                                 17580000
                                                                        17590000
       DO I = 1 TO 5;                                                   17600000
         FILE_RCBDSB1.ADDRESS_LINES(I) = WRK_ADDRESS_LINES.LINE(I);     17610000
       END;                                                             17620000
     END;                                                               17630000
                                                                        17640000
     IF SWITCH_USER_EXIT_4 = TRUE                                       17650000
     THEN DO;                                                           17660000
       CALL R028_USEREXIT_RCBDS4U;                                      17670000
     END;                                                               17680000
                                                                        17690000
     CALL R705_WRITE_RCBDSB1_RECORD;                                    17700000
                                                                        17710000
     CALL R015_CURSOR_LICENSES(@FETCH);                                 17720000
   END;                                                                 17730000
                                                                        17740000
   CALL R015_CURSOR_LICENSES(@CLOSE);                                   17750000
                                                                        17760000
 END R005_LICENSES;                                                     17770000
1/********************************************************************/ 17780000
 /*                                                                  */ 17790000
 /* MODULE NAME      : R006_SHRINKWRAP_SOF                           */ 17800000
 /*                                                                  */ 17810000
 /* DESCRIPTION      : HANDLE SHRINKWRAP CONTRACTS IN SOF/CHIS MODE  */ 17820000
 /* - RETRIEVE CONTRACT FROM TABLE RCBT0240_SERV_CTR AND             */ 17830000
 /*   RETRIEVE CUSTOMERNUMBER FROM TABLE RCBT0190_HW_CUST            */ 17840000
 /* - RETRIEVE INSTALLATION ADDRESS FROM TABLE RCBT0150_CUST_ADDR    */ 17850000
 /*   AND TABLE RCBT0280_ADDR_LINE AND FORMAT IT VIA USEREXIT RCBDS4U*/ 17860000
 /* - CONSTRUCT & WRITE CONTRACT RECORD TO RCBDSB1                   */ 17870000
 /********************************************************************/ 17880000
 R006_SHRINKWRAP_SOF: PROC;                                             17890000
                                                                        17900000
   TB_RCBV660 = '';                                                     17910000
   TB_RCBV728 = '';                                                     17920000
   TB_RCBV240 = '';                                                     17930000
   TB_RCBV030 = '';                                                     17940000
   TB_RCBV190 = '';                                                     17950000
                                                                        17960000
   TB_RCBV660.COUNTRY_NUMBER   = WRK_CTRYNO;                            17970000
   TB_RCBV660.DELETE_IND       = 'N';                                   17980000
   TB_RCBV660.SOURCE_TYPE_ID   = 'N';                                   17990000
   TB_RCBV728.SOURCE_TYPE_ID   = 'N';                                   18000000
   TB_RCBV728.COUNTRY_NUMBER   = WRK_CTRYNO;                            18010000
   TB_RCBV240.COUNTRY_NUMBER   = WRK_CTRYNO;                            18020000
   TB_RCBV030.COUNTRY_NUMBER   = WRK_CTRYNO;                            18030000
   TB_RCBV190.COUNTRY_NUMBER   = WRK_CTRYNO;                            18040000
   TB_RCBV190.TYPE_OF_RELATION = 'U';                                   18050000
                                                                        18060000
   CALL R012_CURSOR_SHRINK_N(@OPEN);                                    18070000
   CALL R012_CURSOR_SHRINK_N(@FETCH);                                   18080000
                                                                        18090000
   DO WHILE(SQLCODE = 0);                                               18100000
     FILE_RCBDSB1 = '';                                                 18110000
     FILE_RCBDSB1.KEY.COUNTRY_NUMBER = WRK_CTRYNO;                      18120000
     FILE_RCBDSB1.KEY.SOURCE_ID   = 'N';                                18130000
     IF ¬ SWITCH_LONG_SER THEN                        /* SOC RB01320 */ 18140005
     DO;                                              /* EOC RB01320 */ 18141009
     FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV240.PRODUCT_TYPE    ||       18150000
                                    TB_RCBV240.ORIGIN          ||       18160000
                                    TB_RCBV240.SEQUENCE_NUMBER;         18170000
     END;                                             /* SOC RB01320 */ 18171009
     ELSE                                                               18180009
     DO;                                                                18190000
        FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV125.PRODUCT_TYPE    ||    18200000
                                       TB_RCBV125.DUMMY_ORIGIN    ||    18210000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   18220000
     END;                                             /* EOC RB01320 */ 18240005
     FILE_RCBDSB1.COUNTRY_NUMBER  = WRK_CTRYNO;                         18250000
     FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;         18260000
     FILE_RCBDSB1.PRODUCT_DEF_ID  = TB_RCBV030.TYPE_OF_CONTRACT;        18270000
     FILE_RCBDSB1.CONTRACT_NUMBER = 'N' || WRK_CTRYNO ||                18280000
                                                       /* SOC *PTM1246*/18290000
                                    TB_RCBV030.CONTRACT_NUMBER;         18300000
                                                       /* EOC *PTM1246*/18310000
     FILE_RCBDSB1.START_DATE      = TB_RCBV240.EFFECTIVE_DATE;          18320000
     FILE_RCBDSB1.END_DATE        = TB_RCBV240.END_DATE;                18330000
     IF ¬ SWITCH_LONG_SER THEN                             /* RB01320 */18340005
     FILE_RCBDSB1.EXTERNAL_KEY    = 'N' || WRK_CTRYNO       ||          18350000
                                    TB_RCBV240.PRODUCT_TYPE ||          18360000
                                    TB_RCBV240.ORIGIN       ||          18370000
                                    TB_RCBV240.SEQUENCE_NUMBER;         18380000
     ELSE                                              /* SOC RB01320 */18390005
     DO;                                                                18400000
        FILE_RCBDSB1.EXTERNAL_KEY    = 'N' || WRK_CTRYNO       ||       18410000
                                       TB_RCBV125.PRODUCT_TYPE ||       18420000
                                       TB_RCBV125.DUMMY_ORIGIN ||       18430000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   18440000
     END;                                              /* EOC RB01320 */18460005
                                                                        18470000
     FILE_RCBDSB1.HOURS_FROM(1)   =                                     18480000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_7);      18490000
     FILE_RCBDSB1.HOURS_TO(1)     =                                     18500000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_7);        18510000
     FILE_RCBDSB1.HOURS_FROM(2)   =                                     18520000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_1);      18530000
     FILE_RCBDSB1.HOURS_TO(2)     =                                     18540000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_1);        18550000
     FILE_RCBDSB1.HOURS_FROM(3)   =                                     18560000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_2);      18570000
     FILE_RCBDSB1.HOURS_TO(3)     =                                     18580000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_2);        18590000
     FILE_RCBDSB1.HOURS_FROM(4)   =                                     18600000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_3);      18610000
     FILE_RCBDSB1.HOURS_TO(4)     =                                     18620000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_3);        18630000
     FILE_RCBDSB1.HOURS_FROM(5)   =                                     18640000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_4);      18650000
     FILE_RCBDSB1.HOURS_TO(5)     =                                     18660000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_4);        18670000
     FILE_RCBDSB1.HOURS_FROM(6)   =                                     18680000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_5);      18690000
     FILE_RCBDSB1.HOURS_TO(6)     =                                     18700000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_5);        18710000
     FILE_RCBDSB1.HOURS_FROM(7)   =                                     18720000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_6);      18730000
     FILE_RCBDSB1.HOURS_TO(7)     =                                     18740000
                R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_6);        18750000
                                                                        18760000
     IF ¬ SWITCH_LONG_SER THEN                             /* RB01320 */18770005
     FILE_RCBDSB1.CPU             = TB_RCBV240.PRODUCT_TYPE  ||         18780000
                                    TB_RCBV240.ORIGIN        ||         18790000
                                    TB_RCBV240.SEQUENCE_NUMBER;         18800000
     ELSE                                              /* SOC RB01320 */18810005
     DO;                                                                18820000
        FILE_RCBDSB1.CPU          = TB_RCBV125.PRODUCT_TYPE  ||         18830000
                                    TB_RCBV125.DUMMY_ORIGIN  ||         18840000
                                    TB_RCBV125.DUMMY_SEQUENCE_NUM;      18850000
     END;                                              /* EOC RB01320 */18870007
                                                                        18880000
     WRK_ADDRESS_LINES = '';                                            18890000
     TB_RCBV150        = '';                                            18900000
     TB_RCBV150.COUNTRY_NUMBER  = WRK_CTRYNO;                           18910000
     TB_RCBV150.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;           18920000
                                                                        18930000
     CALL R022_SELECT_RCBV0150;                                         18940000
                                                                        18950000
     IF SQLCODE = 0                                                     18960000
     THEN DO;                                                           18970000
       FILE_RCBDSB1.ZIP_CODE      = TB_RCBV150.ZIP_CODE;                18980000
                                                                        18990000
       TB_RCBV280 = '';                                                 19000000
       TB_RCBV280.COUNTRY_NUMBER  = WRK_CTRYNO;                         19010000
       TB_RCBV280.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;         19020000
       TB_RCBV280.ADDRESS_NUMBER  = TB_RCBV150.ADDRESS_NUMBER;          19030000
                                                                        19040000
                                                                        19050000
       CALL R014_ADDRESS_LINES(@OPEN);                                  19060000
       CALL R014_ADDRESS_LINES(@FETCH);                                 19070000
       DO I = 1 TO 9 WHILE(SQLCODE = 0);                                19080000
         WRK_ADDRESS_LINES.LINE(I) = TB_RCBV280.TEXT;                   19090000
         CALL R014_ADDRESS_LINES(@FETCH);                               19100000
       END;                                                             19110000
       CALL R014_ADDRESS_LINES(@CLOSE);                                 19120000
                                                                        19130000
       DO I = 1 TO 5;                                                   19140000
         FILE_RCBDSB1.ADDRESS_LINES(I) = WRK_ADDRESS_LINES.LINE(I);     19150000
       END;                                                             19160000
     END;                                                               19170000
                                                                        19180000
     IF SWITCH_USER_EXIT_4 = TRUE                                       19190000
     THEN DO;                                                           19200000
       CALL R028_USEREXIT_RCBDS4U;                                      19210000
     END;                                                               19220000
                                                                        19230000
     CALL R705_WRITE_RCBDSB1_RECORD;                                    19240000
                                                                        19250000
     CALL R012_CURSOR_SHRINK_N(@FETCH);                                 19260000
   END;                                                                 19270000
                                                                        19280000
   CALL R012_CURSOR_SHRINK_N(@CLOSE);                                   19290000
                                                                        19300000
 END R006_SHRINKWRAP_SOF;                                               19310000
1/********************************************************************/ 19320000
 /*                                                                  */ 19330000
 /* MODULE NAME      : R007_SHRINKWRAP_PI                            */ 19340000
 /*                                                                  */ 19350000
 /* DESCRIPTION      : HANDLE SHRINKWRAP CONTRACTS IN PRIME INPUT    */ 19360000
 /*                    MODE                                          */ 19370000
 /* - RETRIEVE CONTRACT FROM TABLE RCBT0241_PI_CTR                   */ 19380000
 /* - RETRIEVE REPONSE TIME FROM TABLE RCBT0470_SERV_COND            */ 19390000
 /* - RETRIEVE INSTALLATION ADDRESS FROM TABLE RCBT0011_PI_CUST      */ 19400000
 /*   AND FORMAT IT VIA USEREXIT RCBDS4U                             */ 19410000
 /* - MAKE AN UNIQUE CCMS EXTERNAL KEY FROM THE CEDS UNIQUE KEY      */ 19420000
 /* - CONSTRUCT & WRITE CONTRACT RECORD TO RCBDSB1                   */ 19430000
 /********************************************************************/ 19440000
 R007_SHRINKWRAP_PI: PROC;                                              19450000
   TB_RCBV660 = '';                                                     19460000
   TB_RCBV728 = '';                                                     19470000
   TB_RCBV241 = '';                                                     19480000
   TB_RCBV051 = '';                                                     19490000
                                                                        19500000
   TB_RCBV660.COUNTRY_NUMBER   = WRK_CTRYNO;                            19510000
   TB_RCBV660.DELETE_IND       = 'N';                                   19520000
   TB_RCBV660.SOURCE_TYPE_ID   = 'S';                                   19530000
   TB_RCBV728.SOURCE_TYPE_ID   = 'S';                                   19540000
   TB_RCBV728.COUNTRY_NUMBER   = WRK_CTRYNO;                            19550000
   TB_RCBV241.COUNTRY_NUMBER   = WRK_CTRYNO;                            19560000
   TB_RCBV051.COUNTRY_NUMBER   = WRK_CTRYNO;                            19570000
                                                                        19580000
   CALL R013_CURSOR_SHRINK_PI(@OPEN);                                   19590000
   CALL R013_CURSOR_SHRINK_PI(@FETCH);                                  19600000
                                                                        19610000
   DO WHILE(SQLCODE = 0);                                               19620000
     FILE_RCBDSB1 = '';                                                 19630000
     FILE_RCBDSB1.KEY.COUNTRY_NUMBER = WRK_CTRYNO;                      19640000
     FILE_RCBDSB1.KEY.SOURCE_ID   = 'S';                                19650000
                                                                        19660000
     IF ¬ SWITCH_LONG_SER THEN                             /* RB01320 */19670005
     FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV241.PRODUCT_TYPE    ||       19680000
                                    TB_RCBV241.ORIGIN          ||       19690000
                                    TB_RCBV241.SEQUENCE_NUMBER;         19700000
     ELSE                                              /* SOC RB01320 */19710005
        FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV125.PRODUCT_TYPE    ||    19720000
                                       TB_RCBV125.DUMMY_ORIGIN    ||    19730000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   19740000
                                                       /* EOC RB01320 */19750005
     FILE_RCBDSB1.COUNTRY_NUMBER  = WRK_CTRYNO;                         19760000
     FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV051.CUSTOMER_NUMBER;         19770000
                                                                        19780000
                                                   /* SOC RB01289 */    19790000
   CALL R040_T010_CUSTOMER;                                             19800000
   CALL R041_T190_OR_T011_CUSTOMER;                                     19810000
                                                                        19820000
   IF (TB_RCBV051.SOURCE_INDICATOR = 'O') THEN                          19830000
    DO;                                                                 19840000
      IF (T010_CUSTOMER_FLAG = TRUE) THEN              /* RULE 1 */     19850000
      DO;                                                               19860000
        FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV010.CUSTOMER_NUMBER;      19870000
        CALL R042_BAU_CUSTOMER_INFO;                                    19880000
      END;                                                              19890000
      ELSE IF (T0190_CUSTOMER_FLAG = TRUE) THEN          /* RULE 2 */   19900000
      DO;                                                               19910000
        FILE_RCBDSB1.CUSTOMER_NUMBER = WRK_T0190_CUSTOMER_NUMBER;       19920000
        CALL R042_BAU_CUSTOMER_INFO;                                    19930000
      END;                                                              19940000
      ELSE IF (T010_CUSTOMER_FLAG  = FALSE &            /* RULE 3 */    19950000
               T0190_CUSTOMER_FLAG = FALSE &                            19960000
               T011_CUSTOMER_FLAG  = TRUE) THEN                         19970000
      DO;                                                               19980000
        FILE_RCBDSB1.CUSTOMER_NUMBER    = TB_RCBV011.CUSTOMER_NUMBER;   19990000
        CALL R043_PI_CUSTOMER_INFO;                                     20000000
      END;                                                              20010000
      ELSE                                              /* RULE 4 */    20020000
      DO;                                                               20030000
        CALL R043_PI_CUSTOMER_INFO;                                     20040000
      END;                                                              20050000
    END;                                                                20060000
   ELSE IF (TB_RCBV051.SOURCE_INDICATOR = 'S') THEN                     20070000
    DO;                                                                 20080000
      IF (T0190_CUSTOMER_FLAG = TRUE) THEN              /* RULE 5 */    20090000
      DO;                                                               20100000
        FILE_RCBDSB1.CUSTOMER_NUMBER = WRK_T0190_CUSTOMER_NUMBER;       20110000
        CALL R042_BAU_CUSTOMER_INFO;                                    20120000
      END;                                                              20130000
      ELSE IF (T0190_CUSTOMER_FLAG = FALSE &            /* RULE 6 */    20140000
               T011_CUSTOMER_FLAG  = TRUE) THEN                         20150000
      DO;                                                               20160000
        FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV011.CUSTOMER_NUMBER;      20170000
        CALL R043_PI_CUSTOMER_INFO;                                     20180000
      END;                                                              20190000
      ELSE                                              /* RULE 7 */    20200000
      DO;                                                               20210000
        CALL R043_PI_CUSTOMER_INFO;                                     20220000
      END;                                                              20230000
    END;                                                                20240000
   ELSE                                                                 20250000
    DO;                                                                 20260000
      IF (T0190_CUSTOMER_FLAG = TRUE) THEN              /* RULE 8 */    20270000
      DO;                                                               20280000
        FILE_RCBDSB1.CUSTOMER_NUMBER = WRK_T0190_CUSTOMER_NUMBER;       20290000
        CALL R042_BAU_CUSTOMER_INFO;                                    20300000
      END;                                                              20310000
      ELSE IF (T0190_CUSTOMER_FLAG = FALSE &            /* RULE 9 */    20320000
               T010_CUSTOMER_FLAG  = TRUE) THEN                         20330000
      DO;                                                               20340000
        FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV010.CUSTOMER_NUMBER;      20350000
        CALL R042_BAU_CUSTOMER_INFO;                                    20360000
      END;                                                              20370000
      ELSE                                              /* RULE 10*/    20380000
      DO;                                                               20390000
        CALL R043_PI_CUSTOMER_INFO;                                     20400000
      END;                                                              20410000
    END;                                           /* EOC RB01289 */    20420000
                                                                        20430000
     FILE_RCBDSB1.PRODUCT_DEF_ID  = TB_RCBV241.CONTRACT_NUMBER;         20440000
     FILE_RCBDSB1.CONTRACT_NUMBER = 'S' || WRK_CTRYNO ||                20450000
                                    TB_RCBV241.CONTRACT_NUMBER;         20460000
     FILE_RCBDSB1.START_DATE      = TB_RCBV241.EFFECTIVE_DATE;          20470000
     FILE_RCBDSB1.END_DATE        = TB_RCBV241.END_DATE;                20480000
                                                                        20490000
     IF ¬ SWITCH_LONG_SER THEN                             /* RB01320 */20500005
     FILE_RCBDSB1.EXTERNAL_KEY    = 'S' || WRK_CTRYNO          ||       20510000
                                    TB_RCBV241.PRODUCT_TYPE    ||       20520000
                                    TB_RCBV241.ORIGIN          ||       20530000
                                    TB_RCBV241.SEQUENCE_NUMBER;         20540000
     ELSE                                              /* SOC RB01320 */20550005
        FILE_RCBDSB1.EXTERNAL_KEY    = 'S' || WRK_CTRYNO          ||    20560000
                                       TB_RCBV125.PRODUCT_TYPE    ||    20570000
                                       TB_RCBV125.DUMMY_ORIGIN    ||    20580000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   20590000
                                                       /* EOC RB01320 */20600005
                                                                        20610000
     FILE_RCBDSB1.HOURS_FROM(1)   =                                     20620000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_START_7);      20630000
     FILE_RCBDSB1.HOURS_TO(1)     =                                     20640000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_END_7);        20650000
     FILE_RCBDSB1.HOURS_FROM(2)   =                                     20660000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_START_1);      20670000
     FILE_RCBDSB1.HOURS_TO(2)     =                                     20680000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_END_1);        20690000
     FILE_RCBDSB1.HOURS_FROM(3)   =                                     20700000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_START_2);      20710000
     FILE_RCBDSB1.HOURS_TO(3)     =                                     20720000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_END_2);        20730000
     FILE_RCBDSB1.HOURS_FROM(4)   =                                     20740000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_START_3);      20750000
     FILE_RCBDSB1.HOURS_TO(4)     =                                     20760000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_END_3);        20770000
     FILE_RCBDSB1.HOURS_FROM(5)   =                                     20780000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_START_4);      20790000
     FILE_RCBDSB1.HOURS_TO(5)     =                                     20800000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_END_4);        20810000
     FILE_RCBDSB1.HOURS_FROM(6)   =                                     20820000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_START_5);      20830000
     FILE_RCBDSB1.HOURS_TO(6)     =                                     20840000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_END_5);        20850000
     FILE_RCBDSB1.HOURS_FROM(7)   =                                     20860000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_START_6);      20870000
     FILE_RCBDSB1.HOURS_TO(7)     =                                     20880000
                R037_ISOTIME2MINUTES(TB_RCBV241.COVERAGE_END_6);        20890000
                                                                        20900000
     IF ¬ SWITCH_LONG_SER THEN                             /* RB01320 */20910005
     FILE_RCBDSB1.CPU             = TB_RCBV241.PRODUCT_TYPE  ||         20920000
                                    TB_RCBV241.ORIGIN        ||         20930000
                                    TB_RCBV241.SEQUENCE_NUMBER;         20940000
     ELSE                                              /* SOC RB01320 */20950005
        FILE_RCBDSB1.CPU             = TB_RCBV125.PRODUCT_TYPE    ||    20960000
                                       TB_RCBV125.DUMMY_ORIGIN    ||    20970000
                                       TB_RCBV125.DUMMY_SEQUENCE_NUM;   20980000
                                                       /* EOC RB01320 */20990005
     IF WRK_SLC_NULL ¬= -1 &                        /* NOT DB2 NULL  */ 21000000
        TB_RCBV241.SERVICE_LVL_CODE > ''                                21010000
     THEN DO;                                                           21020000
       TB_RCBV470 = '';                                                 21030000
       TB_RCBV470.SERVICE_LVL_CODE = TB_RCBV241.SERVICE_LVL_CODE;       21040000
                                                                        21050000
       CALL R021_SELECT_RCBV0470;                                       21060000
                                                                        21070000
       IF TB_RCBV470.CONTACT_TIME_QTY_1  > '' &                         21080000
          TB_RCBV470.CONTACT_TIME_UNT_1  > '' &                         21090000
          WRK_INDNULL_CALLBCK = 0                                       21100000
       THEN DO;                                                         21110000
         IF TB_RCBV470.CONTACT_TIME_UNT_1 = 'D'     /* TIME IN DAYS  */ 21120000
         THEN DO;                                                       21130000
           FILE_RCBDSB1.CALL_BACK_TIME = TB_RCBV470.CONTACT_TIME_QTY_1  21140000
                                         * 1440;                        21150000
         END;                                                           21160000
         ELSE DO;                                   /* TIME IN HOURS */ 21170000
           FILE_RCBDSB1.CALL_BACK_TIME = TB_RCBV470.CONTACT_TIME_QTY_1  21180000
                                         * 60;                          21190000
         END;                                                           21200000
       END;                                                             21210000
     END;                                                               21220000
                                                                        21230000
                                                       /* SOC RB01289 */21240000
 /*  TB_RCBV011 = '';                                                   21250000
     TB_RCBV011.COUNTRY_NUMBER     = WRK_CTRYNO;                        21260000
     TB_RCBV011.CUSTOMER_NUMBER    = FILE_RCBDSB1.CUSTOMER_NUMBER;      21270000
     TB_RCBV011.CUSTOMER_NR_EXTEND = TB_RCBV051.CUSTOMER_NR_EXTEND;     21280000
                                                                        21290000
     CALL R020_SELECT_RCBV011;                                          21300000
                                                                        21310000
     IF SQLCODE = 0                                                     21320000
     THEN DO;                                                           21330000
       FILE_RCBDSB1.ZIP_CODE         = TB_RCBV011.ZIP_CODE;             21340000
       FILE_RCBDSB1.ADDRESS_LINES(1) = TB_RCBV011.ADDRESS_LINE_1;       21350000
       FILE_RCBDSB1.ADDRESS_LINES(2) = TB_RCBV011.ADDRESS_LINE_2;       21360000
       FILE_RCBDSB1.ADDRESS_LINES(3) = TB_RCBV011.ADDRESS_LINE_3;       21370000
     END;                                                               21380000
                                                                        21390000
     IF SWITCH_USER_EXIT_4 = TRUE                                       21400000
     THEN DO;                                                           21410000
       WRK_ADDRESS_LINES = '';                                          21420000
       WRK_ADDRESS_LINES.LINE(1) = TB_RCBV011.ADDRESS_LINE_1;           21430000
       WRK_ADDRESS_LINES.LINE(2) = TB_RCBV011.ADDRESS_LINE_2;           21440000
       WRK_ADDRESS_LINES.LINE(3) = TB_RCBV011.ADDRESS_LINE_3;           21450000
       CALL R028_USEREXIT_RCBDS4U;                                      21460000
     END; */                                                            21470000
                                                      /* EOC RB01289 */ 21480000
                                                                        21490000
     CALL R705_WRITE_RCBDSB1_RECORD;                                    21500000
                                                                        21510000
     CALL R013_CURSOR_SHRINK_PI(@FETCH);                                21520000
   END;                                                                 21530000
                                                                        21540000
   CALL R013_CURSOR_SHRINK_PI(@CLOSE);                                  21550000
                                                                        21560000
 END R007_SHRINKWRAP_PI;                                                21570000
                                                                        21580000
1/********************************************************************/ 21590000
 /*                                                                  */ 21600000
 /* MODULE NAME      : R008_CHIS_CTRS                                */ 21610000
 /*                                                                  */ 21620000
 /* DESCRIPTION      : HANDLE CCMS CONTRACTS FROM CHIS               */ 21630000
 /*                                                                  */ 21640000
 /* FOR EVERY RECORD SELECTED VIA CHISLAM QCH0CMM A RELATED ROW IS   */ 21650000
 /* FETCHED FROM TABLE RCBT0660_CCMS_OFF. IF A ROW EXIST THE         */ 21660000
 /* QCH0CMM RECORD IS PASSED TO THE USEREXIT RCBDSB2U. THE USEREXIT  */ 21670000
 /* RETURNS AN ACCEPT INDICATOR. INCASE THE ACCEPT INDICATOR IS      */ 21680000
 /* EQUAL TO 'Y' THE QCH0CMM RECORD IS FURTHER PROCESSED:            */ 21690000
 /* - THE PRODUCT DEFID (POS 16-30) AND CPU ARE DETERMINED VIA THE   */ 21700000
 /*   VALUE OF THE MAPPING INDICATOR OF RCBT0660_CCMS_OFF.           */ 21710000
 /* - INCASE THE CONDITION INDICATOR FROM TABLE RCBT0660_CCMS_OFF    */ 21720000
 /*   EQUALS 'Y' RELATED SERVICES ARE SELECTED VIA CHISLAM QCH0SCM.  */ 21730000
 /*   FOR EACH SELECTED RESOURCE USEREXIT RCBDS2U IS CALLED WITH     */ 21740000
 /*   INDICATOR 'Y'. THE USEREXIT CAN RETURN VALUES FOR THE SERVICE  */ 21750000
 /*   COMPONENTS: CALL BACK TIME, HOURS FROM AND HOURS TO.           */ 21760000
 /* - INCASE THE SUBCOMPONENT INDICATOR FROM TABLE RCBT0660_CCMS_OFF */ 21770000
 /*   EQUALS 'R' (RESOURCES) RELATED RESOURCES ARE SELECTED VIA      */ 21780000
 /*   CHISLAM QCH0RSM. FOR EACH SELECTED RESOURCE USEREXIT RCBDS2U   */ 21790000
 /*   IS CALLED WITH INDICATOR 'R'. THE USEREXIT CAN RETURN VALUES   */ 21800000
 /*   FOR THE RESOURCE COMPONENTS BALANCE UNITS AND BALANCE.         */ 21810000
 /* - EVERY ROW IS PASSED TO THE USEREXIT RCBDSB2U WITH INDICATOR    */ 21820000
 /*   'N'. THE USEREXIT CAN RETURN VALUES FOR THE FIELDS:            */ 21830000
 /*   PRODUCT DEFID (POS16-30), BALANCE UNITS, BALANCE, CALL BACKTIME*/ 21840000
 /*   HOURS FROM, HOURS TO, ADDRESS LINES, ZIPCODE AND CPU.          */ 21850000
 /*                                                                  */ 21860000
 /* THE SWITCH_USER_EXIT INDICATOR INDICATES IF THE USER EXIT SHOULD */ 21870000
 /* BE CALLED. IN CASE OF HANDLING DATA FROM CHIS THE USER EXIT      */ 21880000
 /* SWITCH SHOULD ALWAYS BE 'Y'. THE COUNTRIES MUST HANDLE THE CHIS  */ 21890000
 /* DATA, BECAUSE THE FORMAT OF THE CHIS DATA CAN DIFFER FROM        */ 21900000
 /* COUNTRY TO COUNTRY. IF THE SWITCH_USER_EXIT IS 'N' THIS PROGRAM  */ 21910000
 /* ABENDS.                                                          */ 21920000
 /********************************************************************/ 21930000
 R008_CHIS_CTRS: PROC;                                                  21940000
                                                                        21950000
   SELECT (QCH0CMSO.CXIDSRC);                       /*SOC CEDS00000444*/21960000
     WHEN ('E');                                                        21970000
     OTHERWISE                                                          21980000
       DO;                                                              21990000
         IF SUBSTR(QCH0CMSO.IOBJNIK,1,1) = ' ' THEN                     22000000
           QCH0CMSO.IOVSNIK = SUBSTR(QCH0CMSO.IOBJNIK,12,4) ||          22010000
                              SUBSTR(QCH0CMSO.IOVSNIK,1,7);             22020000
         ELSE                                                           22030000
           QCH0CMSO.IOVSNIK = SUBSTR(QCH0CMSO.IOBJNIK,1,4)  ||          22040000
                              SUBSTR(QCH0CMSO.IOVSNIK,1,7);             22050000
         QCH0CMSO.IOBJNIK = '';                                         22060000
       END;                                                             22070000
   END;                                             /*EOC CEDS00000444*/22080000
                                                                        22090000
   TB_RCBV660.COUNTRY_NUMBER   = WRK_CTRYNO;                            22100000
   TB_RCBV660.SOURCE_TYPE_ID   = 'C';                                   22110000
   TB_RCBV660.CCMS_OFFERING_ID = QCH0CMSO.IOFFNIK;                      22120000
   TB_RCBV660.CPU_TYPE         = '';                                    22130000
   TB_RCBV660.MAIN_OBJECT      = QCH0CMSO.IOBJNIK;                      22140000
   TB_RCBV660.DELETE_IND       = 'N';                                   22150000
                                                                        22160000
   CALL R018_CCMS_CONTRACT;              /* SELECT ROW FROM RCBV0660 */ 22170000
                                                                        22180000
   IF SQLCODE = 0                                                       22190000
   THEN DO;                                                             22200000
     CALL R009_DATA_MAPPING;                /* INITIAL MAPPING       */ 22210000
                                                                        22220000
     CALL R032_PROCESS_USEREXIT_O;                                      22230000
                                                                        22240000
     IF WRK_ACCEPT_IND = 'Y'                /* WRITE RECORD          */ 22250000
     THEN DO;                                                           22260000
       SELECT(TB_RCBV660.MAPPING_IND);                                  22270000
                                                      /* SOC RA01223 */ 22280000
         WHEN('1','3')                                                  22290000
         DO;                                                            22300000
           SUBSTR(FILE_RCBDSB1.PRODUCT_DEF_ID,16,15) =                  22310000
                                                  QCH0CMSO.COBJNIK;     22320000
         END;                                                           22330000
         WHEN('2','4')                                                  22340000
         DO;                                                            22350000
           SUBSTR(FILE_RCBDSB1.PRODUCT_DEF_ID,16,15) = '';              22360000
         END;                                                           22370000
         OTHERWISE;                                                     22380000
       END;                                                             22390000
                                                                        22400000
       IF TB_RCBV660.TOS_FORMAT = '' THEN                               22410000
       DO;                                                              22420000
         FILE_RCBDSB1.CPU = '';                                         22430000
       END;                                                             22440000
                                                                        22450000
       ELSE DO;                                                         22460000
         POS_TYPE   = INDEX(TB_RCBV660.TOS_FORMAT,'TTTT');              22470000
         POS_ORIGIN = INDEX(TB_RCBV660.TOS_FORMAT,'OO');                22480000
         POS_SER7   = INDEX(TB_RCBV660.TOS_FORMAT,'SSSSSSS');           22490000
         IF POS_SER7 = 0 THEN                                           22500000
         DO;                                                            22510000
           POS_SER5 = INDEX(TB_RCBV660.TOS_FORMAT,'SSSSS');             22520000
           FILE_RCBDSB1.CPU = SUBSTR(QCH0CMSO.IOVSNIK,POS_TYPE,4)       22530000
                           || SUBSTR(QCH0CMSO.IOVSNIK,POS_ORIGIN,2)     22540000
                           || '00'                                      22550000
                           || SUBSTR(QCH0CMSO.IOVSNIK,POS_SER5,5);      22560000
         END;                                                           22570000
                                                                        22580000
         ELSE DO;                                                       22590000
           FILE_RCBDSB1.CPU = SUBSTR(QCH0CMSO.IOVSNIK,POS_TYPE,4)       22600000
                           || SUBSTR(QCH0CMSO.IOVSNIK,POS_ORIGIN,2)     22610000
                           || SUBSTR(QCH0CMSO.IOVSNIK,POS_SER7,7);      22620000
         END;                                                           22630000
       END;                                                             22640000
                                                      /* EOC RA01223 */ 22650000
                                                                        22660000
       IF TB_RCBV660.CONDITIONS_IND = 'Y'   /* SELECT CONDITIONS     */ 22670000
       THEN DO;                                                         22680000
         CALL R025_QCH0SCSO(@OPEN);         /* OPEN CHIS TABLE       */ 22690000
         CALL R025_QCH0SCSO(@FETCH);        /* FETCH FIRST CHIS-ROW  */ 22700000
                                                                        22710000
         DO WHILE(SQLCODE = 0);                                         22720000
           CALL R033_PROCESS_USEREXIT_Y;                                22730000
           CALL R025_QCH0SCSO(@FETCH);      /* FETCH NEXT CHIS-ROW   */ 22740000
         END;                                                           22750000
         CALL R025_QCH0SCSO(@CLOSE);                                    22760000
       END;                                                             22770000
       IF TB_RCBV660.SUBCOMPONENT_IND = 'R'                             22780000
       THEN DO;                          /* RESOURCE COMPONENTS      */ 22790000
         CALL R027_QCH0RSSO(@OPEN);      /* OPEN CHIS TABLE          */ 22800000
         CALL R027_QCH0RSSO(@FETCH);     /* FETCH FIRST CHIS-ROW     */ 22810000
         DO WHILE(SQLCODE = 0);                                         22820000
           CALL R031_PROCESS_USEREXIT_R;                                22830000
           CALL R027_QCH0RSSO(@FETCH);   /* FETCH NEXT CHIS-ROW      */ 22840000
         END;                                                           22850000
         CALL R027_QCH0RSSO(@CLOSE);                                    22860000
       END;                            /* END RESOURCE COMPONENTS  */   22870000
       CALL R030_PROCESS_USEREXIT_N;                                    22880000
       CALL R705_WRITE_RCBDSB1_RECORD;                                  22890000
     END;                                                               22900000
   END;                                  /* ROW FROM RCBV0660        */ 22910000
   ELSE DO;                              /* IGNORE ROW FROM QCH0CMM  */ 22920000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                   22930000
     PARM_INT_AREA.MESSAGE_TYPE                 = 'BU';                 22940000
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0218';               22950000
     PARM_INT_AREA.MSG_VAR_CODE_6  = 'FV';                              22960000
     PARM_INT_AREA.MSG_VAR_VALUE_6 = 'OFF_ID=' || QCH0CMSO.IOFFNIK;     22970000
     PARM_INT_AREA.MSG_VAR_CODE_7  = 'FV';                              22980000
     PARM_INT_AREA.MSG_VAR_VALUE_7 = 'MAIN_OBJ=' || QCH0CMSO.IOBJNIK;   22990000
     PARM_INT_AREA.MSG_VAR_CODE_8  = 'FV';                              23000000
     PARM_INT_AREA.MSG_VAR_VALUE_8 = 'NOT REGISTERED IN RCBV660';       23010000
     CALL RCB0M1M (PTR_INT_AREA);                                       23020000
   END;                                                                 23030000
                                                                        23040000
 END R008_CHIS_CTRS;                                                    23050000
1/********************************************************************/ 23060000
 /*                                                                  */ 23070000
 /* MODULE NAME      : R009_DATA_MAPPING                             */ 23080000
 /*                                                                  */ 23090000
 /* DESCRIPTION      : FILL OUTPUT FILE RCBDSB1 WITH INITIAL VALUES  */ 23100000
 /*                    FROM CHIS DATABASE                            */ 23110000
 /********************************************************************/ 23120000
 R009_DATA_MAPPING: PROC;                                               23130000
                                                                        23140000
   FILE_RCBDSB1                    = '';         /* DATA MAPPING   */   23150000
   FILE_RCBDSB1.COUNTRY_NUMBER     = TB_RCBV660.COUNTRY_NUMBER;         23160000
   FILE_RCBDSB1.CUSTOMER_NUMBER    = QCH0CMSO.ICUSUSE;                  23170000
   FILE_RCBDSB1.PRODUCT_DEF_ID     = QCH0CMSO.IOFFNIK            ||     23180000
                                     QCH0CMSO.IOBJNIK;                  23190000
   FILE_RCBDSB1.CONTRACT_NUMBER    = TB_RCBV660.SOURCE_TYPE_ID   ||     23200000
                                     TB_RCBV660.COUNTRY_NUMBER   ||     23210000
                                     QCH0CMSO.IAGRCID;                  23220000
   FILE_RCBDSB1.START_DATE         = QCH0CMSO.DAGRCAS;                  23230000
   FILE_RCBDSB1.END_DATE           = QCH0CMSO.DAGRVEX;                  23240000
   FILE_RCBDSB1.BASE_SC            = QCH0CMSO.IUSCNIK;                  23250000
   FILE_RCBDSB1.MAIN_OBJECT        = QCH0CMSO.IOBJNIK;   /* RA01220 */  23260000
   FILE_RCBDSB1.KEY.COUNTRY_NUMBER = FILE_RCBDSB1.COUNTRY_NUMBER;       23270000
                                                                        23280000
   /* DETERMINE UNIQUE KEY AND EXTERNAL KEY                         */  23290000
   WRK_LDBSOSN_PIC_09              = QCH0CMSO.LDBSOSN;                  23300000
   WRK_LOVCIDX_PIC_15              = QCH0CMSO.LOVCIDX;                  23310000
   WRK_CEDS_LONG_KEY               = '';                                23320000
   WRK_CEDS_LONG_KEY               = QCH0CMSO.IAGRCID            ||     23330000
                                     WRK_LDBSOSN_PIC_09          ||     23340000
                                     QCH0CMSO.IOVSNIK            ||     23350000
                                     QCH0CMSO.IUSCNIK            ||     23360000
                                     WRK_LOVCIDX_PIC_15          ||     23370000
                                     FILE_RCBDSB1.CUSTOMER_NUMBER||     23380000
                                     QCH0CMSO.IOBJNIK;    /* RA01220 */ 23390000
                                                                        23400000
   WRK_MAX_KEY                     = PARM_RCB027.MAX_KEY_CHIS;          23410000
   CALL R038_DETERMINE_SEQ_NR_KEY;                                      23420000
   PARM_RCB027.MAX_KEY_CHIS        = WRK_MAX_KEY;                       23430000
                                                                        23440000
   FILE_RCBDSB1.KEY.SOURCE_ID      = TB_RCBV660.SOURCE_TYPE_ID;         23450000
   FILE_RCBDSB1.KEY.UNIQUE_KEY     = WRK_SEQ_NR_KEY              ||     23460000
                                     FILE_RCBDSB1.CUSTOMER_NUMBER;      23470000
   FILE_RCBDSB1.EXTERNAL_KEY       = TB_RCBV660.SOURCE_TYPE_ID   ||     23480000
                                     TB_RCBV660.COUNTRY_NUMBER   ||     23490000
                                     WRK_SEQ_NR_KEY;                    23500000
                                                                        23510000
                                                                        23520000
 END R009_DATA_MAPPING;                                                 23530000
1/********************************************************************/ 23540000
 /*                                                                  */ 23550000
 /* MODULE NAME      : R010_CURSOR_RCBBLA0                           */ 23560000
 /*                    OPEN, FETCH OR CLOSE CURSOR                   */ 23570000
 /* DESCRIPTION      : SELECT ALL EFFECTIVE, CHANGED RCBBLA0 RECORDS.*/ 23580000
 /********************************************************************/ 23590000
 R010_CURSOR_RCBBLA0: PROC(ACTION);                                     23600000
                                                                        23610000
   DCL ACTION   CHAR(05);                                               23620000
                                                                        23630000
   SELECT(ACTION);                                                      23640000
     WHEN(@OPEN)                                                        23650000
     DO;                                                                23660000
       EXEC SQL                                                         23670000
       OPEN CURS_RCBBLA0;                                               23680000
                                                                        23690000
       IF (SQLCODE) ¬= 0                                                23700000
       THEN DO;                                                         23710000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#038');                23720000
       END;                                                             23730000
     END;                                                               23740000
     WHEN(@FETCH)                                                       23750000
     DO;                                                                23760000
       EXEC SQL                                                         23770000
       FETCH CURS_RCBBLA0                                               23780000
       INTO :TB_RCBV210.CONTRACT_NUMBER      :WRK_INDNULL,              23790000
            :TB_RCBV210.CUSTOMER_NUMBER      :WRK_INDNULL,              23800000
            :TB_RCBV210.SERVICE_NUMBER       :WRK_INDNULL,              23810000
            :TB_RCBV210.GROUP_ID             :WRK_INDNULL,              23820000
            :TB_RCBV210.EFFECTIVE_DATE       :WRK_INDNULL,              23830000
            :TB_RCBV210.QTY_MU_CONTRACTED    :WRK_INDNULL,              23840000
            :TB_RCBV210.QTY_MU_ACCOMPLISH    :WRK_INDNULL,              23850000
            :TB_RCBV210.END_DATE             :WRK_INDNULL,              23860000
            :TB_RCBV210.COVERAGE_START_1     :WRK_INDNULL,              23870000
            :TB_RCBV210.COVERAGE_END_1       :WRK_INDNULL,              23880000
            :TB_RCBV210.COVERAGE_START_2     :WRK_INDNULL,              23890000
            :TB_RCBV210.COVERAGE_END_2       :WRK_INDNULL,              23900000
            :TB_RCBV210.COVERAGE_START_3     :WRK_INDNULL,              23910000
            :TB_RCBV210.COVERAGE_END_3       :WRK_INDNULL,              23920000
            :TB_RCBV210.COVERAGE_START_4     :WRK_INDNULL,              23930000
            :TB_RCBV210.COVERAGE_END_4       :WRK_INDNULL,              23940000
            :TB_RCBV210.COVERAGE_START_5     :WRK_INDNULL,              23950000
            :TB_RCBV210.COVERAGE_END_5       :WRK_INDNULL,              23960000
            :TB_RCBV210.COVERAGE_START_6     :WRK_INDNULL,              23970000
            :TB_RCBV210.COVERAGE_END_6       :WRK_INDNULL,              23980000
            :TB_RCBV210.COVERAGE_START_7     :WRK_INDNULL,              23990000
            :TB_RCBV210.COVERAGE_END_7       :WRK_INDNULL,              24000000
            :TB_RCBV075.MEASUREMENT_UNIT     :WRK_INDNULL;              24010000
                                                                        24020000
       SELECT (SQLCODE);                                                24030000
         WHEN (0);                                                      24040000
         WHEN (+100);                                                   24050000
         OTHERWISE                                                      24060000
         DO;                                                            24070000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#039');              24080000
         END;                                                           24090000
       END;                                                             24100000
     END;                                                               24110000
     OTHERWISE                                                          24120000
     DO;                                                                24130000
       EXEC SQL                                                         24140000
       CLOSE CURS_RCBBLA0;                                              24150000
                                                                        24160000
       IF (SQLCODE) ¬= 0                                                24170000
       THEN DO;                                                         24180000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#040');                24190000
       END;                                                             24200000
     END;                                                               24210000
   END;                                                                 24220000
                                                                        24230000
 END R010_CURSOR_RCBBLA0;                                               24240000
1/********************************************************************/ 24250000
 /*                                                                  */ 24260000
 /* MODULE NAME      : R011_CURSOR_PSEUDO_HW                         */ 24270000
 /*                    OPEN, FETCH OR CLOSE CURSOR                   */ 24280000
 /* DESCRIPTION      : SELECT ALL EFFECTIVE, CHANGED PSEUDO HW RECS. */ 24290000
 /********************************************************************/ 24300000
 R011_CURSOR_PSEUDO_HW: PROC(ACTION);                                   24310000
                                                                        24320000
   DCL ACTION   CHAR(05);                                               24330000
                                                                        24340000
   SELECT(ACTION);                                                      24350000
     WHEN(@OPEN)                                                        24360000
     DO;                                                                24370000
       EXEC SQL                                                         24380000
       OPEN CURS_PSEUDO_HW;                                             24390000
                                                                        24400000
       IF (SQLCODE) ¬= 0                                                24410000
       THEN DO;                                                         24420000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#041');                24430000
       END;                                                             24440000
     END;                                                               24450000
     WHEN(@FETCH)                                                       24460000
     DO;                                                                24470000
       EXEC SQL                                                         24480000
       FETCH CURS_PSEUDO_HW                                             24490000
       INTO :TB_RCBV240.PRODUCT_TYPE         :WRK_INDNULL,              24500000
            :TB_RCBV240.ORIGIN               :WRK_INDNULL,              24510000
            :TB_RCBV240.SEQUENCE_NUMBER      :WRK_INDNULL,              24520000
            :TB_RCBV240.CONTRACT_NUMBER      :WRK_INDNULL,              24530000
            :TB_RCBV240.COVERAGE_START_1     :WRK_INDNULL,              24540000
            :TB_RCBV240.COVERAGE_END_1       :WRK_INDNULL,              24550000
            :TB_RCBV240.COVERAGE_START_2     :WRK_INDNULL,              24560000
            :TB_RCBV240.COVERAGE_END_2       :WRK_INDNULL,              24570000
            :TB_RCBV240.COVERAGE_START_3     :WRK_INDNULL,              24580000
            :TB_RCBV240.COVERAGE_END_3       :WRK_INDNULL,              24590000
            :TB_RCBV240.COVERAGE_START_4     :WRK_INDNULL,              24600000
            :TB_RCBV240.COVERAGE_END_4       :WRK_INDNULL,              24610000
            :TB_RCBV240.COVERAGE_START_5     :WRK_INDNULL,              24620000
            :TB_RCBV240.COVERAGE_END_5       :WRK_INDNULL,              24630000
            :TB_RCBV240.COVERAGE_START_6     :WRK_INDNULL,              24640000
            :TB_RCBV240.COVERAGE_END_6       :WRK_INDNULL,              24650000
            :TB_RCBV240.COVERAGE_START_7     :WRK_INDNULL,              24660000
            :TB_RCBV240.COVERAGE_END_7       :WRK_INDNULL,              24670000
            :TB_RCBV240.EFFECTIVE_DATE       :WRK_INDNULL,              24680000
            :TB_RCBV240.END_DATE             :WRK_INDNULL,              24690000
            :TB_RCBV190.CUSTOMER_NUMBER      :WRK_INDNULL,              24700000
            :TB_RCBV300.MODEL_NUMBER         :WRK_INDNULL;              24710000
                                                                        24720000
       SELECT (SQLCODE);                                                24730000
         WHEN (0);                                                      24740000
         WHEN (+100);                                                   24970000
         OTHERWISE                                                      24980000
         DO;                                                            24990000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#042');              25000000
         END;                                                           25010000
       END;                                                             25020000
     END;                                                               25030000
     OTHERWISE                                                          25040000
     DO;                                                                25050000
       EXEC SQL                                                         25060000
       CLOSE CURS_PSEUDO_HW;                                            25070000
                                                                        25080000
       IF (SQLCODE) ¬= 0                                                25090000
       THEN DO;                                                         25100000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#043');                25110000
       END;                                                             25120000
     END;                                                               25130000
   END;                                                                 25140000
                                                                        25150000
 END R011_CURSOR_PSEUDO_HW;                                             25160000
1/********************************************************************/ 25170000
 /*                                                                  */ 25180000
 /* MODULE NAME      : R012_CURSOR_CURSOR_SHRINK_N                   */ 25190000
 /*                    OPEN, FETCH OR CLOSE CURSOR                   */ 25200000
 /* DESCRIPTION      : SELECT ALL EFFECTIVE, CHANGED SHRINKWRAP      */ 25210000
 /*                    CONTRACTS IN SOF/CHIS MODE.                   */ 25220000
 /********************************************************************/ 25230000
 R012_CURSOR_SHRINK_N: PROC(ACTION);                                    25240000
                                                                        25250000
   DCL ACTION   CHAR(05);                                               25260000
                                                                        25270000
   SELECT(ACTION);                                                      25280000
     WHEN(@OPEN)                                                        25290000
     DO;                                                                25300000
       EXEC SQL                                                         25310000
       OPEN CURS_SHRINK_N;                                              25320000
                                                                        25330000
       IF (SQLCODE) ¬= 0                                                25340000
       THEN DO;                                                         25350000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#044');                25360000
       END;                                                             25370000
     END;                                                               25380000
     WHEN(@FETCH)                                                       25390000
     DO;                                                                25400000
                         /* ADD FILLING INTO TYPE_OF_CONTRACT*PTM1246*/ 25410000
       EXEC SQL                                                         25420000
       FETCH CURS_SHRINK_N                                              25430000
       INTO :TB_RCBV240.PRODUCT_TYPE         :WRK_INDNULL,              25440000
            :TB_RCBV240.ORIGIN               :WRK_INDNULL,              25450000
            :TB_RCBV240.SEQUENCE_NUMBER      :WRK_INDNULL,              25460000
            :TB_RCBV030.CONTRACT_NUMBER      :WRK_INDNULL,              25470000
            :TB_RCBV030.TYPE_OF_CONTRACT     :WRK_INDNULL,              25480000
            :TB_RCBV240.COVERAGE_START_1     :WRK_INDNULL,              25490000
            :TB_RCBV240.COVERAGE_END_1       :WRK_INDNULL,              25500000
            :TB_RCBV240.COVERAGE_START_2     :WRK_INDNULL,              25510000
            :TB_RCBV240.COVERAGE_END_2       :WRK_INDNULL,              25520000
            :TB_RCBV240.COVERAGE_START_3     :WRK_INDNULL,              25530000
            :TB_RCBV240.COVERAGE_END_3       :WRK_INDNULL,              25540000
            :TB_RCBV240.COVERAGE_START_4     :WRK_INDNULL,              25550000
            :TB_RCBV240.COVERAGE_END_4       :WRK_INDNULL,              25560000
            :TB_RCBV240.COVERAGE_START_5     :WRK_INDNULL,              25570000
            :TB_RCBV240.COVERAGE_END_5       :WRK_INDNULL,              25580000
            :TB_RCBV240.COVERAGE_START_6     :WRK_INDNULL,              25590000
            :TB_RCBV240.COVERAGE_END_6       :WRK_INDNULL,              25600000
            :TB_RCBV240.COVERAGE_START_7     :WRK_INDNULL,              25610000
            :TB_RCBV240.COVERAGE_END_7       :WRK_INDNULL,              25620000
            :TB_RCBV240.EFFECTIVE_DATE       :WRK_INDNULL,              25630000
            :TB_RCBV240.END_DATE             :WRK_INDNULL,              25640000
            :TB_RCBV190.CUSTOMER_NUMBER      :WRK_INDNULL;              25650000
       SELECT (SQLCODE);                                                25660000
                                                       /* SOC RB01320 */25660105
      /* WHEN (0); */                                                   25661000
         WHEN (0)                                                       25670000
         DO;                                                            25680000
           WRK_PRODUCT_TYPE  = TB_RCBV240.PRODUCT_TYPE;                 25700000
           WRK_SERIAL_NUMBER = TB_RCBV240.ORIGIN||                      25710000
                               TB_RCBV240.SEQUENCE_NUMBER;              25720000
                                                                        25721000
           CALL R029_T125_RETRIEVE;                    /* EOC RB01320 */25722005
        END;                                                            25830000
         WHEN (+100);                                                   25840000
         OTHERWISE                                                      25850000
         DO;                                                            25860000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#045');              25870000
         END;                                                           25880000
       END;                                                             25890000
     END;                                                               25900000
     OTHERWISE                                                          25910000
     DO;                                                                25920000
       EXEC SQL                                                         25930000
       CLOSE CURS_SHRINK_N;                                             25940000
                                                                        25950000
       IF (SQLCODE) ¬= 0                                                25960000
       THEN DO;                                                         25970000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#046');                25980000
       END;                                                             25990000
     END;                                                               26000000
   END;                                                                 26010000
                                                                        26020000
 END R012_CURSOR_SHRINK_N;                                              26030000
1/********************************************************************/ 26040000
 /*                                                                  */ 26050000
 /* MODULE NAME      : R013_CURSOR_SHRINK_PI                         */ 26060000
 /*                    OPEN, FETCH OR CLOSE CURSOR                   */ 26070000
 /* DESCRIPTION      : SELECT ALL EFFECTIVE, CHANGED SHRINKWRAP      */ 26080000
 /*                    CONTRACTS IN PRIME INPUT MODE.                */ 26090000
 /********************************************************************/ 26100000
 R013_CURSOR_SHRINK_PI: PROC(ACTION);                                   26110000
                                                                        26120000
   DCL ACTION   CHAR(05);                                               26130000
                                                                        26140000
   SELECT(ACTION);                                                      26150000
     WHEN(@OPEN)                                                        26160000
     DO;                                                                26170000
       EXEC SQL                                                         26180000
       OPEN CURS_SHRINK_PI;                                             26190000
                                                                        26200000
                               /* SQLCODE = 100 THEN ? */               26210000
       IF (SQLCODE) ¬= 0                                                26220000
       THEN DO;                                                         26230000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#047');                26240000
       END;                                                             26250000
     END;                                                               26260000
     WHEN(@FETCH)                                                       26270000
     DO;                                                                26280000
       EXEC SQL                                                         26290000
       FETCH CURS_SHRINK_PI                                             26300000
       INTO :TB_RCBV241.PRODUCT_TYPE         :WRK_INDNULL,              26310000
            :TB_RCBV241.ORIGIN               :WRK_INDNULL,              26320000
            :TB_RCBV241.SEQUENCE_NUMBER      :WRK_INDNULL,              26330000
            :TB_RCBV241.CONTRACT_NUMBER      :WRK_INDNULL,              26340000
            :TB_RCBV241.COVERAGE_START_1     :WRK_INDNULL,              26350000
            :TB_RCBV241.COVERAGE_END_1       :WRK_INDNULL,              26360000
            :TB_RCBV241.COVERAGE_START_2     :WRK_INDNULL,              26370000
            :TB_RCBV241.COVERAGE_END_2       :WRK_INDNULL,              26380000
            :TB_RCBV241.COVERAGE_START_3     :WRK_INDNULL,              26390000
            :TB_RCBV241.COVERAGE_END_3       :WRK_INDNULL,              26400000
            :TB_RCBV241.COVERAGE_START_4     :WRK_INDNULL,              26410000
            :TB_RCBV241.COVERAGE_END_4       :WRK_INDNULL,              26420000
            :TB_RCBV241.COVERAGE_START_5     :WRK_INDNULL,              26430000
            :TB_RCBV241.COVERAGE_END_5       :WRK_INDNULL,              26440000
            :TB_RCBV241.COVERAGE_START_6     :WRK_INDNULL,              26450000
            :TB_RCBV241.COVERAGE_END_6       :WRK_INDNULL,              26460000
            :TB_RCBV241.COVERAGE_START_7     :WRK_INDNULL,              26470000
            :TB_RCBV241.COVERAGE_END_7       :WRK_INDNULL,              26480000
            :TB_RCBV241.EFFECTIVE_DATE       :WRK_INDNULL,              26490000
            :TB_RCBV241.END_DATE             :WRK_INDNULL,              26500000
            :TB_RCBV241.SERVICE_LVL_CODE     :WRK_SLC_NULL,             26510000
            :TB_RCBV051.CUSTOMER_NUMBER      :WRK_INDNULL,              26520000
            :TB_RCBV051.CUSTOMER_NR_EXTEND   :WRK_INDNULL,              26530000
            :TB_RCBV051.SOURCE_INDICATOR     :WRK_INDNULL; /* RB01289 */26540000
       SELECT (SQLCODE);                                                26550000
                                                       /* SOC RB01320 */26551005
      /* WHEN (0); */                                                   26560000
         WHEN (0)                                                       26561000
         DO;                                                            26570000
           WRK_PRODUCT_TYPE  = TB_RCBV241.PRODUCT_TYPE;                 26580000
           WRK_SERIAL_NUMBER = TB_RCBV241.ORIGIN||                      26590000
                               TB_RCBV241.SEQUENCE_NUMBER;              26600000
                                                                        26610000
           CALL R029_T125_RETRIEVE;                   /* EOC RB01320 */ 26620005
         END;                                                           26720000
         WHEN (+100);                                                   26730000
         OTHERWISE                                                      26740000
         DO;                                                            26750000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#048');              26760000
         END;                                                           26770000
       END;                                                             26780000
     END;                                                               26790000
     OTHERWISE                                                          26800000
     DO;                                                                26810000
       EXEC SQL                                                         26820000
       CLOSE CURS_SHRINK_PI;                                            26830000
                                                                        26840000
       IF (SQLCODE) ¬= 0                                                26850000
       THEN DO;                                                         26860000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#049');                26870000
       END;                                                             26880000
     END;                                                               26890000
   END;                                                                 26900000
                                                                        26910000
 END R013_CURSOR_SHRINK_PI;                                             26920000
1/********************************************************************/ 26930000
 /*                                                                  */ 26940000
 /* MODULE NAME      : R014_ADDRESS_LINES                            */ 26950000
 /*                    OPEN, FETCH OR CLOSE CURSOR                   */ 26960000
 /* DESCRIPTION      : SELECT ALL ADDRESS LINES FROM RCBT0280        */ 26970000
 /********************************************************************/ 26980000
 R014_ADDRESS_LINES: PROC(ACTION);                                      26990000
                                                                        27000000
   DCL ACTION   CHAR(05);                                               27010000
                                                                        27020000
   SELECT(ACTION);                                                      27030000
     WHEN(@OPEN)                                                        27040000
     DO;                                                                27050000
       EXEC SQL                                                         27060000
       OPEN CURS_ADDR_LINES;                                            27070000
                                                                        27080000
       IF (SQLCODE) ¬= 0                                                27090000
       THEN DO;                                                         27100000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#050');                27110000
       END;                                                             27120000
     END;                                                               27130000
     WHEN(@FETCH)                                                       27140000
     DO;                                                                27150000
       EXEC SQL                                                         27160000
       FETCH CURS_ADDR_LINES                                            27170000
       INTO :TB_RCBV280.TEXT        :WRK_INDNULL,                       27180000
            :TB_RCBV280.LINE_NUMBER :WRK_INDNULL;                       27190000
                                                                        27200000
       SELECT (SQLCODE);                                                27210000
         WHEN (0);                                                      27220000
         WHEN (+100);                                                   27230000
         OTHERWISE                                                      27240000
         DO;                                                            27250000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#051');              27260000
         END;                                                           27270000
       END;                                                             27280000
     END;                                                               27290000
     OTHERWISE                                                          27300000
     DO;                                                                27310000
       EXEC SQL                                                         27320000
       CLOSE CURS_ADDR_LINES;                                           27330000
                                                                        27340000
       IF (SQLCODE) ¬= 0                                                27350000
       THEN DO;                                                         27360000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#052');                27370000
       END;                                                             27380000
     END;                                                               27390000
   END;                                                                 27400000
                                                                        27410000
 END R014_ADDRESS_LINES;                                                27420000
1/********************************************************************/ 27430000
 /*                                                                  */ 27440000
 /* MODULE NAME      : R015_CURSOR_LICENSES                          */ 27450000
 /*                    OPEN, FETCH OR CLOSE CURSOR                   */ 27460000
 /* DESCRIPTION      : SELECT ALL EFFECTIVE, CHANGED LICENSES.       */ 27470000
 /********************************************************************/ 27480000
 R015_CURSOR_LICENSES: PROC(ACTION);                                    27490000
                                                                        27500000
   DCL ACTION   CHAR(05);                                               27510000
                                                                        27520000
   SELECT(ACTION);                                                      27530000
     WHEN(@OPEN)                                                        27540000
     DO;                                                                27550000
       EXEC SQL                                                         27560000
       OPEN CURS_LICENSES;                                              27570000
                                                                        27580000
       IF (SQLCODE) ¬= 0                                                27590000
       THEN DO;                                                         27600000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#053');                27610000
       END;                                                             27620000
     END;                                                               27630000
     WHEN(@FETCH)                                                       27640000
     DO;                                                                27650000
       EXEC SQL                                                         27660000
       FETCH CURS_LICENSES                                              27670000
       INTO :TB_RCBV200.PRODUCT_TYPE         :WRK_INDNULL,              27680000
            :TB_RCBV200.MODEL_NUMBER         :WRK_INDNULL,              27690000
            :TB_RCBV200.ORIGIN               :WRK_INDNULL,              27700000
            :TB_RCBV200.SEQUENCE_NUMBER      :WRK_INDNULL,              27710000
            :TB_RCBV200.CUSTOMER_USER        :WRK_INDNULL,              27720000
            :TB_RCBV200.MARKETING_INSTDAT    :WRK_INDNULL,              27730000
                                                      /* CEDS00000311 */27740000
            :TB_RCBV200.END_DATE             :WRK_INDNULL;              27750000
                                                                        27760000
       SELECT (SQLCODE);                                                27770000
         WHEN (0);                                                      27780000
         WHEN (+100);                                                   27790000
         OTHERWISE                                                      27800000
         DO;                                                            27810000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#054');              27820000
         END;                                                           27830000
       END;                                                             27840000
     END;                                                               27850000
     OTHERWISE                                                          27860000
     DO;                                                                27870000
       EXEC SQL                                                         27880000
       CLOSE CURS_LICENSES;                                             27890000
                                                                        27900000
       IF (SQLCODE) ¬= 0                                                27910000
       THEN DO;                                                         27920000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#055');                27930000
       END;                                                             27940000
     END;                                                               27950000
   END;                                                                 27960000
                                                                        27970000
 END R015_CURSOR_LICENSES;                                              27980000
1/********************************************************************/ 27990000
 /*                                                                  */ 28000000
 /* MODULE NAME      : R016_CURSOR_ESA_SSA                           */ 28010000
 /*                    OPEN, FETCH OR CLOSE CURSOR                   */ 28020000
 /* DESCRIPTION      : SELECT ALL EFFECTIVE, CHANGED ESA/SSA CTRS.   */ 28030000
 /********************************************************************/ 28040000
 R016_CURSOR_ESA_SSA: PROC(ACTION);                                     28050000
                                                                        28060000
                                                                        28080000
   DCL ACTION   CHAR(05);                                               28090000
                                                                        28100000
   SELECT(ACTION);                                                      28110000
     WHEN(@OPEN)                                                        28120000
     DO;                                                                28130000
       EXEC SQL                                                         28140000
       OPEN CURS_ESA_SSA;                                               28150000
                                                                        28160000
       IF (SQLCODE) ¬= 0                                                28170000
       THEN DO;                                                         28180000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#056');                28190000
       END;                                                             28200000
     END;                                                               28210000
     WHEN(@FETCH)                                                       28220000
     DO;                                                                28230000
       IF WRK_KEY_CURRENT.PRODUCT_TYPE = '' &                           28240000
          WRK_KEY_CURRENT.ORIGIN       = '' &                           28250000
          WRK_KEY_CURRENT.SEQUENCE_NUMBER = ''                          28260000
       THEN DO;                                                         28270000
         /* FETCH FIRST BOX    */                                       28280000
         EXEC SQL                                                       28310000
         FETCH CURS_ESA_SSA                                             28320000
         INTO :TB_RCBV240.PRODUCT_TYPE       :WRK_INDNULL,              28330000
              :TB_RCBV240.ORIGIN             :WRK_INDNULL,              28340000
              :TB_RCBV240.SEQUENCE_NUMBER    :WRK_INDNULL,              28350000
              :TB_RCBV240.CONTRACT_NUMBER    :WRK_INDNULL,              28360000
              :TB_RCBV240.COVERAGE_START_1   :WRK_INDNULL,              28370000
              :TB_RCBV240.COVERAGE_END_1     :WRK_INDNULL,              28380000
              :TB_RCBV240.COVERAGE_START_2   :WRK_INDNULL,              28390000
              :TB_RCBV240.COVERAGE_END_2     :WRK_INDNULL,              28400000
              :TB_RCBV240.COVERAGE_START_3   :WRK_INDNULL,              28410000
              :TB_RCBV240.COVERAGE_END_3     :WRK_INDNULL,              28420000
              :TB_RCBV240.COVERAGE_START_4   :WRK_INDNULL,              28430000
              :TB_RCBV240.COVERAGE_END_4     :WRK_INDNULL,              28440000
              :TB_RCBV240.COVERAGE_START_5   :WRK_INDNULL,              28450000
              :TB_RCBV240.COVERAGE_END_5     :WRK_INDNULL,              28460000
              :TB_RCBV240.COVERAGE_START_6   :WRK_INDNULL,              28470000
              :TB_RCBV240.COVERAGE_END_6     :WRK_INDNULL,              28480000
              :TB_RCBV240.COVERAGE_START_7   :WRK_INDNULL,              28490000
              :TB_RCBV240.COVERAGE_END_7     :WRK_INDNULL,              28500000
              :TB_RCBV240.EFFECTIVE_DATE     :WRK_INDNULL,              28510000
              :TB_RCBV240.END_DATE           :WRK_INDNULL,              28520000
              :TB_RCBV190.MARKETING_INSTDAT  :WRK_INDNULL,              28530000
                                                       /* SOC RB01320 */28531005
           /* :TB_RCBV190.CUSTOMER_NUMBER    :WRK_INDNULL; */           28540004
              :TB_RCBV190.CUSTOMER_NUMBER    :WRK_INDNULL,              28540104
              :TB_RCBV125.DUMMY_ORIGIN       :WRK_DUMMY_ORIGIN_IND,     28541004
              :TB_RCBV125.DUMMY_SEQUENCE_NUM :WRK_DUMMY_SEQ_NUM_IND;    28542004
                                                       /* EOC RB01320 */28543005
          WRK_SQLCODE_CURRENT = SQLCODE;                                28550000
       END;                                                             28590000
                                                                        28600000
       DO WHILE((WRK_SQLCODE_CURRENT = 0 )  &                           28610000
                WRK_KEY_CURRENT.PRODUCT_TYPE   =                        28620000
                                       TB_RCBV240.PRODUCT_TYPE &        28630000
                WRK_KEY_CURRENT.ORIGIN         =                        28640000
                                       TB_RCBV240.ORIGIN       &        28650000
                WRK_KEY_CURRENT.SEQUENCE_NUMBER =                       28660000
                                       TB_RCBV240.SEQUENCE_NUMBER);     28670000
         /* FETCH ADDITIONAL ROWS FOR A BOX AND IGNORE THEM */          28680000
         EXEC SQL                                                       28710000
         FETCH CURS_ESA_SSA                                             28720000
         INTO :TB_RCBV240.PRODUCT_TYPE       :WRK_INDNULL,              28730000
              :TB_RCBV240.ORIGIN             :WRK_INDNULL,              28740000
              :TB_RCBV240.SEQUENCE_NUMBER    :WRK_INDNULL,              28750000
              :TB_RCBV240.CONTRACT_NUMBER    :WRK_INDNULL,              28760000
              :TB_RCBV240.COVERAGE_START_1   :WRK_INDNULL,              28770000
              :TB_RCBV240.COVERAGE_END_1     :WRK_INDNULL,              28780000
              :TB_RCBV240.COVERAGE_START_2   :WRK_INDNULL,              28790000
              :TB_RCBV240.COVERAGE_END_2     :WRK_INDNULL,              28800000
              :TB_RCBV240.COVERAGE_START_3   :WRK_INDNULL,              28810000
              :TB_RCBV240.COVERAGE_END_3     :WRK_INDNULL,              28820000
              :TB_RCBV240.COVERAGE_START_4   :WRK_INDNULL,              28830000
              :TB_RCBV240.COVERAGE_END_4     :WRK_INDNULL,              28840000
              :TB_RCBV240.COVERAGE_START_5   :WRK_INDNULL,              28850000
              :TB_RCBV240.COVERAGE_END_5     :WRK_INDNULL,              28860000
              :TB_RCBV240.COVERAGE_START_6   :WRK_INDNULL,              28870000
              :TB_RCBV240.COVERAGE_END_6     :WRK_INDNULL,              28880000
              :TB_RCBV240.COVERAGE_START_7   :WRK_INDNULL,              28890000
              :TB_RCBV240.COVERAGE_END_7     :WRK_INDNULL,              28900000
              :TB_RCBV240.EFFECTIVE_DATE     :WRK_INDNULL,              28910000
              :TB_RCBV240.END_DATE           :WRK_INDNULL,              28920000
              :TB_RCBV190.MARKETING_INSTDAT  :WRK_INDNULL,              28930000
                                                       /* SOC RB01320 */28931005
           /* :TB_RCBV190.CUSTOMER_NUMBER    :WRK_INDNULL; */           28940004
              :TB_RCBV190.CUSTOMER_NUMBER    :WRK_INDNULL,              28941004
              :TB_RCBV125.DUMMY_ORIGIN       :WRK_DUMMY_ORIGIN_IND,     28942004
              :TB_RCBV125.DUMMY_SEQUENCE_NUM :WRK_DUMMY_SEQ_NUM_IND;    28943004
                                                       /* EOC RB01320 */28944005
          WRK_SQLCODE_CURRENT = SQLCODE;                                28950000
                                                                        28960000
       END;                                                             28970000
       SELECT (SQLCODE);                                                28980000
         WHEN (0)                                                       28990000
         DO;                                                            29000000
           WRK_KEY_CURRENT.PRODUCT_TYPE = TB_RCBV240.PRODUCT_TYPE;      29250000
           WRK_KEY_CURRENT.ORIGIN       = TB_RCBV240.ORIGIN;            29260000
           WRK_KEY_CURRENT.SEQUENCE_NUMBER =                            29270000
                                        TB_RCBV240.SEQUENCE_NUMBER;     29280000
         END;                                                           29380000
         WHEN (+100) ;                                                  29390005
         OTHERWISE                                                      29400000
         DO;                                                            29410000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#057');              29420000
         END;                                                           29430000
       END;                                                             29440000
     END;                                                               29450000
     OTHERWISE                                                          29460000
     DO;                                                                29470000
       EXEC SQL                                                         29480000
       CLOSE CURS_ESA_SSA;                                              29490000
                                                                        29500000
       IF (SQLCODE) ¬= 0                                                29510000
       THEN DO;                                                         29520000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#058');                29530000
       END;                                                             29540000
     END;                                                               29550000
   END;                                                                 29560000
                                                                        29570000
 END R016_CURSOR_ESA_SSA;                                               29580000
1/********************************************************************/ 29590000
 /*                                                                  */ 29600000
 /* MODULE NAME      : R017_CURSOR_SOURCE_ID                         */ 29610000
 /*                    OPEN, FETCH AND CLOSE CURSOR                  */ 29620000
 /* DESCRIPTION      : SELECT ALL (UNIQUE) DIFFERENT SOURCE TYPE     */ 29630000
 /*                    IDS WITHIN TABLE RCBT0660_CCMS_OFF. FOR       */ 29640000
 /*                    EVERY SELECTED SOURCE TYPE ID RECORDS WILL    */ 29650000
 /*                    BE HANDLED FROM THE CEDS OR CHIS DATABASE     */ 29660000
 /********************************************************************/ 29670000
 R017_CURSOR_SOURCE_ID: PROC(ACTION);                                   29680000
                                                                        29690000
   DCL ACTION   CHAR(05);                                               29700000
                                                                        29710000
   SELECT(ACTION);                                                      29720000
     WHEN(@OPEN)                                                        29730000
     DO;                                                                29740000
       EXEC SQL                                                         29750000
       OPEN CURS_RCBV0660;                                              29760000
                                                                        29770000
       IF (SQLCODE) ¬= 0                                                29780000
       THEN DO;                                                         29790000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#059');                29800000
       END;                                                             29810000
     END;                                                               29820000
     WHEN(@FETCH)                                                       29830000
     DO;                                                                29840000
       EXEC SQL                                                         29850000
       FETCH CURS_RCBV0660                                              29860000
       INTO :TB_RCBV660.SOURCE_TYPE_ID      :WRK_INDNULL;               29870000
                                                                        29880000
       SELECT (SQLCODE);                                                29890000
         WHEN (0);                                                      29900000
         WHEN (+100);                                                   29910000
         OTHERWISE                                                      29920000
         DO;                                                            29930000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#060');              29940000
         END;                                                           29950000
       END;                                                             29960000
     END;                                                               29970000
     OTHERWISE                                                          29980000
     DO;                                                                29990000
       EXEC SQL                                                         30000000
       CLOSE CURS_RCBV0660;                                             30010000
                                                                        30020000
       IF (SQLCODE) ¬= 0                                                30030000
       THEN DO;                                                         30040000
         CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#061');                30050000
       END;                                                             30060000
     END;                                                               30070000
   END;                                                                 30080000
                                                                        30090000
 END R017_CURSOR_SOURCE_ID;                                             30100000
1/********************************************************************/ 30120000
 /*                                                                  */ 30130000
 /* MODULE NAME      : R029_T125_RETRIEVE             RB01320        */ 30140005
 /*                    OPEN, FETCH AND CLOSE CURSOR                  */ 30150000
 /* DESCRIPTION      : SELECT ALL (UNIQUE) DIFFERENT SOURCE TYPE     */ 30160000
 /*                    IDS WITHIN TABLE RCBT0660_CCMS_OFF. FOR       */ 30170000
 /*                    EVERY SELECTED SOURCE TYPE ID RECORDS WILL    */ 30180000
 /*                    BE HANDLED FROM THE CEDS OR CHIS DATABASE     */ 30190000
 /********************************************************************/ 30200000
 R029_T125_RETRIEVE: PROC;                                              30210000
                                                                        30220000
 TB_RCBV125      = '';                                                  30221000
 SWITCH_LONG_SER = FALSE;                                               30221100
                                                                        30222000
   EXEC SQL                                                             30230000
      SELECT * INTO :TB_RCBV125                                         30240000
      FROM RCBV0125_DMMY_REAL                                           30250000
      WHERE COUNTRY_NUMBER      = :WRK_CTRYNO                           30260000
      AND   PRODUCT_TYPE        = :WRK_PRODUCT_TYPE                     30270000
      AND   REAL_SERIAL_NUMBER  = :WRK_SERIAL_NUMBER                    30280000
   ;                                                                    30300000
   SELECT(SQLCODE);                                                     30310000
     WHEN(0)                                                            30320000
     DO;                                                                30330000
        SWITCH_LONG_SER = TRUE;                                         30340000
     END;                                                               30370000
     WHEN(100);                                                         30380000
     OTHERWISE                                                          30390000
        CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#103');                 30400000
        END;                                                            30410000
  SQLCA.SQLCODE = '';                                                   30420000
  END R029_T125_RETRIEVE;                           /* EOC RB01320 */   30640005
1/********************************************************************/ 31200000
 /*                                                                  */ 31210000
 /* MODULE NAME      : R018_CCMS_CONTRACT                            */ 31220000
 /*                                                                  */ 31230000
 /* DESCRIPTION      : SELECT ROW FROM TABLE RCBT0660_CCMS_OFF       */ 31240000
 /*                    RELATED TO THE ROW SELECTED VIA THE CHISLAM   */ 31250000
 /*                    QCH0CMM FROM THE CHIS DATABASE.               */ 31260000
 /********************************************************************/ 31270000
 R018_CCMS_CONTRACT: PROC;                                              31280000
                                                                        31290000
   EXEC SQL                                                             31300000
   SELECT CONDITIONS_IND                                                31310000
        , SUBCOMPONENT_IND                                              31320000
        , MAPPING_IND                                                   31330000
        , TOS_FORMAT                                                    31340000
   INTO :TB_RCBV660.CONDITIONS_IND      :WRK_INDNULL                    31350000
      , :TB_RCBV660.SUBCOMPONENT_IND    :WRK_INDNULL                    31360000
      , :TB_RCBV660.MAPPING_IND         :WRK_INDNULL                    31370000
      , :TB_RCBV660.TOS_FORMAT          :WRK_INDNULL                    31380000
   FROM RCBV0660_CCMS_OFF                                               31390000
   WHERE COUNTRY_NUMBER   = :TB_RCBV660.COUNTRY_NUMBER                  31400000
     AND SOURCE_TYPE_ID   = :TB_RCBV660.SOURCE_TYPE_ID                  31410000
     AND CCMS_OFFERING_ID = :TB_RCBV660.CCMS_OFFERING_ID                31420000
     AND CPU_TYPE         = :TB_RCBV660.CPU_TYPE                        31430000
     AND MAIN_OBJECT      = :TB_RCBV660.MAIN_OBJECT                     31440000
     AND DELETE_IND       = :TB_RCBV660.DELETE_IND                      31450000
   ;                                                                    31460000
                                                                        31470000
   SELECT (SQLCODE);                                                    31480000
     WHEN (0);                                                          31490000
     WHEN (100);                                                        31500000
     OTHERWISE                                                          31510000
     DO;                                                                31520000
       CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#062');                  31530000
     END;                                                               31540000
   END;                                                                 31550000
 END R018_CCMS_CONTRACT;                                                31560000
1/********************************************************************/ 31570000
 /*                                                                  */ 31580000
 /* MODULE NAME      : R019_SELECT_RCBV0340                          */ 31590000
 /*                                                                  */ 31600000
 /* DESCRIPTION      : SELECT ROW FROM TABLE RCBT0340_HW_ADDR        */ 31610000
 /*                    IN ORDER TO DETERMINE THE ADDRESS NUMBER.     */ 31620000
 /*                    THE ADDRESS NUMBER IS USED TO DETERMINE THE   */ 31630000
 /*                    ADDRESS IN TABLE RCBT0280_ADDR_LINE.          */ 31640000
 /********************************************************************/ 31650000
 R019_SELECT_RCBV0340: PROC;                                            31660000
                                                                        31670000
   EXEC SQL                                                             31680000
   SELECT T340.ADDRESS_NUMBER,                                          31690000
          T150.ZIP_CODE                                                 31700000
   INTO :TB_RCBV340.ADDRESS_NUMBER      :WRK_INDNULL,                   31710000
        :TB_RCBV150.ZIP_CODE            :WRK_INDNULL                    31720000
   FROM RCBV0340_HW_ADDR   T340,                                        31730000
        RCBV0150_CUST_ADDR T150                                         31740000
   WHERE T150.COUNTRY_NUMBER   = :TB_RCBV150.COUNTRY_NUMBER             31750000
     AND T150.CUSTOMER_NUMBER  = :TB_RCBV150.CUSTOMER_NUMBER            31760000
     AND T150.ADDRESS_NUMBER   = T340.ADDRESS_NUMBER                    31770000
     AND :WRK_RUN_DATE BETWEEN T150.EFFECTIVE_DATE AND T150.END_DATE    31780000
     AND T340.COUNTRY_NUMBER   = T150.COUNTRY_NUMBER                    31790000
     AND T340.PRODUCT_TYPE     = :TB_RCBV340.PRODUCT_TYPE               31800000
     AND T340.ORIGIN           = :TB_RCBV340.ORIGIN                     31810000
     AND T340.SEQUENCE_NUMBER  = :TB_RCBV340.SEQUENCE_NUMBER            31820000
     AND T340.CUSTOMER_USER    = :TB_RCBV340.CUSTOMER_USER              31830000
     AND :WRK_RUN_DATE BETWEEN T340.EFFECTIVE_DATE AND T340.END_DATE    31840000
   ;                                                                    31850000
                                                                        31860000
   SELECT (SQLCODE);                                                    31870000
     WHEN (0);                                                          31880000
     WHEN (100);                                                        31890000
     OTHERWISE                                                          31900000
     DO;                                                                31910000
       CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#063');                  31920000
     END;                                                               31930000
   END;                                                                 31940000
 END R019_SELECT_RCBV0340;                                              31950000
1/********************************************************************/ 31960000
 /*                                                                  */ 31970000
 /* MODULE NAME      : R020_SELECT_RCBV011                           */ 31980000
 /*                                                                  */ 31990000
 /* DESCRIPTION      : SELECT ROW FROM TABLE RCBT0011_PI_CUST        */ 32000000
 /*                    IN ORDER TO DETERMINE THE ADDRESS LINES FOR   */ 32010000
 /*                    A SHRINKWRAP IN PRIME INPUT MODE RECORD.      */ 32020000
 /********************************************************************/ 32030000
 R020_SELECT_RCBV011: PROC;                                             32040000
                                                                        32050000
   EXEC SQL                                                             32060000
   SELECT T011.ADDRESS_LINE_1,                                          32070000
          T011.ADDRESS_LINE_2,                                          32080000
          T011.ADDRESS_LINE_3,                                          32090000
          T011.ZIP_CODE                                                 32100000
   INTO :TB_RCBV011.ADDRESS_LINE_1     :WRK_INDNULL,                    32110000
        :TB_RCBV011.ADDRESS_LINE_2     :WRK_INDNULL,                    32120000
        :TB_RCBV011.ADDRESS_LINE_3     :WRK_INDNULL,                    32130000
        :TB_RCBV011.ZIP_CODE           :WRK_INDNULL                     32140000
   FROM RCBV0011_PI_CUST    T011                                        32150000
   WHERE T011.COUNTRY_NUMBER     = :TB_RCBV011.COUNTRY_NUMBER           32160000
     AND T011.CUSTOMER_NUMBER    = :TB_RCBV011.CUSTOMER_NUMBER          32170000
     AND T011.CUSTOMER_NR_EXTEND = :TB_RCBV011.CUSTOMER_NR_EXTEND       32180000
   ;                                                                    32190000
                                                                        32200000
   SELECT (SQLCODE);                                                    32210000
     WHEN (0);                                                          32220000
     WHEN (100);                                                        32230000
     OTHERWISE                                                          32240000
     DO;                                                                32250000
       CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#064');                  32260000
     END;                                                               32270000
   END;                                                                 32280000
 END R020_SELECT_RCBV011;                                               32290000
1/********************************************************************/ 32300000
 /*                                                                  */ 32310000
 /* MODULE NAME      : R021_SELECT_RCBV0470                          */ 32320000
 /*                                                                  */ 32330000
 /* DESCRIPTION      : SELECT ROW FROM TABLE RCBT0047_SERV_COND      */ 32340000
 /*                    IN ORDER TO DETERMINE THE CALLBCK TIME QTY    */ 32350000
 /********************************************************************/ 32360000
 R021_SELECT_RCBV0470: PROC;                                            32370000
                                                                        32380000
   EXEC SQL                                                             32390000
   SELECT T470.CONTACT_TIME_QTY_1,                                      32400000
          T470.CONTACT_TIME_UNT_1                                       32410000
   INTO :TB_RCBV470.CONTACT_TIME_QTY_1 :WRK_INDNULL_CALLBCK,            32420000
        :TB_RCBV470.CONTACT_TIME_UNT_1 :WRK_INDNULL                     32430000
   FROM RCBV0470_SERV_COND  T470                                        32440000
   WHERE T470.SERVICE_LVL_CODE   = :TB_RCBV470.SERVICE_LVL_CODE         32450000
   ;                                                                    32460000
                                                                        32470000
   SELECT (SQLCODE);                                                    32480000
     WHEN (0);                                                          32490000
     OTHERWISE                                                          32500000
     DO;                                                                32510000
       CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#065');                  32520000
     END;                                                               32530000
   END;                                                                 32540000
 END R021_SELECT_RCBV0470;                                              32550000
1/********************************************************************/ 32560000
 /*                                                                  */ 32570000
 /* MODULE NAME      : R022_SELECT_RCBV0150                          */ 32580000
 /*                                                                  */ 32590000
 /* DESCRIPTION      : SELECT ROW FROM TABLE RCBT0150_CUST_ADDR      */ 32600000
 /*                    IN ORDER TO DETERMINE THE ADDRESS NUMBER.     */ 32610000
 /*                    THE ADDRESS NUMBER IS USED TO DETERMINE THE   */ 32620000
 /*                    ADDRESS IN TABLE RCBT0280_ADDR_LINE.          */ 32630000
 /********************************************************************/ 32640000
 R022_SELECT_RCBV0150: PROC;                                            32650000
                                                                        32660000
                                                      /* SOC PTM1273 */ 32670000
   EXEC SQL                                                             32680000
   SELECT ADDRESS_NUMBER,                                               32690000
          ZIP_CODE                                                      32700000
   INTO  :TB_RCBV150.ADDRESS_NUMBER   :WRK_INDNULL,                     32710000
         :TB_RCBV150.ZIP_CODE         :WRK_INDNULL                      32720000
   FROM RCBV0150_CUST_ADDR  T150                                        32730000
   WHERE T150.COUNTRY_NUMBER   = :TB_RCBV150.COUNTRY_NUMBER             32740000
     AND T150.CUSTOMER_NUMBER  = :TB_RCBV150.CUSTOMER_NUMBER            32750000
     AND T150.ADDRESS_NUMBER   =                                        32760000
         (SELECT MIN(ADDRESS_NUMBER)                                    32770000
          FROM RCBV0150_CUST_ADDR                                       32780000
          WHERE COUNTRY_NUMBER   = :TB_RCBV150.COUNTRY_NUMBER           32790000
            AND CUSTOMER_NUMBER  = :TB_RCBV150.CUSTOMER_NUMBER          32800000
            AND ADDRESS_MASK     LIKE '__1%'                            32810000
            AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE)      32820000
   ;                                                                    32830000
                                                      /* EOC PTM1273 */ 32840000
   SELECT (SQLCODE);                                                    32850000
     WHEN (0);                                                          32870007
     WHEN (100);                                                        32871007
     OTHERWISE                                                          32880000
     DO;                                                                32890000
       CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#066');                  32900000
     END;                                                               32910000
   END;                                                                 32920000
 END R022_SELECT_RCBV0150;                                              32930000
1/********************************************************************/ 32940000
 /*                                                                  */ 32950000
 /* MODULE NAME      : R023_SELECT_RCBV0320                          */ 32960000
 /*                                                                  */ 32970000
 /* DESCRIPTION      : SELECT ROW FROM TABLE RCBT0320_SW_ON_HW       */ 32980000
 /*                    RELATED TO THE SELECT LICENSE FROM TABLE      */ 32990000
 /*                    RCBT0200_SW_CUST.                             */ 33000000
 /********************************************************************/ 33010000
 R023_SELECT_RCBV0320: PROC;                                            33020000
                                                                        33030000
   EXEC SQL                                                             33040000
   SELECT PRODUCT_TYPE_HW                                               33050000
        , ORIGIN_HW                                                     33060000
        , SEQUENCE_NUMBER_HW                                            33070000
   INTO :TB_RCBV320.PRODUCT_TYPE_HW     :WRK_INDNULL                    33080000
      , :TB_RCBV320.ORIGIN_HW           :WRK_INDNULL                    33090000
      , :TB_RCBV320.SEQUENCE_NUMBER_HW  :WRK_INDNULL                    33100000
   FROM RCBV0320_SW_ON_HW                                               33110000
   WHERE COUNTRY_NUMBER     = :TB_RCBV320.COUNTRY_NUMBER                33120000
     AND PRODUCT_TYPE_SW    = :TB_RCBV320.PRODUCT_TYPE_SW               33130000
     AND MODEL_NUMBER_SW    = :TB_RCBV320.MODEL_NUMBER_SW               33140000
     AND ORIGIN_SW          = :TB_RCBV320.ORIGIN_SW                     33150000
     AND SEQUENCE_NUMBER_SW = :TB_RCBV320.SEQUENCE_NUMBER_SW            33160000
     AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE              33170000
     AND PRODUCT_TYPE_HW   ¬= '9998'                                    33180000
     AND PRODUCT_TYPE_HW   IS NOT NULL                                  33190000
   ;                                                                    33200000
                                                                        33210000
   SELECT (SQLCODE);                                                    33220000
     WHEN (0);                                                          33230000
     WHEN (100);                                                        33240000
     OTHERWISE                                                          33250000
     DO;                                                                33260000
       CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#067');                  33270000
     END;                                                               33280000
   END;                                                                 33290000
 END R023_SELECT_RCBV0320;                                              33300000
1/********************************************************************/ 33310000
 /*                                                                  */ 33320000
 /* MODULE NAME      : R024_QCH0CMSO                                 */ 33330000
 /*                    OPEN, FETCH AND CLOSE CURSOR                  */ 33340000
 /* DESCRIPTION      : INITIAL ACTIONS FOR CHIS-LAM QCH0CMSO FOR     */ 33350000
 /*                    SPECIFIED COUNTRY                             */ 33360000
 /*                                                                  */ 33370000
 /********************************************************************/ 33380000
 R024_QCH0CMSO: PROC(ACTION);                                           33390000
                                                                        33400000
   DCL ACTION   CHAR(05);                                               33410000
                                                                        33420000
   SELECT(ACTION);                                                      33430000
     WHEN(@OPEN)                                                        33440000
     DO;                                                                33450000
                                                       /* SOC RB01341 */33451015
     IF  WRK_CTRYNO = '755' THEN                                        33451115
       DO;                                                              33452010
            SEARCH_ARG_QCH0CMSI.FR_CTY = '756';                         33453010
            SEARCH_ARG_QCH0CMSI.TO_CTY = '756';                         33454010
       END;                                                             33455010
     ELSE                                                               33456010
       DO;                                                              33457015
                                                       /* EOC RB01341 */33458015
       SEARCH_ARG_QCH0CMSI.FR_CTY  = WRK_CTRYNO;                        33460000
       SEARCH_ARG_QCH0CMSI.TO_CTY  = WRK_CTRYNO;                        33470000
       END;                                                /* RB01341 */33471013
       SEARCH_ARG_QCH0CMSI.ACCMODE = 'OPEN';                            33480000
                                                                        33490000
       CALL QCH0CMM (PTR_SEARCH_QCH0CMSI,ADDR(QCH0CMSO),ADDR(SQLCA));   33500000
                                                                        33510000
       SELECT (SQLCODE);                                                33520000
         WHEN (0);                                                      33530000
         WHEN (+9999)                                                   33540000
         DO;                                                            33550000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#068');                  33560000
         END;                                                           33570000
         OTHERWISE                                                      33580000
         DO;                                                            33590000
           CALL RCBDSBM_ERROR (ADDR(SQLCA), 'DB2','#069');              33600000
         END;                                                           33610000
       END;                                                             33620000
     END;                                                               33630000
     WHEN(@FETCH)                                                       33640000
     DO;                                                                33650000
       SEARCH_ARG_QCH0CMSI.ACCMODE = 'FETCH';                           33660000
                                                                        33670000
       CALL QCH0CMM (PTR_SEARCH_QCH0CMSI,ADDR(QCH0CMSO),ADDR(SQLCA));   33680000
                                                                        33690000
       SELECT (SQLCODE);                                                33700000
         WHEN (0)                                                       33710000
         DO;                                                            33720000
           COUNT.CNT_CTRY.IN_QCH0CMSO = COUNT.CNT_CTRY.IN_QCH0CMSO + 1; 33730000
         END;                                                           33740000
         WHEN (+100);                                                   33750000
         WHEN (+9999)                                                   33760000
         DO;                                                            33770000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#070');                  33780000
         END;                                                           33790000
         OTHERWISE                                                      33800000
         DO;                                                            33810000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#071');              33820000
         END;                                                           33830000
       END;                                                             33840000
     END;                                                               33850000
     WHEN(@CLOSE)                                                       33860000
     DO;                                                                33870000
       SEARCH_ARG_QCH0CMSI.ACCMODE = 'CLOSE';                           33880000
                                                                        33890000
       CALL QCH0CMM (PTR_SEARCH_QCH0CMSI, ADDR(QCH0CMSO), ADDR(SQLCA)); 33900000
                                                                        33910000
       SELECT (SQLCODE);                                                33920000
         WHEN (0);                                                      33930000
         WHEN (+9999)                                                   33940000
         DO;                                                            33950000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#072');                  33960000
         END;                                                           33970000
         OTHERWISE                                                      33980000
         DO;                                                            33990000
           CALL RCBDSBM_ERROR (ADDR(SQLCA), 'DB2', '#073');             34000000
         END;                                                           34010000
       END;                                                             34020000
     END;                                                               34030000
   END;                                                                 34040000
                                                       /* SOC RB01341 */34051013
   IF SEARCH_ARG_QCH0CMSI.FR_CTY = '756' & WRK_CTRYNO ='755' THEN       34052010
        QCH0CMSO.IOPUCTY = '755';                                       34053010
                                                       /* EOC RB01341 */34054013
                                                                        34055016
 END R024_QCH0CMSO;                                                     34060000
                                                                        34070000
1/********************************************************************/ 34080000
 /*                                                                  */ 34090000
 /* MODULE NAME      : R025_QCH0SCSO                                 */ 34100000
 /*                    OPEN, FETCH AND CLOSE CURSOR                  */ 34110000
 /* DESCRIPTION      : SELECT SERVICE CONDITIONS VIA CHIS LAM        */ 34120000
 /*                    QCH0SCM.                                      */ 34130000
 /*                                                                  */ 34140000
 /********************************************************************/ 34150000
 R025_QCH0SCSO: PROC(ACTION);                                           34160000
                                                                        34170000
   DCL ACTION   CHAR(05);                                               34180000
                                                                        34190000
   SELECT(ACTION);                                                      34200000
     WHEN(@OPEN)                                                        34210000
     DO;                                                                34220000
                                                       /* SOC RB01341 */34221015
     IF  WRK_CTRYNO = '755' THEN                                        34221115
                SEARCH_ARG_QCH0SCSI.IOPUCTY = '756' ;                   34222010
     ELSE                                                               34223015
                                                       /* EOC RB01341 */34224015
       SEARCH_ARG_QCH0SCSI.IOPUCTY = WRK_CTRYNO;                        34230000
       SEARCH_ARG_QCH0SCSI.IAGRCID = QCH0CMSO.IAGRCID;                  34240000
       SEARCH_ARG_QCH0SCSI.LDBSOSN = QCH0CMSO.LDBSOSN;                  34250000
       SEARCH_ARG_QCH0SCSI.DAGRCAS = QCH0CMSO.DAGRCAS;                  34260000
       SEARCH_ARG_QCH0SCSI.ACCMODE = 'OPEN';                            34270000
                                                                        34280000
       CALL QCH0SCM (PTR_SEARCH_QCH0SCSI,ADDR(QCH0SCSO),ADDR(SQLCA));   34290000
                                                                        34300000
       SELECT (SQLCODE);                                                34310000
         WHEN (0);                                                      34320000
         WHEN (+9999)                                                   34330000
         DO;                                                            34340000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#074');                  34350000
         END;                                                           34360000
         OTHERWISE                                                      34370000
         DO;                                                            34380000
           CALL RCBDSBM_ERROR (ADDR(SQLCA), 'DB2','#075');              34390000
         END;                                                           34400000
       END;                                                             34410000
     END;                                                               34420000
     WHEN(@FETCH)                                                       34430000
     DO;                                                                34440000
       SEARCH_ARG_QCH0SCSI.ACCMODE = 'FETCH';                           34450000
                                                                        34460000
       CALL QCH0SCM (PTR_SEARCH_QCH0SCSI,ADDR(QCH0SCSO),ADDR(SQLCA));   34470000
                                                                        34480000
       SELECT (SQLCODE);                                                34490000
         WHEN (0)                                                       34500000
         DO;                                                            34510000
           COUNT.CNT_CTRY.IN_QCH0SCSO = COUNT.CNT_CTRY.IN_QCH0SCSO + 1; 34520000
         END;                                                           34530000
         WHEN (+100);                                                   34540000
         WHEN (+9999)                                                   34550000
         DO;                                                            34560000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#076');                  34570000
         END;                                                           34580000
         OTHERWISE                                                      34590000
         DO;                                                            34600000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#077');              34610000
         END;                                                           34620000
       END;                                                             34630000
     END;                                                               34640000
     WHEN(@CLOSE)                                                       34650000
     DO;                                                                34660000
       SEARCH_ARG_QCH0SCSI.ACCMODE = 'CLOSE';                           34670000
                                                                        34680000
       CALL QCH0SCM (PTR_SEARCH_QCH0SCSI, ADDR(QCH0SCSO), ADDR(SQLCA)); 34690000
                                                                        34700000
       SELECT (SQLCODE);                                                34710000
         WHEN (0);                                                      34720000
         WHEN (+9999)                                                   34730000
         DO;                                                            34740000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#078');                  34750000
         END;                                                           34760000
         OTHERWISE                                                      34770000
         DO;                                                            34780000
           CALL RCBDSBM_ERROR (ADDR(SQLCA), 'DB2', '#079');             34790000
         END;                                                           34800000
       END;                                                             34810000
     END;                                                               34820000
   END;                                                                 34830000
                                                                        34840000
                                                       /* SOC RB01341 */34841013
 IF SEARCH_ARG_QCH0SCSI.IOPUCTY = '756' & WRK_CTRYNO = '755' THEN       34842010
 QCH0SCSO.IOPUCTY = '755';                                              34843010
                                                       /* EOC RB01341 */34844013
 END R025_QCH0SCSO;                                                     34850000
                                                                        34860000
1/********************************************************************/ 34870000
 /*                                                                  */ 34880000
 /* MODULE NAME      : R027_QCH0RSSO                                 */ 34890000
 /*                    OPEN, FETCH AND CLOSE CURSOR                  */ 34900000
 /* DESCRIPTION      : INITIAL ACTIONS FOR CHIS-LAM QCH0RSSO FOR     */ 34910000
 /*                    SPECIFIED COUNTRY                             */ 34920000
 /*                                                                  */ 34930000
 /********************************************************************/ 34940000
 R027_QCH0RSSO: PROC(ACTION);                                           34950000
                                                                        34960000
   DCL ACTION    CHAR(05);                                              34970000
                                                                        34980000
   SELECT(ACTION);                                                      34990000
     WHEN(@OPEN)                                                        35000000
     DO;                                                                35010000
                                                       /* SOC RB01341 */35011013
    IF WRK_CTRYNO = '755' THEN                                          35012011
       SEARCH_ARG_QCH0RSSI.IOPUCTY = '756';                             35013011
    ELSE                                                                35014011
                                                       /* EOC RB01341 */35015013
       SEARCH_ARG_QCH0RSSI.IOPUCTY = WRK_CTRYNO;                        35020000
       SEARCH_ARG_QCH0RSSI.IAGRCID = QCH0CMSO.IAGRCID;                  35030000
       SEARCH_ARG_QCH0RSSI.LDBSOSN = QCH0CMSO.LDBSOSN;                  35040000
       SEARCH_ARG_QCH0RSSI.DAGRCAS = QCH0CMSO.DAGRCAS;                  35050000
       SEARCH_ARG_QCH0RSSI.ACCMODE = 'OPEN';                            35060000
                                                                        35070000
       CALL QCH0RSM (PTR_SEARCH_QCH0RSSI,ADDR(QCH0RSSO),ADDR(SQLCA));   35080000
                                                                        35090000
       SELECT (SQLCODE);                                                35100000
         WHEN (0);                                                      35110000
         WHEN (+9999)                                                   35120000
         DO;                                                            35130000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#080');                  35140000
         END;                                                           35150000
         OTHERWISE                                                      35160000
         DO;                                                            35170000
           CALL RCBDSBM_ERROR (ADDR(SQLCA), 'DB2','#081');              35180000
         END;                                                           35190000
       END;                                                             35200000
     END;                                                               35210000
     WHEN(@FETCH)                                                       35220000
     DO;                                                                35230000
       SEARCH_ARG_QCH0RSSI.ACCMODE = 'FETCH';                           35240000
                                                                        35250000
       CALL QCH0RSM (PTR_SEARCH_QCH0RSSI,ADDR(QCH0RSSO),ADDR(SQLCA));   35260000
                                                                        35270000
       SELECT (SQLCODE);                                                35280000
         WHEN (0)                                                       35290000
         DO;                                                            35300000
           COUNT.CNT_CTRY.IN_QCH0RSSO = COUNT.CNT_CTRY.IN_QCH0RSSO + 1; 35310000
         END;                                                           35320000
         WHEN (+100);                                                   35330000
         WHEN (+9999)                                                   35340000
         DO;                                                            35350000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#082');                  35360000
         END;                                                           35370000
         OTHERWISE                                                      35380000
         DO;                                                            35390000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#083');              35400000
         END;                                                           35410000
       END;                                                             35420000
     END;                                                               35430000
     OTHERWISE                                                          35440000
     DO;                                                                35450000
       SEARCH_ARG_QCH0RSSI.ACCMODE = 'CLOSE';                           35460000
                                                                        35470000
       CALL QCH0RSM (PTR_SEARCH_QCH0RSSI, ADDR(QCH0RSSO), ADDR(SQLCA)); 35480000
                                                                        35490000
       SELECT (SQLCODE);                                                35500000
         WHEN (0);                                                      35510000
         WHEN (+9999)                                                   35520000
         DO;                                                            35530000
           CALL RCBDSBM_ERROR (NULL, 'OTHER', '#084');                  35540000
         END;                                                           35550000
         OTHERWISE                                                      35560000
         DO;                                                            35570000
           CALL RCBDSBM_ERROR (ADDR(SQLCA), 'DB2', '#085');             35580000
         END;                                                           35590000
       END;                                                             35600000
     END;                                                               35610000
   END;                                                                 35620000
                                                                        35630000
                                                       /* SOC RB01341 */35631013
 IF SEARCH_ARG_QCH0RSSI.IOPUCTY = '756' & WRK_CTRYNO = '755'  THEN      35632011
 QCH0RSSO.IOPUCTY = '755';                                              35633011
                                                       /* EOC RB01341 */35634013
 END R027_QCH0RSSO;                                                     35640000
                                                                        35650000
1/********************************************************************/ 35660000
 /*                                                                  */ 35670000
 /* MODULE NAME      : R028_USEREXIT_RCBDS4U                         */ 35680000
 /*                                                                  */ 35690000
 /* DESCRIPTION      : CALL USEREXIT FOR MAPPING OF THE ADDRESS LINES*/ 35700000
 /*                    AND ZIP CODE                                  */ 35710000
 /********************************************************************/ 35720000
 R028_USEREXIT_RCBDS4U: PROC;                                           35730000
                                                                        35740000
   USER_FILE_RCBDSB1    = FILE_RCBDSB1, BY NAME;                        35750000
                                                                        35760000
   CALL RCBDS4U (ADDR(SWITCH_USER_EXIT_4)                               35770000
                ,ADDR(USER_FILE_RCBDSB1)                                35780000
                ,ADDR(WRK_ADDRESS_LINES)                                35790000
                ,PTR_INT_AREA);                                         35800000
                                                                        35810000
   IF SWITCH_USER_EXIT_4 = TRUE                                         35820000
   THEN DO;                                                             35830000
     FILE_RCBDSB1.ADDRESS_LINES(1) = USER_FILE_RCBDSB1.ADDRESS_LINES(1);35840000
     FILE_RCBDSB1.ADDRESS_LINES(2) = USER_FILE_RCBDSB1.ADDRESS_LINES(2);35850000
     FILE_RCBDSB1.ADDRESS_LINES(3) = USER_FILE_RCBDSB1.ADDRESS_LINES(3);35860000
     FILE_RCBDSB1.ADDRESS_LINES(4) = USER_FILE_RCBDSB1.ADDRESS_LINES(4);35870000
     FILE_RCBDSB1.ADDRESS_LINES(5) = USER_FILE_RCBDSB1.ADDRESS_LINES(5);35880000
     FILE_RCBDSB1.ZIP_CODE         = USER_FILE_RCBDSB1.ZIP_CODE;        35890000
   END;                                                                 35900000
                                                                        35910000
 END R028_USEREXIT_RCBDS4U;                                             35920000
1/********************************************************************/ 35930000
 /*                                                                  */ 35940000
 /* MODULE NAME      : R030_PROCESS_USEREXIT_N                       */ 35950000
 /*                                                                  */ 35960000
 /* DESCRIPTION      : CALL USEREXIT FOR MAPPING OF THE FIELS:       */ 35970000
 /*                    PRODUCT_DEF_ID (POSITION 16-30), BALANCE      */ 35980000
 /*                    UNITS, BALANCE, CALL BACKTIME, HOURS FROM(7), */ 35990000
 /*                    HOURS TO(7), ADDRESS LINES(5), ZIPCODE, CPU.  */ 36000000
 /*                                                                  */ 36010000
 /********************************************************************/ 36020000
 R030_PROCESS_USEREXIT_N: PROC;                                         36030000
                                                                        36040000
   USER_FILE_RCBDSB1    = FILE_RCBDSB1, BY NAME;                        36050000
   WRK_TYPE_IND         = 'N';                                          36060000
                                                                        36070000
   CALL RCBDS2U (ADDR(SWITCH_USER_EXIT_2)                               36080000
                ,ADDR(WRK_TYPE_IND)                                     36090000
                ,ADDR(WRK_ACCEPT_IND)                                   36100000
                ,ADDR(QCH0CMSO)                           /* RA01220 */ 36110000
                ,ADDR(USER_FILE_RCBDSB1)                                36120000
                ,PTR_INT_AREA);                                         36130000
                                                                        36140000
   IF SWITCH_USER_EXIT_2 = TRUE                                         36150000
   THEN DO;                                                             36160000
     SUBSTR(FILE_RCBDSB1.PRODUCT_DEF_ID,16,15) =                        36170000
                     SUBSTR(USER_FILE_RCBDSB1.PRODUCT_DEF_ID,16,15);    36180000
     FILE_RCBDSB1.BALANCE_UNITS    = USER_FILE_RCBDSB1.BALANCE_UNITS;   36190000
     FILE_RCBDSB1.BALANCE          = USER_FILE_RCBDSB1.BALANCE;         36200000
     FILE_RCBDSB1.CALL_BACK_TIME   = USER_FILE_RCBDSB1.CALL_BACK_TIME;  36210000
     FILE_RCBDSB1.HOURS_FROM(1)    = USER_FILE_RCBDSB1.HOURS_FROM(1);   36220000
     FILE_RCBDSB1.HOURS_FROM(2)    = USER_FILE_RCBDSB1.HOURS_FROM(2);   36230000
     FILE_RCBDSB1.HOURS_FROM(3)    = USER_FILE_RCBDSB1.HOURS_FROM(3);   36240000
     FILE_RCBDSB1.HOURS_FROM(4)    = USER_FILE_RCBDSB1.HOURS_FROM(4);   36250000
     FILE_RCBDSB1.HOURS_FROM(5)    = USER_FILE_RCBDSB1.HOURS_FROM(5);   36260000
     FILE_RCBDSB1.HOURS_FROM(6)    = USER_FILE_RCBDSB1.HOURS_FROM(6);   36270000
     FILE_RCBDSB1.HOURS_FROM(7)    = USER_FILE_RCBDSB1.HOURS_FROM(7);   36280000
     FILE_RCBDSB1.HOURS_TO(1)      = USER_FILE_RCBDSB1.HOURS_TO(1);     36290000
     FILE_RCBDSB1.HOURS_TO(2)      = USER_FILE_RCBDSB1.HOURS_TO(2);     36300000
     FILE_RCBDSB1.HOURS_TO(3)      = USER_FILE_RCBDSB1.HOURS_TO(3);     36310000
     FILE_RCBDSB1.HOURS_TO(4)      = USER_FILE_RCBDSB1.HOURS_TO(4);     36320000
     FILE_RCBDSB1.HOURS_TO(5)      = USER_FILE_RCBDSB1.HOURS_TO(5);     36330000
     FILE_RCBDSB1.HOURS_TO(6)      = USER_FILE_RCBDSB1.HOURS_TO(6);     36340000
     FILE_RCBDSB1.HOURS_TO(7)      = USER_FILE_RCBDSB1.HOURS_TO(7);     36350000
     FILE_RCBDSB1.ADDRESS_LINES(1) =                                    36360000
                                USER_FILE_RCBDSB1.ADDRESS_LINES(1);     36370000
     FILE_RCBDSB1.ADDRESS_LINES(2) =                                    36380000
                                USER_FILE_RCBDSB1.ADDRESS_LINES(2);     36390000
     FILE_RCBDSB1.ADDRESS_LINES(3) =                                    36400000
                                USER_FILE_RCBDSB1.ADDRESS_LINES(3);     36410000
     FILE_RCBDSB1.ADDRESS_LINES(4) =                                    36420000
                                USER_FILE_RCBDSB1.ADDRESS_LINES(4);     36430000
     FILE_RCBDSB1.ADDRESS_LINES(5) =                                    36440000
                                USER_FILE_RCBDSB1.ADDRESS_LINES(5);     36450000
     FILE_RCBDSB1.ZIP_CODE         = USER_FILE_RCBDSB1.ZIP_CODE;        36460000
     FILE_RCBDSB1.CPU              = USER_FILE_RCBDSB1.CPU;             36470000
                                                       /* SOC RA01220 */36480000
     FILE_RCBDSB1.MAIN_OBJECT      = USER_FILE_RCBDSB1.MAIN_OBJECT;     36490000
                                                       /* EOC RA01220 */36500000
   END;                                                                 36510000
   ELSE DO;                                     /* SWITCH IS FALSE   */ 36520000
     CALL RCBDSBM_ERROR (NULL,'OTHER','#086');                          36530014
   END;                                                                 36540014
                                                                        36550000
 END R030_PROCESS_USEREXIT_N;                                           36560000
1/********************************************************************/ 36570000
 /*                                                                  */ 36580000
 /* MODULE NAME      : R031_PROCESS_USEREXIT_R                       */ 36590000
 /*                                                                  */ 36600000
 /* DESCRIPTION      : CALL USEREXIT FOR MAPPING OF THE FIELS:       */ 36610000
 /*                    BALANCE UNITS AND BALANCE.                    */ 36620000
 /*                                                                  */ 36630000
 /********************************************************************/ 36640000
 R031_PROCESS_USEREXIT_R: PROC;                                         36650000
                                                                        36660000
   USER_FILE_RCBDSB1    = FILE_RCBDSB1, BY NAME;                        36670000
   WRK_TYPE_IND         = 'R';                                          36680000
                                                                        36690000
   CALL RCBDS2U (ADDR(SWITCH_USER_EXIT_2)                               36700000
                ,ADDR(WRK_TYPE_IND)                                     36710000
                ,ADDR(WRK_ACCEPT_IND)                                   36720000
                ,ADDR(QCH0RSSO)                                         36730000
                ,ADDR(USER_FILE_RCBDSB1)                                36740000
                ,PTR_INT_AREA);                                         36750000
                                                                        36760000
   IF SWITCH_USER_EXIT_2 = TRUE                                         36770000
   THEN DO;                                                             36780000
     FILE_RCBDSB1.BALANCE_UNITS    = USER_FILE_RCBDSB1.BALANCE_UNITS;   36790000
     FILE_RCBDSB1.BALANCE          = USER_FILE_RCBDSB1.BALANCE;         36800000
   END;                                                                 36810000
   ELSE DO;                                                             36820000
     CALL RCBDSBM_ERROR (NULL,'OTHER','#087');                          36830000
   END;                                                                 36840000
                                                                        36850000
 END R031_PROCESS_USEREXIT_R;                                           36860000
1/********************************************************************/ 36870000
 /*                                                                  */ 36880000
 /* MODULE NAME      : R032_PROCESS_USEREXIT_O                       */ 36890000
 /*                                                                  */ 36900000
 /* DESCRIPTION      : CALL USEREXIT FOR CHECKING THE ACCEPT         */ 36910000
 /*                    INDICATOR.                                    */ 36920000
 /*                                                                  */ 36930000
 /********************************************************************/ 36940000
 R032_PROCESS_USEREXIT_O: PROC;                                         36950000
                                                                        36960000
   USER_FILE_RCBDSB1    = FILE_RCBDSB1, BY NAME;                        36970000
   WRK_TYPE_IND         = 'O';                                          36980000
   WRK_ACCEPT_IND       = 'N';                                          36990014
                                                                        37000000
   CALL RCBDS2U (ADDR(SWITCH_USER_EXIT_2)                               37010000
                ,ADDR(WRK_TYPE_IND)                                     37020000
                ,ADDR(WRK_ACCEPT_IND)                                   37030000
                ,ADDR(QCH0CMSO)                                         37040000
                ,ADDR(USER_FILE_RCBDSB1)                                37050000
                ,PTR_INT_AREA);                                         37060000
                                                                        37070000
   IF SWITCH_USER_EXIT_2 = FALSE                                        37071014
   THEN DO;                                                             37072011
     CALL RCBDSBM_ERROR (NULL,'OTHER','#088');                          37073011
   END;                                                                 37074014
                                                                        37120000
 END R032_PROCESS_USEREXIT_O;                                           37130000
1/********************************************************************/ 37140000
 /*                                                                  */ 37150000
 /* MODULE NAME      : R033_PROCESS_USEREXIT_Y                       */ 37160000
 /*                                                                  */ 37170000
 /* DESCRIPTION      : CALL USEREXIT FOR MAPPING OF THE FIELDS:      */ 37180000
 /*                    PRODUCT_DEF_ID (POSITION 16-30), BALANCE      */ 37190000
 /*                    CALL BACKTIME, HOURS FROM(7) AND HOURS TO (7).*/ 37200000
 /********************************************************************/ 37210000
 R033_PROCESS_USEREXIT_Y: PROC;                                         37220000
                                                                        37230000
   USER_FILE_RCBDSB1    = FILE_RCBDSB1, BY NAME;                        37240000
   WRK_TYPE_IND         = 'Y';                                          37250000
                                                                        37260000
   CALL RCBDS2U (ADDR(SWITCH_USER_EXIT_2)                               37270000
                ,ADDR(WRK_TYPE_IND)                                     37280000
                ,ADDR(WRK_ACCEPT_IND)                                   37290000
                ,ADDR(QCH0SCSO)                                         37300000
                ,ADDR(USER_FILE_RCBDSB1)                                37310000
                ,PTR_INT_AREA);                                         37320000
                                                                        37330000
   IF SWITCH_USER_EXIT_2 = TRUE                                         37340000
   THEN DO;                                                             37350000
     FILE_RCBDSB1.CALL_BACK_TIME   = USER_FILE_RCBDSB1.CALL_BACK_TIME;  37360000
     FILE_RCBDSB1.HOURS_FROM(1)    = USER_FILE_RCBDSB1.HOURS_FROM(1);   37370000
     FILE_RCBDSB1.HOURS_FROM(2)    = USER_FILE_RCBDSB1.HOURS_FROM(2);   37380000
     FILE_RCBDSB1.HOURS_FROM(3)    = USER_FILE_RCBDSB1.HOURS_FROM(3);   37390000
     FILE_RCBDSB1.HOURS_FROM(4)    = USER_FILE_RCBDSB1.HOURS_FROM(4);   37400000
     FILE_RCBDSB1.HOURS_FROM(5)    = USER_FILE_RCBDSB1.HOURS_FROM(5);   37410000
     FILE_RCBDSB1.HOURS_FROM(6)    = USER_FILE_RCBDSB1.HOURS_FROM(6);   37420000
     FILE_RCBDSB1.HOURS_FROM(7)    = USER_FILE_RCBDSB1.HOURS_FROM(7);   37430000
     FILE_RCBDSB1.HOURS_TO(1)      = USER_FILE_RCBDSB1.HOURS_TO(1);     37440000
     FILE_RCBDSB1.HOURS_TO(2)      = USER_FILE_RCBDSB1.HOURS_TO(2);     37450000
     FILE_RCBDSB1.HOURS_TO(3)      = USER_FILE_RCBDSB1.HOURS_TO(3);     37460000
     FILE_RCBDSB1.HOURS_TO(4)      = USER_FILE_RCBDSB1.HOURS_TO(4);     37470000
     FILE_RCBDSB1.HOURS_TO(5)      = USER_FILE_RCBDSB1.HOURS_TO(5);     37480000
     FILE_RCBDSB1.HOURS_TO(6)      = USER_FILE_RCBDSB1.HOURS_TO(6);     37490000
     FILE_RCBDSB1.HOURS_TO(7)      = USER_FILE_RCBDSB1.HOURS_TO(7);     37500000
   END;                                                                 37510000
   ELSE DO;                                                             37520000
     CALL RCBDSBM_ERROR (NULL,'OTHER','#089');                          37530000
   END;                                                                 37540000
                                                                        37550000
 END R033_PROCESS_USEREXIT_Y;                                           37560000
1/********************************************************************/ 37570000
 /*                                                                  */ 37580000
 /* MODULE NAME      : R035_FILL_RCBDSB1                             */ 37590000
 /*                                                                  */ 37600000
 /* DESCRIPTION      : FILL OUTPUT RECORD WITH ESA/SSA DATA          */ 37610000
 /********************************************************************/ 37620000
 R035_FILL_RCBDSB1: PROC;                                               37630000
                                                                        37640000
   FILE_RCBDSB1 = '';                                                   37650000
   FILE_RCBDSB1.KEY.COUNTRY_NUMBER = WRK_CTRYNO;                        37660000
   FILE_RCBDSB1.KEY.SOURCE_ID   = 'E';                                  37670000
   FILE_RCBDSB1.COUNTRY_NUMBER  = WRK_CTRYNO;                           37680000
                                                       /* SOC RB01320 */37690009
   IF (WRK_DUMMY_ORIGIN_IND = -1 & WRK_DUMMY_SEQ_NUM_IND = -1) THEN     37700004
                                                       /* EOC RB01320 */37701009
   FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV240.PRODUCT_TYPE    ||         37710000
                                  TB_RCBV240.ORIGIN          ||         37720000
                                  TB_RCBV240.SEQUENCE_NUMBER;           37730000
   ELSE                                                /* SOC RB01320 */37740005
      FILE_RCBDSB1.KEY.UNIQUE_KEY  = TB_RCBV240.PRODUCT_TYPE    ||      37750004
                                     TB_RCBV125.DUMMY_ORIGIN    ||      37760000
                                     TB_RCBV125.DUMMY_SEQUENCE_NUM;     37770000
                                                       /* EOC RB01320 */37780005
   FILE_RCBDSB1.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;           37790000
   FILE_RCBDSB1.PRODUCT_DEF_ID  = 'SSA';                                37800000
   FILE_RCBDSB1.CONTRACT_NUMBER = 'E' || WRK_CTRYNO       ||            37810000
                                  TB_RCBV240.CONTRACT_NUMBER;           37820000
   FILE_RCBDSB1.START_DATE      = TB_RCBV240.EFFECTIVE_DATE;            37830000
   FILE_RCBDSB1.END_DATE        = TB_RCBV240.END_DATE;                  37840000
                                                       /* SOC RB01320 */37850009
   IF (WRK_DUMMY_ORIGIN_IND = -1 & WRK_DUMMY_SEQ_NUM_IND = -1) THEN     37860004
                                                       /* EOC RB01320 */37861009
   FILE_RCBDSB1.EXTERNAL_KEY    = 'E' || WRK_CTRYNO       ||            37870000
                                  TB_RCBV240.PRODUCT_TYPE ||            37880000
                                  TB_RCBV240.ORIGIN       ||            37890000
                                  TB_RCBV240.SEQUENCE_NUMBER;           37900000
   ELSE                                                /* SOC RB01320 */37910005
      FILE_RCBDSB1.EXTERNAL_KEY    = 'E' || WRK_CTRYNO       ||         37920000
                                     TB_RCBV240.PRODUCT_TYPE ||         37930004
                                     TB_RCBV125.DUMMY_ORIGIN ||         37940000
                                     TB_RCBV125.DUMMY_SEQUENCE_NUM;     37950000
                                                       /* EOC RB01320 */37960005
   FILE_RCBDSB1.HOURS_FROM(1)   =                                       37970000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_7);        37980000
   FILE_RCBDSB1.HOURS_TO(1)     =                                       37990000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_7);          38000000
   FILE_RCBDSB1.HOURS_FROM(2)   =                                       38010000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_1);        38020000
   FILE_RCBDSB1.HOURS_TO(2)     =                                       38030000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_1);          38040000
   FILE_RCBDSB1.HOURS_FROM(3)   =                                       38050000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_2);        38060000
   FILE_RCBDSB1.HOURS_TO(3)     =                                       38070000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_2);          38080000
   FILE_RCBDSB1.HOURS_FROM(4)   =                                       38090000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_3);        38100000
   FILE_RCBDSB1.HOURS_TO(4)     =                                       38110000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_3);          38120000
   FILE_RCBDSB1.HOURS_FROM(5)   =                                       38130000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_4);        38140000
   FILE_RCBDSB1.HOURS_TO(5)     =                                       38150000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_4);          38160000
   FILE_RCBDSB1.HOURS_FROM(6)   =                                       38170000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_5);        38180000
   FILE_RCBDSB1.HOURS_TO(6)     =                                       38190000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_5);          38200000
   FILE_RCBDSB1.HOURS_FROM(7)   =                                       38210000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_START_6);        38220000
   FILE_RCBDSB1.HOURS_TO(7)     =                                       38230000
              R037_ISOTIME2MINUTES(TB_RCBV240.COVERAGE_END_6);          38240000
                                                       /* SOC RB01320 */38241009
   IF (WRK_DUMMY_ORIGIN_IND = -1 & WRK_DUMMY_SEQ_NUM_IND = -1) THEN     38250004
                                                       /* EOC RB01320 */38251009
   FILE_RCBDSB1.CPU             = TB_RCBV240.PRODUCT_TYPE  ||           38260000
                                  TB_RCBV240.ORIGIN        ||           38270000
                                  TB_RCBV240.SEQUENCE_NUMBER;           38280000
   ELSE                                                /* SOC RB01320 */38290005
      FILE_RCBDSB1.CPU             = TB_RCBV240.PRODUCT_TYPE  ||        38300004
                                     TB_RCBV125.DUMMY_ORIGIN  ||        38310000
                                     TB_RCBV125.DUMMY_SEQUENCE_NUM;     38320000
                                                       /* EOC RB01320 */38330005
   WRK_ADDRESS_NUMBER = '';                                             38340000
                                                                        38350000
   IF PARM_RCB005.ADDRESS_RES = '1'                                     38360000
   THEN DO;                         /* RETRIEVE ADDRESS NUMBER   */     38370000
     TB_RCBV340 = '';                                                   38380000
     TB_RCBV150 = '';                                                   38390000
     TB_RCBV340.PRODUCT_TYPE    = TB_RCBV240.PRODUCT_TYPE;              38400000
     TB_RCBV340.ORIGIN          = TB_RCBV240.ORIGIN;                    38410000
     TB_RCBV340.SEQUENCE_NUMBER = TB_RCBV240.SEQUENCE_NUMBER;           38420000
     TB_RCBV340.CUSTOMER_USER   = TB_RCBV190.CUSTOMER_NUMBER;           38430000
     TB_RCBV150.COUNTRY_NUMBER  = WRK_CTRYNO;                           38440000
     TB_RCBV150.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;           38450000
                                                                        38460000
     CALL R019_SELECT_RCBV0340;                                         38470000
                                                                        38480000
     IF SQLCODE = 0                                                     38490000
     THEN DO;                                                           38500000
       FILE_RCBDSB1.ZIP_CODE = TB_RCBV150.ZIP_CODE;                     38510000
       WRK_ADDRESS_NUMBER    = TB_RCBV340.ADDRESS_NUMBER;               38520000
     END;                                                               38530000
   END;                                                                 38540000
                                                                        38550000
   IF WRK_ADDRESS_NUMBER = ''                                           38560000
   THEN DO;                          /* RETRIEVE ADDRESS NUMBER    */   38570000
     TB_RCBV150 = '';                                                   38580000
     TB_RCBV150.COUNTRY_NUMBER  = WRK_CTRYNO;                           38590000
     TB_RCBV150.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;           38600000
                                                                        38610000
     CALL R022_SELECT_RCBV0150;                                         38620000
                                                                        38630000
     IF SQLCODE = 0                                                     38640000
     THEN DO;                                                           38650000
       FILE_RCBDSB1.ZIP_CODE = TB_RCBV150.ZIP_CODE;                     38660000
       WRK_ADDRESS_NUMBER    = TB_RCBV150.ADDRESS_NUMBER;               38670000
     END;                                                               38680000
   END;                                                                 38690000
                                                                        38700000
   WRK_ADDRESS_LINES = '';                                              38710000
                                                                        38720000
   IF WRK_ADDRESS_NUMBER > ''       /* RETRIEVE ADDRESS LINES      */   38730000
   THEN DO;                                                             38740000
     TB_RCBV280 = '';                                                   38750000
     TB_RCBV280.COUNTRY_NUMBER  = WRK_CTRYNO;                           38760000
     TB_RCBV280.CUSTOMER_NUMBER = TB_RCBV190.CUSTOMER_NUMBER;           38770000
     TB_RCBV280.ADDRESS_NUMBER  = WRK_ADDRESS_NUMBER;                   38780000
                                                                        38790000
     CALL R014_ADDRESS_LINES(@OPEN);                                    38800000
     CALL R014_ADDRESS_LINES(@FETCH);                                   38810000
     DO I = 1 TO 9 WHILE(SQLCODE = 0);                                  38820000
       WRK_ADDRESS_LINES.LINE(I) = TB_RCBV280.TEXT;                     38830000
       CALL R014_ADDRESS_LINES(@FETCH);                                 38840000
     END;                                                               38850000
     CALL R014_ADDRESS_LINES(@CLOSE);                                   38860000
                                                                        38870000
     DO I = 1 TO 5;                                                     38880000
       FILE_RCBDSB1.ADDRESS_LINES(I) = WRK_ADDRESS_LINES.LINE(I);       38890000
     END;                                                               38900000
   END;                                                                 38910000
                                                                        38920000
 END R035_FILL_RCBDSB1;                                                 38930000
1/********************************************************************/ 38940000
 /*                                                                  */ 38950000
 /* MODULE NAME      : R037_ISOTIME2MINUTES                          */ 38960000
 /*                                                                  */ 38970000
 /* DESCRIPTION      : CONVERT ISO TIME HH.MM.SS TO MINUTES AFTER    */ 38980000
 /*                    MIDNIGHT. SECONDS ARE DISCARDED.              */ 38990000
 /* ARGUMENT         : CHAR      (08) ISOTIME  'HH.MM.SS'            */ 39000000
 /* RETURNS          : FIXED BIN (31)                                */ 39010000
 /*                                                                  */ 39020000
 /********************************************************************/ 39030000
 R037_ISOTIME2MINUTES: PROC(ISOTIME) RETURNS(FIXED BIN(31));            39040000
                                                                        39050000
 DCL ISOTIME     CHAR(08);                                              39060000
 DCL 1 P_ISOTIME BASED(ADDR(ISOTIME)),                                  39070000
     3 HOUR      PIC '99',                                              39080000
     3 FILLER1   CHAR(01),                                              39090000
     3 MINUTE    PIC '99',                                              39100000
     3 FILLER2   CHAR(03);                                              39110000
                                                                        39120000
 RETURN ((60*P_ISOTIME.HOUR) + P_ISOTIME.MINUTE);                       39130000
                                                                        39140000
 END R037_ISOTIME2MINUTES;                                              39150000
                                                                        39160000
1/********************************************************************/ 39170000
 /*                                                                  */ 39180000
 /* MODULE NAME      : R038_DETERMINE_SEQ_NR_KEY                     */ 39190000
 /*                                                                  */ 39200000
 /* DESCRIPTION      : RETRIEVE THE SEQUENCE NUMBER FROM TABLE       */ 39210000
 /*                    RCBT0670_CCMS_KEYS FOR THE GIVEN CEDS LONG    */ 39220000
 /*                    KEY. IF NOT FOUND, INSERT A NEW ROW, WITH     */ 39230000
 /*                    SEQUENCE NUMBER = MAX SEQUENCE NUMBER + 1.    */ 39240000
 /*                                                                  */ 39250000
 /********************************************************************/ 39260000
 R038_DETERMINE_SEQ_NR_KEY: PROC;                                       39270000
                                                                        39280000
                                          /* RETRIEVE SEQ NR         */ 39290000
   TB_RCBV670                 = '';                                     39300000
   TB_RCBV670_I               = '';                                     39310000
   TB_RCBV670.CEDS_CTRY_NUMBER  = WRK_CTRYNO;                           39320000
   TB_RCBV670.CEDS_SOURCE_ID    = TB_RCBV660.SOURCE_TYPE_ID;            39330000
   TB_RCBV670.CEDS_LONG_KEY     = WRK_CEDS_LONG_KEY;                    39340000
                                                                        39350000
   CALL RCBI67M (ADDR(TB_RCBV670),                                      39360000
                 ADDR(TB_RCBV670_I),                                    39370000
                 PTR_RETURN_AREA_BB,                                    39380000
                 PTR_INT_AREA);                                         39390000
                                                                        39400000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  39410000
     WHEN (0) DO;                         /* SEQ NR EXISTS           */ 39420000
       WRK_SEQ_NR_KEY     = TB_RCBV670.CCMS_SEQUENCE_NO;                39430000
       END;                                                             39440000
     WHEN (4) DO;                         /* SEQ NR DOES NOT EXIST   */ 39450000
       WRK_MAX_KEY     = WRK_MAX_KEY + 1;                               39460000
       WRK_SEQ_NR_KEY  = WRK_MAX_KEY;                                   39470000
                                          /* INSERT NEW SEQ NR       */ 39480000
       TB_RCBV670                 = '';                                 39490000
       TB_RCBV670_I               = '';                                 39500000
       TB_RCBV670.CEDS_CTRY_NUMBER  = WRK_CTRYNO;                       39510000
       TB_RCBV670.CEDS_SOURCE_ID    = TB_RCBV660.SOURCE_TYPE_ID;        39520000
       TB_RCBV670.CEDS_LONG_KEY     = WRK_CEDS_LONG_KEY;                39530000
       TB_RCBV670.CCMS_CTRY_NUMBER  = WRK_CTRYNO;                       39540000
       TB_RCBV670.CCMS_SOURCE_ID    = TB_RCBV660.SOURCE_TYPE_ID;        39550000
       TB_RCBV670.CCMS_SEQUENCE_NO  = WRK_SEQ_NR_KEY;                   39560000
                                                                        39570000
       CALL RCBF67M (ADDR(TB_RCBV670),                                  39580000
                     ADDR(TB_RCBV670_I),                                39590000
                     PTR_RETURN_AREA_BB,                                39600000
                     PTR_INT_AREA);                                     39610000
                                                                        39620000
       SELECT(RETURN_AREA_BB.RETURN_CODE);                              39630000
         WHEN (0);                                                      39640000
         OTHERWISE DO;                    /* INSERT FAILED           */ 39650000
           CALL RCBDSBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),          39660000
                        'DB2','#090');                                  39670000
           END;                                                         39680000
         END;                                                           39690000
       END;                                                             39700000
                                                                        39710000
     OTHERWISE DO;                          /* ERROR DURING RETRIEVE */ 39720000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            39730000
                                 'DB2',                                 39740000
                                 '#091');                               39750000
       END;                                                             39760000
     END;                                                               39770000
                                                                        39780000
 END R038_DETERMINE_SEQ_NR_KEY;                                         39790000
                                                       /*SOC RB01289 */ 39800000
1/********************************************************************/ 39810000
 /*                                                                  */ 39820000
 /* MODULE NAME      : R040_T010_CUSTOMER              RB01289       */ 39830000
 /*                                                                  */ 39840000
 /* DESCRIPTION      : RETRIEVE THE CUSTOMER NUMBER FROM TABLE       */ 39850000
 /*                    RCBT0010_CUSTOMER                             */ 39860000
 /*                                                                  */ 39870000
 /********************************************************************/ 39880000
 R040_T010_CUSTOMER:   PROC;                                            39890000
                                                                        39900000
   T010_CUSTOMER_FLAG = FALSE;                                          39910000
                                                                        39920000
   EXEC SQL                                                             39930000
   SELECT DISTINCT(T010.CUSTOMER_NUMBER)                                39940000
    INTO :TB_RCBV010.CUSTOMER_NUMBER  :WRK_INDNULL                      39950000
   FROM RCBV0010_CUSTOMER T010 ,                                        39960000
        RCBV0051_PI_HW_PR T051                                          39970000
   WHERE T010.COUNTRY_NUMBER    = T051.COUNTRY_NUMBER                   39980000
      AND T010.CUSTOMER_NUMBER  = T051.CUSTOMER_NUMBER                  39990000
      AND T010.COUNTRY_NUMBER   = :WRK_CTRYNO                           40000000
      AND T010.CUSTOMER_NUMBER  = :TB_RCBV051.CUSTOMER_NUMBER           40010000
      AND :WRK_RUN_DATE BETWEEN                                         40020000
         T010.EFFECTIVE_DATE AND T010.END_DATE                          40030000
   ;                                                                    40040000
                                                                        40050000
   SELECT (SQLCODE);                                                    40060000
     WHEN (0)                                                           40070000
     T010_CUSTOMER_FLAG = TRUE;                                         40080000
     WHEN (100)                                                         40090000
     T010_CUSTOMER_FLAG = FALSE;                                        40100000
     OTHERWISE                                                          40110000
     DO;                                                                40120000
       CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#100');                  40130000
     END;                                                               40140000
   END;                                                                 40150000
                                                                        40160000
 END R040_T010_CUSTOMER;                                                40170000
                                                                        40180000
1/********************************************************************/ 40190000
 /*                                                                  */ 40200000
 /* MODULE NAME      : R041_T190_OR_T011_CUSTOMER        RB01289     */ 40210000
 /*                                                                  */ 40220000
 /* DESCRIPTION      : RETRIEVE THE CUSTOMER NUMBER FROM TABLE       */ 40230000
 /*                    RCBT0190_HW_CUST OR FROM RCBT0011_PI_CUST     */ 40240000
 /*                                                                  */ 40250000
 /********************************************************************/ 40260000
 R041_T190_OR_T011_CUSTOMER:  PROC;                                     40270000
                                                                        40280000
   WRK_T0190_CUSTOMER_NUMBER = '';                                      40290000
   T011_CUSTOMER_FLAG        = FALSE;                                   40300000
   T0190_CUSTOMER_FLAG       = FALSE;                                   40310000
                                                                        40320000
   EXEC SQL                                                             40330000
   SELECT T190.CUSTOMER_NUMBER                                          40340000
    INTO :WRK_T0190_CUSTOMER_NUMBER  :WRK_INDNULL                       40350000
   FROM RCBV0051_PI_HW_PR T051 ,                                        40360000
        RCBV0190_HW_CUST  T190                                          40370000
       ,RCBV0125_DMMY_REAL         T125                  /* RB01320 */  40380005
   WHERE T190.COUNTRY_NUMBER    = T051.COUNTRY_NUMBER                   40390000
     AND T190.PRODUCT_TYPE      = T051.PRODUCT_TYPE                     40400000
     AND T190.ORIGIN            = T051.ORIGIN                           40410000
     AND T190.SEQUENCE_NUMBER   = T051.SEQUENCE_NUMBER                  40420000
     AND T190.COUNTRY_NUMBER    = :WRK_CTRYNO                           40430000
     AND T190.PRODUCT_TYPE      = :TB_RCBV241.PRODUCT_TYPE              40440000
                                                       /* SOC RB01320 */40440105
  /* AND T190.ORIGIN            = :TB_RCBV241.ORIGIN                    40440200
     AND T190.SEQUENCE_NUMBER   = :TB_RCBV241.SEQUENCE_NUMBER */        40440300
     AND ((T190.ORIGIN                  = :TB_RCBV241.ORIGIN            40450000
     AND T190.SEQUENCE_NUMBER           = :TB_RCBV241.SEQUENCE_NUMBER)  40460000
     OR  (T190.COUNTRY_NUMBER           = T125.COUNTRY_NUMBER           40461000
     AND T190.PRODUCT_TYPE              = T125.PRODUCT_TYPE             40462000
     AND (T190.ORIGIN||T190.SEQUENCE_NUMBER                             40470000
                                        = T125.REAL_SERIAL_NUMBER)      40480000
     AND T125.DUMMY_ORIGIN              = :TB_RCBV241.ORIGIN            40490000
     AND T125.DUMMY_SEQUENCE_NUM        = :TB_RCBV241.SEQUENCE_NUMBER)) 40500000
                                                       /* EOC RB01320 */40501005
     AND T190.TYPE_OF_RELATION  = 'U'                 /* CEDS00000468 */40510000
     AND :WRK_RUN_DATE BETWEEN                                          40520000
         T190.EFFECTIVE_DATE AND T190.END_DATE                          40530000
   ;                                                                    40540000
                                                                        40550000
   SELECT (SQLCODE);                                                    40560000
     WHEN (0)                                                           40570000
     T0190_CUSTOMER_FLAG = TRUE;                                        40580000
     WHEN (100)                                                         40590000
     DO;                                                                40600000
      T0190_CUSTOMER_FLAG = FALSE;                                      40610000
                                                                        40620000
      EXEC SQL                                                          40630000
      SELECT DISTINCT(T011.CUSTOMER_NUMBER)                             40640000
      INTO :TB_RCBV011.CUSTOMER_NUMBER    :WRK_INDNULL                  40650000
      FROM RCBV0011_PI_CUST T011 ,                                      40660000
           RCBV0051_PI_HW_PR T051                                       40670000
      WHERE T011.COUNTRY_NUMBER     = T051.COUNTRY_NUMBER               40680000
      AND   T011.CUSTOMER_NUMBER    = T051.CUSTOMER_NUMBER              40690000
      AND   T011.CUSTOMER_NR_EXTEND = T051.CUSTOMER_NR_EXTEND           40700000
      AND   T011.COUNTRY_NUMBER     = :WRK_CTRYNO                       40710000
      AND   T011.CUSTOMER_NUMBER    = :TB_RCBV051.CUSTOMER_NUMBER       40720000
      AND   T011.CUSTOMER_NR_EXTEND = :TB_RCBV051.CUSTOMER_NR_EXTEND    40730000
      ;                                                                 40740000
                                                                        40750000
        SELECT (SQLCODE);                                               40760000
          WHEN (0)                                                      40770000
          T011_CUSTOMER_FLAG = TRUE;                                    40780000
          WHEN (100)                                                    40790000
          T011_CUSTOMER_FLAG = FALSE;                                   40800000
          OTHERWISE                                                     40810000
          DO;                                                           40820000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#101');              40830000
          END;                                                          40840000
        END;                                                            40850000
      END;                                                              40860000
        OTHERWISE                                                       40870000
        DO;                                                             40880000
           CALL RCBDSBM_ERROR (ADDR (SQLCA),'DB2','#102');              40890000
        END;                                                            40900000
      END;                                                              40910000
                                                                        40920000
 END R041_T190_OR_T011_CUSTOMER;                                        40930000
                                                                        40940000
1/********************************************************************/ 40950000
 /*                                                                  */ 40960000
 /* MODULE NAME      : R042_BAU_CUSTOMER_INFO        RB01289         */ 40970000
 /*                                                                  */ 40980000
 /* DESCRIPTION      : RETRIEVE BUA CUSTOMER INFORMATION             */ 40990000
 /*                                                                  */ 41000000
 /********************************************************************/ 41010000
 R042_BAU_CUSTOMER_INFO:   PROC;                                        41020000
                                                                        41030000
     WRK_ADDRESS_LINES = '';                                            41040000
     TB_RCBV150        = '';                                            41050000
     TB_RCBV150.COUNTRY_NUMBER  = WRK_CTRYNO;                           41060000
     TB_RCBV150.CUSTOMER_NUMBER = FILE_RCBDSB1.CUSTOMER_NUMBER;         41070000
                                                                        41080000
     CALL R022_SELECT_RCBV0150;                                         41090000
                                                                        41100000
     IF SQLCODE = 0                                                     41110000
     THEN DO;                                                           41120000
       FILE_RCBDSB1.ZIP_CODE      = TB_RCBV150.ZIP_CODE;                41130000
                                                                        41140000
       TB_RCBV280 = '';                                                 41150000
       TB_RCBV280.COUNTRY_NUMBER  = WRK_CTRYNO;                         41160000
       TB_RCBV280.CUSTOMER_NUMBER = FILE_RCBDSB1.CUSTOMER_NUMBER;       41170000
       TB_RCBV280.ADDRESS_NUMBER  = TB_RCBV150.ADDRESS_NUMBER;          41180000
                                                                        41190000
       CALL R014_ADDRESS_LINES(@OPEN);                                  41200000
       CALL R014_ADDRESS_LINES(@FETCH);                                 41210000
       DO I = 1 TO 9 WHILE(SQLCODE = 0);                                41220000
         WRK_ADDRESS_LINES.LINE(I) = TB_RCBV280.TEXT;                   41230000
         CALL R014_ADDRESS_LINES(@FETCH);                               41240000
       END;                                                             41250000
       CALL R014_ADDRESS_LINES(@CLOSE);                                 41260000
                                                                        41270000
       DO I = 1 TO 5;                                                   41280000
         FILE_RCBDSB1.ADDRESS_LINES(I) = WRK_ADDRESS_LINES.LINE(I);     41290000
       END;                                                             41300000
     END;                                                               41310000
                                                                        41320000
     IF SWITCH_USER_EXIT_4 = TRUE                                       41330000
     THEN DO;                                                           41340000
       CALL R028_USEREXIT_RCBDS4U;                                      41350000
     END;                                                               41360000
 END R042_BAU_CUSTOMER_INFO;                                            41370000
1/********************************************************************/ 41380000
 /*                                                                  */ 41390000
 /* MODULE NAME      : R043_PI_CUSTOMER_INFO         RB01289         */ 41400000
 /*                                                                  */ 41410000
 /* DESCRIPTION      : RETRIEVE PI CUSTOMER INFORMATION              */ 41420000
 /*                                                                  */ 41430000
 /********************************************************************/ 41440000
 R043_PI_CUSTOMER_INFO:   PROC;                                         41450000
                                                                        41460000
     TB_RCBV011 = '';                                                   41470000
     TB_RCBV011.COUNTRY_NUMBER     = WRK_CTRYNO;                        41480000
     TB_RCBV011.CUSTOMER_NUMBER    = FILE_RCBDSB1.CUSTOMER_NUMBER;      41490000
     TB_RCBV011.CUSTOMER_NR_EXTEND = TB_RCBV051.CUSTOMER_NR_EXTEND;     41500000
                                                                        41510000
     CALL R020_SELECT_RCBV011;                                          41520000
                                                                        41530000
     IF SQLCODE = 0                                                     41540000
     THEN DO;                                                           41550000
       FILE_RCBDSB1.ZIP_CODE         = TB_RCBV011.ZIP_CODE;             41560000
       FILE_RCBDSB1.ADDRESS_LINES(1) = TB_RCBV011.ADDRESS_LINE_1;       41570000
       FILE_RCBDSB1.ADDRESS_LINES(2) = TB_RCBV011.ADDRESS_LINE_2;       41580000
       FILE_RCBDSB1.ADDRESS_LINES(3) = TB_RCBV011.ADDRESS_LINE_3;       41590000
     END;                                                               41600000
                                                                        41610000
     IF SWITCH_USER_EXIT_4 = TRUE                                       41620000
     THEN DO;                                                           41630000
       WRK_ADDRESS_LINES = '';                                          41640000
       WRK_ADDRESS_LINES.LINE(1) = TB_RCBV011.ADDRESS_LINE_1;           41650000
       WRK_ADDRESS_LINES.LINE(2) = TB_RCBV011.ADDRESS_LINE_2;           41660000
       WRK_ADDRESS_LINES.LINE(3) = TB_RCBV011.ADDRESS_LINE_3;           41670000
       CALL R028_USEREXIT_RCBDS4U;                                      41680000
     END;                                                               41690000
                                                                        41700000
 END R043_PI_CUSTOMER_INFO;                           /* EOC RB01289 */ 41710000
1/********************************************************************/ 41720000
 /*                                                                  */ 41730000
 /* MODULE NAME      : R700_INIT_COUNTRY                             */ 41740000
 /*                                                                  */ 41750000
 /* DESCRIPTION      :                                               */ 41760000
 /*                                                                  */ 41770000
 /********************************************************************/ 41780000
 R700_INIT_COUNTRY:    PROC;                                            41790000
                                  /* FILL CURRENT COUNTRY            */ 41800000
   WRK_PROC_ID     = COUNTRY_AREA.PROC_ID;                              41810000
   WRK_CTRYNO      = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).CTRYNO;     41820000
   WRK_PGR_TYPE    = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).PGR_TYPE;   41830000
   WRK_CNT_COUNTRY = 0;                                                 41840000
   COUNT.CNT_CTRY  = 0;                                                 41850000
                                                                        41860000
                                              /* LOCK TABLES         */ 41870000
   CALL R001_LOCK_TABLES;                                               41880000
                                                /* RETRIEVE RUN DATE */ 41890000
   RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                     41900000
   RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                               41910000
   RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                             41920000
                                                                        41930000
   CALL RCB020M (PTR_RUN_DATE_AREA,PTR_INT_AREA);                       41940000
                                                                        41950000
   IF RUN_DATE_AREA.RUN_DATE = ''       /* NO RUN DATE RCB001 FOUND  */ 41960000
   THEN                                                                 41970000
   DO;                                                                  41980000
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          41990000
   END;                                                                 42000000
   ELSE                                                                 42010000
   DO;                                                                  42020000
     WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                             42030000
   END;                                                                 42040000
   PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                         42050000
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                               42060000
   PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                             42070000
   PARM_INT_AREA.MSG_VAR_CODES    = '';                                 42080000
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                               42090000
   PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                       42100000
   CALL RCB0M1M (PTR_INT_AREA);                                         42110000
                                                                        42120000
   TB_RCBV500   = '';                       /* RETRIEVE EXTRACT PARM */ 42130000
   TB_RCBV500_I = '';                                                   42140000
   TB_RCBP05S.NUMBER   = 'RCB005';                                      42150000
   TB_RCBP05S.CTRYNO   = WRK_CTRYNO;                                    42160000
   TB_RCBP05S.PGR_TYPE = WRK_PGR_TYPE;                                  42170000
                                                                        42180000
   CALL RCBI50M ('U',                                     /* RC01219 */ 42190000
                 ADDR(TB_RCBV500),                                      42200000
                 ADDR(TB_RCBV500_I),                                    42210000
                 PTR_RETURN_AREA_BB,                                    42220000
                 PTR_INT_AREA);                                         42230000
                                                                        42240000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  42250000
     WHEN (0)                                                           42260000
     DO;                                                                42270000
       PARM_RCB005        = TB_RCBP05S, BY NAME;                        42280000
     END;                                                               42290000
     WHEN (4)                             /* NO EXTRACT PARM FOUND   */ 42300000
     DO;                                                                42310000
       PARM_RCB005.ADDRESS_RES = '0';                                   42320000
     END;                                                               42330000
     OTHERWISE DO;                                                      42340000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            42350000
                                 'DB2',                                 42360000
                                 '#092');                               42370000
     END;                                                               42380000
   END;                                                                 42390000
                                                                        42400000
   TB_RCBV500   = '';           /* RETRIEVE HIGHEST SEQ NR           */ 42410000
   TB_RCBV500_I = '';                                                   42420000
   TB_RCBP27S.NUMBER   = 'RCB027';                                      42430000
   TB_RCBP27S.CTRYNO   = WRK_CTRYNO;                                    42440000
   TB_RCBP27S.PGR_TYPE = WRK_PGR_TYPE;                                  42450000
                                                                        42460000
   CALL RCBI50M ('R',                                     /* RC01219 */ 42470000
                 ADDR(TB_RCBV500),                                      42480000
                 ADDR(TB_RCBV500_I),                                    42490000
                 PTR_RETURN_AREA_BB,                                    42500000
                 PTR_INT_AREA);                                         42510000
                                                                        42520000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  42530000
     WHEN (0)                                                           42540000
     DO;                                                                42550000
       PARM_RCB027        = TB_RCBP27S, BY NAME;                        42560000
     END;                                                               42570000
     WHEN (4)                            /* NO HIGHEST SEQ NR FOUND */  42580000
     DO;                                                                42590000
       PARM_RCB027.MAX_KEY_CHIS = 0;                                    42600000
       PARM_RCB027.MAX_KEY_LA0  = 0;                                    42610000
     END;                                                               42620000
     OTHERWISE DO;                                                      42630000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            42640000
                                 'DB2',                                 42650000
                                 '#093');                               42660000
     END;                                                               42670000
   END;                                                                 42680000
                                                                        42690000
 END R700_INIT_COUNTRY;                                                 42700000
1/********************************************************************/ 42710000
 /*                                                                  */ 42720000
 /* MODULE NAME      : R705_WRITE_RCBDSB1_RECORD                     */ 42730000
 /*                                                                  */ 42740000
 /* DESCRIPTION      : WRITE RCBDSB1 RECORD                          */ 42750000
 /*                                                                  */ 42760000
 /********************************************************************/ 42770000
 R705_WRITE_RCBDSB1_RECORD: PROC;                                       42780000
                                                                        42790000
                                          /* UPDATE HASH_TOTAL       */ 42800000
   CALL RCB018M (SUBSTR(FILE_RCBDSB1.CONTRACT_NUMBER,3,4),              42810000
                 WRK_HASH_TOTAL,                                        42820000
                 PTR_INT_AREA);                                         42830000
                                                                        42840000
                                          /* WRITE RECORD            */ 42850000
   WRITE FILE(RCBDSB1) FROM (FILE_RCBDSB1);                             42860000
                                                                        42870000
   WRK_CNT_COUNTRY = WRK_CNT_COUNTRY + 1;                               42880000
                                                                        42890000
 END R705_WRITE_RCBDSB1_RECORD;                                         42900000
1/*********************************************************************/42910000
 /*                                                                   */42920000
 /* MODULE NAME      :  R799_END_COUNTRY                              */42930000
 /*                                                                   */42940000
 /* DESCRIPTION      :                                                */42950000
 /*                                                                   */42960000
 /*********************************************************************/42970000
 R799_END_COUNTRY: PROC;                                                42980000
                             /* WRITE COUNT MESSAGE FOR COUNTRY      */ 42990000
   PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                43000000
   PARM_INT_AREA.MESSAGE_NUMBER  = '0004';                              43010000
   PARM_INT_AREA.MSG_VAR_CODES   = ' ';                                 43020000
   PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                                43030000
   PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_FILE_NAME;                       43040000
   PARM_INT_AREA.MSG_VAR_CODE_7  = 'C6';                                43050000
   WRK_PIC_10                    = WRK_CNT_COUNTRY;                     43060000
   PARM_INT_AREA.MSG_VAR_VALUE_7 = WRK_PIC_10;                          43070000
   CALL RCB0M1M (PTR_INT_AREA);                                         43080000
                                      /* ADD CNT_COUNTRY TO TOTAL    */ 43090000
   WRK_CNT_RCBDSB1     = WRK_CNT_RCBDSB1 + WRK_CNT_COUNTRY;             43100000
   CNT_TOT.IN_QCH0CMSO = CNT_TOT.IN_QCH0CMSO + CNT_CTRY.IN_QCH0CMSO;    43110000
   CNT_TOT.IN_QCH0SCSO = CNT_TOT.IN_QCH0SCSO + CNT_CTRY.IN_QCH0SCSO;    43120000
   CNT_TOT.IN_QCH0RSSO = CNT_TOT.IN_QCH0RSSO + CNT_CTRY.IN_QCH0RSSO;    43130000
                                                                        43140000
   TB_RCBV500   = '';           /* SAVE HIGHEST SEQ NRS              */ 43150000
   TB_RCBV500_I = '';                                                   43160000
   TB_RCBP27S.NUMBER       = 'RCB027';                                  43170000
   TB_RCBP27S.CTRYNO       = WRK_CTRYNO;                                43180000
   TB_RCBP27S.PGR_TYPE     = WRK_PGR_TYPE;                              43190000
   TB_RCBP27S.LENGTH_PARM  = CSTG(PARM_RCB027.MAX_KEY_CHIS) +           43200000
                             CSTG(PARM_RCB027.MAX_KEY_LA0);             43210000
   TB_RCBP27S.MAX_KEY_CHIS = PARM_RCB027.MAX_KEY_CHIS;                  43220000
   TB_RCBP27S.MAX_KEY_LA0  = PARM_RCB027.MAX_KEY_LA0;                   43230000
                                                                        43240000
   CALL RCBG50M (ADDR(TB_RCBV500),                                      43250000
                 ADDR(TB_RCBV500_I),                                    43260000
                 PTR_RETURN_AREA_BB,                                    43270000
                 PTR_INT_AREA);                                         43280000
                                                                        43290000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  43300000
     WHEN (0);                                                          43310000
     WHEN (4) DO;                     /* WHEN NOT FOUND THEN INSERT */  43320000
       CALL RCBF50M (ADDR(TB_RCBV500),                                  43330000
                     ADDR(TB_RCBV500_I),                                43340000
                     PTR_RETURN_AREA_BB,                                43350000
                     PTR_INT_AREA);                                     43360000
                                                                        43370000
       SELECT(RETURN_AREA_BB.RETURN_CODE);                              43380000
         WHEN (0);                                                      43390000
         OTHERWISE DO;                                                  43400000
           CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),        43410000
                               'DB2',                                   43420000
                               '#094');                                 43430000
           END;                                                         43440000
         END;                                                           43450000
       END;                                                             43460000
                                                                        43470000
     OTHERWISE DO;                                                      43480000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            43490000
                                 'DB2',                                 43500000
                                 '#095');                               43510000
       END;                                                             43520000
     END;                                                               43530000
                                      /* INCREASE FOR NEXT CTRYNO    */ 43540000
   WRK_CTRYNO_NO = WRK_CTRYNO_NO + 1;                                   43550000
 END R799_END_COUNTRY;                                                  43560000
                                                                        43570000
1/********************************************************************/ 43580000
 /*                                                                  */ 43590000
 /* MODULE NAME      : R800_INIT_PROCESSING                          */ 43600000
 /*                                                                  */ 43610000
 /* DESCRIPTION      : OPEN AND INTITIAL FETCH CURSORS               */ 43620000
 /*                                                                  */ 43630000
 /********************************************************************/ 43640000
 R800_INIT_PROCESSING: PROC;                                            43650000
                                                                        43660000
   OPEN FILE(RCBDSB1);                   /* OPEN FILE RCBDSB1        */ 43670000
                                                                        43680000
   FILE_RCBDSB1 = '';                    /* FILL HEADER RECORD       */ 43690000
   FILE_RCBDSB1_H.KEY            = LOW(20);                             43700000
   FILE_RCBDSB1_H.PROCESS_NAME   = 'CCMS CONT';                         43710000
   FILE_RCBDSB1_H.FILE_TYPE      = 'DELTA EXTR';                        43720000
   FILE_RCBDSB1_H.COUNTRY_NUMBER = '';        /* PROCESS IS MCO      */ 43730000
   FILE_RCBDSB1_H.RUN_DATE       = '';                                  43740000
   FILE_RCBDSB1_H.TIME_STAMP     = WRK_TIME_STAMP;                      43750000
                                        /* WRITE HEADER REC          */ 43760000
   WRITE FILE(RCBDSB1) FROM(FILE_RCBDSB1);                              43770000
                                                                        43780000
   COUNT.CNT_TOT = 0;                                                   43790000
 END R800_INIT_PROCESSING;                                              43800000
1/********************************************************************/ 43810000
 /*                                                                  */ 43820000
 /* MODULE NAME      : R899_END_PROCESSING                           */ 43830000
 /*                                                                  */ 43840000
 /* DESCRIPTION      : CLOSE CURSOR                                  */ 43850000
 /*                                                                  */ 43860000
 /********************************************************************/ 43870000
 R899_END_PROCESSING: PROC;                                             43880000
                                                                        43890000
                                        /* INIT AND FILL TRAILER REC */ 43900000
   FILE_RCBDSB1 = '';                                                   43910000
   FILE_RCBDSB1_H.KEY            = HIGH(20);                            43920000
   FILE_RCBDSB1_H.PROCESS_NAME   = 'CCMS CONT';                         43930000
   FILE_RCBDSB1_H.FILE_TYPE      = 'DELTA EXTR';                        43940000
   FILE_RCBDSB1_H.COUNTRY_NUMBER = '';                                  43950000
   FILE_RCBDSB1_H.RUN_DATE       = '';                                  43960000
   FILE_RCBDSB1_H.TIME_STAMP     = WRK_TIME_STAMP;                      43970000
                                                                        43980000
                                        /* WRITE TRAILER REC         */ 43990000
   WRITE FILE(RCBDSB1) FROM(FILE_RCBDSB1);                              44000000
                                                                        44010000
                                        /* CLOSE FILE RCBDSB1        */ 44020000
   CLOSE FILE(RCBDSB1);                                                 44030000
                                                                        44040000
                              /* SAVE HASH TOTAL IN PARAMETER RCB024 */ 44050000
   TB_RCBV500 = '';                                                     44060000
   TB_RCBV500_I = '';                                                   44070000
   TB_RCBP24S.NUMBER      = 'RCB024';                                   44080000
   TB_RCBP24S.PROC_ID     = WRK_PROC_ID;                                44090000
   TB_RCBP24S.CTRYNO      = COUNTRY_AREA.CTRY_SET_ID;      /* RC01219 */44100000
   TB_RCBP24S.FILE_NAME   = WRK_FILE_NAME;                              44110000
   TB_RCBP24S.TIME_STAMP  = WRK_TIME_STAMP;                             44120000
   TB_RCBP24S.HASH_TOTAL  = WRK_HASH_TOTAL;                             44130000
   TB_RCBP24S.LENGTH_PARM = STG(TB_RCBP24S.TIME_STAMP) +                44140000
                            STG(TB_RCBP24S.HASH_TOTAL);                 44150000
                                                                        44160000
   CALL RCBG50M (ADDR(TB_RCBV500),                                      44170000
                 ADDR(TB_RCBV500_I),                                    44180000
                 PTR_RETURN_AREA_BB,                                    44190000
                 PTR_INT_AREA);                                         44200000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  44210000
     WHEN (0);                                                          44220000
     WHEN (4)                      /* WHEN NOT FOUND THEN INSERT  */    44230000
     DO;                                                                44240000
       CALL RCBF50M (ADDR(TB_RCBV500),                                  44250000
                     ADDR(TB_RCBV500_I),                                44260000
                     PTR_RETURN_AREA_BB,                                44270000
                     PTR_INT_AREA);                                     44280000
       SELECT(RETURN_AREA_BB.RETURN_CODE);                              44290000
         WHEN (0);                                                      44300000
         OTHERWISE                                                      44310000
         DO;                                                            44320000
           CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),        44330000
                               'DB2',                                   44340000
                               '#096');                                 44350000
         END;                                                           44360000
       END;                                                             44370000
     END;                                                               44380000
     OTHERWISE                                                          44390000
     DO;                                                                44400000
       CALL RCBDSBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            44410000
                           'DB2',                                       44420000
                           '#097');                                     44430000
     END;                                                               44440000
   END;                                                                 44450000
                                                                        44460000
 END R899_END_PROCESSING;                                               44470000
                                                                        44480000
1/********************************************************************/ 44490000
 /*                                                                  */ 44500000
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 44510000
 /*                                                                  */ 44520000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 44530000
 /*                                                                  */ 44540000
 /********************************************************************/ 44550000
 R900_INIT_PROGRAM: PROC;                                               44560000
                                             /* INITIALISE POINTERS  */ 44570000
   PTR_INT_AREA        = ADDR(PARM_INT_AREA);                           44580000
   PTR_RETURN_AREA_BB  = ADDR(RETURN_AREA_BB);                          44590000
   PTR_COUNTRY_AREA    = ADDR(COUNTRY_AREA);                            44600000
   PTR_RUN_DATE_AREA   = ADDR(RUN_DATE_AREA);                           44610000
   PTR_SEARCH_QCH0CMSI = ADDR(SEARCH_ARG_QCH0CMSI);                     44620000
   PTR_SEARCH_QCH0RSSI = ADDR(SEARCH_ARG_QCH0RSSI);                     44630000
   PTR_SEARCH_QCH0SCSI = ADDR(SEARCH_ARG_QCH0SCSI);                     44640000
                                             /* INITIALISE VARIABLES */ 44650000
   PARM_INT_AREA.MSG_AREA       = '';                                   44660000
   PARM_INT_AREA.ERR_AREA       = ' ';                                  44670000
   PARM_INT_AREA.MSG_REQUEST    = 'O';                                  44680000
   PARM_INT_AREA.MSG_TARGET     = 'F';                                  44690000
   PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                44700000
   PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                         44710000
   PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                         44720000
   PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                    44730000
   PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                      44740000
   PARM_INT_AREA.TXN_CODE       = '';                                   44750000
   PARM_INT_AREA.VERSION        = '';                                   44760000
   PARM_INT_AREA.PTR_PCB_IO     = NULL;                                 44770000
   PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                 44780000
                                              /* OPEN MESSAGE FILE   */ 44790000
   CALL RCB0M1M(PTR_INT_AREA);                                          44800000
                                              /* RETR. SYSTEM DATE   */ 44810000
   PARM_INT_AREA.MSG_REQUEST    = 'P';                                  44820000
   CALL RCB0T1M(PTR_INT_AREA);                                          44830000
                                   /* DETERMINE TIMESTAMP FOR HEADER */ 44840000
   WRK_TIME_STAMP = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();         44850000
                                              /* RETRIEVE COUNTRY    */ 44860000
   CALL RCB019M (PTR_COUNTRY_AREA,PTR_INT_AREA);                        44870000
                                                                        44880000
   SELECT;                                                              44890000
     WHEN(COUNTRY_AREA.COUNT_CTRY = 0)        /* NO COUNTRIES TO     */ 44900000
     DO;                                      /* PROCESS             */ 44910000
       PARM_INT_AREA.COUNTRY_NUMBER = '';                               44920000
       PARM_INT_AREA.MSG_VAR_CODES  = '';                               44930000
       PARM_INT_AREA.MESSAGE_TYPE   = 'IS';                             44940000
       PARM_INT_AREA.MESSAGE_NUMBER = '0005';                           44950000
       CALL RCB0M1M (PTR_INT_AREA);                                     44960000
       CALL RCBDSBM_ERROR (NULL, 'OTHER', '#098');                      44970000
     END;                                                               44980000
     OTHERWISE                                                          44990000
     DO;                                                                45000000
       WRK_PROC_ID  = COUNTRY_AREA.PROC_ID;                             45010000
       WRK_CTRYNO   = COUNTRY_AREA.CTRY_ARRAY(1).CTRYNO;                45020000
       WRK_PGR_TYPE = COUNTRY_AREA.CTRY_ARRAY(1).PGR_TYPE;              45030000
     END;                                                               45040000
   END;                                                                 45050000
                                                                        45060000
 END R900_INIT_PROGRAM;                                                 45070000
1/********************************************************************/ 45080000
 /*                                                                  */ 45090000
 /* MODULE NAME      : R999_END_PROGRAM                              */ 45100000
 /*                                                                  */ 45110000
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 45120000
 /*                                                                  */ 45130000
 /********************************************************************/ 45140000
 R999_END_PROGRAM:  PROC;                                               45150000
                                                                        45160000
                                    /* WRITE COUNT MESSAGE           */ 45170000
                                    /* NUMBER OF RECORDS FROM CHIS   */ 45180000
 /*PARM_INT_AREA.COUNTRY_NUMBER  = '   '                             */ 45190000
 /*PARM_INT_AREA.MESSAGE_TYPE    = 'IS'                              */ 45200000
 /*PARM_INT_AREA.MESSAGE_NUMBER  = '????' NEW MESSAGE-SEE MSG 0211   */ 45210000
 /*PARM_INT_AREA.MSG_VAR_CODES   = ''                                */ 45220000
 /*PARM_INT_AREA.MSG_VAR_CODE_6  = 'C1'                              */ 45230000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6 = COUNT.CNT_TOT.IN_QCH0CMSO         */ 45240000
 /*CALL RCB0M1M (PTR_INT_AREA)                                       */ 45250000
                                    /* WRITE COUNT MESSAGE           */ 45260000
                                    /* RCBDSB1 WRITTEN               */ 45270000
   PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                       45280000
   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0004';                     45290000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                         45300000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'FL';                       45310000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = WRK_FILE_NAME;              45320000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'C6';                       45330000
   WRK_PIC_10                             = WRK_CNT_RCBDSB1;            45340000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = WRK_PIC_10;                 45350000
   CALL RCB0M1M (PTR_INT_AREA);                                         45360000
                                                                        45370000
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 45380000
   PARM_INT_AREA.COUNTRY_NUMBER  = '';                                  45390000
   PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                45400000
   PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                              45410000
   PARM_INT_AREA.MSG_VAR_CODES   = '';                                  45420000
   CALL RCB0M1M (PTR_INT_AREA);                                         45430000
                                    /* CLOSE MESSAGE FILE            */ 45440000
   PARM_INT_AREA.MSG_REQUEST = 'C';                                     45450000
   CALL RCB0M1M (PTR_INT_AREA);                                         45460000
                                                                        45470000
 END R999_END_PROGRAM;                                                  45480000
1/********************************************************************/ 45490000
 /*                                                                  */ 45500000
 /* MODULE NAME      : RCBDSBM_ERROR                                 */ 45510000
 /*                                                                  */ 45520000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 45530000
 /*                    THE INPUT VARIABLES                           */ 45540000
 /*                                                                  */ 45550000
 /********************************************************************/ 45560000
 RCBDSBM_ERROR: PROC (PTR_ERROR,ERR_TYPE,CALL_ID);                      45570000
   DCL PTR_ERROR    PTR;                                                45580000
   DCL ERR_TYPE      CHAR(8);                                           45590000
   DCL CALL_ID       CHAR(4);                                           45600000
                                                                        45610000
   PARM_INT_AREA.PTR_ERROR = PTR_ERROR;                                 45620000
   PARM_INT_AREA.ERR_TYPE  = ERR_TYPE;                                  45630000
   PARM_INT_AREA.CALL_ID   = CALL_ID;                                   45640000
   CALL RCB0E1M (ADDR(PARM_INT_AREA));                                  45650000
 END RCBDSBM_ERROR;                                                     45660000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  45670000
 /*******************************************************************/  45680000
 %INCLUDE DAIFPLH ;                      /* COMPILE DATE/TIME STAMP */  45690000
 $DAIMOD (RCBDSBM);                      /* MODULE TO BE COMPILED   */  45700000
 /*******************************************************************/  45710000
 /* END OF ABR BLOCK                                                */  45720000
 /*******************************************************************/  45730000
 END RCBDSBM;                                                           45740000