1/* RCBDREM - RCMS CUSTOMER: DETERMINE CHANGES                       */ 00019922
 /********************************************************************/ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /********************************************************************/ 00060000
 /* PROGRAM          : RCBDREM                                       */ 00070000
 /*                                                                  */ 00080000
 /* LANGUAGE         : PLISQL                                        */ 00090000
 /*                                                                  */ 00100000
 /* TYPE             : BATCH                                         */ 00110000
 /*                                                                  */ 00120000
 /* DESCRIPTION      : THE EXTRACT OF KEYS OF INTEREST FOR THE       */ 00130000
 /*                    RCMS CU EXTRACT, WHICH HAVE CHANGED SINCE     */ 00140000
 /*                    THE LAST RCMS CU EXTRACT.                     */ 00150000
 /*                                                                  */ 00160000
 /* INPUT            : - DB2   : RCBV0010_CUSTOMER                   */ 00170000
 /*                              RCBV0011_PI_CUST            RC01158 */ 00180000
 /*                              RCBV0035_CUST_CTR           RA01120 */ 00190000
 /*                              RCBV0051_PI_HW_PR           RC01158 */ 00200000
 /*                              RCBV0150_CUST_ADDR                  */ 00210000
 /*                              RCBV0170_OU_HW                      */ 00220000
 /*                              RCBV0180_OU_SW                      */ 00230000
 /*                              RCBV0190_HW_CUST                    */ 00240000
 /*                              RCBV0200_SW_CUST                    */ 00250000
 /*                              RCBV0210_ADD_SERV           PTM0684 */ 00260000
 /*                              RCBV0260_HW_IN_ORD                  */ 00270000
 /*                              RCBV0270_SW_IN_ORD          RA01090 */ 00280000
 /*                              RCBV0280_ADDR_LINE                  */ 00290000
 /*                              RCBV0320_SW_ON_HW                   */ 00300000
 /*                              RCBV0340_HW_ADDR                    */ 00310000
 /*                              RCBV0350_CUST_MOD                   */ 00320000
 /*                              RCBV0500_PARM                       */ 00330000
 /*                                                                  */ 00340000
 /* OUTPUT           : - DB2   : RCBT0721_RCMS_CU            RC01219 */ 00350000
 /*                    - FILE  : RCB0M10                             */ 00360000
 /*                                                                  */ 00370000
 /* TEMPORARY        : - DB2   : RCBT0731_RCMS_C_TP          RC01219 */ 00380000
 /*                                                                  */ 00390000
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00400000
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00410000
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00420000
 /*                    RCB004M   DATE CALCULATION                    */ 00430000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00440000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00450000
 /*                    RCBI50M   RETRIEVE PARAMETER                  */ 00460000
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00470000
 /*                                                                  */ 00480000
 /* MESSAGES         :                                               */ 00490000
 /*                                                                  */ 00500000
 /* DEPENDENCIES     : NONE                                          */ 00510000
 /*                                                                  */ 00520000
 /* FREQUENCY        : USER DEPENDENT                                */ 00530000
 /*                                                                  */ 00540000
 /* MAINTENANCE LOG  :                                               */ 00550000
 /* ---------------                                                  */ 00560000
 /*                                                                  */ 00570000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00580000
 /*           |              |                                       */ 00590000
 /* 1993-04-01| ----         | CEDS INITIAL DEVELOPMENT              */ 00600000
 /* --------------------------------------------------------------   */ 00610000
 /* 1994-05-05| RA01090      | INCLUDE SW ORDERS IN EXTRACT          */ 00620000
 /* 1994-12-06| RA01120      | INCLUDE ADDITIONAL SERVICE INDICATOR  */ 00630000
 /* 1995-04-28| PTM0684      | INCLUDE CHANGES RCBT0210 (AS RESULT   */ 00640000
 /*           |              | OF RA01120, SEE ALSO THAT CHANGES)    */ 00650000
 /* 1995-06-13| ----         | CHANGE OF TEMPORARY TABLE             */ 00660000
 /* 1995-09-13| PTM0719      | WORK TABLES PERMANENT         (DG)    */ 00670000
 /* 1996-04-22| RC01158      | PRIME INPUT                           */ 00680000
 /* 1996-11-15| RA01171      | CEDS OPTION FOR HVP DATA HANDLING     */ 00690000
 /* 1997-04-11| PTM1036      | CORRECTED PROLOG                      */ 00700000
 /* 1997-07-15| PTM1008      | PERFORMANCE                           */ 00710000
 /* 1999-07-06| RC01219      | DORO                                  */ 00720000
 /* 2000-11-30| PTM1339      | ADD COMMITS FOR TEMP TABLES           */ 00730000
 /* 2001-01-30| CONTENTION   | CHANGE LOCKING ON T721 TO SHARED      */ 00740000
 /*           |              |                                       */ 00750000
 /********************************************************************/ 00760000
 /*(CHECK(                                                              00770000
 R900_INIT_PROGRAM,                                                     00780000
 R800_CLEAR_OUTPUT_TABLES,                                              00790000
 R801_RETR_INSERT_FROM_RCBV0010,                                        00800000
 R802_RETR_INSERT_FROM_RCBV0035,                                        00810000
 R803_RETR_INSERT_FROM_RCBV0150,                                        00820000
 R804_RETR_INSERT_FROM_RCBV0170,                                        00830000
 R805_RETR_INSERT_FROM_RCBV0180,                                        00840000
 R806_RETR_INSERT_FROM_RCBV0190,                                        00850000
 R807_RETR_INSERT_FROM_RCBV0200,                                        00860000
 R808_RETR_INSERT_FROM_RCBV0260,                                        00870000
 R809_RETR_INSERT_FROM_RCBV0280,                                        00880000
 R810_RETR_INSERT_FROM_RCBV0320,                                        00890000
 R811_RETR_INSERT_FROM_RCBV0340,                                        00900000
 R812_RETR_INSERT_FROM_RCBV0350,                                        00910000
 R813_RETR_INSERT_FROM_RCBV0270,                                        00920000
 R814_RETR_INSERT_FROM_RCBV0210,                                        00930000
 R815_RETR_INSERT_FROM_RCBV0011,                                        00940000
 R816_RETR_INSERT_FROM_RCBV0051,                                        00950000
 R820_DISTINCT_COPY_RCBV0721,                                           00960000
 R999_END_PROGRAM                                                       00970000
 )):                                                                 */ 00980000
1RCBDREM: PROC                                                          00990000
          OPTIONS (MAIN)                                                01000000
          REORDER;                                                      01010000
 DEFAULT RANGE (*)        STATIC;                                       01020000
1/********************************************************************/ 01030000
 /*  PARAMETERS                                                      */ 01040000
 /********************************************************************/ 01050000
 DCL PTR_INT_AREA        PTR;          /* INTERFACE AREA             */ 01060000
 DCL PTR_RETURN_AREA_BB  PTR;          /* RETURN AREA FROM BB        */ 01070000
 DCL PTR_COUNTRY_AREA    PTR;          /* INTERFACE RCB019M          */ 01080000
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 01090000
                                                                        01100000
 DCL 1 PARM_INT_AREA,                          /* INTERFACE AREA     */ 01110000
       %INCLUDE (RCBZ01S);;                                             01120000
 DCL 1 RETURN_AREA_BB,                         /* RETURN AREA        */ 01130000
       %INCLUDE (RCBZ02S);;                                             01140000
 DCL 1 COUNTRY_AREA,                           /* COUNTRY AREA       */ 01150000
       %INCLUDE (RCBZ26S);;                                             01160000
 DCL 1 RUN_DATE_AREA,                          /* RUN DATE AREA      */ 01170000
       %INCLUDE (RCBZ28S);;                                             01180000
 DCL 1 PARM_DATE_CALC,                         /* DATE CALC AREA     */ 01190000
      %INCLUDE (RCBZ03S);;                                              01200000
 DCL 1 PARM_RCB005,                            /* RCMS EXTR PARM     */ 01210000
      %INCLUDE (RCBP05S);;                                              01220000
 DCL 1 PARM_RCB024M,                           /* RCB024M PARM       */ 01230000
      %INCLUDE (RCBZ33S);;                                              01240000
1/********************************************************************/ 01250000
 /* EXTERNAL ENTRIES                                                 */ 01260000
 /********************************************************************/ 01270000
 DCL PLIXOPT          EXTERNAL CHAR (30) VAR INIT ('ISA(10K),NOSTAE');  01280000
                                                                        01290000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01300000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 01310000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 01320000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01330000
 DCL RCB004M   ENTRY  EXTERNAL;          /* DATE CALCULATION         */ 01340000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01350000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01360000
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 01370000
                                                                        01380000
1/********************************************************************/ 01390000
 /* DB2 TABLE STRUCTURES                                             */ 01400000
 /********************************************************************/ 01410000
 DCL 1 TB_RCBV500,                                                      01420000
      %INCLUDE (RCB500S);;                                              01430000
 DCL 1 TB_RCBV500_I,                                                    01440000
      %INCLUDE (RCB500SI);;                                             01450000
 DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  01460000
      %INCLUDE (RCBP05S);;                                              01470000
 DCL 1 TB_RCBP37S            BASED (ADDR(TB_RCBV500)),                  01480000
      %INCLUDE (RCBP37S);;                                              01490000
 /********************************************************************/ 01500000
 /*  BIT SWITCHES                                                    */ 01510000
 /********************************************************************/ 01520000
 DCL 1 SWITCHES,                                                        01530000
     3 TRUE                        BIT (1)         INIT ('1'B),         01540000
     3 FALSE                       BIT (1)         INIT ('0'B);         01550000
 /********************************************************************/ 01560000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01570000
 /********************************************************************/ 01580000
 DCL 1 WORK_FIELDS,                                                     01590000
    3 WRK_MOD_NAME                      CHAR (08)  INIT ('RCBDREM'),    01600000
    3 WRK_PRG_NAME                      CHAR (08)  INIT ('RCBDREP'),    01610000
    3 WRK_SYSTEM_TYPE                   CHAR (01)  INIT ('B'),          01620000
    3 WRK_INDNULL                       FIXED BIN(15),                  01630000
    3 WRK_PIC_10                        PIC 'Z,ZZZ,ZZZ,ZZ9',            01640000
    3 WRK_LAST_EXTR_DATE                CHAR (10),                      01650000
    3 WRK_START_CHANGE_PERIOD           CHAR (10),                      01660000
    3 WRK_RUN_DATE                      CHAR (10),                      01670000
    3 WRK_CTRYNO                        CHAR (03),                      01680000
    3 WRK_PGR_TYPE                      CHAR (03);                      01690000
                                                                        01700000
1/********************************************************************/ 01710000
 /*  BUILTIN FUNCTIONS                                               */ 01720000
 /********************************************************************/ 01730000
 DCL (ADDR,                                                             01740000
     DATE,                                                              01750000
     TIME,                                                              01760000
     NULL,                                                              01770000
     STRING,                                                            01780000
     SUBSTR)                 BUILTIN;                                   01790000
1/********************************************************************/ 01800000
 /* ON ERROR CONDITIONS                                              */ 01810000
 /********************************************************************/ 01820000
 %INCLUDE (RCB0E0M);                                                    01830000
  END;                                                                  01840000
1/********************************************************************/ 01850000
 /* DB2/SQL SQLCA                                                    */ 01860000
 /********************************************************************/ 01870000
  EXEC SQL                                                              01880000
   INCLUDE SQLCA                                                        01890000
   ;                                                                    01900000
 /********************************************************************/ 01910000
 /* DB2/SQL CURSORS                                                  */ 01920000
 /********************************************************************/ 01930000
                                                                        01940000
1/********************************************************************/ 01950000
 /*                 S T A R T   P R O C E S S I N G                  */ 01960000
 /********************************************************************/ 01970000
 CALL R900_INIT_PROGRAM;                                                01980000
                                                                        01990000
 CALL R800_CLEAR_OUTPUT_TABLES;                                         02000000
                                                                        02010000
 CALL R801_RETR_INSERT_FROM_RCBV0010;                                   02020000
 CALL R802_RETR_INSERT_FROM_RCBV0035;                     /* RA01120 */ 02030000
 CALL R803_RETR_INSERT_FROM_RCBV0150;                                   02040000
 CALL R804_RETR_INSERT_FROM_RCBV0170;                                   02050000
 CALL R805_RETR_INSERT_FROM_RCBV0180;                                   02060000
 CALL R806_RETR_INSERT_FROM_RCBV0190;                                   02070000
 CALL R807_RETR_INSERT_FROM_RCBV0200;                                   02080000
 CALL R808_RETR_INSERT_FROM_RCBV0260;                                   02090000
 CALL R809_RETR_INSERT_FROM_RCBV0280;                                   02100000
 CALL R810_RETR_INSERT_FROM_RCBV0320;                                   02110000
 IF PARM_RCB005.ADDRESS_RES = '1'                                       02120000
 THEN                                                                   02130000
   DO;                                                                  02140000
     CALL R811_RETR_INSERT_FROM_RCBV0340;                               02150000
   END;                                                                 02160000
 CALL R812_RETR_INSERT_FROM_RCBV0350;                                   02170000
 CALL R813_RETR_INSERT_FROM_RCBV0270;                     /* RA01090 */ 02180000
 CALL R814_RETR_INSERT_FROM_RCBV0210;                     /* PTM0684 */ 02190000
 IF PARM_RCB005.PI_TO_RCMS = 'Y'                          /* RA01171 */ 02200000
 THEN                                                     /* RA01171 */ 02210000
   DO;                                                    /* RA01171 */ 02220000
     CALL R815_RETR_INSERT_FROM_RCBV0011;                 /* RC01158 */ 02230000
     CALL R816_RETR_INSERT_FROM_RCBV0051;                 /* RC01158 */ 02240000
   END;                                                   /* RA01171 */ 02250000
                                                                        02260000
 CALL R820_DISTINCT_COPY_RCBV0721;                        /* RC01219 */ 02270000
                                                                        02280000
 CALL R999_END_PROGRAM;                                                 02290000
                                                                        02300000
1/********************************************************************/ 02310000
 /*                                                                  */ 02320000
 /* MODULE NAME      : R001_LOCK_TABLES                              */ 02330000
 /*                                                                  */ 02340000
 /* DESCRIPTION      :                                               */ 02350000
 /*                                                                  */ 02360000
 /********************************************************************/ 02370000
 R001_LOCK_TABLES: PROC;                                                02380000
                                                                        02390000
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 02400000
                                                                        02410000
 /********************************************************************/ 02420000
                                                                        02430000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0010_CUSTOMER';                     02440000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 02450000
                                                                        02460000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      02470000
               PTR_RETURN_AREA_BB,                                      02480000
               PTR_INT_AREA);                                           02490000
                                                                        02500000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    02510000
   WHEN (0);                                                            02520000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 02530000
     DO;                                                                02540000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#001');                      02550000
     END;                                                               02560000
   OTHERWISE                                                            02570000
     DO;                                                                02580000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            02590000
                                 'DB2',                                 02600000
                                 '#002');                               02610000
     END;                                                               02620000
 END;                                                                   02630000
                                                                        02640000
 /********************************************************************/ 02650000
                                                                        02660000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0035_CUST_CTR';                     02670000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 02680000
                                                                        02690000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      02700000
               PTR_RETURN_AREA_BB,                                      02710000
               PTR_INT_AREA);                                           02720000
                                                                        02730000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    02740000
   WHEN (0);                                                            02750000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 02760000
     DO;                                                                02770000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#003');                      02780000
     END;                                                               02790000
   OTHERWISE                                                            02800000
     DO;                                                                02810000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            02820000
                                 'DB2',                                 02830000
                                 '#004');                               02840000
     END;                                                               02850000
 END;                                                                   02860000
                                                                        02870000
 /********************************************************************/ 02880000
                                                                        02890000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0150_CUST_ADDR';                    02900000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 02910000
                                                                        02920000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      02930000
               PTR_RETURN_AREA_BB,                                      02940000
               PTR_INT_AREA);                                           02950000
                                                                        02960000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    02970000
   WHEN (0);                                                            02980000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 02990000
     DO;                                                                03000000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#005');                      03010000
     END;                                                               03020000
   OTHERWISE                                                            03030000
     DO;                                                                03040000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            03050000
                                 'DB2',                                 03060000
                                 '#006');                               03070000
     END;                                                               03080000
 END;                                                                   03090000
                                                                        03100000
 /********************************************************************/ 03110000
                                                                        03120000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0170_OU_HW';                        03130000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 03140000
                                                                        03150000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      03160000
               PTR_RETURN_AREA_BB,                                      03170000
               PTR_INT_AREA);                                           03180000
                                                                        03190000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    03200000
   WHEN (0);                                                            03210000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 03220000
     DO;                                                                03230000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#007');                      03240000
     END;                                                               03250000
   OTHERWISE                                                            03260000
     DO;                                                                03270000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            03280000
                                 'DB2',                                 03290000
                                 '#008');                               03300000
     END;                                                               03310000
 END;                                                                   03320000
                                                                        03330000
 /********************************************************************/ 03340000
                                                                        03350000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0180_OU_SW';                        03360000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 03370000
                                                                        03380000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      03390000
               PTR_RETURN_AREA_BB,                                      03400000
               PTR_INT_AREA);                                           03410000
                                                                        03420000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    03430000
   WHEN (0);                                                            03440000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 03450000
     DO;                                                                03460000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#009');                      03470000
     END;                                                               03480000
   OTHERWISE                                                            03490000
     DO;                                                                03500000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            03510000
                                 'DB2',                                 03520000
                                 '#010');                               03530000
     END;                                                               03540000
 END;                                                                   03550000
                                                                        03560000
 /********************************************************************/ 03570000
                                                                        03580000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      03590000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 03600000
                                                                        03610000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      03620000
               PTR_RETURN_AREA_BB,                                      03630000
               PTR_INT_AREA);                                           03640000
                                                                        03650000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    03660000
   WHEN (0);                                                            03670000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 03680000
     DO;                                                                03690000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#011');                      03700000
     END;                                                               03710000
   OTHERWISE                                                            03720000
     DO;                                                                03730000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            03740000
                                 'DB2',                                 03750000
                                 '#012');                               03760000
     END;                                                               03770000
 END;                                                                   03780000
                                                                        03790000
 /********************************************************************/ 03800000
                                                                        03810000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0200_SW_CUST';                      03820000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 03830000
                                                                        03840000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      03850000
               PTR_RETURN_AREA_BB,                                      03860000
               PTR_INT_AREA);                                           03870000
                                                                        03880000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    03890000
   WHEN (0);                                                            03900000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 03910000
     DO;                                                                03920000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#013');                      03930000
     END;                                                               03940000
   OTHERWISE                                                            03950000
     DO;                                                                03960000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            03970000
                                 'DB2',                                 03980000
                                 '#014');                               03990000
     END;                                                               04000000
 END;                                                                   04010000
                                                                        04020000
 /********************************************************************/ 04030000
                                                                        04040000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0210_ADD_SERV';                     04050000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 04060000
                                                                        04070000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      04080000
               PTR_RETURN_AREA_BB,                                      04090000
               PTR_INT_AREA);                                           04100000
                                                                        04110000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    04120000
   WHEN (0);                                                            04130000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 04140000
     DO;                                                                04150000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#015');                      04160000
     END;                                                               04170000
   OTHERWISE                                                            04180000
     DO;                                                                04190000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            04200000
                                 'DB2',                                 04210000
                                 '#016');                               04220000
     END;                                                               04230000
 END;                                                                   04240000
                                                                        04250000
 /********************************************************************/ 04260000
                                                                        04270000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0260_HW_IN_ORD';                    04280000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 04290000
                                                                        04300000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      04310000
               PTR_RETURN_AREA_BB,                                      04320000
               PTR_INT_AREA);                                           04330000
                                                                        04340000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    04350000
   WHEN (0);                                                            04360000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 04370000
     DO;                                                                04380000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#017');                      04390000
     END;                                                               04400000
   OTHERWISE                                                            04410000
     DO;                                                                04420000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            04430000
                                 'DB2',                                 04440000
                                 '#018');                               04450000
     END;                                                               04460000
 END;                                                                   04470000
                                                                        04480000
 /********************************************************************/ 04490000
                                                                        04500000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0270_SW_IN_ORD';                    04510000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 04520000
                                                                        04530000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      04540000
               PTR_RETURN_AREA_BB,                                      04550000
               PTR_INT_AREA);                                           04560000
                                                                        04570000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    04580000
   WHEN (0);                                                            04590000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 04600000
     DO;                                                                04610000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#019');                      04620000
     END;                                                               04630000
   OTHERWISE                                                            04640000
     DO;                                                                04650000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            04660000
                                 'DB2',                                 04670000
                                 '#020');                               04680000
     END;                                                               04690000
 END;                                                                   04700000
                                                                        04710000
 /********************************************************************/ 04720000
                                                                        04730000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0280_ADDR_LINE';                    04740000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 04750000
                                                                        04760000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      04770000
               PTR_RETURN_AREA_BB,                                      04780000
               PTR_INT_AREA);                                           04790000
                                                                        04800000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    04810000
   WHEN (0);                                                            04820000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 04830000
     DO;                                                                04840000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#021');                      04850000
     END;                                                               04860000
   OTHERWISE                                                            04870000
     DO;                                                                04880000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            04890000
                                 'DB2',                                 04900000
                                 '#022');                               04910000
     END;                                                               04920000
 END;                                                                   04930000
                                                                        04940000
 /********************************************************************/ 04950000
                                                                        04960000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0320_SW_ON_HW';                     04970000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 04980000
                                                                        04990000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      05000000
               PTR_RETURN_AREA_BB,                                      05010000
               PTR_INT_AREA);                                           05020000
                                                                        05030000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    05040000
   WHEN (0);                                                            05050000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 05060000
     DO;                                                                05070000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#023');                      05080000
     END;                                                               05090000
   OTHERWISE                                                            05100000
     DO;                                                                05110000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            05120000
                                 'DB2',                                 05130000
                                 '#024');                               05140000
     END;                                                               05150000
 END;                                                                   05160000
                                                                        05170000
 /********************************************************************/ 05180000
                                                                        05190000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0340_HW_ADDR';                      05200000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 05210000
                                                                        05220000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      05230000
               PTR_RETURN_AREA_BB,                                      05240000
               PTR_INT_AREA);                                           05250000
                                                                        05260000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    05270000
   WHEN (0);                                                            05280000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 05290000
     DO;                                                                05300000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#025');                      05310000
     END;                                                               05320000
   OTHERWISE                                                            05330000
     DO;                                                                05340000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            05350000
                                 'DB2',                                 05360000
                                 '#026');                               05370000
     END;                                                               05380000
 END;                                                                   05390000
                                                                        05400000
 /********************************************************************/ 05410000
                                                                        05420000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0350_CUST_MOD';                     05430000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 05440000
                                                                        05450000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      05460000
               PTR_RETURN_AREA_BB,                                      05470000
               PTR_INT_AREA);                                           05480000
                                                                        05490000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    05500000
   WHEN (0);                                                            05510000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 05520000
     DO;                                                                05530000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#027');                      05540000
     END;                                                               05550000
   OTHERWISE                                                            05560000
     DO;                                                                05570000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            05580000
                                 'DB2',                                 05590000
                                 '#028');                               05600000
     END;                                                               05610000
 END;                                                                   05620000
                                                                        05630000
 /********************************************************************/ 05640000
                                                                        05650000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0721_RCMS_CU';                      05660000
 PARM_RCB024M.LOCK_MODE      = 'S';                /* SHARED MODE    */ 05670000
 /*PARM_RCB024M.LOCK_MODE      = 'E';              /* EXCLUSIVE MODE */ 05680000
                                                                        05690000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      05700000
               PTR_RETURN_AREA_BB,                                      05710000
               PTR_INT_AREA);                                           05720000
                                                                        05730000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    05740000
   WHEN (0);                                                            05750000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 05760000
     DO;                                                                05770000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#029');                      05780000
     END;                                                               05790000
   OTHERWISE                                                            05800000
     DO;                                                                05810000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            05820000
                                 'DB2',                                 05830000
                                 '#030');                               05840000
     END;                                                               05850000
 END;                                                                   05860000
                                                                        05870000
 /********************************************************************/ 05880000
                                                                        05890000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0731_RCMS_C_TP';                    05900000
 PARM_RCB024M.LOCK_MODE      = 'E';                /* EXCLUSIVE MODE */ 05910000
                                                                        05920000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      05930000
               PTR_RETURN_AREA_BB,                                      05940000
               PTR_INT_AREA);                                           05950000
                                                                        05960000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    05970000
   WHEN (0);                                                            05980000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 05990000
     DO;                                                                06000000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#031');                      06010000
     END;                                                               06020000
   OTHERWISE                                                            06030000
     DO;                                                                06040000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            06050000
                                 'DB2',                                 06060000
                                 '#032');                               06070000
     END;                                                               06080000
 END;                                                                   06090000
                                                                        06100000
 /********************************************************************/ 06110000
                                                                        06120000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0011_PI_CUST';                      06130000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 06140000
                                                                        06150000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      06160000
               PTR_RETURN_AREA_BB,                                      06170000
               PTR_INT_AREA);                                           06180000
                                                                        06190000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    06200000
   WHEN (0);                                                            06210000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 06220000
     DO;                                                                06230000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#033');                      06240000
     END;                                                               06250000
   OTHERWISE                                                            06260000
     DO;                                                                06270000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            06280000
                                 'DB2',                                 06290000
                                 '#034');                               06300000
     END;                                                               06310000
 END;                                                                   06320000
                                                                        06330000
 /********************************************************************/ 06340000
                                                                        06350000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0051_PI_HW_PR';                     06360000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 06370000
                                                                        06380000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      06390000
               PTR_RETURN_AREA_BB,                                      06400000
               PTR_INT_AREA);                                           06410000
                                                                        06420000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    06430000
   WHEN (0);                                                            06440000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 06450000
     DO;                                                                06460000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#035');                      06470000
     END;                                                               06480000
   OTHERWISE                                                            06490000
     DO;                                                                06500000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            06510000
                                 'DB2',                                 06520000
                                 '#036');                               06530000
     END;                                                               06540000
 END;                                                                   06550000
                                                      /* EOC RC01219 */ 06560000
 END R001_LOCK_TABLES;                                                  06570000
1/*********************************************************************/06580000
 /*                                                                   */06590000
 /* MODULE NAME      :  R800_CLEAR_OUTPUT_TABLES                      */06600000
 /*                                                                   */06610000
 /* DESCRIPTION      :  DELETE ALL OCCURENCES FROM THE OUTPUT TABLES  */06620000
 /*                                                                   */06630000
 /*********************************************************************/06640000
 R800_CLEAR_OUTPUT_TABLES: PROC;                                        06650000
                                                                        06660000
 EXEC SQL                                              /* SOC RC01219 */06670000
   DELETE FROM RCBV0721_RCMS_CU                                         06680000
   WHERE COUNTRY_NUMBER = :WRK_CTRYNO;                                  06690000
                                                                        06700000
 SELECT(SQLCODE);                                                       06710000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */06720000
   WHEN(100);                                                           06730000
   OTHERWISE                                                            06740000
     DO;                                                                06750000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                06760000
                           'DB2',                                       06770000
                           '#037');                                     06780000
     END;                                                               06790000
 END;                                                                   06800000
                                                       /* EOC RC01219 */06810000
 EXEC SQL                                                               06820000
   DELETE FROM RCBV0731_RCMS_C_TP                          /* PTM0719 */06830000
   WHERE COUNTRY_NUMBER = :WRK_CTRYNO;                     /* RC01219 */06840000
                                                                        06850000
 SELECT(SQLCODE);                                                       06860000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */06870000
   WHEN(100);                                                           06880000
   OTHERWISE                                                            06890000
     DO;                                                                06900000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                06910000
                           'DB2',                                       06920000
                           '#038');                                     06930000
     END;                                                               06940000
 END;                                                                   06950000
                                                                        06960000
 END R800_CLEAR_OUTPUT_TABLES;                                          06970000
                                                                        06980000
1/*********************************************************************/06990000
 /*                                                                   */07000000
 /* MODULE NAME      :  R801_RETR_INSERT_FROM_RCBV0010                */07010000
 /*                                                                   */07020000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */07030000
 /*                    INTO RCBV0731_RCMS_C_TP                        */07040000
 /*                                                                   */07050000
 /*********************************************************************/07060000
 R801_RETR_INSERT_FROM_RCBV0010: PROC;                                  07070000
                                                                        07080000
 EXEC SQL                                                               07090000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* PTM0719  */ 07100000
     SELECT                                                             07110000
         COUNTRY_NUMBER                                                 07120000
        ,CUSTOMER_NUMBER                                                07130000
     FROM RCBV0010_CUSTOMER                                             07140000
     WHERE COUNTRY_NUMBER    = :WRK_CTRYNO                              07150000
       AND LAST_CHANGE_DATE  BETWEEN :WRK_START_CHANGE_PERIOD           07160000
                                 AND :WRK_RUN_DATE                      07170000
   ;                                                                    07180000
                                                                        07190000
 SELECT(SQLCODE);                                                       07200000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */07210000
   WHEN(100);                                                           07220000
   OTHERWISE                                                            07230000
     DO;                                                                07240000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                07250000
                           'DB2',                                       07260000
                           '#039');                                     07270000
     END;                                                               07280000
 END;                                                                   07290000
                                                                        07300000
 END R801_RETR_INSERT_FROM_RCBV0010;                                    07310000
1/*-------------------     RA01120 AMENDMENT    ---------------------*/ 07320000
 /*********************************************************************/07330000
 /*                                                                   */07340000
 /* MODULE NAME      :  R802_RETR_INSERT_FROM_RCBV0035                */07350000
 /*                                                                   */07360000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */07370000
 /*                    INTO RCBV0731_RCMS_C_TP                        */07380000
 /*                                                                   */07390000
 /*********************************************************************/07400000
 R802_RETR_INSERT_FROM_RCBV0035: PROC;                                  07410000
                                                                        07420000
 EXEC SQL                                                               07430000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 07440000
     SELECT DISTINCT                                                    07450000
         COUNTRY_NUMBER                                                 07460000
        ,CUSTOMER_NUMBER                                                07470000
     FROM RCBV0035_CUST_CTR                                             07480000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               07490000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            07500000
                                AND :WRK_RUN_DATE                       07510000
   ;                                                                    07520000
                                                                        07530000
 SELECT(SQLCODE);                                                       07540000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */07550000
   WHEN(100);                                                           07560000
   OTHERWISE                                                            07570000
     DO;                                                                07580000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                07590000
                           'DB2',                                       07600000
                           '#040');                                     07610000
     END;                                                               07620000
 END;                                                                   07630000
                                                                        07640000
 END R802_RETR_INSERT_FROM_RCBV0035;                                    07650000
 /*------------------- END OF RA01120 AMENDMENT ---------------------*/ 07660000
1/*********************************************************************/07670000
 /*                                                                   */07680000
 /* MODULE NAME      :  R803_RETR_INSERT_FROM_RCBV0150                */07690000
 /*                                                                   */07700000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */07710000
 /*                    INTO RCBV0731_RCMS_C_TP                        */07720000
 /*                                                                   */07730000
 /*********************************************************************/07740000
 R803_RETR_INSERT_FROM_RCBV0150: PROC;                                  07750000
                                                                        07760000
 EXEC SQL                                                               07770000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 07780000
     SELECT DISTINCT                                                    07790000
         COUNTRY_NUMBER                                                 07800000
        ,CUSTOMER_NUMBER                                                07810000
     FROM RCBV0150_CUST_ADDR                                            07820000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               07830000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            07840000
                                AND :WRK_RUN_DATE                       07850000
   ;                                                                    07860000
                                                                        07870000
 SELECT(SQLCODE);                                                       07880000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */07890000
   WHEN(100);                                                           07900000
   OTHERWISE                                                            07910000
     DO;                                                                07920000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                07930000
                           'DB2',                                       07940000
                           '#041');                                     07950000
     END;                                                               07960000
 END;                                                                   07970000
                                                                        07980000
 END R803_RETR_INSERT_FROM_RCBV0150;                                    07990000
1/*********************************************************************/08000000
 /*                                                                   */08010000
 /* MODULE NAME      :  R804_RETR_INSERT_FROM_RCBV0170                */08020000
 /*                                                                   */08030000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */08040000
 /*                    INTO RCBV0731_RCMS_C_TP                        */08050000
 /*                                                                   */08060000
 /*********************************************************************/08070000
 R804_RETR_INSERT_FROM_RCBV0170: PROC;                                  08080000
                                                                        08090000
                                                    /* START PTM1008 */ 08100000
 EXEC SQL                                                               08110000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 08120000
     SELECT DISTINCT                                                    08130000
         B.COUNTRY_NUMBER                                               08140000
        ,B.CUSTOMER_NUMBER                                              08150000
     FROM RCBV0170_OU_HW     A                                          08160000
         ,RCBV0190_HW_CUST   B                                          08170000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           08180000
       AND (                                                            08190000
           A.LAST_CHANGE_DATE   BETWEEN :WRK_START_CHANGE_PERIOD        08200000
                                    AND :WRK_RUN_DATE                   08210000
       OR  A.END_DATE           BETWEEN :WRK_START_CHANGE_PERIOD        08220000
                                    AND :WRK_RUN_DATE                   08230000
           )                                                            08240000
       AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        08250000
       AND B.ORIGIN             = A.ORIGIN                              08260000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     08270000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      08280000
       AND B.TYPE_OF_RELATION   = 'U'                                   08290000
       AND :WRK_RUN_DATE        BETWEEN B.EFFECTIVE_DATE                08300000
                                    AND B.END_DATE                      08310000
     ;                                                                  08320000
                                                                        08330000
 SELECT(SQLCODE);                                                       08340000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */08350000
   WHEN(100);                                                           08360000
   OTHERWISE                                                            08370000
     DO;                                                                08380000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                08390000
                           'DB2',                                       08400000
                           '#042');                                     08410000
     END;                                                               08420000
 END;                                                                   08430000
                                                         /* RTM0791  */ 08440000
                                                      /* END PTM1008 */ 08450000
 END R804_RETR_INSERT_FROM_RCBV0170;                                    08460000
1/*********************************************************************/08470000
 /*                                                                   */08480000
 /* MODULE NAME      :  R805_RETR_INSERT_FROM_RCBV0180                */08490000
 /*                                                                   */08500000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */08510000
 /*                    INTO RCBV0731_RCMS_C_TP                        */08520000
 /*                                                                   */08530000
 /*********************************************************************/08540000
 R805_RETR_INSERT_FROM_RCBV0180: PROC;                                  08550000
                                                                        08560000
                                                    /* START PTM1008 */ 08570000
                                    /* ADD CTRYNO TO WHERE * RC01219 */ 08580000
                                    /* CLAUSE OF T200      * RC01219 */ 08590000
 EXEC SQL                                                               08600000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 08610000
     SELECT DISTINCT                                                    08620000
         A.COUNTRY_NUMBER                                               08630000
        ,B.CUSTOMER_USER                                                08640000
     FROM RCBV0180_OU_SW     A                                          08650000
         ,RCBV0200_SW_CUST   B                                          08660000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           08670000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      08680000
       AND (                                                            08690000
           A.LAST_CHANGE_DATE   BETWEEN :WRK_START_CHANGE_PERIOD        08700000
                                    AND :WRK_RUN_DATE                   08710000
       OR  A.END_DATE           BETWEEN :WRK_START_CHANGE_PERIOD        08720000
                                    AND :WRK_RUN_DATE                   08730000
           )                                                            08740000
       AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        08750000
       AND B.MODEL_NUMBER       = A.MODEL_NUMBER                        08760000
       AND B.ORIGIN             = A.ORIGIN                              08770000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     08780000
       AND :WRK_RUN_DATE        BETWEEN B.EFFECTIVE_DATE                08790000
                                    AND B.END_DATE                      08800000
     ;                                                                  08810000
                                                                        08820000
 SELECT(SQLCODE);                                                       08830000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */08840000
   WHEN(100);                                                           08850000
   OTHERWISE                                                            08860000
     DO;                                                                08870000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                08880000
                           'DB2',                                       08890000
                           '#043');                                     08900000
     END;                                                               08910000
 END;                                                                   08920000
                                                         /* RTM0719  */ 08930000
                                                      /* END PTM1008 */ 08940000
 END R805_RETR_INSERT_FROM_RCBV0180;                                    08950000
1/*********************************************************************/08960000
 /*                                                                   */08970000
 /* MODULE NAME      :  R806_RETR_INSERT_FROM_RCBV0190                */08980000
 /*                                                                   */08990000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */09000000
 /*                    INTO RCBV0731_RCMS_C_TP                        */09010000
 /*                                                                   */09020000
 /*********************************************************************/09030000
 R806_RETR_INSERT_FROM_RCBV0190: PROC;                                  09040000
                                                                        09050000
 EXEC SQL                                                               09060000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 09070000
     SELECT DISTINCT                                                    09080000
         COUNTRY_NUMBER                                                 09090000
        ,CUSTOMER_NUMBER                                                09100000
     FROM RCBV0190_HW_CUST                                              09110000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               09120000
       AND TYPE_OF_RELATION = 'U'                                       09130000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            09140000
                                AND :WRK_RUN_DATE                       09150000
   ;                                                                    09160000
                                                                        09170000
 SELECT(SQLCODE);                                                       09180000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */09190000
   WHEN(100);                                                           09200000
   OTHERWISE                                                            09210000
     DO;                                                                09220000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                09230000
                           'DB2',                                       09240000
                           '#044');                                     09250000
     END;                                                               09260000
 END;                                                                   09270000
                                                                        09280000
 END R806_RETR_INSERT_FROM_RCBV0190;                                    09290000
1/*********************************************************************/09300000
 /*                                                                   */09310000
 /* MODULE NAME      :  R807_RETR_INSERT_FROM_RCBV0200                */09320000
 /*                                                                   */09330000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */09340000
 /*                    INTO RCBV0731_RCMS_C_TP                        */09350000
 /*                                                                   */09360000
 /*********************************************************************/09370000
 R807_RETR_INSERT_FROM_RCBV0200: PROC;                                  09380000
                                                                        09390000
 EXEC SQL                                                               09400000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 09410000
     SELECT DISTINCT                                                    09420000
         COUNTRY_NUMBER                                                 09430000
        ,CUSTOMER_USER                                                  09440000
     FROM RCBV0200_SW_CUST                                              09450000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               09460000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            09470000
                                AND :WRK_RUN_DATE                       09480000
   ;                                                                    09490000
                                                                        09500000
 SELECT(SQLCODE);                                                       09510000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */09520000
   WHEN(100);                                                           09530000
   OTHERWISE                                                            09540000
     DO;                                                                09550000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                09560000
                           'DB2',                                       09570000
                           '#045');                                     09580000
     END;                                                               09590000
 END;                                                                   09600000
                                                                        09610000
 END R807_RETR_INSERT_FROM_RCBV0200;                                    09620000
1/*********************************************************************/09630000
 /*                                                                   */09640000
 /* MODULE NAME      :  R808_RETR_INSERT_FROM_RCBV0260                */09650000
 /*                                                                   */09660000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */09670000
 /*                    INTO RCBV0731_RCMS_C_TP                        */09680000
 /*                                                                   */09690000
 /*********************************************************************/09700000
 R808_RETR_INSERT_FROM_RCBV0260: PROC;                                  09710000
                                                                        09720000
 EXEC SQL                                                               09730000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 09740000
     SELECT DISTINCT                                                    09750000
         COUNTRY_NUMBER                                                 09760000
        ,CUSTOMER_USER                                                  09770000
     FROM RCBV0260_HW_IN_ORD                                            09780000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               09790000
       AND ORIGIN           IS NOT NULL                                 09800000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            09810000
                                AND :WRK_RUN_DATE                       09820000
   ;                                                                    09830000
                                                                        09840000
 SELECT(SQLCODE);                                                       09850000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */09860000
   WHEN(100);                                                           09870000
   OTHERWISE                                                            09880000
     DO;                                                                09890000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                09900000
                           'DB2',                                       09910000
                           '#046');                                     09920000
     END;                                                               09930000
 END;                                                                   09940000
                                                                        09950000
 END R808_RETR_INSERT_FROM_RCBV0260;                                    09960000
1/*********************************************************************/09970000
 /*                                                                   */09980000
 /* MODULE NAME      :  R809_RETR_INSERT_FROM_RCBV0280                */09990000
 /*                                                                   */10000000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */10010000
 /*                    INTO RCBV0731_RCMS_C_TP                        */10020000
 /*                                                                   */10030000
 /*********************************************************************/10040000
 R809_RETR_INSERT_FROM_RCBV0280: PROC;                                  10050000
                                                                        10060000
 EXEC SQL                                                               10070000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 10080000
     SELECT DISTINCT                                                    10090000
         COUNTRY_NUMBER                                                 10100000
        ,CUSTOMER_NUMBER                                                10110000
     FROM RCBV0280_ADDR_LINE                                            10120000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               10130000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            10140000
                                AND :WRK_RUN_DATE                       10150000
   ;                                                                    10160000
                                                                        10170000
 SELECT(SQLCODE);                                                       10180000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */10190000
   WHEN(100);                                                           10200000
   OTHERWISE                                                            10210000
     DO;                                                                10220000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                10230000
                           'DB2',                                       10240000
                           '#047');                                     10250000
     END;                                                               10260000
 END;                                                                   10270000
                                                                        10280000
 END R809_RETR_INSERT_FROM_RCBV0280;                                    10290000
1/*********************************************************************/10300000
 /*                                                                   */10310000
 /* MODULE NAME      :  R810_RETR_INSERT_FROM_RCBV0320                */10320000
 /*                                                                   */10330000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */10340000
 /*                    INTO RCBV0731_RCMS_C_TP                        */10350000
 /*                                                                   */10360000
 /*********************************************************************/10370000
 R810_RETR_INSERT_FROM_RCBV0320: PROC;                                  10380000
                                                                        10390000
 EXEC SQL                                                               10400000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 10410000
     SELECT DISTINCT                                                    10420000
         B.COUNTRY_NUMBER                                               10430000
        ,B.CUSTOMER_USER                                                10440000
     FROM RCBV0320_SW_ON_HW   A                                         10450000
         ,RCBV0200_SW_CUST    B                                         10460000
     WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                             10470000
       AND A.LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD          10480000
                                  AND :WRK_RUN_DATE                     10490000
                                                                        10500000
       AND B.PRODUCT_TYPE     = A.PRODUCT_TYPE_SW                       10510000
       AND B.MODEL_NUMBER     = A.MODEL_NUMBER_SW                       10520000
       AND B.ORIGIN           = A.ORIGIN_SW                             10530000
       AND B.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER_SW                    10540000
       AND B.COUNTRY_NUMBER   = A.COUNTRY_NUMBER                        10550000
       AND :WRK_RUN_DATE      BETWEEN B.EFFECTIVE_DATE                  10560000
                                  AND B.END_DATE                        10570000
    ;                                                                   10580000
                                                                        10590000
 SELECT(SQLCODE);                                                       10600000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */10610000
   WHEN(100);                                                           10620000
   OTHERWISE                                                            10630000
     DO;                                                                10640000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                10650000
                           'DB2',                                       10660000
                           '#048');                                     10670000
     END;                                                               10680000
 END;                                                                   10690000
                                                                        10700000
 END R810_RETR_INSERT_FROM_RCBV0320;                                    10710000
1/*********************************************************************/10720000
 /*                                                                   */10730000
 /* MODULE NAME      :  R811_RETR_INSERT_FROM_RCBV0340                */10740000
 /*                                                                   */10750000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */10760000
 /*                    INTO RCBV0731_RCMS_C_TP                        */10770000
 /*                                                                   */10780000
 /*********************************************************************/10790000
 R811_RETR_INSERT_FROM_RCBV0340: PROC;                                  10800000
                                                                        10810000
 EXEC SQL                                                               10820000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 10830000
     SELECT DISTINCT                                                    10840000
         B.COUNTRY_NUMBER                                               10850000
        ,B.CUSTOMER_NUMBER                                              10860000
     FROM RCBV0340_HW_ADDR    A                                         10870000
         ,RCBV0190_HW_CUST    B                                         10880000
     WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                             10890000
       AND A.LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD          10900000
                                  AND :WRK_RUN_DATE                     10910000
                                                                        10920000
       AND B.PRODUCT_TYPE     = A.PRODUCT_TYPE                          10930000
       AND B.ORIGIN           = A.ORIGIN                                10940000
       AND B.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER                       10950000
       AND B.COUNTRY_NUMBER   = A.COUNTRY_NUMBER                        10960000
       AND B.TYPE_OF_RELATION = 'U'                                     10970000
       AND :WRK_RUN_DATE      BETWEEN B.EFFECTIVE_DATE                  10980000
                                 AND B.END_DATE                         10990000
    ;                                                                   11000000
                                                                        11010000
 SELECT(SQLCODE);                                                       11020000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */11030000
   WHEN(100);                                                           11040000
   OTHERWISE                                                            11050000
     DO;                                                                11060000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                11070000
                           'DB2',                                       11080000
                           '#049');                                     11090000
     END;                                                               11100000
 END;                                                                   11110000
                                                                        11120000
 END R811_RETR_INSERT_FROM_RCBV0340;                                    11130000
1/*********************************************************************/11140000
 /*                                                                   */11150000
 /* MODULE NAME      :  R812_RETR_INSERT_FROM_RCBV0350                */11160000
 /*                                                                   */11170000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */11180000
 /*                    INTO RCBV0731_RCMS_C_TP                        */11190000
 /*                                                                   */11200000
 /*********************************************************************/11210000
 R812_RETR_INSERT_FROM_RCBV0350: PROC;                                  11220000
                                                                        11230000
 EXEC SQL                                                               11240000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 11250000
     SELECT DISTINCT                                                    11260000
         COUNTRY_NUMBER                                                 11270000
        ,CUSTOMER_NUMBER                                                11280000
     FROM RCBV0350_CUST_MOD                                             11290000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               11300000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            11310000
                                AND :WRK_RUN_DATE                       11320000
   ;                                                                    11330000
                                                                        11340000
 SELECT(SQLCODE);                                                       11350000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */11360000
   WHEN(100);                                                           11370000
   OTHERWISE                                                            11380000
     DO;                                                                11390000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                11400000
                           'DB2',                                       11410000
                           '#050');                                     11420000
     END;                                                               11430000
 END;                                                                   11440000
                                                                        11450000
 END R812_RETR_INSERT_FROM_RCBV0350;                                    11460000
 /*-------------------     RA01090 AMENDMENT    ---------------------*/ 11470000
1/*********************************************************************/11480000
 /*                                                                   */11490000
 /* MODULE NAME      :  R813_RETR_INSERT_FROM_RCBV0270                */11500000
 /*                                                                   */11510000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM SW ORDER TABLE      */11520000
 /*                    AND INSERT INTO RCBV0731_RCMS_C_TP             */11530000
 /*                                                                   */11540000
 /*********************************************************************/11550000
 R813_RETR_INSERT_FROM_RCBV0270: PROC;                                  11560000
                                                                        11570000
 EXEC SQL                                                               11580000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 11590000
     SELECT DISTINCT                                                    11600000
         COUNTRY_NUMBER                                                 11610000
        ,CUSTOMER_USER                                                  11620000
     FROM RCBV0270_SW_IN_ORD                                            11630000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               11640000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            11650000
                                AND :WRK_RUN_DATE                       11660000
   ;                                                                    11670000
                                                                        11680000
 SELECT(SQLCODE);                                                       11690000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */11700000
   WHEN(100);                                                           11710000
   OTHERWISE                                                            11720000
     DO;                                                                11730000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                11740000
                           'DB2',                                       11750000
                           '#051');                                     11760000
     END;                                                               11770000
 END;                                                                   11780000
                                                                        11790000
 END R813_RETR_INSERT_FROM_RCBV0270;                                    11800000
 /*------------------- END OF RA01090 AMENDMENT ---------------------*/ 11810000
1/*-------------------     PTM0684 AMENDMENT    ---------------------*/ 11820000
 /*********************************************************************/11830000
 /*                                                                   */11840000
 /* MODULE NAME      :  R814_RETR_INSERT_FROM_RCBV0210                */11850000
 /*                                                                   */11860000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */11870000
 /*                    INTO RCBV0731_RCMS_C_TP                        */11880000
 /*                                                                   */11890000
 /*********************************************************************/11900000
 R814_RETR_INSERT_FROM_RCBV0210: PROC;                                  11910000
                                                                        11920000
 EXEC SQL                                                               11930000
   INSERT INTO RCBV0731_RCMS_C_TP                        /* RTM0719  */ 11940000
     SELECT DISTINCT                                                    11950000
         COUNTRY_NUMBER                                                 11960000
        ,CUSTOMER_NUMBER                                                11970000
     FROM RCBV0210_ADD_SERV                                             11980000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               11990000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            12000000
                                AND :WRK_RUN_DATE                       12010000
   ;                                                                    12020000
                                                                        12030000
 SELECT(SQLCODE);                                                       12040000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */12050000
   WHEN(100);                                                           12060000
   OTHERWISE                                                            12070000
     DO;                                                                12080000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                12090000
                           'DB2',                                       12100000
                           '#052');                                     12110000
     END;                                                               12120000
 END;                                                                   12130000
                                                                        12140000
 END R814_RETR_INSERT_FROM_RCBV0210;                                    12150000
 /*------------------- END OF PTM0684 AMENDMENT ---------------------*/ 12160000
1/*********************************************************************/12170000
 /*                                                           RC01158 */12180000
 /* MODULE NAME      :  R815_RETR_INSERT_FROM_RCBV0011                */12190000
 /*                                                                   */12200000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */12210000
 /*                    INTO RCBV0731_RCMS_C_TP                        */12220000
 /*                                                                   */12230000
 /*********************************************************************/12240000
 R815_RETR_INSERT_FROM_RCBV0011: PROC;                                  12250000
                                                                        12260000
 EXEC SQL                                                               12270000
   INSERT INTO RCBV0731_RCMS_C_TP                                       12280000
     SELECT DISTINCT                                                    12290000
         COUNTRY_NUMBER                                                 12300000
        ,CUSTOMER_NUMBER                                                12310000
     FROM RCBV0011_PI_CUST                                              12320000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               12330000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            12340000
                                AND :WRK_RUN_DATE                       12350000
   ;                                                                    12360000
                                                                        12370000
 SELECT(SQLCODE);                                                       12380000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */12390000
   WHEN(100);                                                           12400000
   OTHERWISE                                                            12410000
     DO;                                                                12420000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                12430000
                           'DB2',                                       12440000
                           '#053');                                     12450000
     END;                                                               12460000
 END;                                                                   12470000
                                                                        12480000
 END R815_RETR_INSERT_FROM_RCBV0011;                  /* EOC RC01158 */ 12490000
1/*********************************************************************/12500000
 /*                                                           RC01158 */12510000
 /* MODULE NAME      :  R816_RETR_INSERT_FROM_RCBV0051                */12520000
 /*                                                                   */12530000
 /* DESCRIPTION      : RETRIEVE CHANGED KEYS FROM TABLE AND INSERT    */12540000
 /*                    INTO RCBV0731_RCMS_C_TP                        */12550000
 /*                                                                   */12560000
 /*********************************************************************/12570000
 R816_RETR_INSERT_FROM_RCBV0051: PROC;                                  12580000
                                                                        12590000
 EXEC SQL                                                               12600000
   INSERT INTO RCBV0731_RCMS_C_TP                                       12610000
     SELECT DISTINCT                                                    12620000
         COUNTRY_NUMBER                                                 12630000
        ,CUSTOMER_NUMBER                                                12640000
     FROM RCBV0051_PI_HW_PR                                             12650000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               12660000
       AND LAST_CHANGE_DATE BETWEEN :WRK_START_CHANGE_PERIOD            12670000
                                AND :WRK_RUN_DATE                       12680000
   ;                                                                    12690000
                                                                        12700000
 SELECT(SQLCODE);                                                       12710000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */12720000
   WHEN(100);                                                           12730000
   OTHERWISE                                                            12740000
     DO;                                                                12750000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                12760000
                           'DB2',                                       12770000
                           '#054');                                     12780000
     END;                                                               12790000
 END;                                                                   12800000
                                                                        12810000
 END R816_RETR_INSERT_FROM_RCBV0051;                  /* EOC RC01158 */ 12820000
1/*********************************************************************/12830000
 /*                                                           RC01219 */12840000
 /* MODULE NAME      :  R820_DISTINCT_COPY_RCBV0721                   */12850000
 /*                                                                   */12860000
 /* DESCRIPTION      :  COPY THE DISTINCT KEYS FROM TABLE             */12870000
 /*                     RCBT0731_RCMS_C_TP INTO RCBT0721_RCMS_CU      */12880000
 /*                     FOR THE CURRENT COUNTRY                       */12890000
 /*                                                                   */12900000
 /*********************************************************************/12910000
 R820_DISTINCT_COPY_RCBV0721: PROC;                                     12920000
                                                                        12930000
 EXEC SQL                                                               12940000
  INSERT INTO RCBT0721_RCMS_CU                                          12950000
  SELECT DISTINCT * FROM RCBT0731_RCMS_C_TP                             12960000
   WHERE COUNTRY_NUMBER = :WRK_CTRYNO                                   12970000
   ;                                                                    12980000
                                                                        12990000
 SELECT(SQLCODE);                                                       13000000
   WHEN(0) EXEC SQL COMMIT;                                /* PTM1339 */13010000
   WHEN(100);                                                           13020000
   OTHERWISE                                                            13030000
     DO;                                                                13040000
       CALL RCBDREM_ERROR (ADDR (SQLCA),                                13050000
                           'DB2',                                       13060000
                           '#055');                                     13070000
     END;                                                               13080000
 END;                                                                   13090000
                                                                        13100000
 END R820_DISTINCT_COPY_RCBV0721;                                       13110000
                                                                        13120000
1/********************************************************************/ 13130000
 /*                                                                  */ 13140000
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 13150000
 /*                                                                  */ 13160000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 13170000
 /*                                                                  */ 13180000
 /********************************************************************/ 13190000
 R900_INIT_PROGRAM: PROC;                                               13200000
                                                                        13210000
                                             /* INITIALISE POINTERS  */ 13220000
 PTR_INT_AREA       = ADDR(PARM_INT_AREA);                              13230000
 PTR_RETURN_AREA_BB = ADDR(RETURN_AREA_BB);                             13240000
 PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA);                              13250000
 PTR_RUN_DATE_AREA  = ADDR (RUN_DATE_AREA);                             13260000
                                             /* INITIALISE VARIABLES */ 13270000
 PARM_INT_AREA.MSG_AREA       = '';                                     13280000
 PARM_INT_AREA.ERR_AREA       = ' ';                                    13290000
 PARM_INT_AREA.MSG_REQUEST    = 'O';                                    13300000
 PARM_INT_AREA.MSG_TARGET     = 'F';                                    13310000
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                  13320000
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                           13330000
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           13340000
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      13350000
 PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                        13360000
 PARM_INT_AREA.TXN_CODE       = '';                                     13370000
 PARM_INT_AREA.VERSION        = '';                                     13380000
 PARM_INT_AREA.PTR_PCB_IO     = NULL;                                   13390000
 PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                   13400000
                                              /* OPEN MESSAGE FILE   */ 13410000
 CALL RCB0M1M(PTR_INT_AREA);                                            13420000
                                              /* RETR. SYSTEM DATE   */ 13430000
 CALL RCB0T1M(PTR_INT_AREA);                                            13440000
                                              /* RETRIEVE COUNTRY    */ 13450000
 CALL RCB019M (PTR_COUNTRY_AREA,                                        13460000
               PTR_INT_AREA);                                           13470000
                                                                        13480000
 SELECT;                                      /* ONLY ONE COUNTRY    */ 13490000
   WHEN(COUNTRY_AREA.COUNT_CTRY = 0)                                    13500000
     DO;                                                                13510000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            13520000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            13530000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          13540000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                        13550000
       CALL RCB0M1M (PTR_INT_AREA);                                     13560000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#056');                      13570000
     END;                                                               13580000
   WHEN(COUNTRY_AREA.COUNT_CTRY > 1)                                    13590000
     DO;                                                                13600000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            13610000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            13620000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          13630000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0189';                        13640000
       CALL RCB0M1M (PTR_INT_AREA);                                     13650000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#057');                      13660000
     END;                                                               13670000
   OTHERWISE                                                            13680000
     DO;                                                                13690000
       WRK_CTRYNO   = COUNTRY_AREA.CTRY_ARRAY(1).CTRYNO;                13700000
       WRK_PGR_TYPE = COUNTRY_AREA.CTRY_ARRAY(1).PGR_TYPE;              13710000
     END;                                                               13720000
 END;                                                                   13730000
                                              /* LOCK TABLES         */ 13740000
 CALL R001_LOCK_TABLES;                                                 13750000
                                                /* RETRIEVE RUN DATE */ 13760000
 RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                       13770000
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 13780000
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               13790000
                                                                        13800000
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       13810000
               PTR_INT_AREA);                                           13820000
                                                                        13830000
 IF RUN_DATE_AREA.RUN_DATE = ''   /* NO RUN DATE RCB001 FOUND */        13840000
 THEN                                                                   13850000
   DO;                                                                  13860000
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          13870000
   END;                                                                 13880000
 ELSE                                                                   13890000
   DO;                                                                  13900000
     WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                             13910000
   END;                                                                 13920000
                                                                        13930000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           13940000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 13950000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               13960000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   13970000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 13980000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         13990000
 CALL RCB0M1M (PTR_INT_AREA);                                           14000000
                                                                        14010000
                                       /* RETRIEVE LAST EXTRACT DATE */ 14020000
 TB_RCBV500   = '';                                                     14030000
 TB_RCBV500_I = '';                                                     14040000
 TB_RCBP37S.NUMBER  = 'RCB037';                                         14050000
 TB_RCBP37S.PROC_ID = COUNTRY_AREA.PROC_ID;                             14060000
 TB_RCBP37S.CTRYNO  = WRK_CTRYNO;                                       14070000
                                                                        14080000
0CALL RCBI50M ('U',                                       /* RC01219 */ 14090000
               ADDR(TB_RCBV500),                                        14100000
               ADDR(TB_RCBV500_I),                                      14110000
               PTR_RETURN_AREA_BB,                                      14120000
               PTR_INT_AREA);                                           14130000
                                                                        14140000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    14150000
  WHEN (0)                                                              14160000
    DO;                                                                 14170000
       WRK_LAST_EXTR_DATE = TB_RCBP37S.LAST_EXTR_DATE;                  14180000
                                                                        14190000
             /* DETERMINE START_CHANGE_PERIOD = LAST_EXTR_DATE + 1   */ 14200000
             /* TO EXCLUDE LAST_EXTR_DATE FROM EXTRACT PERIOD        */ 14210000
       PARM_DATE_CALC = '';                                             14220000
       PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                           14230000
       PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                           14240000
       PARM_DATE_CALC.WD_FUNCTION    = 'C';                             14250000
       PARM_DATE_CALC.WD_PERIOD      = 1;                               14260000
       PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                             14270000
       PARM_DATE_CALC.WD_IN_DATE     = TB_RCBP37S.LAST_EXTR_DATE;       14280000
                                                                        14290000
       CALL RCB004M (ADDR(PARM_DATE_CALC));                             14300000
                                                                        14310000
       IF PARM_DATE_CALC.WD_STATUS ¬= ''                                14320000
         THEN DO;                                                       14330000
           PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                      14340000
           PARM_INT_AREA.MESSAGE_NUMBER    = '0012';                    14350000
           PARM_INT_AREA.MSG_VAR_CODES     = '';                        14360000
                                                                        14370000
           PARM_INT_AREA.MSG_VAR_CODE_6    = 'DN';                      14380000
           PARM_INT_AREA.MSG_VAR_VALUE_6   = 'LAST_EXTR_DATE';          14390000
           PARM_INT_AREA.MSG_VAR_CODE_7    = 'DT';                      14400000
           PARM_INT_AREA.MSG_VAR_VALUE_7   = PARM_DATE_CALC.WD_IN_DATE; 14410000
           PARM_INT_AREA.MSG_VAR_CODE_8    = 'RC';                      14420000
           PARM_INT_AREA.MSG_VAR_VALUE_8   = PARM_DATE_CALC.WD_STATUS;  14430000
           CALL RCB0M1M (PTR_INT_AREA);                                 14440000
           CALL RCBDREM_ERROR (NULL,                                    14450000
                               'OTHER',                                 14460000
                               '#058');                                 14470000
            END;                                                        14480000
                                                                        14490000
       WRK_START_CHANGE_PERIOD = PARM_DATE_CALC.WD_OUT_DATE;            14500000
    END;                                                                14510000
  WHEN (4)                            /* NO LAST EXTRACT DATE FOUND  */ 14520000
    DO;                                                                 14530000
       PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                 14540000
       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';               14550000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                  14560000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                 14570000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                       14580000
                                       TB_RCBV500.PARAMETER_NUMBER;     14590000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                 14600000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                       14610000
                                       TB_RCBV500.PARAMETER_KEY;        14620000
       CALL RCB0M1M (PTR_INT_AREA);                                     14630000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#059');                      14640000
    END;                                                                14650000
  OTHERWISE DO;                                                         14660000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            14670000
                                 'DB2',                                 14680000
                                 '#060');                               14690000
            END;                                                        14700000
 END;                                                                   14710000
                                                                        14720000
                                       /* RETRIEVE RCMS EXTRACT PARM */ 14730000
 TB_RCBV500   = '';                                                     14740000
 TB_RCBV500_I = '';                                                     14750000
 TB_RCBP05S.NUMBER   = 'RCB005';                                        14760000
 TB_RCBP05S.CTRYNO   = WRK_CTRYNO;                                      14770000
 TB_RCBP05S.PGR_TYPE = WRK_PGR_TYPE;                                    14780000
                                                                        14790000
0CALL RCBI50M ('U',                                       /* RC01219 */ 14800000
               ADDR(TB_RCBV500),                                        14810000
               ADDR(TB_RCBV500_I),                                      14820000
               PTR_RETURN_AREA_BB,                                      14830000
               PTR_INT_AREA);                                           14840000
                                                                        14850000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    14860000
  WHEN (0)                                                              14870000
    DO;                                                                 14880000
       PARM_RCB005        = TB_RCBP05S, BY NAME;                        14890000
                                                                        14900000
    END;                                                                14910000
  WHEN (4)                            /* NO RCMS EXTR PARM FOUND     */ 14920000
    DO;                                                                 14930000
       PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                   14940000
       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = 'I050';                 14950000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                    14960000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                   14970000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                         14980000
                                       TB_RCBV500.PARAMETER_NUMBER;     14990000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'PK';                   15000000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                         15010000
                                       TB_RCBV500.PARAMETER_KEY;        15020000
       CALL RCB0M1M (PTR_INT_AREA);                                     15030000
       CALL RCBDREM_ERROR (NULL, 'OTHER', '#061');                      15040000
    END;                                                                15050000
  OTHERWISE DO;                                                         15060000
       CALL RCBDREM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            15070000
                                 'DB2',                                 15080000
                                 '#062');                               15090000
            END;                                                        15100000
 END;                                                                   15110000
                                                                        15120000
 END R900_INIT_PROGRAM;                                                 15130000
1/********************************************************************/ 15140000
 /*                                                                  */ 15150000
 /* MODULE NAME      : R999_END_PROGRAM                              */ 15160000
 /*                                                                  */ 15170000
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 15180000
 /*                                                                  */ 15190000
 /********************************************************************/ 15200000
 R999_END_PROGRAM:  PROC;                                               15210000
                                                                        15220000
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 15230000
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  15240000
 PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                                15250000
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    15260000
 CALL RCB0M1M (PTR_INT_AREA);                                           15270000
                                                                        15280000
                                    /* CLOSE MESSAGE FILE            */ 15290000
 PARM_INT_AREA.MSG_REQUEST = 'C';                                       15300000
 CALL RCB0M1M (PTR_INT_AREA);                                           15310000
                                                                        15320000
 END R999_END_PROGRAM;                                                  15330000
1/********************************************************************/ 15340000
 /*                                                                  */ 15350000
 /* MODULE NAME      : RCBDREM_ERROR                                 */ 15360000
 /*                                                                  */ 15370000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 15380000
 /*                    THE INPUT VARIABLES                           */ 15390000
 /*                                                                  */ 15400000
 /********************************************************************/ 15410000
 RCBDREM_ERROR: PROC    (PTR_ERROR,                                     15420000
                         ERR_TYPE,                                      15430000
                         CALL_ID);                                      15440000
 DCL PTR_ERROR     PTR;                                                 15450000
 DCL ERR_TYPE      CHAR(8);                                             15460000
 DCL CALL_ID       CHAR(4);                                             15470000
 PARM_INT_AREA.PTR_ERROR          = PTR_ERROR;                          15480000
 PARM_INT_AREA.ERR_TYPE           = ERR_TYPE;                           15490000
 PARM_INT_AREA.CALL_ID            = CALL_ID;                            15500000
 CALL RCB0E1M (ADDR(PARM_INT_AREA));                                    15510000
                                                                        15520000
 END RCBDREM_ERROR;                                                     15530000
1/*******************************************************************/  15540000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  15550000
 /*******************************************************************/  15560000
 %INCLUDE DAIFPLH ;                      /* COMPILE DATE/TIME STAMP */  15570000
 $DAIMOD (RCBDREM);                      /* MODULE TO BE COMPILED   */  15580000
 /*******************************************************************/  15590000
 /* END OF ABR BLOCK                                                */  15600000
 /*******************************************************************/  15610000
 END RCBDREM;                                                           15620000