1/* RCBDTBM - BMT HW: DELTA EXTRACT                                  */ 00010000
 /********************************************************************/ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /********************************************************************/ 00060000
 /* PROGRAM          : RCBDTBM                                       */ 00070000
 /*                                                                  */ 00080000
 /* LANGUAGE         : PLISQL                                        */ 00090000
 /*                                                                  */ 00100000
 /* TYPE             : BATCH                                         */ 00110000
 /*                                                                  */ 00120000
 /* DESCRIPTION      : THE EXTRACT OF HW RELATED INFORMATION FOR     */ 00130000
 /*                    EACH COUNTRY ASKED FOR AND FOR WHICH          */ 00140000
 /*                    INFORMATION HAS CHANGED SINCE THE LAST        */ 00150000
 /*                    BMT HW EXTRACT                                */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : - DB2   : RCBV0051_PI_HW_PR                   */ 00180000
 /*                              RCBV0110_HW_STATUS          PTM1290 */ 00190000
 /*                              RCBV0125_DMMY_REAL          RB01320 */ 00200000
 /*                              RCBV0170_OU_HW                      */ 00210000
 /*                              RCBV0190_HW_CUST                    */ 00220000
 /*                              RCBV0220_SUPPL_CTR                  */ 00230000
 /*                              RCBV0240_SERV_CTR                   */ 00240000
 /*                              RCBV0241_PI_CTR                     */ 00250000
 /*                              RCBV0300_HW_REAL                    */ 00260000
 /*                              RCBV0380_HW_PR_MOD          RC01234 */ 00270000
 /*                              RCBV0400_PO_MOD1            RB01278 */ 00280000
 /*                              RCBV0470_SERV_COND                  */ 00290000
 /*                              RCBV0475_CTRY_COND          RA01233 */ 00300000
 /*                              RCBV0500_PARM                       */ 00310000
 /*                              RCBV0640_TRANS_SVT                  */ 00320000
 /*                              RCBV0645_CTRY_SVT           RA01233 */ 00330000
 /*                              RCBV0030_CONTRACT           RA01239 */ 00340000
 /*                              RCBV0750_BMT_HW                     */ 00350000
 /*                              RCBV0010_CUSTOMER           RB01289 */ 00360000
 /*                              RCBV0011_PI_CUST            RB01289 */ 00370000
 /*                              RCBV0040_OU            CEDS00000548 */ 00380000
 /*                                                                  */ 00390000
 /* OUTPUT           : - FILE  : RCBDTB1                             */ 00400000
 /*                              RCB0M10                             */ 00410000
 /*                                                                  */ 00420000
 /* EXTERNAL MODULES : RCBG50M   UPDATE PARAMETER                    */ 00430000
 /*                    RCBISRM   RETRIEVE ROW FROM T470/475  RA01233 */ 00440000
 /*                    RCBI50M   RETRIEVE PARAMETER                  */ 00450000
 /*                    RCB0E1M   COMMON ERROR ROUTINE                */ 00460000
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00470000
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00480000
 /*                    RCB004M   DATE CALCULATION                    */ 00490000
 /*                    RCB018M   UPDATE HASH TOTAL                   */ 00500000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00510000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00520000
 /*                    RCBF50M   INSERT PARAMETER                    */ 00530000
 /*                    RCBIBOM   RETRIEVE SERVICE_TYPE FROM T640/645 */ 00540000
 /*                    RCBDT1U   USER EXIT                           */ 00550000
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00560000
 /*                                                                  */ 00570000
 /* MESSAGES         :                                               */ 00580000
 /*                                                                  */ 00590000
 /* DEPENDENCIES     : NONE                                          */ 00600000
 /*                                                                  */ 00610000
 /* FREQUENCY        : USER DEPENDENT                                */ 00620000
 /*                                                                  */ 00630000
 /* MAINTENANCE LOG  :                                               */ 00640000
 /* ---------------                                                  */ 00650000
 /*                                                                  */ 00660000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00670000
 /*           |              |                                       */ 00680000
 /*1999-03-19 | RA01217      | BMT INTERFACE                         */ 00690000
 /*           |              | COPY OF RCBDNBM                       */ 00700000
 /*1999-07-06 | RC01219      | DORO                                  */ 00710000
 /*2000-01-12 | PTM1290      | BMT ENHANCEMENTS:                     */ 00720000
 /*           |              | - CHANGE FILLING OF SERVICE START     */ 00730000
 /*           |              |   & STOP DATE                         */ 00740000
 /*           |              | - CHANGE FILLING INVENTORY SOURCE     */ 00750000
 /*           |              |   INDICATOR                           */ 00760000
 /*2002-07-02 | RA01233      | TACTICAL SERVICE REFERENCE            */ 00770000
 /*           | RC01234      | CEDS ENHANCEMENTS                     */ 00780000
 /*2003-08-05 | RA01239      | BMT INVENTORY  ENHANCEMENT            */ 00790000
 /*2003-10-02 | PTM1409      | PUT CALL R403 ON DIFFERENT PLACE      */ 00800000
 /*2004-06-21 | PTM1417      | SHOW FUTURE PI                        */ 00810000
 /*2004-08-18 | RB01242      | SEQUENCE NUMBER FROM 7 TO 28 CHAR.    */ 00820000
 /*2006-11-02 | RB01278      | CEDS 3.3 (LENOVO) VENDOR COST         */ 00830000
 /*           |              | ASSIGNMENT                            */ 00840000
 /*2007-01-09 | RC01279      | PASSING SDM TO DOWNSTREAM I.S.O.      */ 00850000
 /*           |              | SERVICE TYPE                          */ 00860000
 /*2007-01-23 | CEDS00000321 | IBM & LENOVO CONTRACT TO BE TREATED   */ 00870000
 /*           |              | DIFFERENTLY                           */ 00880000
 /* 2007-05-02| RB01281      | CHANGES FOR FLEXIBLE WARRANTY MACHINES*/ 00890000
 /* 2007-11-15| RB01283      | LENOVO FLAG A4                        */ 00900000
 /* 2008-02-28| RB01289      | PRIME INPUT CUSTOMER NUMBER           */ 00910000
 /* 2008-05-20| RB01290      | ACCEPT CONTRACTS ON INTERNAL MACHINES */ 00920000
 /* 2008-11-03| CEDS00000450 | RESET OF FLEXIBLE WARRANTY BAU/PI     */ 00930000
 /*           |              | SWITCHES TO FALSE IS ADDED.           */ 00940000
 /* 2008-11-14| RB01298      | HANDLING HARDBUNDLE MACHINES,         */ 00950000
 /*           |              | TREC-045,TREC-046: ALIGNMENT FOR      */ 00960000
 /*           |              |       FLEXIBLE WARRANTY MACHINES      */ 00970000
 /*           |              | PCR-0014: MOVING COUNTRY              */ 00980000
 /*           |              | DEVIATIONS FOR TOM TO MACHINE STATUS  */ 00990000
 /*           |              | FROM RCB063/RCB064 TO RCB071          */ 01000000
 /* 2009-01-22| CEDS00000455 | COUNTRY NUMBER CHECK IS MISSED IN     */ 01010000
 /*           |              | T030 SQL                              */ 01020000
 /* 2009-02-11| RB01299      | CEDS ALIGNMENT TO CHIS 810            */ 01030000
 /* 2009-05-28| CEDS00000468 | CURSOR_PI_HW IS RESTRICTED TO         */ 01040000
 /*           |              | TYPE_OF_RELATION AS 'U' IN T190       */ 01050000
 /* 2009-09-17| CEDS00000489 | QUERY MODIFIED TO RETRIEVE THE        */ 01060000
 /*           |              | THE EARLIEST FUTURE CONTRACT          */ 01070000
 /* 2010-03-10| RB01305      | BMT INVENTORY INTERFACE RULE CHANGE   */ 01080000
 /* 2010-06-16| CEDS00000526 | SDM NOT FILLED FOR PI WARRANTY        */ 01090000
 /* 2010-07-23| CEDS00000533 | WRK_SERVICE_LVL_CODE IS INITIALIZED   */ 01100000
 /*           |              | PROPERLY                              */ 01110000
 /* 2010-11-10| RC01311      | OU_CODE AND CUSTOMER NUMBER MISMATCH  */ 01120000
 /*           |              | CHANGES RELATED TO PCR-208            */ 01130000
 /* 2011-01-03| CEDS00000548 | CHECK THE EXISTENCE OF                */ 01140000
 /*           |              | T350.CU_ENGINEERING_OU IN T040        */ 01150000
 /* 2011-02-10| CEDS00000551 | UPDATED RULES IN FILLING BWSLC FOR    */ 01160000
 /*           |              | WARRANTY SECOND PERIOD                */ 01170000
 /* 2011-02-17| CEDS00000552 | BAU MODEL_NUM, CUP_TYPE, DP_SYS_NUMBER*/ 01180000
 /*           |              | OU_CODE & CUSTOMER_NUMBER OVERRULES PI*/ 01190000
 /* 2011-02-22| CEDS00000554 | CHANGES IN FILLING CONTRACT_SOURCE AND*/ 01200000
 /*           |              | INVENTORY_SOURCE FIELDS               */ 01210000
 /* 2011-05-04| RC01313      | PCEDSP-0064:SOLVE DESIGN ERROR OF     */ 01220000
 /*           |              | PCR 208 IN ALL DOWNSTREAMS            */ 01230000
 /* 2011-12-05| CEDS00000569 | IMPLIMENTED PRIORITY RULES WHEN       */ 01240000
 /*           |              | PI_TO_BMT FLAG IS TRUE                */ 01250000
 /* 2012-04-15| RB01320      | CEDS 3.3 A17 RELEASE:PCR PCEDSP-0164  */ 01260000
 /*           |              | SUPPORT FOR LONG SERIAL               */ 01270000
 /*           |              | CEDS 3.3 A17 RELEASE:T10-1398         */ 01280000
 /*           |              | HANDLING BLANK SLC FOR NULL           */ 01290000
 /*           |              | PI CONTRACT AND EXPIRED WARRENTY      */ 01300000
 /* 2013-02-25| CEDS00000624 | CHANGES FOR PREVENTING WRONG MACHINE  */ 01310000
 /*           |              | DETAILS FILL UP - BAU/PI DETAILS      */ 01320000
 /* 2015-01-05| RC01349      | PCEDSP-0522 LONG SERIAL FIELD         */ 01330000
 /*           |              | PROCESSING FOR IBM & NON IBM MACHINES */ 01340000
 /* 2015-02-11| RC01352      | PCEDSP 525 - FOR EMEA,INVENTORYSOURCE */ 01350000
 /*           |              | IS SET AS "P" FOR PI MACHINES.        */ 01360000
 /* 2015-02-13| RC01353      | P10-0612 : ESTABLISH A SPECIFIC       */ 01361000
 /*           |              | SOURCE INDICATOR FOR SERVICE          */ 01362000
 /*           |              | INTEGRATOR CONTRACTS                  */ 01363000
 /* 2015-06-05|  RC01359     | P10-0559 : REMOVED PADDED ZEROES FROM */ 01364000
 /*           |              | LONG SERIAL FIELD FOR IBM MACHINES    */ 01365000
 /* 2015-08-04| RC01362      | PCR 0472 - TO REMOVE ASSIGNING OF     */ 01366000
 /*           |              | TOM TO G WHEN RCB103 PARAMETER IS SET */ 01367000
 /*           |              | TO Y FOR LENOVO MACHINES              */ 01368000
 /* 2017-03-23| RC01389      | PCEDSP 34:RETENTION PERIOD FOR IBM    */ 01369000
 /*           |              | PI INVENTORY MACHINE IS CHANGED TO    */ 01369100
 /*           |              | 5 YEARS USING THE PARAMETER RCB159    */ 01369200
 /* 2017-04-24| CEDS00000814 | T080366: PASS FUTURE FIELDS TO        */ 01369367
 /*           |              | USER_FILE_PI AND USER_FILE_BAU        */ 01369467
 /********************************************************************/ 01370000
 /*(CHECK(                                                              01380000
 R001_LOCK_TABLES                            ,                          01390000
 R011_TRANS_TPMNT                            ,                          01400000
 R016_PERCALL_CALC                           ,                  RB01305 01410000
 R020_PLANCODE_1                             ,                          01420000
 R021_PLANCODE_2                             ,                          01430000
 R350_RETR_CU_ENGG_OU                        ,                  RC01311 01440000
 R402_FILL_SERV_CTR_PERIOD                   ,                          01450000
 R405_FILL_SUPPL_CTR_PERIOD                  ,                          01460000
 R440_RETRIEVE_SERVICE_TYPE                  ,                          01470000
 R430_RETRIEVE_SERVICE_DELIVERY              ,                          01480000
 R444_RETRIEVE_SRVICE_DLVRY_CONS             ,                          01490000
 R450_FILL_COV_241_470                       ,                          01500000
 R470_RETRIEVE_RCBV0470                      ,                          01510000
 R500_SERV_CTR_PERIOD                        ,                          01520000
 R508_RETR_ADD_INFO                          ,                          01530000
 R509_FILL_INFO                              ,                          01540000
 R609_FETCH_CURSOR_INST_HW                   ,                          01550000
 R621_PROCESS_USER_EXIT                      ,                          01560000
 R629_FETCH_CURSOR_PI_HW                     ,                          01570000
 R630_PI_PERCALL                             ,                  RB01305 01580000
 R639_FETCH_PI_FUT_CTR                       ,                  RB01305 01590000
 R700_INIT_COUNTRY                           ,                          01600000
 R701_INIT_HW_OCCURENCE                      ,                          01610000
 R710_PROCESS_PI_HW                          ,                          01620000
 R720_PROCESS_REGULAR_HW                     ,                          01630000
 R740_FINISH_HW_OCCURENCE                    ,                          01640000
 R749_WRITE_RCBDTB1                          ,                          01650000
 R750_PROCESS_FUT_HW                         ,              SOC RB01305 01660000
 R751_INIT_FUT                               ,                          01670000
 R752_GET_FUT_RUN_DATE                       ,                          01680000
 R753_READ_FUT_REC                           ,                          01690000
 R754_PROCESS_PI_HW_FUT                      ,                          01700000
 R755_PROD_REVENUE_DIV_FUT                   ,                          01710000
 R756_PROCESS_REGULAR_HW_FUT                 ,                          01720000
 R757_SERV_CTR_PERIOD_FUT                    ,                          01730000
 R758_RETRIEVE_TOM_INT_CONTRACT_FUT          ,                          01740000
 R759_GET_TYPE_OF_CONTRACT_FUT               ,                          01750000
 R760_FILL_SERV_CTR_PERIOD_FUT               ,                          01760000
 R761_FILL_SUPPL_CTR_PERIOD_FUT              ,                          01770000
 R762_APPLY_PI_BAU_PRIORITY_FUT              ,                          01780000
 R763_UPDATE_RCBDTB1_FUT_REC                 ,                          01790000
 R764_PI_PERCALL_FUT                         ,                          01800000
 R765_FETCH_PI_FUT_CTR_FUT                   ,                          01810000
 R766_PERCALL_CALC_FUT                       ,              EOC RB01305 01820000
 R767_RETRIEVE_PI_REAL_SER                   ,              CEDS0000062401830000
 R768_RETRIEVE_BAU_REAL_SER                  ,              CEDS0000062401840000
 R769_UPDATE_USER_PI_FUT_REC                 ,              CEDS0000081401841062
 R770_UPDATE_USER_BAU_FUT_REC                ,              CEDS0000081401842062
 R799_END_COUNTRY                            ,                          01850000
 R800_INIT_PROCESSING                        ,                          01860000
 R899_END_PROCESSING                         ,                          01870000
 R900_INIT_PROGRAM                           ,                          01880000
 R999_END_PROGRAM                            ,                          01890000
 RCBDTBM_ERROR                                                          01900000
 )): */                                                                 01910000
1RCBDTBM: PROC                                                          01920000
          OPTIONS (MAIN)                                                01930000
          REORDER;                                                      01940000
 DEFAULT RANGE (*)        STATIC;                                       01950000
1/********************************************************************/ 01960000
 /*  PARAMETERS                                                      */ 01970000
 /********************************************************************/ 01980000
 DCL PTR_INT_AREA        PTR;          /* INTERFACE AREA             */ 01990000
 DCL PTR_RETURN_AREA_BB  PTR;          /* RETURN AREA FROM BB        */ 02000000
 DCL PTR_COUNTRY_AREA    PTR;          /* INTERFACE RCB019M          */ 02010000
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 02020000
                                                                        02030000
 DCL 1 PARM_INT_AREA,                         /* INTERFACE AREA      */ 02040000
       %INCLUDE (RCBZ01S);;                                             02050000
 DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 02060000
       %INCLUDE (RCBZ02S);;                                             02070000
 DCL 1 PARM_DATE_CALC,                        /* DATE CALCULATION    */ 02080000
       %INCLUDE (RCBZ03S);;                                             02090000
 DCL 1 COUNTRY_AREA,                          /* COUNTRY AREA        */ 02100000
       %INCLUDE (RCBZ26S);;                                             02110000
 DCL 1 RUN_DATE_AREA,                         /* RUN DATE AREA       */ 02120000
       %INCLUDE (RCBZ28S);;                                             02130000
 DCL 1 PARM_RCB005,                            /* BMT EXTR PARM      */ 02140000
      %INCLUDE (RCBP05S);;                                              02150000
 DCL 1 PARM_RCB024,                            /* HASH_TOTAL PARM    */ 02160000
      %INCLUDE (RCBP24S);;                                              02170000
                                                      /* SOC RB01281 */ 02180000
0DCL 1 PARM_RCBP63,                   /* FLEXIBLE WARRANTY GEO LEVEL */ 02190000
      %INCLUDE (RCBP63S);;                                              02200000
                                                                        02210000
0DCL 1 PARM_RCBP64,                   /* FLEXIBLE WARRANTY CTRY LEVL */ 02220000
      %INCLUDE (RCBP64S);;                                              02230000
                                                      /* EOC RB01281 */ 02240000
                                                      /* SOC RC01234 */ 02250000
 DCL 1 PARM_RCB067,                           /* TPMNT TO MA_STATUS  */ 02260000
       %INCLUDE (RCBP67S);;                                             02270000
                                                      /* EOC RC01234 */ 02280000
 DCL 1 PARM_RCB024M,                           /* RCB024M PARM       */ 02290000
      %INCLUDE (RCBZ33S);;                                              02300000
                                                      /* SOC RB01278 */ 02310000
0DCL 1 PARM_RCBP103S,                 /* SERVICE ON BEHALF OF VENDOR */ 02320000
      %INCLUDE (RCBP103S);;                                             02330000
                                                      /* EOC RB01278 */ 02340000
 DCL 1 PARM_RCBP70S,      /* TPMNT FOR INTERNAL MACHINES SOC RB01290 */ 02350000
      %INCLUDE (RCBP70S);;                            /* EOC RB01290 */ 02360000
                                                                        02370000
 DCL 1 PARM_RCBP71S,                                      /* RB01298 */ 02380000
      %INCLUDE (RCBP71S);;                                /* RB01298 */ 02390000
                                                                        02400000
 DCL 1 PARM_RCBP156,                                   /*SOC RC01352 */ 02410000
      %INCLUDE (RCBP156S);;                            /*EOC RC01352 */ 02420000
1/********************************************************************/ 02430000
 /* EXTERNAL ENTRIES                                                 */ 02440000
 /********************************************************************/ 02450000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 02460000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 02470000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 02480000
 DCL RCB004M   ENTRY  EXTERNAL;          /* DATE CALC ROUTINE        */ 02490000
 DCL RCB018M   ENTRY  EXTERNAL;          /* UPDATE HASH TOTAL        */ 02500000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 02510000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 02520000
 DCL RCBDT1U   ENTRY  EXTERNAL;          /* USER EXIT                */ 02530000
 DCL RCBISRM   ENTRY  EXTERNAL;          /* RETRIEVE ROW FROM T470/5 */ 02540000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 02550000
 DCL RCBF50M   ENTRY  EXTERNAL;          /* INSERT PARAMETER         */ 02560000
 DCL RCBG50M   ENTRY  EXTERNAL;          /* UPDATE PARAMETER         */ 02570000
 DCL RCBIBOM   ENTRY  EXTERNAL;          /* RETRIEVE ROW FROM T640/5 */ 02580000
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 02590000
1/********************************************************************/ 02600000
 /*  FILE DECLARATIONS                                               */ 02610000
 /********************************************************************/ 02620000
 DCL RCBDTB1        FILE                         /* EXTRACT (CEDS) */   02630000
                    RECORD                                              02640000
                    OUTPUT                                              02650000
                    SEQUENTIAL                   /* RA01239 */          02660000
                                                      /* SOC RB01305 */ 02670000
 /*                 ENV (FB RECSIZE(318));  /* RB01283 */ /* RC01234 */ 02680000
                                                      /* SOC RB01320 */ 02690000
 /*                 ENV (FB RECSIZE(331));*/          /* EOC RB01305 */ 02700000
                    ENV (FB RECSIZE(361));                              02710000
                                                      /* EOC RB01320 */ 02720000
1/********************************************************************/ 02730000
 /* DB2 TABLE STRUCTURES                                             */ 02740000
 /********************************************************************/ 02750000
 DCL 1 TB_RCBV030,                                                      02760000
      %INCLUDE (RCB030S);;                                              02770000
                                                                        02780000
 DCL 1 TB_RCBV110,                                                      02790000
      %INCLUDE (RCB110S);;                                              02800000
                                                                        02810000
 DCL 1 TB_RCBV240,                                                      02820000
      %INCLUDE (RCB240S);;                                              02830000
 DCL 1 TB_RCBV240_I,                                                    02840000
       3 WRK_V240_IND01              FIXED BIN(15),                     02850000
       3 WRK_V240_IND02              FIXED BIN(15),                     02860000
       3 WRK_V240_IND03              FIXED BIN(15),                     02870000
       3 WRK_V240_IND04              FIXED BIN(15),                     02880000
       3 WRK_V240_IND05              FIXED BIN(15),                     02890000
       3 WRK_V240_IND06              FIXED BIN(15),                     02900000
       3 WRK_V240_IND07              FIXED BIN(15),                     02910000
       3 WRK_V240_IND08              FIXED BIN(15),                     02920000
       3 WRK_V240_IND09              FIXED BIN(15),                     02930000
       3 WRK_V240_IND10              FIXED BIN(15),                     02940000
       3 WRK_V240_IND11              FIXED BIN(15),                     02950000
       3 WRK_V240_IND12              FIXED BIN(15),                     02960000
       3 WRK_V240_IND13              FIXED BIN(15),                     02970000
       3 WRK_V240_IND14              FIXED BIN(15),                     02980000
       3 WRK_V240_IND15              FIXED BIN(15),                     02990000
       3 WRK_V240_IND16              FIXED BIN(15),                     03000000
       3 WRK_V240_IND17              FIXED BIN(15),                     03010000
       3 WRK_V240_IND18              FIXED BIN(15),                     03020000
       3 WRK_V240_IND19              FIXED BIN(15),                     03030000
       3 WRK_V240_IND20              FIXED BIN(15),                     03040000
       3 WRK_V240_IND21              FIXED BIN(15),                     03050000
       3 WRK_V240_IND22              FIXED BIN(15),                     03060000
       3 WRK_V240_IND23              FIXED BIN(15),                     03070000
       3 WRK_V240_IND24              FIXED BIN(15),                     03080000
       3 WRK_V240_IND25              FIXED BIN(15),                     03090000
       3 WRK_V240_IND26              FIXED BIN(15),                     03100000
       3 WRK_V240_IND27              FIXED BIN(15),                     03110000
       3 WRK_V240_IND28              FIXED BIN(15),                     03120000
       3 WRK_V240_IND29              FIXED BIN(15),                     03130000
       3 WRK_V240_IND30              FIXED BIN(15),                     03140000
       3 WRK_V240_IND31              FIXED BIN(15),                     03150000
       3 WRK_V240_IND32              FIXED BIN(15),                     03160000
       3 WRK_V240_IND33              FIXED BIN(15),                     03170000
       3 WRK_V240_IND34              FIXED BIN(15),                     03180000
       3 WRK_V240_IND35              FIXED BIN(15),                     03190000
       3 WRK_V240_IND36              FIXED BIN(15),                     03200000
       3 WRK_V240_IND37              FIXED BIN(15),                     03210000
       3 WRK_V240_IND38              FIXED BIN(15);                     03220000
                                                                        03230000
 DCL 1 TB_240_FUT,                                    /* SOC RB01305 */ 03240000
       5 CONTRACT_NUMBER             CHAR(15),                          03250000
       5 SERVICE_START_DATE          CHAR(10),                          03260000
       5 SERVICE_STOP_DATE           CHAR(10),                          03270000
       5 EFFECTIVE_DATE              CHAR(10),                          03280000
       5 END_DATE                    CHAR(10);                          03290000
                                                                        03300000
 DCL 1 TB_240_FUT_I,                                                    03310000
       5 INDNULL(05)                 FIXED BIN(15);                     03320000
                                                      /* EOC RB01305 */ 03330000
 DCL 1 TB_RCBV300,                                                      03340000
      %INCLUDE (RCB300S);;                                              03350000
                                                       /* SOC RC01234 */03360000
 DCL 1 TB_RCBV380,                                                      03370000
      %INCLUDE (RCB380S);;                                              03380000
                                                       /* EOC RC01234 */03390000
                                                       /* SOC RC01362 */03391000
 /*DCL 1 TB_RCBV400,                                 /* SOC : RB01278 */03400000
 /*   %INCLUDE (RCB400S);;                                              03410000
 DCL 1 TB_RCBV400_I,                                                    03420000
      %INCLUDE (RCB400SI);;                          /* EOC : RB01278 */03430000
                                                       /* EOC RC01362 */03431000
 DCL 1 TB_RCBV470,                                                      03440000
      %INCLUDE (RCB470S);;                                              03450000
 DCL 1 TB_RCBV470_I,                                                    03460000
      %INCLUDE (RCB470SI);;                                             03470000
                                                                        03480000
 DCL 1 SAVE_RCBV470     LIKE TB_RCBV470;                                03490000
 DCL 1 SAVE_RCBV470_I   LIKE TB_RCBV470_I;                              03500000
 DCL 1 SAVE_RCBV470_1   LIKE TB_RCBV470;                                03510000
 DCL 1 SAVE_RCBV470_I_1 LIKE TB_RCBV470_I;                              03520000
 DCL 1 SAVE_RCBV470_2   LIKE TB_RCBV470;                                03530000
 DCL 1 SAVE_RCBV470_I_2 LIKE TB_RCBV470_I;                              03540000
                                                                        03550000
                                                      /*SOC RC01313 */  03560000
 /*  DCL 1 TB_RCBV350,                                /*SOC RC01311 */  03570000
 /*     %INCLUDE (RCB350S);;                          /*EOC RC01311 */  03580000
                                                      /*EOC RC01313 */  03590000
 DCL 1 TB_RCBV500,                                                      03600000
      %INCLUDE (RCB500S);;                                              03610000
 DCL 1 TB_RCBV500_I,                                                    03620000
      %INCLUDE (RCB500SI);;                                             03630000
 DCL 1 TB_RCBP05S            BASED (ADDR(TB_RCBV500)),                  03640000
      %INCLUDE (RCBP05S);;                                              03650000
 DCL 1 TB_RCBP24S            BASED (ADDR(TB_RCBV500)),                  03660000
      %INCLUDE (RCBP24S);;                                              03670000
                                                      /* SOC RB01281 */ 03680000
0DCL 1 TB_RCBP63S            BASED (ADDR(TB_RCBV500)),                  03690000
      %INCLUDE (RCBP63S);;                                              03700000
0DCL 1 TB_RCBP64S            BASED (ADDR(TB_RCBV500)),                  03710000
      %INCLUDE (RCBP64S);;                                              03720000
                                                      /* EOC RB01281 */ 03730000
                                                      /* SOC RC01234 */ 03740000
 DCL 1 TB_RCBP67S            BASED (ADDR(TB_RCBV500)),                  03750000
      %INCLUDE (RCBP67S);;                                              03760000
                                                      /* EOC RC01234 */ 03770000
                                                      /* SOC RC01362 */ 03771000
 /*DCL 1 TB_RCBP103S           BASED (ADDR(TB_RCBV500)),/*   RB01278 */ 03780000
 /*   %INCLUDE (RCBP103S);;                             /*   RB01278 */ 03790000
                                                      /* EOC RC01362 */ 03791000
                                                      /* SOC RB01290 */ 03800000
 DCL 1 TB_RCBP70S            BASED (ADDR(TB_RCBV500)),                  03810000
      %INCLUDE (RCBP70S);;                            /* EOC RB01290 */ 03820000
 DCL 1 TB_RCBP156            BASED (ADDR(TB_RCBV500)),/* SOC RC01352 */ 03830000
      %INCLUDE (RCBP156S);;                           /* EOC RC01352 */ 03840000
                                                                        03850000
 DCL 1 TB_RCBV640,                                                      03860000
      %INCLUDE (RCB640S);;                                              03870000
 DCL 1 TB_RCBV640_I,                                                    03880000
      %INCLUDE (RCB640SI);;                                             03890000
                                                                        03900000
 DCL 1 TB_RCBV645,                                    /* SOC RC01279 */ 03910000
      %INCLUDE (RCB645S);;                                              03920000
 DCL 1 TB_RCBV645_I,                                                    03930000
      %INCLUDE (RCB645SI);;                           /* EOC RC01279 */ 03940000
                                                                        03950000
 DCL 1 TB_RCBP71S            BASED (ADDR(TB_RCBV500)),    /* RB01298 */ 03960000
      %INCLUDE (RCBP71S);;                                /* RB01298 */ 03970000
 DCL 1 TB_RCBP159S           BASED (ADDR(TB_RCBV500)),/* SOC RC01389 */ 03971000
      %INCLUDE (RCBP159S);;                           /* EOC RC01389 */ 03972000
                                                                        03980000
1/********************************************************************/ 03990000
 /* SELECT STRUCTURES                                                */ 04000000
 /********************************************************************/ 04010000
                                                                        04020000
 DCL 1 CURSOR_HW_PI,                                                    04030000
        %INCLUDE (RCB051S);;                                            04040000
 DCL 1 CURSOR_HW_PI_I,                                                  04050000
       3 WRK_V051_IND01              FIXED BIN(15),                     04060000
       3 WRK_V051_IND02              FIXED BIN(15),                     04070000
       3 WRK_V051_IND03              FIXED BIN(15),                     04080000
       3 WRK_V051_IND04              FIXED BIN(15),                     04090000
       3 WRK_V051_IND05              FIXED BIN(15),                     04100000
       3 WRK_V051_IND06              FIXED BIN(15),                     04110000
       3 WRK_V051_IND07              FIXED BIN(15),                     04120000
       3 WRK_V051_IND08              FIXED BIN(15),                     04130000
       3 WRK_V051_IND09              FIXED BIN(15),                     04140000
       3 WRK_V051_IND10              FIXED BIN(15),                     04150000
       3 WRK_V051_IND11              FIXED BIN(15),                     04160000
       3 WRK_V051_IND12              FIXED BIN(15),                     04170000
       3 WRK_V051_IND13              FIXED BIN(15),                     04180000
       3 WRK_V051_IND14              FIXED BIN(15),                     04190000
       3 WRK_V051_IND15              FIXED BIN(15),                     04200000
       3 WRK_V051_IND16              FIXED BIN(15),                     04210000
       3 WRK_V051_IND17              FIXED BIN(15),                     04220000
       3 WRK_V051_IND18              FIXED BIN(15),                     04230000
       3 WRK_V051_IND19              FIXED BIN(15),                     04240000
       3 WRK_V051_IND20              FIXED BIN(15),                     04250000
       3 WRK_V051_IND21              FIXED BIN(15),                     04260000
                                                       /* SOC RB01305 */04270000
 /*    3 WRK_V051_IND22              FIXED BIN(15);    */   /* RB01283*/04280000
       3 WRK_V051_IND22              FIXED BIN(15),         /* RB01283*/04290000
       3 WRK_V051_IND23              FIXED BIN(15);    /* EOC RB01305 */04300000
 DCL 1 CURSOR_INST_HW_V190,                                             04310000
      %INCLUDE (RCB190S);;                                              04320000
 DCL 1 CURSOR_INST_HW_V170,                                             04330000
      %INCLUDE (RCB170S);;                                              04340000
 DCL 1 CURSOR_INST_HW_V220,                                             04350000
      %INCLUDE (RCB220S);;                                              04360000
 DCL 1 CURSOR_CTR_PI,                                                   04370000
      %INCLUDE (RCB241S);;                                              04380000
 DCL 1 CURSOR_CTR_PI_I,                                                 04390000
       3 WRK_V241_IND01              FIXED BIN(15),                     04400000
       3 WRK_V241_IND02              FIXED BIN(15),                     04410000
       3 WRK_V241_IND03              FIXED BIN(15),                     04420000
       3 WRK_V241_IND04              FIXED BIN(15),                     04430000
       3 WRK_V241_IND05              FIXED BIN(15),                     04440000
       3 WRK_V241_IND06              FIXED BIN(15),                     04450000
       3 WRK_V241_IND07              FIXED BIN(15),                     04460000
       3 WRK_V241_IND08              FIXED BIN(15),                     04470000
       3 WRK_V241_IND09              FIXED BIN(15),                     04480000
       3 WRK_V241_IND10              FIXED BIN(15),                     04490000
       3 WRK_V241_IND11              FIXED BIN(15),                     04500000
       3 WRK_V241_IND12              FIXED BIN(15),                     04510000
       3 WRK_V241_IND13              FIXED BIN(15),                     04520000
       3 WRK_V241_IND14              FIXED BIN(15),                     04530000
       3 WRK_V241_IND15              FIXED BIN(15),                     04540000
       3 WRK_V241_IND16              FIXED BIN(15),                     04550000
       3 WRK_V241_IND17              FIXED BIN(15),                     04560000
       3 WRK_V241_IND18              FIXED BIN(15),                     04570000
       3 WRK_V241_IND19              FIXED BIN(15),                     04580000
       3 WRK_V241_IND20              FIXED BIN(15),                     04590000
       3 WRK_V241_IND21              FIXED BIN(15),                     04600000
       3 WRK_V241_IND22              FIXED BIN(15),                     04610000
       3 WRK_V241_IND23              FIXED BIN(15),                     04620000
       3 WRK_V241_IND24              FIXED BIN(15),                     04630000
       3 WRK_V241_IND25              FIXED BIN(15),                     04640000
       3 WRK_V241_IND26              FIXED BIN(15),                     04650000
       3 WRK_V241_IND27              FIXED BIN(15),                     04660000
       3 WRK_V241_IND28              FIXED BIN(15),                     04670000
       3 WRK_V241_IND29              FIXED BIN(15),                     04680000
       3 WRK_V241_IND30              FIXED BIN(15),                     04690000
       3 WRK_V241_IND31              FIXED BIN(15),                     04700000
       3 WRK_V241_IND32              FIXED BIN(15),                     04710000
       3 WRK_V241_IND33              FIXED BIN(15),                     04720000
       3 WRK_V241_IND34              FIXED BIN(15);  /* CEDS00000321 */ 04730000
                                                                        04740000
 DCL 1 HW_CTR_PI_FUT,                                 /* SOC RB01305 */ 04750000
        5 PRODUCT_TYPE             CHAR(04),                            04760000
        5 ORIGIN                   CHAR(02),                            04770000
        5 SEQUENCE_NUMBER          CHAR(28),                            04780000
        5 WRK_PI_ORIGIN_FUT        CHAR(04),                            04790000
        5 INSTALL_DATE             CHAR(10),                            04800000
        5 TYPE_OF_MAINT            CHAR(01),                            04810000
        5 TYPE_OF_WARRANTY         CHAR(01),                            04820000
        5 WARRANTY_SPLT_DATE       CHAR(10),                            04830000
        5 WARRANTY_EXP_DATE        CHAR(10),                            04840000
        5 F_TYPE_OF_WARRANTY       CHAR(01),                            04850000
        5 WARRANTY_LIABILITY       CHAR(03),                            04860000
        5 CONTRACT_NUMBER          CHAR(15),                            04870000
        5 AUTHORISATION_CODE       CHAR(10),                            04880000
        5 EFFECTIVE_DATE           CHAR(10),                            04890000
        5 END_DATE                 CHAR(10);                            04900000
                                                                        04910000
 DCL 1 HW_CTR_PI_FUT_I,                                                 04920000
        5 INDNULL(15)              FIXED BIN(15);                       04930000
                                                                        04940000
 DCL 1 INST_HW_BAU_FUT,                                                 04950000
        5 PRODUCT_TYPE             CHAR(04),                            04960000
        5 ORIGIN                   CHAR(02),                            04970000
        5 SEQUENCE_NUMBER          CHAR(28),                            04980000
        5 TYPE_OF_MAINT            CHAR(01),                            04990000
        5 TYPE_OF_WARRANTY         CHAR(01),                            05000000
        5 WARRANTY_EXP_DATE        CHAR(10),                            05010000
        5 SOURCE_INDICATOR         CHAR(01),                            05020000
        5 EFFECTIVE_DATE           CHAR(10),                            05030000
        5 END_DATE                 CHAR(10),                            05040000
        5 F_TYPE_OF_WARRANTY       CHAR(01),                            05050000
        5 F_SPLT_DATE              CHAR(10);                            05060000
                                                                        05070000
 DCL 1 INST_HW_BAU_FUT_I,                                               05080000
        5 INDNULL(11)              FIXED BIN(15);                       05090000
                                                                        05100000
 DCL 1 FUTURE_PI,                                                       05110000
        3 COUNTRY_NUMBER           CHAR(03),                            05120000
        3 PRODUCT_TYPE             CHAR(04),                            05130000
        3 ORIGIN                   CHAR(02),                            05140000
        3 SEQUENCE_NUMBER          CHAR(07),                            05150000
        3 TYPE_OF_WARRANTY         CHAR(01),                            05160000
        3 TYPE_OF_MAINT            CHAR(01),                            05170000
        3 CONTRACT_NUMBER          CHAR(15),                            05180000
        3 SERVICE_START_DATE       CHAR(10),                            05190000
        3 SERVICE_END_DATE         CHAR(10),                            05200000
        3 MA_STATUS                CHAR(01),                            05210000
        3 SERIAL_LNG               CHAR(30),               /* RB01320 */05220000
        3 LIABILITY                CHAR(03);                            05230000
                                                                        05240000
 DCL 1 FUTURE_BAU                  LIKE FUTURE_PI;                      05250000
 DCL 1 FUTURE_PI_BAU               LIKE FUTURE_PI;                      05260000
 DCL 1 FUTURE_PI_BAU_SLOT1         LIKE FUTURE_PI;                      05270000
 DCL 1 FUTURE_PI_BAU_SLOT2         LIKE FUTURE_PI;                      05280000
                                                      /* EOC RB01305 */ 05290000
                                                                        05300000
 DCL 1 WRK_OU_CODE_V170            CHAR (07);         /* SOC RC01311 */ 05310000
 DCL 1 WRK_OU_CODE_V170_IND        FIXED BIN(15);     /* EOC RC01311 */ 05320000
                                                      /* SOC RB01320 */ 05330000
 DCL 1 WRK_PI_REAL_SERIAL_NO_V125     CHAR(30);                         05340000
 DCL 1 WRK_PI_REAL_SERIAL_NO_V125_IND FIXED BIN(15);                    05350000
 DCL 1 WRK_BAU_REAL_SERIAL_NO_V125     CHAR(30);                        05360000
 DCL 1 WRK_BAU_REAL_SERIAL_NO_V125_IND FIXED BIN(15);                   05370000
 DCL 1 WRK_ORIGIN        CHAR(2)  INIT (' ');                           05380000
 DCL 1 WRK_SEQ_NO        CHAR(28) INIT (' ');                           05390000
 DCL 1 TB_RCBV125,                                                      05400000
      % INCLUDE (RCB125S);;                           /* EOC RB01320 */ 05410000
 DCL 1 WRK_SOURCE        CHAR(04) INIT (' ');        /* CEDS00000624 */ 05420000
 /********************************************************************/ 05430000
 /*  RECORD STRUCTURES                                               */ 05440000
 /********************************************************************/ 05450000
                                                     /* SOC RB01305  */ 05460000
 /* DCL IO_AREA_RCBDTB1        CHAR(318);                 /* RB01283 */ 05470000
                                                      /* SOC RB01320  */05480000
 /*DCL IO_AREA_RCBDTB1        CHAR(331);*/            /* EOC RB01305  */05490000
 DCL IO_AREA_RCBDTB1        CHAR(361);                /* EOC RB01320  */05500000
                                                                        05510000
 DCL 1 FILE_RCBDTB1 BASED(ADDR(IO_AREA_RCBDTB1)),                       05520000
      %INCLUDE (RCBDTBS);;                                              05530000
                                                                        05540000
 DCL 1 USER_FILE_RCBDTB1 LIKE FILE_RCBDTB1;                             05550000
                                                                        05560000
 DCL 1 USER_FILE_PI      LIKE FILE_RCBDTB1;                             05570000
 DCL 1 USER_FILE_BAU     LIKE FILE_RCBDTB1;               /* RC01234 */ 05580000
                                                                        05590000
 DCL 1 FILE_RCBDTB1_H BASED(ADDR(IO_AREA_RCBDTB1)),                     05600000
      %INCLUDE (RCBD01S);;                                              05610000
                                                                        05620000
 /********************************************************************/ 05630000
 /*  BIT SWITCHES                                                    */ 05640000
 /********************************************************************/ 05650000
 DCL 1 SWITCHES,                                                        05660000
     3 TRUE                          BIT (1)           INIT ('1'B),     05670000
     3 FALSE                         BIT (1)           INIT ('0'B),     05680000
     3 SWITCH_BAU                    BIT (1)           INIT ('0'B),     05690000
     3 SWITCH_PI                     BIT (1)           INIT ('0'B),     05700000
     3 SW_WARRANTY                   BIT (1)           INIT ('0'B),     05710000
     3 SW_MAINT_02                   BIT (1)           INIT ('0'B),     05720000
     3 SWITCH_EOC_PI_HW              BIT (1)           INIT ('0'B),     05730000
     3 DATES_SWAPPED                 BIT (1)           INIT ('0'B),     05740000
     3 SW_SDF_FOUND                  BIT (1)           INIT ('0'B),     05750000
     3 SW_SLC_FOUND                  BIT (1)           INIT ('0'B),     05760000
     3 SW_SAVE_1_FOUND               BIT (1)           INIT ('0'B),     05770000
     3 SW_SAVE_2_FOUND               BIT (1)           INIT ('0'B),     05780000
     3 SW_SOURCE_IND_FOUND           BIT (1)           INIT ('0'B),     05790000
     3 SWITCH_EOC_OO_HW              BIT (1)           INIT ('0'B),     05800000
     3 SWITCH_EOC_INST_HW            BIT (1)           INIT ('0'B),     05810000
     3 SWITCH_EOC_SERV_CTR           BIT (1)           INIT ('0'B),     05820000
                                                      /* SOC RC01362 */ 05821000
  /* 3 SWITCH_VENDOR_SERVICE         BIT (1)           INIT ('0'B),  */ 05830000
                                                      /* EOC RC01362 */ 05831000
                                                      /* SOC RB01298 */ 05840000
     3 SW_BRAND_BAU                  BIT (1)           INIT ('0'B),     05850000
     3 SW_FW_BAU                     BIT (1)           INIT ('0'B),     05860000
     3 SW_HB_BAU                     BIT (1)           INIT ('0'B),     05870000
     3 SW_FW_PI                      BIT (1)           INIT ('0'B),     05880000
     3 SW_HB_PI                      BIT (1)           INIT ('0'B),     05890000
     3 SW_FW_HB_MS                   BIT (1)           INIT ('0'B),     05900000
                                                      /* SOC RB01305 */ 05910000
 /*  3 SW_FW_BAU_FUT                 BIT (1)           INIT ('0'B),     05920000
 /*  3 SW_HB_BAU_FUT                 BIT (1)           INIT ('0'B),     05930000
                                                      /* EOC RB01305 */ 05940000
     3 SW_BRAND_PI                   BIT (1)           INIT ('0'B),     05950000
     3 SW_WARR_PI                    BIT (1)           INIT ('0'B),     05960000
     3 SW_MAINT_PI                   BIT (1)           INIT ('0'B),     05970000
                                                     /* SOC RB01305 */  05980000
     3 SWITCH_RETAIN_PERCALL         BIT (1)           INIT ('0'B),     05990000
     3 SW_PROCESS_PERCALL            BIT (1)           INIT ('0'B),     06000000
     3 SWITCH_RETAIN_PERCALL_FUT     BIT (1)           INIT ('0'B),     06010000
     3 SW_PROCESS_PERCALL_FUT        BIT (1)           INIT ('0'B),     06020000
                                                     /* EOC RB01305 */  06030000
 /*  3 F_WARRANTY_MA_STATUS      BIT (1)   INIT ('0'B),  /* RB01281 */  06040000
 /*  3 F_WARRANTY_MA_STATUS_GEO  BIT (1)   INIT ('0'B),  /* RB01281 */  06050000
 /*  3 FLEXIBLE_WARRANTY_BAU     BIT (1)   INIT ('0'B),  /* RB01281 */  06060000
 /*  3 FLEXIBLE_WARRANTY_PI      BIT (1)   INIT ('0'B),  /* RB01281 */  06070000
                                                      /* EOC RB01298 */ 06080000
                                                      /* SOC RB01290 */ 06090000
     3 SWITCH_TOM_INTERNAL_MACHINE     BIT (1) INIT ('0'B),             06100000
  /* 3 SWITCH_TOM_INTERNAL_MACHINE_FUT BIT (1) INIT ('0'B),  /*RB01305*/06110000
     3 SWITCH_INTERNAL_MACHINE_CTR     BIT (1) INIT ('0'B),             06120000
                                                      /* SOC RB01305 */ 06130000
  /* 3 SWITCH_INTERNAL_MACHINE_CTR_FUT BIT (1) INIT ('0'B), */          06140000
  /* 3 SWITCH_FUTURE_FLAG              BIT (1) INIT ('0'B), */          06150000
                                                      /* EOC RB01305 */ 06160000
                                                      /* EOC RB01290 */ 06170000
                                                      /* SOC RB01305 */ 06180000
     3 SW_SPLTWAR_PI                 BIT (1)           INIT ('0'B),     06190000
     3 WRK_SW_FW_BAU                 BIT (1)           INIT ('0'B),     06200000
     3 WRK_SW_HB_BAU                 BIT (1)           INIT ('0'B),     06210000
     3 WRK_SW_FW_PI                  BIT (1)           INIT ('0'B),     06220000
     3 WRK_SW_HB_PI                  BIT (1)           INIT ('0'B),     06230000
     3 SWITCH_INTERNAL               BIT (1)           INIT ('0'B),     06240000
     3 SWITCH_LEASE_RENTAL           BIT (1)           INIT ('0'B),     06250000
     3 SW_POSTWARR_PI                BIT (1)           INIT ('0'B),     06260000
     3 SW_POSTWARR_BAU               BIT (1)           INIT ('0'B),     06270000
     3 SWITCH_WRITE_RCBDTB1          BIT (1)           INIT ('0'B),     06280000
     3 SWITCH_VALID_FUT_RUN_DATE     BIT (1)           INIT ('0'B),     06290000
     3 SWITCH_FUT_REC                BIT (1)           INIT ('0'B),     06300000
     3 SWITCH_BAU_FUT                BIT (1)           INIT ('0'B),     06310000
     3 SWITCH_PI_FUT                 BIT (1)           INIT ('0'B),     06320000
     3 SW_WARRANTY_FUT               BIT (1)           INIT ('0'B),     06330000
     3 SW_MAINT_02_FUT               BIT (1)           INIT ('0'B),     06340000
     3 SW_WARR_PI_FUT                BIT (1)           INIT ('0'B),     06350000
     3 SW_MAINT_PI_FUT               BIT (1)           INIT ('0'B),     06360000
     3 SW_BRAND_BAU_FUT              BIT (1)           INIT ('0'B),     06370000
     3 SWITCH_FW_BAU_FUT             BIT (1)           INIT ('0'B),     06380000
     3 SWITCH_HB_BAU_FUT             BIT (1)           INIT ('0'B),     06390000
     3 SW_BRAND_PI_FUT               BIT (1)           INIT ('0'B),     06400000
     3 SW_FW_PI_FUT                  BIT (1)           INIT ('0'B),     06410000
     3 SW_HB_PI_FUT                  BIT (1)           INIT ('0'B),     06420000
     3 SW_SPLTWAR_PI_FUT             BIT (1)           INIT ('0'B),     06430000
     3 SW_TOM_INTERNAL_MACHINE_FUT   BIT (1)           INIT ('0'B),     06440000
     3 SW_INTERNAL_MACHINE_CTR_FUT   BIT (1)           INIT ('0'B),     06450000
     3 SW_INTERNAL_FUT               BIT (1)           INIT ('0'B),     06460000
     3 SW_LEASE_RENTAL_FUT           BIT (1)           INIT ('0'B),     06470000
     3 SWITCH_SERV_CTR_FUT           BIT (1)           INIT ('0'B);     06480000
                                                      /* EOC RB01305 */ 06490000
 DCL   SWITCH_RCB156_EMEA           BIT (1) INIT ('0'B);  /* RC01352 */ 06500000
 DCL   SWITCH_USER_EXIT              BIT (1)           INIT ('1'B);     06510000
                                                 /* SOC  CEDS00000624 */06520000
 DCL   SWITCH_BAU_ONLY               BIT (1)           INIT ('0'B);     06530000
 DCL   SWITCH_PI_ONLY                BIT (1)           INIT ('0'B);     06540000
 DCL   SWITCH_BAU_PI                 BIT (1)           INIT ('0'B);     06550000
                                                 /* EOC  CEDS00000624 */06560000
                                                 /* SOC  CEDS00000814 */06560162
 DCL   SWITCH_PI_FUT1                BIT (1)           INIT ('0'B);     06561053
 DCL   SWITCH_BAU_FUT1               BIT (1)           INIT ('0'B);     06562053
 DCL   SWITCH_PI_BAU_FUT1            BIT (1)           INIT ('0'B);     06562154
                                                 /* EOC  CEDS00000814 */06563062
 DCL   DATA_ORIGIN                   CHAR(1)           INIT ('');       06570000
 DCL 1 USER_EXTRA_INFO,                                                 06580000
       3 SERVICE_START_DATE          CHAR(10),                          06590000
       3 SERVICE_STOP_DATE            CHAR(10);                         06600000
 /********************************************************************/ 06610000
 /*  SORT FIELDS                                                     */ 06620000
 /********************************************************************/ 06630000
 DCL 1 SORT_FIELDS,                                                     06640000
    3 RETURN_CODE    FIXED BIN (31),                                    06650000
    3 MAX_STORAGE    FIXED BIN (31);                                    06660000
 /********************************************************************/ 06670000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 06680000
 /********************************************************************/ 06690000
 DCL 1 WORK_FIELDS,                                                     06700000
    3 WRK_MOD_NAME                      CHAR (08)  INIT ('RCBDTBM'),    06710000
    3 WRK_PRG_NAME                      CHAR (08)  INIT ('RCBDTBP'),    06720000
    3 WRK_FILE_NAME                     CHAR (07)  INIT ('RCBDTB1'),    06730000
    3 WRK_SYSTEM_TYPE                   CHAR (01)  INIT ('B'),          06740000
    3 WRK_PROC_ID                       CHAR (04),                      06750000
    3 WRK_PI_ORIGIN                     CHAR (04),                      06760000
    3 WRK_PI_ORIGIN_TEMP                CHAR (04),        /* RB01289 */ 06770000
    3 WRK_CTRYNO                        CHAR (03),                      06780000
    3 WRK_PGR_TYPE                      CHAR (03),                      06790000
    3 WRK_RUN_DATE                      CHAR (10),                      06800000
    3 WRK_DATE                          CHAR (10),                      06810000
    3 WRK_TIME_STAMP                    CHAR (20),                      06820000
    3 WRK_INDNULL                       FIXED BIN(15),                  06830000
    3 WRK_PRODUCT_TYPE                  CHAR (04),       /* RB01278 */  06840000
    3 WRK_SERVICE_TYPE_IND              FIXED BIN(15),                  06850000
    3 WRK_SERVICE_LVL_CODE              CHAR (03),                      06860000
    3 WRK_SLC_V220_IND                  FIXED BIN(15),                  06870000
    3 WRK_SLC_2_V220_IND                FIXED BIN(15),    /* RB01298 */ 06880000
    3 WRK_CUSTOMER_NUMBER_V10           CHAR (08),      /*SOC RB01289 */06890000
    3 WRK_CUSTNO_V10_IND                FIXED BIN(15),                  06900000
    3 WRK_CUSTOMER_NUMBER_V11           CHAR (08),                      06910000
    3 WRK_CUSTNO_V11_IND                FIXED BIN(15),                  06920000
    3 WRK_CUSTOMER_NUMBER_V190          CHAR (08),                      06930000
    3 WRK_CUSTNO_V190_IND               FIXED BIN(15),  /*EOC RB01289 */06940000
    3 WRK_CTRYNO_NO                     FIXED BIN(15) INIT(1),          06950000
    3 WRK_CNT_RCBDTB1                   FIXED BIN(31) INIT(0),          06960000
    3 WRK_PI_CNT                        FIXED BIN(15),                  06970000
    3 WRK_CNT_COUNTRY                   FIXED BIN(31) INIT(0),          06980000
    3 WRK_PERIOD_HVP_QUANTITY           FIXED DEC(5,0),                 06990000
    3 WRK_HASH_TOTAL                    FIXED DEC(15) INIT(0),          07000000
    3 WRK_PIC_10                        PIC 'Z,ZZZ,ZZZ,ZZ9',            07010000
    3 WRK_TPMNT_VAL,                                                    07020000
      %INCLUDE (RCBZ99S);;                                              07030000
                                                                        07040000
 DCL 1 WRK_SAVE,                                                        07050000
      5 PRODUCT_TYPE                    CHAR(04),                       07060000
      5 ORIGIN                          CHAR(02),                       07070000
      5 SEQUENCE_NUMBER                 CHAR(07);                       07080000
                                                       /* SOC RB01305 */07090000
 DCL 1  WRK_WARR_EXP_DATE               CHAR (10);                      07100000
 DCL 1  WRK_PERCALL_ENDDATE             CHAR (10);                      07110000
 DCL 1  WRK_PERCALL_ENDDATE_FUT         CHAR (10);                      07120000
 DCL 1  WRK_RETAIN_DATE                 CHAR (10);                      07130000
 DCL 1  WRK_RETAIN_DATE_FUT             CHAR (10);                      07140000
 DCL 1  WRK_MIN_EFF_A                   CHAR (10);                      07150000
 DCL 1  WRK_PRECEDENCE_PI               CHAR (1)  INIT ('');            07160000
 DCL 1  WRK_PRECEDENCE_PI_FUT           CHAR (1)  INIT ('');            07170000
 DCL 1  WRK_PRECEDENCE_BAU              CHAR (1)  INIT ('');            07180000
 DCL 1  WRK_PRECEDENCE_BAU_FUT          CHAR (1)  INIT ('');            07190000
 DCL 1  WRK_PRECEDENCE_CURRENT          CHAR (1)  INIT ('');            07200000
 DCL 1  WRK_PRECEDENCE_FUTURE           CHAR (1)  INIT ('');            07210000
 DCL 1  WRK_PI_HW_SLC                   CHAR (03) INIT ('');            07220000
 DCL 1  WRK_PI_CTR_START_DATE           CHAR (10) INIT ('');            07230000
 DCL 1  WRK_PI_CTR_START_DATE_FUT       CHAR (10) INIT ('');            07240000
 DCL 1  WRK_PI_CTR_END_DATE             CHAR (10) INIT ('');            07250000
 DCL 1  WRK_PI_CTR_END_DATE_FUT         CHAR (10) INIT ('');            07260000
 DCL 1  WRK_PI_HW_START_DATE            CHAR (10) INIT ('');            07270000
 DCL 1  WRK_PI_HW_START_DATE_FUT        CHAR (10) INIT ('');            07280000
 DCL 1  WRK_PI_HW_END_DATE              CHAR (10) INIT ('');            07290000
 DCL 1  WRK_PI_HW_END_DATE_FUT          CHAR (10) INIT ('');            07300000
 DCL 1  WRK_TOM_BAU                     CHAR (01) INIT ('');            07310000
 DCL 1  WRK_RETENTION                   FIXED DEC(4,0);    /* RC01389 */07311000
                                                       /* EOC RB01305 */07320000
                                                       /* SOC RA01239 */07330000
                                                       /* SOC RB01305 */07340000
 /* DCL 1  WRK_EFFECTIVE_DATE_FUT          CHAR (10);                   07350000
 /* DCL 1  WRK_TYPE_MAINT_FUT              CHAR (01);                   07360000
 /* DCL 1  WRK_MA_STATUS_FUT               CHAR (04);                   07370000
 /* DCL 1  WRK_END_DATE_FUT                CHAR (10);                   07380000
 /* DCL 1  WRK_CONTRACT_NUMBER_FUT         CHAR (15);                   07390000
 /* DCL 1  WRK_EFF_DATE_FUT_INDNULL        FIXED BIN(15);               07400000
                                                       /* EOC RB01305 */07410000
 DCL 1  WRK_TYPE_OF_CONTRACT            CHAR (10);                      07420000
 DCL 1  WRK_DP_SYSTEM_NUMBER            CHAR (05);                      07430000
                                                       /* EOC RA01239 */07440000
                                                       /* SOC RB01305 */07450000
 /*DCL 1  WRK_TYPE_WARRANTY_FUT           CHAR (01);   /* SOC PTM1409 */07460000
 /*DCL 1  WRK_WARRANTY_FUT_INDNULL        FIXED BIN(15);                07470000
 /*DCL 1  WRK_MAINT_FUT_INDNULL           FIXED BIN(15);                07480000
                                                       /* EOC RB01305 */07490000
                                                      /* EOC PTM1409 */ 07500000
 DCL 1 SK_CURRENT_HW,                                                   07510000
      5 EOF                             CHAR(01),                       07520000
      5 PRODUCT_TYPE                    CHAR(04),                       07530000
      5 ORIGIN                          CHAR(02),                       07540000
      5 SEQUENCE_NUMBER                 CHAR(28),         /* RB01242 */ 07550000
      5 EFFECTIVE_DATE                  CHAR(10),                       07560000
      5 END_DATE                        CHAR(10);                       07570000
                                                                        07580000
 DCL 1 SK_CURRENT_HW_1  BASED(ADDR(SK_CURRENT_HW))  CHAR(35);           07590000
                                                                        07600000
 DCL 1 SK_INST_HW       LIKE SK_CURRENT_HW;                             07610000
                                                                        07620000
 DCL 1 SK_PI_HW         LIKE SK_CURRENT_HW;                             07630000
 DCL 1 SK_PI_HW_1       BASED(ADDR(SK_PI_HW))  CHAR(35);  /* RB01242 */ 07640000
                                                      /* SOC RB01290 */ 07650000
                                                      /* SOC RB01305 */ 07660000
 /*DCL 1 WRK_SOURCE_IND_FUT                     CHAR(01);               07670000
 /*DCL 1 WRK_TYPE_OF_CONTRACT_FUT               CHAR(10);               07680000
 /*DCL 1 WRK_SOURCE_IND_FUT_INDNULL             FIXED BIN(15);          07690000
 /*DCL 1 WRK_TYPE_OF_CONTRACT_FUT_INDNULL       FIXED BIN(15);          07700000
                                                      /* EOC RB01305 */ 07710000
 DCL 1 WRK_TYPE_OF_CONTRACT_INDNULL           FIXED BIN(15);            07720000
                                                      /* EOC RB01290 */ 07730000
 DCL 1 WRK_FWTOW                              CHAR(01);   /* RB01298 */ 07740000
 DCL 1 WRK_HBTOM                              CHAR(01);   /* RB01298 */ 07750000
                                                      /* SOC RB01305 */ 07760000
 /*DCL 1 WRK_CONTRACT_NUMBER_FUT1               CHAR(15); /* RB01298 */ 07770000
 DCL 1 POST_WED_BAU                             CHAR(10);               07780000
 DCL 1 POST_WED_PI                              CHAR(10);               07790000
 DCL 1 RUN_DATE_FUT                             CHAR(10);               07800000
 DCL 1 TEMP_RUN_DATE_FUT                        CHAR(10);               07810000
 DCL 1 TEMP_CURR_END_DATE                       CHAR(10);               07820000
 DCL 1 TEMP_T051_SPLT_DATE_FUT                  CHAR(10);               07830000
 DCL 1 TEMP_T220_SPLT_DATE_FUT                  CHAR(10);               07840000
 DCL 1 TEMP_SW_BRAND_PI_FUT                     BIT  (1);               07850000
 DCL 1 TEMP_SW_BRAND_BAU_FUT                    BIT  (1);               07860000
 DCL 1 WRK_PRODUCT_TYPE_FUT                     CHAR(04);               07870000
 DCL 1 WRK_ORIGIN_FUT                           CHAR(02);               07880000
 DCL 1 WRK_SEQUENCE_NUMBER_FUT                  CHAR(28);               07890000
 DCL 1 WRK_SERIAL_LNG_FUT                       CHAR(30); /* RB01320 */ 07900000
                                                 /* SOC  CEDS00000624 */07910000
 DCL 1 WRK_PRODUCT_TYPE_REAL                    CHAR(04);               07920000
 DCL 1 WRK_ORIGIN_REAL                          CHAR(02);               07930000
 DCL 1 WRK_SEQUENCE_NUMBER_REAL                 CHAR(28);               07940000
                                                 /* EOC  CEDS00000624 */07950000
 DCL 1 WRK_MIN_EFF_DATE_FUT                     CHAR(10);               07960000
 DCL 1 WRK_MIN_EFF_DATE_FUT_INDNULL        FIXED BIN(15);               07970000
 DCL 1 POST_WED_BAU_INDNULL                FIXED BIN(15);               07980000
                                                      /* EOC RB01305 */ 07990000
                                                 /* SOC  CEDS00000624 */08000000
 DCL 1 BAU_DUMMY_ORIGIN               CHAR(02) INIT (' ');              08010000
 DCL 1 BAU_DUMMY_SEQ_NO               CHAR(07) INIT (' ');              08020000
 DCL 1 BAU_REAL_SERNO                 CHAR(30) INIT (' ');              08030000
 DCL 1 PI_REAL_SERNO                  CHAR(30) INIT (' ');              08040000
 DCL 1 PI_ORIGIN                      CHAR(02) INIT (' ');              08050000
 DCL 1 PI_DUMMY_ORIGIN                CHAR(02) INIT (' ');              08060000
 DCL 1 PI_DUMMY_SEQ_NO                CHAR(07) INIT (' ');              08070000
 DCL 1 PI_SEQ_NO                      CHAR(07) INIT (' ');              08080000
                                                 /* EOC  CEDS00000624 */08090000
                                                                        08100000
1/********************************************************************/ 08110000
 /*  BUILTIN FUNCTIONS                                               */ 08120000
 /********************************************************************/ 08130000
 DCL (ADDR,                                                             08140000
     DATE,                                                              08150000
     NULL,                                                              08160000
     STG,                                                               08170000
     STRING,                                                            08180000
     SUBSTR,                                                            08190000
     TRANSLATE,                                                         08200000
     VERIFY,                                                            08210000
     INDEX,                                                             08220000
     ROUND,                                                             08230000
     PLISRTA,                                                           08240000
     PLIRETC,                                                           08250000
     UNSPEC,                                                            08260000
     HIGH,                                                              08270000
     LOW,                                                               08280000
     TIME)                   BUILTIN;                                   08290000
1/********************************************************************/ 08300000
 /* ON ERROR CONDITIONS                                              */ 08310000
 /********************************************************************/ 08320000
 %INCLUDE (RCB0E0M);                                                    08330000
 END;                                                                   08340000
1/********************************************************************/ 08350000
 /* DB2/SQL SQLCA                                                    */ 08360000
 /********************************************************************/ 08370000
   EXEC SQL                                                             08380000
   INCLUDE SQLCA                                                        08390000
   ;                                                                    08400000
 /********************************************************************/ 08410000
 /* DB2/SQL CURSORS                                                  */ 08420059
 /********************************************************************/ 08430000
                                                                        08440000
                                /* RETRIEVE ALL PI HARDWARE/CONTRACT */ 08450000
     /* DATES '3999-12-31' ARE PLACE-HOLDERS. A DATE FORMAT MUST BE  */ 08460000
     /* SELECTED FOR CERTAIN FIELDS. WHEN A ROW IS RETRIEVED, WITH   */ 08470000
     /* DATE '3999-12-31' THIS WILL BE BLANKED AND SET TO DB2 NULL.  */ 08480000
                                                                        08490000
   EXEC SQL                                                             08500000
     DECLARE CURSOR_PI_HW CURSOR FOR                                    08510000
     SELECT                                                             08520000
            A.PRODUCT_TYPE                            /* SOC RC01349 */ 08530000
           ,A.ORIGIN                                                    08540000
           ,A.SEQUENCE_NUMBER                                           08550000
       /*   B.PRODUCT_TYPE */                         /* EOC RC01349 */ 08560000
                                                      /* SOC RB01320 */ 08570000
       /*  ,B.ORIGIN                                                    08580000
           ,B.SEQUENCE_NUMBER */                                        08590000
                                                      /* SOC RC01349 */ 08600000
       /*  ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                 08610000
           ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM 08620000
                                                    *//* EOC RC01349 */ 08630000
                                                      /* EOC RB01320 */ 08640000
           ,'BOTH'                                                      08650000
           ,B.MODEL_NUMBER                                              08660000
           ,B.INSTALL_DATE                                              08670000
           ,B.TYPE_OF_MAINT                                             08680000
           ,B.TYPE_OF_WARRANTY                                          08690000
           ,B.SERVICE_DELIV_FLAG                                        08700000
           ,B.SERVICE_LVL_CODE_1                                        08710000
           ,B.WARRANTY_SPLT_DATE                                        08720000
           ,B.SERVICE_LVL_CODE_2                                        08730000
           ,B.WARRANTY_EXP_DATE                                         08740000
           ,B.CUSTOMER_NUMBER                                           08750000
           ,B.OU_CODE                                                   08760000
           ,B.DEALER_NUMBER                                             08770000
           ,B.SERVICE_LVL_CODE_C                          /* RB01305 */ 08780000
           ,B.SOURCE_INDICATOR                                          08790000
           ,B.F_TYPE_OF_WARRANTY                          /* RB01281 */ 08800000
           ,B.WARRANTY_LIABILITY                          /* RB01283 */ 08810000
           ,C.HVP_QUANTITY                                              08820000
           ,C.CONTRACT_NUMBER                                           08830000
           ,C.SERVICE_MODULE_1                        /* SOC RB01305 */ 08840000
           ,C.SERVICE_MODULE_2                                          08850000
           ,C.SERVICE_MODULE_3                                          08860000
           ,C.SERVICE_MODULE_4                                          08870000
           ,C.SERVICE_MODULE_5                        /* EOC RB01305 */ 08880000
           ,C.COVERAGE_START_1                                          08890000
           ,C.COVERAGE_START_2                                          08900000
           ,C.COVERAGE_START_3                                          08910000
           ,C.COVERAGE_START_4                                          08920000
           ,C.COVERAGE_START_5                                          08930000
           ,C.COVERAGE_START_6                                          08940000
           ,C.COVERAGE_START_7                                          08950000
           ,C.COVERAGE_END_1                                            08960000
           ,C.COVERAGE_END_2                                            08970000
           ,C.COVERAGE_END_3                                            08980000
           ,C.COVERAGE_END_4                                            08990000
           ,C.COVERAGE_END_5                                            09000000
           ,C.COVERAGE_END_6                                            09010000
           ,C.COVERAGE_END_7                                            09020000
           ,C.SERVICE_TYPE                                              09030000
           ,C.SERVICE_LVL_CODE                                          09040000
           ,C.EFFECTIVE_DATE                                            09050000
           ,C.END_DATE                                                  09060000
           ,C.SOURCE_INDICATOR                        /* CEDS00000554 */09070000
     /*    ,'P'                   */                  /* CEDS00000554 */09080000
           ,C.AUTHORISATION_CODE                      /* CEDS00000321 */09090000
           ,D.CUSTOMER_NUMBER                         /* SOC RB01289 */ 09100000
           ,E.CUSTOMER_NUMBER                                           09110000
           ,F.CUSTOMER_NUMBER                         /* EOC RB01289 */ 09120000
           ,G.OU_CODE                                     /* RC01311 */ 09130000
                                                       /* SOC RC01349 */09140000
      /*   ,H.REAL_SERIAL_NUMBER     */                    /* RB01320 */09150000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               09160000
                                                       /* EOC RC01349 */09170000
     FROM RCBV0750_BMT_HW               A                               09180000
                                                       /* SOC RB01320 */09190000
   /*LEFT OUTER JOIN RCBV0125_DMMY_REAL   H     */     /* SOC RC01349 */09200000
   /*  ON  A.COUNTRY_NUMBER  = H.COUNTRY_NUMBER                         09210000
       AND A.PRODUCT_TYPE    = H.PRODUCT_TYPE                           09220000
       AND A.ORIGIN          = H.DUMMY_ORIGIN                           09230000
       AND A.SEQUENCE_NUMBER = H.DUMMY_SEQUENCE_NUM  *//* EOC RC01349 */09240000
                                                       /* EOC RB01320 */09250000
     INNER JOIN RCBV0051_PI_HW_PR       B             /* SOC RB01289 */ 09260000
       ON  B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        09270000
                                                       /* SOC RB01320 */09280000
     /*AND B.ORIGIN             = A.ORIGIN*/                            09290000
     /*AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER*/                   09300000
                                                       /* SOC RC01349 */09310000
       AND B.ORIGIN             = A.REAL_ORIGIN                         09320000
       AND B.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM                        09330000
     /*AND ((B.ORIGIN           = A.ORIGIN                              09340000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    09350000
       OR   (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER             09360000
       AND   B.PRODUCT_TYPE              = H.PRODUCT_TYPE               09370000
       AND  (B.ORIGIN||B.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)        09380000
       AND  (A.ORIGIN                    = H.DUMMY_ORIGIN               09390000
       AND   A.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM)))*/    09400000
                                                       /* EOC RC01349 */09410000
                                                       /* EOC RB01320 */09420000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      09430000
     INNER JOIN RCBV0241_PI_CTR         C                               09440000
       ON  B.PRODUCT_TYPE       = C.PRODUCT_TYPE                        09450000
       AND B.ORIGIN             = C.ORIGIN                              09460000
       AND B.SEQUENCE_NUMBER    = C.SEQUENCE_NUMBER                     09470000
       AND B.COUNTRY_NUMBER     = C.COUNTRY_NUMBER                      09480000
     LEFT OUTER JOIN RCBV0010_CUSTOMER  D                               09490000
       ON  B.COUNTRY_NUMBER     = D.COUNTRY_NUMBER                      09500000
       AND B.CUSTOMER_NUMBER    = D.CUSTOMER_NUMBER                     09510000
       AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE        09520000
     LEFT OUTER JOIN RCBV0011_PI_CUST   E                               09530000
       ON  B.COUNTRY_NUMBER     = E.COUNTRY_NUMBER                      09540000
       AND B.CUSTOMER_NUMBER    = E.CUSTOMER_NUMBER                     09550000
       AND B.CUSTOMER_NR_EXTEND = E.CUSTOMER_NR_EXTEND                  09560000
     LEFT OUTER JOIN RCBV0190_HW_CUST   F                               09570000
       ON  B.PRODUCT_TYPE       = F.PRODUCT_TYPE                        09580000
                                                       /* SOC RB01320 */09590000
     /*AND B.ORIGIN             = F.ORIGIN*/                            09600000
     /*AND B.SEQUENCE_NUMBER    = F.SEQUENCE_NUMBER*/                   09610000
                                                       /* SOC RC01349 */09620000
       AND A.REAL_ORIGIN        = F.ORIGIN                              09630000
       AND A.REAL_SEQ_NUM       = F.SEQUENCE_NUMBER                     09640000
     /*AND ((B.ORIGIN           = F.ORIGIN                              09650000
       AND B.SEQUENCE_NUMBER    = F.SEQUENCE_NUMBER)                    09660000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            09670000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              09680000
       AND  (F.ORIGIN||F.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       09690000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              09700000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))*/   09710000
                                                       /* EOC RC01349 */09720000
                                                       /* EOC RB01320 */09730000
       AND B.COUNTRY_NUMBER     = F.COUNTRY_NUMBER                      09740000
       AND F.TYPE_OF_RELATION   = 'U'                 /* CEDS00000468 */09750000
       AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE        09760000
                                                                        09770000
     LEFT OUTER JOIN RCBV0170_OU_HW     G              /* SOC RC01311 */09780000
       ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                        09790000
                                                       /* SOC RB01320 */09800000
     /*AND B.ORIGIN             = G.ORIGIN*/                            09810000
     /*AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER*/                   09820000
                                                       /* SOC RC01349 */09830000
       AND A.REAL_ORIGIN        = G.ORIGIN                              09840000
       AND A.REAL_SEQ_NUM       = G.SEQUENCE_NUMBER                     09850000
     /*AND ((B.ORIGIN           = G.ORIGIN                              09860000
       AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER)                    09870000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            09880000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              09890000
       AND  (G.ORIGIN||G.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       09900000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              09910000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))*/   09920000
                                                       /* EOC RC01349 */09930000
                                                       /* EOC RB01320 */09940000
       AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      09950000
       AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE        09960000
                                                       /* EOC RC01311 */09970000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           09980000
       AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE        09990000
                                                       /* EOC RB01289 */10000000
                                                                        10010000
 /*      ,RCBV0051_PI_HW_PR     B                      /* SOC RB01289 */10020000
 /*      ,RCBV0241_PI_CTR       C                                       10030000
                                                                        10040000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           10050000
                                                                        10060000
       AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        10070000
       AND B.ORIGIN             = A.ORIGIN                              10080000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     10090000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER     /* EOC RB01289 */10100000
 /*    AND B.INSTALL_DATE      <= :WRK_RUN_DATE               PTM1417 */10110000
                                                                        10120000
 /*    AND C.PRODUCT_TYPE       = B.PRODUCT_TYPE       /* SOC RB01289 */10130000
 /*    AND C.ORIGIN             = B.ORIGIN                              10140000
       AND C.SEQUENCE_NUMBER    = B.SEQUENCE_NUMBER                     10150000
       AND C.COUNTRY_NUMBER     = B.COUNTRY_NUMBER                      10160000
       AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE        10170000
                                                       /* EOC RB01289 */10180000
                                                       /* SOC RC01349 */10190000
     UNION                                                              10200000
     SELECT                                                             10210000
            A.PRODUCT_TYPE                                              10220000
           ,A.ORIGIN                                                    10230000
           ,A.SEQUENCE_NUMBER                                           10240000
           ,'BOTH'                                                      10250000
           ,B.MODEL_NUMBER                                              10260000
           ,B.INSTALL_DATE                                              10270000
           ,B.TYPE_OF_MAINT                                             10280000
           ,B.TYPE_OF_WARRANTY                                          10290000
           ,B.SERVICE_DELIV_FLAG                                        10300000
           ,B.SERVICE_LVL_CODE_1                                        10310000
           ,B.WARRANTY_SPLT_DATE                                        10320000
           ,B.SERVICE_LVL_CODE_2                                        10330000
           ,B.WARRANTY_EXP_DATE                                         10340000
           ,B.CUSTOMER_NUMBER                                           10350000
           ,B.OU_CODE                                                   10360000
           ,B.DEALER_NUMBER                                             10370000
           ,B.SERVICE_LVL_CODE_C                                        10380000
           ,B.SOURCE_INDICATOR                                          10390000
           ,B.F_TYPE_OF_WARRANTY                                        10400000
           ,B.WARRANTY_LIABILITY                                        10410000
           ,C.HVP_QUANTITY                                              10420000
           ,C.CONTRACT_NUMBER                                           10430000
           ,C.SERVICE_MODULE_1                                          10440000
           ,C.SERVICE_MODULE_2                                          10450000
           ,C.SERVICE_MODULE_3                                          10460000
           ,C.SERVICE_MODULE_4                                          10470000
           ,C.SERVICE_MODULE_5                                          10480000
           ,C.COVERAGE_START_1                                          10490000
           ,C.COVERAGE_START_2                                          10500000
           ,C.COVERAGE_START_3                                          10510000
           ,C.COVERAGE_START_4                                          10520000
           ,C.COVERAGE_START_5                                          10530000
           ,C.COVERAGE_START_6                                          10540000
           ,C.COVERAGE_START_7                                          10550000
           ,C.COVERAGE_END_1                                            10560000
           ,C.COVERAGE_END_2                                            10570000
           ,C.COVERAGE_END_3                                            10580000
           ,C.COVERAGE_END_4                                            10590000
           ,C.COVERAGE_END_5                                            10600000
           ,C.COVERAGE_END_6                                            10610000
           ,C.COVERAGE_END_7                                            10620000
           ,C.SERVICE_TYPE                                              10630000
           ,C.SERVICE_LVL_CODE                                          10640000
           ,C.EFFECTIVE_DATE                                            10650000
           ,C.END_DATE                                                  10660000
           ,C.SOURCE_INDICATOR                                          10670000
           ,C.AUTHORISATION_CODE                                        10680000
           ,D.CUSTOMER_NUMBER                                           10690000
           ,E.CUSTOMER_NUMBER                                           10700000
           ,F.CUSTOMER_NUMBER                                           10710000
           ,G.OU_CODE                                                   10720000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               10730000
     FROM RCBV0750_BMT_HW               A                               10740000
                                                                        10750000
     INNER JOIN RCBV0051_PI_HW_PR       B                               10760000
       ON  B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        10770000
       AND B.ORIGIN             = A.ORIGIN                              10780000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     10790000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      10800000
     INNER JOIN RCBV0241_PI_CTR         C                               10810000
       ON  B.PRODUCT_TYPE       = C.PRODUCT_TYPE                        10820000
       AND B.ORIGIN             = C.ORIGIN                              10830000
       AND B.SEQUENCE_NUMBER    = C.SEQUENCE_NUMBER                     10840000
       AND B.COUNTRY_NUMBER     = C.COUNTRY_NUMBER                      10850000
     LEFT OUTER JOIN RCBV0010_CUSTOMER  D                               10860000
       ON  B.COUNTRY_NUMBER     = D.COUNTRY_NUMBER                      10870000
       AND B.CUSTOMER_NUMBER    = D.CUSTOMER_NUMBER                     10880000
       AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE        10890000
     LEFT OUTER JOIN RCBV0011_PI_CUST   E                               10900000
       ON  B.COUNTRY_NUMBER     = E.COUNTRY_NUMBER                      10910000
       AND B.CUSTOMER_NUMBER    = E.CUSTOMER_NUMBER                     10920000
       AND B.CUSTOMER_NR_EXTEND = E.CUSTOMER_NR_EXTEND                  10930000
     LEFT OUTER JOIN RCBV0190_HW_CUST   F                               10940000
       ON  B.PRODUCT_TYPE       = F.PRODUCT_TYPE                        10950000
       AND A.REAL_ORIGIN        = F.ORIGIN                              10960000
       AND A.REAL_SEQ_NUM       = F.SEQUENCE_NUMBER                     10970000
       AND B.COUNTRY_NUMBER     = F.COUNTRY_NUMBER                      10980000
       AND F.TYPE_OF_RELATION   = 'U'                                   10990000
       AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE        11000000
                                                                        11010000
     LEFT OUTER JOIN RCBV0170_OU_HW     G                               11020000
       ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                        11030000
       AND A.REAL_ORIGIN        = G.ORIGIN                              11040000
       AND A.REAL_SEQ_NUM       = G.SEQUENCE_NUMBER                     11050000
       AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      11060000
       AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE        11070000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           11080000
       AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE        11090000
                                                      /* EOC RC01349 */ 11100000
     UNION                                                              11110000
                                                                        11120000
     SELECT                                                             11130000
                                                      /* SOC RC01349 */ 11140000
            A.PRODUCT_TYPE                                              11150000
           ,A.ORIGIN                                                    11160000
           ,A.SEQUENCE_NUMBER                                           11170000
         /* B.PRODUCT_TYPE                          *//* EOC RC01349 */ 11180000
                                                      /* SOC RB01320 */ 11190000
         /*,B.ORIGIN                                                    11200000
           ,B.SEQUENCE_NUMBER */                                        11210000
                                                      /* SOC RC01349 */ 11220000
         /* ,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                11230000
            ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM11240000
                                                    *//* EOC RC01349 */ 11250000
                                                      /* EOC RB01320 */ 11260000
           ,'T051'                                                      11270000
           ,B.MODEL_NUMBER                                              11280000
           ,B.INSTALL_DATE                                              11290000
           ,B.TYPE_OF_MAINT                                             11300000
           ,B.TYPE_OF_WARRANTY                                          11310000
           ,B.SERVICE_DELIV_FLAG                                        11320000
           ,B.SERVICE_LVL_CODE_1                                        11330000
           ,B.WARRANTY_SPLT_DATE                                        11340000
           ,B.SERVICE_LVL_CODE_2                                        11350000
           ,B.WARRANTY_EXP_DATE                                         11360000
           ,B.CUSTOMER_NUMBER                                           11370000
           ,B.OU_CODE                                                   11380000
           ,B.DEALER_NUMBER                                             11390000
           ,B.SERVICE_LVL_CODE_C                          /* RB01305 */ 11400000
           ,B.SOURCE_INDICATOR                                          11410000
           ,B.F_TYPE_OF_WARRANTY                     /* RB01281 */      11420000
           ,B.WARRANTY_LIABILITY                     /* RB01283 */      11430000
           ,1                                                           11440000
           ,''                                                          11450000
           ,''                                        /* SOC RB01305 */ 11460000
           ,''                                                          11470000
           ,''                                                          11480000
           ,''                                                          11490000
           ,''                                        /* EOC RB01305 */ 11500000
           ,TIME('00.00.00')                                            11510000
           ,TIME('00.00.00')                                            11520000
           ,TIME('00.00.00')                                            11530000
           ,TIME('00.00.00')                                            11540000
           ,TIME('00.00.00')                                            11550000
           ,TIME('00.00.00')                                            11560000
           ,TIME('00.00.00')                                            11570000
           ,TIME('00.00.00')                                            11580000
           ,TIME('00.00.00')                                            11590000
           ,TIME('00.00.00')                                            11600000
           ,TIME('00.00.00')                                            11610000
           ,TIME('00.00.00')                                            11620000
           ,TIME('00.00.00')                                            11630000
           ,TIME('00.00.00')                                            11640000
           ,''                                                          11650000
           ,''                                                          11660000
           ,DATE('3999-12-31')                                          11670000
           ,DATE('3999-12-31')                                          11680000
           ,''                                                          11690000
           ,''                                        /* CEDS00000321 */11700000
           ,D.CUSTOMER_NUMBER                          /* SOC RB01289 */11710000
           ,E.CUSTOMER_NUMBER                                           11720000
           ,F.CUSTOMER_NUMBER                          /* EOC RB01289 */11730000
           ,G.OU_CODE                                      /* RC01311 */11740000
                                                       /* SOC RC01349 */11750000
      /*   ,H.REAL_SERIAL_NUMBER     */                    /* RB01320 */11760000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               11770000
                                                       /* EOC RC01349 */11780000
     FROM RCBV0750_BMT_HW               A                               11790000
                                                       /* SOC RB01320 */11800000
   /*  LEFT OUTER JOIN RCBV0125_DMMY_REAL   H      */  /* SOC RC01349 */11810000
   /*  ON  A.COUNTRY_NUMBER = H.COUNTRY_NUMBER                          11820000
       AND A.PRODUCT_TYPE   = H.PRODUCT_TYPE                            11830000
       AND A.ORIGIN         = H.DUMMY_ORIGIN                            11840000
       AND A.SEQUENCE_NUMBER = H.DUMMY_SEQUENCE_NUM */ /* EOC RC01349 */11850000
                                                       /* EOC RB01320 */11860000
     INNER JOIN RCBV0051_PI_HW_PR       B              /* SOC RB01289 */11870000
       ON  B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        11880000
                                                       /* SOC RB01320 */11890000
     /*AND B.ORIGIN             = A.ORIGIN*/                            11900000
     /*AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER*/                   11910000
                                                       /* SOC RC01349 */11920000
       AND B.ORIGIN             = A.REAL_ORIGIN                         11930000
       AND B.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM                        11940000
     /*AND ((B.ORIGIN             = A.ORIGIN                            11950000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER)                    11960000
       OR  (B.COUNTRY_NUMBER            = H.COUNTRY_NUMBER              11970000
       AND  B.PRODUCT_TYPE              = H.PRODUCT_TYPE                11980000
       AND (B.ORIGIN||B.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)         11990000
       AND (A.ORIGIN                    = H.DUMMY_ORIGIN                12000000
       AND  A.SEQUENCE_NUMBER           = H.DUMMY_SEQUENCE_NUM))) */    12010000
                                                       /* EOC RC01349 */12020000
                                                       /* EOC RB01320 */12030000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      12040000
     LEFT OUTER JOIN RCBV0010_CUSTOMER  D                               12050000
       ON  B.COUNTRY_NUMBER     = D.COUNTRY_NUMBER                      12060000
       AND B.CUSTOMER_NUMBER    = D.CUSTOMER_NUMBER                     12070000
       AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE        12080000
     LEFT OUTER JOIN RCBV0011_PI_CUST   E                               12090000
       ON  B.COUNTRY_NUMBER     = E.COUNTRY_NUMBER                      12100000
       AND B.CUSTOMER_NUMBER    = E.CUSTOMER_NUMBER                     12110000
       AND B.CUSTOMER_NR_EXTEND = E.CUSTOMER_NR_EXTEND                  12120000
     LEFT OUTER JOIN RCBV0190_HW_CUST   F                               12130000
       ON  B.PRODUCT_TYPE       = F.PRODUCT_TYPE                        12140000
                                                       /* SOC RB01320 */12150000
     /*AND B.ORIGIN             = F.ORIGIN*/                            12160000
     /*AND B.SEQUENCE_NUMBER    = F.SEQUENCE_NUMBER*/                   12170000
                                                       /* SOC RC01349 */12180000
       AND A.REAL_ORIGIN        = F.ORIGIN                              12190000
       AND A.REAL_SEQ_NUM       = F.SEQUENCE_NUMBER                     12200000
     /*AND ((B.ORIGIN             = F.ORIGIN                            12210000
       AND B.SEQUENCE_NUMBER      = F.SEQUENCE_NUMBER)                  12220000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            12230000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              12240000
       AND  (F.ORIGIN||F.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       12250000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              12260000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))*/   12270000
                                                       /* EOC RC01349 */12280000
                                                       /* EOC RB01320 */12290000
       AND B.COUNTRY_NUMBER     = F.COUNTRY_NUMBER                      12300000
       AND F.TYPE_OF_RELATION   = 'U'                 /* CEDS00000468 */12310000
       AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE        12320000
                                                                        12330000
     LEFT OUTER JOIN RCBV0170_OU_HW     G              /* SOC RC01311 */12340000
       ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                        12350000
                                                       /* SOC RB01320 */12360000
     /*AND B.ORIGIN             = G.ORIGIN*/                            12370000
     /*AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER*/                   12380000
                                                       /* SOC RC01349 */12390000
       AND A.REAL_ORIGIN        = G.ORIGIN                              12400000
       AND A.REAL_SEQ_NUM       = G.SEQUENCE_NUMBER                     12410000
     /*AND ((B.ORIGIN           = G.ORIGIN                              12420000
       AND B.SEQUENCE_NUMBER    = G.SEQUENCE_NUMBER)                    12430000
       OR   (B.COUNTRY_NUMBER             = H.COUNTRY_NUMBER            12440000
       AND   B.PRODUCT_TYPE               = H.PRODUCT_TYPE              12450000
       AND  (G.ORIGIN||G.SEQUENCE_NUMBER  = H.REAL_SERIAL_NUMBER)       12460000
       AND  (B.ORIGIN                     = H.DUMMY_ORIGIN              12470000
       AND   B.SEQUENCE_NUMBER            = H.DUMMY_SEQUENCE_NUM)))*/   12480000
                                                       /* EOC RC01349 */12490000
                                                       /* EOC RB01320 */12500000
       AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      12510000
       AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE        12520000
                                                       /* EOC RC01311 */12530000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           12540000
                                                       /* SOC RB01305 */12550000
    /* AND B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE        /* EOC RB01289 */12560000
       AND (B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE                        12570000
            OR                                                          12580000
            (:PARM_RCB005.PI_TO_BMT = 'I'  AND                          12590000
             (B.WARRANTY_LIABILITY IN ('IBM','') OR                     12600000
                   B.WARRANTY_LIABILITY IS NULL) AND                    12610000
              B.WARRANTY_EXP_DATE < :WRK_RUN_DATE))    /* EOC RB01305 */12620000
                                                                        12630000
 /*  FROM RCBV0750_BMT_HW       A                      /* SOC RB01289 */12640000
 /*      ,RCBV0051_PI_HW_PR     B                                       12650000
                                                                        12660000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           12670000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      12680000
       AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        12690000
       AND B.ORIGIN             = A.ORIGIN                              12700000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     12710000
 /*    AND B.INSTALL_DATE      <= :WRK_RUN_DATE               PTM1417 */12720000
 /*    AND B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE        /* EOC RB01289 */12730000
                                                                        12740000
       AND NOT EXISTS (                                                 12750000
           SELECT *                                                     12760000
           FROM RCBV0241_PI_CTR     C                                   12770000
           WHERE C.COUNTRY_NUMBER   = :WRK_CTRYNO                       12780000
             AND C.PRODUCT_TYPE     = B.PRODUCT_TYPE                    12790000
             AND C.ORIGIN           = B.ORIGIN                          12800000
             AND C.SEQUENCE_NUMBER  = B.SEQUENCE_NUMBER                 12810000
             AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE  12820000
           )                                                            12830000
                                                                        12840000
     UNION                                             /* SOC RC01349 */12850000
                                                                        12860000
     SELECT                                                             12870000
                                                                        12880000
            A.PRODUCT_TYPE                                              12890000
           ,A.ORIGIN                                                    12900000
           ,A.SEQUENCE_NUMBER                                           12910000
           ,'T051'                                                      12920000
           ,B.MODEL_NUMBER                                              12930000
           ,B.INSTALL_DATE                                              12940000
           ,B.TYPE_OF_MAINT                                             12950000
           ,B.TYPE_OF_WARRANTY                                          12960000
           ,B.SERVICE_DELIV_FLAG                                        12970000
           ,B.SERVICE_LVL_CODE_1                                        12980000
           ,B.WARRANTY_SPLT_DATE                                        12990000
           ,B.SERVICE_LVL_CODE_2                                        13000000
           ,B.WARRANTY_EXP_DATE                                         13010000
           ,B.CUSTOMER_NUMBER                                           13020000
           ,B.OU_CODE                                                   13030000
           ,B.DEALER_NUMBER                                             13040000
           ,B.SERVICE_LVL_CODE_C                                        13050000
           ,B.SOURCE_INDICATOR                                          13060000
           ,B.F_TYPE_OF_WARRANTY                                        13070000
           ,B.WARRANTY_LIABILITY                                        13080000
           ,1                                                           13090000
           ,''                                                          13100000
           ,''                                                          13110000
           ,''                                                          13120000
           ,''                                                          13130000
           ,''                                                          13140000
           ,''                                                          13150000
           ,TIME('00.00.00')                                            13160000
           ,TIME('00.00.00')                                            13170000
           ,TIME('00.00.00')                                            13180000
           ,TIME('00.00.00')                                            13190000
           ,TIME('00.00.00')                                            13200000
           ,TIME('00.00.00')                                            13210000
           ,TIME('00.00.00')                                            13220000
           ,TIME('00.00.00')                                            13230000
           ,TIME('00.00.00')                                            13240000
           ,TIME('00.00.00')                                            13250000
           ,TIME('00.00.00')                                            13260000
           ,TIME('00.00.00')                                            13270000
           ,TIME('00.00.00')                                            13280000
           ,TIME('00.00.00')                                            13290000
           ,''                                                          13300000
           ,''                                                          13310000
           ,DATE('3999-12-31')                                          13320000
           ,DATE('3999-12-31')                                          13330000
           ,''                                                          13340000
           ,''                                                          13350000
           ,D.CUSTOMER_NUMBER                                           13360000
           ,E.CUSTOMER_NUMBER                                           13370000
           ,F.CUSTOMER_NUMBER                                           13380000
           ,G.OU_CODE                                                   13390000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               13400000
                                                                        13410000
     FROM RCBV0750_BMT_HW               A                               13420000
     INNER JOIN RCBV0051_PI_HW_PR       B                               13430000
       ON  B.PRODUCT_TYPE       = A.PRODUCT_TYPE                        13440000
       AND B.ORIGIN             = A.ORIGIN                              13450000
       AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                     13460000
       AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                      13470000
     LEFT OUTER JOIN RCBV0010_CUSTOMER  D                               13480000
       ON  B.COUNTRY_NUMBER     = D.COUNTRY_NUMBER                      13490000
       AND B.CUSTOMER_NUMBER    = D.CUSTOMER_NUMBER                     13500000
       AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE        13510000
     LEFT OUTER JOIN RCBV0011_PI_CUST   E                               13520000
       ON  B.COUNTRY_NUMBER     = E.COUNTRY_NUMBER                      13530000
       AND B.CUSTOMER_NUMBER    = E.CUSTOMER_NUMBER                     13540000
       AND B.CUSTOMER_NR_EXTEND = E.CUSTOMER_NR_EXTEND                  13550000
     LEFT OUTER JOIN RCBV0190_HW_CUST   F                               13560000
       ON  B.PRODUCT_TYPE       = F.PRODUCT_TYPE                        13570000
       AND A.REAL_ORIGIN        = F.ORIGIN                              13580000
       AND A.REAL_SEQ_NUM       = F.SEQUENCE_NUMBER                     13590000
       AND B.COUNTRY_NUMBER     = F.COUNTRY_NUMBER                      13600000
       AND F.TYPE_OF_RELATION   = 'U'                                   13610000
       AND :WRK_RUN_DATE BETWEEN F.EFFECTIVE_DATE AND F.END_DATE        13620000
                                                                        13630000
     LEFT OUTER JOIN RCBV0170_OU_HW     G                               13640000
       ON  B.PRODUCT_TYPE       = G.PRODUCT_TYPE                        13650000
       AND A.REAL_ORIGIN        = G.ORIGIN                              13660000
       AND A.REAL_SEQ_NUM       = G.SEQUENCE_NUMBER                     13670000
       AND B.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                      13680000
       AND :WRK_RUN_DATE BETWEEN G.EFFECTIVE_DATE AND G.END_DATE        13690000
     WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                           13700000
       AND (B.WARRANTY_EXP_DATE >= :WRK_RUN_DATE                        13710000
            OR                                                          13720000
            (:PARM_RCB005.PI_TO_BMT = 'I'  AND                          13730000
             (B.WARRANTY_LIABILITY IN ('IBM','') OR                     13740000
                   B.WARRANTY_LIABILITY IS NULL) AND                    13750000
              B.WARRANTY_EXP_DATE < :WRK_RUN_DATE))                     13760000
                                                                        13770000
       AND NOT EXISTS (                                                 13780000
           SELECT *                                                     13790000
           FROM RCBV0241_PI_CTR     C                                   13800000
           WHERE C.COUNTRY_NUMBER   = :WRK_CTRYNO                       13810000
             AND C.PRODUCT_TYPE     = B.PRODUCT_TYPE                    13820000
             AND C.ORIGIN           = B.ORIGIN                          13830000
             AND C.SEQUENCE_NUMBER  = B.SEQUENCE_NUMBER                 13840000
             AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE  13850000
           )                                          /* EOC RC01349 */ 13860000
                                                                        13870000
     UNION                                                              13880000
                                                                        13890000
     SELECT                                                             13900000
            A.PRODUCT_TYPE                            /* SOC RC01349 */ 13910000
           ,A.ORIGIN                                                    13920000
           ,A.SEQUENCE_NUMBER                                           13930000
        /*  C.PRODUCT_TYPE                          *//* EOC RC01349 */ 13940000
                                                      /* SOC RB01320 */ 13950000
        /* ,C.ORIGIN                                                    13960000
           ,C.SEQUENCE_NUMBER */                                        13970000
                                                      /* SOC RC01349 */ 13980000
        /* ,COALESCE(D.DUMMY_ORIGIN,C.ORIGIN) AS ORIGIN                 13990000
           ,COALESCE(D.DUMMY_SEQUENCE_NUM,C.SEQUENCE_NUMBER) AS SEQ_NUM 14000000
                                                    *//* EOC RC01349 */ 14010000
                                                      /* EOC RB01320 */ 14020000
           ,'T241'                                                      14030000
           ,''                                                          14040000
           ,DATE('3999-12-31')                                          14050000
           ,''                                                          14060000
           ,''                                                          14070000
           ,''                                                          14080000
           ,''                                                          14090000
           ,DATE('3999-12-31')                                          14100000
           ,''                                                          14110000
           ,DATE('3999-12-31')                                          14120000
           ,C.CUSTOMER_NUMBER                              /* RB01289 */14130000
 /*        ,''                                             /* RB01289 */14140000
           ,''                                                          14150000
           ,''                                                          14160000
           ,''                                             /* RB01305 */14170000
           ,''                                                          14180000
           ,''                                     /*RB01281*/          14190000
           ,''                                     /*RB01283*/          14200000
           ,C.HVP_QUANTITY                                              14210000
           ,C.CONTRACT_NUMBER                                           14220000
           ,C.SERVICE_MODULE_1                        /* SOC RB01305 */ 14230000
           ,C.SERVICE_MODULE_2                                          14240000
           ,C.SERVICE_MODULE_3                                          14250000
           ,C.SERVICE_MODULE_4                                          14260000
           ,C.SERVICE_MODULE_5                        /* EOC RB01305 */ 14270000
           ,C.COVERAGE_START_1                                          14280000
           ,C.COVERAGE_START_2                                          14290000
           ,C.COVERAGE_START_3                                          14300000
           ,C.COVERAGE_START_4                                          14310000
           ,C.COVERAGE_START_5                                          14320000
           ,C.COVERAGE_START_6                                          14330000
           ,C.COVERAGE_START_7                                          14340000
           ,C.COVERAGE_END_1                                            14350000
           ,C.COVERAGE_END_2                                            14360000
           ,C.COVERAGE_END_3                                            14370000
           ,C.COVERAGE_END_4                                            14380000
           ,C.COVERAGE_END_5                                            14390000
           ,C.COVERAGE_END_6                                            14400000
           ,C.COVERAGE_END_7                                            14410000
           ,C.SERVICE_TYPE                                              14420000
           ,C.SERVICE_LVL_CODE                                          14430000
           ,C.EFFECTIVE_DATE                                            14440000
           ,C.END_DATE                                                  14450000
           ,C.SOURCE_INDICATOR                        /* CEDS00000554 */14460000
     /*    ,'P'                   */                  /* CEDS00000554 */14470000
           ,C.AUTHORISATION_CODE                      /* CEDS00000321 */14480000
           ,''                                         /* SOC RB01289 */14490000
           ,''                                                          14500000
           ,''                                         /* EOC RB01289 */14510000
           ,''                                             /* RC01311 */14520000
                                                       /* SOC RC01349 */14530000
        /* ,D.REAL_SERIAL_NUMBER  */                       /* RB01320 */14540000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               14550000
                                                       /* EOC RC01349 */14560000
 /*  FROM RCBV0750_BMT_HW     A                                         14570000
         ,RCBV0241_PI_CTR     C */                                      14580000
     FROM RCBV0241_PI_CTR     C                                         14590000
         ,RCBV0750_BMT_HW     A                                         14600000
                                                       /* SOC RC01349 */14610000
   /*LEFT OUTER JOIN RCBV0125_DMMY_REAL   D                             14620000
   /*ON    A.PRODUCT_TYPE               = D.PRODUCT_TYPE                14630000
     AND   A.ORIGIN                     = D.DUMMY_ORIGIN                14640000
     AND   A.SEQUENCE_NUMBER            = D.DUMMY_SEQUENCE_NUM          14650000
     AND   A.COUNTRY_NUMBER             = D.COUNTRY_NUMBER*/            14660000
                                                       /* EOC RC01349 */14670000
                                                       /* EOC RB01320 */14680000
     WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                             14690000
       AND C.COUNTRY_NUMBER   = A.COUNTRY_NUMBER                        14700000
                                                                        14710000
       AND C.PRODUCT_TYPE     = A.PRODUCT_TYPE                          14720000
                                                       /* SOC RB01320 */14730000
     /*AND C.ORIGIN           = A.ORIGIN*/                              14740000
     /*AND C.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER*/                     14750000
                                                       /* SOC RC01349 */14760000
       AND C.ORIGIN           = A.REAL_ORIGIN                           14770000
       AND C.SEQUENCE_NUMBER  = A.REAL_SEQ_NUM                          14780000
     /*AND ((C.ORIGIN         = A.ORIGIN                                14790000
       AND C.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER)                      14800000
       OR (C.COUNTRY_NUMBER   = D.COUNTRY_NUMBER                        14810000
       AND C.PRODUCT_TYPE     = D.PRODUCT_TYPE                          14820000
       AND (C.ORIGIN||C.SEQUENCE_NUMBER =                               14830000
                                 D.REAL_SERIAL_NUMBER)                  14840000
       AND (A.ORIGIN          = D.DUMMY_ORIGIN                          14850000
       AND  A.SEQUENCE_NUMBER = D.DUMMY_SEQUENCE_NUM))) */              14860000
                                                       /* EOC RC01349 */14870000
                                                       /* EOC RB01320 */14880000
       AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE        14890000
                                                                        14900000
       AND NOT EXISTS (                                                 14910000
           SELECT *                                                     14920000
           FROM RCBV0051_PI_HW_PR     B                                 14930000
           WHERE B.COUNTRY_NUMBER     = :WRK_CTRYNO                     14940000
             AND B.PRODUCT_TYPE       = C.PRODUCT_TYPE                  14950000
             AND B.ORIGIN             = C.ORIGIN                        14960000
             AND B.SEQUENCE_NUMBER    = C.SEQUENCE_NUMBER               14970000
 /*          AND B.INSTALL_DATE      <= :WRK_RUN_DATE         PTM1417 */14980000
           )                                                            14990000
                                                                        15000000
     UNION                                             /* SOC RC01349 */15010000
                                                                        15020000
     SELECT                                                             15030000
            A.PRODUCT_TYPE                                              15040000
           ,A.ORIGIN                                                    15050000
           ,A.SEQUENCE_NUMBER                                           15060000
           ,'T241'                                                      15070000
           ,''                                                          15080000
           ,DATE('3999-12-31')                                          15090000
           ,''                                                          15100000
           ,''                                                          15110000
           ,''                                                          15120000
           ,''                                                          15130000
           ,DATE('3999-12-31')                                          15140000
           ,''                                                          15150000
           ,DATE('3999-12-31')                                          15160000
           ,C.CUSTOMER_NUMBER                                           15170000
           ,''                                                          15180000
           ,''                                                          15190000
           ,''                                                          15200000
           ,''                                                          15210000
           ,''                                                          15220000
           ,''                                                          15230000
           ,C.HVP_QUANTITY                                              15240000
           ,C.CONTRACT_NUMBER                                           15250000
           ,C.SERVICE_MODULE_1                                          15260000
           ,C.SERVICE_MODULE_2                                          15270000
           ,C.SERVICE_MODULE_3                                          15280000
           ,C.SERVICE_MODULE_4                                          15290000
           ,C.SERVICE_MODULE_5                                          15300000
           ,C.COVERAGE_START_1                                          15310000
           ,C.COVERAGE_START_2                                          15320000
           ,C.COVERAGE_START_3                                          15330000
           ,C.COVERAGE_START_4                                          15340000
           ,C.COVERAGE_START_5                                          15350000
           ,C.COVERAGE_START_6                                          15360000
           ,C.COVERAGE_START_7                                          15370000
           ,C.COVERAGE_END_1                                            15380000
           ,C.COVERAGE_END_2                                            15390000
           ,C.COVERAGE_END_3                                            15400000
           ,C.COVERAGE_END_4                                            15410000
           ,C.COVERAGE_END_5                                            15420000
           ,C.COVERAGE_END_6                                            15430000
           ,C.COVERAGE_END_7                                            15440000
           ,C.SERVICE_TYPE                                              15450000
           ,C.SERVICE_LVL_CODE                                          15460000
           ,C.EFFECTIVE_DATE                                            15470000
           ,C.END_DATE                                                  15480000
           ,C.SOURCE_INDICATOR                                          15490000
           ,C.AUTHORISATION_CODE                                        15500000
           ,''                                                          15510000
           ,''                                                          15520000
           ,''                                                          15530000
           ,''                                                          15540000
           ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                               15550000
     FROM RCBV0241_PI_CTR     C                                         15560000
         ,RCBV0750_BMT_HW     A                                         15570000
     WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                             15580000
       AND C.COUNTRY_NUMBER   = A.COUNTRY_NUMBER                        15590000
       AND C.PRODUCT_TYPE     = A.PRODUCT_TYPE                          15600000
       AND C.ORIGIN           = A.ORIGIN                                15610000
       AND C.SEQUENCE_NUMBER  = A.SEQUENCE_NUMBER                       15620000
       AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE        15630000
                                                                        15640000
       AND NOT EXISTS (                                                 15650000
           SELECT *                                                     15660000
           FROM RCBV0051_PI_HW_PR     B                                 15670000
           WHERE B.COUNTRY_NUMBER     = :WRK_CTRYNO                     15680000
             AND B.PRODUCT_TYPE       = C.PRODUCT_TYPE                  15690000
             AND B.ORIGIN             = C.ORIGIN                        15700000
             AND B.SEQUENCE_NUMBER    = C.SEQUENCE_NUMBER               15710000
           )                                          /* EOC RC01349 */ 15720000
     ORDER BY 1                                                         15730000
             ,2                                                         15740000
             ,3                                                         15750000
   FOR FETCH ONLY                                         /* RC01219 */ 15760000
             ;                                                          15770000
                                                                        15780000
                                         /* CURSOR_INST_HW           */ 15790000
 EXEC SQL                                                               15800000
   DECLARE CURSOR_INST_HW CURSOR FOR                                    15810000
   SELECT DISTINCT                                                      15820000
          A.PRODUCT_TYPE                              /* SOC RC01349 */ 15830000
         ,A.ORIGIN                                                      15840000
         ,A.SEQUENCE_NUMBER                                             15850000
       /* B.PRODUCT_TYPE  */                          /* EOC RC01349 */ 15860000
                                                      /* SOC RB01320 */ 15870000
       /*,B.ORIGIN                                                      15880000
         ,B.SEQUENCE_NUMBER*/                                           15890000
                                                      /* SOC RC01349 */ 15900000
       /*,COALESCE(H.DUMMY_ORIGIN,B.ORIGIN) AS ORIGIN                   15910000
         ,COALESCE(H.DUMMY_SEQUENCE_NUM,B.SEQUENCE_NUMBER) AS SEQ_NUM   15920000
                                                    *//* EOC RC01349 */ 15930000
                                                      /* EOC RB01320 */ 15940000
         ,B.CUSTOMER_NUMBER                                             15950000
         ,B.MARKETING_INSTDAT                                           15960000
         ,B.EFFECTIVE_DATE                                              15970000
         ,B.END_DATE                                                    15980000
         ,C.OU_CODE                                                     15990000
         ,C.EFFECTIVE_DATE                                              16000000
         ,C.END_DATE                                                    16010000
         ,D.TYPE_OF_MAINT                                               16020000
         ,D.TYPE_OF_WARRANTY                                            16030000
         ,D.SERVICE_LVL_CODE                                            16040000
         ,D.EFFECTIVE_DATE                                              16050000
         ,D.END_DATE                                                    16060000
         ,D.WARRANTY_EXP_DATE                                           16070000
         ,D.F_TYPE_OF_WARRANTY                          /* RB01281 */   16080000
         ,D.F_SPLT_DATE                                 /* RB01281 */   16090000
         ,D.SOURCE_INDICATOR                            /* RB01290 */   16100000
         ,D.SERVICE_LVL_CODE_2                          /* RB01298 */   16110000
                                                       /* SOC RB01320 */16120000
  /*     ,H.REAL_SERIAL_NUMBER        */               /* SOC RC01349 */16130000
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM                /* EOC RC01349 */16140000
 /*FROM RCBV0750_BMT_HW      A                                          16150000
       ,RCBV0190_HW_CUST     B                                          16160000
       ,RCBV0170_OU_HW       C                                          16170000
       ,RCBV0220_SUPPL_CTR   D*/                                        16180000
   FROM  RCBV0190_HW_CUST     B                                         16190000
        ,RCBV0170_OU_HW       C                                         16200000
        ,RCBV0220_SUPPL_CTR   D                                         16210000
        ,RCBV0750_BMT_HW      A                                         16220000
                                                                        16230000
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL  H        */     /* SOC RC01349 */16240000
 /* ON   A.COUNTRY_NUMBER      = H.COUNTRY_NUMBER                       16250000
    AND  A.PRODUCT_TYPE        = H.PRODUCT_TYPE                         16260000
    AND  A.ORIGIN              = H.DUMMY_ORIGIN                         16270000
    AND  A.SEQUENCE_NUMBER     = H.DUMMY_SEQUENCE_NUM*//* EOC RC01349 */16280000
                                                       /* EOC RB01320 */16290000
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            16300000
     AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE                         16310000
                                                       /* SOC RB01320 */16320000
   /*AND B.ORIGIN              = A.ORIGIN                               16330000
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER*/                    16340000
                                                       /* SOC RC01349 */16350000
     AND B.ORIGIN              = A.REAL_ORIGIN                          16360000
     AND B.SEQUENCE_NUMBER     = A.REAL_SEQ_NUM                         16370000
   /*AND ((B.ORIGIN             = A.ORIGIN                              16380000
     AND B.SEQUENCE_NUMBER      = A.SEQUENCE_NUMBER                     16390000
     AND B.COUNTRY_NUMBER       = A.COUNTRY_NUMBER)                     16400000
     OR (H.COUNTRY_NUMBER       = A.COUNTRY_NUMBER                      16410000
     AND B.PRODUCT_TYPE         = H.PRODUCT_TYPE                        16420000
     AND A.ORIGIN               = H.DUMMY_ORIGIN                        16430000
     AND A.SEQUENCE_NUMBER      = H.DUMMY_SEQUENCE_NUM                  16440000
     AND B.ORIGIN||B.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)) */        16450000
                                                       /* EOC RC01349 */16460000
                                                       /* EOC RB01320 */16470000
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       16480000
     AND B.TYPE_OF_RELATION    = 'U'                                    16490000
     AND :WRK_RUN_DATE BETWEEN B.EFFECTIVE_DATE AND B.END_DATE          16500000
                                                                        16510000
     AND C.PRODUCT_TYPE        = A.PRODUCT_TYPE                         16520000
                                                       /* SOC RB01320 */16530000
   /*AND C.ORIGIN              = A.ORIGIN*/                             16540000
   /*AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER*/                    16550000
     AND C.ORIGIN              = A.REAL_ORIGIN         /* SOC RC01349 */16560000
     AND C.SEQUENCE_NUMBER     = A.REAL_SEQ_NUM                         16570000
   /*AND ((C.ORIGIN              = A.ORIGIN                             16580000
     AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER)                     16590000
     OR (C.PRODUCT_TYPE        = H.PRODUCT_TYPE                         16600000
     AND C.COUNTRY_NUMBER      = H.COUNTRY_NUMBER                       16610000
     AND A.ORIGIN              = H.DUMMY_ORIGIN                         16620000
     AND A.SEQUENCE_NUMBER     = H.DUMMY_SEQUENCE_NUM                   16630000
     AND C.ORIGIN||C.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER)) */        16640000
                                                       /* EOC RC01349 */16650000
                                                       /* EOC RB01320 */16660000
     AND C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       16670000
     AND C.EFFECTIVE_DATE      <= B.END_DATE                            16680000
     AND C.END_DATE            >= B.EFFECTIVE_DATE                      16690000
     AND :WRK_RUN_DATE BETWEEN C.EFFECTIVE_DATE AND C.END_DATE          16700000
                                                                        16710000
     AND D.PRODUCT_TYPE        = A.PRODUCT_TYPE                         16720000
                                                       /* SOC RB01320 */16730000
   /*AND D.ORIGIN              = A.ORIGIN*/                             16740000
   /*AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER*/                    16750000
     AND D.ORIGIN              = A.REAL_ORIGIN         /* SOC RC01349 */16760000
     AND D.SEQUENCE_NUMBER     = A.REAL_SEQ_NUM                         16770000
  /* AND ((D.ORIGIN            = A.ORIGIN                               16780000
     AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER)                     16790000
     OR (D.PRODUCT_TYPE        = A.PRODUCT_TYPE                         16800000
     AND D.COUNTRY_NUMBER      = H.COUNTRY_NUMBER                       16810000
     AND A.ORIGIN              = H.DUMMY_ORIGIN                         16820000
     AND A.SEQUENCE_NUMBER     = H.DUMMY_SEQUENCE_NUM                   16830000
     AND D.ORIGIN||D.SEQUENCE_NUMBER = H.REAL_SERIAL_NUMBER))*/         16840000
                                                       /* EOC RC01349 */16850000
                                                       /* EOC RB01320 */16860000
     AND D.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       16870000
     AND D.EFFECTIVE_DATE      <= B.END_DATE                            16880000
     AND D.END_DATE            >= B.EFFECTIVE_DATE                      16890000
     AND D.EFFECTIVE_DATE      <= C.END_DATE                            16900000
     AND D.END_DATE            >= C.EFFECTIVE_DATE                      16910000
     AND :WRK_RUN_DATE BETWEEN D.EFFECTIVE_DATE AND D.END_DATE          16920000
                                                                        16930000
 /*ORDER BY B.PRODUCT_TYPE */                             /* RC01349 */ 16940000
                                                      /* SOC RB01320 */ 16950000
       /*  ,B.ORIGIN                                                    16960000
           ,B.SEQUENCE_NUMBER */                                        16970000
   ORDER BY A.PRODUCT_TYPE                            /* SOC RC01349 */ 16980000
           ,A.ORIGIN                                                    16990000
           ,A.SEQUENCE_NUMBER                                           17000000
   /*      ,ORIGIN                                                      17010000
           ,SEQ_NUM */                                /* EOC RC01349 */ 17020000
                                                      /* EOC RB01320 */ 17030000
           ,B.EFFECTIVE_DATE                                            17040000
           ,B.END_DATE                                                  17050000
           ,C.EFFECTIVE_DATE                                            17060000
           ,C.END_DATE                                                  17070000
           ,D.EFFECTIVE_DATE                                            17080000
           ,D.END_DATE                                                  17090000
   FOR FETCH ONLY                                         /* RC01219 */ 17100000
           ;                                                            17110000
                                                                        17120000
                                                                        17130000
1/********************************************************************/ 17140000
 /*                 S T A R T   P R O C E S S I N G                  */ 17150000
 /********************************************************************/ 17160000
                                                                        17170000
   CALL R900_INIT_PROGRAM;                                              17180000
                                                                        17190000
   CALL R800_INIT_PROCESSING;                                           17200000
                                                                        17210000
   DO WHILE (WRK_CTRYNO_NO <= COUNTRY_AREA.COUNT_CTRY);      /* MCO */  17220000
                                                                        17230000
     CALL R700_INIT_COUNTRY;                                            17240000
                                                                        17250000
     DO WHILE (SWITCH_EOC_INST_HW = FALSE |                             17260000
               SWITCH_EOC_PI_HW   = FALSE );                            17270000
                                                                        17280000
       CALL R701_INIT_HW_OCCURENCE;                                     17290000
                                                                        17302051
       IF SWITCH_EOC_PI_HW = FALSE &                                    17310000
          SK_PI_HW_1 < SK_CURRENT_HW_1           /* JUST PRIME INPUT */ 17320000
       THEN DO;                                                         17330000
         SWITCH_PI = TRUE;                                              17340000
         SWITCH_PI_ONLY  = TRUE;                 /* SOC  CEDS00000624 */17350000
         SWITCH_BAU_ONLY = FALSE;                                       17360000
         SWITCH_BAU_PI   = FALSE;                /* EOC  CEDS00000624 */17370000
         CALL R710_PROCESS_PI_HW;                                       17380000
       END;                                                             17390000
       ELSE DO;                                                         17400000
         IF SWITCH_EOC_INST_HW = FALSE               /* REGULAR CEDS */ 17410000
         THEN DO;                                                       17420000
           SWITCH_BAU = TRUE;                                           17430000
           SWITCH_BAU_ONLY = TRUE;               /* SOC  CEDS00000624 */17440000
           SWITCH_PI_ONLY  = FALSE;                                     17450000
           SWITCH_BAU_PI   = FALSE;              /* EOC  CEDS00000624 */17460000
           CALL R720_PROCESS_REGULAR_HW;                                17470000
         END;                                                           17480000
                                           /* POSSIBLY TOGETHER WITH */ 17490000
         IF SWITCH_EOC_PI_HW = FALSE &                                  17500000
            SK_PI_HW_1 = SK_CURRENT_HW_1              /* PRIME INPUT */ 17510000
         THEN DO;                                                       17520000
           SWITCH_PI = TRUE;                                            17530000
           SWITCH_BAU_PI   = TRUE;               /* SOC  CEDS00000624 */17540000
           SWITCH_BAU_ONLY = FALSE;                                     17550000
           SWITCH_PI_ONLY  = FALSE;              /* EOC  CEDS00000624 */17560000
           CALL R710_PROCESS_PI_HW;                                     17570000
         END;                                                           17580000
       END;                                                             17590000
                                                                        17600000
       CALL R740_FINISH_HW_OCCURENCE;                                   17610000
                                                      /* SOC RB01305 */ 17620000
       IF SWITCH_WRITE_RCBDTB1 THEN                                     17630000
         DO;                                                            17640000
           CALL R750_PROCESS_FUT_HW;          /* FILL FUTURE FIELDS  */ 17650000
                                                                        17660000
           CALL R763_UPDATE_RCBDTB1_FUT_REC;  /* UPDATE O/P RECORD   */ 17670000
                                                                        17680068
                                                 /* SOC CEDS00000814 */ 17680362
           IF SWITCH_PI_FUT1 = TRUE | SWITCH_PI_BAU_FUT1 = TRUE         17680454
           THEN DO;                                                     17680554
              CALL R769_UPDATE_USER_PI_FUT_REC;                         17681053
           END;                                                         17681153
           IF SWITCH_BAU_FUT1 = TRUE | SWITCH_PI_BAU_FUT1 = TRUE        17681254
           THEN DO;                                                     17681354
              CALL R770_UPDATE_USER_BAU_FUT_REC;                        17682056
           END;                                                         17683068
                                                 /* EOC CEDS00000814 */ 17684068
           CALL R621_PROCESS_USER_EXIT;                                 17690000
                                                                        17700000
           CALL R749_WRITE_RCBDTB1;           /* WRITE RECORD TO O/P */ 17710000
         END;                                                           17720000
                                                      /* EOC RB01305 */ 17730000
     END;                                      /* WHILE HW PRODUCTS  */ 17740000
                                                                        17750000
     CALL R799_END_COUNTRY;                                             17760000
   END;                                                                 17770000
                                                                        17780000
   CALL R899_END_PROCESSING;                                            17790000
                                                                        17800000
   CALL R999_END_PROGRAM;                                               17810000
                                                                        17820000
1/********************************************************************/ 17830000
 /*                                                                  */ 17840000
 /* MODULE NAME      : R001_LOCK_TABLES                              */ 17850000
 /*                                                                  */ 17860000
 /* DESCRIPTION      :                                               */ 17870000
 /*                                                                  */ 17880000
 /********************************************************************/ 17890000
 R001_LOCK_TABLES: PROC;                                                17900000
                                                                        17910000
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 17920000
                                                                        17930000
 /********************************************************************/ 17940000
                                                                        17950000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0051_PI_HW_PR';                     17960000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 17970000
                                                                        17980000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      17990000
               PTR_RETURN_AREA_BB,                                      18000000
               PTR_INT_AREA);                                           18010000
                                                                        18020000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18030000
   WHEN (0);                                                            18040000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18050000
     DO;                                                                18060000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#001');                      18070000
     END;                                                               18080000
   OTHERWISE                                                            18090000
     DO;                                                                18100000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18110000
                                 'DB2',                                 18120000
                                 '#002');                               18130000
     END;                                                               18140000
 END;                                                                   18150000
                                                                        18160000
 /********************************************************************/ 18170000
                                                       /* SOC PTM1290 */18180000
 PARM_RCB024M.VIEW_NAME      = 'RCBV0110_HW_STATUS';                    18190000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18200000
                                                                        18210000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18220000
               PTR_RETURN_AREA_BB,                                      18230000
               PTR_INT_AREA);                                           18240000
                                                                        18250000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18260000
   WHEN (0);                                                            18270000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18280000
     DO;                                                                18290000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#003');                      18300000
     END;                                                               18310000
   OTHERWISE                                                            18320000
     DO;                                                                18330000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18340000
                                 'DB2',                                 18350000
                                 '#004');                               18360000
     END;                                                               18370000
 END;                                                                   18380000
                                                       /* EOC PTM1290 */18390000
 /********************************************************************/ 18400000
                                                                        18410000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0170_OU_HW';                        18420000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18430000
                                                                        18440000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18450000
               PTR_RETURN_AREA_BB,                                      18460000
               PTR_INT_AREA);                                           18470000
                                                                        18480000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18490000
   WHEN (0);                                                            18500000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18510000
     DO;                                                                18520000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#005');                      18530000
     END;                                                               18540000
   OTHERWISE                                                            18550000
     DO;                                                                18560000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18570000
                                 'DB2',                                 18580000
                                 '#006');                               18590000
     END;                                                               18600000
 END;                                                                   18610000
                                                                        18620000
 /********************************************************************/ 18630000
                                                                        18640000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      18650000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18660000
                                                                        18670000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18680000
               PTR_RETURN_AREA_BB,                                      18690000
               PTR_INT_AREA);                                           18700000
                                                                        18710000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18720000
   WHEN (0);                                                            18730000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18740000
     DO;                                                                18750000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#007');                      18760000
     END;                                                               18770000
   OTHERWISE                                                            18780000
     DO;                                                                18790000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            18800000
                                 'DB2',                                 18810000
                                 '#008');                               18820000
     END;                                                               18830000
 END;                                                                   18840000
                                                                        18850000
 /********************************************************************/ 18860000
                                                                        18870000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0220_SUPPL_CTR';                    18880000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 18890000
                                                                        18900000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      18910000
               PTR_RETURN_AREA_BB,                                      18920000
               PTR_INT_AREA);                                           18930000
                                                                        18940000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    18950000
   WHEN (0);                                                            18960000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 18970000
     DO;                                                                18980000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#009');                      18990000
     END;                                                               19000000
   OTHERWISE                                                            19010000
     DO;                                                                19020000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19030000
                                 'DB2',                                 19040000
                                 '#010');                               19050000
     END;                                                               19060000
 END;                                                                   19070000
                                                                        19080000
 /********************************************************************/ 19090000
                                                                        19100000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0240_SERV_CTR';                     19110000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19120000
                                                                        19130000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19140000
               PTR_RETURN_AREA_BB,                                      19150000
               PTR_INT_AREA);                                           19160000
                                                                        19170000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19180000
   WHEN (0);                                                            19190000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19200000
     DO;                                                                19210000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#011');                      19220000
     END;                                                               19230000
   OTHERWISE                                                            19240000
     DO;                                                                19250000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19260000
                                 'DB2',                                 19270000
                                 '#012');                               19280000
     END;                                                               19290000
 END;                                                                   19300000
                                                                        19310000
 /********************************************************************/ 19320000
                                                                        19330000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0241_PI_CTR';                       19340000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19350000
                                                                        19360000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19370000
               PTR_RETURN_AREA_BB,                                      19380000
               PTR_INT_AREA);                                           19390000
                                                                        19400000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19410000
   WHEN (0);                                                            19420000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19430000
     DO;                                                                19440000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#013');                      19450000
     END;                                                               19460000
   OTHERWISE                                                            19470000
     DO;                                                                19480000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19490000
                                 'DB2',                                 19500000
                                 '#014');                               19510000
     END;                                                               19520000
 END;                                                                   19530000
                                                                        19540000
 /********************************************************************/ 19550000
                                                                        19560000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0300_HW_REAL';                      19570000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19580000
                                                                        19590000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19600000
               PTR_RETURN_AREA_BB,                                      19610000
               PTR_INT_AREA);                                           19620000
                                                                        19630000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19640000
   WHEN (0);                                                            19650000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19660000
     DO;                                                                19670000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#015');                      19680000
     END;                                                               19690000
   OTHERWISE                                                            19700000
     DO;                                                                19710000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19720000
                                 'DB2',                                 19730000
                                 '#016');                               19740000
     END;                                                               19750000
 END;                                                                   19760000
                                                                        19770000
 /********************************************************************/ 19780000
                                                      /* SOC RC01234 */ 19790000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0380_HW_PR_MOD';                    19800000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 19810000
                                                                        19820000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      19830000
               PTR_RETURN_AREA_BB,                                      19840000
               PTR_INT_AREA);                                           19850000
                                                                        19860000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    19870000
   WHEN (0);                                                            19880000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 19890000
     DO;                                                                19900000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#017');                      19910000
     END;                                                               19920000
   OTHERWISE                                                            19930000
     DO;                                                                19940000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            19950000
                                 'DB2',                                 19960000
                                 '#018');                               19970000
     END;                                                               19980000
 END;                                                                   19990000
                                                      /* EOC RC01234 */ 20000000
 /********************************************************************/ 20010000
                                                                        20020000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0470_SERV_COND';                    20030000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20040000
                                                                        20050000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20060000
               PTR_RETURN_AREA_BB,                                      20070000
               PTR_INT_AREA);                                           20080000
                                                                        20090000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20100000
   WHEN (0);                                                            20110000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20120000
     DO;                                                                20130000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#019');                      20140000
     END;                                                               20150000
   OTHERWISE                                                            20160000
     DO;                                                                20170000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20180000
                                 'DB2',                                 20190000
                                 '#020');                               20200000
     END;                                                               20210000
 END;                                                                   20220000
                                                                        20230000
 /********************************************************************/ 20240000
                                                                        20250000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0640_TRANS_SVT';                    20260000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20270000
                                                                        20280000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20290000
               PTR_RETURN_AREA_BB,                                      20300000
               PTR_INT_AREA);                                           20310000
                                                                        20320000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20330000
   WHEN (0);                                                            20340000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20350000
     DO;                                                                20360000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#021');                      20370000
     END;                                                               20380000
   OTHERWISE                                                            20390000
     DO;                                                                20400000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20410000
                                 'DB2',                                 20420000
                                 '#022');                               20430000
     END;                                                               20440000
 END;                                                                   20450000
                                                                        20460000
 /********************************************************************/ 20470000
 /* RA01239 ADD LOCK ON TABLE 30 */                                     20480000
                                                                        20490000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0030_CONTRACT';                     20500000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20510000
                                                                        20520000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20530000
               PTR_RETURN_AREA_BB,                                      20540000
               PTR_INT_AREA);                                           20550000
                                                                        20560000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20570000
   WHEN (0);                                                            20580000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20590000
     DO;                                                                20600000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#023');                      20610000
     END;                                                               20620000
   OTHERWISE                                                            20630000
     DO;                                                                20640000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20650000
                                 'DB2',                                 20660000
                                 '#024');                               20670000
     END;                                                               20680000
 END;                                                                   20690000
 /* EOC RA01239 ADD LOCK ON TABLE 30 */                                 20700000
 /********************************************************************/ 20710000
                                                                        20720000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0750_BMT_HW';                       20730000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 20740000
                                                                        20750000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      20760000
               PTR_RETURN_AREA_BB,                                      20770000
               PTR_INT_AREA);                                           20780000
                                                                        20790000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    20800000
   WHEN (0);                                                            20810000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 20820000
     DO;                                                                20830000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#025');                      20840000
     END;                                                               20850000
   OTHERWISE                                                            20860000
     DO;                                                                20870000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            20880000
                                 'DB2',                                 20890000
                                 '#026');                               20900000
     END;                                                               20910000
 END;                                                 /* EOC RC01219 */ 20920000
                                                                        20930000
 END R001_LOCK_TABLES;                                                  20940000
                                                                        20950000
1/********************************************************************/ 20960000
 /*                                                   /* SOC RC01234 */ 20970000
 /* MODULE NAME      : R011_TRANS_TPMNT                              */ 20980000
 /*                                                                  */ 20990000
 /* DESCRIPTION      : TRANSLATE TYPE_OF_MAINT TO MACHINE STATUS     */ 21000000
 /*                                                                  */ 21010000
 /********************************************************************/ 21020000
 R011_TRANS_TPMNT : PROC (TYPE_OF_MAINT)                                21030000
                       RETURNS (CHAR(01));                              21040000
 DCL TYPE_OF_MAINT         CHAR(01);                                    21050000
 DCL MA_ST                 CHAR(01);                                    21060000
 DCL I                     FIXED BIN(15);                               21070000
                                                                        21080000
 MA_ST           = '';                                                  21090000
                                                                        21100000
 DO I = 1 TO PARM_RCB067.NUMBER_OF_TPMNT;                               21110000
   IF TYPE_OF_MAINT = PARM_RCB067.TPMNT_TABLE.TYPE_MNT(I)               21120000
   THEN                                                                 21130000
     DO;                                                                21140000
       MA_ST  = PARM_RCB067.TPMNT_TABLE.MA_ST(I);                       21150000
       I = 999;                                                         21160000
     END;                                                               21170000
 END;                                                                   21180000
                                                      /* SOC RB01298 */ 21190000
 /*                                                 /* SOC : RB01281 */ 21200000
 /*                                                                     21210000
 IF (FLEXIBLE_WARRANTY_BAU | FLEXIBLE_WARRANTY_PI) THEN                 21220000
  DO;                                                                   21230000
   IF F_WARRANTY_MA_STATUS THEN                                         21240000
     DO;                                                                21250000
      IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP64.F_WARRANTY_MACHINE,1,1)     21260000
      THEN                                                              21270000
        DO;                                                             21280000
         MA_ST = SUBSTR(PARM_RCBP64.F_WARRANTY_MACHINE,2,1);            21290000
        END;                                                            21300000
      ELSE                                                              21310000
        DO;                                                             21320000
         IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP63.F_WARRANTY_MACHINE,1,1)  21330000
         THEN                                                           21340000
         DO;                                                            21350000
         MA_ST = SUBSTR(PARM_RCBP63.F_WARRANTY_MACHINE,2,1);            21360000
         END;                                                           21370000
        END;                                                            21380000
     END;                                                               21390000
  END;                                                                  21400000
 /*                                                 /* EOC : RB01281 */ 21410000
 /* WHEN MACHINE IS UNDER FLEXIBLE WARRANTY OR HARDBUNDLE MAINTENANCE*/ 21420000
 /* GET MACHINE STATUS FROM COUNTRY LEVEL PARAMETER RCB071           */ 21430000
                                                      /* SOC RB01305 */ 21440000
                                                                        21450000
 /*IF (SW_FW_BAU | SW_HB_BAU | SW_FW_PI | SW_HB_PI | SW_FW_BAU_FUT | */ 21460000
 /*    SW_HB_BAU_FUT)                                                */ 21470000
                                                                        21480000
 IF (SW_FW_BAU | SW_HB_BAU | SW_FW_PI | SW_HB_PI |                      21490000
     SWITCH_FW_BAU_FUT | SWITCH_HB_BAU_FUT |                            21500000
     SW_FW_PI_FUT | SW_HB_PI_FUT                   )                    21510000
                                                      /* EOC RB01305 */ 21520000
 THEN                                                                   21530000
   DO;                                                                  21540000
     IF SW_FW_HB_MS                                                     21550000
     THEN                                                               21560000
       DO I = 1 TO PARM_RCBP71S.NUMBER_OF_TPMNT;                        21570000
        IF TYPE_OF_MAINT = PARM_RCBP71S.TPMNT_TABLE.TYPE_MNT (I)        21580000
        THEN                                                            21590000
          DO;                                                           21600000
            MA_ST = PARM_RCBP71S.TPMNT_TABLE.MA_ST (I);                 21610000
            I = 999;                                                    21620000
          END;                                                          21630000
       END;                                                             21640000
   END;                                                                 21650000
                                                      /* EOC RB01298 */ 21660000
 RETURN(MA_ST);                                                         21670000
                                                                        21680000
 END R011_TRANS_TPMNT;                                /* EOC RC01234 */ 21690000
                                                      /* SOC RB01298 */ 21700000
1/********************************************************************/ 21710000
 /*                                                                  */ 21720000
 /* MODULE NAME      : R014_DATE_CALC                        RB01298 */ 21730000
 /*                                                                  */ 21740000
 /* DESCRIPTION      : CALCULATE THE DATES                           */ 21750000
 /*                                                                  */ 21760000
 /********************************************************************/ 21770000
 R014_DATE_CALC: PROC (DB2_DATE_IN                                      21780000
                      ,WRK_AMOUNT)                                      21790000
                       RETURNS (CHAR(10));                              21800000
                                                                        21810000
 DCL DB2_DATE_IN         CHAR(10);                                      21820000
 DCL WRK_AMOUNT          FIXED BIN (31);                                21830000
                                                                        21840000
 IF DB2_DATE_IN = '9999-12-31' THEN   /* DO NOT CHANGE OPEN END DATE */ 21850000
     RETURN(DB2_DATE_IN);                                               21860000
 ELSE                                                                   21870000
   DO;                                                                  21880000
     PARM_DATE_CALC = '';                                               21890000
     PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                             21900000
     PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                             21910000
     PARM_DATE_CALC.WD_FUNCTION    = 'C';                               21920000
     PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                               21930000
     PARM_DATE_CALC.WD_PERIOD      = WRK_AMOUNT;                        21940000
     PARM_DATE_CALC.WD_IN_DATE     = DB2_DATE_IN;                       21950000
                                                                        21960000
     CALL RCB004M (ADDR(PARM_DATE_CALC));                               21970000
                                                                        21980000
     IF PARM_DATE_CALC.WD_STATUS ¬= '' THEN                             21990000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#056');                      22000000
                                                                        22010000
     RETURN(PARM_DATE_CALC.WD_OUT_DATE);                                22020000
   END;                                                                 22030000
                                                                        22040000
 END R014_DATE_CALC;                                  /* EOC RB01298 */ 22050000
                                                                        22060000
1/********************************************************************/ 22070000
 /*                                                                  */ 22080000
 /* MODULE NAME      : R020_PLANCODE_1                               */ 22090000
 /*                                                                  */ 22100000
 /* DESCRIPTION      : DETERMINE PLANCODE FOR WEEKDAYS               */ 22110000
 /*                                                                  */ 22120000
 /********************************************************************/ 22130000
 R020_PLANCODE_1: PROC (COVERAGE_START,COVERAGE_END,PLAN_CODE);         22140000
                                                                        22150000
   DCL COVERAGE_START  CHAR(8);                                         22160000
   DCL COVERAGE_END    CHAR(8);                                         22170000
   DCL PLAN_CODE       CHAR(1);                                         22180000
                                                                        22190000
   DCL 1 WRK_COV_START BASED (ADDR(COVERAGE_START)),                    22200000
         3 HOURS       PIC '99',                                        22210000
         3 FILLER_G1   CHAR (1),                                        22220000
         3 MINUTES     PIC '99',                                        22230000
         3 FILLER_G2   CHAR (3);                                        22240000
                                                                        22250000
   DCL 1 WRK_COV_END   BASED (ADDR(COVERAGE_END)),                      22260000
         3 HOURS       PIC '99',                                        22270000
         3 FILLER_G1   CHAR (1),                                        22280000
         3 MINUTES     PIC '99',                                        22290000
         3 FILLER_G2   CHAR (3);                                        22300000
                                                                        22310000
   DCL WRK_HOURS_DELTA FIXED BIN (31);                                  22320000
                                                                        22330000
   PLAN_CODE  = '';                                                     22340000
                                                                        22350000
   IF (SUBSTR(COVERAGE_START,1,2) ||                                    22360000
       SUBSTR(COVERAGE_START,4,2) = '0000')  &                          22370000
      (SUBSTR(COVERAGE_END,1,2) ||                                      22380000
       SUBSTR(COVERAGE_END,4,2) = '0000')                               22390000
   THEN DO;                                                             22400000
     PLAN_CODE  = ' ';              /* NO COVERAGE AT ALL */            22410000
   END;                                                                 22420000
   ELSE DO;                                                             22430000
     IF COVERAGE_START ¬= '' |                                          22440000
        COVERAGE_END   ¬= ''                                            22450000
     THEN DO;                                                           22460000
       IF COVERAGE_START >= COVERAGE_END                                22470000
       THEN DO;                                                         22480000
         WRK_HOURS_DELTA = (24 + WRK_COV_END.HOURS)                     22490000
                           - WRK_COV_START.HOURS;                       22500000
       END;                                                             22510000
       ELSE DO;                                                         22520000
         WRK_HOURS_DELTA = WRK_COV_END.HOURS - WRK_COV_START.HOURS;     22530000
       END;                                                             22540000
                                                                        22550000
       IF WRK_COV_START.MINUTES > WRK_COV_END.MINUTES                   22560000
       THEN DO;                                                         22570000
         WRK_HOURS_DELTA = WRK_HOURS_DELTA - 1;                         22580000
       END;                                                             22590000
                                                                        22600000
       SELECT;                                                          22610000
         WHEN (0 <= WRK_HOURS_DELTA &                                   22620000
               WRK_HOURS_DELTA < 7)                                     22630000
         DO;                                                            22640000
           PLAN_CODE = '1';                                             22650000
         END;                                                           22660000
         WHEN (7 <= WRK_HOURS_DELTA &                                   22670000
               WRK_HOURS_DELTA < 10)                                    22680000
         DO;                                                            22690000
           PLAN_CODE = '0';                                             22700000
         END;                                                           22710000
         WHEN (10 <= WRK_HOURS_DELTA &                                  22720000
               WRK_HOURS_DELTA < 14)                                    22730000
         DO;                                                            22740000
           PLAN_CODE = '2';                                             22750000
         END;                                                           22760000
         WHEN (14 <= WRK_HOURS_DELTA &                                  22770000
               WRK_HOURS_DELTA < 19)                                    22780000
         DO;                                                            22790000
           PLAN_CODE = '3';                                             22800000
         END;                                                           22810000
         WHEN (19 <= WRK_HOURS_DELTA &                                  22820000
               WRK_HOURS_DELTA < 22)                                    22830000
         DO;                                                            22840000
           PLAN_CODE = '4';                                             22850000
         END;                                                           22860000
         OTHERWISE DO;                                                  22870000
           PLAN_CODE = '5';                                             22880000
         END;                                                           22890000
       END;                                                             22900000
     END;                                                               22910000
   END;                                                                 22920000
                                                                        22930000
 END R020_PLANCODE_1;                                                   22940000
1/********************************************************************/ 22950000
 /*                                                                  */ 22960000
 /* MODULE NAME      : R021_PLANCODE_2                               */ 22970000
 /*                                                                  */ 22980000
 /* DESCRIPTION      : DETERMINE STARTTIME AND PLANCODE FOR          */ 22990000
 /*                    WEEKEND-DAYS                                  */ 23000000
 /*                                                                  */ 23010000
 /********************************************************************/ 23020000
 R021_PLANCODE_2: PROC (COVERAGE_START,COVERAGE_END,PLAN_CODE);         23030000
                                                                        23040000
   DCL COVERAGE_START  CHAR(8);                                         23050000
   DCL COVERAGE_END    CHAR(8);                                         23060000
   DCL PLAN_CODE       CHAR(1);                                         23070000
                                                                        23080000
   DCL 1 WRK_COV_START BASED (ADDR(COVERAGE_START)),                    23090000
         3 HOURS       PIC '99',                                        23100000
         3 FILLER_G1   CHAR (1),                                        23110000
         3 MINUTES     PIC '99',                                        23120000
         3 FILLER_G2   CHAR (3);                                        23130000
                                                                        23140000
   DCL 1 WRK_COV_END   BASED (ADDR(COVERAGE_END)),                      23150000
         3 HOURS       PIC '99',                                        23160000
         3 FILLER_G1   CHAR (1),                                        23170000
         3 MINUTES     PIC '99',                                        23180000
         3 FILLER_G2   CHAR (3);                                        23190000
                                                                        23200000
   DCL WRK_HOURS_DELTA FIXED BIN (31);                                  23210000
                                                                        23220000
   PLAN_CODE  = '';                                                     23230000
                                                                        23240000
   IF (SUBSTR(COVERAGE_START,1,2) ||                                    23250000
       SUBSTR(COVERAGE_START,4,2) = '0000')  &                          23260000
      (SUBSTR(COVERAGE_END,1,2)   ||                                    23270000
       SUBSTR(COVERAGE_END,4,2) = '0000')                               23280000
   THEN DO;                                                             23290000
     PLAN_CODE  = ' ';                        /* NO COVERAGE AT ALL */  23300000
   END;                                                                 23310000
   ELSE DO;                                                             23320000
     IF COVERAGE_START ¬= '' |                                          23330000
        COVERAGE_END   ¬= ''                                            23340000
     THEN DO;                                                           23350000
       IF COVERAGE_START >= COVERAGE_END                                23360000
       THEN DO;                                                         23370000
         WRK_HOURS_DELTA = (24 + WRK_COV_END.HOURS)                     23380000
                           - WRK_COV_START.HOURS;                       23390000
       END;                                                             23400000
       ELSE DO;                                                         23410000
         WRK_HOURS_DELTA = WRK_COV_END.HOURS - WRK_COV_START.HOURS;     23420000
       END;                                                             23430000
                                                                        23440000
       IF WRK_COV_START.MINUTES > WRK_COV_END.MINUTES                   23450000
       THEN DO;                                                         23460000
         WRK_HOURS_DELTA = WRK_HOURS_DELTA - 1;                         23470000
       END;                                                             23480000
                                                                        23490000
       SELECT;                                                          23500000
         WHEN (0 <= WRK_HOURS_DELTA &                                   23510000
               WRK_HOURS_DELTA < 10)                                    23520000
         DO;                                                            23530000
           PLAN_CODE = '1';                                             23540000
         END;                                                           23550000
         WHEN (10 <= WRK_HOURS_DELTA &                                  23560000
               WRK_HOURS_DELTA < 14)                                    23570000
         DO;                                                            23580000
           PLAN_CODE = '2';                                             23590000
         END;                                                           23600000
         WHEN (14 <= WRK_HOURS_DELTA &                                  23610000
               WRK_HOURS_DELTA < 19)                                    23620000
         DO;                                                            23630000
           PLAN_CODE = '3';                                             23640000
         END;                                                           23650000
         WHEN (19 <= WRK_HOURS_DELTA &                                  23660000
               WRK_HOURS_DELTA < 22)                                    23670000
         DO;                                                            23680000
           PLAN_CODE = '4';                                             23690000
         END;                                                           23700000
         OTHERWISE DO;                                                  23710000
           PLAN_CODE = '5';                                             23720000
         END;                                                           23730000
       END;                                                             23740000
     END;                                                               23750000
   END;                                                                 23760000
                                                                        23770000
 END R021_PLANCODE_2;                                                   23780000
 /*********************************************************************/23790000
 /* THIS PROC IS COMMENTED OUT AS PART OF PCEDSP-0064     SOC RC01313 */23800000
 /*                                                       SOC RC01311 */23810000
 /* MODULE NAME      :  R350_RETR_CU_ENGG_OU                          */23820000
 /*                                                                   */23830000
 /* DESCRIPTION      : RETRIEVE CU ENGINEERING OU CODE FROM TABLE     */23840000
 /*                    RCBT0350_CUST_MOD WHEN OU CODE COULD NOT BE    */23850000
 /*                    DETERMINED FROM TABLE RCBT0170_OU_HW           */23860000
 /*                                                                   */23870000
 /*********************************************************************/23880000
                                                     /* SOC RC01313   */23890000
 /*R350_RETR_CU_ENGG_OU: PROC(CUSTOMER_NO);                           */23900000
 /*                                                                   */23910000
 /*TB_RCBV350 = '';                                                   */23920000
 /*DCL CUSTOMER_NO CHAR(08);                                          */23930000
 /*                                                                   */23940000
 /*                                     /* RETRIEVE CU ENGINEERING OU */23950000
 /*EXEC SQL                                                           */23960000
 /*SELECT CU_ENGINEERING_OU                             CEDS00000548  */23970000
 /*SELECT T350.CU_ENGINEERING_OU                     /* CEDS00000548  */23980000
 /*INTO :TB_RCBV350.CU_ENGINEERING_OU      :WRK_INDNULL               */23990000
 /*FROM RCBV0350_CUST_MOD                            SOC CEDS00000548 */24000000
 /*WHERE COUNTRY_NUMBER      = :WRK_CTRYNO                            */24010000
 /*AND CUSTOMER_NUMBER       = :CUSTOMER_NO                           */24020000
 /*AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                         */24030000
 /*                    AND END_DATE                                   */24040000
 /*FROM RCBV0350_CUST_MOD T350,                                       */24050000
 /*     RCBV0040_OU       T40                                         */24060000
 /*WHERE T350.COUNTRY_NUMBER = :WRK_CTRYNO                            */24070000
 /*AND T350.CUSTOMER_NUMBER  = :CUSTOMER_NO                           */24080000
 /*AND :WRK_RUN_DATE  BETWEEN T350.EFFECTIVE_DATE                     */24090000
 /*                   AND T350.END_DATE                               */24100000
 /*AND T40.COUNTRY_NUMBER   = T350.COUNTRY_NUMBER                     */24110000
 /*AND T40.OU_CODE          = T350.CU_ENGINEERING_OU                  */24120000
 /*AND :WRK_RUN_DATE  BETWEEN T40.EFFECTIVE_DATE                      */24130000
 /*                   AND T40.END_DATE           /* EOC CEDS00000548  */24140000
 /*;                                                                  */24150000
 /*SELECT(SQLCODE);                                                   */24160000
 /*WHEN(0);                                                           */24170000
 /*WHEN(100);                                                         */24180000
 /*OTHERWISE                                                          */24190000
 /*DO;                                                                */24200000
 /*  CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#076');                  */24210000
 /*END;                                                               */24220000
 /*END;                                                               */24230000
 /*END R350_RETR_CU_ENGG_OU;                           /* EOC RC01311 */24240000
                                                       /* EOC RC01313 */24250000
1/*********************************************************************/24260000
 /*                                                                   */24270000
 /* MODULE NAME      :  R402_FILL_SERV_CTR_PERIOD                     */24280000
 /*                                                                   */24290000
 /* DESCRIPTION      :                                                */24300000
 /*                                                                   */24310000
 /*********************************************************************/24320000
                                                      /* SOC RB01305 */ 24330000
 /*R402_FILL_SERV_CTR_PERIOD: PROC (PARM_EFF_DATE,PARM_END_DATE); */    24340000
 R402_FILL_SERV_CTR_PERIOD: PROC;                                       24350000
                                                                        24360000
 /*DCL PARM_EFF_DATE CHAR (10);                                         24370000
 /*DCL PARM_END_DATE CHAR (10);                       /* EOC RB01305 */ 24380000
                                                                        24390000
   IF WRK_V240_IND34  ¬= -1                             /* CHECK SLC */ 24400000
   THEN DO;                                                             24410000
                                                      /* SOC RC01234 */ 24420000
     FILE_RCBDTB1.SERVICE_LVL_CODE_1 = TB_RCBV240.SERVICE_LVL_CODE;     24430000
                                                      /* EOC RC01234 */ 24440000
     WRK_SERVICE_LVL_CODE = TB_RCBV240.SERVICE_LVL_CODE;                24450000
     CALL R470_RETRIEVE_RCBV0470;                                       24460000
                                                                        24470000
     IF SW_SLC_FOUND            /* SAVE THE ROW IF NEW ROW RETRIEVED */ 24480000
     THEN DO;                                                           24490000
       SAVE_RCBV470_1   = TB_RCBV470;                                   24500000
       SAVE_RCBV470_I_1 = TB_RCBV470_I;                                 24510000
     END;                                                               24520000
   END;                                                                 24530000
                                                       /* SOC RB01305 */24540000
 /*FILE_RCBDTB1.SERVICE_START_DATE = PARM_EFF_DATE;     */              24550000
 /*FILE_RCBDTB1.SERVICE_END_DATE   = PARM_END_DATE;     */              24560000
   FILE_RCBDTB1.SERVICE_START_DATE = TB_RCBV240.EFFECTIVE_DATE;         24570000
   FILE_RCBDTB1.SERVICE_END_DATE   = TB_RCBV240.END_DATE;               24580000
                                                       /* EOC RB01305 */24590000
   WRK_PERIOD_HVP_QUANTITY         = TB_RCBV240.HVP_QUANTITY;           24600000
   FILE_RCBDTB1.CONTRACT_NUMBER    = TB_RCBV240.CONTRACT_NUMBER;        24610000
                                                       /* SOC RB01305 */24620000
   FILE_RCBDTB1.SERVICE_MODULE(1) = TB_RCBV240.SERVICE_MODULE_1;        24630000
   FILE_RCBDTB1.SERVICE_MODULE(2) = TB_RCBV240.SERVICE_MODULE_2;        24640000
   FILE_RCBDTB1.SERVICE_MODULE(3) = TB_RCBV240.SERVICE_MODULE_3;        24650000
   FILE_RCBDTB1.SERVICE_MODULE(4) = TB_RCBV240.SERVICE_MODULE_4;        24660000
   FILE_RCBDTB1.SERVICE_MODULE(5) = TB_RCBV240.SERVICE_MODULE_5;        24670000
                                                       /* EOC RB01305 */24680000
   FILE_RCBDTB1.SERVICE_TYPE_NI    = '?';                               24690000
                                                                        24700000
   /* IF ALL THE COVERAGE-HOURS FROM T240 ARE DB2NULL, TAKE THE */      24710000
   /* COVERAGE-HOURS FROM T470.                                 */      24720000
   IF (WRK_V240_IND19              = -1 &                               24730000
       WRK_V240_IND20              = -1 &                               24740000
       WRK_V240_IND21              = -1 &                               24750000
       WRK_V240_IND22              = -1 &                               24760000
       WRK_V240_IND23              = -1 &                               24770000
       WRK_V240_IND24              = -1 &                               24780000
       WRK_V240_IND25              = -1 &                               24790000
       WRK_V240_IND26              = -1 &                               24800000
       WRK_V240_IND27              = -1 &                               24810000
       WRK_V240_IND28              = -1 &                               24820000
       WRK_V240_IND29              = -1 &                               24830000
       WRK_V240_IND30              = -1 &                               24840000
       WRK_V240_IND31              = -1 &                               24850000
       WRK_V240_IND32              = -1) |                              24860000
      (TB_RCBV240.COVERAGE_START_1 = '00.00.00' &                       24870000
       TB_RCBV240.COVERAGE_START_2 = '00.00.00' &                       24880000
       TB_RCBV240.COVERAGE_START_3 = '00.00.00' &                       24890000
       TB_RCBV240.COVERAGE_START_4 = '00.00.00' &                       24900000
       TB_RCBV240.COVERAGE_START_5 = '00.00.00' &                       24910000
       TB_RCBV240.COVERAGE_START_6 = '00.00.00' &                       24920000
       TB_RCBV240.COVERAGE_START_7 = '00.00.00' &                       24930000
       TB_RCBV240.COVERAGE_END_1   = '00.00.00' &                       24940000
       TB_RCBV240.COVERAGE_END_2   = '00.00.00' &                       24950000
       TB_RCBV240.COVERAGE_END_3   = '00.00.00' &                       24960000
       TB_RCBV240.COVERAGE_END_4   = '00.00.00' &                       24970000
       TB_RCBV240.COVERAGE_END_5   = '00.00.00' &                       24980000
       TB_RCBV240.COVERAGE_END_6   = '00.00.00' &                       24990000
       TB_RCBV240.COVERAGE_END_7   = '00.00.00')                        25000000
   THEN DO;                                                             25010000
     IF ((WRK_V240_IND34 ¬= -1) & SW_SLC_FOUND)                         25020000
     THEN DO;                                                           25030000
       FILE_RCBDTB1.COVERAGE_START_1 = TB_RCBV470.COVERAGE_START_1;     25040000
       FILE_RCBDTB1.COVERAGE_START_2 = TB_RCBV470.COVERAGE_START_2;     25050000
       FILE_RCBDTB1.COVERAGE_START_3 = TB_RCBV470.COVERAGE_START_3;     25060000
       FILE_RCBDTB1.COVERAGE_START_4 = TB_RCBV470.COVERAGE_START_4;     25070000
       FILE_RCBDTB1.COVERAGE_START_5 = TB_RCBV470.COVERAGE_START_5;     25080000
       FILE_RCBDTB1.COVERAGE_START_6 = TB_RCBV470.COVERAGE_START_6;     25090000
       FILE_RCBDTB1.COVERAGE_START_7 = TB_RCBV470.COVERAGE_START_7;     25100000
       FILE_RCBDTB1.COVERAGE_END_1   = TB_RCBV470.COVERAGE_END_1;       25110000
       FILE_RCBDTB1.COVERAGE_END_2   = TB_RCBV470.COVERAGE_END_2;       25120000
       FILE_RCBDTB1.COVERAGE_END_3   = TB_RCBV470.COVERAGE_END_3;       25130000
       FILE_RCBDTB1.COVERAGE_END_4   = TB_RCBV470.COVERAGE_END_4;       25140000
       FILE_RCBDTB1.COVERAGE_END_5   = TB_RCBV470.COVERAGE_END_5;       25150000
       FILE_RCBDTB1.COVERAGE_END_6   = TB_RCBV470.COVERAGE_END_6;       25160000
       FILE_RCBDTB1.COVERAGE_END_7   = TB_RCBV470.COVERAGE_END_7;       25170000
     END;                                                               25180000
   END;                                                                 25190000
   ELSE DO;                                                             25200000
     FILE_RCBDTB1.COVERAGE_START_1 = TB_RCBV240.COVERAGE_START_1;       25210000
     FILE_RCBDTB1.COVERAGE_START_2 = TB_RCBV240.COVERAGE_START_2;       25220000
     FILE_RCBDTB1.COVERAGE_START_3 = TB_RCBV240.COVERAGE_START_3;       25230000
     FILE_RCBDTB1.COVERAGE_START_4 = TB_RCBV240.COVERAGE_START_4;       25240000
     FILE_RCBDTB1.COVERAGE_START_5 = TB_RCBV240.COVERAGE_START_5;       25250000
     FILE_RCBDTB1.COVERAGE_START_6 = TB_RCBV240.COVERAGE_START_6;       25260000
     FILE_RCBDTB1.COVERAGE_START_7 = TB_RCBV240.COVERAGE_START_7;       25270000
     FILE_RCBDTB1.COVERAGE_END_1   = TB_RCBV240.COVERAGE_END_1;         25280000
     FILE_RCBDTB1.COVERAGE_END_2   = TB_RCBV240.COVERAGE_END_2;         25290000
     FILE_RCBDTB1.COVERAGE_END_3   = TB_RCBV240.COVERAGE_END_3;         25300000
     FILE_RCBDTB1.COVERAGE_END_4   = TB_RCBV240.COVERAGE_END_4;         25310000
     FILE_RCBDTB1.COVERAGE_END_5   = TB_RCBV240.COVERAGE_END_5;         25320000
     FILE_RCBDTB1.COVERAGE_END_6   = TB_RCBV240.COVERAGE_END_6;         25330000
     FILE_RCBDTB1.COVERAGE_END_7   = TB_RCBV240.COVERAGE_END_7;         25340000
   END;                                                                 25350000
                                                                        25360000
                                  /* PASS SERVICE START AND STOP DATE */25370000
                                  /* FROM TABLE RCBT0240_SERV_CTR     */25380000
   IF SWITCH_USER_EXIT = TRUE     /* AS EXTRA INFO TO USER EXIT       */25390000
   THEN DO;                                                             25400000
     IF WRK_V240_IND07 ¬= -1                                            25410000
     THEN DO;                                                           25420000
       USER_EXTRA_INFO.SERVICE_START_DATE =                             25430000
                                      TB_RCBV240.SERVICE_START_DATE;    25440000
     END;                                                               25450000
     IF WRK_V240_IND08 ¬= -1                                            25460000
     THEN DO;                                                           25470000
       USER_EXTRA_INFO.SERVICE_STOP_DATE =                              25480000
                                      TB_RCBV240.SERVICE_STOP_DATE;     25490000
     END;                                                               25500000
   END;                                                                 25510000
                                                                        25520000
   IF SW_WARRANTY                                                       25530000
   THEN DO;                                                             25540000
                                                      /* SOC RC01234 */ 25550000
                                                      /* SOC RB01281 */ 25560000
                                                      /* SOC RB01298 */ 25570000
 /* GET F_TYPE_OF_WARRANTY IF THE MACHINE IS FLEXIBLE OR HARDBUNDLE  */ 25580000
 /* AND PASS CORRECT SERVICE START AND SERVICE END DATES             */ 25590000
                                                                        25600000
 /*IF FLEXIBLE_WARRANTY_BAU THEN                                     */ 25610000
   IF SW_FW_BAU | SW_HB_BAU  THEN                     /* EOC RB01298 */ 25620000
     DO;                                                                25630000
       FILE_RCBDTB1.TYPE_OF_WARRANTY =                                  25640000
                              CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY;   25650000
                                                     /* SOC RB01298 */  25660000
       IF CURSOR_INST_HW_V220.F_SPLT_DATE >             /* RB01305 */   25670000
                   FILE_RCBDTB1.SERVICE_START_DATE THEN /* RB01305 */   25680000
       FILE_RCBDTB1.SERVICE_START_DATE =                                25690000
                              CURSOR_INST_HW_V220.F_SPLT_DATE;          25700000
                                                     /* EOC RB01298 */  25710000
       IF CURSOR_INST_HW_V220.END_DATE <              /* SOC RB01305 */ 25720000
                     FILE_RCBDTB1.SERVICE_END_DATE THEN                 25730000
       FILE_RCBDTB1.SERVICE_END_DATE =                                  25740000
                     CURSOR_INST_HW_V220.END_DATE ;   /* EOC RB01305 */ 25750000
                                                 /* SOC CEDS00000551 */ 25760000
       IF SW_FW_BAU THEN                                                25770000
       FILE_RCBDTB1.BASE_WARRANTY_SLC =                                 25780000
                     CURSOR_INST_HW_V220.SERVICE_LVL_CODE;              25790000
                                                 /* EOC CEDS00000551 */ 25800000
     END;                                                               25810000
   ELSE                                                                 25820000
     DO;                                                                25830000
       FILE_RCBDTB1.TYPE_OF_WARRANTY =                                  25840000
                              CURSOR_INST_HW_V220.TYPE_OF_WARRANTY;     25850000
                                                      /* SOC RB01298 */ 25860000
       FILE_RCBDTB1.BASE_WARRANTY_SLC =               /* SOC RB01305 */ 25870000
                             CURSOR_INST_HW_V220.SERVICE_LVL_CODE;      25880000
                                                                        25890000
       IF CURSOR_INST_HW_V220.EFFECTIVE_DATE >                          25900000
                     FILE_RCBDTB1.SERVICE_START_DATE THEN               25910000
       FILE_RCBDTB1.SERVICE_START_DATE =                                25920000
                              CURSOR_INST_HW_V220.EFFECTIVE_DATE;       25930000
                                                                        25940000
       IF CURSOR_INST_HW_V220.END_DATE <                                25950000
                     FILE_RCBDTB1.SERVICE_END_DATE THEN                 25960000
       FILE_RCBDTB1.SERVICE_END_DATE =                                  25970000
                     CURSOR_INST_HW_V220.END_DATE;                      25980000
                                                      /* EOC RB01305 */ 25990000
       IF SW_BRAND_BAU                                                  26000000
       THEN                                                             26010000
         DO;                                                            26020000
           IF FILE_RCBDTB1.SERVICE_END_DATE >         /* SOC RB01305 */ 26030000
             R014_DATE_CALC (CURSOR_INST_HW_V220.F_SPLT_DATE,-1) THEN   26040000
                                                      /* EOC RB01305 */ 26050000
           FILE_RCBDTB1.SERVICE_END_DATE   =                            26060000
                  R014_DATE_CALC (CURSOR_INST_HW_V220.F_SPLT_DATE,-1);  26070000
         END;                                                           26080000
                                                      /* EOC RB01298 */ 26090000
     END;                                              /* EOC RB01281 */26100000
     FILE_RCBDTB1.MA_STATUS  =                                          26110000
                       R011_TRANS_TPMNT(FILE_RCBDTB1.TYPE_OF_WARRANTY); 26120000
                                                      /* EOC RC01234 */ 26130000
                                                      /* SOC RB01299 */ 26140000
 /*********  MOVED THE BELOW CODE AS PER A11 REQUIREMENT  ************/ 26150000
                                                                        26160000
 /*  IF WRK_SERVICE_TYPE_IND >= 0                                       26170000
 /*  THEN DO;                           /* IN CASE OF CHIS CONTRACT  */ 26180000
 /*    FILE_RCBDTB1.SERVICE_TYPE = TB_RCBV240.SERVICE_TYPE;             26190000
 /*    FILE_RCBDTB1.SERVICE_TYPE_NI = '';             /* EOC RB01299 */ 26200000
 /*                                                       SOC RC01234 */26210000
 /*     CALL R445_RETRIEVE_SERVICE_DELIVERY;                          */26220000
 /*     IF TB_RCBV640_I.INDNULL(2) ¬= -1                              */26230000
 /*     THEN                                                          */26240000
 /*       FILE_RCBDTB1.SERVICE_DLVR_METHD                             */26250000
 /*                                = TB_RCBV640.SERVICE_DLVR_METHD;   */26260000
 /*                                                       EOC RC01234 */26270000
                                                      /* SOC RB01299 */ 26280000
 /*    CALL R444_RETRIEVE_SRVICE_DLVRY_CONS;              /* RC01279 */ 26290000
 /*  END;                                             /* EOC RB01299 */ 26300000
   END;                                                                 26310000
   ELSE DO;                                                             26320000
                                                      /* SOC RB01305 */ 26330000
     IF ( SWITCH_INTERNAL             |                                 26340000
          SWITCH_LEASE_RENTAL         |                                 26350000
          SWITCH_INTERNAL_MACHINE_CTR  ) THEN                           26360000
      DO;                                                               26370000
        IF CURSOR_INST_HW_V220.EFFECTIVE_DATE >                         26380000
                      FILE_RCBDTB1.SERVICE_START_DATE THEN              26390000
        FILE_RCBDTB1.SERVICE_START_DATE =                               26400000
                               CURSOR_INST_HW_V220.EFFECTIVE_DATE;      26410000
                                                                        26420000
        IF CURSOR_INST_HW_V220.END_DATE <                               26430000
                      FILE_RCBDTB1.SERVICE_END_DATE THEN                26440000
        FILE_RCBDTB1.SERVICE_END_DATE =                                 26450000
                      CURSOR_INST_HW_V220.END_DATE;                     26460000
                                                                        26470000
        IF WRK_TOM_BAU ¬= '2' THEN                                      26480000
          FILE_RCBDTB1.BASE_WARRANTY_SLC =                              26490000
                              CURSOR_INST_HW_V220.SERVICE_LVL_CODE;     26500000
      END;                                                              26510000
                                                      /* EOC RB01305 */ 26520000
     FILE_RCBDTB1.TYPE_OF_MAINT =                                       26530000
                   CURSOR_INST_HW_V220.TYPE_OF_MAINT;                   26540000
                                                      /* SOC RC01234 */ 26550000
                                                                        26560000
     IF SWITCH_TOM_INTERNAL_MACHINE THEN              /* SOC RB01290 */ 26570000
        FILE_RCBDTB1.MA_STATUS = PARM_RCBP70S.MACHINE_STATUS;           26580000
     ELSE                                             /* EOC RB01290 */ 26590000
                                                                        26600000
           FILE_RCBDTB1.MA_STATUS        =                              26610000
               R011_TRANS_TPMNT(FILE_RCBDTB1.TYPE_OF_MAINT);            26620000
                                                      /* EOC RC01234 */ 26630000
                                                                        26640000
                                                      /* SOC RB01299 */ 26650000
 /*********  MOVED THE BELOW CODE AS PER A11 REQUIREMENT  ************/ 26660000
                                                                        26670000
 /*  IF WRK_SERVICE_TYPE_IND >= 0                                       26680000
 /*  THEN DO;                           /* IN CASE OF CHIS CONTRACT  */ 26690000
 /*    FILE_RCBDTB1.SERVICE_TYPE = TB_RCBV240.SERVICE_TYPE;             26700000
 /*    FILE_RCBDTB1.SERVICE_TYPE_NI = '';             /* EOC RB01299 */ 26710000
 /*                                                      SOC RC01234 */ 26720000
 /*    CALL R445_RETRIEVE_SERVICE_DELIVERY;                          */ 26730000
 /*    IF TB_RCBV640_I.INDNULL(2) ¬= -1                              */ 26740000
 /*    THEN                                                          */ 26750000
 /*      FILE_RCBDTB1.SERVICE_DLVR_METHD                             */ 26760000
 /*                               = TB_RCBV640.SERVICE_DLVR_METHD;   */ 26770000
 /*                                                     EOC RC01234  */ 26780000
                                                      /* SOC RB01299 */ 26790000
 /*           MOVED THE BELOW CODE AS PER A11 REQUIREMENT            */ 26800000
                                                                        26810000
 /* CALL R444_RETRIEVE_SRVICE_DLVRY_CONS;               /* RC01279 */   26820000
 /*  END;                                                               26830000
 /*  ELSE DO;                                                           26840000
 /*    IF (SW_SLC_FOUND                          /* IF SDM EXISTS */    26850000
 /*        & TB_RCBV470_I.INDNULL(16) ¬= -1)                            26860000
 /*    THEN DO;                                                         26870000
 /*                                                   /* SOC RC01234 */ 26880000
 /*      FILE_RCBDTB1.SERVICE_DLVR_METHD                                26890000
 /*                               = TB_RCBV470.SERVICE_DLVR_METHD;      26900000
 /*                                                   /* EOC RC01234 */ 26910000
 /*      CALL R440_RETRIEVE_SERVICE_TYPE;                               26920000
 /*      IF TB_RCBV640_I.INDNULL(1) ¬= -1                               26930000
 /*      THEN DO;                                                       26940000
 /*        FILE_RCBDTB1.SERVICE_TYPE = TB_RCBV640.SERVICE_TYPE;         26950000
 /*        FILE_RCBDTB1.SERVICE_TYPE_NI = '';                           26960000
 /*      END;                                                           26970000
 /*    END;                                                             26980000
 /*  END;                                             /* EOC RB01299 */ 26990000
   END;                                                                 27000000
                                                      /* SOC RB01299 */ 27010000
 /* SDM CALCULATION WHEN A BAU MACHINE EFFECTIVE UNDER BOTH WARRANTY */ 27020000
 /* AND CONTRACT OR EFFECTIVE ONLY UNDER CONTRACT                    */ 27030000
                                                                        27040000
   IF (SW_SLC_FOUND & TB_RCBV470_I.INDNULL(16) ¬= -1)                   27050000
   THEN                                                                 27060000
     DO;                                                                27070000
       FILE_RCBDTB1.SERVICE_DLVR_METHD                                  27080000
                                    = TB_RCBV470.SERVICE_DLVR_METHD;    27090000
       FILE_RCBDTB1.SERVICE_TYPE    = TB_RCBV240.SERVICE_TYPE;          27100000
       FILE_RCBDTB1.SERVICE_TYPE_NI = '';                               27110000
     END;                                                               27120000
   ELSE                                                                 27130000
     DO;                                                                27140000
       IF WRK_SERVICE_TYPE_IND >= 0                                     27150000
       THEN                                                             27160000
         DO;                                                            27170000
           FILE_RCBDTB1.SERVICE_TYPE    = TB_RCBV240.SERVICE_TYPE;      27180000
           FILE_RCBDTB1.SERVICE_TYPE_NI = '';                           27190000
           CALL R444_RETRIEVE_SRVICE_DLVRY_CONS;                        27200000
         END;                                                           27210000
     END;                                             /* EOC RB01299 */ 27220000
                                                                        27230000
    FILE_RCBDTB1.CONTRACT_SOURCE  = TB_RCBV240.SOURCE_INDICATOR;        27240000
    FILE_RCBDTB1.HVP_QUANTITY     = WRK_PERIOD_HVP_QUANTITY;            27250000
                                                                        27260000
 END R402_FILL_SERV_CTR_PERIOD;                                         27270000
                                           /* SOC01239 */               27280000
                                                      /* SOC RB01305 */ 27290000
1/********************************************************************/ 27300000
 /*                                                                   */27310000
 /* MODULE NAME      :  R403_GET_NEXT_EFFECTIVE_DATE                  */27320000
 /*                                                                   */27330000
 /* DESCRIPTION      :  GET EFFECTIVE DATE OF FIRST FUTURE CONTRACT   */27340000
 /*                                                                   */27350000
 /*********************************************************************/27360000
 /*  R403_GET_NEXT_EFFECTIVE_DATE: PROC;                              */27370000
 /*                                                                   */27380000
 /*   EXEC SQL                                                        */27390000
 /*    SELECT  MIN(EFFECTIVE_DATE)                                    */27400000
 /*      INTO :WRK_EFFECTIVE_DATE_FUT :WRK_EFF_DATE_FUT_INDNULL       */27410000
 /*      FROM RCBT0220_SUPPL_CTR                                      */27420000
 /*     WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE           */27430000
 /*       AND ORIGIN          = :SK_CURRENT_HW.ORIGIN                 */27440000
 /*       AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER        */27450000
 /*       AND COUNTRY_NUMBER  = :WRK_CTRYNO                           */27460000
 /*       AND EFFECTIVE_DATE  > :SK_CURRENT_HW.END_DATE;              */27470000
 /*                                                                   */27480000
 /*    SELECT(SQLCODE);                                               */27490000
 /*      WHEN (0)                                                     */27500000
 /*      DO;                                                          */27510000
 /*        /* EFFECTIVE_DATE_FUT MUST BE FILLED TO GET FUTURE INFO */   27520000
 /*          IF WRK_EFF_DATE_FUT_INDNULL ¬= -1 THEN                   */27530000
 /*             CALL R404_GET_FUT_CTR_INFO;                           */27540000
 /*      END;                                                         */27550000
 /*      WHEN (100);                                                  */27560000
 /*      OTHERWISE                                                    */27570000
 /*      DO;                                                          */27580000
 /*        CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#027');            */27590000
 /*      END;                                                         */27600000
 /*    END;                                                           */27610000
 /*                                                                   */27620000
 /*  END R403_GET_NEXT_EFFECTIVE_DATE;                                */27630000
1/*********************************************************************/27640000
 /*                                                                   */27650000
 /* MODULE NAME: R404_GET_FUT_CTR_INFO                                */27660000
 /*                                                                   */27670000
 /* DESCRIPTION: GET TYPE_MAINT_FUT, MA_STATUS_FUT, END_DATE_FUT,     */27680000
 /*              CONTRACT_NUMBER_FUT, TYPE_WARRANTY_FUT               */27690000
 /*                                                                   */27700000
 /*********************************************************************/27710000
 /* R404_GET_FUT_CTR_INFO: PROC;                                        27720000
 /*                                                                     27730000
 /* SWITCH_INTERNAL_MACHINE_CTR_FUT = FALSE;          /* SOC RB01290 */ 27740000
 /* SWITCH_FUTURE_FLAG = FALSE;                       /* EOC RB01290 */ 27750000
 /*                                                                     27760000
 /* EXEC SQL                                                            27770000
 /*  SELECT  TYPE_OF_WARRANTY,   /* SOC PTM1409 */                      27780000
 /*          TYPE_OF_MAINT,                                             27790000
 /*          END_DATE,                                                  27800000
 /*          SOURCE_INDICATOR                              /* RB01290 */27810000
 /*    INTO :WRK_TYPE_WARRANTY_FUT :WRK_WARRANTY_FUT_INDNULL,           27820000
 /*         :WRK_TYPE_MAINT_FUT    :WRK_MAINT_FUT_INDNULL,              27830000
 /*         :WRK_END_DATE_FUT      :WRK_INDNULL,                        27840000
 /*         :WRK_SOURCE_IND_FUT    :WRK_SOURCE_IND_FUT_INDNULL          27850000
 /*                                                        /* RB01290 */27860000
 /*    FROM  RCBT0220_SUPPL_CTR                                         27870000
 /*   WHERE  PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE              27880000
 /*     AND  ORIGIN          = :SK_CURRENT_HW.ORIGIN                    27890000
 /*     AND  SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER           27900000
 /*     AND  COUNTRY_NUMBER  = :WRK_CTRYNO                              27910000
 /*     AND  EFFECTIVE_DATE  = :WRK_EFFECTIVE_DATE_FUT;                 27920000
 /*                                                                     27930000
 /* SELECT(SQLCODE);                                                    27940000
 /*  WHEN (0)                                                           27950000
 /*   DO;                                                               27960000
   /* IF WRK_TYPE_MAINT_FUT = '2'                        SOC RB01290 */ 27970000
 /*   SWITCH_FUTURE_FLAG = TRUE;                                        27980000
 /*   IF (((WRK_TYPE_MAINT_FUT = '2')    |                              27990000
 /*        (WRK_TYPE_MAINT_FUT = 'A')    |                              28000000
 /*        (WRK_TYPE_MAINT_FUT = 'B'))   &                              28010000
 /*        (WRK_SOURCE_IND_FUT = 'C'))                                  28020000
 /*   THEN DO;                                                          28030000
 /*   SWITCH_INTERNAL_MACHINE_CTR_FUT = TRUE;                           28040000
 /*                                                   /* EOC RB01290 */ 28050000
 /*        /* '2' MEANS A CONTRACT_NUMBER_FUT EXISTS       */           28060000
 /*        /* '3' MEANS CONTRACT_NUMBER_FUT DOES NOT EXIST */           28070000
 /*                                                                     28080000
 /*       EXEC SQL                                                      28090000
 /*       SELECT  CONTRACT_NUMBER                                       28100000
 /*         INTO :WRK_CONTRACT_NUMBER_FUT :WRK_INDNULL                  28110000
 /*         FROM  RCBT0240_SERV_CTR                                     28120000
 /*        WHERE  PRODUCT_TYPE    =  :SK_CURRENT_HW.PRODUCT_TYPE        28130000
 /*          AND  ORIGIN          =  :SK_CURRENT_HW.ORIGIN              28140000
 /*          AND  SEQUENCE_NUMBER =  :SK_CURRENT_HW.SEQUENCE_NUMBER     28150000
 /*          AND  COUNTRY_NUMBER  =  :WRK_CTRYNO                        28160000
 /*          AND  EFFECTIVE_DATE  <= :WRK_EFFECTIVE_DATE_FUT            28170000
 /*          AND  END_DATE        >= :WRK_EFFECTIVE_DATE_FUT;           28180000
 /*                                                                     28190000
 /*       SELECT(SQLCODE);                                              28200000
 /*        WHEN (0)                                                     28210000
 /*         DO;                                       /* SOC RB01290 */ 28220000
 /*          IF WRK_CONTRACT_NUMBER_FUT ¬= '' THEN                      28230000
 /*           DO;                                                       28240000
 /*            EXEC SQL                                                 28250000
 /*            SELECT B.TYPE_OF_CONTRACT                                28260000
 /*              INTO :WRK_TYPE_OF_CONTRACT_FUT                         28270000
 /*                   :WRK_TYPE_OF_CONTRACT_FUT_INDNULL                 28280000
 /*              FROM RCBV0030_CONTRACT B                               28290000
 /*                                              /* SOC CEDS00000455 */ 28300000
 /* /*          WHERE B.CONTRACT_NUMBER = : WRK_CONTRACT_NUMBER_FUT;*/  28310000
 /*             WHERE B.COUNTRY_NUMBER  = : WRK_CTRYNO                  28320000
 /*               AND B.CONTRACT_NUMBER = : WRK_CONTRACT_NUMBER_FUT;    28330000
 /*                                              /* EOC CEDS00000455 */ 28340000
 /*            SELECT (SQLCODE);                                        28350000
 /*             WHEN(0)                                                 28360000
 /*              DO;                                                    28370000
 /*               IF ((WRK_TYPE_OF_CONTRACT_FUT ¬= '')&                 28380000
 /*                   (WRK_TYPE_OF_CONTRACT_FUT_INDNULL ¬= -1)) THEN    28390000
 /*                   CALL R480_RETRIEVE_TOM_INT_CONTRACT;              28400000
 /*              END;                                                   28410000
 /*             WHEN(100);                                              28420000
 /*             OTHERWISE                                               28430000
 /*              DO;                                                    28440000
 /*               CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#058');       28450000
 /*              END;                                                   28460000
 /*            END;                                                     28470000
 /*           END;                                                      28480000
 /*       END;                                        /* EOC RB01290 */ 28490000
 /*      WHEN (100);                                                    28500000
 /*      OTHERWISE                                                      28510000
 /*        DO;                                                          28520000
 /*          CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#028');            28530000
 /*        END;                                                         28540000
 /*     END;                                                            28550000
 /*   END;                                                              28560000
 /*                                                                     28570000
 /* END;                                                                28580000
 /* WHEN (100);                                                         28590000
 /* OTHERWISE                                                           28600000
 /*  DO;                                                                28610000
 /*   CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#029');                   28620000
 /*  END;                                                               28630000
 /*END;                                                                 28640000
 /*                                                                     28650000
 /* /* SOC PTM1409 */                                                   28660000
 /* /* DETERMINE IF WARRANTY OR MAINTENANCE IS FILLED IN */             28670000
 /* /* NO VALUE FOUND FOR WARRANTY */                                   28680000
 /* IF WRK_MAINT_FUT_INDNULL = 0 THEN                                   28690000
 /*  DO;                                                                28700000
 /*    IF SWITCH_TOM_INTERNAL_MACHINE_FUT  THEN        /* SOC RB01290 */28710000
 /*      DO;                                                            28720000
 /*       WRK_MA_STATUS_FUT = PARM_RCBP70S.MACHINE_STATUS;              28730000
 /*       FILE_RCBDTB1.TYPE_MAINT_FUT =                                 28740000
 /*           PARM_RCBP70S.TOM_INTERNAL_CONTRACT;                       28750000
 /*      END;                                                           28760000
 /*    ELSE                                                             28770000
 /*     DO;                                            /* EOC RB01290 */28780000
 /*      WRK_MA_STATUS_FUT=R011_TRANS_TPMNT(WRK_TYPE_MAINT_FUT);        28790000
 /*      FILE_RCBDTB1.TYPE_MAINT_FUT      = WRK_TYPE_MAINT_FUT;         28800000
 /*     END;                                               /* RB01290 */28810000
 /*  END;                                                               28820000
 /* ELSE DO;                                                            28830000
 /*   WRK_MA_STATUS_FUT=R011_TRANS_TPMNT(WRK_TYPE_WARRANTY_FUT);        28840000
 /*   FILE_RCBDTB1.TYPE_MAINT_FUT      = WRK_TYPE_WARRANTY_FUT;         28850000
 /* END;                                                                28860000
 /* /* EOC PTM1409 */                                                   28870000
 /*                                                                     28880000
 /* FILL FUTURE FIELDS IN OUTPUT FILE */                                28890000
 /*                                                                     28900000
 /* FILE_RCBDTB1.MA_STATUS_FUT       = WRK_MA_STATUS_FUT;               28910000
 /* FILE_RCBDTB1.END_DATE_FUT        = WRK_END_DATE_FUT;                28920000
 /* FILE_RCBDTB1.CONTRACT_NUMBER_FUT = WRK_CONTRACT_NUMBER_FUT;         28930000
 /* FILE_RCBDTB1.LIABILITY_FUT       = 'IBM';              /* RB01283 */28940000
 /* SWITCH_FUTURE_FLAG               = FALSE;              /* RB01290 */28950000
 /*END R404_GET_FUT_CTR_INFO;                                           28960000
                                                       /* EOC RB01305 */28970000
1/*********************************************************************/28980000
 /*                                                                   */28990000
 /* MODULE NAME      :  R406_GET_TYPE_OF_CONTRACT                     */29000000
 /*                                                                   */29010000
 /* DESCRIPTION      :  GET TYPE OF CONTRACT FROM TABLE T0030         */29020000
 /*                                                                   */29030000
 /*********************************************************************/29040000
 R406_GET_TYPE_OF_CONTRACT: PROC;                                       29050000
    WRK_TYPE_OF_CONTRACT_INDNULL = 0;                      /* RB01290 */29060000
                                                                        29070000
    /* NULL INDICATOR WRK_INDNULL IS CHANGED TO */                      29080000
    /* WRK_TYPE_OF_CONTRACT_INDNULL AS PART OF RB01290 */               29090000
                                                                        29100000
    EXEC SQL                                                            29110000
       SELECT  TYPE_OF_CONTRACT                            /* RB01290 */29120000
         INTO :WRK_TYPE_OF_CONTRACT :WRK_TYPE_OF_CONTRACT_INDNULL       29130000
         FROM  RCBV0030_CONTRACT                                        29140000
        WHERE  COUNTRY_NUMBER  = :WRK_CTRYNO                            29150000
          AND  CONTRACT_NUMBER = :TB_RCBV240.CONTRACT_NUMBER            29160000
       ;                                                                29170000
                                                                        29180000
       SELECT(SQLCODE);                                                 29190000
         WHEN (0);                                                      29200000
         WHEN (100);                                                    29210000
         OTHERWISE                                                      29220000
          DO;                                                           29230000
            CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#030');             29240000
          END;                                                          29250000
       END;                                                             29260000
  /* FILL TYPE OF CONTRACT IN OUTPUT FILE */                            29270000
                                                      /* SOC RB01290  */29280000
  /* FILE_RCBDTB1.TYPE_OF_CONTRACT = WRK_TYPE_OF_CONTRACT; */           29290000
                                                      /* EOC RB01290  */29300000
  END R406_GET_TYPE_OF_CONTRACT;  /* EOC01239 */                        29310000
1/*********************************************************************/29320000
 /*                                                                   */29330000
 /*                                                                   */29340000
 /* MODULE NAME      :  R405_FILL_SUPPL_CTR_PERIOD                    */29350000
 /*                                                                   */29360000
 /* DESCRIPTION      :                                                */29370000
 /*                                                                   */29380000
 /*********************************************************************/29390000
 R405_FILL_SUPPL_CTR_PERIOD: PROC (PARM_EFF_DATE,PARM_END_DATE);        29400000
                                                                        29410000
   DCL PARM_EFF_DATE CHAR (10);                                         29420000
   DCL PARM_END_DATE CHAR (10);                                         29430000
                                                                        29440000
   FILE_RCBDTB1.SERVICE_START_DATE = PARM_EFF_DATE;                     29450000
   FILE_RCBDTB1.SERVICE_END_DATE   = PARM_END_DATE;                     29460000
   FILE_RCBDTB1.SERVICE_TYPE_NI    = '?';                               29470000
                                                                        29480000
   IF CURSOR_INST_HW_V220.TYPE_OF_MAINT ¬= ''                           29490000
   THEN DO;                                                             29500000
     FILE_RCBDTB1.TYPE_OF_MAINT = CURSOR_INST_HW_V220.TYPE_OF_MAINT;    29510000
                                                      /* SOC RC01234 */ 29520000
     FILE_RCBDTB1.MA_STATUS     =                                       29530000
                        R011_TRANS_TPMNT(FILE_RCBDTB1.TYPE_OF_MAINT);   29540000
                                                      /* EOC RC01234 */ 29550000
   END;                                                                 29560000
   IF CURSOR_INST_HW_V220.TYPE_OF_WARRANTY ¬= ''                        29570000
   THEN DO;                                                             29580000
                                                      /* SOC RC01234 */ 29590000
                                                     /* SOC RB01281  */ 29600000
                                                      /* SOC RB01298 */ 29610000
 /* GET F_TYPE_OF_WARRANTY IF THE MACHINE IS FLEXIBLE OR HARDBUNDLE  */ 29620000
 /* AND PASS CORRECT SERVICE START AND SERVICE END DATES             */ 29630000
                                                                        29640000
 /*IF FLEXIBLE_WARRANTY_BAU THEN                                     */ 29650000
   IF (SW_FW_BAU | SW_HB_BAU) THEN                    /* EOC RB01298 */ 29660000
     DO;                                                                29670000
       FILE_RCBDTB1.TYPE_OF_WARRANTY   =                                29680000
                              CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY;   29690000
                                                      /* SOC RB01298 */ 29700000
       FILE_RCBDTB1.SERVICE_START_DATE =                                29710000
                              CURSOR_INST_HW_V220.F_SPLT_DATE;          29720000
                                                      /* EOC RB01298 */ 29730000
     END;                                                               29740000
   ELSE                                                                 29750000
     DO;                                                                29760000
       FILE_RCBDTB1.TYPE_OF_WARRANTY =                                  29770000
                              CURSOR_INST_HW_V220.TYPE_OF_WARRANTY;     29780000
                                                      /* SOC RB01298 */ 29790000
       IF SW_BRAND_BAU                                                  29800000
       THEN                                                             29810000
         DO;                                                            29820000
           FILE_RCBDTB1.SERVICE_END_DATE   =                            29830000
                 R014_DATE_CALC (CURSOR_INST_HW_V220.F_SPLT_DATE,-1);   29840000
         END;                                                           29850000
                                                      /* EOC RB01298 */ 29860000
     END;                                             /* EOC RB01281  */29870000
                                                                        29880000
     FILE_RCBDTB1.MA_STATUS        =                                    29890000
                       R011_TRANS_TPMNT(FILE_RCBDTB1.TYPE_OF_WARRANTY); 29900000
                                                      /* EOC RC01234 */ 29910000
   END;                                                                 29920000
                                          /* RETRIEVE COVERAGE HOURS */ 29930000
   IF WRK_SLC_V220_IND ¬= -1                            /* CHECK SLC */ 29940000
   THEN DO;                                                             29950000
                                                      /* SOC RC01234 */ 29960000
         FILE_RCBDTB1.SERVICE_LVL_CODE_1 =                              29970000
                                 CURSOR_INST_HW_V220.SERVICE_LVL_CODE;  29980000
                                                      /* EOC RC01234 */ 29990000
                                                      /* SOC RB01298 */ 30000000
               /* GET SLC_2 IF THE MACHINE IS FLEXIBLE OR HARDBUNDLE */ 30010000
                                                                        30020000
     IF WRK_SLC_2_V220_IND ¬= -1  &                                     30030000
       (SW_FW_BAU | SW_HB_BAU)                                          30040000
     THEN                                                               30050000
       DO;                                                              30060000
         FILE_RCBDTB1.SERVICE_LVL_CODE_2 =                              30070000
                              CURSOR_INST_HW_V220.SERVICE_LVL_CODE_2;   30080000
         WRK_SERVICE_LVL_CODE =                                         30090000
                               CURSOR_INST_HW_V220.SERVICE_LVL_CODE_2;  30100000
       END;                                                             30110000
     ELSE                                             /* EOC RB01298 */ 30120000
         WRK_SERVICE_LVL_CODE = CURSOR_INST_HW_V220.SERVICE_LVL_CODE;   30130000
     CALL R470_RETRIEVE_RCBV0470;                                       30140000
     IF SW_SLC_FOUND                                                    30150000
     THEN DO;                                                           30160000
       FILE_RCBDTB1.COVERAGE_START_1 = TB_RCBV470.COVERAGE_START_1;     30170000
       FILE_RCBDTB1.COVERAGE_START_2 = TB_RCBV470.COVERAGE_START_2;     30180000
       FILE_RCBDTB1.COVERAGE_START_3 = TB_RCBV470.COVERAGE_START_3;     30190000
       FILE_RCBDTB1.COVERAGE_START_4 = TB_RCBV470.COVERAGE_START_4;     30200000
       FILE_RCBDTB1.COVERAGE_START_5 = TB_RCBV470.COVERAGE_START_5;     30210000
       FILE_RCBDTB1.COVERAGE_START_6 = TB_RCBV470.COVERAGE_START_6;     30220000
       FILE_RCBDTB1.COVERAGE_START_7 = TB_RCBV470.COVERAGE_START_7;     30230000
       FILE_RCBDTB1.COVERAGE_END_1   = TB_RCBV470.COVERAGE_END_1;       30240000
       FILE_RCBDTB1.COVERAGE_END_2   = TB_RCBV470.COVERAGE_END_2;       30250000
       FILE_RCBDTB1.COVERAGE_END_3   = TB_RCBV470.COVERAGE_END_3;       30260000
       FILE_RCBDTB1.COVERAGE_END_4   = TB_RCBV470.COVERAGE_END_4;       30270000
       FILE_RCBDTB1.COVERAGE_END_5   = TB_RCBV470.COVERAGE_END_5;       30280000
       FILE_RCBDTB1.COVERAGE_END_6   = TB_RCBV470.COVERAGE_END_6;       30290000
       FILE_RCBDTB1.COVERAGE_END_7   = TB_RCBV470.COVERAGE_END_7;       30300000
     END;                                                               30310000
                                /* SAVE THE ROW IF NEW ROW RETRIEVED */ 30320000
     IF SW_SLC_FOUND                                                    30330000
     THEN DO;                                                           30340000
       SAVE_RCBV470     = TB_RCBV470;                                   30350000
       SAVE_RCBV470_I   = TB_RCBV470_I;                                 30360000
     END;                                                               30370000
     IF (SW_SLC_FOUND                               /* IF SDM EXISTS */ 30380000
         & TB_RCBV470_I.INDNULL(16) ¬= -1)                              30390000
     THEN DO;                                                           30400000
                                                      /* SOC RC01234 */ 30410000
       FILE_RCBDTB1.SERVICE_DLVR_METHD = TB_RCBV470.SERVICE_DLVR_METHD; 30420000
                                                      /* EOC RC01234 */ 30430000
       CALL R440_RETRIEVE_SERVICE_TYPE;                                 30440000
       IF TB_RCBV640_I.INDNULL(1) ¬= -1                                 30450000
       THEN DO;                                                         30460000
         FILE_RCBDTB1.SERVICE_TYPE = TB_RCBV640.SERVICE_TYPE;           30470000
         FILE_RCBDTB1.SERVICE_TYPE_NI = '';                             30480000
       END;                                                             30490000
     END;                                                               30500000
   END;                                                                 30510000
                                                                        30520000
   FILE_RCBDTB1.HVP_QUANTITY = WRK_PERIOD_HVP_QUANTITY;                 30530000
                                                                        30540000
 END R405_FILL_SUPPL_CTR_PERIOD;                                        30550000
                                                                        30560000
1/********************************************************************/ 30570000
 /*                                                                  */ 30580000
 /* MODULE NAME      : R440_RETRIEVE_SERVICE_TYPE                    */ 30590000
 /*                                                                  */ 30600000
 /* DESCRIPTION      : SELECT ROW OF RCBV0640                        */ 30610000
 /*                                                                  */ 30620000
 /*                                                                  */ 30630000
 /********************************************************************/ 30640000
 R440_RETRIEVE_SERVICE_TYPE: PROC;                                      30650000
                                                                        30660000
   TB_RCBV640                  = '';                                    30670000
   TB_RCBV640_I.INDNULL(*)     = 0;                                     30680000
   TB_RCBV640.SERVICE_DLVR_METHD = TB_RCBV470.SERVICE_DLVR_METHD;       30690000
                                     /* SELECT OF ROW IN RCBV0640/645*/ 30700000
   CALL RCBIBOM (ADDR(TB_RCBV640),                                      30710000
                 ADDR(TB_RCBV640_I),                                    30720000
                 PTR_RETURN_AREA_BB,                                    30730000
                 PTR_INT_AREA,                                          30740000
                 'SDM');                                   /* RA01233 */30750000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  30760000
     WHEN (0);                             /* ROW FOUND               */30770000
     WHEN (4) DO;                          /* ROW NOT FOUND           */30780000
       TB_RCBV640                  = '';   /* INIT FIELDS             */30790000
       TB_RCBV640_I.INDNULL(*)     = -1;                                30800000
     END;                                                               30810000
     OTHERWISE DO;                                                      30820000
       CALL RCBDTBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),'DB2','#031');30830000
     END;                                                               30840000
   END;                                                                 30850000
                                                                        30860000
 END R440_RETRIEVE_SERVICE_TYPE;                                        30870000
                                                                        30880000
1/********************************************************************/ 30890000
 /*                                                      SOC RC01279 */ 30900000
 /* MODULE NAME      : R444_RETRIEVE_SRVICE_DLVRY_CONS               */ 30910000
 /*                                                                  */ 30920000
 /* DESCRIPTION      : QUERY 645 TABLE FOR CONSOLIDATED SERVICE TYPE */ 30930000
 /*                    IF IT IS PRESENT, SERVICE DELIVERY FIELD WILL */ 30940000
 /*                    CONTAIN CORRESPONDING SDM FROM 645 TABLE ELSE */ 30950000
 /*                    IT WILL CONTAIN SERVICE TYPE FROM 240 TABLE   */ 30960000
 /*                                                                  */ 30970000
 /*                                                                  */ 30980000
 /********************************************************************/ 30990000
 R444_RETRIEVE_SRVICE_DLVRY_CONS: PROC;                                 31000000
                                                                        31010000
 TB_RCBV645                  = '';                                      31020000
 TB_RCBV645_I.INDNULL(*)     = 0;                                       31030000
 TB_RCBV645.SERVICE_TYPE     = TB_RCBV240.SERVICE_TYPE;                 31040000
                                                                        31050000
 EXEC SQL                                                               31060000
   SELECT * INTO : TB_RCBV645 :TB_RCBV645_I.INDNULL                     31070000
   FROM RCBT0645_CTRY_SVT                                               31080000
   WHERE     SERVICE_TYPE     =  :TB_RCBV645.SERVICE_TYPE               31090000
   AND       COUNTRY_NUMBER   =  :WRK_CTRYNO                            31100000
   AND       CONSOLIDATE_IND  =  'Y' ;                                  31110000
                                                                        31120000
 SELECT (SQLCA.SQLCODE);                                                31130000
   WHEN (0)                                                             31140000
   DO;                                                                  31150000
      IF TB_RCBV645_I.INDNULL(3) ¬= -1 THEN DO;                         31160000
       FILE_RCBDTB1.SERVICE_DLVR_METHD = TB_RCBV645.SERVICE_DLVR_METHD; 31170000
      END;                                                              31180000
   END;                                                                 31190000
   WHEN (100)                                                           31200000
   DO;                                                                  31210000
      CALL R445_RETRIEVE_SERVICE_DELIVERY;                              31220000
      IF TB_RCBV640_I.INDNULL(2) ¬= -1 THEN                             31230000
       FILE_RCBDTB1.SERVICE_DLVR_METHD = TB_RCBV640.SERVICE_DLVR_METHD; 31240000
      ELSE                                            /* SOC RB01299 */ 31250000
       FILE_RCBDTB1.SERVICE_DLVR_METHD = TB_RCBV240.SERVICE_TYPE;       31260000
                                                      /* EOC RB01299 */ 31270000
   END;                                                                 31280000
   OTHERWISE                                                            31290000
   DO;                                                                  31300000
      CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#032');                   31310000
   END;                                                                 31320000
 END;                                                                   31330000
                                                                        31340000
 END R444_RETRIEVE_SRVICE_DLVRY_CONS;             /* EOC RC01279 */     31350000
1/********************************************************************/ 31360000
 /*                                                      SOC RA01233 */ 31370000
 /* MODULE NAME      : R445_RETRIEVE_SERVICE_DELIVERY                */ 31380000
 /*                                                                  */ 31390000
 /* DESCRIPTION      : SELECT ROW OF RCBV0640                        */ 31400000
 /*                                                                  */ 31410000
 /*                                                                  */ 31420000
 /********************************************************************/ 31430000
 R445_RETRIEVE_SERVICE_DELIVERY: PROC;                                  31440000
                                                                        31450000
   TB_RCBV640                  = '';                                    31460000
   TB_RCBV640_I.INDNULL(*)     = 0;                                     31470000
   TB_RCBV640.SERVICE_TYPE     = TB_RCBV240.SERVICE_TYPE;               31480000
                                     /* SELECT OF ROW IN RCBV0640/645*/ 31490000
   CALL RCBIBOM (ADDR(TB_RCBV640),                                      31500000
                 ADDR(TB_RCBV640_I),                                    31510000
                 PTR_RETURN_AREA_BB,                                    31520000
                 PTR_INT_AREA,                                          31530000
                 'SVT');                                                31540000
                                                                        31550000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  31560000
     WHEN (0);                             /* ROW FOUND               */31570000
     WHEN (4) DO;                          /* ROW NOT FOUND           */31580000
       TB_RCBV640                  = '';   /* INIT FIELDS             */31590000
       TB_RCBV640_I.INDNULL(*)     = -1;                                31600000
     END;                                                               31610000
     OTHERWISE DO;                                                      31620000
       CALL RCBDTBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),'DB2','#033');31630000
     END;                                                               31640000
   END;                                                                 31650000
                                                                        31660000
 END R445_RETRIEVE_SERVICE_DELIVERY;                                    31670000
                                                       /* EOC RC01234 */31680000
1/********************************************************************/ 31690000
 /*                                                                  */ 31700000
 /* MODULE NAME      : R450_FILL_COV_241_470                         */ 31710000
 /*                                                                  */ 31720000
 /* DESCRIPTION      : FILL COVERAGE HOURS EITHER FROM TABLE 241 OR  */ 31730000
 /*                    FROM TABLE 470.                               */ 31740000
 /*                                                                  */ 31750000
 /********************************************************************/ 31760000
 R450_FILL_COV_241_470: PROC;                                           31770000
                                                                        31780000
   IF ( WRK_V241_IND12  = -1 &                                          31790000
        WRK_V241_IND13  = -1 &                                          31800000
        WRK_V241_IND14  = -1 &                                          31810000
        WRK_V241_IND15  = -1 &                                          31820000
        WRK_V241_IND16  = -1 &                                          31830000
        WRK_V241_IND17  = -1 &                                          31840000
        WRK_V241_IND18  = -1 &                                          31850000
        WRK_V241_IND19  = -1 &                                          31860000
        WRK_V241_IND20  = -1 &                                          31870000
        WRK_V241_IND21  = -1 &                                          31880000
        WRK_V241_IND22  = -1 &                                          31890000
        WRK_V241_IND23  = -1 &                                          31900000
        WRK_V241_IND24  = -1 &                                          31910000
        WRK_V241_IND25  = -1 ) |                                        31920000
      ( CURSOR_CTR_PI.COVERAGE_START_1 = '00.00.00' &                   31930000
        CURSOR_CTR_PI.COVERAGE_START_2 = '00.00.00' &                   31940000
        CURSOR_CTR_PI.COVERAGE_START_3 = '00.00.00' &                   31950000
        CURSOR_CTR_PI.COVERAGE_START_4 = '00.00.00' &                   31960000
        CURSOR_CTR_PI.COVERAGE_START_5 = '00.00.00' &                   31970000
        CURSOR_CTR_PI.COVERAGE_START_6 = '00.00.00' &                   31980000
        CURSOR_CTR_PI.COVERAGE_START_7 = '00.00.00' &                   31990000
        CURSOR_CTR_PI.COVERAGE_END_1   = '00.00.00' &                   32000000
        CURSOR_CTR_PI.COVERAGE_END_2   = '00.00.00' &                   32010000
        CURSOR_CTR_PI.COVERAGE_END_3   = '00.00.00' &                   32020000
        CURSOR_CTR_PI.COVERAGE_END_4   = '00.00.00' &                   32030000
        CURSOR_CTR_PI.COVERAGE_END_5   = '00.00.00' &                   32040000
        CURSOR_CTR_PI.COVERAGE_END_6   = '00.00.00' &                   32050000
        CURSOR_CTR_PI.COVERAGE_END_7   = '00.00.00')                    32060000
   THEN DO;                                                             32070000
                                                                        32080000
     IF ((WRK_V241_IND27 ¬= -1) & SW_SLC_FOUND)        /* CHECK SLC */  32090000
     THEN DO;                                                           32100000
       USER_FILE_PI.COVERAGE_START_1 = TB_RCBV470.COVERAGE_START_1;     32110000
       USER_FILE_PI.COVERAGE_START_2 = TB_RCBV470.COVERAGE_START_2;     32120000
       USER_FILE_PI.COVERAGE_START_3 = TB_RCBV470.COVERAGE_START_3;     32130000
       USER_FILE_PI.COVERAGE_START_4 = TB_RCBV470.COVERAGE_START_4;     32140000
       USER_FILE_PI.COVERAGE_START_5 = TB_RCBV470.COVERAGE_START_5;     32150000
       USER_FILE_PI.COVERAGE_START_6 = TB_RCBV470.COVERAGE_START_6;     32160000
       USER_FILE_PI.COVERAGE_START_7 = TB_RCBV470.COVERAGE_START_7;     32170000
       USER_FILE_PI.COVERAGE_END_1   = TB_RCBV470.COVERAGE_END_1;       32180000
       USER_FILE_PI.COVERAGE_END_2   = TB_RCBV470.COVERAGE_END_2;       32190000
       USER_FILE_PI.COVERAGE_END_3   = TB_RCBV470.COVERAGE_END_3;       32200000
       USER_FILE_PI.COVERAGE_END_4   = TB_RCBV470.COVERAGE_END_4;       32210000
       USER_FILE_PI.COVERAGE_END_5   = TB_RCBV470.COVERAGE_END_5;       32220000
       USER_FILE_PI.COVERAGE_END_6   = TB_RCBV470.COVERAGE_END_6;       32230000
       USER_FILE_PI.COVERAGE_END_7   = TB_RCBV470.COVERAGE_END_7;       32240000
     END;                                                               32250000
   END;                                                                 32260000
   ELSE DO;                                                             32270000
     USER_FILE_PI.COVERAGE_START_1 = CURSOR_CTR_PI.COVERAGE_START_1;    32280000
     USER_FILE_PI.COVERAGE_START_2 = CURSOR_CTR_PI.COVERAGE_START_2;    32290000
     USER_FILE_PI.COVERAGE_START_3 = CURSOR_CTR_PI.COVERAGE_START_3;    32300000
     USER_FILE_PI.COVERAGE_START_4 = CURSOR_CTR_PI.COVERAGE_START_4;    32310000
     USER_FILE_PI.COVERAGE_START_5 = CURSOR_CTR_PI.COVERAGE_START_5;    32320000
     USER_FILE_PI.COVERAGE_START_6 = CURSOR_CTR_PI.COVERAGE_START_6;    32330000
     USER_FILE_PI.COVERAGE_START_7 = CURSOR_CTR_PI.COVERAGE_START_7;    32340000
     USER_FILE_PI.COVERAGE_END_1   = CURSOR_CTR_PI.COVERAGE_END_1;      32350000
     USER_FILE_PI.COVERAGE_END_2   = CURSOR_CTR_PI.COVERAGE_END_2;      32360000
     USER_FILE_PI.COVERAGE_END_3   = CURSOR_CTR_PI.COVERAGE_END_3;      32370000
     USER_FILE_PI.COVERAGE_END_4   = CURSOR_CTR_PI.COVERAGE_END_4;      32380000
     USER_FILE_PI.COVERAGE_END_5   = CURSOR_CTR_PI.COVERAGE_END_5;      32390000
     USER_FILE_PI.COVERAGE_END_6   = CURSOR_CTR_PI.COVERAGE_END_6;      32400000
     USER_FILE_PI.COVERAGE_END_7   = CURSOR_CTR_PI.COVERAGE_END_7;      32410000
   END;                                                                 32420000
                                                                        32430000
 END R450_FILL_COV_241_470;                                             32440000
                                                                        32450000
1/********************************************************************/ 32460000
 /*                                                                  */ 32470000
 /* MODULE NAME      : R470_RETRIEVE_RCBV0470                        */ 32480000
 /*                                                                  */ 32490000
 /* DESCRIPTION      : SELECT ROW OF RCBV0470                        */ 32500000
 /*                                                                  */ 32510000
 /*                                                                  */ 32520000
 /********************************************************************/ 32530000
 R470_RETRIEVE_RCBV0470: PROC;                                          32540000
                                                                        32550000
   SW_SLC_FOUND                = FALSE;                                 32560000
                                                                        32570000
   TB_RCBV470                  = '';                                    32580000
   TB_RCBV470_I.INDNULL(*)     = 0;                                     32590000
   TB_RCBV470.SERVICE_LVL_CODE = WRK_SERVICE_LVL_CODE;                  32600000
                                    /* CHECK IF ROW WAS SAVED BEFORE */ 32610000
   IF  WRK_SERVICE_LVL_CODE = SAVE_RCBV470.SERVICE_LVL_CODE &           32620000
       WRK_SERVICE_LVL_CODE ¬= ''                                       32630000
   THEN DO;                                                             32640000
     TB_RCBV470          = SAVE_RCBV470;                                32650000
     TB_RCBV470_I        = SAVE_RCBV470_I;                              32660000
     SW_SLC_FOUND = TRUE;                                               32670000
   END;                                                                 32680000
   ELSE DO;                          /* SELECT OF ROW IN RCBV0470    */ 32690000
     CALL RCBISRM (ADDR(TB_RCBV470),                      /* RA01233 */ 32700000
                   ADDR(TB_RCBV470_I),                                  32710000
                   PTR_RETURN_AREA_BB,                                  32720000
                   PTR_INT_AREA);                                       32730000
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                32740000
       WHEN (0) DO;                                                     32750000
         SW_SLC_FOUND = TRUE;                                           32760000
       END;                                                             32770000
       WHEN (4) DO;                     /* INIT FIELDS               */ 32780000
         TB_RCBV470                  = '';                              32790000
         TB_RCBV470_I.INDNULL(*)     = -1;                              32800000
       END;                                                             32810000
       OTHERWISE DO;                                                    32820000
         CALL RCBDTBM_ERROR                                             32830000
                      (ADDR(RETURN_AREA_BB.RETURN_SQL),'DB2','#034');   32840000
       END;                                                             32850000
     END;                                                               32860000
   END;                                                                 32870000
                                                                        32880000
 END R470_RETRIEVE_RCBV0470;                                            32890000
                                                                        32900000
 /*********************************************************************/32910000
 /*                                                                   */32920000
 /* MODULE NAME      :  R480_RETRIEVE_TOM_INT_CONTRACT                */32930000
 /*                                                                   */32940000
 /* DESCRIPTION      :  RETRIEVE RCB070 PARAMETER                     */32950000
 /*                                                                   */32960000
 /*********************************************************************/32970000
 R480_RETRIEVE_TOM_INT_CONTRACT: PROC;                 /* SOC RB01290 */32980000
                                                                        32990000
  TB_RCBV500           = '';           /* RETRIEVE PARAMETER RCB070   */33000000
  TB_RCBV500_I         = '';                                            33010000
  TB_RCBP70S.NUMBER    = 'RCB070';                                      33020000
  TB_RCBP70S.CTRYNO    = WRK_CTRYNO;                                    33030000
                                                       /* SOC RB01305 */33040000
  /*IF (SWITCH_FUTURE_FLAG = TRUE) THEN                                 33050000
  /* TB_RCBP70S.TYPE_OF_CONTRACT = WRK_TYPE_OF_CONTRACT_FUT;            33060000
  /*ELSE                                               /* EOC RB01305 */33070000
   TB_RCBP70S.TYPE_OF_CONTRACT = WRK_TYPE_OF_CONTRACT;                  33080000
   CALL RCBI50M ('U',                                                   33090000
                  ADDR(TB_RCBV500),                                     33100000
                  ADDR(TB_RCBV500_I),                                   33110000
                  PTR_RETURN_AREA_BB,                                   33120000
                  PTR_INT_AREA);                                        33130000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  33140000
     WHEN(0)                                                            33150000
       DO;                                                              33160000
          PARM_RCBP70S = TB_RCBP70S, BY NAME;                           33170000
                                                      /* SOC RB01305 */ 33180000
     /*   IF (SWITCH_FUTURE_FLAG = TRUE) THEN                           33190000
     /*      SWITCH_TOM_INTERNAL_MACHINE_FUT = TRUE;                    33200000
     /*   ELSE DO; */                                 /* EOC RB01305 */ 33210000
             SWITCH_TOM_INTERNAL_MACHINE = TRUE;                        33220000
             CURSOR_INST_HW_V220.TYPE_OF_MAINT =                        33230000
                         PARM_RCBP70S.TOM_INTERNAL_CONTRACT;            33240000
     /*        END;       */                              /* RB01305 */ 33250000
       END;                                                             33260000
     WHEN(4)                                     /* NO RECORD FOUND */  33270000
       DO;                                                              33280000
                                                      /* SOC RB01305 */ 33290000
     /*  IF (SWITCH_FUTURE_FLAG = TRUE) THEN                            33300000
     /*    SWITCH_TOM_INTERNAL_MACHINE_FUT = FALSE;                     33310000
     /*  ELSE   */                                    /* EOC RB01305 */ 33320000
           SWITCH_TOM_INTERNAL_MACHINE = FALSE;                         33330000
       END;                                                             33340000
     WHEN(100)                                                          33350000
       DO;                                                              33360000
                                                      /* SOC RB01305 */ 33370000
     /*  IF (SWITCH_FUTURE_FLAG = TRUE) THEN                            33380000
     /*    SWITCH_TOM_INTERNAL_MACHINE_FUT = FALSE;                     33390000
     /*  ELSE                                                           33400000
     /*    SWITCH_TOM_INTERNAL_MACHINE_= FALSE; */                      33410000
           SWITCH_TOM_INTERNAL_MACHINE = FALSE;       /* EOC RB01305 */ 33420000
        END;                                                            33430000
     OTHERWISE                                                          33440000
      DO;                                                               33450000
        CALL RCBDTBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),             33460000
                           'DB2',                                       33470000
                           '#060');                                     33480000
      END;                                                              33490000
 END;                                                                   33500000
 END R480_RETRIEVE_TOM_INT_CONTRACT;                   /* EOC RB01290 */33510000
                                                       /* SOC RB01298 */33520000
                                                       /* SOC RB01305 */33530000
1/*********************************************************************/33540000
 /*                                                                   */33550000
 /* MODULE NAME      :  R490_BRAND_BAU_FUT                   RB01298  */33560000
 /*                                                                   */33570000
 /* DESCRIPTION      :  FUTURE DETAILS FOR BAU BRAND WARRANTY         */33580000
 /*                                                                   */33590000
 /*********************************************************************/33600000
 /*R490_BRAND_BAU_FUT: PROC;                                            33610000
 /*                                                                     33620000
 /*WRK_CONTRACT_NUMBER_FUT1         = '';                               33630000
 /*                                                                     33640000
 /*FILE_RCBDTB1.TYPE_MAINT_FUT      =                                   33650000
 /*                        CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY;      33660000
 /*FILE_RCBDTB1.MA_STATUS_FUT       =                                   33670000
 /*                       R011_TRANS_TPMNT(FILE_RCBDTB1.TYPE_MAINT_FUT);33680000
 /*FILE_RCBDTB1.LIABILITY_FUT       = 'IBM';                            33690000
 /*FILE_RCBDTB1.END_DATE_FUT        = CURSOR_INST_HW_V220.END_DATE;     33700000
 /*                                                                     33710000
 /*IF SW_HB_BAU_FUT  THEN                                               33720000
 /*  FILE_RCBDTB1.CONTRACT_NUMBER_FUT = 'HARDBUNDLE';                   33730000
 /*ELSE                                                                 33740000
 /*  FILE_RCBDTB1.CONTRACT_NUMBER_FUT = '';                             33750000
 /*                                                                     33760000
 /*EXEC SQL                                                             33770000
 /* SELECT  CONTRACT_NUMBER                                             33780000
 /*   INTO :WRK_CONTRACT_NUMBER_FUT1 :WRK_INDNULL                       33790000
 /*   FROM  RCBT0240_SERV_CTR                                           33800000
 /*  WHERE  PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE               33810000
 /*    AND  ORIGIN          = :SK_CURRENT_HW.ORIGIN                     33820000
 /*    AND  SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER            33830000
 /*    AND  COUNTRY_NUMBER  = :WRK_CTRYNO                               33840000
 /*    AND  EFFECTIVE_DATE >= :CURSOR_INST_HW_V220.F_SPLT_DATE          33850000
                                                 /* SOC CEDS00000489 */ 33860000
  /* AND  END_DATE       >= :CURSOR_INST_HW_V220.F_SPLT_DATE; */        33870000
 /*  AND  EFFECTIVE_DATE <= :CURSOR_INST_HW_V220.END_DATE               33880000
 /*  ORDER BY EFFECTIVE_DATE FETCH FIRST 1 ROW ONLY;                    33890000
                                                 /* EOC CEDS00000489 */ 33900000
 /*                                                                     33910000
 /* SELECT(SQLCODE);                                                    33920000
 /*   WHEN (0)                                                          33930000
 /*     FILE_RCBDTB1.CONTRACT_NUMBER_FUT = WRK_CONTRACT_NUMBER_FUT1;    33940000
 /*                                                                     33950000
 /*   WHEN (100);                                                       33960000
 /*                                                                     33970000
 /*   OTHERWISE                                                         33980000
 /*     DO;                                                             33990000
 /*       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),         34000000
 /*                                 'DB2',                              34010000
 /*                                 '#057');                            34020000
 /*     END;                                                            34030000
 /* END;                                                                34040000
 /*                                                                     34050000
 /*END R490_BRAND_BAU_FUT;                             /* EOC RB01298 */34060000
                                                      /* EOC RB01305 */ 34070000
1/*********************************************************************/34080000
 /*                                                                   */34090000
 /* MODULE NAME      :  R500_SERV_CTR_PERIOD                          */34100000
 /*                                                                   */34110000
 /* DESCRIPTION      :                                                */34120000
 /*                                                                   */34130000
 /*********************************************************************/34140000
 R500_SERV_CTR_PERIOD: PROC;                                            34150000
                                                                        34160000
   TB_RCBV240   = '';                                                   34170000
   TB_RCBV240_I = '';                                                   34180000
   TB_RCBV030   = '';                                                   34190000
   WRK_SERVICE_TYPE_IND = 0;                                            34200000
                                                                        34210000
                                                  /* SOC CEDS00000624 */34220000
                                                       /* SOC RB01320 */34230000
 /*IF WRK_BAU_REAL_SERIAL_NO_V125_IND = -1 THEN                         34240000
 DO;                                                                    34250000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 34260000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        34270000
 END;                                                                   34280000
 ELSE                                                                   34290000
 DO;                                                                    34300000
    WRK_ORIGIN  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,1,2);              34310000
    WRK_SEQ_NO  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,3);                34320000
 END;*/                                                /* EOC RB01320 */34330000
                                                                        34340000
   WRK_PRODUCT_TYPE_REAL    = SK_CURRENT_HW.PRODUCT_TYPE;               34350000
   WRK_ORIGIN_REAL          = SK_CURRENT_HW.ORIGIN;                     34360000
   WRK_SEQUENCE_NUMBER_REAL = SK_CURRENT_HW.SEQUENCE_NUMBER;            34370000
                                                                        34380000
   CALL R768_RETRIEVE_BAU_REAL_SER;                                     34390000
   IF SWITCH_BAU_ONLY | SWITCH_BAU_PI THEN                              34400000
   DO;                                                                  34410000
   IF BAU_REAL_SERNO = ' ' THEN                                         34420000
   DO;                                                                  34430000
      WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                               34440000
      WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                      34450000
   END;                                                                 34460000
   ELSE                                                                 34470000
   DO;                                                                  34480000
      WRK_ORIGIN  = SUBSTR(BAU_REAL_SERNO,1,2);                         34490000
      WRK_SEQ_NO  = SUBSTR(BAU_REAL_SERNO,3);                           34500000
   END;                                                                 34510000
   END;                                                                 34520000
                                                  /* EOC CEDS00000624 */34530000
                                                                        34540000
   EXEC SQL                                                             34550000
   SELECT CONTRACT_NUMBER                                               34560000
         ,SERVICE_MODULE_1                             /* SOC RB01305 */34570000
         ,SERVICE_MODULE_2                                              34580000
         ,SERVICE_MODULE_3                                              34590000
         ,SERVICE_MODULE_4                                              34600000
         ,SERVICE_MODULE_5                             /* EOC RB01305 */34610000
         ,SERVICE_START_DATE                                            34620000
         ,SERVICE_STOP_DATE                                             34630000
         ,COVERAGE_START_1                                              34640000
         ,COVERAGE_START_2                                              34650000
         ,COVERAGE_START_3                                              34660000
         ,COVERAGE_START_4                                              34670000
         ,COVERAGE_START_5                                              34680000
         ,COVERAGE_START_6                                              34690000
         ,COVERAGE_START_7                                              34700000
         ,COVERAGE_END_1                                                34710000
         ,COVERAGE_END_2                                                34720000
         ,COVERAGE_END_3                                                34730000
         ,COVERAGE_END_4                                                34740000
         ,COVERAGE_END_5                                                34750000
         ,COVERAGE_END_6                                                34760000
         ,COVERAGE_END_7                                                34770000
         ,SERVICE_TYPE                                                  34780000
         ,HVP_QUANTITY                                                  34790000
         ,SERVICE_LVL_CODE                                              34800000
         ,SOURCE_INDICATOR                                              34810000
         ,EFFECTIVE_DATE                                                34820000
         ,END_DATE                                                      34830000
    INTO :TB_RCBV240.CONTRACT_NUMBER    :WRK_V240_IND06                 34840000
        ,:TB_RCBV240.SERVICE_MODULE_1   :WRK_V240_IND10 /* SOC RB01305*/34850000
        ,:TB_RCBV240.SERVICE_MODULE_2   :WRK_V240_IND11                 34860000
        ,:TB_RCBV240.SERVICE_MODULE_3   :WRK_V240_IND12                 34870000
        ,:TB_RCBV240.SERVICE_MODULE_4   :WRK_V240_IND13                 34880000
        ,:TB_RCBV240.SERVICE_MODULE_5   :WRK_V240_IND14 /* EOC RB01305*/34890000
        ,:TB_RCBV240.SERVICE_START_DATE :WRK_V240_IND07                 34900000
        ,:TB_RCBV240.SERVICE_STOP_DATE  :WRK_V240_IND08                 34910000
        ,:TB_RCBV240.COVERAGE_START_1   :WRK_V240_IND19                 34920000
        ,:TB_RCBV240.COVERAGE_START_2   :WRK_V240_IND21                 34930000
        ,:TB_RCBV240.COVERAGE_START_3   :WRK_V240_IND23                 34940000
        ,:TB_RCBV240.COVERAGE_START_4   :WRK_V240_IND25                 34950000
        ,:TB_RCBV240.COVERAGE_START_5   :WRK_V240_IND27                 34960000
        ,:TB_RCBV240.COVERAGE_START_6   :WRK_V240_IND29                 34970000
        ,:TB_RCBV240.COVERAGE_START_7   :WRK_V240_IND31                 34980000
        ,:TB_RCBV240.COVERAGE_END_1     :WRK_V240_IND20                 34990000
        ,:TB_RCBV240.COVERAGE_END_2     :WRK_V240_IND22                 35000000
        ,:TB_RCBV240.COVERAGE_END_3     :WRK_V240_IND24                 35010000
        ,:TB_RCBV240.COVERAGE_END_4     :WRK_V240_IND26                 35020000
        ,:TB_RCBV240.COVERAGE_END_5     :WRK_V240_IND28                 35030000
        ,:TB_RCBV240.COVERAGE_END_6     :WRK_V240_IND30                 35040000
        ,:TB_RCBV240.COVERAGE_END_7     :WRK_V240_IND32                 35050000
        ,:TB_RCBV240.SERVICE_TYPE       :WRK_SERVICE_TYPE_IND           35060000
        ,:TB_RCBV240.HVP_QUANTITY       :WRK_V240_IND05                 35070000
        ,:TB_RCBV240.SERVICE_LVL_CODE   :WRK_V240_IND34                 35080000
        ,:TB_RCBV240.SOURCE_INDICATOR   :WRK_V240_IND35                 35090000
        ,:TB_RCBV240.EFFECTIVE_DATE     :WRK_V240_IND37                 35100000
        ,:TB_RCBV240.END_DATE           :WRK_V240_IND38                 35110000
   FROM RCBV0240_SERV_CTR                                               35120000
   WHERE PRODUCT_TYPE        = :SK_CURRENT_HW.PRODUCT_TYPE              35130000
                                                       /* SOC RC01349 */35140000
     AND ORIGIN              = SUBSTR(:WRK_BAU_REAL_SERIAL_NO_V125,1,2) 35150000
     AND SEQUENCE_NUMBER     = SUBSTR(:WRK_BAU_REAL_SERIAL_NO_V125,3)   35160000
                                                       /* EOC RC01349 */35170000
                                                       /* SOC RB01320 */35180000
  /* AND ORIGIN              = :SK_CURRENT_HW.ORIGIN                    35190000
     AND SEQUENCE_NUMBER     = :SK_CURRENT_HW.SEQUENCE_NUMBER */        35200000
  /* AND ORIGIN              = :WRK_ORIGIN           *//* SOC RC01349 */35210000
  /* AND SEQUENCE_NUMBER     = :WRK_SEQ_NO           *//* EOC RC01349 */35220000
                                                       /* EOC RB01320 */35230000
     AND COUNTRY_NUMBER      = :WRK_CTRYNO                              35240000
     AND :WRK_RUN_DATE BETWEEN EFFECTIVE_DATE AND END_DATE              35250000
           ;                                                            35260000
   SELECT (SQLCODE);                                                    35270000
     WHEN (0) DO;                                                       35280000
       SWITCH_EOC_SERV_CTR = FALSE;                                     35290000
     END;                                                               35300000
     WHEN (100) DO;                                                     35310000
       SWITCH_EOC_SERV_CTR = TRUE;                                      35320000
       IF SW_MAINT_02 = TRUE                                            35330000
       THEN DO;                       /* IF NO SERV CTR FOUND: ABEND */ 35340000
         PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                 35350000
         PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0186';               35360000
         PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                  35370000
         CALL RCB0M1M (PTR_INT_AREA);                                   35380000
         CALL RCBDTBM_ERROR (NULL, 'OTHER', '#035');                    35390000
       END;                                                             35400000
     END;                                                               35410000
     OTHERWISE DO;                                                      35420000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#036');                  35430000
     END;                                                               35440000
   END;                                                                 35450000
                                                                        35460000
 END R500_SERV_CTR_PERIOD;                                              35470000
1/*********************************************************************/35480000
 /*                                                                   */35490000
 /* MODULE NAME      :  R508_RETR_ADD_INFO                            */35500000
 /*                                                                   */35510000
 /* DESCRIPTION      :                                                */35520000
 /*                                                                   */35530000
 /*********************************************************************/35540000
 R508_RETR_ADD_INFO: PROC;                                              35550000
                                                                        35560000
                                                  /* SOC CEDS00000624 */35570000
                                                       /* SOC RB01320 */35580000
 /*IF WRK_BAU_REAL_SERIAL_NO_V125_IND = -1 THEN                         35590000
 DO;                                                                    35600000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 35610000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        35620000
 END;                                                                   35630000
 ELSE                                                                   35640000
 DO;                                                                    35650000
    WRK_ORIGIN  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,1,2);              35660000
    WRK_SEQ_NO  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,3);                35670000
 END;*/                                                /* EOC RB01320 */35680000
                                                                        35690000
 WRK_PRODUCT_TYPE_REAL    = SK_CURRENT_HW.PRODUCT_TYPE;                 35700000
 WRK_ORIGIN_REAL          = SK_CURRENT_HW.ORIGIN;                       35710000
 WRK_SEQUENCE_NUMBER_REAL = SK_CURRENT_HW.SEQUENCE_NUMBER;              35720000
                                                                        35730000
 CALL R768_RETRIEVE_BAU_REAL_SER;                                       35740000
                                                                        35750000
 IF SWITCH_BAU_ONLY | SWITCH_BAU_PI THEN                                35760000
 DO;                                                                    35770000
 IF BAU_REAL_SERNO = ' ' THEN                                           35780000
 DO;                                                                    35790000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 35800000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        35810000
 END;                                                                   35820000
 ELSE                                                                   35830000
 DO;                                                                    35840000
      WRK_ORIGIN  = SUBSTR(BAU_REAL_SERNO,1,2);                         35850000
      WRK_SEQ_NO  = SUBSTR(BAU_REAL_SERNO,3);                           35860000
 END;                                                                   35870000
 END;                                                                   35880000
                                                  /* EOC CEDS00000624 */35890000
   TB_RCBV300 = '';                                                     35900000
   EXEC SQL                                                             35910000
   SELECT MODEL_NUMBER                                                  35920000
     INTO :TB_RCBV300.MODEL_NUMBER                                      35930000
     FROM RCBV0300_HW_REAL                                              35940000
    WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE                 35950000
                                                       /* SOC RB01320 */35960000
   /* AND ORIGIN          = :SK_CURRENT_HW.ORIGIN                       35970000
      AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER */           35980000
      AND ORIGIN          = :WRK_ORIGIN                                 35990000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                 36000000
                                                       /* EOC RB01320 */36010000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 36020000
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        36030000
                              AND END_DATE                              36040000
   ;                                                                    36050000
                                                                        36060000
   SELECT (SQLCODE);                                                    36070000
     WHEN (0) ;                                                         36080000
     WHEN (100);                                                        36090000
     OTHERWISE DO;                                                      36100000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#037');                  36110000
     END;                                                               36120000
   END;                                                                 36130000
                                                                        36140000
   TB_RCBV110 = '';                                                     36150000
                                                                        36160000
   EXEC SQL                                                             36170000
   SELECT SOURCE_INDICATOR                                              36180000
     INTO :TB_RCBV110.SOURCE_INDICATOR                                  36190000
     FROM RCBV0110_HW_STATUS                                            36200000
    WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE                 36210000
                                                       /* SOC RB01320 */36220000
   /* AND ORIGIN          = :SK_CURRENT_HW.ORIGIN                       36230000
      AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER */           36240000
      AND ORIGIN          = :WRK_ORIGIN                                 36250000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                 36260000
                                                       /* EOC RB01320 */36270000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 36280000
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        36290000
                              AND END_DATE                              36300000
   ;                                                                    36310000
                                                                        36320000
   SELECT (SQLCODE);                                                    36330000
     WHEN (0) DO;                                                       36340000
       SW_SOURCE_IND_FOUND = TRUE;                                      36350000
     END;                                                               36360000
     WHEN (100) DO;                                                     36370000
       SW_SOURCE_IND_FOUND = FALSE;                                     36380000
     END;                                                               36390000
     OTHERWISE DO;                                                      36400000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#038');                  36410000
     END;                                                               36420000
   END;                                                                 36430000
                                                                        36440000
   TB_RCBV380 = '';                                    /* SOC RC01234 */36450000
   WRK_DP_SYSTEM_NUMBER = '';                          /* SOC RA01239 */36460000
                                                                        36470000
   EXEC SQL                                                             36480000
   SELECT  CPU_TYPE,                    /* SOC RA01239 */               36490000
           DP_SYSTEM_NUMBER                                             36500000
     INTO :TB_RCBV380.CPU_TYPE         :WRK_INDNULL,                    36510000
          :WRK_DP_SYSTEM_NUMBER        :WRK_INDNULL                     36520000
     FROM RCBV0380_HW_PR_MOD            /* EOC RA01239 */               36530000
    WHERE PRODUCT_TYPE    = :SK_CURRENT_HW.PRODUCT_TYPE                 36540000
                                                       /* SOC RB01320 */36550000
   /* AND ORIGIN          = :SK_CURRENT_HW.ORIGIN                       36560000
      AND SEQUENCE_NUMBER = :SK_CURRENT_HW.SEQUENCE_NUMBER */           36570000
      AND ORIGIN          = :WRK_ORIGIN                                 36580000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                 36590000
                                                       /* EOC RB01320 */36600000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 36610000
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        36620000
                              AND END_DATE                              36630000
   ;                                                                    36640000
                                                                        36650000
   SELECT (SQLCODE);                                                    36660000
     WHEN (0);                                                          36670000
     WHEN (100);                                                        36680000
     OTHERWISE DO;                                                      36690000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#039');                  36700000
     END;                                                               36710000
   END;                                                /* EOC RC01234 */36720000
                                                                        36730000
 END R508_RETR_ADD_INFO;                                                36740000
                                                                        36750000
1/*********************************************************************/36760000
 /*                                                                   */36770000
 /* MODULE NAME      :  R509_FILL_INFO                                */36780000
 /*                                                                   */36790000
 /* DESCRIPTION      :                                                */36800000
 /*                                                                   */36810000
 /*********************************************************************/36820000
 R509_FILL_INFO: PROC;                                                  36830000
                                                                        36840000
   FILE_RCBDTB1.COUNTRY_NUMBER     = WRK_CTRYNO;                        36850000
   FILE_RCBDTB1.PRODUCT_TYPE       = SK_CURRENT_HW.PRODUCT_TYPE;        36860000
   FILE_RCBDTB1.ORIGIN             = SK_CURRENT_HW.ORIGIN;              36870000
   FILE_RCBDTB1.SEQUENCE_NUMBER    = SK_CURRENT_HW.SEQUENCE_NUMBER;     36880000
                                                  /* SOC CEDS00000624 */36890000
                                                       /* SOC RB01320 */36900000
 /*FILE_RCBDTB1.SERIAL_LNG         = WRK_BAU_REAL_SERIAL_NO_V125;*/     36910000
                                                       /* EOC RB01320 */36920000
                                                       /* SOC RC01349 */36930000
   IF BAU_REAL_SERNO = ' ' THEN                                         36940000
   FILE_RCBDTB1.SERIAL_LNG         = FILE_RCBDTB1.ORIGIN||              36950000
                                     FILE_RCBDTB1.SEQUENCE_NUMBER;      36960000
   ELSE                                                                 36970000
                                                       /* EOC RC01349 */36980000
   FILE_RCBDTB1.SERIAL_LNG         = BAU_REAL_SERNO;                    36990000
                                                  /* EOC CEDS00000624 */37000000
                                                                        37010000
   FILE_RCBDTB1.MODEL_NUMBER       = TB_RCBV300.MODEL_NUMBER;           37020000
                                                                        37030000
   IF SW_SOURCE_IND_FOUND = TRUE                       /* SOC PTM1290 */37040000
   THEN DO;                                                             37050000
     FILE_RCBDTB1.INVENTORY_SOURCE = TB_RCBV110.SOURCE_INDICATOR;       37060000
                                                  /* SOC CEDS00000554 */37070000
     IF WRK_SW_HB_BAU = TRUE       &      /* IN HARDBUNDLE 2ND PERIOD */37080000
        SWITCH_EOC_SERV_CTR = TRUE  THEN  /* INDICATES NO T240 RECORD */37090000
      FILE_RCBDTB1.CONTRACT_SOURCE = TB_RCBV110.SOURCE_INDICATOR;       37100000
                                                  /* EOC CEDS00000554 */37110000
   END;                                                                 37120000
   ELSE DO;                                                             37130000
     FILE_RCBDTB1.INVENTORY_SOURCE = 'B'; /* NOT FOUND: 'B' (= BAU)   */37140000
                                                  /* SOC CEDS00000554 */37150000
     IF WRK_SW_HB_BAU = TRUE       &      /* IN HARDBUNDLE 2ND PERIOD */37160000
        SWITCH_EOC_SERV_CTR = TRUE  THEN  /* INDICATES NO T240 RECORD */37170000
      FILE_RCBDTB1.CONTRACT_SOURCE = 'B'; /* NOT FOUND: 'B' (= BAU)   */37180000
                                                  /* EOC CEDS00000554 */37190000
   END;                                                /* EOC PTM1290 */37200000
                                                                        37210000
   IF CURSOR_INST_HW_V220.WARRANTY_EXP_DATE ¬= '' THEN     /* RB01305 */37220000
    DO;                                                    /* RB01305 */37230000
     FILE_RCBDTB1.WARRANTY_EXP_DATE  =                                  37240000
                                CURSOR_INST_HW_V220.WARRANTY_EXP_DATE;  37250000
    END;                                               /* SOC RB01305 */37260000
   ELSE                                                                 37270000
    DO;                                                                 37280000
     IF SW_POSTWARR_BAU THEN                                            37290000
       FILE_RCBDTB1.WARRANTY_EXP_DATE  = POST_WED_BAU;                  37300000
    END;                                                                37310000
                                                       /* EOC RB01305 */37320000
   FILE_RCBDTB1.MARKETING_INSTDAT  =                                    37330000
                                CURSOR_INST_HW_V190.MARKETING_INSTDAT;  37340000
                                                      /* SOC RB01298 */ 37350000
   FILE_RCBDTB1.WARRANTY_SPLT_DATE =                                    37360000
                                CURSOR_INST_HW_V220.F_SPLT_DATE;        37370000
                                                      /* EOC RB01298 */ 37380000
   FILE_RCBDTB1.INVENTORY_CLASS    = 'HW';                              37390000
                                                       /* SOC RC01234 */37400000
   FILE_RCBDTB1.CPU_TYPE           = TB_RCBV380.CPU_TYPE;               37410000
                                                       /* EOC RC01234 */37420000
                                                       /* SOC RA01239 */37430000
   FILE_RCBDTB1.DP_SYSTEM_NUMBER   = WRK_DP_SYSTEM_NUMBER;              37440000
                                                       /* EOC RA01239 */37450000
 END R509_FILL_INFO;                                                    37460000
                                                                        37470000
1/*********************************************************************/37480000
 /*                                                                   */37490000
 /* MODULE NAME      :  R609_FETCH_CURSOR_INST_HW                     */37500000
 /*                                                                   */37510000
 /* DESCRIPTION      :                                                */37520000
 /*                                                                   */37530000
 /*********************************************************************/37540000
 R609_FETCH_CURSOR_INST_HW: PROC;                                       37550000
                                                                        37560000
   CURSOR_INST_HW_V190 = '';                                            37570000
   CURSOR_INST_HW_V170 = '';                                            37580000
   CURSOR_INST_HW_V220 = '';                                            37590000
   SW_BRAND_BAU        = FALSE;                       /* SOC RB01298 */ 37600000
   SW_FW_BAU           = FALSE;                                         37610000
   SW_HB_BAU           = FALSE;                                         37620000
                                                      /* SOC RB01305 */ 37630000
 /*SW_FW_BAU_FUT       = FALSE; */                                      37640000
 /*SW_HB_BAU_FUT       = FALSE; */                    /* EOC RB01298 */ 37650000
   SW_BRAND_BAU_FUT    = FALSE;                                         37660000
   SWITCH_FW_BAU_FUT   = FALSE;                                         37670000
   SWITCH_HB_BAU_FUT   = FALSE;                                         37680000
                                                                        37690000
   SWITCH_INTERNAL     = FALSE;                                         37700000
   SWITCH_LEASE_RENTAL = FALSE;                                         37710000
   WRK_PRECEDENCE_BAU  = '';                          /* EOC RB01305 */ 37720000
   SWITCH_INTERNAL_MACHINE_CTR = FALSE;               /* SOC RB01290 */ 37730000
   SWITCH_TOM_INTERNAL_MACHINE = FALSE;                                 37740000
                                                      /* SOC RB01305 */ 37750000
 /*SWITCH_TOM_INTERNAL_MACHINE_FUT = FALSE; */        /* EOC RB01290 */ 37760000
                                                      /* EOC RB01305 */ 37770000
                                                                        37780000
 /* SOC RA01239: INITIALIZE FUTURE WORKFIELDS IN R403 AND R404       */ 37790000
                                                      /* SOC RB01305 */ 37800000
 /*WRK_EFFECTIVE_DATE_FUT  = ''; */                                     37810000
 /*WRK_TYPE_MAINT_FUT      = ''; */                                     37820000
 /*WRK_MA_STATUS_FUT       = ''; */                                     37830000
 /*WRK_END_DATE_FUT        = ''; */                                     37840000
 /*WRK_CONTRACT_NUMBER_FUT = ''; */                                     37850000
                                                      /* EOC RB01305 */ 37860000
   WRK_TYPE_OF_CONTRACT    = '';                                        37870000
 /* E0C RA01239                                                      */ 37880000
                                                      /* SOC RB01298 */ 37890000
 /* FLEXIBLE_WARRANTY_BAU = FALSE;                   /* CEDS00000450 */ 37900000
                                                      /* EOC RB01298 */ 37910000
                                                       /* SOC RB01320 */37920000
   WRK_BAU_REAL_SERIAL_NO_V125     = ' ';                               37930000
   WRK_BAU_REAL_SERIAL_NO_V125_IND = ' ';                               37940000
                                                       /* EOC RB01320 */37950000
                                                                        37960000
   EXEC SQL                                                             37970000
   FETCH CURSOR_INST_HW                                                 37980000
   INTO :CURSOR_INST_HW_V190.PRODUCT_TYPE       :WRK_INDNULL            37990000
       ,:CURSOR_INST_HW_V190.ORIGIN             :WRK_INDNULL            38000000
       ,:CURSOR_INST_HW_V190.SEQUENCE_NUMBER    :WRK_INDNULL            38010000
       ,:CURSOR_INST_HW_V190.CUSTOMER_NUMBER    :WRK_INDNULL            38020000
       ,:CURSOR_INST_HW_V190.MARKETING_INSTDAT  :WRK_INDNULL            38030000
       ,:CURSOR_INST_HW_V190.EFFECTIVE_DATE     :WRK_INDNULL            38040000
       ,:CURSOR_INST_HW_V190.END_DATE           :WRK_INDNULL            38050000
       ,:CURSOR_INST_HW_V170.OU_CODE            :WRK_INDNULL            38060000
       ,:CURSOR_INST_HW_V170.EFFECTIVE_DATE     :WRK_INDNULL            38070000
       ,:CURSOR_INST_HW_V170.END_DATE           :WRK_INDNULL            38080000
       ,:CURSOR_INST_HW_V220.TYPE_OF_MAINT      :WRK_INDNULL            38090000
       ,:CURSOR_INST_HW_V220.TYPE_OF_WARRANTY   :WRK_INDNULL            38100000
       ,:CURSOR_INST_HW_V220.SERVICE_LVL_CODE   :WRK_SLC_V220_IND       38110000
       ,:CURSOR_INST_HW_V220.EFFECTIVE_DATE     :WRK_INDNULL            38120000
       ,:CURSOR_INST_HW_V220.END_DATE           :WRK_INDNULL            38130000
       ,:CURSOR_INST_HW_V220.WARRANTY_EXP_DATE  :WRK_INDNULL            38140000
                                                       /* SOC RB01281 */38150000
       ,:CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY :WRK_INDNULL            38160000
       ,:CURSOR_INST_HW_V220.F_SPLT_DATE        :WRK_INDNULL            38170000
                                                       /* EOC RB01281 */38180000
                                                       /* SOC RB01290 */38190000
       ,:CURSOR_INST_HW_V220.SOURCE_INDICATOR   :WRK_INDNULL            38200000
                                                       /* EOC RB01290 */38210000
                                                       /* SOC RB01298 */38220000
       ,:CURSOR_INST_HW_V220.SERVICE_LVL_CODE_2 :WRK_SLC_2_V220_IND     38230000
                                                       /* EOC RB01298 */38240000
                                                       /*SOC RB01320 */ 38250000
       ,:WRK_BAU_REAL_SERIAL_NO_V125  :WRK_BAU_REAL_SERIAL_NO_V125_IND  38260000
                                                       /*EOC RB01320 */ 38270000
       ;                                                                38280000
                                                                        38290000
   SELECT (SQLCODE);                                                    38300000
    WHEN (0) DO;                                                        38310000
     SWITCH_EOC_INST_HW = FALSE;                                        38320000
       SK_INST_HW.EOF             = '0';                                38330000
       SK_INST_HW.PRODUCT_TYPE    = CURSOR_INST_HW_V190.PRODUCT_TYPE;   38340000
       SK_INST_HW.ORIGIN          = CURSOR_INST_HW_V190.ORIGIN;         38350000
       SK_INST_HW.SEQUENCE_NUMBER = CURSOR_INST_HW_V190.SEQUENCE_NUMBER;38360000
                                                       /* SOC PTM1290 */38370000
       SK_INST_HW.EFFECTIVE_DATE  = CURSOR_INST_HW_V220.EFFECTIVE_DATE; 38380000
       SK_INST_HW.END_DATE        = CURSOR_INST_HW_V220.END_DATE;       38390000
                                                       /* EOC PTM1290 */38400000
                                                    /* SOC : RB01281 */ 38410000
              /* SELECTING FLEXIBLE WARRANTY AND HARDBUNDLE MACHINES */ 38420000
                                                       /* SOC RB01290 */38430000
     IF (((CURSOR_INST_HW_V220.TYPE_OF_MAINT = '2') |                   38440000
          (CURSOR_INST_HW_V220.TYPE_OF_MAINT = 'A') |                   38450000
          (CURSOR_INST_HW_V220.TYPE_OF_MAINT = 'E') |  /* RB01305     */38460000
          (CURSOR_INST_HW_V220.TYPE_OF_MAINT = 'B'))&                   38470000
          (CURSOR_INST_HW_V220.SOURCE_INDICATOR = 'C')) THEN            38480000
     DO;                                                                38490000
      SWITCH_INTERNAL_MACHINE_CTR = TRUE;                               38500000
     END;                                              /* EOC RB01290 */38510000
                                                       /* SOC RB01305 */38520000
     IF ((VERIFY(CURSOR_INST_HW_V220.TYPE_OF_MAINT,                     38530000
          WRK_TPMNT_VAL.TPMNT_INTERNAL ) = '0'     ) &                  38540000
         (CURSOR_INST_HW_V220.SOURCE_INDICATOR = '')  ) THEN            38550000
     DO;                                                                38560000
      SWITCH_INTERNAL = TRUE;                                           38570000
     END;                                                               38580000
                                                                        38590000
     IF ((VERIFY(CURSOR_INST_HW_V220.TYPE_OF_MAINT,                     38600000
          WRK_TPMNT_VAL.TPMNT_ST1 ) = '0'          ) &                  38610000
         (CURSOR_INST_HW_V220.SOURCE_INDICATOR = '')  ) THEN            38620000
     DO;                                                                38630000
      SWITCH_LEASE_RENTAL = TRUE;                                       38640000
     END;                                              /* EOC RB01305 */38650000
                                                                        38660000
     IF (CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY ¬= '' &                 38670000
          CURSOR_INST_HW_V220.F_SPLT_DATE        ¬= '' ) THEN           38680000
       DO;                                                              38690000
                                                      /* SOC RB01298 */ 38700000
  /*     IF (WRK_RUN_DATE > CURSOR_INST_HW_V220.F_SPLT_DATE &        */ 38710000
  /*         WRK_RUN_DATE <= CURSOR_INST_HW_V220.WARRANTY_EXP_DATE)  */ 38720000
  /*         THEN                                                    */ 38730000
  /*         FLEXIBLE_WARRANTY_BAU = TRUE;                           */ 38740000
  /*     ELSE                                                        */ 38750000
  /*         FLEXIBLE_WARRANTY_BAU = FALSE;                          */ 38760000
                                                                        38770000
         IF (WRK_RUN_DATE >= CURSOR_INST_HW_V220.EFFECTIVE_DATE &       38780000
             WRK_RUN_DATE < CURSOR_INST_HW_V220.F_SPLT_DATE)            38790000
         THEN                                                           38800000
           DO;                                                          38810000
             SW_BRAND_BAU = TRUE;                                       38820000
                                                      /* SOC RB01305 */ 38830000
   /*        IF (CURSOR_INST_HW_V220.WARRANTY_EXP_DATE =                38840000
   /*             R014_DATE_CALC (CURSOR_INST_HW_V220.F_SPLT_DATE,-1) & 38850000
   /*            VERIFY(CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY,         38860000
   /*                   WRK_HBTOM) = '0')                               38870000
   /*        THEN                                                       38880000
   /*          SW_HB_BAU_FUT = TRUE;                                    38890000
   /*        ELSE                                                       38900000
   /*          DO;                                                      38910000
   /*            IF VERIFY(CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY,      38920000
   /*                      WRK_FWTOW) = '0'                             38930000
   /*            THEN                                                   38940000
   /*              SW_FW_BAU_FUT = TRUE;                                38950000
   /*          END;                                                     38960000
                                                      /* EOC RB01305 */ 38970000
           END;                                                         38980000
         ELSE                                                           38990000
           DO;                                                          39000000
            IF (WRK_RUN_DATE >= CURSOR_INST_HW_V220.F_SPLT_DATE &       39010000
                WRK_RUN_DATE <= CURSOR_INST_HW_V220.WARRANTY_EXP_DATE & 39020000
                VERIFY(CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY,          39030000
                       WRK_FWTOW) = '0')                                39040000
            THEN                                                        39050000
                SW_FW_BAU = TRUE;                                       39060000
            ELSE                                                        39070000
              DO;                                                       39080000
               IF (VERIFY(CURSOR_INST_HW_V220.F_TYPE_OF_WARRANTY,       39090000
                          WRK_HBTOM) = '0')                             39100000
               THEN                                                     39110000
                 SW_HB_BAU = TRUE;                                      39120000
              END;                                                      39130000
           END;                                       /* EOC RB01298 */ 39140000
       END;                                         /* EOC : RB01281 */ 39150000
     END;                                                               39160000
     WHEN (100) DO;                                                     39170000
       SWITCH_EOC_INST_HW = TRUE;                                       39180000
       SK_INST_HW.EOF     = '1';                                        39190000
                                                      /* SOC RB01298 */ 39200000
    /* FLEXIBLE_WARRANTY_BAU = FALSE;                   /* RB01281 */   39210000
                                                      /* EOC RB01298 */ 39220000
     END;                                                               39230000
     OTHERWISE DO;                                                      39240000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#040');                  39250000
     END;                                                               39260000
   END;                                                                 39270000
                                                                        39280000
 END R609_FETCH_CURSOR_INST_HW;                                         39290000
                                                                        39300000
1/********************************************************************/ 39310000
 /*                                                                  */ 39320000
 /* MODULE NAME      :  R621_PROCESS_USER_EXIT                       */ 39330000
 /*                                                                  */ 39340000
 /* DESCRIPTION      :                                               */ 39350000
 /*                                                                  */ 39360000
 /********************************************************************/ 39370000
 R621_PROCESS_USER_EXIT: PROC;                                          39380000
                                                                        39390000
   IF SWITCH_USER_EXIT = TRUE                                           39400000
   THEN DO;                                                             39410000
     WRK_SAVE.PRODUCT_TYPE    = FILE_RCBDTB1.PRODUCT_TYPE;              39420000
     WRK_SAVE.ORIGIN          = FILE_RCBDTB1.ORIGIN;                    39430000
     WRK_SAVE.SEQUENCE_NUMBER = FILE_RCBDTB1.SEQUENCE_NUMBER;           39440000
                                                                        39450000
     USER_FILE_RCBDTB1 = FILE_RCBDTB1, BY NAME;                         39460000
                                                                        39470000
     IF DATA_ORIGIN = '2'                              /* SOC RC01234 */39480000
     THEN DO;                                                           39490000
         /* MOVED THE CODE AS IT SHOULD BE EXECUTED BEFORE USER EXIT */ 39500000
                                                      /* SOC RB01298 */ 39510000
  /*   /* PREFER PI IF BAU HAS STATUS 3 AND PI NOT */                   39520000
  /*   IF    VERIFY(USER_FILE_RCBDTB1.TYPE_OF_MAINT,                    39530000
  /*                  WRK_TPMNT_VAL.TPMNT_ST3) = '0'                    39540000
  /*   THEN DO;                                                         39550000
  /*     IF VERIFY(USER_FILE_PI.TYPE_OF_MAINT,                          39560000
  /*                  WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0'                   39570000
  /*     THEN DO;                                                       39580000
  /*        IF PARM_RCB005.PI_TO_BMT = 'Y'                              39590000
  /*        THEN DO;                                                    39600000
  /*          /*****************************************************/   39610000
  /*          /* CHANGE DEFAULT IF PI GIVES WARRANTY OR CONTRACT   */   39620000
  /*          /*  AND BAU GIVES PER CALL                           */   39630000
  /*          /*****************************************************/   39640000
  /*          USER_FILE_RCBDTB1= USER_FILE_PI, BY NAME ;                39650000
  /*        END;                                                        39660000
  /*     END;                                                           39670000
  /*   END;                                                             39680000
  /*                                                                    39690000
  /*   /* PREFER PI IF BAU HAS WARRANTY AND PI A CONTRACT */            39700000
  /*   IF   (VERIFY(USER_FILE_RCBDTB1.TYPE_OF_MAINT,                    39710000
  /*                  WRK_TPMNT_VAL.TPMNT_WAR) = '0' |                  39720000
  /*         VERIFY(USER_FILE_RCBDTB1.TYPE_OF_MAINT,   /* SOC RB01281 */39730000
  /*             SUBSTR(PARM_RCBP63.F_WARRANTY_MACHINE,1,1)) = '0')     39740000
  /*                                                   /* EOC RB01281 */39750000
  /*   THEN DO;                                                         39760000
  /*     IF USER_FILE_PI.CONTRACT_NUMBER ¬= ''                          39770000
  /*     THEN DO;                                                       39780000
  /*        IF PARM_RCB005.PI_TO_BMT = 'Y'                              39790000
  /*        THEN DO;                                                    39800000
  /*          /*****************************************************/   39810000
  /*          /* CHANGE DEFAULT IF PI GIVES CONTRACT AND BAU GIVES */   39820000
  /*          /*  BASE WARRANTY                                    */   39830000
  /*          /*****************************************************/   39840000
  /*          USER_FILE_RCBDTB1 = USER_FILE_PI, BY NAME ;               39850000
  /*        END;                                                        39860000
  /*     END;                                                           39870000
  /*   END;                                                             39880000
                                                      /* EOC RB01298 */ 39890000
       IF SUBSTR(FILE_RCBDTB1.CUSTOMER_NUMBER,1,2) = 'CI'               39900000
       THEN DO;                                                         39910000
         USER_FILE_RCBDTB1.CUSTOMER_NUMBER =                            39920000
                                          USER_FILE_BAU.CUSTOMER_NUMBER;39930000
         USER_FILE_RCBDTB1.OU_CODE         =                            39940000
                                          USER_FILE_BAU.OU_CODE;        39950000
       END;                                                             39960000
     END;                                              /* EOC RC01234 */39970000
                                                                        39980000
     CALL RCBDT1U (ADDR(SWITCH_USER_EXIT)                               39990000
                  ,ADDR(DATA_ORIGIN)                                    40000000
                  ,ADDR(USER_FILE_RCBDTB1)                              40010000
                  ,ADDR(USER_FILE_PI)                                   40020000
                  ,ADDR(USER_FILE_BAU)                                  40030000
                  ,ADDR(USER_EXTRA_INFO)                                40040000
                  ,PTR_INT_AREA);                                       40050000
                                                                        40060000
     IF SWITCH_USER_EXIT = TRUE                                         40070000
     THEN DO;                                                           40080000
       FILE_RCBDTB1 = USER_FILE_RCBDTB1, BY NAME;                       40090000
                       /* THE TOS IS NOT ALLOWED TO BE OVERWRITTEN ! */ 40100000
       FILE_RCBDTB1.COUNTRY_NUMBER  = WRK_CTRYNO;                       40110000
       FILE_RCBDTB1.PRODUCT_TYPE    = WRK_SAVE.PRODUCT_TYPE;            40120000
       FILE_RCBDTB1.ORIGIN          = WRK_SAVE.ORIGIN;                  40130000
       FILE_RCBDTB1.SEQUENCE_NUMBER = WRK_SAVE.SEQUENCE_NUMBER;         40140000
     END;                                                               40150000
   END;                                                                 40160000
                                                                        40170000
 END R621_PROCESS_USER_EXIT;                                            40180000
1/********************************************************************/ 40190000
 /*                                                                  */ 40200000
 /* MODULE NAME      :  R629_FETCH_CURSOR_PI_HW                      */ 40210000
 /*                                                                  */ 40220000
 /* DESCRIPTION      :                                               */ 40230000
 /*                                                                  */ 40240000
 /********************************************************************/ 40250000
 R629_FETCH_CURSOR_PI_HW: PROC;                                         40260000
                                                                        40270000
   CURSOR_HW_PI    = '';                                                40280000
   CURSOR_CTR_PI   = '';                                                40290000
   CURSOR_HW_PI_I  = '';                                                40300000
   CURSOR_CTR_PI_I = '';                                                40310000
   WRK_CUSTOMER_NUMBER_V10  = '';                      /* SOC RB01289*/ 40320000
   WRK_CUSTOMER_NUMBER_V11  = '';                                       40330000
   WRK_CUSTOMER_NUMBER_V190 = '';                      /* EOC RB01289*/ 40340000
   WRK_OU_CODE_V170         = '';                         /* RC01311 */ 40350000
                                                      /* SOC RB01298 */ 40360000
 /*FLEXIBLE_WARRANTY_PI = FALSE;                    /* CEDS00000450 */  40370000
   SW_BRAND_PI          = FALSE;                                        40380000
   SW_FW_PI             = FALSE;                                        40390000
   SW_HB_PI             = FALSE;                      /* EOC RB01298 */ 40400000
   SW_SPLTWAR_PI        = FALSE;                      /* SOC RB01305 */ 40410000
   SW_BRAND_PI_FUT      = FALSE;                                        40420000
   SW_FW_PI_FUT         = FALSE;                                        40430000
   SW_HB_PI_FUT         = FALSE;                                        40440000
   SW_SPLTWAR_PI_FUT    = FALSE;                      /* EOC RB01305 */ 40450000
                                                      /* SOC RB01320 */ 40460000
   WRK_PI_REAL_SERIAL_NO_V125      = ' ';                               40470000
   WRK_PI_REAL_SERIAL_NO_V125_IND  = ' ';                               40480000
                                                      /* EOC RB01320 */ 40490000
                                                                        40500000
   EXEC SQL                                                             40510000
   FETCH CURSOR_PI_HW                                                   40520000
   INTO :CURSOR_HW_PI.PRODUCT_TYPE          :WRK_V051_IND01             40530000
       ,:CURSOR_HW_PI.ORIGIN                :WRK_V051_IND02             40540000
       ,:CURSOR_HW_PI.SEQUENCE_NUMBER       :WRK_V051_IND03             40550000
       ,:WRK_PI_ORIGIN                      :WRK_INDNULL                40560000
       ,:CURSOR_HW_PI.MODEL_NUMBER          :WRK_V051_IND05             40570000
       ,:CURSOR_HW_PI.INSTALL_DATE          :WRK_V051_IND07             40580000
       ,:CURSOR_HW_PI.TYPE_OF_MAINT         :WRK_V051_IND08             40590000
       ,:CURSOR_HW_PI.TYPE_OF_WARRANTY      :WRK_V051_IND09             40600000
       ,:CURSOR_HW_PI.SERVICE_DELIV_FLAG    :WRK_V051_IND10             40610000
       ,:CURSOR_HW_PI.SERVICE_LVL_CODE_1    :WRK_V051_IND11             40620000
       ,:CURSOR_HW_PI.WARRANTY_SPLT_DATE    :WRK_V051_IND12             40630000
       ,:CURSOR_HW_PI.SERVICE_LVL_CODE_2    :WRK_V051_IND13             40640000
       ,:CURSOR_HW_PI.WARRANTY_EXP_DATE     :WRK_V051_IND14             40650000
       ,:CURSOR_HW_PI.CUSTOMER_NUMBER       :WRK_V051_IND15             40660000
       ,:CURSOR_HW_PI.OU_CODE               :WRK_V051_IND17             40670000
       ,:CURSOR_HW_PI.DEALER_NUMBER         :WRK_V051_IND18             40680000
       ,:CURSOR_HW_PI.SERVICE_LVL_CODE_C    :WRK_V051_IND23 /* RB01305*/40690000
       ,:CURSOR_HW_PI.SOURCE_INDICATOR      :WRK_V051_IND19             40700000
       ,:CURSOR_HW_PI.F_TYPE_OF_WARRANTY    :WRK_V051_IND21 /* RB01281*/40710000
       ,:CURSOR_HW_PI.WARRANTY_LIABILITY    :WRK_V051_IND22 /* RB01283*/40720000
       ,:CURSOR_CTR_PI.HVP_QUANTITY         :WRK_V241_IND05             40730000
       ,:CURSOR_CTR_PI.CONTRACT_NUMBER      :WRK_V241_IND06             40740000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_1     :WRK_V241_IND07 /* RB01305*/40750000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_2     :WRK_V241_IND08 /* RB01305*/40760000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_3     :WRK_V241_IND09 /* RB01305*/40770000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_4     :WRK_V241_IND10 /* RB01305*/40780000
       ,:CURSOR_CTR_PI.SERVICE_MODULE_5     :WRK_V241_IND11 /* RB01305*/40790000
       ,:CURSOR_CTR_PI.COVERAGE_START_1     :WRK_V241_IND12             40800000
       ,:CURSOR_CTR_PI.COVERAGE_START_2     :WRK_V241_IND14             40810000
       ,:CURSOR_CTR_PI.COVERAGE_START_3     :WRK_V241_IND16             40820000
       ,:CURSOR_CTR_PI.COVERAGE_START_4     :WRK_V241_IND18             40830000
       ,:CURSOR_CTR_PI.COVERAGE_START_5     :WRK_V241_IND20             40840000
       ,:CURSOR_CTR_PI.COVERAGE_START_6     :WRK_V241_IND22             40850000
       ,:CURSOR_CTR_PI.COVERAGE_START_7     :WRK_V241_IND24             40860000
       ,:CURSOR_CTR_PI.COVERAGE_END_1       :WRK_V241_IND13             40870000
       ,:CURSOR_CTR_PI.COVERAGE_END_2       :WRK_V241_IND15             40880000
       ,:CURSOR_CTR_PI.COVERAGE_END_3       :WRK_V241_IND17             40890000
       ,:CURSOR_CTR_PI.COVERAGE_END_4       :WRK_V241_IND19             40900000
       ,:CURSOR_CTR_PI.COVERAGE_END_5       :WRK_V241_IND21             40910000
       ,:CURSOR_CTR_PI.COVERAGE_END_6       :WRK_V241_IND23             40920000
       ,:CURSOR_CTR_PI.COVERAGE_END_7       :WRK_V241_IND25             40930000
       ,:CURSOR_CTR_PI.SERVICE_TYPE         :WRK_V241_IND26             40940000
       ,:CURSOR_CTR_PI.SERVICE_LVL_CODE     :WRK_V241_IND27             40950000
       ,:CURSOR_CTR_PI.EFFECTIVE_DATE       :WRK_V241_IND31             40960000
       ,:CURSOR_CTR_PI.END_DATE             :WRK_V241_IND32             40970000
       ,:CURSOR_CTR_PI.SOURCE_INDICATOR     :WRK_V241_IND33             40980000
       ,:CURSOR_CTR_PI.AUTHORISATION_CODE   :WRK_V241_IND34             40990000
                                                      /* CEDS00000321 */41000000
                                                       /* SOC RB01289 */41010000
       ,:WRK_CUSTOMER_NUMBER_V10            :WRK_CUSTNO_V10_IND         41020000
       ,:WRK_CUSTOMER_NUMBER_V11            :WRK_CUSTNO_V11_IND         41030000
       ,:WRK_CUSTOMER_NUMBER_V190           :WRK_CUSTNO_V190_IND        41040000
                                                       /* EOC RB01289 */41050000
                                                       /* SOC RC01311 */41060000
       ,:WRK_OU_CODE_V170                   :WRK_OU_CODE_V170_IND       41070000
                                                       /* EOC RC01311 */41080000
                                                       /* SOC RB01320 */41090000
       ,:WRK_PI_REAL_SERIAL_NO_V125     :WRK_PI_REAL_SERIAL_NO_V125_IND 41100000
                                                       /* EOC RB01320 */41110000
   ;                                                                    41120000
                                                                        41130000
   SELECT (SQLCODE);                                                    41140000
     WHEN (0) DO;                                                       41150000
       SWITCH_EOC_PI_HW         = FALSE;                                41160000
       SK_PI_HW                 = '';                                   41170000
       SK_PI_HW.EOF             = '0';                                  41180000
       SK_PI_HW.PRODUCT_TYPE    = CURSOR_HW_PI.PRODUCT_TYPE;            41190000
       SK_PI_HW.ORIGIN          = CURSOR_HW_PI.ORIGIN;                  41200000
       SK_PI_HW.SEQUENCE_NUMBER = CURSOR_HW_PI.SEQUENCE_NUMBER;         41210000
                                                       /* SOC RB01281 */41220000
              /* SELECTING FLEXIBLE WARRANTY AND HARDBUNDLE MACHINES */ 41230000
                                                                        41240000
        IF (CURSOR_HW_PI.F_TYPE_OF_WARRANTY ¬= '' &                     41250000
            CURSOR_HW_PI.WARRANTY_SPLT_DATE ¬= '' &                     41260000
            CURSOR_HW_PI.TYPE_OF_WARRANTY   ¬=                          41270000
                            CURSOR_HW_PI.F_TYPE_OF_WARRANTY) THEN       41280000
        DO;                                                             41290000
                                                      /* SOC RB01298 */ 41300000
   /*     IF (WRK_RUN_DATE > CURSOR_HW_PI.WARRANTY_SPLT_DATE &       */ 41310000
          IF (WRK_RUN_DATE >= CURSOR_HW_PI.INSTALL_DATE &               41320000
              WRK_RUN_DATE <  CURSOR_HW_PI.WARRANTY_SPLT_DATE)          41330000
          THEN                                                          41340000
            SW_BRAND_PI = TRUE;                                         41350000
          ELSE                                                          41360000
            DO;                                                         41370000
              IF (WRK_RUN_DATE >= CURSOR_HW_PI.WARRANTY_SPLT_DATE &     41380000
                                                      /* EOC RB01298 */ 41390000
                  WRK_RUN_DATE <= CURSOR_HW_PI.WARRANTY_EXP_DATE)       41400000
              THEN                                                      41410000
                                                      /* SOC RB01298 */ 41420000
   /*           FLEXIBLE_WARRANTY_PI = TRUE;                         */ 41430000
                DO;                                                     41440000
                  IF VERIFY(CURSOR_HW_PI.F_TYPE_OF_WARRANTY,            41450000
                            WRK_FWTOW) = '0'                            41460000
                  THEN                                                  41470000
                    SW_FW_PI = TRUE;                                    41480000
                  ELSE                                                  41490000
                    DO;                                                 41500000
                      IF VERIFY(CURSOR_HW_PI.F_TYPE_OF_WARRANTY,        41510000
                                WRK_HBTOM) = '0'                        41520000
                      THEN                                              41530000
                        SW_HB_PI = TRUE;                                41540000
                    END;                                                41550000
                END;                                                    41560000
            END;                                                        41570000
   /*     ELSE                                                          41580000
   /*       FLEXIBLE_WARRANTY_PI = FALSE;             /* EOC RB01298 */ 41590000
        END;                                           /* EOC RB01281 */41600000
                                                       /* SOC RB01305 */41610000
        IF (CURSOR_HW_PI.WARRANTY_SPLT_DATE ¬= '' &                     41620000
            SW_BRAND_PI  = FALSE                  &                     41630000
            SW_FW_PI     = FALSE                  &                     41640000
            SW_HB_PI     = FALSE                    ) THEN              41650000
        DO;                                                             41660000
          IF (WRK_RUN_DATE >= CURSOR_HW_PI.INSTALL_DATE &               41670000
              WRK_RUN_DATE <  CURSOR_HW_PI.WARRANTY_SPLT_DATE)          41680000
          THEN                                                          41690000
            SW_BRAND_PI = TRUE;                                         41700000
          ELSE                                                          41710000
            DO;                                                         41720000
              IF (WRK_RUN_DATE >= CURSOR_HW_PI.WARRANTY_SPLT_DATE &     41730000
                  WRK_RUN_DATE <= CURSOR_HW_PI.WARRANTY_EXP_DATE)       41740000
              THEN                                                      41750000
                SW_SPLTWAR_PI = TRUE;                                   41760000
            END;                                                        41770000
        END;                                           /* EOC RB01305 */41780000
       IF CURSOR_HW_PI.WARRANTY_SPLT_DATE = '3999-12-31'                41790000
       THEN DO;                                                         41800000
         CURSOR_HW_PI.WARRANTY_SPLT_DATE = '';                          41810000
         WRK_V051_IND12 = -1;                                           41820000
         CURSOR_HW_PI.WARRANTY_EXP_DATE  = '';                          41830000
         WRK_V051_IND14 = -1;                                           41840000
       END;                                                             41850000
       IF CURSOR_HW_PI.INSTALL_DATE = '3999-12-31'                      41860000
       THEN DO;                                                         41870000
         CURSOR_HW_PI.INSTALL_DATE = '';                                41880000
         WRK_V051_IND07 = -1;                                           41890000
       END;                                                             41900000
       IF CURSOR_CTR_PI.EFFECTIVE_DATE = '3999-12-31'                   41910000
       THEN DO;                                                         41920000
         CURSOR_CTR_PI.EFFECTIVE_DATE = '';                             41930000
         WRK_V241_IND31 = -1;                                           41940000
         CURSOR_CTR_PI.END_DATE   = '';                                 41950000
         WRK_V241_IND32 = -1;                                           41960000
       END;                                                             41970000
     END;                                                               41980000
     WHEN (100) DO;                                                     41990000
       SWITCH_EOC_PI_HW = TRUE;                                         42000000
       SK_PI_HW.EOF     = '1';                                          42010000
                                                      /* SOC RB01298 */ 42020000
   /*  FLEXIBLE_WARRANTY_PI  = FALSE;                      /* RB01281 */42030000
                                                      /* EOC RB01298 */ 42040000
     END;                                                               42050000
     OTHERWISE DO;                                                      42060000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#041');                  42070000
     END;                                                               42080000
   END;                                                                 42090000
                                                                        42100000
 END R629_FETCH_CURSOR_PI_HW;                                           42110000
                                                                        42120000
1/********************************************************************/ 42130000
 /*                                                                  */ 42140000
 /* MODULE NAME      : R700_INIT_COUNTRY                             */ 42150000
 /*                                                                  */ 42160000
 /* DESCRIPTION      :                                               */ 42170000
 /*                                                                  */ 42180000
 /********************************************************************/ 42190000
 R700_INIT_COUNTRY: PROC;                                               42200000
                                                                        42210000
   WRK_PROC_ID      = COUNTRY_AREA.PROC_ID;                             42220000
   WRK_CTRYNO       = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).CTRYNO;    42230000
   WRK_PGR_TYPE     = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).PGR_TYPE;  42240000
   WRK_SAVE            = '';                                            42250000
   WRK_CNT_COUNTRY     = 0;                                             42260000
   PARM_RCB005         = '';                                            42270000
   SK_PI_HW.EOF        = '0';                                           42280000
   SW_WARRANTY         = FALSE;                                         42290000
   SWITCH_EOC_PI_HW    = FALSE;                                         42300000
   SWITCH_BAU          = FALSE;                                         42310000
   SWITCH_PI           = FALSE;                                         42320000
   DATES_SWAPPED       = FALSE;                                         42330000
   SW_SDF_FOUND        = FALSE;                                         42340000
   SW_SAVE_1_FOUND     = FALSE;                                         42350000
   SW_SAVE_2_FOUND     = FALSE;                                         42360000
   SWITCH_EOC_OO_HW    = FALSE;                                         42370000
   SWITCH_EOC_INST_HW  = FALSE;                                         42380000
   SWITCH_EOC_SERV_CTR = FALSE;                                         42390000
   SW_FW_HB_MS         = FALSE;                           /* RB01298 */ 42400000
                                                /* LOCK TABLES       */ 42410000
   CALL R001_LOCK_TABLES;                                               42420000
                                                /* RETRIEVE RUN DATE */ 42430000
   RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                     42440000
   RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                               42450000
   RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                             42460000
                                                                        42470000
   CALL RCB020M (PTR_RUN_DATE_AREA,PTR_INT_AREA);                       42480000
                                                                        42490000
   IF RUN_DATE_AREA.RUN_DATE = ''       /* NO RUN DATE RCB001 FOUND  */ 42500000
   THEN                                                                 42510000
   DO;                                                                  42520000
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          42530000
   END;                                                                 42540000
   ELSE                                                                 42550000
   DO;                                                                  42560000
     WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                             42570000
   END;                                                                 42580000
                                                                        42590000
   PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                         42600000
   PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                               42610000
   PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                             42620000
   PARM_INT_AREA.MSG_VAR_CODES    = '';                                 42630000
   PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                               42640000
   PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                       42650000
   CALL RCB0M1M (PTR_INT_AREA);                                         42660000
                                                    /* SOC : RB01278 */ 42670000
                                                       /* SOC RC01362 */42671000
 /*TB_RCBV500           = '';                   /* RETRIEVE PARAMETER */42680000
 /*TB_RCBV500_I         = '';                                           42690000
 TB_RCBP103S.NUMBER   = 'RCB103';                                       42700000
 TB_RCBP103S.CTRYNO   = WRK_CTRYNO;                                     42710000
 TB_RCBP103S.PGR_TYPE = WRK_PGR_TYPE;                                   42720000
                                                                        42730000
 CALL RCBI50M ('U',                                                     42740000
               ADDR(TB_RCBV500),                                        42750000
               ADDR(TB_RCBV500_I),                                      42760000
               PTR_RETURN_AREA_BB,                                      42770000
               PTR_INT_AREA);                                           42780000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    42790000
   WHEN(0)                                                              42800000
     DO;                                                                42810000
       PARM_RCBP103S =  TB_RCBP103S, BY NAME;                           42820000
       IF PARM_RCBP103S.SRV_ON_BEHF_OF_VENDOR = 'Y' THEN                42830000
          SWITCH_VENDOR_SERVICE = TRUE;                                 42840000
       ELSE                                                             42850000
          SWITCH_VENDOR_SERVICE = FALSE;                                42860000
     END;                                                               42870000
   WHEN(4)                                        /* NO RECORD FOUND */ 42880000
 /*  DO;                                                                42890000
       SWITCH_VENDOR_SERVICE = FALSE;                                   42900000
     END;                                                               42910000
   OTHERWISE                                                            42920000
     DO;                                                                42930000
       CALL RCBDTBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),              42940000
                          'DB2',                                        42950000
                          '#042');                                      42960000
     END;                                                               42970000
 END;                                               /* EOC : RB01278 */ 42980000
                                                      /* EOC RC01362 */ 42981000
                                                    /* SOC : RB01281 */ 42990000
                                        /* RETRIEVE PARAMETER RCB064 */ 43000000
 /* GET TOM/TOW FROM RCB064 AT COUNTRY LEVEL THAT WILL BE APPLIED   */  43010000
 /* FOR FLEXIBLE WARRANTY AND HARDBUNDLE MACHINES OF THAT COUNTRY    */ 43020000
                                                                        43030000
 TB_RCBV500                 = '';                                       43040000
 TB_RCBV500_I               = '';                                       43050000
 TB_RCBP64S.NUMBER          = 'RCB064';                                 43060000
 TB_RCBP64S.CTRYNO          = WRK_CTRYNO;                               43070000
 /* TB_RCBP64S.PGR_TYPE        = WRK_PGR_TYPE;            /* RB01298 */ 43080000
                                                                        43090000
 CALL RCBI50M ('U',                                                     43100000
               ADDR (TB_RCBV500),                                       43110000
               ADDR (TB_RCBV500_I),                                     43120000
               PTR_RETURN_AREA_BB,                                      43130000
               PTR_INT_AREA);                                           43140000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   43150000
   WHEN(0)                                                              43160000
     DO;                                                                43170000
      PARM_RCBP64 = TB_RCBP64S, BY NAME;                                43180000
                                                      /* SOC RB01298 */ 43190000
      WRK_FWTOW = PARM_RCBP64.F_WARRANTY_MACHINE;                       43200000
      WRK_HBTOM = PARM_RCBP64.HARDBUNDLE;                               43210000
                                                                        43220000
 /*   IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1) ¬= ' ' |             */ 43230000
 /*      F_WARRANTY_MA_STATUS_GEO THEN                               */ 43240000
 /*      F_WARRANTY_MA_STATUS                    = TRUE;             */ 43250000
                                                      /* EOC RB01298 */ 43260000
     END;                                                               43270000
   WHEN(4)                                                              43280000
     DO;                                                                43290000
      WRK_HBTOM = PARM_RCBP63.HARDBUNDLE;             /* SOC RB01298 */ 43300000
      WRK_FWTOW = PARM_RCBP63.F_WARRANTY_MACHINE;                       43310000
                                                                        43320000
 /*   IF F_WARRANTY_MA_STATUS_GEO THEN                               */ 43330000
 /*      F_WARRANTY_MA_STATUS                    = TRUE;             */ 43340000
     END;                                             /* EOC RB01298 */ 43350000
 END;                                                                   43360000
                                                    /* EOC : RB01281 */ 43370000
                                                      /* SOC RB01298 */ 43380000
                                     /* RETRIEVE PARAMETER RCB071    */ 43390000
 /* GET MA_STATUS FROM RCB071 AT COUNTRY LEVEL FOR FLEXIBLE WARRANTY */ 43400000
 /* OR HARDBUNDLE MACHINES                                           */ 43410000
                                                                        43420000
 TB_RCBV500          = '';                                              43430000
 TB_RCBV500_I        = '';                                              43440000
 TB_RCBP71S.NUMBER   = 'RCB071';                                        43450000
 TB_RCBP71S.CTRYNO   = WRK_CTRYNO;                                      43460000
                                                                        43470000
 CALL RCBI50M ('U',                                                     43480000
               ADDR (TB_RCBV500),                                       43490000
               ADDR (TB_RCBV500_I),                                     43500000
               PTR_RETURN_AREA_BB,                                      43510000
               PTR_INT_AREA);                                           43520000
                                                                        43530000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    43540000
   WHEN (0)                                                             43550000
     DO;                                                                43560000
        PARM_RCBP71S = TB_RCBP71S;                                      43570000
        SW_FW_HB_MS = TRUE;                                             43580000
     END;                                                               43590000
   WHEN (4)                                                             43600000
        SW_FW_HB_MS = FALSE;                                            43610000
 END;                                                 /* EOC RB01298 */ 43620000
                                                                        43630000
   TB_RCBV500   = '';                       /* RETRIEVE EXTRACT PARM */ 43640000
   TB_RCBV500_I = '';                                                   43650000
   TB_RCBP05S.NUMBER   = 'RCB005';                                      43660000
   TB_RCBP05S.CTRYNO   = WRK_CTRYNO;                                    43670000
   TB_RCBP05S.PGR_TYPE = WRK_PGR_TYPE;                                  43680000
                                                                        43690000
0CALL RCBI50M ('U',                                       /* RC01219 */ 43700000
                 ADDR(TB_RCBV500),                                      43710000
                 ADDR(TB_RCBV500_I),                                    43720000
                 PTR_RETURN_AREA_BB,                                    43730000
                 PTR_INT_AREA);                                         43740000
                                                                        43750000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  43760000
     WHEN (0)                                                           43770000
     DO;                                                                43780000
       PARM_RCB005 = TB_RCBP05S, BY NAME;                               43790000
     END;                                                               43800000
     WHEN (4)                             /* NO EXTRACT PARM FOUND   */ 43810000
     DO;                                                                43820000
       PARM_RCB005.PI_TO_BMT   = 'N';                                   43830000
     END;                                                               43840000
     OTHERWISE DO;                                                      43850000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            43860000
                                 'DB2',                                 43870000
                                 '#043');                               43880000
     END;                                                               43890000
   END;                                                                 43900000
                                                                        43910000
   EXEC SQL                            /* INIT CURSOR CURSOR_INST_HW */ 43920000
   OPEN CURSOR_INST_HW;                                                 43930000
                                                                        43940000
   SELECT (SQLCODE);                                                    43950000
     WHEN (0);                                                          43960000
     OTHERWISE DO;                                                      43970000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#044');                  43980000
     END;                                                               43990000
   END;                                                                 44000000
                                                                        44010000
   CALL R609_FETCH_CURSOR_INST_HW;  /* FETCH 1ST OCCURENCE CURSOR_CU */ 44020000
                                                                        44030000
                                                      /* SOC RB01305 */ 44040000
   /* IF PARM_RCB005.PI_TO_BMT = 'Y'  */                                44050000
   IF PARM_RCB005.PI_TO_BMT = 'Y' | PARM_RCB005.PI_TO_BMT = 'I'         44060000
                                                      /* EOC RB01305 */ 44070000
   THEN DO;                                                             44080000
     EXEC SQL                          /* INIT CURSOR CURSOR_PI_HW   */ 44090000
     OPEN CURSOR_PI_HW;                                                 44100000
                                                                        44110000
     SELECT (SQLCODE);                                                  44120000
       WHEN (0);                                                        44130000
       OTHERWISE DO;                                                    44140000
         CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#045');                44150000
       END;                                                             44160000
     END;                                                               44170000
                                                                        44180000
     CALL R629_FETCH_CURSOR_PI_HW;                                      44190000
   END;                                                                 44200000
   ELSE DO;                                                             44210000
     SWITCH_EOC_PI_HW = TRUE;                                           44220000
     SK_PI_HW.EOF     = '1';                                            44230000
   END;                                                                 44240000
                                                       /* SOC RC01389 */44241000
 TB_RCBV500   = '';                         /* RETRIEVE NEW PARAMETER */44242000
 TB_RCBV500_I = '';                                                     44243000
 TB_RCBP159S.NUMBER   = 'RCB159';                                       44244000
 TB_RCBP159S.CTRYNO   = WRK_CTRYNO;                                     44245000
 TB_RCBP159S.PROC_ID  = COUNTRY_AREA.PROC_ID;                           44246000
                                                                        44247000
 CALL RCBI50M ('U',                                                     44248000
                ADDR(TB_RCBV500),                                       44249000
                ADDR(TB_RCBV500_I),                                     44249100
                PTR_RETURN_AREA_BB,                                     44249200
                PTR_INT_AREA);                                          44249300
                                                                        44249400
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    44249500
   WHEN (0) DO;                                                         44249600
     WRK_RETENTION = TB_RCBP159S.RETENTION;                             44249700
   END;                                                                 44249800
   WHEN (4)                                  /* WHEN RECORD NOT FOUND */44249900
     DO;                                                                44250000
       CALL RCBDTBM_ERROR (NULL, 'OTHER', '#081');                      44250100
     END;                                                               44250200
   OTHERWISE                                                            44250300
     DO;                                                                44250400
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            44250500
                                 'DB2',                                 44250600
                                 '#082');                               44250700
     END;                                                               44250800
                                                       /* EOC RC01389 */44250900
                                                                        44251000
 END R700_INIT_COUNTRY;                                                 44260000
1/*********************************************************************/44270000
 /*                                                                   */44280000
 /* MODULE NAME      :  R701_INIT_HW_OCCURENCE                        */44290000
 /*                                                                   */44300000
 /* DESCRIPTION      :                                                */44310000
 /*                                                                   */44320000
 /*********************************************************************/44330000
 R701_INIT_HW_OCCURENCE: PROC;                                          44340000
                                                                        44350000
   FILE_RCBDTB1                = '';                                    44360000
   USER_FILE_PI                = '';                                    44370000
   USER_FILE_BAU               = '';                       /* RC01234 */44380000
   USER_EXTRA_INFO             = '';                                    44390000
   WRK_PI_ORIGIN_TEMP          = '';                       /* RB01289 */44400000
   WRK_PERIOD_HVP_QUANTITY     = 1;                                     44410000
   WRK_SERVICE_LVL_CODE        = '';                  /* CEDS00000533 */44420000
   SWITCH_BAU                  = FALSE;                                 44430000
   SWITCH_PI                   = FALSE;                                 44440000
   SW_SLC_FOUND                = FALSE;                                 44450000
   SW_SOURCE_IND_FOUND         = FALSE;                    /* PTM1290 */44460000
   SK_CURRENT_HW               = SK_INST_HW;                            44470000
   PARM_INT_AREA.SEQUENCE_KEY  = STRING(SK_CURRENT_HW);                 44480000
   TEMP_CURR_END_DATE          = '';                   /* SOC RB01305 */44490000
   WRK_SW_FW_BAU               = FALSE;                                 44500000
   WRK_SW_HB_BAU               = FALSE;                                 44510000
   WRK_SW_FW_PI                = FALSE;                                 44520000
   WRK_SW_HB_PI                = FALSE;                                 44530000
   WRK_PI_HW_SLC               = '';                                    44540000
   WRK_PI_CTR_START_DATE       = '';                                    44550000
   WRK_PI_CTR_END_DATE         = '';                                    44560000
   WRK_PI_HW_START_DATE        = '';                                    44570000
   WRK_PI_HW_END_DATE          = '';                                    44580000
   SWITCH_WRITE_RCBDTB1        = FALSE;                /* EOC RB01305 */44590000
                                                                        44600000
 END R701_INIT_HW_OCCURENCE;                                            44610000
                                                                        44620000
1/*********************************************************************/44630000
 /*                                                                   */44640000
 /* MODULE NAME      :  R710_PROCESS_PI_HW                            */44650000
 /*                                                                   */44660000
 /* DESCRIPTION      :                                                */44670000
 /*                                                                   */44680000
 /*********************************************************************/44690000
 R710_PROCESS_PI_HW: PROC;                                              44700000
                                                                        44710000
   SW_WARR_PI           = FALSE;                          /* RB01298 */ 44720000
   SW_MAINT_PI          = FALSE;                          /* RB01298 */ 44730000
   WRK_SERVICE_LVL_CODE = '';                        /* CEDS00000533 */ 44740000
                                                      /* SOC RB01305 */ 44750000
   SW_PROCESS_PERCALL   = FALSE;                                        44760000
   POST_WED_PI                     ='';                                 44770000
   SW_POSTWARR_PI                  = FALSE;                             44780000
   TEMP_RUN_DATE_FUT               = WRK_RUN_DATE;                      44790000
   TEMP_T051_SPLT_DATE_FUT         = CURSOR_HW_PI.WARRANTY_SPLT_DATE;   44800000
   TEMP_SW_BRAND_PI_FUT            = SW_BRAND_PI;                       44810000
   WRK_SW_FW_PI                    = SW_FW_PI;                          44820000
   WRK_SW_HB_PI                    = SW_HB_PI;                          44830000
                                                                        44840000
   WRK_PRODUCT_TYPE_FUT            = CURSOR_HW_PI.PRODUCT_TYPE;         44850000
   WRK_ORIGIN_FUT                  = CURSOR_HW_PI.ORIGIN;               44860000
   WRK_SEQUENCE_NUMBER_FUT         = CURSOR_HW_PI.SEQUENCE_NUMBER;      44870000
                                                                        44880000
                                                      /* EOC RB01305 */ 44890000
                                                       /* SOC RB01320 */44900000
   WRK_SERIAL_LNG_FUT              = WRK_PI_REAL_SERIAL_NO_V125;        44910000
                                                       /* EOC RB01320 */44920000
   USER_FILE_PI.COUNTRY_NUMBER     = WRK_CTRYNO;                        44930000
   USER_FILE_PI.PRODUCT_TYPE       = CURSOR_HW_PI.PRODUCT_TYPE;         44940000
   USER_FILE_PI.ORIGIN             = CURSOR_HW_PI.ORIGIN;               44950000
   USER_FILE_PI.SEQUENCE_NUMBER    = CURSOR_HW_PI.SEQUENCE_NUMBER;      44960000
                                                       /* SOC RB01320 */44970000
   USER_FILE_PI.SERIAL_LNG         = WRK_PI_REAL_SERIAL_NO_V125;        44980000
                                                       /* EOC RB01320 */44990000
   USER_FILE_PI.INVENTORY_CLASS    = 'HW';                              45000000
   USER_FILE_PI.HVP_QUANTITY       = CURSOR_CTR_PI.HVP_QUANTITY;        45010000
   USER_FILE_PI.MODEL_NUMBER       = CURSOR_HW_PI.MODEL_NUMBER;         45020000
   USER_FILE_PI.DEALER_NUMBER      = CURSOR_HW_PI.DEALER_NUMBER;        45030000
                                                      /* SOC RC01352 */ 45040000
   IF SWITCH_RCB156_EMEA = TRUE  THEN                                   45050000
   USER_FILE_PI.INVENTORY_SOURCE   = 'P';                               45060000
   ELSE                                                                 45070000
                                                      /* EOC RC01352 */ 45080000
                                                  /* SOC CEDS00000554 */45090000
 /*USER_FILE_PI.INVENTORY_SOURCE   = 'P'; */  /* DATA COMING FROM PI  */45100000
   USER_FILE_PI.INVENTORY_SOURCE   = CURSOR_HW_PI.SOURCE_INDICATOR;     45110000
                                                  /* EOC CEDS00000554 */45120000
   USER_FILE_PI.SERVICE_LVL_CODE_1 = CURSOR_HW_PI.SERVICE_LVL_CODE_1;   45130000
   USER_FILE_PI.SERVICE_LVL_CODE_2 = CURSOR_HW_PI.SERVICE_LVL_CODE_2;   45140000
   USER_FILE_PI.SERVICE_DELIV_FLAG = CURSOR_HW_PI.SERVICE_DELIV_FLAG;   45150000
   USER_FILE_PI.WARRANTY_SPLT_DATE = CURSOR_HW_PI.WARRANTY_SPLT_DATE;   45160000
   USER_FILE_PI.WARRANTY_EXP_DATE  = CURSOR_HW_PI.WARRANTY_EXP_DATE;    45170000
   USER_FILE_PI.MARKETING_INSTDAT  = CURSOR_HW_PI.INSTALL_DATE;         45180000
   USER_FILE_PI.SERVICE_START_DATE = CURSOR_CTR_PI.EFFECTIVE_DATE;      45190000
   USER_FILE_PI.SERVICE_END_DATE   = CURSOR_CTR_PI.END_DATE;            45200000
   USER_FILE_PI.CONTRACT_SOURCE    = CURSOR_CTR_PI.SOURCE_INDICATOR;    45210000
   USER_FILE_PI.TYPE_OF_WARRANTY   = CURSOR_HW_PI.TYPE_OF_WARRANTY;     45220000
   USER_FILE_PI.CUSTOMER_NUMBER    = CURSOR_HW_PI.CUSTOMER_NUMBER;      45230000
   USER_FILE_PI.OU_CODE            = CURSOR_HW_PI.OU_CODE;              45240000
   USER_FILE_PI.LIABILITY          = CURSOR_HW_PI.WARRANTY_LIABILITY;   45250000
                                                          /* RB01283 */ 45260000
   USER_FILE_PI.CONTRACT_NUMBER    = CURSOR_CTR_PI.CONTRACT_NUMBER;     45270000
   USER_FILE_PI.SERVICE_TYPE       = CURSOR_CTR_PI.SERVICE_TYPE;        45280000
                                                      /* SOC RB01305 */ 45290000
   WRK_PI_CTR_START_DATE           = CURSOR_CTR_PI.EFFECTIVE_DATE;      45300000
   WRK_PI_CTR_END_DATE             = CURSOR_CTR_PI.END_DATE;            45310000
   WRK_PI_HW_START_DATE            = CURSOR_HW_PI.INSTALL_DATE;         45320000
   WRK_PI_HW_END_DATE              = CURSOR_HW_PI.WARRANTY_EXP_DATE;    45330000
   USER_FILE_PI.SERVICE_MODULE(1)  = CURSOR_CTR_PI.SERVICE_MODULE_1;    45340000
   USER_FILE_PI.SERVICE_MODULE(2)  = CURSOR_CTR_PI.SERVICE_MODULE_2;    45350000
   USER_FILE_PI.SERVICE_MODULE(3)  = CURSOR_CTR_PI.SERVICE_MODULE_3;    45360000
   USER_FILE_PI.SERVICE_MODULE(4)  = CURSOR_CTR_PI.SERVICE_MODULE_4;    45370000
   USER_FILE_PI.SERVICE_MODULE(5)  = CURSOR_CTR_PI.SERVICE_MODULE_5;    45380000
                                                      /* EOC RB01305 */ 45390000
                                                      /* SOC RB01298 */ 45400000
   IF  WRK_RUN_DATE <= CURSOR_HW_PI.WARRANTY_EXP_DATE  &                45410000
       (VERIFY(CURSOR_HW_PI.TYPE_OF_WARRANTY,                           45420000
               WRK_TPMNT_VAL.TPMNT_WAR) = '0' |                         45430000
                                                      /* SOC RB01305 */ 45440000
    /*  SW_BRAND_PI | SW_FW_PI | SW_HB_PI) */                           45450000
        SW_BRAND_PI | SW_FW_PI | SW_HB_PI | SW_SPLTWAR_PI)              45460000
                                                      /* EOC RB01305 */ 45470000
   THEN                                                                 45480000
     DO;                                                                45490000
       SW_WARR_PI = TRUE;                                               45500000
       WRK_PRECEDENCE_PI = '5';                            /* RB01305 */45510000
       WRK_PI_HW_SLC = CURSOR_HW_PI.SERVICE_LVL_CODE_1;    /* RB01305 */45520000
                                                                        45530000
       USER_FILE_PI.SERVICE_START_DATE = CURSOR_HW_PI.INSTALL_DATE;     45540000
       USER_FILE_PI.SERVICE_END_DATE  = CURSOR_HW_PI.WARRANTY_EXP_DATE; 45550000
                                                                        45560000
       IF SW_BRAND_PI                                                   45570000
       THEN                                                             45580000
         DO;                                                            45590000
           USER_FILE_PI.SERVICE_END_DATE   =                            45600000
                  R014_DATE_CALC (CURSOR_HW_PI.WARRANTY_SPLT_DATE,-1);  45610000
                                                     /* SOC RB01305 */  45620000
           WRK_PI_HW_END_DATE =                                         45630000
                      USER_FILE_PI.SERVICE_END_DATE; /* EOC RB01305 */  45640000
         END;                                                           45650000
       ELSE                                                             45660000
         DO;                                                            45670000
                                                       /* SOC RB01305 */45680000
     /*    IF SW_FW_PI | SW_HB_PI   */                                  45690000
           IF SW_FW_PI | SW_HB_PI | SW_SPLTWAR_PI                       45700000
                                                       /* EOC RB01305 */45710000
           THEN                                                         45720000
             DO;                                                        45730000
               USER_FILE_PI.SERVICE_START_DATE =                        45740000
                                     CURSOR_HW_PI.WARRANTY_SPLT_DATE;   45750000
                                                       /* SOC RB01305 */45760000
               WRK_PI_HW_START_DATE =                                   45770000
                     USER_FILE_PI.SERVICE_START_DATE;                   45780000
               IF SW_SPLTWAR_PI THEN                                    45790000
                 WRK_PI_HW_SLC = CURSOR_HW_PI.SERVICE_LVL_CODE_2;       45800000
               ELSE IF SW_FW_PI THEN              /* SOC CEDS00000551 */45810000
                 WRK_PI_HW_SLC = CURSOR_HW_PI.SERVICE_LVL_CODE_1;       45820000
                                                  /* EOC CEDS00000551 */45830000
               ELSE                                                     45840000
                 WRK_PI_HW_SLC = '';                   /* EOC RB01305 */45850000
             END;                                                       45860000
         END;                                                           45870000
     END;                                                               45880000
   ELSE                                               /* SOC RB01305 */ 45890000
     DO;                                                                45900000
       IF CURSOR_HW_PI.WARRANTY_EXP_DATE < WRK_RUN_DATE THEN            45910000
         DO;                                                            45920000
           SW_POSTWARR_PI = TRUE;                                       45930000
           POST_WED_PI = CURSOR_HW_PI.WARRANTY_EXP_DATE;                45940000
           USER_FILE_PI.TYPE_OF_WARRANTY   = '';                        45950000
         END;                                                           45960000
     END;                                             /* EOC RB01305 */ 45970000
                                                                        45980000
   IF (WRK_RUN_DATE >= CURSOR_CTR_PI.EFFECTIVE_DATE  &                  45990000
       WRK_RUN_DATE <= CURSOR_CTR_PI.END_DATE)                          46000000
   THEN                                                                 46010000
   DO;                                                    /* RB01305 */ 46020000
     SW_MAINT_PI = TRUE;                                                46030000
     WRK_PRECEDENCE_PI = '7';                             /* RB01305 */ 46040000
   END;                                                   /* RB01305 */ 46050000
                                                      /* EOC RB01298 */ 46060000
   SELECT(WRK_PI_ORIGIN);                                               46070000
  /* WHEN('T241','BOTH') */                               /* RB01278 */ 46080000
     WHEN('BOTH')                                         /* RB01278 */ 46090000
     DO;                                                                46100000
                    /* -- PI WARRANTY, PI CONTRACT -- /* SOC RB01298 */ 46110000
       IF (SW_WARR_PI & SW_MAINT_PI)                                    46120000
       THEN                                                             46130000
         DO;                                                            46140000
                                                      /* SOC RB01305 */ 46150000
           IF CURSOR_CTR_PI.EFFECTIVE_DATE >                            46160000
                    USER_FILE_PI.SERVICE_START_DATE  THEN               46170000
             USER_FILE_PI.SERVICE_START_DATE =                          46180000
                                  CURSOR_CTR_PI.EFFECTIVE_DATE;         46190000
                                                                        46200000
           IF CURSOR_CTR_PI.END_DATE <                                  46210000
                    USER_FILE_PI.SERVICE_END_DATE   THEN                46220000
             USER_FILE_PI.SERVICE_END_DATE =                            46230000
                                  CURSOR_CTR_PI.END_DATE;               46240000
                                                                        46250000
    /*     IF SW_FW_PI | SW_HB_PI */                                    46260000
           IF SW_FW_PI | SW_HB_PI | SW_SPLTWAR_PI     /* EOC RB01305 */ 46270000
           THEN                                                         46280000
             DO;                                                        46290000
              IF SW_FW_PI | SW_HB_PI THEN                 /* RB01305 */ 46300000
               USER_FILE_PI.TYPE_OF_WARRANTY =                          46310000
                                     CURSOR_HW_PI.F_TYPE_OF_WARRANTY;   46320000
              ELSE                                    /* SOC RB01305 */ 46330000
               USER_FILE_PI.TYPE_OF_WARRANTY =                          46340000
                                     CURSOR_HW_PI.TYPE_OF_WARRANTY;     46350000
                                                                        46360000
               IF (WRK_V051_IND13 ¬= -1) &                              46370000
                  (SW_SPLTWAR_PI )  THEN                                46380000
                 USER_FILE_PI.BASE_WARRANTY_SLC                         46390000
                    = CURSOR_HW_PI.SERVICE_LVL_CODE_2;                  46400000
                                                      /* EOC RB01305 */ 46410000
                                                 /* SOC CEDS00000551 */ 46420000
               IF (WRK_V051_IND11 ¬= -1) &                              46430000
                  (SW_FW_PI )  THEN                                     46440000
                 USER_FILE_PI.BASE_WARRANTY_SLC                         46450000
                    = CURSOR_HW_PI.SERVICE_LVL_CODE_1;                  46460000
                                                                        46470000
                                                 /* EOC CEDS00000551 */ 46480000
             END;                                                       46490000
           ELSE                                                         46500000
             DO;                                                        46510000
               USER_FILE_PI.TYPE_OF_WARRANTY =                          46520000
                                     CURSOR_HW_PI.TYPE_OF_WARRANTY;     46530000
               IF (WRK_V051_IND11 ¬= -1)  THEN        /* SOC RB01305 */ 46540000
                 USER_FILE_PI.BASE_WARRANTY_SLC                         46550000
                    = CURSOR_HW_PI.SERVICE_LVL_CODE_1;                  46560000
                                                      /* EOC RB01305 */ 46570000
             END;                                                       46580000
                                                                        46590000
           USER_FILE_PI.MA_STATUS          =                            46600000
                       R011_TRANS_TPMNT(USER_FILE_PI.TYPE_OF_WARRANTY); 46610000
         END;                                                           46620000
       ELSE                                                             46630000
         DO;                                          /* EOC RB01298 */ 46640000
           IF CURSOR_HW_PI.TYPE_OF_MAINT = 'G' THEN       /* RB01278 */ 46650000
           DO;                                            /* RB01283 */ 46660000
             USER_FILE_PI.TYPE_OF_MAINT = 'G';            /* RB01278 */ 46670000
             USER_FILE_PI.LIABILITY     = 'LEN';          /* RB01283 */ 46680000
           END;                                           /* RB01283 */ 46690000
           ELSE                                           /* RB01278 */ 46700000
             DO;                                          /* RB01283 */ 46710000
               USER_FILE_PI.TYPE_OF_MAINT = '2';                        46720000
                          /*RETRIEVE COVERAGE-HOURS FROM 470 VIA 241 */ 46730000
               USER_FILE_PI.LIABILITY     = 'IBM';        /* RB01283 */ 46740000
             END;                                         /* RB01283 */ 46750000
                                                      /* SOC RB01298 */ 46760000
           USER_FILE_PI.MA_STATUS        =                              46770000
                        R011_TRANS_TPMNT(USER_FILE_PI.TYPE_OF_MAINT);   46780000
         END;                                         /* EOC RB01298 */ 46790000
                                                                        46800000
       IF WRK_V241_IND27  ¬= -1                               /* SLC */ 46810000
       THEN DO;                                                         46820000
                                                      /* SOC RB01298 */ 46830000
         USER_FILE_PI.SERVICE_LVL_CODE_1 =                              46840000
                                    CURSOR_CTR_PI.SERVICE_LVL_CODE;     46850000
         USER_FILE_PI.SERVICE_LVL_CODE_2 = '';                          46860000
                                                      /* EOC RB01298 */ 46870000
         WRK_SERVICE_LVL_CODE = CURSOR_CTR_PI.SERVICE_LVL_CODE;         46880000
         CALL R470_RETRIEVE_RCBV0470;                                   46890000
                                /* SAVE THE ROW IF NEW ROW RETRIEVED */ 46900000
         IF SW_SLC_FOUND                                                46910000
         THEN DO;                                                       46920000
           SAVE_RCBV470   = TB_RCBV470;                                 46930000
           SAVE_RCBV470_I = TB_RCBV470_I;                               46940000
         END;                                                           46950000
       END;                                                             46960000
       ELSE DO;                                        /* SOC RB01320 */46970000
         USER_FILE_PI.SERVICE_LVL_CODE_1 =                              46980000
                                    CURSOR_CTR_PI.SERVICE_LVL_CODE;     46990000
         USER_FILE_PI.SERVICE_LVL_CODE_2 = '';                          47000000
                                                      /* EOC RB01298 */ 47010000
         WRK_SERVICE_LVL_CODE = CURSOR_CTR_PI.SERVICE_LVL_CODE;         47020000
         CALL R470_RETRIEVE_RCBV0470;                                   47030000
                                /* SAVE THE ROW IF NEW ROW RETRIEVED */ 47040000
         IF SW_SLC_FOUND                                                47050000
         THEN DO;                                                       47060000
           SAVE_RCBV470   = TB_RCBV470;                                 47070000
           SAVE_RCBV470_I = TB_RCBV470_I;                               47080000
         END;                                                           47090000
       END;                                            /* EOC RB01320 */47100000
       CALL R450_FILL_COV_241_470;                                      47110000
                                                      /* SOC RC01234 */ 47120000
                                                      /* SOC RB01299 */ 47130000
 /*********  MOVED THE BELOW CODE AS PER A11 REQUIREMENT  ************/ 47140000
   /*  TB_RCBV240.SERVICE_TYPE      = CURSOR_CTR_PI.SERVICE_TYPE;    */ 47150000
                                                                        47160000
   /*  CALL R445_RETRIEVE_SERVICE_DELIVERY;                          */ 47170000
   /*  IF TB_RCBV640_I.INDNULL(2) ¬= -1                              */ 47180000
   /*  THEN                                                          */ 47190000
   /*    USER_FILE_PI.SERVICE_DLVR_METHD                             */ 47200000
   /*                             = TB_RCBV640.SERVICE_DLVR_METHD;   */ 47210000
                                                      /* EOC RB01299 */ 47220000
   /*                                                    SOC RB01298 */ 47230000
   /*  USER_FILE_PI.MA_STATUS        =                                  47240000
   /*                     R011_TRANS_TPMNT(USER_FILE_PI.TYPE_OF_MAINT); 47250000
   /*                                                    EOC RB01298 */ 47260000
                                                      /* EOC RC01234 */ 47270000
     END;                                                               47280000
     WHEN('T241')                                   /* SOC : RB01278 */ 47290000
     DO;                                                                47300000
       IF (WRK_V051_IND15 = -1) THEN                      /* RB01289 */ 47310000
          USER_FILE_PI.CUSTOMER_NUMBER = '';                            47320000
                                                          /* RB01289 */ 47330000
                                                       /* SOC RC01362 */47331000
    /* IF SWITCH_VENDOR_SERVICE THEN                                    47340000
         DO;                                                            47350000
           CALL R711_PROD_REVENUE_DIV;                                  47360000
           IF ( SUBSTR (CURSOR_HW_PI.ORIGIN, 1, 1) = 'L'                47370000
            & TB_RCBV400.PROD_REVENUE_DIV = '44')                       47380000
            & SUBSTR(CURSOR_CTR_PI.AUTHORISATION_CODE,1,3) = 'LEN' THEN 47390000
                                                      /* CEDS00000321 */47400000
    /*        DO;                                                       47410000
                USER_FILE_PI.TYPE_OF_MAINT  = 'G';                      47420000
                USER_FILE_PI.LIABILITY = 'LEN';            /* RB01283 */47430000
    /*        END;                                                      47440000
           ELSE                                                         47450000
           DO;                                             /* RB01283 */47460000
    /*       USER_FILE_PI.TYPE_OF_MAINT = '2';                          47470000
             USER_FILE_PI.LIABILITY = 'IBM';               /* RB01283 */47480000
    /*     END;                                            /* RB01283 */47490000
    /*   END;                                                           47500000
       ELSE                                                             47510000
       DO;                                                 /* RB01283 */47520000
                                                       /* EOC RC01362 */47521000
         USER_FILE_PI.TYPE_OF_MAINT = '2';                              47530000
         USER_FILE_PI.LIABILITY     = 'IBM';               /* RB01283 */47540000
                                                       /* SOC RC01362 */47541000
    /* END;                                                /* RB01283 */47550000
                                                       /* EOC RC01362 */47551000
                                                                        47560000
                          /*RETRIEVE COVERAGE-HOURS FROM 470 VIA 241 */ 47570000
       IF WRK_V241_IND27  ¬= -1                               /* SLC */ 47580000
       THEN DO;                                                         47590000
         USER_FILE_PI.SERVICE_LVL_CODE_1 =                /* RB01298 */ 47600000
                       CURSOR_CTR_PI.SERVICE_LVL_CODE;    /* RB01298 */ 47610000
         WRK_SERVICE_LVL_CODE = CURSOR_CTR_PI.SERVICE_LVL_CODE;         47620000
         CALL R470_RETRIEVE_RCBV0470;                                   47630000
                                /* SAVE THE ROW IF NEW ROW RETRIEVED */ 47640000
         IF SW_SLC_FOUND                                                47650000
         THEN DO;                                                       47660000
           SAVE_RCBV470   = TB_RCBV470;                                 47670000
           SAVE_RCBV470_I = TB_RCBV470_I;                               47680000
         END;                                                           47690000
       END;                                                             47700000
       CALL R450_FILL_COV_241_470;                                      47710000
                                                      /* SOC RC01234 */ 47720000
                                                      /* SOC RB01299 */ 47730000
 /*********  MOVED THE BELOW CODE AS PER A11 REQUIREMENT  ************/ 47740000
 /*    TB_RCBV240.SERVICE_TYPE      = CURSOR_CTR_PI.SERVICE_TYPE;    */ 47750000
                                                                        47760000
 /*    CALL R445_RETRIEVE_SERVICE_DELIVERY;                          */ 47770000
 /*    IF TB_RCBV640_I.INDNULL(2) ¬= -1                              */ 47780000
 /*    THEN                                                          */ 47790000
 /*      USER_FILE_PI.SERVICE_DLVR_METHD                             */ 47800000
 /*                               = TB_RCBV640.SERVICE_DLVR_METHD;   */ 47810000
                                                      /* EOC RB01299 */ 47820000
                                                                        47830000
       USER_FILE_PI.MA_STATUS        =                                  47840000
                          R011_TRANS_TPMNT(USER_FILE_PI.TYPE_OF_MAINT); 47850000
                                                      /* EOC RC01234 */ 47860000
     END;                                           /* EOC : RB01278 */ 47870000
     WHEN('T051')                                                       47880000
     DO;                                                                47890000
       USER_FILE_PI.SERVICE_TYPE_NI = '?';                              47900000
       USER_FILE_PI.LIABILITY = CURSOR_HW_PI.WARRANTY_LIABILITY;        47910000
                                                           /* RB01283 */47920000
                                                                        47930000
       SELECT;                                                          47940000
         WHEN(WRK_V051_IND11 ¬= -1 &                 /* NULLIND SLC 1*/ 47950000
              WRK_V051_IND13  = -1)                  /* NULLIND SLC 2*/ 47960000
         DO;                                                            47970000
           WRK_SERVICE_LVL_CODE = USER_FILE_PI.SERVICE_LVL_CODE_1;      47980000
           CALL R470_RETRIEVE_RCBV0470;                                 47990000
         END;                                                           48000000
         WHEN(WRK_V051_IND11 ¬= -1 &                 /* NULLIND SLC 1*/ 48010000
              WRK_V051_IND13 ¬= -1)                  /* NULLIND SLC 2*/ 48020000
         DO;                                                            48030000
                                                      /* SOC RB01298 */ 48040000
    /*     IF USER_FILE_PI.MARKETING_INSTDAT <= WRK_RUN_DATE &       */ 48050000
    /*        WRK_RUN_DATE <= USER_FILE_PI.WARRANTY_SPLT_DATE        */ 48060000
                                                                        48070000
           IF SW_BRAND_PI                             /* EOC RB01298 */ 48080000
           THEN DO;                                                     48090000
             WRK_SERVICE_LVL_CODE = USER_FILE_PI.SERVICE_LVL_CODE_1;    48100000
           END;                                                         48110000
           ELSE DO;                                                     48120000
                                                      /* SOC RB01305 */ 48130000
      /*     IF SW_FW_PI | SW_HB_PI  THEN */              /* RB01298 */ 48140000
             IF SW_FW_PI | SW_HB_PI | SW_SPLTWAR_PI THEN  /* RB01298 */ 48150000
                                                      /* EOC RB01305 */ 48160000
               WRK_SERVICE_LVL_CODE = USER_FILE_PI.SERVICE_LVL_CODE_2;  48170000
           END;                                                         48180000
           CALL R470_RETRIEVE_RCBV0470;                                 48190000
         END;                                                           48200000
         OTHERWISE                                                      48210000
         DO;                                                            48220000
           WRK_SERVICE_LVL_CODE = '';                                   48230000
         END;                                                           48240000
       END;                                                             48250000
                                                                        48260000
       IF SW_SLC_FOUND                                                  48270000
       THEN DO;                                                         48280000
         USER_FILE_PI.COVERAGE_START_1 = TB_RCBV470.COVERAGE_START_1;   48290000
         USER_FILE_PI.COVERAGE_START_2 = TB_RCBV470.COVERAGE_START_2;   48300000
         USER_FILE_PI.COVERAGE_START_3 = TB_RCBV470.COVERAGE_START_3;   48310000
         USER_FILE_PI.COVERAGE_START_4 = TB_RCBV470.COVERAGE_START_4;   48320000
         USER_FILE_PI.COVERAGE_START_5 = TB_RCBV470.COVERAGE_START_5;   48330000
         USER_FILE_PI.COVERAGE_START_6 = TB_RCBV470.COVERAGE_START_6;   48340000
         USER_FILE_PI.COVERAGE_START_7 = TB_RCBV470.COVERAGE_START_7;   48350000
         USER_FILE_PI.COVERAGE_END_1   = TB_RCBV470.COVERAGE_END_1;     48360000
         USER_FILE_PI.COVERAGE_END_2   = TB_RCBV470.COVERAGE_END_2;     48370000
         USER_FILE_PI.COVERAGE_END_3   = TB_RCBV470.COVERAGE_END_3;     48380000
         USER_FILE_PI.COVERAGE_END_4   = TB_RCBV470.COVERAGE_END_4;     48390000
         USER_FILE_PI.COVERAGE_END_5   = TB_RCBV470.COVERAGE_END_5;     48400000
         USER_FILE_PI.COVERAGE_END_6   = TB_RCBV470.COVERAGE_END_6;     48410000
         USER_FILE_PI.COVERAGE_END_7   = TB_RCBV470.COVERAGE_END_7;     48420000
                                                    /* CEDS00000526 */  48430000
         USER_FILE_PI.SERVICE_DLVR_METHD                                48440000
                                       = TB_RCBV470.SERVICE_DLVR_METHD; 48450000
                                                    /* CEDS00000526 */  48460000
         SAVE_RCBV470   = TB_RCBV470;                                   48470000
         SAVE_RCBV470_I = TB_RCBV470_I;                                 48480000
       END;                                                             48490000
                                                      /* SOC RC01234 */ 48500000
 /*   IF FLEXIBLE_WARRANTY_PI THEN                        /* RB01298 */ 48510000
      IF SW_FW_PI | SW_HB_PI THEN                         /* RB01298 */ 48520000
       USER_FILE_PI.TYPE_OF_WARRANTY = CURSOR_HW_PI.F_TYPE_OF_WARRANTY; 48530000
                                                                        48540000
      USER_FILE_PI.MA_STATUS        =                                   48550000
                       R011_TRANS_TPMNT(USER_FILE_PI.TYPE_OF_WARRANTY); 48560000
                                                      /* EOC RC01234 */ 48570000
      IF SW_HB_PI                                     /* SOC RB01298 */ 48580000
      THEN                                                              48590000
        DO;                                                             48600000
          USER_FILE_PI.CONTRACT_NUMBER   ='HARDBUNDLE';                 48610000
                                                      /* SOC RC01352 */ 48620000
          IF SWITCH_RCB156_EMEA = TRUE  THEN                            48630000
          USER_FILE_PI.CONTRACT_SOURCE   = 'P';                         48640000
          ELSE                                                          48650000
                                                      /* EOC RC01352 */ 48660000
          USER_FILE_PI.CONTRACT_SOURCE   =           /* CEDS00000554 */ 48670000
                      CURSOR_HW_PI.SOURCE_INDICATOR; /* CEDS00000554 */ 48680000
          USER_FILE_PI.WARRANTY_EXP_DATE =                              48690000
                 R014_DATE_CALC (CURSOR_HW_PI.WARRANTY_SPLT_DATE,-1);   48700000
        END;                                          /* EOC RB01298 */ 48710000
     END;                                                               48720000
     OTHERWISE;                                                         48730000
   END;                                                                 48740000
                                                                        48750000
   SELECT(USER_FILE_PI.TYPE_OF_MAINT);                                  48760000
     WHEN('1')                                                          48770000
     DO;                                                                48780000
       USER_FILE_PI.COVERAGE_CODE_WD = '5';                             48790000
       USER_FILE_PI.COVERAGE_CODE_SA = '5';                             48800000
       USER_FILE_PI.COVERAGE_CODE_SU = '5';                             48810000
     END;                                                               48820000
     WHEN('2')                                                          48830000
     DO;                                                                48840000
       CALL R020_PLANCODE_1 (USER_FILE_PI.COVERAGE_START_1,             48850000
                             USER_FILE_PI.COVERAGE_END_1,               48860000
                             USER_FILE_PI.COVERAGE_CODE_WD);            48870000
       CALL R021_PLANCODE_2 (USER_FILE_PI.COVERAGE_START_6,             48880000
                             USER_FILE_PI.COVERAGE_END_6,               48890000
                             USER_FILE_PI.COVERAGE_CODE_SA);            48900000
       CALL R021_PLANCODE_2 (USER_FILE_PI.COVERAGE_START_7,             48910000
                             USER_FILE_PI.COVERAGE_END_7,               48920000
                             USER_FILE_PI.COVERAGE_CODE_SU);            48930000
     END;                                                               48940000
     OTHERWISE;                                                         48950000
   END;                                                                 48960000
                                                                        48970000
                                                       /* SOC RB01289 */48980000
   IF ((WRK_PI_ORIGIN = 'BOTH') | (WRK_PI_ORIGIN = 'T051'))             48990000
   THEN DO;                                                             49000000
     SELECT(CURSOR_HW_PI.SOURCE_INDICATOR);                             49010000
       WHEN('O')                                                        49020000
       DO;                                                              49030000
   /*    IF (WRK_CUSTNO_V10_IND ¬= -1) THEN */        /* SOC RC01311 */ 49040000
         IF (WRK_CUSTNO_V10_IND ¬= -1) THEN DO;       /* EOC RC01311 */ 49050000
            USER_FILE_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V10;     49060000
            IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;  /* SOC RC01311 */ 49070000
              USER_FILE_PI.OU_CODE       = WRK_OU_CODE_V170;            49080000
            END;                                                        49090000
            ELSE DO;                                                    49100000
   /* COMMENTED OUT AS PART OF PCEDSP-0064              SOC RC01313 */  49110000
   /*         CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUSTOMER_NUMBER);  49120000
              IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN DO;            49130000
               USER_FILE_PI.OU_CODE      = TB_RCBV350.CU_ENGINEERING_OU;49140000
              END;                                                    */49150000
   /*                                                   EOC RC01313 */  49160000
            END;                                                        49170000
         END;                                         /* EOC RC01311 */ 49180000
         ELSE DO;                                                       49190000
   /*      IF (WRK_CUSTNO_V190_IND ¬= -1) THEN */     /* SOC RC01311 */ 49200000
           IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;    /* EOC RC01311 */ 49210000
              USER_FILE_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V190;  49220000
              IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;/* SOC RC01311 */ 49230000
                USER_FILE_PI.OU_CODE      = WRK_OU_CODE_V170;           49240000
              END;                                                      49250000
              ELSE DO;                                                  49260000
   /* COMMENTED OUT AS PART OF PCEDSP-0064               SOC RC01313 */ 49270000
   /*           CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUSTOMER_NUMBER);49280000
                IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN DO;          49290000
                 USER_FILE_PI.OU_CODE   = TB_RCBV350.CU_ENGINEERING_OU; 49300000
                END;                                                  */49310000
   /*                                                    EOC RC01313 */ 49320000
              END;                                                      49330000
           END;                                       /* EOC RC01311 */ 49340000
           ELSE DO;                                                     49350000
             IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                         49360000
                USER_FILE_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V11; 49370000
           END;                                                         49380000
         END;                                                           49390000
       END;                                                             49400000
       WHEN('S')                                                        49410000
       DO;                                                              49420000
   /*    IF (WRK_CUSTNO_V190_IND ¬= -1) THEN */       /* SOC RC01311 */ 49430000
         IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;      /* EOC RC01311 */ 49440000
            USER_FILE_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V190;    49450000
            IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;  /* SOC RC01311 */ 49460000
              USER_FILE_PI.OU_CODE      = WRK_OU_CODE_V170;             49470000
            END;                                                        49480000
            ELSE DO;                                                    49490000
   /* COMMENTED OUT AS PART OF PCEDSP-0064               SOC RC01313 */ 49500000
   /*         CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUSTOMER_NUMBER);  49510000
              IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN DO;            49520000
                USER_FILE_PI.OU_CODE   = TB_RCBV350.CU_ENGINEERING_OU;  49530000
              END;                                                    */49540000
   /*                                                    EOC RC01313 */ 49550000
            END;                                                        49560000
         END;                                         /* EOC RC01311 */ 49570000
         ELSE DO;                                                       49580000
           IF (WRK_CUSTNO_V11_IND ¬= -1) THEN                           49590000
             USER_FILE_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V11;    49600000
         END;                                                           49610000
       END;                                                             49620000
       OTHERWISE                                                        49630000
       DO;                                                              49640000
   /*    IF (WRK_CUSTNO_V190_IND ¬= -1) THEN */       /* SOC RC01311 */ 49650000
         IF (WRK_CUSTNO_V190_IND ¬= -1) THEN DO;      /* EOC RC01311 */ 49660000
           USER_FILE_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V190;     49670000
           IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO;   /* SOC RC01311 */ 49680000
             USER_FILE_PI.OU_CODE      = WRK_OU_CODE_V170;              49690000
           END;                                                         49700000
           ELSE DO;                                                     49710000
   /* COMMENTED OUT AS PART OF PCRDSP-0064               SOC RC01313 */ 49720000
   /*        CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUSTOMER_NUMBER);   49730000
             IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN DO;             49740000
               USER_FILE_PI.OU_CODE   = TB_RCBV350.CU_ENGINEERING_OU;   49750000
             END;                                                     */49760000
   /*                                                    EOC RC01313 */ 49770000
           END;                                                         49780000
         END;                                         /* EOC RC01311 */ 49790000
         ELSE DO;                                                       49800000
   /*      IF (WRK_CUSTNO_V10_IND ¬= -1) THEN */      /* SOC RC01311 */ 49810000
           IF (WRK_CUSTNO_V10_IND ¬= -1) THEN DO;     /* EOC RC01311 */ 49820000
             USER_FILE_PI.CUSTOMER_NUMBER = WRK_CUSTOMER_NUMBER_V10;    49830000
   /* COMMENTED OUT AS PART OF PCEDSP-0064               SOC RC01313 */ 49840000
   /*        IF (WRK_OU_CODE_V170_IND ¬= -1) THEN DO; /* SOC RC01311 */ 49850000
   /*          USER_FILE_PI.OU_CODE      = WRK_OU_CODE_V170;            49860000
             END;                                                       49870000
             ELSE DO;                                                   49880000
               CALL R350_RETR_CU_ENGG_OU(USER_FILE_PI.CUSTOMER_NUMBER); 49890000
               IF TB_RCBV350.CU_ENGINEERING_OU ¬= '' THEN DO;           49900000
                USER_FILE_PI.OU_CODE   = TB_RCBV350.CU_ENGINEERING_OU;  49910000
               END;                                                     49920000
             END;                                                     */49930000
   /*                                                    EOC RC01313 */ 49940000
           END;                                       /* EOC RC01311 */ 49950000
         END;                                                           49960000
       END;                                                             49970000
     END;                                                               49980000
   END;                                                /* EOC RB01289 */49990000
                                                       /* SOC RB01299 */50000000
 /* SDM CALCULATION WHEN A PI MACHINE IS EFFECTIVE UNDER BOTH WARRANTY*/50010000
 /* AND CONTRACT OR EFFECTIVE ONLY UNDER CONTRACT                     */50020000
                                                                        50030000
   IF ((WRK_PI_ORIGIN = 'BOTH') | (WRK_PI_ORIGIN = 'T241')) THEN        50040000
   DO;                                                                  50050000
     IF (SW_SLC_FOUND & TB_RCBV470_I.INDNULL(16) ¬= -1                  50060000
         & WRK_V241_IND27  ¬= -1 )                                      50070000
     THEN                                                               50080000
       DO;                                                              50090000
         USER_FILE_PI.SERVICE_DLVR_METHD                                50100000
                                     = TB_RCBV470.SERVICE_DLVR_METHD;   50110000
         USER_FILE_PI.SERVICE_TYPE   = CURSOR_CTR_PI.SERVICE_TYPE;      50120000
         USER_FILE_PI.SERVICE_TYPE_NI= '';                              50130000
       END;                                                             50140000
     ELSE                                                               50150000
       DO;                                                              50160000
         IF WRK_V241_IND26 >= 0                                         50170000
         THEN                                                           50180000
         DO;                                                            50190000
           USER_FILE_PI.SERVICE_TYPE    = CURSOR_CTR_PI.SERVICE_TYPE;   50200000
           USER_FILE_PI.SERVICE_TYPE_NI = '';                           50210000
           TB_RCBV240.SERVICE_TYPE      = CURSOR_CTR_PI.SERVICE_TYPE;   50220000
                                                                        50230000
           CALL R445_RETRIEVE_SERVICE_DELIVERY;                         50240000
           IF TB_RCBV640_I.INDNULL(2)   ¬= -1                           50250000
           THEN                                                         50260000
             DO;                                                        50270000
             USER_FILE_PI.SERVICE_DLVR_METHD  =                         50280000
                                TB_RCBV640.SERVICE_DLVR_METHD;          50290000
             END;                                                       50300000
           ELSE                                                         50310000
              USER_FILE_PI.SERVICE_DLVR_METHD =                         50320000
                                CURSOR_CTR_PI.SERVICE_TYPE;             50330000
         END;                                                           50340000
       END;                                                             50350000
   END;                                               /* EOC RB01299 */ 50360000
                                                                        50370000
                                                  /* SOC CEDS00000624 */50380000
                                                       /* SOC RB01320 */50390000
 /*IF WRK_PI_REAL_SERIAL_NO_V125_IND = -1 THEN                          50400000
 DO;                                                                    50410000
    WRK_ORIGIN  = CURSOR_HW_PI.ORIGIN;                                  50420000
    WRK_SEQ_NO  = CURSOR_HW_PI.SEQUENCE_NUMBER;                         50430000
 END;                                                                   50440000
 ELSE                                                                   50450000
 DO;                                                                    50460000
    WRK_ORIGIN  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,1,2);               50470000
    WRK_SEQ_NO  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,3);                 50480000
 END;*/                                                /* EOC RB01320 */50490000
                                                                        50500000
 WRK_SOURCE = 'T051';                                                   50510000
 WRK_PRODUCT_TYPE_REAL    = CURSOR_HW_PI.PRODUCT_TYPE;                  50520000
 WRK_ORIGIN_REAL          = CURSOR_HW_PI.ORIGIN;                        50530000
 WRK_SEQUENCE_NUMBER_REAL = CURSOR_HW_PI.SEQUENCE_NUMBER;               50540000
                                                                        50550000
 CALL R767_RETRIEVE_PI_REAL_SER;                                        50560000
                                                                        50570000
 IF SWITCH_PI_ONLY| SWITCH_BAU_PI THEN                                  50580000
 DO;                                                                    50590000
 IF PI_REAL_SERNO ¬= '  '  THEN                                         50600000
 DO;                                                                    50610000
    WRK_ORIGIN  = SUBSTR(PI_REAL_SERNO,1,2);                            50620000
    WRK_SEQ_NO  = SUBSTR(PI_REAL_SERNO,3);                              50630000
 END;                                                                   50640000
 ELSE                                                                   50650000
 DO;                                                                    50660000
    WRK_ORIGIN  = CURSOR_HW_PI.ORIGIN;                                  50670000
    WRK_SEQ_NO  = CURSOR_HW_PI.SEQUENCE_NUMBER;                         50680000
 END;                                                                   50690000
 END;                                                                   50700000
                                                  /* EOC CEDS00000624 */50710000
   TB_RCBV380 = '';                                    /* SOC RC01234 */50720000
   WRK_DP_SYSTEM_NUMBER = '';                                           50730000
                                                                        50740000
   EXEC SQL                                                             50750000
   SELECT  CPU_TYPE,      /* SOC RA01239 */                             50760000
           DP_SYSTEM_NUMBER                                             50770000
     INTO :TB_RCBV380.CPU_TYPE :WRK_INDNULL,                            50780000
          :WRK_DP_SYSTEM_NUMBER :WRK_INDNULL /* EOC RA01239 */          50790000
     FROM RCBV0380_HW_PR_MOD                                            50800000
    WHERE PRODUCT_TYPE    = :CURSOR_HW_PI.PRODUCT_TYPE                  50810000
                                                       /* SOC RB01320 */50820000
   /* AND ORIGIN          = :CURSOR_HW_PI.ORIGIN                        50830000
      AND SEQUENCE_NUMBER = :CURSOR_HW_PI.SEQUENCE_NUMBER */            50840000
      AND ORIGIN          = :WRK_ORIGIN                                 50850000
      AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                 50860000
                                                       /* EOC RB01320 */50870000
      AND COUNTRY_NUMBER  = :WRK_CTRYNO                                 50880000
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        50890000
                              AND END_DATE                              50900000
   ;                                                                    50910000
                                                                        50920000
   SELECT (SQLCODE);                                                    50930000
     WHEN (0)                                                           50940000
       DO;                                                              50950000
         USER_FILE_PI.CPU_TYPE = TB_RCBV380.CPU_TYPE; /* SOC RA01239 */ 50960000
         USER_FILE_PI.DP_SYSTEM_NUMBER = WRK_DP_SYSTEM_NUMBER;          50970000
       END;                                           /* EOC RA01239 */ 50980000
     WHEN (100)                                                         50990000
       DO;                                                              51000000
         USER_FILE_PI.CPU_TYPE = '';                                    51010000
         USER_FILE_PI.DP_SYSTEM_NUMBER = '';         /* SOC RA01239 */  51020000
       END;                                                             51030000
     OTHERWISE DO; /* EOC RA01239 */                                    51040000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#046');                  51050000
     END;                                                               51060000
   END;                                                /* EOC RC01234 */51070000
                                                                        51080000
   WRK_PI_ORIGIN_TEMP = WRK_PI_ORIGIN;                      /*RB01289 */51090000
                                                      /* SOC RB01305 */ 51100000
                        /* PROCESS PER CALL RECORDS FOR IBM MACHINES    51110000
                                           WHEN RCB005.PI_TO_BMT = I */ 51120000
   IF (PARM_RCB005.PI_TO_BMT = 'I' &                                    51130000
      (CURSOR_HW_PI.WARRANTY_LIABILITY = '' |                           51140000
       WRK_V051_IND22                  = -1 |                           51150000
       CURSOR_HW_PI.WARRANTY_LIABILITY = 'IBM') &                       51160000
       WRK_PI_ORIGIN = 'T051'  &                                        51170000
       CURSOR_HW_PI.WARRANTY_EXP_DATE < WRK_RUN_DATE &                  51180000
       SW_MAINT_PI = FALSE)                                             51190000
   THEN                                                                 51200000
    DO;                                                                 51210000
      SW_PROCESS_PERCALL = TRUE;                                        51220000
      CALL R630_PI_PERCALL;                                             51230000
    END;                                                                51240000
                                                      /* EOC RB01305 */ 51250000
   CALL R629_FETCH_CURSOR_PI_HW;                                        51260000
                                                                        51270000
 END R710_PROCESS_PI_HW;                                                51280000
                                                     /* SOC : RB01278 */51290000
1/*********************************************************************/51300000
 /*                                                                   */51310000
 /* MODULE NAME      :  R711_PROD_REVENUE_DIV                         */51320000
 /*                                                                   */51330000
 /* DESCRIPTION      :                                                */51340000
 /*                                                                   */51350000
 /*********************************************************************/51360000
                                                       /* SOC RC01362 */51361000
 /*R711_PROD_REVENUE_DIV: PROC;                                         51370000
                                                                        51380000
 TB_RCBV400           = '';                                             51390000
 WRK_PRODUCT_TYPE     = USER_FILE_PI.PRODUCT_TYPE;                      51400000
                                                                        51410000
 EXEC SQL                                                               51420000
   SELECT PROD_REVENUE_DIV                                              51430000
    INTO :TB_RCBV400.PROD_REVENUE_DIV                                   51440000
         :WRK_INDNULL                                                   51450000
    FROM  RCBV0400_PO_MOD1 T400                                         51460000
   WHERE  T400.COUNTRY_NUMBER   = :WRK_CTRYNO                           51470000
    AND   T400.PRODUCT_TYPE     = :WRK_PRODUCT_TYPE                     51480000
    AND   T400.MODEL_NUMBER     = ''                                    51490000
    AND   :WRK_RUN_DATE BETWEEN                                         51500000
          T400.EFFECTIVE_DATE AND T400.END_DATE;                        51510000
 SELECT(SQLCODE);                                                       51520000
   WHEN(0);                                                             51530000
   WHEN(100);                                                           51540000
   OTHERWISE                                                            51550000
     DO;                                                                51560000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),                                51570000
                           'DB2',                                       51580000
                           '#047');                                     51590000
     END;                                                               51600000
 END;                                                                   51610000
 END R711_PROD_REVENUE_DIV;                          /* EOC : RB01278 */51620000
                                                       /* EOC RC01362 */51621000
1/*********************************************************************/51630000
 /*                                                                   */51640000
 /* MODULE NAME      :  R720_PROCESS_REGULAR_HW                       */51650000
 /*                                                                   */51660000
 /* DESCRIPTION      :                                                */51670000
 /*                                                                   */51680000
 /*********************************************************************/51690000
 R720_PROCESS_REGULAR_HW: PROC;                                         51700000
                                                                        51710000
   SW_WARRANTY = FALSE;                                                 51720000
   SW_MAINT_02 = FALSE;                                                 51730000
   WRK_SERVICE_LVL_CODE = '';                      /* CEDS00000533 */   51740000
                                   /* PROCESS INSTALLED HW PERIOD  */   51750000
   FILE_RCBDTB1.SERVICE_START_DATE = SK_CURRENT_HW.EFFECTIVE_DATE;      51760000
   FILE_RCBDTB1.SERVICE_END_DATE   = SK_CURRENT_HW.END_DATE;            51770000
   FILE_RCBDTB1.CUSTOMER_NUMBER  = CURSOR_INST_HW_V190.CUSTOMER_NUMBER; 51780000
   FILE_RCBDTB1.OU_CODE            = CURSOR_INST_HW_V170.OU_CODE;       51790000
   FILE_RCBDTB1.LIABILITY          = 'IBM';              /* RB01283 */  51800000
                                                                        51810000
                                                      /* SOC RB01305 */ 51820000
   POST_WED_BAU            = '';                                        51830000
   POST_WED_BAU_INDNULL    = -1;                                        51840000
   SW_POSTWARR_BAU         = FALSE;                                     51850000
   WRK_PRODUCT_TYPE_FUT    = SK_CURRENT_HW.PRODUCT_TYPE;                51860000
   WRK_ORIGIN_FUT          = SK_CURRENT_HW.ORIGIN;                      51870000
   WRK_SEQUENCE_NUMBER_FUT = SK_CURRENT_HW.SEQUENCE_NUMBER;             51880000
                                                  /* SOC CEDS00000624 */51890000
   /*                                                                   51900000
   WRK_SERIAL_LNG_FUT      = WRK_BAU_REAL_SERIAL_NO_V125;*//* RB01320 */51910000
   WRK_SERIAL_LNG_FUT      = BAU_REAL_SERNO;      /* EOC CEDS00000624 */51920000
   TEMP_RUN_DATE_FUT       = WRK_RUN_DATE;                              51930000
   TEMP_T220_SPLT_DATE_FUT = CURSOR_INST_HW_V220.F_SPLT_DATE;           51940000
   TEMP_SW_BRAND_BAU_FUT   = SW_BRAND_BAU;                              51950000
   WRK_SW_FW_BAU           = SW_FW_BAU;                                 51960000
   WRK_SW_HB_BAU           = SW_HB_BAU;                                 51970000
   WRK_TOM_BAU             = CURSOR_INST_HW_V220.TYPE_OF_MAINT;         51980000
                                                                        51990000
   IF (SWITCH_INTERNAL | SWITCH_LEASE_RENTAL) THEN                      52000000
    DO;                                                                 52010000
     WRK_PRECEDENCE_BAU = '4';                                          52020000
    END;                                                                52030000
                                                      /* EOC RB01305 */ 52040000
   IF SW_HB_BAU THEN                                     /* RB01298 */  52050000
     FILE_RCBDTB1.CONTRACT_NUMBER = 'HARDBUNDLE';        /* RB01298 */  52060000
                                    /* IF SERVICE CONTRACT         */   52070000
                                                      /* SOC RB01290 */ 52080000
 /*IF CURSOR_INST_HW_V220.TYPE_OF_MAINT = WRK_TPMNT_VAL.TPMNT_ST2_DEF*/ 52090000
                                                                        52100000
   IF ((CURSOR_INST_HW_V220.TYPE_OF_MAINT =                             52110000
                     WRK_TPMNT_VAL.TPMNT_ST2_DEF)|                      52120000
       (SWITCH_INTERNAL_MACHINE_CTR = TRUE))        /* EOC RB01290 */   52130000
                                                                        52140000
   THEN DO;                         /* PROCESS SERV_CTR PERIODS    */   52150000
     WRK_PRECEDENCE_BAU = '8';                          /* RB01305 */   52160000
     SW_MAINT_02 = TRUE;                                                52170000
   END;                                                                 52180000
   ELSE DO;                            /* PROCESS WARRANTY PERIODS */   52190000
    IF (VERIFY (CURSOR_INST_HW_V220.TYPE_OF_WARRANTY,                   52200000
                WRK_TPMNT_VAL.TPMNT_WAR) = 0  |                         52210000
        SW_BRAND_BAU | SW_FW_BAU | SW_HB_BAU)         /* SOC RB01298 */ 52220000
                                                                        52230000
 /*     VERIFY (CURSOR_INST_HW_V220.TYPE_OF_WARRANTY, /* SOC RB01281 */ 52240000
 /*             SUBSTR(PARM_RCBP63.F_WARRANTY_MACHINE,1,1)) = '0')      52250000
 /*                                                   /* EOC RB01281 */ 52260000
                                                      /* EOC RB01298 */ 52270000
     THEN DO;                                                           52280000
       WRK_PRECEDENCE_BAU = '6';                          /* RB01305 */ 52290000
       SW_WARRANTY = TRUE;                                              52300000
     END;                                                               52310000
   END;                                                                 52320000
                                                  /* SOC CEDS00000624 */52330000
                                                       /* SOC RB01320 */52340000
 /*IF WRK_BAU_REAL_SERIAL_NO_V125_IND = -1 THEN                         52350000
 DO;                                                                    52360000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 52370000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        52380000
 END;                                                                   52390000
 ELSE                                                                   52400000
 DO;                                                                    52410000
    WRK_ORIGIN  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,1,2);              52420000
    WRK_SEQ_NO  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,3);                52430000
 END;*/                                                /* EOC RB01320 */52440000
                                                                        52450000
   WRK_PRODUCT_TYPE_REAL    = SK_CURRENT_HW.PRODUCT_TYPE;               52460000
   WRK_ORIGIN_REAL          = SK_CURRENT_HW.ORIGIN;                     52470000
   WRK_SEQUENCE_NUMBER_REAL = SK_CURRENT_HW.SEQUENCE_NUMBER;            52480000
                                                                        52490000
   CALL R768_RETRIEVE_BAU_REAL_SER;                                     52500000
                                                                        52510000
 IF SWITCH_BAU_ONLY | SWITCH_BAU_PI THEN                                52520000
 DO;                                                                    52530000
 IF BAU_REAL_SERNO = ' ' THEN                                           52540000
 DO;                                                                    52550000
    WRK_ORIGIN  = SK_CURRENT_HW.ORIGIN;                                 52560000
    WRK_SEQ_NO  = SK_CURRENT_HW.SEQUENCE_NUMBER;                        52570000
 END;                                                                   52580000
 ELSE                                                                   52590000
 DO;                                                                    52600000
      WRK_ORIGIN  = SUBSTR(BAU_REAL_SERNO,1,2);                         52610000
      WRK_SEQ_NO  = SUBSTR(BAU_REAL_SERNO,3);                           52620000
 END;                                                                   52630000
 END;                                             /* EOC CEDS00000624 */52640000
                                                      /* SOC RB01305 */ 52650000
   IF (¬SW_WARRANTY ) THEN                                              52660000
     DO;                                                                52670000
       EXEC SQL                                                         52680000
          SELECT MAX(WARRANTY_EXP_DATE)                                 52690000
          INTO :POST_WED_BAU :POST_WED_BAU_INDNULL                      52700000
          FROM RCBV0220_SUPPL_CTR                                       52710000
          WHERE COUNTRY_NUMBER    = :WRK_CTRYNO                         52720000
            AND PRODUCT_TYPE      = :SK_CURRENT_HW.PRODUCT_TYPE         52730000
                                                       /* SOC RB01320 */52740000
          /*AND ORIGIN            = :SK_CURRENT_HW.ORIGIN               52750000
            AND SEQUENCE_NUMBER   = :SK_CURRENT_HW.SEQUENCE_NUMBER */   52760000
            AND ORIGIN            = :WRK_ORIGIN                         52770000
            AND SEQUENCE_NUMBER   = :WRK_SEQ_NO                         52780000
                                                       /* EOC RB01320 */52790000
            AND WARRANTY_EXP_DATE < :WRK_RUN_DATE;                      52800000
                                                                        52810000
       SELECT(SQLCODE);                                                 52820000
         WHEN(0)                                                        52830000
          DO;                                                           52840000
            IF POST_WED_BAU_INDNULL ¬= -1 THEN                          52850000
             SW_POSTWARR_BAU = TRUE;                                    52860000
          END;                                                          52870000
         WHEN(100);                                                     52880000
         OTHERWISE                                                      52890000
          DO;                                                           52900000
            CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#073');             52910000
          END;                                                          52920000
       END;                                                             52930000
     END;                                                               52940000
                                                     /* EOC RB01305 */  52950000
   IF SW_MAINT_02   = TRUE |                                            52960000
      SWITCH_INTERNAL   = TRUE |                         /* RB01305 */  52970000
      SWITCH_LEASE_RENTAL = TRUE |                       /* RB01305 */  52980000
      SW_WARRANTY   = TRUE                                              52990000
   THEN DO;                                                             53000000
     CALL R500_SERV_CTR_PERIOD;                                         53010000
                                                                        53020000
     IF SWITCH_EOC_SERV_CTR = FALSE                                     53030000
     THEN DO;                                                           53040000
                                                       /* SOC RB01290 */53050000
      CALL R406_GET_TYPE_OF_CONTRACT;                                   53060000
      IF ((WRK_TYPE_OF_CONTRACT_INDNULL ¬= -1)&                         53070000
          (WRK_TYPE_OF_CONTRACT ¬= ''))                                 53080000
      THEN DO;                                                          53090000
           IF SWITCH_INTERNAL_MACHINE_CTR                               53100000
             THEN DO;                                                   53110000
               CALL R480_RETRIEVE_TOM_INT_CONTRACT;                     53120000
             END;                                                       53130000
       END;                                                             53140000
                                                                        53150000
     FILE_RCBDTB1.TYPE_OF_CONTRACT = WRK_TYPE_OF_CONTRACT;              53160000
                                                       /* EOC RB01290 */53170000
                                                       /* SOC RB01305 */53180000
 /*  CALL R402_FILL_SERV_CTR_PERIOD(SK_CURRENT_HW.EFFECTIVE_DATE,       53190000
                                    SK_CURRENT_HW.END_DATE); */         53200000
     CALL R402_FILL_SERV_CTR_PERIOD;                                    53210000
                                                       /* EOC RB01305 */53220000
                                                       /* EOC PTM1290 */53230000
                                                       /* SOC RA01239 */53240000
   /* THIS IS COMMENTED OUT AS PART OF RB01290 */                       53250000
   /*  CALL R406_GET_TYPE_OF_CONTRACT;  */                              53260000
                                                       /* EOC RA01239 */53270000
     END;                                                               53280000
     ELSE DO;                                                           53290000
       CALL R405_FILL_SUPPL_CTR_PERIOD(SK_INST_HW.EFFECTIVE_DATE,       53300000
                                       SK_INST_HW.END_DATE);            53310000
     END;                                                               53320000
   END;                                                                 53330000
   ELSE DO;                                                             53340000
     CALL R405_FILL_SUPPL_CTR_PERIOD(SK_INST_HW.EFFECTIVE_DATE,         53350000
                                     SK_INST_HW.END_DATE);              53360000
     WRK_PRECEDENCE_BAU = '2';                            /* RB01305 */ 53370000
   END;                                                                 53380000
                                                      /* SOC RB01305 */ 53390000
 /*IF SW_BRAND_BAU THEN                               /* SOC RB01298 */ 53400000
 /*CALL R490_BRAND_BAU_FUT;                                             53410000
 /*ELSE                                               /* EOC RB01298 */ 53420000
   /* SOC PTM1409 */                                                    53430000
 /*CALL R403_GET_NEXT_EFFECTIVE_DATE;                                   53440000
   /* EOC PTM1409 */                                                    53450000
                                                      /* EOC RB01305 */ 53460000
   CALL R508_RETR_ADD_INFO;                                             53470000
   CALL R509_FILL_INFO;                                                 53480000
                                                                        53490000
 /* SELECT(FILE_RCBDTB1.TYPE_OF_MAINT); */            /* SOC RB01290 */ 53500000
 /*  WHEN('1')                          */                              53510000
 IF FILE_RCBDTB1.TYPE_OF_MAINT = '1' THEN             /* EOC RB01290 */ 53520000
       DO;                                                              53530000
       FILE_RCBDTB1.COVERAGE_CODE_WD = '5';                             53540000
       FILE_RCBDTB1.COVERAGE_CODE_SA = '5';                             53550000
       FILE_RCBDTB1.COVERAGE_CODE_SU = '5';                             53560000
       END;                                                             53570000
 /*  WHEN('2') */                                     /* SOC RB01290 */ 53580000
 IF ((FILE_RCBDTB1.TYPE_OF_MAINT = '2') |                               53590000
     (SWITCH_INTERNAL_MACHINE_CTR))                   /* EOC RB01290 */ 53600000
       THEN DO;                                                         53610000
       CALL R020_PLANCODE_1 (FILE_RCBDTB1.COVERAGE_START_1,             53620000
                             FILE_RCBDTB1.COVERAGE_END_1,               53630000
                             FILE_RCBDTB1.COVERAGE_CODE_WD);            53640000
       CALL R021_PLANCODE_2 (FILE_RCBDTB1.COVERAGE_START_6,             53650000
                             FILE_RCBDTB1.COVERAGE_END_6,               53660000
                             FILE_RCBDTB1.COVERAGE_CODE_SA);            53670000
       CALL R021_PLANCODE_2 (FILE_RCBDTB1.COVERAGE_START_7,             53680000
                             FILE_RCBDTB1.COVERAGE_END_7,               53690000
                             FILE_RCBDTB1.COVERAGE_CODE_SU);            53700000
       END;                                                             53710000
 /*  OTHERWISE;     */                                /* SOC RB01290 */ 53720000
 /*END;             */                                /* EOC RB01290 */ 53730000
                                                                        53740000
   CALL R609_FETCH_CURSOR_INST_HW;                                      53750000
                                                                        53760000
 END R720_PROCESS_REGULAR_HW;                                           53770000
                                                                        53780000
1/*********************************************************************/53790000
 /*                                                                   */53800000
 /* MODULE NAME      :  R740_FINISH_HW_OCCURENCE                      */53810000
 /*                                                                   */53820000
 /* DESCRIPTION      :                                                */53830000
 /*                                                                   */53840000
 /*********************************************************************/53850000
 R740_FINISH_HW_OCCURENCE: PROC;                                        53860000
                                                                        53870000
   WRK_PRECEDENCE_CURRENT = '';                            /* RB01305 */53880000
   IF SWITCH_BAU = TRUE                                                 53890000
   THEN DO;                                                             53900000
     IF SWITCH_PI = TRUE                                                53910000
     THEN DO;      /****** BOTH BAU AND PI PRESENTED TO RCBDT1U ******/ 53920000
                                                                        53930000
 /*    IF USER_FILE_PI.CUSTOMER_NUMBER = '' /* ONLY T241 ENTRY       */ 53940000
 /*    USER_FILE_PI.CUSTOMER_NUMBER  = FILE_RCBDTB1.CUSTOMER_NUMBER; */ 53950000
       IF (WRK_PI_ORIGIN_TEMP = 'T241')                   /* RB01289 */ 53960000
       THEN DO;                                                         53970000
         IF USER_FILE_PI.CUSTOMER_NUMBER = '' THEN DO;                  53980000
            USER_FILE_PI.CUSTOMER_NUMBER                                53990000
                                       = FILE_RCBDTB1.CUSTOMER_NUMBER;  54000000
         END;                                                           54010000
                                                          /* RB01289 */ 54020000
         USER_FILE_PI.OU_CODE          = FILE_RCBDTB1.OU_CODE;          54030000
         USER_FILE_PI.TYPE_OF_MAINT    = FILE_RCBDTB1.TYPE_OF_MAINT;    54040000
         USER_FILE_PI.TYPE_OF_WARRANTY = FILE_RCBDTB1.TYPE_OF_WARRANTY; 54050000
       END;                                                             54060000
                                                 /* SOC CEDS00000552 */ 54070000
    /* FOR A BAU REGISTERED MACHINE (EVEN IF PI WARRANTY OR CONTRACT */ 54080000
    /* INFO IS USED) FOLL. DETAILS MUST BE USED FROM BAU TABLES      */ 54090000
       USER_FILE_PI.MODEL_NUMBER     = FILE_RCBDTB1.MODEL_NUMBER ;      54100000
       USER_FILE_PI.CPU_TYPE         = FILE_RCBDTB1.CPU_TYPE ;          54110000
       USER_FILE_PI.DP_SYSTEM_NUMBER = FILE_RCBDTB1.DP_SYSTEM_NUMBER ;  54120000
       USER_FILE_PI.OU_CODE          = FILE_RCBDTB1.OU_CODE ;           54130000
       USER_FILE_PI.CUSTOMER_NUMBER  = FILE_RCBDTB1.CUSTOMER_NUMBER ;   54140000
                                                 /* EOC CEDS00000552 */ 54150000
                                                                        54160000
       DATA_ORIGIN = '2';             /* ORIGIN OF DATA: BOTH        */ 54170000
       USER_FILE_BAU = FILE_RCBDTB1, BY NAME;             /* RC01234 */ 54180000
       WRK_PRECEDENCE_CURRENT = WRK_PRECEDENCE_BAU;   /* SOC RB01305 */ 54190000
                                                                        54200000
       IF ( WRK_PRECEDENCE_CURRENT < WRK_PRECEDENCE_PI ) &              54210000
          ( PARM_RCB005.PI_TO_BMT = 'Y' |                               54220000
            PARM_RCB005.PI_TO_BMT = 'I'   ) THEN                        54230000
        DO;                                                             54240000
         WRK_PRECEDENCE_CURRENT = WRK_PRECEDENCE_PI;                    54250000
        END;                                                            54260000
                                                      /* EOC RB01305 */ 54270000
           /*-- PREFER PI IF BAU HAS TOM 3 AND PI NOT -- SOC RB01298 */ 54280000
                                                                        54290000
       IF (VERIFY(USER_FILE_BAU.TYPE_OF_MAINT,                          54300000
                  WRK_TPMNT_VAL.TPMNT_ST3) = '0'   &                    54310000
           VERIFY(USER_FILE_PI.TYPE_OF_MAINT,                           54320000
                  WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                      54330000
       THEN                                                             54340000
         DO;                                                            54350000
                                                      /* SOC RB01305 */ 54360000
           /* IF PARM_RCB005.PI_TO_BMT = 'Y' */                         54370000
           IF PARM_RCB005.PI_TO_BMT = 'Y' | PARM_RCB005.PI_TO_BMT = 'I' 54380000
                                                      /* EOC RB01305 */ 54390000
           THEN                                                         54400000
             FILE_RCBDTB1 = USER_FILE_PI, BY NAME ;                     54410000
         END;                                                           54420000
                                                      /* SOC RB01305 */ 54430000
         /*-- PREFER PI IF BAU HAS INTERNAL OR LEASE/RENTAL & PI WARR*/ 54440000
       IF SW_WARR_PI &                                                  54450000
          (SWITCH_INTERNAL | SWITCH_LEASE_RENTAL) &                     54460000
           SWITCH_EOC_SERV_CTR          /* INDICATES NO 240 CONTRACT */ 54470000
       THEN                                                             54480000
         DO;                                                            54490000
           IF PARM_RCB005.PI_TO_BMT = 'Y' | PARM_RCB005.PI_TO_BMT = 'I' 54500000
           THEN                                                         54510000
            DO;                                                         54520000
             FILE_RCBDTB1 = USER_FILE_PI, BY NAME ;                     54530000
            END;                                                        54540000
         END;                                         /* EOC RB01305 */ 54550000
                                                                        54560000
                                /*-- BAU WARRANTY AND PI CONTRACT -- */ 54570000
                                                                        54580000
   /*  IF SW_WARRANTY & SW_MAINT_PI                       /* RB01305 */ 54590000
       IF SW_WARRANTY & SW_MAINT_PI & ¬SW_MAINT_02        /* RB01305 */ 54600000
       THEN                                                             54610000
         DO;                                                            54620000
                                                 /* SOC CEDS00000569 */ 54630000
          IF (((WRK_RUN_DATE >= WRK_PI_CTR_START_DATE) &                54640000
               (WRK_RUN_DATE <= WRK_PI_CTR_END_DATE))  &                54650000
                (USER_FILE_BAU.CONTRACT_NUMBER ¬= '') &                 54660000
                (USER_FILE_BAU.CONTRACT_NUMBER ¬= 'HARDBUNDLE')) THEN   54670000
               DO;                                                      54680000
                 FILE_RCBDTB1 = USER_FILE_BAU, BY NAME ;                54690000
               END;                                                     54700000
          ELSE DO;                               /* EOC CEDS00000569 */ 54710000
                                                      /* SOC RB01305 */ 54720000
           /* IF PARM_RCB005.PI_TO_BMT = 'Y' */                         54730000
           IF PARM_RCB005.PI_TO_BMT = 'Y' | PARM_RCB005.PI_TO_BMT = 'I' 54740000
                                                      /* EOC RB01305 */ 54750000
            THEN DO;                                                    54760000
              FILE_RCBDTB1 = USER_FILE_PI, BY NAME ;                    54770000
                                                                        54780000
              FILE_RCBDTB1.TYPE_OF_WARRANTY   =                         54790000
                              USER_FILE_BAU.TYPE_OF_WARRANTY;           54800000
                                                                        54810000
              FILE_RCBDTB1.MA_STATUS = USER_FILE_BAU.MA_STATUS;         54820000
                                                                        54830000
              FILE_RCBDTB1.INVENTORY_SOURCE =    /* SOC CEDS00000554 */ 54840000
                                 USER_FILE_BAU.INVENTORY_SOURCE;        54850000
                                                 /* EOC CEDS00000554 */ 54860000
                                                      /* SOC RB01305 */ 54870000
              FILE_RCBDTB1.TYPE_OF_MAINT = '';                          54880000
                                                                        54890000
              FILE_RCBDTB1.SERVICE_START_DATE = WRK_PI_CTR_START_DATE;  54900000
                                                                        54910000
              IF USER_FILE_BAU.SERVICE_START_DATE >                     54920000
                  FILE_RCBDTB1.SERVICE_START_DATE THEN                  54930000
                                                      /* EOC RB01305 */ 54940000
              FILE_RCBDTB1.SERVICE_START_DATE =                         54950000
                              USER_FILE_BAU.SERVICE_START_DATE;         54960000
                                                      /* SOC RB01305 */ 54970000
              FILE_RCBDTB1.SERVICE_END_DATE = WRK_PI_CTR_END_DATE;      54980000
                                                                        54990000
              IF USER_FILE_BAU.SERVICE_END_DATE <                       55000000
                  FILE_RCBDTB1.SERVICE_END_DATE THEN                    55010000
                                                      /* EOC RB01305 */ 55020000
              FILE_RCBDTB1.SERVICE_END_DATE   =                         55030000
                              USER_FILE_BAU.SERVICE_END_DATE;           55040000
              FILE_RCBDTB1.MARKETING_INSTDAT  =                         55050000
                              USER_FILE_BAU.MARKETING_INSTDAT;          55060000
              FILE_RCBDTB1.WARRANTY_SPLT_DATE =                         55070000
                              USER_FILE_BAU.WARRANTY_SPLT_DATE;         55080000
              FILE_RCBDTB1.WARRANTY_EXP_DATE  =                         55090000
                              USER_FILE_BAU.WARRANTY_EXP_DATE;          55100000
                                                      /* SOC RB01305 */ 55110000
 /*           IF WRK_SW_FW_BAU | WRK_SW_HB_BAU THEN  /* CEDS00000551 */ 55120000
              IF WRK_SW_HB_BAU THEN                  /* CEDS00000551 */ 55130000
                DO;                                                     55140000
                  FILE_RCBDTB1.BASE_WARRANTY_SLC = '';                  55150000
                END;                                                    55160000
              ELSE                                                      55170000
                DO;                                                     55180000
                  FILE_RCBDTB1.BASE_WARRANTY_SLC =                      55190000
                             USER_FILE_BAU.SERVICE_LVL_CODE_1;          55200000
                END;                                                    55210000
                                                      /* EOC RB01305 */ 55220000
            END;                                                        55230000
           END;                                      /* CEDS00000569 */ 55240000
         END;                                                           55250000
                                /*-- PI WARRANTY AND BAU CONTRACT --*/  55260000
                                                                        55270000
  /*   IF SW_WARR_PI & SW_MAINT_02                    /* SOC RB01305 */ 55280000
       IF SW_WARR_PI &                                                  55290000
          (SW_MAINT_02 | SWITCH_INTERNAL | SWITCH_LEASE_RENTAL) &       55300000
          ¬SWITCH_EOC_SERV_CTR &             /* INDICATES 240 RECORD */ 55310000
          ¬SW_WARRANTY                                /* EOC RB01305 */ 55320000
       THEN                                                             55330000
         DO;                                                            55340000
          IF PARM_RCB005.PI_TO_BMT = 'Y' |            /* SOC RB01305 */ 55350000
             PARM_RCB005.PI_TO_BMT = 'I'                                55360000
          THEN DO;                                    /* EOC RB01305 */ 55370000
           FILE_RCBDTB1.TYPE_OF_WARRANTY =                              55380000
                              USER_FILE_PI.TYPE_OF_WARRANTY;            55390000
           FILE_RCBDTB1.MA_STATUS = USER_FILE_PI.MA_STATUS;             55400000
                                                      /* SOC RB01305 */ 55410000
           FILE_RCBDTB1.TYPE_OF_MAINT = '';                             55420000
                                                                        55430000
           FILE_RCBDTB1.INVENTORY_SOURCE =       /* SOC CEDS00000554 */ 55440000
                               USER_FILE_PI.INVENTORY_SOURCE;           55450000
                                                 /* EOC CEDS00000554 */ 55460000
           USER_FILE_PI.SERVICE_START_DATE =                            55470000
                                 WRK_PI_HW_START_DATE;                  55480000
                                                                        55490000
           IF USER_FILE_PI.SERVICE_START_DATE >                         55500000
               FILE_RCBDTB1.SERVICE_START_DATE THEN                     55510000
                                                      /* EOC RB01305 */ 55520000
           FILE_RCBDTB1.SERVICE_START_DATE =                            55530000
                              USER_FILE_PI.SERVICE_START_DATE;          55540000
                                                      /* SOC RB01305 */ 55550000
           USER_FILE_PI.SERVICE_END_DATE = WRK_PI_HW_END_DATE;          55560000
                                                                        55570000
           IF USER_FILE_PI.SERVICE_END_DATE <                           55580000
               FILE_RCBDTB1.SERVICE_END_DATE THEN                       55590000
                                                      /* EOC RB01305 */ 55600000
           FILE_RCBDTB1.SERVICE_END_DATE   =                            55610000
                              USER_FILE_PI.SERVICE_END_DATE;            55620000
           FILE_RCBDTB1.MARKETING_INSTDAT  =                            55630000
                              USER_FILE_PI.MARKETING_INSTDAT;           55640000
           FILE_RCBDTB1.WARRANTY_SPLT_DATE =                            55650000
                              USER_FILE_PI.WARRANTY_SPLT_DATE;          55660000
           FILE_RCBDTB1.WARRANTY_EXP_DATE  =                            55670000
                              USER_FILE_PI.WARRANTY_EXP_DATE;           55680000
                                                      /* SOC RB01305 */ 55690000
 /*        IF WRK_SW_FW_PI | WRK_SW_HB_PI THEN       /* CEDS00000551 */ 55700000
           IF WRK_SW_HB_PI THEN                      /* CEDS00000551 */ 55710000
             DO;                                                        55720000
               FILE_RCBDTB1.BASE_WARRANTY_SLC = '';                     55730000
             END;                                                       55740000
           ELSE                                                         55750000
             DO;                                                        55760000
               FILE_RCBDTB1.BASE_WARRANTY_SLC = WRK_PI_HW_SLC;          55770000
             END;                                                       55780000
          END;                                        /* EOC RB01305 */ 55790000
         END;                                                           55800000
                                                      /* EOC RB01298 */ 55810000
                                                      /* SOC RB01305 */ 55820000
                                /*-- NO ACTIVE PI OR BAU WARRANTY -- */ 55830000
       IF ¬SW_WARR_PI & ¬SW_WARRANTY THEN                               55840000
         DO;                                                            55850000
           IF SW_POSTWARR_BAU &                                         55860000
              SW_POSTWARR_PI  &                                         55870000
              (PARM_RCB005.PI_TO_BMT = 'Y' |                            55880000
               PARM_RCB005.PI_TO_BMT = 'I'  ) THEN                      55890000
            DO;                                                         55900000
              IF POST_WED_BAU > POST_WED_PI THEN                        55910000
                FILE_RCBDTB1.WARRANTY_EXP_DATE = POST_WED_BAU;          55920000
              ELSE                                                      55930000
                FILE_RCBDTB1.WARRANTY_EXP_DATE = POST_WED_PI;           55940000
            END;                                                        55950000
         END;                                                           55960000
                                                                        55970000
       IF SW_MAINT_PI & ¬SW_WARR_PI &                                   55980000
          (SWITCH_INTERNAL | SWITCH_LEASE_RENTAL) &                     55990000
           SWITCH_EOC_SERV_CTR       THEN                               56000000
         DO;                                                            56010000
          IF PARM_RCB005.PI_TO_BMT = 'Y' | PARM_RCB005.PI_TO_BMT = 'I'  56020000
          THEN DO;                                                      56030000
            FILE_RCBDTB1 = USER_FILE_PI, BY NAME ;                      56040000
                                                                        56050000
            FILE_RCBDTB1.TYPE_OF_WARRANTY   = '';                       56060000
                                                                        56070000
            FILE_RCBDTB1.TYPE_OF_MAINT      =                           56080000
                            USER_FILE_BAU.TYPE_OF_MAINT;                56090000
                                                                        56100000
            FILE_RCBDTB1.MA_STATUS = USER_FILE_BAU.MA_STATUS;           56110000
                                                                        56120000
            FILE_RCBDTB1.INVENTORY_SOURCE =     /* SOC CEDS00000554 */  56130000
                               USER_FILE_BAU.INVENTORY_SOURCE;          56140000
                                                /* EOC CEDS00000554 */  56150000
            FILE_RCBDTB1.SERVICE_START_DATE = WRK_PI_CTR_START_DATE;    56160000
                                                                        56170000
            IF USER_FILE_BAU.SERVICE_START_DATE >                       56180000
                FILE_RCBDTB1.SERVICE_START_DATE THEN                    56190000
                                                                        56200000
            FILE_RCBDTB1.SERVICE_START_DATE =                           56210000
                            USER_FILE_BAU.SERVICE_START_DATE;           56220000
                                                                        56230000
            FILE_RCBDTB1.SERVICE_END_DATE = WRK_PI_CTR_END_DATE;        56240000
                                                                        56250000
            IF USER_FILE_BAU.SERVICE_END_DATE <                         56260000
                FILE_RCBDTB1.SERVICE_END_DATE THEN                      56270000
                                                                        56280000
            FILE_RCBDTB1.SERVICE_END_DATE   =                           56290000
                            USER_FILE_BAU.SERVICE_END_DATE;             56300000
                                                                        56310000
            FILE_RCBDTB1.MARKETING_INSTDAT  =                           56320000
                            USER_FILE_BAU.MARKETING_INSTDAT;            56330000
            FILE_RCBDTB1.WARRANTY_SPLT_DATE =                           56340000
                            USER_FILE_BAU.WARRANTY_SPLT_DATE;           56350000
            FILE_RCBDTB1.WARRANTY_EXP_DATE  =                           56360000
                            USER_FILE_BAU.WARRANTY_EXP_DATE;            56370000
                                                                        56380000
            FILE_RCBDTB1.BASE_WARRANTY_SLC =                            56390000
                           USER_FILE_BAU.SERVICE_LVL_CODE_1;            56400000
          END;                                                          56410000
         END;                                                           56420000
                                                                        56430000
  /*   CALL R621_PROCESS_USER_EXIT;    */                               56440000
                                                                        56450000
  /*   CALL R749_WRITE_RCBDTB1;        */                               56460000
       SWITCH_WRITE_RCBDTB1 = TRUE;                   /* EOC RB01305 */ 56470000
     END;                                                               56480000
     ELSE DO;             /****** BAU PRESENTED TO RCBDT1U ******/      56490000
                                                                        56500000
       DATA_ORIGIN  = '0';            /* ORIGIN OF DATA: BAU CEDS    */ 56510000
       USER_FILE_PI = '';                                               56520000
       USER_FILE_BAU = FILE_RCBDTB1, BY NAME;             /* RC01234 */ 56530000
                                                                        56540000
   /*  CALL R621_PROCESS_USER_EXIT;    */             /* SOC RB01305 */ 56550000
   /*  CALL R749_WRITE_RCBDTB1;        */                               56560000
       WRK_PRECEDENCE_CURRENT = WRK_PRECEDENCE_BAU;                     56570000
       SWITCH_WRITE_RCBDTB1 = TRUE;                   /* EOC RB01305 */ 56580000
     END;                                                               56590000
   END;                                                                 56600000
   ELSE DO;                                                             56610000
     IF ((SWITCH_PI = TRUE) &    /*** ONLY PI PRESENTED TO RCBDT1U ***/ 56620000
                                                          /* RB01289 */ 56630000
        ((WRK_PI_ORIGIN_TEMP = 'BOTH') | (WRK_PI_ORIGIN_TEMP = 'T051')))56640000
 /*     USER_FILE_PI.CUSTOMER_NUMBER ¬= ''    /* T051 ENTRY PRESENT  */ 56650000
                                                          /* RB01289 */ 56660000
     THEN DO;                                                           56670000
       FILE_RCBDTB1         = USER_FILE_PI, BY NAME;                    56680000
                                                                        56690000
       DATA_ORIGIN  = '1';            /* ORIGIN OF DATA: PRIME INPUT */ 56700000
       USER_FILE_BAU = '';                                /* RC01234 */ 56710000
                                                                        56720000
  /*   CALL R621_PROCESS_USER_EXIT; */                /* SOC RB01305 */ 56730000
                                                                        56740000
  /*   CALL R749_WRITE_RCBDTB1;   */                                    56750000
                                                                        56760000
 /* WRITE THE PI IBM BRAND MACHINES IN PER CALL STATUS TO THE OUTPUT    56770000
    FILE ONLY IF IT LIES BEFORE THE HOUSEKEEP RETAIN PERIOD DATE */     56780000
                                                                        56790000
       WRK_PRECEDENCE_CURRENT = WRK_PRECEDENCE_PI;                      56800000
       IF SW_PROCESS_PERCALL = TRUE                                     56810000
       THEN                                                             56820000
        DO;                                                             56830000
         IF SWITCH_RETAIN_PERCALL = TRUE                                56840000
         THEN                                                           56850000
          DO;                                                           56860000
           SWITCH_WRITE_RCBDTB1 = TRUE;                                 56870000
          END;                                                          56880000
        END;                                                            56890000
       ELSE                                                             56900000
        DO;                                                             56910000
          SWITCH_WRITE_RCBDTB1 = TRUE;                                  56920000
        END;                                          /* EOC RB01305 */ 56930000
     END;                                                               56940000
   END;                                                                 56950000
                                                                        56960000
 END R740_FINISH_HW_OCCURENCE;                                          56970000
                                                                        56980000
1/*********************************************************************/56990000
 /*                                                       SOC RB01305 */57000000
 /* MODULE NAME      :  R630_PI_PERCALL                               */57010000
 /*                                                                   */57020000
 /* DESCRIPTION      :  PROCESS PER CALL RECORDS FOR PI WHEN          */57030000
 /*                     PI_TO_BMT = I IN RCB005 PARAMETER             */57040000
 /*                                                                   */57050000
 /*********************************************************************/57060000
 R630_PI_PERCALL: PROC;                                                 57070000
                                                                        57080000
  CALL R639_FETCH_PI_FUT_CTR;                                           57090000
                                                                        57100000
  IF SWITCH_RETAIN_PERCALL =  TRUE                                      57110000
  THEN                                                                  57120000
   DO;                                                                  57130000
     IF CURSOR_HW_PI.TYPE_OF_MAINT   = '2'                              57140000
     THEN                                                               57150000
        USER_FILE_PI.TYPE_OF_MAINT   = '3';                             57160000
     ELSE                                                               57170000
        USER_FILE_PI.TYPE_OF_MAINT   = CURSOR_HW_PI.TYPE_OF_MAINT;      57180000
     IF USER_FILE_PI.TYPE_OF_MAINT = '1'                                57190000
     THEN                                                               57200000
      DO;                                                               57210000
       USER_FILE_PI.COVERAGE_CODE_WD = '5';                             57220000
       USER_FILE_PI.COVERAGE_CODE_SA = '5';                             57230000
       USER_FILE_PI.COVERAGE_CODE_SU = '5';                             57240000
      END;                                                              57250000
                                                                        57260000
      IF (WRK_PRECEDENCE_PI = '' | WRK_PRECEDENCE_PI <= '1') THEN       57270000
      DO;                                                               57280000
       WRK_PRECEDENCE_PI = '1';                                         57290000
      END;                                                              57300000
     USER_FILE_PI.MA_STATUS          =                                  57310000
                      R011_TRANS_TPMNT(USER_FILE_PI.TYPE_OF_MAINT);     57320000
                                                                        57330000
     USER_FILE_PI.SERVICE_LVL_CODE_1 =                                  57340000
                                      CURSOR_HW_PI.SERVICE_LVL_CODE_C;  57350000
     WRK_SERVICE_LVL_CODE    =   USER_FILE_PI.SERVICE_LVL_CODE_1;       57360000
     CALL R470_RETRIEVE_RCBV0470;                                       57370000
                                                                        57380000
     IF SW_SLC_FOUND                                                    57390000
     THEN                                                               57400000
      DO;                                                               57410000
        USER_FILE_PI.COVERAGE_START_1 = TB_RCBV470.COVERAGE_START_1;    57420000
        USER_FILE_PI.COVERAGE_START_2 = TB_RCBV470.COVERAGE_START_2;    57430000
        USER_FILE_PI.COVERAGE_START_3 = TB_RCBV470.COVERAGE_START_3;    57440000
        USER_FILE_PI.COVERAGE_START_4 = TB_RCBV470.COVERAGE_START_4;    57450000
        USER_FILE_PI.COVERAGE_START_5 = TB_RCBV470.COVERAGE_START_5;    57460000
        USER_FILE_PI.COVERAGE_START_6 = TB_RCBV470.COVERAGE_START_6;    57470000
        USER_FILE_PI.COVERAGE_START_7 = TB_RCBV470.COVERAGE_START_7;    57480000
        USER_FILE_PI.COVERAGE_END_1   = TB_RCBV470.COVERAGE_END_1;      57490000
        USER_FILE_PI.COVERAGE_END_2   = TB_RCBV470.COVERAGE_END_2;      57500000
        USER_FILE_PI.COVERAGE_END_3   = TB_RCBV470.COVERAGE_END_3;      57510000
        USER_FILE_PI.COVERAGE_END_4   = TB_RCBV470.COVERAGE_END_4;      57520000
        USER_FILE_PI.COVERAGE_END_5   = TB_RCBV470.COVERAGE_END_5;      57530000
        USER_FILE_PI.COVERAGE_END_6   = TB_RCBV470.COVERAGE_END_6;      57540000
        USER_FILE_PI.COVERAGE_END_7   = TB_RCBV470.COVERAGE_END_7;      57550000
      END;                                                              57560000
     ELSE                                                               57570000
      DO;                                                               57580000
        IF WRK_V051_IND11 = -1                                          57590000
        THEN                                                            57600000
         DO;                                                            57610000
           USER_FILE_PI.COVERAGE_START_1 = '';                          57620000
           USER_FILE_PI.COVERAGE_START_2 = '';                          57630000
           USER_FILE_PI.COVERAGE_START_3 = '';                          57640000
           USER_FILE_PI.COVERAGE_START_4 = '';                          57650000
           USER_FILE_PI.COVERAGE_START_5 = '';                          57660000
           USER_FILE_PI.COVERAGE_START_6 = '';                          57670000
           USER_FILE_PI.COVERAGE_START_7 = '';                          57680000
           USER_FILE_PI.COVERAGE_END_1   = '';                          57690000
           USER_FILE_PI.COVERAGE_END_2   = '';                          57700000
           USER_FILE_PI.COVERAGE_END_3   = '';                          57710000
           USER_FILE_PI.COVERAGE_END_4   = '';                          57720000
           USER_FILE_PI.COVERAGE_END_5   = '';                          57730000
           USER_FILE_PI.COVERAGE_END_6   = '';                          57740000
           USER_FILE_PI.COVERAGE_END_7   = '';                          57750000
         END;                                                           57760000
      END;                                                              57770000
   END;                                                                 57780000
                                                                        57790000
 END R630_PI_PERCALL;                                                   57800000
                                                       /* EOC RB01305 */57810000
1/*********************************************************************/57820000
 /*                                                       SOC RB01305 */57830000
 /* MODULE NAME      :  R639_FETCH_PI_FUT_CTR                         */57840000
 /*                                                                   */57850000
 /* DESCRIPTION      :  FETCH THE FUTURE CONTRACT FOR IBM BRAND       */57860000
 /*                     MACHINE                                       */57870000
 /*                                                                   */57880000
 /*********************************************************************/57890000
 R639_FETCH_PI_FUT_CTR: PROC;                                           57900000
                                                                        57910000
  SWITCH_RETAIN_PERCALL = FALSE;                                        57920000
                                                  /* SOC CEDS00000624 */57930000
                                                       /* SOC RB01320 */57940000
 /*IF WRK_PI_REAL_SERIAL_NO_V125_IND = -1 THEN                          57950000
 DO;                                                                    57960000
    WRK_ORIGIN  = CURSOR_HW_PI.ORIGIN;                                  57970000
    WRK_SEQ_NO  = CURSOR_HW_PI.SEQUENCE_NUMBER;                         57980000
 END;                                                                   57990000
 ELSE                                                                   58000000
 DO;                                                                    58010000
    WRK_ORIGIN  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,1,2);               58020000
    WRK_SEQ_NO  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,3);                 58030000
 END;*/                                               /* EOC RB01320 */ 58040000
                                                                        58050000
                                                                        58060000
  WRK_SOURCE = 'T241';                                                  58070000
  WRK_PRODUCT_TYPE_REAL    = CURSOR_HW_PI.PRODUCT_TYPE;                 58080000
  WRK_ORIGIN_REAL          = CURSOR_HW_PI.ORIGIN;                       58090000
  WRK_SEQUENCE_NUMBER_REAL = CURSOR_HW_PI.SEQUENCE_NUMBER;              58100000
  CALL R767_RETRIEVE_PI_REAL_SER;                                       58110000
                                                                        58120000
 IF SWITCH_PI_ONLY | SWITCH_BAU_PI THEN                                 58130000
 DO;                                                                    58140000
 IF PI_REAL_SERNO ¬= '  '  THEN                                         58150000
 DO;                                                                    58160000
    WRK_ORIGIN  = SUBSTR(PI_REAL_SERNO,1,2);                            58170000
    WRK_SEQ_NO  = SUBSTR(PI_REAL_SERNO,3);                              58180000
 END;                                                                   58190000
 ELSE                                                                   58200000
 DO;                                                                    58210000
    WRK_ORIGIN  = CURSOR_HW_PI.ORIGIN;                                  58220000
    WRK_SEQ_NO  = CURSOR_HW_PI.SEQUENCE_NUMBER;                         58230000
 END;                                                                   58240000
 END;                                                                   58250000
                                                  /* EOC CEDS00000624 */58260000
  EXEC SQL                                                              58270000
   SELECT MIN(EFFECTIVE_DATE)                                           58280000
   INTO  :WRK_MIN_EFF_A     :WRK_INDNULL                                58290000
   FROM RCBV0241_PI_CTR                                                 58300000
   WHERE PRODUCT_TYPE    = :CURSOR_HW_PI.PRODUCT_TYPE                   58310000
                                                       /* SOC RB01320 */58320000
   /*AND ORIGIN          = :CURSOR_HW_PI.ORIGIN                         58330000
     AND SEQUENCE_NUMBER = :CURSOR_HW_PI.SEQUENCE_NUMBER */             58340000
     AND ORIGIN          = :WRK_ORIGIN                                  58350000
     AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                  58360000
                                                       /* EOC RB01320 */58370000
     AND COUNTRY_NUMBER  = :WRK_CTRYNO                                  58380000
     AND EFFECTIVE_DATE  > :WRK_RUN_DATE                                58390000
  ;                                                                     58400000
                                                                        58410000
  SELECT(SQLCODE);                                                      58420000
   WHEN (0)                                                             58430000
    DO;                                                                 58440000
     IF WRK_INDNULL = -1                                                58450000
     THEN                                                               58460000
      DO;                                                               58470000
        USER_FILE_PI.SERVICE_START_DATE  =  WRK_RUN_DATE;               58480000
        USER_FILE_PI.SERVICE_END_DATE    =                              58490000
                     R016_PERCALL_CALC(CURSOR_HW_PI.WARRANTY_EXP_DATE); 58500000
      END;                                                              58510000
     ELSE                                                               58520000
      DO;                                                               58530000
        USER_FILE_PI.SERVICE_START_DATE  = WRK_RUN_DATE;                58540000
        USER_FILE_PI.SERVICE_END_DATE    =                              58550000
                                       R014_DATE_CALC(WRK_MIN_EFF_A,-1);58560000
        SWITCH_RETAIN_PERCALL = TRUE;                                   58570000
      END;                                                              58580000
    END;                                                                58590000
   WHEN (100);                                                          58600000
   OTHERWISE                                                            58610000
    DO;                                                                 58620000
      CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#074');                   58630000
    END;                                                                58640000
  END;                                                                  58650000
                                                                        58660000
 END R639_FETCH_PI_FUT_CTR;                                             58670000
                                                       /* EOC RB01305 */58680000
1/*********************************************************************/58690000
 /*                                                       SOC RB01305 */58700000
 /* MODULE NAME      :  R016_PERCALL_CALC                             */58710000
 /*                                                                   */58720000
 /* DESCRIPTION      :  CALCULATE THE HOUSEKEEP RETAIN PERIOD DATE    */58730000
 /*                                                                   */58740000
 /*********************************************************************/58750000
 R016_PERCALL_CALC: PROC (WRK_WARR_EXP_DATE)                            58760000
                    RETURNS (CHAR(10));                                 58770000
  DCL WRK_WARR_EXP_DATE   CHAR(10);                                     58780000
                                                                        58790000
  SWITCH_RETAIN_PERCALL = FALSE;                                        58800000
                                                                        58810000
                                                       /* SOC RC01389 */58811000
  /*WRK_PERCALL_ENDDATE = R014_DATE_CALC(WRK_WARR_EXP_DATE,1095);     */58820000
  WRK_PERCALL_ENDDATE = R014_DATE_CALC(WRK_WARR_EXP_DATE,               58822000
                                       WRK_RETENTION)                   58823000
                                                       /* EOC RC01389 */58824000
                                                                        58825000
  WRK_RETAIN_DATE = R014_DATE_CALC(WRK_PERCALL_ENDDATE,                 58840000
                                   -PARM_RCB005.PI_TO_BMT_INV);         58850000
                                                                        58860000
  IF WRK_RETAIN_DATE  >=  WRK_RUN_DATE                                  58870000
  THEN  SWITCH_RETAIN_PERCALL = TRUE;                                   58880000
  ELSE                                                                  58890000
  DO;                                                                   58900000
   SWITCH_RETAIN_PERCALL = FALSE;                                       58910000
   SWITCH_PI = FALSE;                                                   58920000
  END;                                                                  58930000
                                                                        58940000
  RETURN(WRK_PERCALL_ENDDATE);                                          58950000
                                                                        58960000
 END R016_PERCALL_CALC;                                                 58970000
                                                       /* EOC RB01305 */58980000
1/*********************************************************************/58990000
 /*                                                    /* SOC RB01305 */59000000
 /* MODULE NAME      : R750_PROCESS_FUT_HW                            */59010000
 /*                                                                   */59020000
 /* DESCRIPTION      : FETCH THE FUTURE INVERNTORY DETAILS FOR THE TOS*/59030000
 /*                    AND APPLY PRIORITY RULES                       */59040000
 /*********************************************************************/59050000
 R750_PROCESS_FUT_HW: PROC;                                             59060000
                                                                        59070000
 CALL R751_INIT_FUT;                                                    59080000
                                                                        59090000
 CALL R752_GET_FUT_RUN_DATE;                                            59100000
                                                                        59110000
 IF SWITCH_VALID_FUT_RUN_DATE = TRUE THEN                               59120000
   CALL R753_READ_FUT_REC;                                              59130000
                                                                        59144050
 IF SWITCH_FUT_REC = TRUE THEN                                          59150000
  DO;                                                                   59160000
     IF SWITCH_PI_FUT = TRUE                                            59170000
     THEN DO;                                                           59180000
       CALL R754_PROCESS_PI_HW_FUT;                                     59190000
     END;                                                               59200000
                                                                        59210000
     IF SWITCH_BAU_FUT = TRUE                                           59220000
     THEN DO;                                                           59230000
       CALL R756_PROCESS_REGULAR_HW_FUT;                                59240000
     END;                                                               59250000
                                                                        59260000
     CALL R762_APPLY_PI_BAU_PRIORITY_FUT;                               59270000
                                                                        59280000
     IF STRING(FUTURE_PI_BAU) = '' THEN                                 59290000
       SWITCH_FUT_REC = FALSE;                                          59300000
  END;                                                                  59310000
 END R750_PROCESS_FUT_HW;                              /* EOC RB01305 */59320000
1/*********************************************************************/59330000
 /*                                                    /* SOC RB01305 */59340000
 /* MODULE NAME      : R751_INIT_FUT                                  */59350000
 /*                                                                   */59360000
 /* DESCRIPTION      : INITIALIZE THE VARIABLES USED IN FUTURE PERIOD */59370000
 /*                    CALCULATION                                    */59380000
 /*********************************************************************/59390000
 R751_INIT_FUT: PROC;                                                   59400000
                                                                        59410000
 TB_240_FUT                   = '';                                     59420000
 TB_240_FUT_I                 = '';                                     59430000
                                                                        59440000
 HW_CTR_PI_FUT                = '';                                     59450000
 HW_CTR_PI_FUT_I              = '';                                     59460000
                                                                        59470000
 INST_HW_BAU_FUT              = '';                                     59480000
 INST_HW_BAU_FUT_I            = '';                                     59490000
                                                                        59500000
 FUTURE_PI                    = '';                                     59510000
 FUTURE_BAU                   = '';                                     59520000
 FUTURE_PI_BAU                = '';                                     59530000
                                                                        59540000
 RUN_DATE_FUT                 = '';                                     59550000
 WRK_PI_CTR_START_DATE_FUT    = '';                                     59560000
 WRK_PI_CTR_END_DATE_FUT      = '';                                     59570000
 WRK_PI_HW_START_DATE_FUT     = '';                                     59580000
 WRK_PI_HW_END_DATE_FUT       = '';                                     59590000
 WRK_MIN_EFF_DATE_FUT         = '';                                     59600000
 WRK_MIN_EFF_DATE_FUT_INDNULL = -1;                                     59610000
                                             /* INITIALISE SWITCHES  */ 59620000
 SWITCH_VALID_FUT_RUN_DATE    = FALSE;                                  59630000
 SWITCH_FUT_REC               = FALSE;                                  59640000
 SWITCH_BAU_FUT               = FALSE;                                  59650000
 SWITCH_PI_FUT                = FALSE;                                  59660000
 SW_WARRANTY_FUT              = FALSE;                                  59670000
 SW_MAINT_02_FUT              = FALSE;                                  59680000
 SW_WARR_PI_FUT               = FALSE;                                  59690000
 SW_MAINT_PI_FUT              = FALSE;                                  59700000
 SW_BRAND_BAU_FUT             = FALSE;                                  59710000
 SWITCH_FW_BAU_FUT            = FALSE;                                  59720000
 SWITCH_HB_BAU_FUT            = FALSE;                                  59730000
 SW_BRAND_PI_FUT              = FALSE;                                  59740000
 SW_FW_PI_FUT                 = FALSE;                                  59750000
 SW_HB_PI_FUT                 = FALSE;                                  59760000
 SW_SPLTWAR_PI_FUT            = FALSE;                                  59770000
 SW_TOM_INTERNAL_MACHINE_FUT  = FALSE;                                  59780000
 SW_INTERNAL_MACHINE_CTR_FUT  = FALSE;                                  59790000
 SW_INTERNAL_FUT              = FALSE;                                  59800000
 SW_LEASE_RENTAL_FUT          = FALSE;                                  59810000
 SWITCH_SERV_CTR_FUT          = FALSE;                                  59820000
 SW_PROCESS_PERCALL_FUT       = FALSE;                                  59830000
 SWITCH_RETAIN_PERCALL_FUT    = FALSE;                                  59840000
 WRK_PRECEDENCE_BAU_FUT       = '';                                     59850000
 WRK_PRECEDENCE_PI_FUT        = '';                                     59860000
                                                                        59870000
 END R751_INIT_FUT;                                    /* EOC RB01305 */59880000
1/*********************************************************************/59890000
 /*                                                    /* SOC RB01305 */59900000
 /* MODULE NAME      : R752_GET_FUT_RUN_DATE                          */59910000
 /*                                                                   */59920000
 /* DESCRIPTION      : CALCULATE THE EXPECTED FUTURE RUNDATE          */59930000
 /*                                                                   */59940000
 /*********************************************************************/59950000
 R752_GET_FUT_RUN_DATE: PROC;                                           59960000
                                                                        59970000
  IF TEMP_CURR_END_DATE = '' THEN                                       59980000
    TEMP_CURR_END_DATE = FILE_RCBDTB1.SERVICE_END_DATE;                 59990000
                                                                        60000000
  RUN_DATE_FUT = R014_DATE_CALC (TEMP_CURR_END_DATE,+1);                60010000
                                                                        60020000
  IF ( TEMP_SW_BRAND_PI_FUT = TRUE ) &                                  60030000
     ( RUN_DATE_FUT > TEMP_T051_SPLT_DATE_FUT ) THEN                    60040000
    RUN_DATE_FUT = TEMP_T051_SPLT_DATE_FUT;                             60050000
                                                                        60060000
  IF ( TEMP_SW_BRAND_BAU_FUT = TRUE ) &                                 60070000
     ( RUN_DATE_FUT > TEMP_T220_SPLT_DATE_FUT ) THEN                    60080000
    RUN_DATE_FUT = TEMP_T220_SPLT_DATE_FUT;                             60090000
                                                                        60100000
  IF RUN_DATE_FUT ¬= '9999-12-31' THEN                                  60110000
   DO;                                                                  60120000
    SWITCH_VALID_FUT_RUN_DATE   = TRUE;                                 60130000
   END;                                                                 60140000
                                                                        60150000
                                                  /* SOC CEDS00000624 */60160000
                                                       /* SOC RB01320 */60170000
 /*IF WRK_PI_REAL_SERIAL_NO_V125_IND = -1 THEN                          60180000
 DO;                                                                    60190000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       60200000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              60210000
 END;                                                                   60220000
 ELSE                                                                   60230000
 DO;                                                                    60240000
    WRK_ORIGIN  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,1,2);               60250000
    WRK_SEQ_NO  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,3);                 60260000
 END;*/                                               /* EOC RB01320 */ 60270000
                                                                        60280000
 WRK_SOURCE = 'T051';                                                   60290000
 WRK_PRODUCT_TYPE_REAL    = WRK_PRODUCT_TYPE_FUT;                       60300000
 WRK_ORIGIN_REAL          = WRK_ORIGIN_FUT;                             60310000
 WRK_SEQUENCE_NUMBER_REAL = WRK_SEQUENCE_NUMBER_FUT;                    60320000
                                                                        60330000
 CALL R767_RETRIEVE_PI_REAL_SER;                                        60340000
                                                                        60350000
 IF  SWITCH_PI_ONLY|SWITCH_BAU_PI THEN                                  60360000
 DO;                                                                    60370000
 IF PI_REAL_SERNO ¬= '  '  THEN                                         60380000
 DO;                                                                    60390000
    WRK_ORIGIN  = SUBSTR(PI_REAL_SERNO,1,2);                            60400000
    WRK_SEQ_NO  = SUBSTR(PI_REAL_SERNO,3);                              60410000
 END;                                                                   60420000
 ELSE                                                                   60430000
 DO;                                                                    60440000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       60450000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              60460000
 END;                                                                   60470000
 END;                                                                   60480000
                                                  /* EOC CEDS00000624 */60490000
  EXEC SQL                                                              60500000
  SELECT MIN(EFFECTIVE_DATE)                                            60510000
  INTO :WRK_MIN_EFF_DATE_FUT  :WRK_MIN_EFF_DATE_FUT_INDNULL             60520000
  FROM RCBV0241_PI_CTR                                                  60530000
  WHERE PRODUCT_TYPE       = :WRK_PRODUCT_TYPE_FUT                      60540000
                                                       /* SOC RB01320 */60550000
  /*AND ORIGIN             = :WRK_ORIGIN_FUT                            60560000
    AND SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER_FUT */                60570000
    AND ORIGIN             = :WRK_ORIGIN                                60580000
    AND SEQUENCE_NUMBER    = :WRK_SEQ_NO                                60590000
                                                       /* EOC RB01320 */60600000
    AND COUNTRY_NUMBER     = :WRK_CTRYNO                                60610000
    AND EFFECTIVE_DATE     > :TEMP_RUN_DATE_FUT ;                       60620000
                                                                        60630000
  SELECT(SQLCODE);                                                      60640000
    WHEN (0)                                                            60650000
    DO;                                                                 60660000
      IF ( (WRK_MIN_EFF_DATE_FUT_INDNULL ¬= -1)  &                      60670000
           (WRK_MIN_EFF_DATE_FUT < RUN_DATE_FUT) ) THEN                 60680000
        RUN_DATE_FUT = WRK_MIN_EFF_DATE_FUT;                            60690000
    END;                                                                60700000
    WHEN (100);                                                         60710000
    OTHERWISE                                                           60720000
    DO;                                                                 60730000
      CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#061');                   60740000
    END;                                                                60750000
  END;                                                                  60760000
                                                                        60770000
                                                  /* SOC CEDS00000624 */60780000
                                                       /* SOC RB01320 */60790000
 /*IF WRK_BAU_REAL_SERIAL_NO_V125_IND = -1 THEN                         60800000
 DO;                                                                    60810000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       60820000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              60830000
 END;                                                                   60840000
 ELSE                                                                   60850000
 DO;                                                                    60860000
    WRK_ORIGIN  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,1,2);              60870000
    WRK_SEQ_NO  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,3);                60880000
 END;                                                                   60890000
                                                 */   /* EOC RB01320 */ 60900000
  WRK_PRODUCT_TYPE_REAL    = WRK_PRODUCT_TYPE_FUT;                      60910000
  WRK_ORIGIN_REAL          = WRK_ORIGIN_FUT;                            60920000
  WRK_SEQUENCE_NUMBER_REAL = WRK_SEQUENCE_NUMBER_FUT;                   60930000
                                                                        60940000
  CALL R768_RETRIEVE_BAU_REAL_SER;                                      60950000
                                                                        60960000
 IF SWITCH_BAU_ONLY| SWITCH_BAU_PI THEN                                 60970000
 DO;                                                                    60980000
 IF BAU_REAL_SERNO = ' ' THEN                                           60990000
 DO;                                                                    61000000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       61010000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              61020000
 END;                                                                   61030000
 ELSE                                                                   61040000
 DO;                                                                    61050000
    WRK_ORIGIN  = SUBSTR(BAU_REAL_SERNO,1,2);                           61060000
    WRK_SEQ_NO  = SUBSTR(BAU_REAL_SERNO,3);                             61070000
 END;                                                                   61080000
 END;                                                                   61090000
                                                  /* EOC CEDS00000624 */61100000
  EXEC SQL                                                              61110000
  SELECT MIN(C.EFFECTIVE_DATE)                                          61120000
  INTO :WRK_MIN_EFF_DATE_FUT :WRK_MIN_EFF_DATE_FUT_INDNULL              61130000
  FROM RCBV0190_HW_CUST     A                                           61140000
      ,RCBV0170_OU_HW       B                                           61150000
      ,RCBV0220_SUPPL_CTR   C                                           61160000
  WHERE A.PRODUCT_TYPE        = :WRK_PRODUCT_TYPE_FUT                   61170000
                                                       /* SOC RB01320 */61180000
  /*AND A.ORIGIN              = :WRK_ORIGIN_FUT                         61190000
    AND A.SEQUENCE_NUMBER     = :WRK_SEQUENCE_NUMBER_FUT */             61200000
    AND A.ORIGIN              = :WRK_ORIGIN                             61210000
    AND A.SEQUENCE_NUMBER     = :WRK_SEQ_NO                             61220000
                                                       /* EOC RB01320 */61230000
    AND A.COUNTRY_NUMBER      = :WRK_CTRYNO                             61240000
    AND A.TYPE_OF_RELATION    = 'U'                                     61250000
    AND A.EFFECTIVE_DATE      > :TEMP_RUN_DATE_FUT                      61260000
                                                                        61270000
    AND B.PRODUCT_TYPE        = :WRK_PRODUCT_TYPE_FUT                   61280000
                                                       /* SOC RB01320 */61290000
  /*AND B.ORIGIN              = :WRK_ORIGIN_FUT                         61300000
    AND B.SEQUENCE_NUMBER     = :WRK_SEQUENCE_NUMBER_FUT*/              61310000
    AND B.ORIGIN              = :WRK_ORIGIN                             61320000
    AND B.SEQUENCE_NUMBER     = :WRK_SEQ_NO                             61330000
                                                       /* EOC RB01320 */61340000
    AND B.COUNTRY_NUMBER      = :WRK_CTRYNO                             61350000
    AND B.EFFECTIVE_DATE      <= A.END_DATE                             61360000
    AND B.END_DATE            >= A.EFFECTIVE_DATE                       61370000
                                                                        61380000
    AND C.PRODUCT_TYPE        = :WRK_PRODUCT_TYPE_FUT                   61390000
                                                       /* SOC RB01320 */61400000
  /*AND C.ORIGIN              = :WRK_ORIGIN_FUT                         61410000
    AND C.SEQUENCE_NUMBER     = :WRK_SEQUENCE_NUMBER_FUT */             61420000
    AND C.ORIGIN              = :WRK_ORIGIN                             61430000
    AND C.SEQUENCE_NUMBER     = :WRK_SEQ_NO                             61440000
                                                       /* EOC RB01320 */61450000
    AND C.COUNTRY_NUMBER      = :WRK_CTRYNO                             61460000
    AND C.EFFECTIVE_DATE      <= A.END_DATE                             61470000
    AND C.END_DATE            >= A.EFFECTIVE_DATE                       61480000
    AND C.EFFECTIVE_DATE      <= B.END_DATE                             61490000
    AND C.END_DATE            >= B.EFFECTIVE_DATE                       61500000
    AND C.EFFECTIVE_DATE      > :TEMP_RUN_DATE_FUT ;                    61510000
                                                                        61520000
  SELECT(SQLCODE);                                                      61530000
    WHEN (0)                                                            61540000
    DO;                                                                 61550000
      IF ( (WRK_MIN_EFF_DATE_FUT_INDNULL ¬= -1)  &                      61560000
           (WRK_MIN_EFF_DATE_FUT < RUN_DATE_FUT) ) THEN                 61570000
        RUN_DATE_FUT = WRK_MIN_EFF_DATE_FUT;                            61580000
    END;                                                                61590000
    WHEN (100);                                                         61600000
    OTHERWISE                                                           61610000
    DO;                                                                 61620000
      CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#062');                   61630000
    END;                                                                61640000
  END;                                                                  61650000
                                                                        61660000
  EXEC SQL                                                              61670000
  SELECT MIN(EFFECTIVE_DATE)                                            61680000
  INTO :WRK_MIN_EFF_DATE_FUT :WRK_MIN_EFF_DATE_FUT_INDNULL              61690000
  FROM RCBV0240_SERV_CTR                                                61700000
  WHERE PRODUCT_TYPE        = :WRK_PRODUCT_TYPE_FUT                     61710000
                                                       /* SOC RB01320 */61720000
  /*AND ORIGIN              = :WRK_ORIGIN_FUT                           61730000
    AND SEQUENCE_NUMBER     = :WRK_SEQUENCE_NUMBER_FUT */               61740000
    AND ORIGIN              = :WRK_ORIGIN                               61750000
    AND SEQUENCE_NUMBER     = :WRK_SEQ_NO                               61760000
                                                       /* EOC RB01320 */61770000
    AND COUNTRY_NUMBER      = :WRK_CTRYNO                               61780000
    AND EFFECTIVE_DATE      > :TEMP_RUN_DATE_FUT ;                      61790000
                                                                        61800000
  SELECT(SQLCODE);                                                      61810000
    WHEN (0)                                                            61820000
    DO;                                                                 61830000
      IF ( (WRK_MIN_EFF_DATE_FUT_INDNULL ¬= -1)  &                      61840000
           (WRK_MIN_EFF_DATE_FUT < RUN_DATE_FUT) ) THEN                 61850000
        RUN_DATE_FUT = WRK_MIN_EFF_DATE_FUT;                            61860000
    END;                                                                61870000
    WHEN (100);                                                         61880000
    OTHERWISE                                                           61890000
    DO;                                                                 61900000
      CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#063');                   61910000
    END;                                                                61920000
  END;                                                                  61930000
                                                                        61940000
 END R752_GET_FUT_RUN_DATE;                            /* EOC RB01305 */61950000
1/*********************************************************************/61960000
 /*                                                    /* SOC RB01305 */61970000
 /* MODULE NAME      : R753_READ_FUT_REC                              */61980000
 /*                                                                   */61990000
 /* DESCRIPTION      : READ THE FUTURE RECORDS FROM PI AND BAU WITH   */62000000
 /*                    RESPECT TO FUTURE RUNDATE                      */62010000
 /*********************************************************************/62020000
 R753_READ_FUT_REC : PROC;                                              62030000
                                                                        62040000
 HW_CTR_PI_FUT      = '';                                               62050000
 HW_CTR_PI_FUT_I    = '';                                               62060000
 INST_HW_BAU_FUT    = '';                                               62070000
 INST_HW_BAU_FUT_I  = '';                                               62080000
                                                                        62090000
 SWITCH_BAU_FUT                  = FALSE;                               62100000
 SWITCH_PI_FUT                   = FALSE;                               62110000
 SWITCH_FUT_REC                  = FALSE;                               62120000
                                                                        62130000
 SW_BRAND_BAU_FUT                = FALSE;                               62140000
 SWITCH_FW_BAU_FUT               = FALSE;                               62150000
 SWITCH_HB_BAU_FUT               = FALSE;                               62160000
 SW_INTERNAL_MACHINE_CTR_FUT = FALSE;                                   62170000
 SW_TOM_INTERNAL_MACHINE_FUT = FALSE;                                   62180000
 SW_INTERNAL_FUT             = FALSE;                                   62190000
 SW_LEASE_RENTAL_FUT         = FALSE;                                   62200000
                                                                        62210000
                                                  /* SOC CEDS00000624 */62220000
 /*IF WRK_PI_REAL_SERIAL_NO_V125_IND = -1 THEN*/       /* SOC RB01320 */62230000
 /*DO;                                                                  62240000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       62250000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              62260000
 END;                                                                   62270000
 ELSE                                                                   62280000
 DO;                                                                    62290000
    WRK_ORIGIN  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,1,2);               62300000
    WRK_SEQ_NO  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,3);                 62310000
 END;*/                                               /* EOC RB01320 */ 62320000
                                                                        62330000
 WRK_SOURCE = 'T051';                                                   62340000
 WRK_PRODUCT_TYPE_REAL    = WRK_PRODUCT_TYPE_FUT;                       62350000
 WRK_ORIGIN_REAL          = WRK_ORIGIN_FUT;                             62360000
 WRK_SEQUENCE_NUMBER_REAL = WRK_SEQUENCE_NUMBER_FUT;                    62370000
                                                                        62380000
 CALL R767_RETRIEVE_PI_REAL_SER;                                        62390000
                                                                        62400000
 IF SWITCH_PI_ONLY| SWITCH_BAU_PI THEN                                  62410000
 DO;                                                                    62420000
 IF PI_REAL_SERNO ¬= '  '  THEN                                         62430000
 DO;                                                                    62440000
    WRK_ORIGIN  = SUBSTR(PI_REAL_SERNO,1,2)                             62450000
    WRK_SEQ_NO  = SUBSTR(PI_REAL_SERNO,3);                              62460000
 END;                                                                   62470000
 ELSE                                                                   62480000
 DO;                                                                    62490000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       62500000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              62510000
 END;                                                                   62520000
 END;                                                                   62530000
                                                  /* EOC CEDS00000624 */62540000
   EXEC SQL                                                             62550000
   SELECT A.PRODUCT_TYPE                                                62560000
         ,A.ORIGIN                                                      62570000
         ,A.SEQUENCE_NUMBER                                             62580000
         ,'BOTH'                                                        62590000
         ,A.INSTALL_DATE                                                62600000
         ,A.TYPE_OF_MAINT                                               62610000
         ,A.TYPE_OF_WARRANTY                                            62620000
         ,A.WARRANTY_SPLT_DATE                                          62630000
         ,A.WARRANTY_EXP_DATE                                           62640000
         ,A.F_TYPE_OF_WARRANTY                                          62650000
         ,A.WARRANTY_LIABILITY                                          62660000
         ,B.CONTRACT_NUMBER                                             62670000
         ,B.AUTHORISATION_CODE                                          62680000
         ,B.EFFECTIVE_DATE                                              62690000
         ,B.END_DATE                                                    62700000
   INTO :HW_CTR_PI_FUT                                                  62710000
        :HW_CTR_PI_FUT_I.INDNULL                                        62720000
   FROM RCBV0051_PI_HW_PR       A                                       62730000
   INNER JOIN RCBV0241_PI_CTR         B                                 62740000
     ON  B.PRODUCT_TYPE       = A.PRODUCT_TYPE                          62750000
     AND B.ORIGIN             = A.ORIGIN                                62760000
     AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER                       62770000
     AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                        62780000
                                                                        62790000
   WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                             62800000
     AND A.PRODUCT_TYPE       = :WRK_PRODUCT_TYPE_FUT                   62810000
                                                       /* SOC RB01320 */62820000
   /*AND A.ORIGIN             = :WRK_ORIGIN_FUT                         62830000
     AND A.SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER_FUT*/              62840000
     AND A.ORIGIN             = :WRK_ORIGIN                             62850000
     AND A.SEQUENCE_NUMBER    = :WRK_SEQ_NO                             62860000
                                                       /* EOC RB01320 */62870000
     AND :RUN_DATE_FUT BETWEEN B.EFFECTIVE_DATE AND B.END_DATE          62880000
   WITH UR;                                                             62890000
   SELECT (SQLCA.SQLCODE);                                              62900000
     WHEN (0)                                                           62910000
      DO;                                                               62920000
       SWITCH_PI_FUT = TRUE;                                            62930000
      END;                                                              62940000
     WHEN (100);                                                        62950000
     OTHERWISE                                                          62960000
       DO;                                                              62970000
         CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#064');                62980000
       END;                                                             62990000
   END;                                                                 63000000
                                                                        63010000
 IF SWITCH_PI_FUT ¬= TRUE THEN                                          63020000
  DO;                                                                   63030000
   EXEC SQL                                                             63040000
   SELECT A.PRODUCT_TYPE                                                63050000
         ,A.ORIGIN                                                      63060000
         ,A.SEQUENCE_NUMBER                                             63070000
         ,'T051'                                                        63080000
         ,A.INSTALL_DATE                                                63090000
         ,A.TYPE_OF_MAINT                                               63100000
         ,A.TYPE_OF_WARRANTY                                            63110000
         ,A.WARRANTY_SPLT_DATE                                          63120000
         ,A.WARRANTY_EXP_DATE                                           63130000
         ,A.F_TYPE_OF_WARRANTY                                          63140000
         ,A.WARRANTY_LIABILITY                                          63150000
         ,''                                                            63160000
         ,''                                                            63170000
         ,DATE('3999-12-31')                                            63180000
         ,DATE('3999-12-31')                                            63190000
   INTO :HW_CTR_PI_FUT                                                  63200000
        :HW_CTR_PI_FUT_I.INDNULL                                        63210000
   FROM RCBV0051_PI_HW_PR A                                             63220000
   WHERE A.PRODUCT_TYPE       = :WRK_PRODUCT_TYPE_FUT                   63230000
                                                       /* SOC RB01320 */63240000
   /*AND A.ORIGIN             = :WRK_ORIGIN_FUT                         63250000
     AND A.SEQUENCE_NUMBER    = :WRK_SEQUENCE_NUMBER_FUT */             63260000
     AND A.ORIGIN             = :WRK_ORIGIN                             63270000
     AND A.SEQUENCE_NUMBER    = :WRK_SEQ_NO                             63280000
                                                       /* EOC RB01320 */63290000
     AND A.COUNTRY_NUMBER     = :WRK_CTRYNO                             63300000
     AND (A.WARRANTY_EXP_DATE >= :RUN_DATE_FUT                          63310000
          OR                                                            63320000
          (:PARM_RCB005.PI_TO_BMT = 'I'  AND                            63330000
           (A.WARRANTY_LIABILITY IN ('IBM','') OR                       63340000
                 A.WARRANTY_LIABILITY IS NULL ) AND                     63350000
           A.WARRANTY_EXP_DATE < :RUN_DATE_FUT) )                       63360000
   WITH UR;                                                             63370000
                                                                        63380000
   SELECT (SQLCA.SQLCODE);                                              63390000
    WHEN (0)                                                            63400000
      DO;                                                               63410000
        SWITCH_PI_FUT = TRUE;                                           63420000
      END;                                                              63430000
    WHEN (100);                                                         63440000
    OTHERWISE                                                           63450000
      DO;                                                               63460000
        CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#065');                 63470000
      END;                                                              63480000
   END;                                                                 63490000
  END;                                                                  63500000
                                                                        63510000
 IF SWITCH_PI_FUT ¬= TRUE THEN                                          63520000
  DO;                                                                   63530000
   EXEC SQL                                                             63540000
   SELECT A.PRODUCT_TYPE                                                63550000
         ,A.ORIGIN                                                      63560000
         ,A.SEQUENCE_NUMBER                                             63570000
         ,'T241'                                                        63580000
         ,DATE('3999-12-31')                                            63590000
         ,''                                                            63600000
         ,''                                                            63610000
         ,DATE('3999-12-31')                                            63620000
         ,DATE('3999-12-31')                                            63630000
         ,''                                                            63640000
         ,''                                                            63650000
         ,A.CONTRACT_NUMBER                                             63660000
         ,A.AUTHORISATION_CODE                                          63670000
         ,A.EFFECTIVE_DATE                                              63680000
         ,A.END_DATE                                                    63690000
   INTO :HW_CTR_PI_FUT                                                  63700000
        :HW_CTR_PI_FUT_I.INDNULL                                        63710000
   FROM RCBV0241_PI_CTR     A                                           63720000
   WHERE A.COUNTRY_NUMBER   = :WRK_CTRYNO                               63730000
     AND A.PRODUCT_TYPE     = :WRK_PRODUCT_TYPE_FUT                     63740000
                                                       /* SOC RB01320 */63750000
  /* AND A.ORIGIN           = :WRK_ORIGIN_FUT                           63760000
     AND A.SEQUENCE_NUMBER  = :WRK_SEQUENCE_NUMBER_FUT */               63770000
     AND A.ORIGIN           = :WRK_ORIGIN                               63780000
     AND A.SEQUENCE_NUMBER  = :WRK_SEQ_NO                               63790000
                                                      /* EOC RB01320 */ 63800000
     AND :RUN_DATE_FUT BETWEEN A.EFFECTIVE_DATE AND A.END_DATE          63810000
   WITH UR;                                                             63820000
                                                                        63830000
   SELECT (SQLCA.SQLCODE);                                              63840000
    WHEN (0)                                                            63850000
      DO;                                                               63860000
        SWITCH_PI_FUT = TRUE;                                           63870000
      END;                                                              63880000
    WHEN (100);                                                         63890000
    OTHERWISE                                                           63900000
      DO;                                                               63910000
        CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#066');                 63920000
      END;                                                              63930000
   END;                                                                 63940000
  END;                                                                  63950000
                                                                        63960000
  IF SWITCH_PI_FUT = TRUE THEN                                          63970000
    DO;                                                                 63980000
                                                                        63990000
             /* SELECTING FLEXIBLE WARRANTY AND HARDBUNDLE MACHINES */  64000000
      IF (HW_CTR_PI_FUT.F_TYPE_OF_WARRANTY ¬= '' &                      64010000
          HW_CTR_PI_FUT.WARRANTY_SPLT_DATE ¬= '' &                      64020000
          HW_CTR_PI_FUT.TYPE_OF_WARRANTY   ¬=                           64030000
                       HW_CTR_PI_FUT.F_TYPE_OF_WARRANTY) THEN           64040000
      DO;                                                               64050000
        IF (RUN_DATE_FUT >= HW_CTR_PI_FUT.INSTALL_DATE &                64060000
            RUN_DATE_FUT <  HW_CTR_PI_FUT.WARRANTY_SPLT_DATE)           64070000
        THEN                                                            64080000
          SW_BRAND_PI_FUT = TRUE;                                       64090000
        ELSE                                                            64100000
         DO;                                                            64110000
          IF (RUN_DATE_FUT >= HW_CTR_PI_FUT.WARRANTY_SPLT_DATE &        64120000
              RUN_DATE_FUT <= HW_CTR_PI_FUT.WARRANTY_EXP_DATE)          64130000
          THEN                                                          64140000
            DO;                                                         64150000
              IF VERIFY(HW_CTR_PI_FUT.F_TYPE_OF_WARRANTY,               64160000
                        WRK_FWTOW) = '0'                                64170000
              THEN                                                      64180000
                SW_FW_PI_FUT = TRUE;                                    64190000
              ELSE                                                      64200000
                DO;                                                     64210000
                  IF VERIFY(HW_CTR_PI_FUT.F_TYPE_OF_WARRANTY,           64220000
                            WRK_HBTOM) = '0'                            64230000
                  THEN                                                  64240000
                    SW_HB_PI_FUT = TRUE;                                64250000
                END;                                                    64260000
            END;                                                        64270000
         END;                                                           64280000
      END;                                                              64290000
                                                                        64300000
      IF (HW_CTR_PI_FUT.WARRANTY_SPLT_DATE ¬= '' &                      64310000
          HW_CTR_PI_FUT.F_TYPE_OF_WARRANTY  = '' &                      64320000
          SW_BRAND_PI_FUT  = FALSE               &                      64330000
          SW_FW_PI_FUT     = FALSE               &                      64340000
          SW_HB_PI_FUT     = FALSE                 ) THEN               64350000
      DO;                                                               64360000
        IF (RUN_DATE_FUT >= HW_CTR_PI_FUT.INSTALL_DATE &                64370000
            RUN_DATE_FUT <  HW_CTR_PI_FUT.WARRANTY_SPLT_DATE)           64380000
        THEN                                                            64390000
          SW_BRAND_PI_FUT = TRUE;                                       64400000
        ELSE                                                            64410000
          DO;                                                           64420000
            IF (RUN_DATE_FUT >= HW_CTR_PI_FUT.WARRANTY_SPLT_DATE &      64430000
                RUN_DATE_FUT <= HW_CTR_PI_FUT.WARRANTY_EXP_DATE)        64440000
            THEN                                                        64450000
              SW_SPLTWAR_PI_FUT = TRUE;                                 64460000
          END;                                                          64470000
      END;                                                              64480000
                                                                        64490000
      IF HW_CTR_PI_FUT.WARRANTY_SPLT_DATE = '3999-12-31'                64500000
      THEN DO;                                                          64510000
        HW_CTR_PI_FUT.WARRANTY_SPLT_DATE = '';                          64520000
        HW_CTR_PI_FUT_I.INDNULL(8) = -1;                                64530000
        HW_CTR_PI_FUT.WARRANTY_EXP_DATE  = '';                          64540000
        HW_CTR_PI_FUT_I.INDNULL(9) = -1;                                64550000
      END;                                                              64560000
      IF HW_CTR_PI_FUT.INSTALL_DATE = '3999-12-31'                      64570000
      THEN DO;                                                          64580000
        HW_CTR_PI_FUT.INSTALL_DATE = '';                                64590000
        HW_CTR_PI_FUT_I.INDNULL(5) = -1;                                64600000
      END;                                                              64610000
      IF HW_CTR_PI_FUT.EFFECTIVE_DATE = '3999-12-31'                    64620000
      THEN DO;                                                          64630000
        HW_CTR_PI_FUT.EFFECTIVE_DATE = '';                              64640000
        HW_CTR_PI_FUT_I.INDNULL(14) = -1;                               64650000
        HW_CTR_PI_FUT.END_DATE   = '';                                  64660000
        HW_CTR_PI_FUT_I.INDNULL(15) = -1;                               64670000
      END;                                                              64680000
    END;                                                                64690000
                                                                        64700000
                                                  /* SOC CEDS00000624 */64710000
 /*IF WRK_BAU_REAL_SERIAL_NO_V125_IND = -1 THEN*/      /* SOC RB01320 */64720000
 /*DO;                                                                  64730000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       64740000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              64750000
 END;                                                                   64760000
 ELSE                                                                   64770000
 DO;                                                                    64780000
    WRK_ORIGIN  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,1,2);              64790000
    WRK_SEQ_NO  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,3);                64800000
 END;*/                                               /* EOC RB01320 */ 64810000
                                                                        64820000
 WRK_PRODUCT_TYPE_REAL    = WRK_PRODUCT_TYPE_FUT;                       64830000
 WRK_ORIGIN_REAL          = WRK_ORIGIN_FUT;                             64840000
 WRK_SEQUENCE_NUMBER_REAL = WRK_SEQUENCE_NUMBER_FUT;                    64850000
                                                                        64860000
 CALL R768_RETRIEVE_BAU_REAL_SER;                                       64870000
                                                                        64880000
 IF  SWITCH_BAU_ONLY| SWITCH_BAU_PI THEN                                64890000
 DO;                                                                    64900000
 IF BAU_REAL_SERNO = ' ' THEN                                           64910000
 DO;                                                                    64920000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       64930000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              64940000
 END;                                                                   64950000
 ELSE                                                                   64960000
 DO;                                                                    64970000
    WRK_ORIGIN  = SUBSTR(BAU_REAL_SERNO,1,2);                           64980000
    WRK_SEQ_NO  = SUBSTR(BAU_REAL_SERNO,3);                             64990000
 END;                                                                   65000000
 END;                                                                   65010000
                                                  /* EOC CEDS00000624 */65020000
                                                                        65030000
                                         /* CURSOR_INST_HW           */ 65040000
   EXEC SQL                                                             65050000
   SELECT C.PRODUCT_TYPE                                                65060000
         ,C.ORIGIN                                                      65070000
         ,C.SEQUENCE_NUMBER                                             65080000
         ,C.TYPE_OF_MAINT                                               65090000
         ,C.TYPE_OF_WARRANTY                                            65100000
         ,C.WARRANTY_EXP_DATE                                           65110000
         ,C.SOURCE_INDICATOR                                            65120000
         ,C.EFFECTIVE_DATE                                              65130000
         ,C.END_DATE                                                    65140000
         ,C.F_TYPE_OF_WARRANTY                                          65150000
         ,C.F_SPLT_DATE                                                 65160000
   INTO :INST_HW_BAU_FUT                                                65170000
        :INST_HW_BAU_FUT_I.INDNULL                                      65180000
   FROM RCBV0190_HW_CUST     A                                          65190000
       ,RCBV0170_OU_HW       B                                          65200000
       ,RCBV0220_SUPPL_CTR   C                                          65210000
                                                       /* SOC RB01320 */65220000
   WHERE A.PRODUCT_TYPE        = :WRK_PRODUCT_TYPE_FUT                  65230000
   /*AND A.ORIGIN              = :WRK_ORIGIN_FUT                        65240000
     AND A.SEQUENCE_NUMBER     = :WRK_SEQUENCE_NUMBER_FUT */            65250000
     AND A.ORIGIN              = :WRK_ORIGIN                            65260000
     AND A.SEQUENCE_NUMBER     = :WRK_SEQ_NO                            65270000
     AND A.COUNTRY_NUMBER      = :WRK_CTRYNO                            65280000
                                                       /* EOC RB01320 */65290000
     AND A.TYPE_OF_RELATION    = 'U'                                    65300000
     AND :RUN_DATE_FUT BETWEEN B.EFFECTIVE_DATE AND B.END_DATE          65310000
                                                                        65320000
     AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE                         65330000
     AND B.ORIGIN              = A.ORIGIN                               65340000
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                      65350000
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       65360000
     AND B.EFFECTIVE_DATE      <= A.END_DATE                            65370000
     AND B.END_DATE            >= A.EFFECTIVE_DATE                      65380000
     AND :RUN_DATE_FUT BETWEEN B.EFFECTIVE_DATE AND B.END_DATE          65390000
                                                                        65400000
     AND C.PRODUCT_TYPE        = A.PRODUCT_TYPE                         65410000
     AND C.ORIGIN              = A.ORIGIN                               65420000
     AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                      65430000
     AND C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       65440000
     AND C.EFFECTIVE_DATE      <= A.END_DATE                            65450000
     AND C.END_DATE            >= A.EFFECTIVE_DATE                      65460000
     AND C.EFFECTIVE_DATE      <= B.END_DATE                            65470000
     AND C.END_DATE            >= B.EFFECTIVE_DATE                      65480000
     AND :RUN_DATE_FUT BETWEEN C.EFFECTIVE_DATE AND C.END_DATE          65490000
   ORDER BY C.EFFECTIVE_DATE                                            65500000
   FETCH FIRST 1 ROW ONLY                                               65510000
   WITH UR;                                                             65520000
                                                                        65530000
   SELECT (SQLCA.SQLCODE);                                              65540000
     WHEN (0)                                                           65550000
      DO;                                                               65560000
       SWITCH_BAU_FUT = TRUE;                                           65570000
                                                                        65580000
       IF (((INST_HW_BAU_FUT.TYPE_OF_MAINT = '2') |                     65590000
            (VERIFY(INST_HW_BAU_FUT.TYPE_OF_MAINT,                      65600000
             WRK_TPMNT_VAL.TPMNT_INTERNAL ) = '0' )) &                  65610000
            (INST_HW_BAU_FUT.SOURCE_INDICATOR = 'C')) THEN              65620000
       DO;                                                              65630000
        SW_INTERNAL_MACHINE_CTR_FUT = TRUE;                             65640000
       END;                                                             65650000
                                                                        65660000
       IF ((VERIFY(INST_HW_BAU_FUT.TYPE_OF_MAINT,                       65670000
            WRK_TPMNT_VAL.TPMNT_INTERNAL ) = '0'     ) &                65680000
           (INST_HW_BAU_FUT.SOURCE_INDICATOR = '')  ) THEN              65690000
       DO;                                                              65700000
        SW_INTERNAL_FUT = TRUE;                                         65710000
       END;                                                             65720000
                                                                        65730000
       IF ((VERIFY(INST_HW_BAU_FUT.TYPE_OF_MAINT,                       65740000
            WRK_TPMNT_VAL.TPMNT_ST1 ) = '0'          ) &                65750000
           (INST_HW_BAU_FUT.SOURCE_INDICATOR = '')  ) THEN              65760000
       DO;                                                              65770000
        SW_LEASE_RENTAL_FUT = TRUE;                                     65780000
       END;                                                             65790000
                                                                        65800000
              /* SELECTING FLEXIBLE WARRANTY AND HARDBUNDLE MACHINES */ 65810000
       IF (INST_HW_BAU_FUT.F_TYPE_OF_WARRANTY ¬= '' &                   65820000
         INST_HW_BAU_FUT.F_SPLT_DATE        ¬= '' ) THEN                65830000
         DO;                                                            65840000
          IF (RUN_DATE_FUT >= INST_HW_BAU_FUT.EFFECTIVE_DATE &          65850000
              RUN_DATE_FUT <  INST_HW_BAU_FUT.F_SPLT_DATE)              65860000
          THEN                                                          65870000
           DO;                                                          65880000
            SW_BRAND_BAU_FUT = TRUE;                                    65890000
           END;                                                         65900000
          ELSE                                                          65910000
           DO;                                                          65920000
            IF (RUN_DATE_FUT >= INST_HW_BAU_FUT.F_SPLT_DATE &           65930000
                RUN_DATE_FUT <= INST_HW_BAU_FUT.WARRANTY_EXP_DATE &     65940000
                VERIFY(INST_HW_BAU_FUT.F_TYPE_OF_WARRANTY,              65950000
                       WRK_FWTOW) = '0')                                65960000
            THEN                                                        65970000
                SWITCH_FW_BAU_FUT = TRUE;                               65980000
            ELSE                                                        65990000
              DO;                                                       66000000
               IF (VERIFY(INST_HW_BAU_FUT.F_TYPE_OF_WARRANTY,           66010000
                          WRK_HBTOM) = '0')                             66020000
               THEN                                                     66030000
                 SWITCH_HB_BAU_FUT = TRUE;                              66040000
              END;                                                      66050000
           END;                                                         66060000
         END;                                                           66070000
      END;                                                              66080000
     WHEN (100);                                                        66090000
     OTHERWISE                                                          66100000
       DO;                                                              66110000
         CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#067');                66120000
       END;                                                             66130000
   END;                                                                 66140000
                                                                        66150000
   IF SWITCH_BAU_FUT | SWITCH_PI_FUT THEN                               66160000
     SWITCH_FUT_REC  = TRUE;                                            66170000
                                                                        66180000
 END R753_READ_FUT_REC;                                                 66190000
                                                       /* EOC RB01305 */66200000
1/*********************************************************************/66210000
 /*                                                    /* SOC RB01305 */66220000
 /* MODULE NAME      : R754_PROCESS_PI_HW_FUT                         */66230000
 /*                                                                   */66240000
 /* DESCRIPTION      : PROCESS PI HW MACHINE DETAILS                  */66250000
 /*                                                                   */66260000
 /*********************************************************************/66270000
 R754_PROCESS_PI_HW_FUT : PROC;                                         66280000
                                                                        66290000
   SW_WARR_PI_FUT           = FALSE;                                    66300000
   SW_MAINT_PI_FUT          = FALSE;                                    66310000
   SW_PROCESS_PERCALL_FUT   = FALSE;                                    66320000
                                                                        66330000
   FUTURE_PI.COUNTRY_NUMBER     = WRK_CTRYNO;                           66340000
   FUTURE_PI.PRODUCT_TYPE       = WRK_PRODUCT_TYPE_FUT;                 66350000
   FUTURE_PI.ORIGIN             = WRK_ORIGIN_FUT;                       66360000
   FUTURE_PI.SEQUENCE_NUMBER    = WRK_SEQUENCE_NUMBER_FUT;              66370000
                                                     /* SOC RB01320 */  66380000
   FUTURE_PI.SERIAL_LNG         = WRK_PI_REAL_SERIAL_NO_V125;           66390000
                                                     /* EOC RB01320 */  66400000
   FUTURE_PI.TYPE_OF_WARRANTY   = HW_CTR_PI_FUT.TYPE_OF_WARRANTY;       66410000
   FUTURE_PI.CONTRACT_NUMBER    = HW_CTR_PI_FUT.CONTRACT_NUMBER;        66420000
   FUTURE_PI.SERVICE_START_DATE = HW_CTR_PI_FUT.EFFECTIVE_DATE;         66430000
   FUTURE_PI.SERVICE_END_DATE   = HW_CTR_PI_FUT.END_DATE;               66440000
   FUTURE_PI.LIABILITY          = HW_CTR_PI_FUT.WARRANTY_LIABILITY;     66450000
   WRK_PI_CTR_START_DATE_FUT    = HW_CTR_PI_FUT.EFFECTIVE_DATE;         66460000
   WRK_PI_CTR_END_DATE_FUT      = HW_CTR_PI_FUT.END_DATE;               66470000
   WRK_PI_HW_START_DATE_FUT     = HW_CTR_PI_FUT.INSTALL_DATE;           66480000
   WRK_PI_HW_END_DATE_FUT       = HW_CTR_PI_FUT.WARRANTY_EXP_DATE;      66490000
                                                                        66500000
   IF  RUN_DATE_FUT <= HW_CTR_PI_FUT.WARRANTY_EXP_DATE  &               66510000
       (VERIFY(HW_CTR_PI_FUT.TYPE_OF_WARRANTY,                          66520000
               WRK_TPMNT_VAL.TPMNT_WAR) = '0' |                         66530000
        SW_BRAND_PI_FUT | SW_FW_PI_FUT | SW_HB_PI_FUT |                 66540000
        SW_SPLTWAR_PI_FUT )                                             66550000
   THEN                                                                 66560000
     DO;                                                                66570000
       SW_WARR_PI_FUT = TRUE;                                           66580000
       WRK_PRECEDENCE_PI_FUT = '5';                                     66590000
                                                                        66600000
       FUTURE_PI.SERVICE_START_DATE = HW_CTR_PI_FUT.INSTALL_DATE;       66610000
       FUTURE_PI.SERVICE_END_DATE   = HW_CTR_PI_FUT.WARRANTY_EXP_DATE;  66620000
                                                                        66630000
       IF SW_BRAND_PI_FUT                                               66640000
       THEN                                                             66650000
         DO;                                                            66660000
           FUTURE_PI.SERVICE_END_DATE   =                               66670000
               R014_DATE_CALC (HW_CTR_PI_FUT.WARRANTY_SPLT_DATE,-1);    66680000
           WRK_PI_HW_END_DATE_FUT =                                     66690000
               FUTURE_PI.SERVICE_END_DATE;                              66700000
         END;                                                           66710000
       ELSE                                                             66720000
         DO;                                                            66730000
           IF SW_FW_PI_FUT | SW_HB_PI_FUT | SW_SPLTWAR_PI_FUT           66740000
           THEN                                                         66750000
             DO;                                                        66760000
               FUTURE_PI.SERVICE_START_DATE =                           66770000
                                 HW_CTR_PI_FUT.WARRANTY_SPLT_DATE;      66780000
               WRK_PI_HW_START_DATE_FUT =                               66790000
                                 FUTURE_PI.SERVICE_START_DATE;          66800000
             END;                                                       66810000
         END;                                                           66820000
     END;                                                               66830000
                                                                        66840000
   IF (RUN_DATE_FUT >= HW_CTR_PI_FUT.EFFECTIVE_DATE  &                  66850000
       RUN_DATE_FUT <= HW_CTR_PI_FUT.END_DATE)                          66860000
   THEN                                                                 66870000
    DO;                                                                 66880000
     SW_MAINT_PI_FUT = TRUE;                                            66890000
     WRK_PRECEDENCE_PI_FUT = '7';                                       66900000
    END;                                                                66910000
                                                                        66920000
   SELECT(WRK_PI_ORIGIN_FUT);                                           66930000
     WHEN('BOTH')                                                       66940000
     DO;                                                                66950000
                                /* -- PI WARRANTY, PI CONTRACT -- */    66960000
       IF (SW_WARR_PI_FUT & SW_MAINT_PI_FUT)                            66970000
       THEN                                                             66980000
         DO;                                                            66990000
          IF HW_CTR_PI_FUT.EFFECTIVE_DATE >                             67000000
                   FUTURE_PI.SERVICE_START_DATE  THEN                   67010000
            FUTURE_PI.SERVICE_START_DATE =                              67020000
                          HW_CTR_PI_FUT.EFFECTIVE_DATE;                 67030000
                                                                        67040000
          IF HW_CTR_PI_FUT.END_DATE <                                   67050000
                   FUTURE_PI.SERVICE_END_DATE   THEN                    67060000
            FUTURE_PI.SERVICE_END_DATE =                                67070000
                          HW_CTR_PI_FUT.END_DATE;                       67080000
                                                                        67090000
          IF SW_FW_PI_FUT | SW_HB_PI_FUT | SW_SPLTWAR_PI_FUT            67100000
          THEN                                                          67110000
           DO;                                                          67120000
            IF SW_FW_PI_FUT | SW_HB_PI_FUT THEN                         67130000
             FUTURE_PI.TYPE_OF_WARRANTY =                               67140000
                              HW_CTR_PI_FUT.F_TYPE_OF_WARRANTY;         67150000
            ELSE                                                        67160000
             FUTURE_PI.TYPE_OF_WARRANTY =                               67170000
                                   HW_CTR_PI_FUT.TYPE_OF_WARRANTY;      67180000
           END;                                                         67190000
          ELSE                                                          67200000
           DO;                                                          67210000
            FUTURE_PI.TYPE_OF_WARRANTY =                                67220000
                                  HW_CTR_PI_FUT.TYPE_OF_WARRANTY;       67230000
           END;                                                         67240000
                                                                        67250000
          FUTURE_PI.MA_STATUS          =                                67260000
                      R011_TRANS_TPMNT(FUTURE_PI.TYPE_OF_WARRANTY);     67270000
         END;                                                           67280000
       ELSE                                                             67290000
         DO;                                                            67300000
           IF HW_CTR_PI_FUT.TYPE_OF_MAINT = 'G' THEN                    67310000
            DO;                                                         67320000
             FUTURE_PI.TYPE_OF_MAINT = 'G';                             67330000
             FUTURE_PI.LIABILITY     = 'LEN';                           67340000
            END;                                                        67350000
           ELSE                                                         67360000
            DO;                                                         67370000
             FUTURE_PI.TYPE_OF_MAINT = '2';                             67380000
             FUTURE_PI.LIABILITY     = 'IBM';                           67390000
            END;                                                        67400000
                                                                        67410000
           FUTURE_PI.MA_STATUS        =                                 67420000
                        R011_TRANS_TPMNT(FUTURE_PI.TYPE_OF_MAINT);      67430000
         END;                                                           67440000
                                                                        67450000
     END;                                                               67460000
     WHEN('T241')                                                       67470000
     DO;                                                                67480000
                                                                        67490000
     /*IF SWITCH_VENDOR_SERVICE THEN                   /* SOC RC01362 */67500000
     /*  DO;                                                            67510000
           CALL R755_PROD_REVENUE_DIV_FUT;                              67520000
           IF ( SUBSTR (HW_CTR_PI_FUT.ORIGIN, 1, 1) = 'L'               67530000
            & TB_RCBV400.PROD_REVENUE_DIV = '44')                       67540000
            & SUBSTR(HW_CTR_PI_FUT.AUTHORISATION_CODE,1,3) = 'LEN' THEN 67550000
              DO;                                                       67560000
                FUTURE_PI.TYPE_OF_MAINT  = 'G';                         67570000
                FUTURE_PI.LIABILITY = 'LEN';                            67580000
              END;                                                      67590000
           ELSE                                                         67600000
              DO;                                                       67610000
                FUTURE_PI.TYPE_OF_MAINT = '2';                          67620000
                FUTURE_PI.LIABILITY = 'IBM';                            67630000
              END;                                                      67640000
         END;                                                           67650000
       ELSE                                                             67660000
       DO;                                          *//* EOC RC01362 */ 67670000
         FUTURE_PI.TYPE_OF_MAINT = '2';                                 67680000
         FUTURE_PI.LIABILITY     = 'IBM';                               67690000
    /* END;                                             *//* RC01362 */ 67700000
                                                                        67710000
       FUTURE_PI.MA_STATUS        =                                     67720000
                          R011_TRANS_TPMNT(FUTURE_PI.TYPE_OF_MAINT);    67730000
                                                                        67740000
     END;                                                               67750000
                                                                        67760000
     WHEN('T051')                                                       67770000
     DO;                                                                67780000
       FUTURE_PI.LIABILITY = HW_CTR_PI_FUT.WARRANTY_LIABILITY;          67790000
                                                                        67800000
                                                                        67810000
      IF SW_FW_PI_FUT | SW_HB_PI_FUT THEN                               67820000
       FUTURE_PI.TYPE_OF_WARRANTY = HW_CTR_PI_FUT.F_TYPE_OF_WARRANTY;   67830000
                                                                        67840000
      FUTURE_PI.MA_STATUS        =                                      67850000
                       R011_TRANS_TPMNT(FUTURE_PI.TYPE_OF_WARRANTY);    67860000
                                                                        67870000
      IF SW_HB_PI_FUT                                                   67880000
      THEN                                                              67890000
        DO;                                                             67900000
          FUTURE_PI.CONTRACT_NUMBER   ='HARDBUNDLE';                    67910000
        END;                                                            67920000
     END;                                                               67930000
     OTHERWISE;                                                         67940000
   END;                                                                 67950000
                        /* PROCESS PER CALL RECORDS FOR IBM MACHINES    67960000
                                           WHEN RCB005.PI_TO_BMT = I */ 67970000
   IF (PARM_RCB005.PI_TO_BMT = 'I' &                                    67980000
      (HW_CTR_PI_FUT.WARRANTY_LIABILITY = '' |                          67990000
       HW_CTR_PI_FUT_I.INDNULL(11)      = -1 |                          68000000
       HW_CTR_PI_FUT.WARRANTY_LIABILITY = 'IBM') &                      68010000
       WRK_PI_ORIGIN_FUT = 'T051'  &                                    68020000
       HW_CTR_PI_FUT.WARRANTY_EXP_DATE < RUN_DATE_FUT &                 68030000
       SW_MAINT_PI_FUT = FALSE)                                         68040000
   THEN                                                                 68050000
    DO;                                                                 68060000
      SW_PROCESS_PERCALL_FUT = TRUE;                                    68070000
      CALL R764_PI_PERCALL_FUT;                                         68080000
    END;                                                                68090000
                                                                        68100000
 END R754_PROCESS_PI_HW_FUT;                           /* EOC RB01305 */68110000
1/*********************************************************************/68120000
 /*                                                       SOC RB01305 */68130000
 /* MODULE NAME      :  R764_PI_PERCALL_FUT                           */68140000
 /*                                                                   */68150000
 /* DESCRIPTION      :  PROCESS PER CALL RECORDS FOR FUTURE PI, WHEN  */68160000
 /*                     PI_TO_BMT = I IN RCB005 PARAMETER             */68170000
 /*                                                                   */68180000
 /*********************************************************************/68190000
 R764_PI_PERCALL_FUT: PROC;                                             68200000
                                                                        68210000
  CALL R765_FETCH_PI_FUT_CTR_FUT;                                       68220000
  IF SWITCH_RETAIN_PERCALL_FUT =  TRUE                                  68230000
  THEN                                                                  68240000
   DO;                                                                  68250000
     IF HW_CTR_PI_FUT.TYPE_OF_MAINT   = '2'                             68260000
     THEN                                                               68270000
        FUTURE_PI.TYPE_OF_MAINT   = '3';                                68280000
     ELSE                                                               68290000
        FUTURE_PI.TYPE_OF_MAINT   = HW_CTR_PI_FUT.TYPE_OF_MAINT;        68300000
                                                                        68310000
     IF (WRK_PRECEDENCE_PI_FUT = '' | WRK_PRECEDENCE_PI_FUT <= '1')     68320000
     THEN  DO;                                                          68330000
      WRK_PRECEDENCE_PI_FUT = '1';                                      68340000
     END;                                                               68350000
                                                                        68360000
     FUTURE_PI.MA_STATUS     =                                          68370000
                 R011_TRANS_TPMNT(FUTURE_PI.TYPE_OF_MAINT);             68380000
   END;                                                                 68390000
                                                                        68400000
 END R764_PI_PERCALL_FUT;                                               68410000
                                                       /* EOC RB01305 */68420000
1/*********************************************************************/68430000
 /*                                                       SOC RB01305 */68440000
 /* MODULE NAME      :  R765_FETCH_PI_FUT_CTR_FUT                     */68450000
 /*                                                                   */68460000
 /* DESCRIPTION      :  FETCH THE FUTURE CONTRACT FOR IBM BRAND       */68470000
 /*                     MACHINE                                       */68480000
 /*                                                                   */68490000
 /*********************************************************************/68500000
 R765_FETCH_PI_FUT_CTR_FUT: PROC;                                       68510000
                                                                        68520000
  SWITCH_RETAIN_PERCALL_FUT = FALSE;                                    68530000
                                                                        68540000
                                                  /* SOC CEDS00000624 */68550000
                                                       /* SOC RB01320 */68560000
 /*IF WRK_PI_REAL_SERIAL_NO_V125_IND = -1 THEN                          68570000
 DO;                                                                    68580000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       68590000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              68600000
 END;                                                                   68610000
 ELSE                                                                   68620000
 DO;                                                                    68630000
    WRK_ORIGIN  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,1,2);               68640000
    WRK_SEQ_NO  = SUBSTR(WRK_PI_REAL_SERIAL_NO_V125,3);                 68650000
 END;*/                                               /* EOC RB01320 */ 68660000
                                                                        68670000
  WRK_SOURCE = 'T241';                                                  68680000
                                                                        68690000
  WRK_PRODUCT_TYPE_REAL    = WRK_PRODUCT_TYPE_FUT;                      68700000
  WRK_ORIGIN_REAL          = WRK_ORIGIN_FUT;                            68710000
  WRK_SEQUENCE_NUMBER_REAL = WRK_SEQUENCE_NUMBER_FUT;                   68720000
                                                                        68730000
  CALL R767_RETRIEVE_PI_REAL_SER;                                       68740000
                                                                        68750000
 IF SWITCH_PI_ONLY| SWITCH_BAU_PI THEN                                  68760000
 DO;                                                                    68770000
 IF PI_REAL_SERNO ¬= '  '  THEN                                         68780000
 DO;                                                                    68790000
    WRK_ORIGIN  = SUBSTR(PI_REAL_SERNO,1,2);                            68800000
    WRK_SEQ_NO  = SUBSTR(PI_REAL_SERNO,3);                              68810000
 END;                                                                   68820000
 ELSE                                                                   68830000
 DO;                                                                    68840000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       68850000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              68860000
 END;                                                                   68870000
 END;                                                                   68880000
                                                  /* EOC CEDS00000624 */68890000
                                                                        68900000
  EXEC SQL                                                              68910000
   SELECT MIN(EFFECTIVE_DATE)                                           68920000
   INTO  :WRK_MIN_EFF_A     :WRK_INDNULL                                68930000
   FROM RCBV0241_PI_CTR                                                 68940000
   WHERE PRODUCT_TYPE    = :WRK_PRODUCT_TYPE_FUT                        68950000
                                                       /* SOC RB01320 */68960000
   /*AND ORIGIN          = :WRK_ORIGIN_FUT                              68970000
     AND SEQUENCE_NUMBER = :WRK_SEQUENCE_NUMBER_FUT */                  68980000
     AND ORIGIN          = :WRK_ORIGIN                                  68990000
     AND SEQUENCE_NUMBER = :WRK_SEQ_NO                                  69000000
                                                       /* EOC RB01320 */69010000
     AND COUNTRY_NUMBER  = :WRK_CTRYNO                                  69020000
     AND EFFECTIVE_DATE  > :RUN_DATE_FUT                                69030000
  ;                                                                     69040000
                                                                        69050000
  SELECT(SQLCODE);                                                      69060000
   WHEN (0)                                                             69070000
    DO;                                                                 69080000
     IF WRK_INDNULL = -1                                                69090000
     THEN                                                               69100000
      DO;                                                               69110000
        FUTURE_PI.SERVICE_START_DATE  =                                 69120000
                                  R014_DATE_CALC(TEMP_CURR_END_DATE,1); 69130000
        FUTURE_PI.SERVICE_END_DATE    =                                 69140000
                R766_PERCALL_CALC_FUT(HW_CTR_PI_FUT.WARRANTY_EXP_DATE); 69150000
      END;                                                              69160000
     ELSE                                                               69170000
      DO;                                                               69180000
        FUTURE_PI.SERVICE_START_DATE  =                                 69190000
                                  R014_DATE_CALC(TEMP_CURR_END_DATE,1); 69200000
        FUTURE_PI.SERVICE_END_DATE    =                                 69210000
                                       R014_DATE_CALC(WRK_MIN_EFF_A,-1);69220000
        SWITCH_RETAIN_PERCALL_FUT = TRUE;                               69230000
      END;                                                              69240000
    END;                                                                69250000
   WHEN (100);                                                          69260000
   OTHERWISE                                                            69270000
    DO;                                                                 69280000
      CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#075');                   69290000
    END;                                                                69300000
  END;                                                                  69310000
                                                                        69320000
 END R765_FETCH_PI_FUT_CTR_FUT;                                         69330000
                                                       /* EOC RB01305 */69340000
1/*********************************************************************/69350000
 /*                                                       SOC RB01305 */69360000
 /* MODULE NAME      :  R766_PERCALL_CALC_FUT                         */69370000
 /*                                                                   */69380000
 /* DESCRIPTION      :  CALCULATE THE HOUSEKEEP RETAIN PERIOD DATE    */69390000
 /*                                                                   */69400000
 /*********************************************************************/69410000
 R766_PERCALL_CALC_FUT: PROC (WRK_WARR_EXP_DATE_FUT)                    69420000
                    RETURNS (CHAR(10));                                 69430000
  DCL WRK_WARR_EXP_DATE_FUT   CHAR(10);                                 69440000
                                                                        69450000
  SWITCH_RETAIN_PERCALL_FUT = FALSE;                                    69460000
                                                                        69470000
                                                       /* SOC RC01389 */69471000
 /*WRK_PERCALL_ENDDATE_FUT = R014_DATE_CALC(WRK_WARR_EXP_DATE_FUT,1095);69480000
                                                                      */69481000
  WRK_PERCALL_ENDDATE_FUT = R014_DATE_CALC(WRK_WARR_EXP_DATE_FUT,       69482000
                                           WRK_RETENTION);              69483000
                                                       /* EOC RC01389 */69484000
                                                                        69490000
  WRK_RETAIN_DATE_FUT = R014_DATE_CALC(WRK_PERCALL_ENDDATE_FUT,         69500000
                                   -PARM_RCB005.PI_TO_BMT_INV);         69510000
                                                                        69520000
  IF WRK_RETAIN_DATE_FUT  >=  RUN_DATE_FUT                              69530000
  THEN  SWITCH_RETAIN_PERCALL_FUT = TRUE;                               69540000
  ELSE                                                                  69550000
  DO;                                                                   69560000
   SWITCH_RETAIN_PERCALL_FUT = FALSE;                                   69570000
   SWITCH_PI_FUT = FALSE;                                               69580000
  END;                                                                  69590000
                                                                        69600000
  RETURN(WRK_PERCALL_ENDDATE_FUT);                                      69610000
                                                                        69620000
 END R766_PERCALL_CALC_FUT;                            /* EOC RB01305 */69630000
 /*********************************************************************/69640000
 /*                                                     CEDS00000624  */69650000
 /* MODULE NAME      : R767_RETRIEVE_PI_REAL_SER                      */69660000
 /*                                                                   */69670000
 /* DESCRIPTION      : RETRIEVE LONG SERIAL FOR PI MACHINE            */69680000
 /*                                                                   */69690000
 /*********************************************************************/69700000
 R767_RETRIEVE_PI_REAL_SER: PROC;                                       69710000
                                                                        69720000
  PI_REAL_SERNO    = '  ';                                              69730000
  PI_ORIGIN        = '  ';                                              69740000
  PI_DUMMY_ORIGIN  = '  ';                                              69750000
  PI_DUMMY_SEQ_NO  = '  ';                                              69760000
  PI_SEQ_NO        = '  ';                                              69770000
                                                                        69780000
   SELECT(WRK_SOURCE);                                                  69790000
    WHEN('T241')                                                        69800000
     DO;                                                                69810000
                                                                        69820000
      EXEC SQL                                                          69830000
       SELECT  A.ORIGIN,                                                69840000
               A.SEQUENCE_NUMBER,                                       69850000
               B.DUMMY_ORIGIN,                                          69860000
               B.DUMMY_SEQUENCE_NUM,                                    69870000
               B.REAL_SERIAL_NUMBER                                     69880000
       INTO    :PI_ORIGIN,                                              69890000
               :PI_SEQ_NO,                                              69900000
               :PI_DUMMY_ORIGIN,                                        69910000
               :PI_DUMMY_SEQ_NO,                                        69920000
               :PI_REAL_SERNO                                           69930000
       FROM RCBV0241_PI_CTR    A,                                       69940000
            RCBV0125_DMMY_REAL B                                        69950000
       WHERE A.PRODUCT_TYPE       = :WRK_PRODUCT_TYPE_REAL              69960000
       AND   A.COUNTRY_NUMBER     = :WRK_CTRYNO                         69970000
       AND   A.COUNTRY_NUMBER     = B.COUNTRY_NUMBER                    69980000
       AND   B.DUMMY_ORIGIN       = :WRK_ORIGIN_REAL                    69990000
       AND   B.DUMMY_SEQUENCE_NUM = :WRK_SEQUENCE_NUMBER_REAL           70000000
       AND   A.PRODUCT_TYPE       = B.PRODUCT_TYPE                      70010000
       AND  ((A.ORIGIN||A.SEQUENCE_NUMBER = B.REAL_SERIAL_NUMBER)       70020000
       OR   (A.ORIGIN             = B.DUMMY_ORIGIN                      70030000
       AND   A.SEQUENCE_NUMBER    = B.DUMMY_SEQUENCE_NUM));             70040000
                                                                        70050000
       SELECT(SQLCODE);                                                 70060000
        WHEN(0);                                                        70070000
        WHEN(100);                                                      70080000
        OTHERWISE                                                       70090000
         DO;                                                            70100000
          CALL RCBDTBM_ERROR (ADDR (SQLCA),                             70110000
                            'DB2',                                      70120000
                            '#076');                                    70130000
         END;                                                           70140000
       END;                                                             70150000
     END;                                                               70160000
    WHEN('T051')                                                        70170000
     DO;                                                                70180000
                                                                        70190000
      EXEC SQL                                                          70200000
       SELECT  A.ORIGIN,                                                70210000
               A.SEQUENCE_NUMBER,                                       70220000
               B.DUMMY_ORIGIN,                                          70230000
               B.DUMMY_SEQUENCE_NUM,                                    70240000
               B.REAL_SERIAL_NUMBER                                     70250000
       INTO    :PI_ORIGIN,                                              70260000
               :PI_SEQ_NO,                                              70270000
               :PI_DUMMY_ORIGIN,                                        70280000
               :PI_DUMMY_SEQ_NO,                                        70290000
               :PI_REAL_SERNO                                           70300000
       FROM RCBV0051_PI_HW_PR  A,                                       70310000
            RCBV0125_DMMY_REAL B                                        70320000
       WHERE A.PRODUCT_TYPE       = :WRK_PRODUCT_TYPE_REAL              70330000
       AND   A.COUNTRY_NUMBER     = :WRK_CTRYNO                         70340000
       AND   A.COUNTRY_NUMBER     = B.COUNTRY_NUMBER                    70350000
       AND   B.DUMMY_ORIGIN       = :WRK_ORIGIN_REAL                    70360000
       AND   B.DUMMY_SEQUENCE_NUM = :WRK_SEQUENCE_NUMBER_REAL           70370000
       AND   A.PRODUCT_TYPE       = B.PRODUCT_TYPE                      70380000
       AND  ((A.ORIGIN||A.SEQUENCE_NUMBER = B.REAL_SERIAL_NUMBER)       70390000
       OR   (A.ORIGIN             = B.DUMMY_ORIGIN                      70400000
       AND   A.SEQUENCE_NUMBER    = B.DUMMY_SEQUENCE_NUM));             70410000
                                                                        70420000
       SELECT(SQLCODE);                                                 70430000
        WHEN(0);                                                        70440000
        WHEN(100);                                                      70450000
        OTHERWISE                                                       70460000
         DO;                                                            70470000
           CALL RCBDTBM_ERROR (ADDR (SQLCA),                            70480000
                            'DB2',                                      70490000
                            '#077');                                    70500000
         END;                                                           70510000
       END;                                                             70520000
    END;                                                                70530000
    OTHERWISE                                                           70540000
     DO;                                                                70550000
      CALL RCBDTBM_ERROR (ADDR (SQLCA),                                 70560000
                        'DB2',                                          70570000
                        '#078');                                        70580000
     END;                                                               70590000
   END;                                                                 70600000
                                                                        70610000
 END R767_RETRIEVE_PI_REAL_SER;                                         70620000
1/*********************************************************************/70630000
 /*                                                      CEDS00000624 */70640000
 /* MODULE NAME      : R768_RETRIEVE_BAU_REAL_SER                     */70650000
 /*                                                                   */70660000
 /* DESCRIPTION      : RETRIEVE LONG SERIAL FOR BAU MACHINE           */70670000
 /*                                                                   */70680000
 /*********************************************************************/70690000
 R768_RETRIEVE_BAU_REAL_SER: PROC;                                      70700000
                                                                        70710000
                                                                        70720000
   BAU_DUMMY_ORIGIN = '  ';                                             70730000
   BAU_DUMMY_SEQ_NO = '  ';                                             70740000
   BAU_REAL_SERNO   = '  ';                                             70750000
                                                                        70760000
   EXEC SQL                                                             70770000
    SELECT  DUMMY_ORIGIN,                                               70780000
            DUMMY_SEQUENCE_NUM,                                         70790000
            REAL_SERIAL_NUMBER                                          70800000
    INTO   :BAU_DUMMY_ORIGIN,                                           70810000
           :BAU_DUMMY_SEQ_NO,                                           70820000
           :BAU_REAL_SERNO                                              70830000
    FROM RCBV0125_DMMY_REAL                                             70840000
    WHERE PRODUCT_TYPE        = :WRK_PRODUCT_TYPE_REAL                  70850000
    AND   COUNTRY_NUMBER      = :WRK_CTRYNO                             70860000
    AND  ((REAL_SERIAL_NUMBER =                                         70870000
         :WRK_ORIGIN_REAL||:WRK_SEQUENCE_NUMBER_REAL)                   70880000
    OR   ( DUMMY_ORIGIN       =  :WRK_ORIGIN_REAL                       70890000
    AND    DUMMY_SEQUENCE_NUM =  :WRK_SEQUENCE_NUMBER_REAL));           70900000
                                                                        70910000
    SELECT(SQLCODE);                                                    70920000
     WHEN(0);                                                           70930000
     WHEN(100);                                                         70940000
     OTHERWISE                                                          70950000
       DO;                                                              70960000
         CALL RCBDTBM_ERROR (ADDR (SQLCA),                              70970000
                            'DB2',                                      70980000
                            '#079');                                    70990000
       END;                                                             71000000
    END;                                                                71010000
                                                                        71020000
 END R768_RETRIEVE_BAU_REAL_SER;                                        71030000
                                                  /* SOC CEDS00000814 */71030167
 /*********************************************************************/71030249
 /*                                                                   */71031067
 /* MODULE NAME      :  R769_UPDATE_USER_PI_FUT_REC                   */71032049
 /*                                                                   */71033049
 /* DESCRIPTION      :  UPDATE OUTPUT PI RECORD                       */71034049
 /*                                                                   */71035049
 /*********************************************************************/71036049
 R769_UPDATE_USER_PI_FUT_REC:PROC;                                      71037049
                                                                        71038049
 USER_FILE_PI.TYPE_MAINT_FUT = FUTURE_PI.TYPE_OF_MAINT;                 71039061
                                                                        71039249
 USER_FILE_PI.MA_STATUS_FUT = FUTURE_PI.MA_STATUS;                      71039361
                                                                        71039461
 USER_FILE_PI.END_DATE_FUT  = FUTURE_PI.SERVICE_END_DATE;               71039661
                                                                        71039761
 USER_FILE_PI.CONTRACT_NUMBER_FUT = FUTURE_PI.CONTRACT_NUMBER;          71039961
                                                                        71040149
 USER_FILE_PI.LIABILITY_FUT = FUTURE_PI.LIABILITY;                      71040261
                                                                        71040361
 SWITCH_PI_FUT1 = FALSE;                                                71040558
                                                                        71040649
 END R769_UPDATE_USER_PI_FUT_REC;                                       71041449
 /*********************************************************************/71041656
 /*                                                                   */71041767
 /* MODULE NAME      :  R770_UPDATE_USER_BAU_FUT_REC                  */71041849
 /*                                                                   */71041949
 /* DESCRIPTION      :  UPDATE OUTPUT BAU RECORD                      */71042049
 /*                                                                   */71042149
 /*********************************************************************/71042249
 R770_UPDATE_USER_BAU_FUT_REC:PROC;                                     71042349
                                                                        71042449
 USER_FILE_BAU.TYPE_MAINT_FUT = FUTURE_BAU.TYPE_OF_MAINT;               71042761
                                                                        71042949
 USER_FILE_BAU.MA_STATUS_FUT = FUTURE_BAU.MA_STATUS;                    71043061
                                                                        71043249
 USER_FILE_BAU.END_DATE_FUT  = FUTURE_BAU.SERVICE_END_DATE;             71043361
                                                                        71043461
 USER_FILE_BAU.CONTRACT_NUMBER_FUT = FUTURE_BAU.CONTRACT_NUMBER;        71043661
                                                                        71043849
 USER_FILE_BAU.LIABILITY_FUT = FUTURE_BAU.LIABILITY;                    71043961
                                                                        71044149
 SWITCH_BAU_FUT1 = FALSE;                                               71044258
                                                                        71044349
 END R770_UPDATE_USER_BAU_FUT_REC;                                      71045149
                                                  /* EOC CEDS00000814 */71045267
1/*********************************************************************/71046000
 /*                                                    /* SOC RB01305 */71050000
 /* MODULE NAME      :  R755_PROD_REVENUE_DIV_FUT                     */71060000
 /*                                                                   */71070000
 /* DESCRIPTION      :  RETRIEVE PROD REVENUE DIVISION FROM T400 TABLE*/71080000
 /*                                                                   */71090000
 /*********************************************************************/71100000
                                                       /* SOC RC01362 */71100100
 /*R755_PROD_REVENUE_DIV_FUT: PROC;                                     71110000
                                                                        71120000
 TB_RCBV400           = '';                                             71130000
 WRK_PRODUCT_TYPE     = HW_CTR_PI_FUT.PRODUCT_TYPE;                     71140000
                                                                        71150000
 EXEC SQL                                                               71160000
   SELECT PROD_REVENUE_DIV                                              71170000
    INTO :TB_RCBV400.PROD_REVENUE_DIV                                   71180000
         :WRK_INDNULL                                                   71190000
    FROM  RCBV0400_PO_MOD1 T400                                         71200000
   WHERE  T400.COUNTRY_NUMBER   = :WRK_CTRYNO                           71210000
    AND   T400.PRODUCT_TYPE     = :WRK_PRODUCT_TYPE_FUT                 71220000
    AND   T400.MODEL_NUMBER     = ''                                    71230000
    AND   :RUN_DATE_FUT BETWEEN                                         71240000
          T400.EFFECTIVE_DATE AND T400.END_DATE;                        71250000
 SELECT(SQLCODE);                                                       71260000
   WHEN(0);                                                             71270000
   WHEN(100);                                                           71280000
   OTHERWISE                                                            71290000
     DO;                                                                71300000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),                                71310000
                           'DB2',                                       71320000
                           '#068');                                     71330000
     END;                                                               71340000
 END;                                                                   71350000
 END R755_PROD_REVENUE_DIV_FUT;                        /* EOC RB01305 */71360000
                                                       /* EOC RC01362 */71361000
1/*********************************************************************/71370000
 /*                                                    /* SOC RB01305 */71380000
 /* MODULE NAME      : R756_PROCESS_REGULAR_HW_FUT                    */71390000
 /*                                                                   */71400000
 /* DESCRIPTION      : PROCESS BAU HW MACHINES                        */71410000
 /*                                                                   */71420000
 /*********************************************************************/71430000
 R756_PROCESS_REGULAR_HW_FUT: PROC;                                     71440000
                                                                        71450000
   SW_WARRANTY_FUT = FALSE;                                             71460000
   SW_MAINT_02_FUT = FALSE;                                             71470000
                                     /* PROCESS INSTALLED HW PERIOD  */ 71480000
   FUTURE_BAU.COUNTRY_NUMBER     = WRK_CTRYNO;                          71490000
   FUTURE_BAU.PRODUCT_TYPE       = WRK_PRODUCT_TYPE_FUT;                71500000
   FUTURE_BAU.ORIGIN             = WRK_ORIGIN_FUT;                      71510000
   FUTURE_BAU.SEQUENCE_NUMBER    = WRK_SEQUENCE_NUMBER_FUT;             71520000
                                                  /* SOC CEDS00000624 */71530000
                                                     /* SOC RB01320 */  71540000
  /* FUTURE_BAU.SERIAL_LNG         = WRK_BAU_REAL_SERIAL_NO_V125;*/     71550000
                                                     /* EOC RB01320 */  71560000
     FUTURE_BAU.SERIAL_LNG         = BAU_REAL_SERNO;                    71570000
                                                  /* EOC CEDS00000624 */71580000
   FUTURE_BAU.SERVICE_START_DATE = INST_HW_BAU_FUT.EFFECTIVE_DATE;      71590000
   FUTURE_BAU.SERVICE_END_DATE   = INST_HW_BAU_FUT.END_DATE;            71600000
   FUTURE_BAU.LIABILITY          = 'IBM';                               71610000
                                                                        71620000
   IF (SW_INTERNAL_FUT | SW_LEASE_RENTAL_FUT) THEN                      71630000
    DO;                                                                 71640000
     WRK_PRECEDENCE_BAU_FUT = '4';                                      71650000
    END;                                                                71660000
                                                                        71670000
   IF SWITCH_HB_BAU_FUT THEN                                            71680000
     FUTURE_BAU.CONTRACT_NUMBER = 'HARDBUNDLE';                         71690000
                                    /* IF SERVICE CONTRACT         */   71700000
                                                                        71710000
   IF ((INST_HW_BAU_FUT.TYPE_OF_MAINT =                                 71720000
                     WRK_TPMNT_VAL.TPMNT_ST2_DEF)|                      71730000
       (SW_INTERNAL_MACHINE_CTR_FUT = TRUE))                            71740000
                                                                        71750000
   THEN DO;                         /* PROCESS SERV_CTR PERIODS    */   71760000
     SW_MAINT_02_FUT = TRUE;                                            71770000
     WRK_PRECEDENCE_BAU_FUT = '8';                                      71780000
   END;                                                                 71790000
   ELSE DO;                            /* PROCESS WARRANTY PERIODS */   71800000
    IF (VERIFY (INST_HW_BAU_FUT.TYPE_OF_WARRANTY,                       71810000
                WRK_TPMNT_VAL.TPMNT_WAR) = 0  |                         71820000
        SW_BRAND_BAU_FUT | SWITCH_FW_BAU_FUT | SWITCH_HB_BAU_FUT)       71830000
     THEN DO;                                                           71840000
       SW_WARRANTY_FUT = TRUE;                                          71850000
       WRK_PRECEDENCE_BAU_FUT = '6';                                    71860000
     END;                                                               71870000
   END;                                                                 71880000
                                                                        71890000
   IF SW_MAINT_02_FUT   = TRUE |                                        71900000
      SW_INTERNAL_FUT   = TRUE |                                        71910000
      SW_LEASE_RENTAL_FUT = TRUE |                                      71920000
      SW_WARRANTY_FUT   = TRUE                                          71930000
   THEN DO;                                                             71940000
    CALL R757_SERV_CTR_PERIOD_FUT;                                      71950000
                                                                        71960000
    IF SWITCH_SERV_CTR_FUT = TRUE                                       71970000
    THEN DO;                                                            71980000
     CALL R759_GET_TYPE_OF_CONTRACT_FUT;                                71990000
     IF ((WRK_TYPE_OF_CONTRACT_INDNULL ¬= -1)&                          72000000
         (WRK_TYPE_OF_CONTRACT ¬= ''))                                  72010000
     THEN DO;                                                           72020000
          IF SW_INTERNAL_MACHINE_CTR_FUT                                72030000
            THEN DO;                                                    72040000
              CALL R758_RETRIEVE_TOM_INT_CONTRACT_FUT;                  72050000
            END;                                                        72060000
      END;                                                              72070000
                                                                        72080000
     CALL R760_FILL_SERV_CTR_PERIOD_FUT;                                72090000
    END;                                                                72100000
    ELSE DO;                                                            72110000
     CALL R761_FILL_SUPPL_CTR_PERIOD_FUT(INST_HW_BAU_FUT.EFFECTIVE_DATE,72120000
                                         INST_HW_BAU_FUT.END_DATE);     72130000
    END;                                                                72140000
   END;                                                                 72150000
   ELSE DO;                                                             72160000
     CALL R761_FILL_SUPPL_CTR_PERIOD_FUT(INST_HW_BAU_FUT.EFFECTIVE_DATE,72170000
                                         INST_HW_BAU_FUT.END_DATE);     72180000
     WRK_PRECEDENCE_BAU_FUT = '2';                                      72190000
   END;                                                                 72200000
                                                                        72210000
 END R756_PROCESS_REGULAR_HW_FUT;                      /* EOC RB01305 */72220000
1/*********************************************************************/72230000
 /*                                                    /* SOC RB01305 */72240000
 /* MODULE NAME      :  R757_SERV_CTR_PERIOD_FUT                      */72250000
 /*                                                                   */72260000
 /* DESCRIPTION      :  RETRIEVE SERVICE CTRACT INFO FROM TABLE T240  */72270000
 /*                                                                   */72280000
 /*********************************************************************/72290000
 R757_SERV_CTR_PERIOD_FUT: PROC;                                        72300000
                                                                        72310000
   TB_240_FUT   = '';                                                   72320000
   TB_240_FUT_I = '';                                                   72330000
   TB_RCBV030   = '';                                                   72340000
   WRK_SERVICE_TYPE_IND = 0;                                            72350000
                                                  /* SOC CEDS00000624 */72360000
                                                       /* SOC RB01320 */72370000
 /*IF WRK_BAU_REAL_SERIAL_NO_V125_IND = -1 THEN                         72380000
 DO;                                                                    72390000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       72400000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              72410000
 END;                                                                   72420000
 ELSE                                                                   72430000
 DO;                                                                    72440000
    WRK_ORIGIN  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,1,2);              72450000
    WRK_SEQ_NO  = SUBSTR(WRK_BAU_REAL_SERIAL_NO_V125,3);                72460000
 END; */                                               /* EOC RB01320 */72470000
                                                                        72480000
   WRK_PRODUCT_TYPE_REAL    = WRK_PRODUCT_TYPE_FUT;                     72490000
   WRK_ORIGIN_REAL          = WRK_ORIGIN_FUT;                           72500000
   WRK_SEQUENCE_NUMBER_REAL = WRK_SEQUENCE_NUMBER_FUT;                  72510000
                                                                        72520000
   CALL R768_RETRIEVE_BAU_REAL_SER;                                     72530000
                                                                        72540000
 IF SWITCH_BAU_ONLY | SWITCH_BAU_PI THEN                                72550000
 DO;                                                                    72560000
 IF BAU_REAL_SERNO = ' ' THEN                                           72570000
 DO;                                                                    72580000
    WRK_ORIGIN  = WRK_ORIGIN_FUT;                                       72590000
    WRK_SEQ_NO  = WRK_SEQUENCE_NUMBER_FUT;                              72600000
 END;                                                                   72610000
 ELSE                                                                   72620000
 DO;                                                                    72630000
    WRK_ORIGIN  = SUBSTR(BAU_REAL_SERNO,1,2);                           72640000
    WRK_SEQ_NO  = SUBSTR(BAU_REAL_SERNO,3);                             72650000
 END;                                                                   72660000
 END;                                                                   72670000
                                                  /* EOC CEDS00000624 */72680000
   EXEC SQL                                                             72690000
   SELECT CONTRACT_NUMBER                                               72700000
         ,SERVICE_START_DATE                                            72710000
         ,SERVICE_STOP_DATE                                             72720000
         ,EFFECTIVE_DATE                                                72730000
         ,END_DATE                                                      72740000
    INTO :TB_240_FUT                                                    72750000
         :TB_240_FUT_I.INDNULL                                          72760000
   FROM RCBV0240_SERV_CTR                                               72770000
   WHERE PRODUCT_TYPE        = :WRK_PRODUCT_TYPE_FUT                    72780000
                                                       /* SOC RB01320 */72790000
   /*AND ORIGIN              = :WRK_ORIGIN_FUT                          72800000
     AND SEQUENCE_NUMBER     = :WRK_SEQUENCE_NUMBER_FUT */              72810000
     AND ORIGIN              = :WRK_ORIGIN                              72820000
     AND SEQUENCE_NUMBER     = :WRK_SEQ_NO                              72830000
                                                       /* EOC RB01320 */72840000
     AND COUNTRY_NUMBER      = :WRK_CTRYNO                              72850000
     AND :RUN_DATE_FUT BETWEEN EFFECTIVE_DATE AND END_DATE              72860000
   WITH UR;                                                             72870000
                                                                        72880000
   SELECT (SQLCODE);                                                    72890000
     WHEN (0) DO;                                                       72900000
       SWITCH_SERV_CTR_FUT = TRUE;                                      72910000
     END;                                                               72920000
     WHEN (100) DO;                                                     72930000
       SWITCH_SERV_CTR_FUT = FALSE;                                     72940000
       IF SW_MAINT_02_FUT      = TRUE                                   72950000
       THEN DO;                       /* IF NO SERV CTR FOUND: ABEND */ 72960000
         PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                 72970000
         PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0186';               72980000
         PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                  72990000
         CALL RCB0M1M (PTR_INT_AREA);                                   73000000
         CALL RCBDTBM_ERROR (NULL, 'OTHER', '#069');                    73010000
       END;                                                             73020000
     END;                                                               73030000
     OTHERWISE DO;                                                      73040000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#070');                  73050000
     END;                                                               73060000
   END;                                                                 73070000
                                                                        73080000
 END R757_SERV_CTR_PERIOD_FUT;                         /* EOC RB01305 */73090000
 /*********************************************************************/73100000
 /*                                                    /* SOC RB01305 */73110000
 /* MODULE NAME      :  R758_RETRIEVE_TOM_INT_CONTRACT_FUT            */73120000
 /*                                                                   */73130000
 /* DESCRIPTION      :  RETRIEVE RCB070 PARAMETER                     */73140000
 /*                                                                   */73150000
 /*********************************************************************/73160000
 R758_RETRIEVE_TOM_INT_CONTRACT_FUT: PROC;                              73170000
                                                                        73180000
  TB_RCBV500           = '';           /* RETRIEVE PARAMETER RCB070   */73190000
  TB_RCBV500_I         = '';                                            73200000
  TB_RCBP70S.NUMBER    = 'RCB070';                                      73210000
  TB_RCBP70S.CTRYNO    = WRK_CTRYNO;                                    73220000
                                                                        73230000
  SW_TOM_INTERNAL_MACHINE_FUT = FALSE;                                  73240000
                                                                        73250000
  TB_RCBP70S.TYPE_OF_CONTRACT = WRK_TYPE_OF_CONTRACT;                   73260000
                                                                        73270000
   CALL RCBI50M ('U',                                                   73280000
                  ADDR(TB_RCBV500),                                     73290000
                  ADDR(TB_RCBV500_I),                                   73300000
                  PTR_RETURN_AREA_BB,                                   73310000
                  PTR_INT_AREA);                                        73320000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  73330000
     WHEN(0)                                                            73340000
       DO;                                                              73350000
          SW_TOM_INTERNAL_MACHINE_FUT = TRUE;                           73360000
          INST_HW_BAU_FUT.TYPE_OF_MAINT =                               73370000
                         PARM_RCBP70S.TOM_INTERNAL_CONTRACT;            73380000
       END;                                                             73390000
     WHEN(4);                                    /* NO RECORD FOUND */  73400000
     WHEN(100);                                                         73410000
     OTHERWISE                                                          73420000
      DO;                                                               73430000
        CALL RCBDTBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),             73440000
                           'DB2',                                       73450000
                           '#071');                                     73460000
      END;                                                              73470000
 END;                                                                   73480000
 END R758_RETRIEVE_TOM_INT_CONTRACT_FUT;               /* EOC RB01305 */73490000
1/*********************************************************************/73500000
 /*                                                    /* SOC RB01305 */73510000
 /* MODULE NAME      :  R759_GET_TYPE_OF_CONTRACT_FUT                 */73520000
 /*                                                                   */73530000
 /* DESCRIPTION      :  GET TYPE OF CONTRACT FROM TABLE T0030         */73540000
 /*                                                                   */73550000
 /*********************************************************************/73560000
 R759_GET_TYPE_OF_CONTRACT_FUT: PROC;                                   73570000
    WRK_TYPE_OF_CONTRACT_INDNULL = 0;                                   73580000
                                                                        73590000
    EXEC SQL                                                            73600000
       SELECT  TYPE_OF_CONTRACT                                         73610000
         INTO :WRK_TYPE_OF_CONTRACT :WRK_TYPE_OF_CONTRACT_INDNULL       73620000
         FROM  RCBV0030_CONTRACT                                        73630000
        WHERE  COUNTRY_NUMBER  = :WRK_CTRYNO                            73640000
          AND  CONTRACT_NUMBER = :TB_240_FUT.CONTRACT_NUMBER ;          73650000
                                                                        73660000
       SELECT(SQLCODE);                                                 73670000
         WHEN (0);                                                      73680000
         WHEN (100);                                                    73690000
         OTHERWISE                                                      73700000
          DO;                                                           73710000
            CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#072');             73720000
          END;                                                          73730000
       END;                                                             73740000
  END R759_GET_TYPE_OF_CONTRACT_FUT;                   /* EOC RB01305 */73750000
1/*********************************************************************/73760000
 /*                                                    /* SOC RB01305 */73770000
 /* MODULE NAME      :  R760_FILL_SERV_CTR_PERIOD_FUT                 */73780000
 /*                                                                   */73790000
 /* DESCRIPTION      :  PROCESS SERVICE CONTRACT DETAILS FOR BAU      */73800000
 /*                                                                   */73810000
 /*********************************************************************/73820000
 R760_FILL_SERV_CTR_PERIOD_FUT: PROC;                                   73830000
                                                                        73840000
   FUTURE_BAU.SERVICE_START_DATE = TB_240_FUT.EFFECTIVE_DATE;           73850000
   FUTURE_BAU.SERVICE_END_DATE   = TB_240_FUT.END_DATE;                 73860000
   FUTURE_BAU.CONTRACT_NUMBER    = TB_240_FUT.CONTRACT_NUMBER;          73870000
                                                                        73880000
   IF SW_WARRANTY_FUT                                                   73890000
   THEN DO;                                                             73900000
 /* GET F_TYPE_OF_WARRANTY IF THE MACHINE IS FLEXIBLE OR HARDBUNDLE  */ 73910000
 /* AND PASS CORRECT SERVICE START AND SERVICE END DATES             */ 73920000
                                                                        73930000
   IF SWITCH_FW_BAU_FUT | SWITCH_HB_BAU_FUT  THEN                       73940000
     DO;                                                                73950000
       FUTURE_BAU.TYPE_OF_WARRANTY =                                    73960000
                              INST_HW_BAU_FUT.F_TYPE_OF_WARRANTY;       73970000
                                                                        73980000
       IF INST_HW_BAU_FUT.F_SPLT_DATE >                                 73990000
                              FUTURE_BAU.SERVICE_START_DATE THEN        74000000
          FUTURE_BAU.SERVICE_START_DATE = INST_HW_BAU_FUT.F_SPLT_DATE;  74010000
                                                                        74020000
       IF INST_HW_BAU_FUT.END_DATE <                                    74030000
                              FUTURE_BAU.SERVICE_END_DATE THEN          74040000
          FUTURE_BAU.SERVICE_END_DATE   = INST_HW_BAU_FUT.END_DATE;     74050000
     END;                                                               74060000
   ELSE                                                                 74070000
     DO;                                                                74080000
       FUTURE_BAU.TYPE_OF_WARRANTY =                                    74090000
                              INST_HW_BAU_FUT.TYPE_OF_WARRANTY;         74100000
                                                                        74110000
       IF INST_HW_BAU_FUT.EFFECTIVE_DATE >                              74120000
                     FUTURE_BAU.SERVICE_START_DATE THEN                 74130000
       FUTURE_BAU.SERVICE_START_DATE =                                  74140000
                              INST_HW_BAU_FUT.EFFECTIVE_DATE;           74150000
                                                                        74160000
       IF INST_HW_BAU_FUT.END_DATE <                                    74170000
                     FUTURE_BAU.SERVICE_END_DATE THEN                   74180000
       FUTURE_BAU.SERVICE_END_DATE =                                    74190000
                     INST_HW_BAU_FUT.END_DATE;                          74200000
                                                                        74210000
       IF SW_BRAND_BAU_FUT                                              74220000
       THEN                                                             74230000
         DO;                                                            74240000
                                                                        74250000
           IF FUTURE_BAU.SERVICE_END_DATE >                             74260000
             R014_DATE_CALC (INST_HW_BAU_FUT.F_SPLT_DATE,-1) THEN       74270000
                                                                        74280000
           FUTURE_BAU.SERVICE_END_DATE   =                              74290000
                  R014_DATE_CALC (INST_HW_BAU_FUT.F_SPLT_DATE,-1);      74300000
         END;                                                           74310000
                                                                        74320000
     END;                                                               74330000
     FUTURE_BAU.MA_STATUS  =                                            74340000
                       R011_TRANS_TPMNT(FUTURE_BAU.TYPE_OF_WARRANTY);   74350000
   END;                                                                 74360000
   ELSE DO;                                                             74370000
     IF ( SW_INTERNAL_FUT             |                                 74380000
          SW_LEASE_RENTAL_FUT         |                                 74390000
          SW_INTERNAL_MACHINE_CTR_FUT   ) THEN                          74400000
      DO;                                                               74410000
        IF INST_HW_BAU_FUT.EFFECTIVE_DATE >                             74420000
                      FUTURE_BAU.SERVICE_START_DATE THEN                74430000
        FUTURE_BAU.SERVICE_START_DATE =                                 74440000
                               INST_HW_BAU_FUT.EFFECTIVE_DATE;          74450000
                                                                        74460000
        IF INST_HW_BAU_FUT.END_DATE <                                   74470000
                      FUTURE_BAU.SERVICE_END_DATE THEN                  74480000
        FUTURE_BAU.SERVICE_END_DATE =                                   74490000
                      INST_HW_BAU_FUT.END_DATE;                         74500000
      END;                                                              74510000
                                                                        74520000
     FUTURE_BAU.TYPE_OF_MAINT =                                         74530000
                   INST_HW_BAU_FUT.TYPE_OF_MAINT;                       74540000
                                                                        74550000
                                                                        74560000
     IF SW_TOM_INTERNAL_MACHINE_FUT THEN                                74570000
        FUTURE_BAU.MA_STATUS = PARM_RCBP70S.MACHINE_STATUS;             74580000
     ELSE                                                               74590000
           FUTURE_BAU.MA_STATUS        =                                74600000
               R011_TRANS_TPMNT(FUTURE_BAU.TYPE_OF_MAINT);              74610000
   END;                                                                 74620000
                                                                        74630000
 END R760_FILL_SERV_CTR_PERIOD_FUT;                   /* EOC RB01305 */ 74640000
1/*********************************************************************/74650000
 /*                                                    /* SOC RB01305 */74660000
 /*                                                                   */74670000
 /* MODULE NAME      :  R761_FILL_SUPPL_CTR_PERIOD_FUT                */74680000
 /*                                                                   */74690000
 /* DESCRIPTION      :  PROCESS SUPPLY CONTRACT DETAILS FOR BAU       */74700000
 /*                                                                   */74710000
 /*********************************************************************/74720000
 R761_FILL_SUPPL_CTR_PERIOD_FUT: PROC (PARM_EFF_DATE,PARM_END_DATE);    74730000
                                                                        74740000
   DCL PARM_EFF_DATE CHAR (10);                                         74750000
   DCL PARM_END_DATE CHAR (10);                                         74760000
                                                                        74770000
   FUTURE_BAU.SERVICE_START_DATE = PARM_EFF_DATE;                       74780000
   FUTURE_BAU.SERVICE_END_DATE   = PARM_END_DATE;                       74790000
                                                                        74800000
   IF INST_HW_BAU_FUT.TYPE_OF_MAINT ¬= ''                               74810000
   THEN DO;                                                             74820000
     FUTURE_BAU.TYPE_OF_MAINT = INST_HW_BAU_FUT.TYPE_OF_MAINT;          74830000
                                                                        74840000
     FUTURE_BAU.MA_STATUS     =                                         74850000
                        R011_TRANS_TPMNT(FUTURE_BAU.TYPE_OF_MAINT);     74860000
                                                                        74870000
   END;                                                                 74880000
   IF INST_HW_BAU_FUT.TYPE_OF_WARRANTY ¬= ''                            74890000
   THEN DO;                                                             74900000
 /* GET F_TYPE_OF_WARRANTY IF THE MACHINE IS FLEXIBLE OR HARDBUNDLE  */ 74910000
 /* AND PASS CORRECT SERVICE START AND SERVICE END DATES             */ 74920000
                                                                        74930000
 /*IF FLEXIBLE_WARRANTY_BAU THEN                                     */ 74940000
   IF (SWITCH_FW_BAU_FUT | SWITCH_HB_BAU_FUT) THEN                      74950000
     DO;                                                                74960000
       FUTURE_BAU.TYPE_OF_WARRANTY   =                                  74970000
                              INST_HW_BAU_FUT.F_TYPE_OF_WARRANTY;       74980000
                                                                        74990000
       FUTURE_BAU.SERVICE_START_DATE =                                  75000000
                              INST_HW_BAU_FUT.F_SPLT_DATE;              75010000
                                                                        75020000
     END;                                                               75030000
   ELSE                                                                 75040000
     DO;                                                                75050000
       FUTURE_BAU.TYPE_OF_WARRANTY =                                    75060000
                              INST_HW_BAU_FUT.TYPE_OF_WARRANTY;         75070000
                                                                        75080000
       IF SW_BRAND_BAU_FUT                                              75090000
       THEN                                                             75100000
         DO;                                                            75110000
           FUTURE_BAU.SERVICE_END_DATE   =                              75120000
                 R014_DATE_CALC (INST_HW_BAU_FUT.F_SPLT_DATE,-1);       75130000
         END;                                                           75140000
                                                                        75150000
     END;                                                               75160000
                                                                        75170000
     FUTURE_BAU.MA_STATUS        =                                      75180000
                       R011_TRANS_TPMNT(FUTURE_BAU.TYPE_OF_WARRANTY);   75190000
                                                                        75200000
   END;                                                                 75210000
                                                                        75220000
 END R761_FILL_SUPPL_CTR_PERIOD_FUT;                   /* EOC RB01305 */75230000
1/*********************************************************************/75240000
 /*                                                    /* SOC RB01305 */75250000
 /* MODULE NAME      :  R762_APPLY_PI_BAU_PRIORITY_FUT                */75260000
 /*                                                                   */75270000
 /* DESCRIPTION      :  APPLY PRIORITY RULES FUTURE RECORD WHEN ENTRY */75280000
 /*                     FOUND IN BOTH PI AND BAU                      */75290000
 /*********************************************************************/75300000
 R762_APPLY_PI_BAU_PRIORITY_FUT: PROC;                                  75310000
                                                                        75320000
   WRK_PRECEDENCE_FUTURE  = '';                                         75330000
   IF SW_WARRANTY_FUT THEN                        /* IF BAU WARRANTY */ 75340000
     FUTURE_BAU.TYPE_OF_MAINT   = FUTURE_BAU.TYPE_OF_WARRANTY;          75350000
                                                                        75360000
   IF SW_WARR_PI_FUT THEN                         /* IF PI WARRANTY  */ 75370000
     FUTURE_PI.TYPE_OF_MAINT    = FUTURE_PI.TYPE_OF_WARRANTY;           75380000
                                                                        75390000
   IF SWITCH_BAU_FUT = TRUE                                             75400000
   THEN DO;                                                             75410000
     IF SWITCH_PI_FUT = TRUE                                            75420000
     THEN DO;      /****** BOTH BAU AND PI PRESENTED TO RCBDT1U ******/ 75430000
       SWITCH_PI_BAU_FUT1 = TRUE;                    /* CEDS00000814 */ 75431062
                                                                        75440000
       IF (WRK_PI_ORIGIN_FUT = 'T241')                                  75450000
       THEN DO;                                                         75460000
         FUTURE_PI.TYPE_OF_MAINT    = FUTURE_BAU.TYPE_OF_MAINT;         75470000
         FUTURE_PI.TYPE_OF_WARRANTY = FUTURE_BAU.TYPE_OF_WARRANTY;      75480000
       END;                                                             75490000
                                                                        75500000
       FUTURE_PI_BAU = FUTURE_BAU, BY NAME;                             75510000
       WRK_PRECEDENCE_FUTURE = WRK_PRECEDENCE_BAU_FUT;                  75520000
                                                                        75530000
       IF ( WRK_PRECEDENCE_FUTURE < WRK_PRECEDENCE_PI_FUT ) &           75540000
          ( PARM_RCB005.PI_TO_BMT = 'Y' |                               75550000
            PARM_RCB005.PI_TO_BMT = 'I'  ) THEN                         75560000
        DO;                                                             75570000
          WRK_PRECEDENCE_FUTURE = WRK_PRECEDENCE_PI_FUT;                75580000
        END;                                                            75590000
                                                                        75600000
                        /*-- PREFER PI IF BAU HAS TOM 3 AND PI NOT --*/ 75610000
       IF (VERIFY(FUTURE_BAU.TYPE_OF_MAINT,                             75620000
                  WRK_TPMNT_VAL.TPMNT_ST3) = '0'   &                    75630000
           VERIFY(FUTURE_PI.TYPE_OF_MAINT,                              75640000
                  WRK_TPMNT_VAL.TPMNT_ST3) ¬= '0')                      75650000
       THEN                                                             75660000
         DO;                                                            75670000
           IF PARM_RCB005.PI_TO_BMT = 'Y' |                             75680000
              PARM_RCB005.PI_TO_BMT = 'I'                               75690000
           THEN                                                         75700000
             FUTURE_PI_BAU = FUTURE_PI, BY NAME ;                       75710000
         END;                                                           75720000
                                                                        75730000
         /*-- PREFER PI IF BAU HAS INTERNAL OR LEASE/RENTAL & PI WARR*/ 75740000
       IF SW_WARR_PI_FUT &                                              75750000
          (SW_INTERNAL_FUT | SW_LEASE_RENTAL_FUT) &                     75760000
          ¬SWITCH_SERV_CTR_FUT          /* INDICATES NO 240 CONTRACT */ 75770000
       THEN                                                             75780000
         DO;                                                            75790000
          IF PARM_RCB005.PI_TO_BMT = 'Y' |                              75800000
             PARM_RCB005.PI_TO_BMT = 'I'                                75810000
          THEN                                                          75820000
           DO;                                                          75830000
             FUTURE_PI_BAU = FUTURE_PI, BY NAME ;                       75840000
           END;                                                         75850000
         END;                                                           75860000
                                /*-- BAU WARRANTY AND PI CONTRACT -- */ 75870000
                                                                        75880000
       IF SW_WARRANTY_FUT & SW_MAINT_PI_FUT & ¬SW_MAINT_02_FUT          75890000
       THEN                                                             75900000
         DO;                                                            75910000
            IF PARM_RCB005.PI_TO_BMT = 'Y' |                            75920000
               PARM_RCB005.PI_TO_BMT = 'I'                              75930000
            THEN DO;                                                    75940000
              FUTURE_PI_BAU = FUTURE_PI, BY NAME ;                      75950000
                                                                        75960000
              FUTURE_PI_BAU.TYPE_OF_MAINT =                             75970000
                              FUTURE_BAU.TYPE_OF_WARRANTY;              75980000
              FUTURE_PI_BAU.MA_STATUS = FUTURE_BAU.MA_STATUS;           75990000
                                                                        76000000
              FUTURE_PI_BAU.SERVICE_START_DATE =                        76010000
                                     WRK_PI_CTR_START_DATE_FUT;         76020000
              IF FUTURE_BAU.SERVICE_START_DATE >                        76030000
                  FUTURE_PI_BAU.SERVICE_START_DATE THEN                 76040000
              FUTURE_PI_BAU.SERVICE_START_DATE =                        76050000
                              FUTURE_BAU.SERVICE_START_DATE;            76060000
                                                                        76070000
              FUTURE_PI_BAU.SERVICE_END_DATE =                          76080000
                                     WRK_PI_CTR_END_DATE_FUT;           76090000
              IF FUTURE_BAU.SERVICE_END_DATE <                          76100000
                  FUTURE_PI_BAU.SERVICE_END_DATE THEN                   76110000
              FUTURE_PI_BAU.SERVICE_END_DATE   =                        76120000
                              FUTURE_BAU.SERVICE_END_DATE;              76130000
            END;                                                        76140000
         END;                                                           76150000
                                /*-- PI WARRANTY AND BAU CONTRACT --*/  76160000
                                                                        76170000
       IF SW_WARR_PI_FUT &                                              76180000
          (SW_MAINT_02_FUT | SW_INTERNAL_FUT | SW_LEASE_RENTAL_FUT) &   76190000
          SWITCH_SERV_CTR_FUT &                                         76200000
          ¬SW_WARRANTY_FUT                                              76210000
       THEN                                                             76220000
         DO;                                                            76230000
          IF PARM_RCB005.PI_TO_BMT = 'Y' |                              76240000
             PARM_RCB005.PI_TO_BMT = 'I'                                76250000
          THEN DO;                                                      76260000
           FUTURE_PI_BAU.TYPE_OF_MAINT =                                76270000
                              FUTURE_PI.TYPE_OF_WARRANTY;               76280000
           FUTURE_PI_BAU.MA_STATUS = FUTURE_PI.MA_STATUS;               76290000
                                                                        76300000
           FUTURE_PI.SERVICE_START_DATE =                               76310000
                              WRK_PI_HW_START_DATE_FUT;                 76320000
                                                                        76330000
           IF FUTURE_PI.SERVICE_START_DATE >                            76340000
               FUTURE_PI_BAU.SERVICE_START_DATE THEN                    76350000
           FUTURE_PI_BAU.SERVICE_START_DATE =                           76360000
                              FUTURE_PI.SERVICE_START_DATE;             76370000
                                                                        76380000
           FUTURE_PI.SERVICE_END_DATE = WRK_PI_HW_END_DATE_FUT;         76390000
                                                                        76400000
           IF FUTURE_PI.SERVICE_END_DATE <                              76410000
               FUTURE_PI_BAU.SERVICE_END_DATE THEN                      76420000
           FUTURE_PI_BAU.SERVICE_END_DATE   =                           76430000
                              FUTURE_PI.SERVICE_END_DATE;               76440000
          END;                                                          76450000
         END;                                                           76460000
                                                                        76470000
       IF SW_MAINT_PI_FUT & ¬SW_WARR_PI_FUT &                           76480000
          (SW_INTERNAL_FUT | SW_LEASE_RENTAL_FUT) &                     76490000
          ¬SWITCH_SERV_CTR_FUT                                          76500000
       THEN                                                             76510000
         DO;                                                            76520000
            IF PARM_RCB005.PI_TO_BMT = 'Y' |                            76530000
               PARM_RCB005.PI_TO_BMT = 'I'                              76540000
            THEN DO;                                                    76550000
              FUTURE_PI_BAU = FUTURE_PI, BY NAME ;                      76560000
                                                                        76570000
              FUTURE_PI_BAU.TYPE_OF_MAINT =                             76580000
                              FUTURE_BAU.TYPE_OF_MAINT;                 76590000
              FUTURE_PI_BAU.MA_STATUS = FUTURE_BAU.MA_STATUS;           76600000
                                                                        76610000
              FUTURE_PI_BAU.SERVICE_START_DATE =                        76620000
                                     WRK_PI_CTR_START_DATE_FUT;         76630000
                                                                        76640000
              IF FUTURE_BAU.SERVICE_START_DATE >                        76650000
                  FUTURE_PI_BAU.SERVICE_START_DATE THEN                 76660000
              FUTURE_PI_BAU.SERVICE_START_DATE =                        76670000
                              FUTURE_BAU.SERVICE_START_DATE;            76680000
                                                                        76690000
              FUTURE_PI_BAU.SERVICE_END_DATE =                          76700000
                                     WRK_PI_CTR_END_DATE_FUT;           76710000
                                                                        76720000
              IF FUTURE_BAU.SERVICE_END_DATE <                          76730000
                  FUTURE_PI_BAU.SERVICE_END_DATE THEN                   76740000
              FUTURE_PI_BAU.SERVICE_END_DATE   =                        76750000
                              FUTURE_BAU.SERVICE_END_DATE;              76760000
            END;                                                        76770000
         END;                                                           76780000
     END;                                                               76790000
     ELSE DO;             /****** BAU PRESENTED TO RCBDT1U ******/      76800000
       SWITCH_BAU_FUT1 = TRUE;                       /* CEDS00000814 */ 76801062
       FUTURE_PI_BAU = FUTURE_BAU, BY NAME;                             76810000
       WRK_PRECEDENCE_FUTURE = WRK_PRECEDENCE_BAU_FUT;                  76820000
     END;                                                               76830000
   END;                                                                 76840000
   ELSE DO;                                                             76850000
     IF ((SWITCH_PI_FUT = TRUE) &/*** ONLY PI PRESENTED TO RCBDT1U ***/ 76860000
        ((WRK_PI_ORIGIN_FUT = 'BOTH') | (WRK_PI_ORIGIN_FUT = 'T051')))  76870000
     THEN DO;                                                           76880000
       SWITCH_PI_FUT1 = TRUE;                        /* CEDS00000814 */ 76881067
       SWITCH_FUT_REC = FALSE;                                          76890000
                                                                        76900000
       IF SW_PROCESS_PERCALL_FUT = TRUE                                 76910000
       THEN                                                             76920000
        DO;                                                             76930000
         IF SWITCH_RETAIN_PERCALL_FUT = TRUE                            76940000
         THEN                                                           76950000
          DO;                                                           76960000
           FUTURE_PI_BAU        = FUTURE_PI, BY NAME;                   76970000
           SWITCH_FUT_REC = TRUE;                                       76980000
           WRK_PRECEDENCE_FUTURE = WRK_PRECEDENCE_PI_FUT;               76990000
          END;                                                          77000000
        END;                                                            77010000
       ELSE                                                             77020000
        DO;                                                             77030000
          FUTURE_PI_BAU         = FUTURE_PI, BY NAME;                   77040000
          WRK_PRECEDENCE_FUTURE = WRK_PRECEDENCE_PI_FUT;                77050000
          SWITCH_FUT_REC = TRUE;                                        77060000
        END;                                                            77070000
     END;                                                               77080000
     ELSE IF ((SWITCH_PI_FUT = TRUE) & /* IGNORE IF ONLY T241 RECORD*/  77090000
              (WRK_PI_ORIGIN_FUT = 'T241')) THEN                        77100000
     DO;                                                                77110000
       SWITCH_FUT_REC = FALSE;                                          77120000
     END;                                                               77130000
   END;                                                                 77140000
                                                                        77150000
 END R762_APPLY_PI_BAU_PRIORITY_FUT;                                    77160000
                                                       /* EOC RB01305 */77170000
1/*********************************************************************/77180000
 /*                                                    /* SOC RB01305 */77190000
 /* MODULE NAME      :  R763_UPDATE_RCBDTB1_FUT_REC                   */77200000
 /*                                                                   */77210000
 /* DESCRIPTION      :                                                */77220000
 /*                                                                   */77230000
 /*********************************************************************/77240000
 R763_UPDATE_RCBDTB1_FUT_REC: PROC;                                     77250000
                                                                        77262060
 FUTURE_PI_BAU_SLOT1          = '';                                     77270050
 FUTURE_PI_BAU_SLOT2          = '';                                     77280050
                                                                        77290000
 DO WHILE ( ( FILE_RCBDTB1.SERVICE_START_DATE >=                        77300000
              FUTURE_PI_BAU.SERVICE_START_DATE  ) &                     77310000
            ( FILE_RCBDTB1.SERVICE_END_DATE   >=                        77320000
              FUTURE_PI_BAU.SERVICE_END_DATE    ) &                     77330000
            ( SWITCH_FUT_REC = TRUE             )   );                  77340000
                                                                        77350000
  TEMP_RUN_DATE_FUT       = RUN_DATE_FUT;                               77360000
  TEMP_CURR_END_DATE      = FUTURE_PI_BAU.SERVICE_END_DATE;             77370000
  TEMP_T220_SPLT_DATE_FUT = INST_HW_BAU_FUT.F_SPLT_DATE;                77380000
  TEMP_T051_SPLT_DATE_FUT = HW_CTR_PI_FUT.WARRANTY_SPLT_DATE;           77390000
  TEMP_SW_BRAND_PI_FUT    = SW_BRAND_PI_FUT;                            77400000
  TEMP_SW_BRAND_BAU_FUT   = SW_BRAND_BAU_FUT;                           77410000
                                                                        77420000
  CALL R750_PROCESS_FUT_HW;                                             77430000
 END;                                                                   77440000
                                                                        77450000
 IF ( ( FILE_RCBDTB1.SERVICE_START_DATE >=                              77460000
        FUTURE_PI_BAU.SERVICE_START_DATE  ) &                           77470000
      ( FILE_RCBDTB1.SERVICE_END_DATE <                                 77480000
        FUTURE_PI_BAU.SERVICE_END_DATE  ) &                             77490000
      ( SWITCH_FUT_REC = TRUE             )   ) THEN                    77500000
   DO;                                                                  77510000
     FUTURE_PI_BAU.SERVICE_START_DATE =                                 77520000
              R014_DATE_CALC (FILE_RCBDTB1.SERVICE_END_DATE,+1);        77530000
   END;                                                                 77540000
                                                                        77550000
 IF ( ( FILE_RCBDTB1.SERVICE_END_DATE   >                               77560000
        FUTURE_PI_BAU.SERVICE_START_DATE  ) &                           77570000
      ( FILE_RCBDTB1.SERVICE_START_DATE   <                             77580000
        FUTURE_PI_BAU.SERVICE_START_DATE  ) &                           77590000
      ( SWITCH_FUT_REC = TRUE             )   ) THEN                    77600000
   DO;                                                                  77610000
     IF WRK_PRECEDENCE_CURRENT < WRK_PRECEDENCE_FUTURE THEN             77620000
     DO;                                                                77630000
       FILE_RCBDTB1.SERVICE_END_DATE =                                  77640000
              R014_DATE_CALC (FUTURE_PI_BAU.SERVICE_START_DATE,-1);     77650000
     END;                                                               77660000
     ELSE                                                               77670000
     DO;                                                                77680000
       FUTURE_PI_BAU.SERVICE_START_DATE =                               77690000
              R014_DATE_CALC (FILE_RCBDTB1.SERVICE_END_DATE,+1);        77700000
     END;                                                               77710000
   END;                                                                 77720000
                                                                        77730000
 IF SWITCH_FUT_REC = TRUE THEN                                          77740000
    FUTURE_PI_BAU_SLOT1 = FUTURE_PI_BAU, BY NAME ;                      77750000
                                                                        77760000
 IF ( ( FUTURE_PI_BAU.SERVICE_START_DATE ¬=                             77770000
         R014_DATE_CALC (FILE_RCBDTB1.SERVICE_END_DATE,+1)) &           77780000
      ( SWITCH_FUT_REC = TRUE                             )  ) THEN     77790000
  DO;                                                                   77800000
   SWITCH_FUT_REC = FALSE;                                              77810000
   FUTURE_PI_BAU_SLOT1 = '';                                            77820000
  END;                                                                  77830000
                                                                        77840000
 IF SWITCH_FUT_REC = TRUE THEN                                          77850000
   DO;                                                                  77860000
    TEMP_RUN_DATE_FUT       = RUN_DATE_FUT;                             77870000
    TEMP_CURR_END_DATE      = FUTURE_PI_BAU.SERVICE_END_DATE;           77880000
    TEMP_T220_SPLT_DATE_FUT = INST_HW_BAU_FUT.F_SPLT_DATE;              77890000
    TEMP_T051_SPLT_DATE_FUT = HW_CTR_PI_FUT.WARRANTY_SPLT_DATE;         77900000
    TEMP_SW_BRAND_PI_FUT    = SW_BRAND_PI_FUT;                          77910000
    TEMP_SW_BRAND_BAU_FUT   = SW_BRAND_BAU_FUT;                         77920000
                                                                        77930000
    CALL R750_PROCESS_FUT_HW;                                           77940000
                                                                        77950000
    DO WHILE ( ( FUTURE_PI_BAU_SLOT1.SERVICE_START_DATE >=              77960000
                 FUTURE_PI_BAU.SERVICE_START_DATE  ) &                  77970000
               ( FUTURE_PI_BAU_SLOT1.SERVICE_END_DATE   >=              77980000
                 FUTURE_PI_BAU.SERVICE_END_DATE    ) &                  77990000
               ( SWITCH_FUT_REC = TRUE             )   );               78000000
     TEMP_RUN_DATE_FUT       = RUN_DATE_FUT;                            78010000
     TEMP_CURR_END_DATE      = FUTURE_PI_BAU.SERVICE_END_DATE;          78020000
     TEMP_T220_SPLT_DATE_FUT = INST_HW_BAU_FUT.F_SPLT_DATE;             78030000
     TEMP_T051_SPLT_DATE_FUT = HW_CTR_PI_FUT.WARRANTY_SPLT_DATE;        78040000
     TEMP_SW_BRAND_PI_FUT    = SW_BRAND_PI_FUT;                         78050000
     TEMP_SW_BRAND_BAU_FUT   = SW_BRAND_BAU_FUT;                        78060000
                                                                        78070000
     CALL R750_PROCESS_FUT_HW;                                          78080000
    END;                                                                78090000
                                                                        78100000
    FUTURE_PI_BAU_SLOT2 = FUTURE_PI_BAU, BY NAME;                       78110000
    FUTURE_PI_BAU = FUTURE_PI_BAU_SLOT1, BY NAME;                       78120000
 END;                                                                   78130000
                                                                        78140000
 IF ( ( FUTURE_PI_BAU_SLOT1.SERVICE_START_DATE >=                       78150000
        FUTURE_PI_BAU_SLOT2.SERVICE_START_DATE  ) &                     78160000
      ( FUTURE_PI_BAU_SLOT1.SERVICE_END_DATE  <                         78170000
        FUTURE_PI_BAU_SLOT2.SERVICE_END_DATE  ) &                       78180000
      ( SWITCH_FUT_REC = TRUE             )   ) THEN                    78190000
   DO;                                                                  78200000
     FUTURE_PI_BAU_SLOT2.SERVICE_START_DATE =                           78210000
           R014_DATE_CALC (FUTURE_PI_BAU_SLOT1.SERVICE_END_DATE,+1);    78220000
   END;                                                                 78230000
                                                                        78240000
 IF ( ( FUTURE_PI_BAU_SLOT1.SERVICE_END_DATE   >                        78250000
        FUTURE_PI_BAU_SLOT2.SERVICE_START_DATE  ) &                     78260000
      ( FUTURE_PI_BAU_SLOT1.SERVICE_START_DATE   <                      78270000
        FUTURE_PI_BAU_SLOT2.SERVICE_START_DATE  ) &                     78280000
      ( SWITCH_FUT_REC = TRUE             )   ) THEN                    78290000
   DO;                                                                  78300000
     IF WRK_PRECEDENCE_CURRENT < WRK_PRECEDENCE_FUTURE THEN             78310000
     DO;                                                                78320000
       FUTURE_PI_BAU_SLOT1.SERVICE_END_DATE =                           78330000
           R014_DATE_CALC (FUTURE_PI_BAU_SLOT2.SERVICE_START_DATE,-1);  78340000
     END;                                                               78350000
     ELSE                                                               78360000
     DO;                                                                78370000
       FUTURE_PI_BAU_SLOT2.SERVICE_START_DATE=                          78380000
              R014_DATE_CALC (FUTURE_PI_BAU_SLOT1.SERVICE_END_DATE,+1); 78390000
     END;                                                               78400000
   END;                                                                 78410000
                                                                        78420000
 IF ( ( FUTURE_PI_BAU_SLOT1.SERVICE_START_DATE =                        78430000
         R014_DATE_CALC (FILE_RCBDTB1.SERVICE_END_DATE,+1)) &           78440000
      ( STRING(FUTURE_PI_BAU_SLOT1) ¬= ''                 )  ) THEN     78450000
  DO;                                                                   78460000
   FILE_RCBDTB1.TYPE_MAINT_FUT =                                        78470000
                         FUTURE_PI_BAU_SLOT1.TYPE_OF_MAINT;             78480000
                                                                        78490000
   FILE_RCBDTB1.MA_STATUS_FUT =                                         78500000
                         FUTURE_PI_BAU_SLOT1.MA_STATUS;                 78510000
                                                                        78520000
   FILE_RCBDTB1.END_DATE_FUT  =                                         78530000
                         FUTURE_PI_BAU_SLOT1.SERVICE_END_DATE;          78540000
                                                                        78550000
   FILE_RCBDTB1.CONTRACT_NUMBER_FUT =                                   78560000
                         FUTURE_PI_BAU_SLOT1.CONTRACT_NUMBER;           78570000
                                                                        78580000
   FILE_RCBDTB1.LIABILITY_FUT =                                         78590000
                         FUTURE_PI_BAU_SLOT1.LIABILITY;                 78600000
  END;                                                                  78610000
                                                                        78620000
 END R763_UPDATE_RCBDTB1_FUT_REC;                      /* EOC RB01305 */78630000
1/*********************************************************************/78640000
 /*                                                                   */78650000
 /* MODULE NAME      :  R749_WRITE_RCBDTB1                            */78660000
 /*                                                                   */78670000
 /* DESCRIPTION      :                                                */78680000
 /*                                                                   */78690000
 /*********************************************************************/78700000
 R749_WRITE_RCBDTB1: PROC;                                              78710000
                                                                        78720000
   CALL RCB018M (SUBSTR(FILE_RCBDTB1.SEQUENCE_NUMBER,1,4),              78730000
                        WRK_HASH_TOTAL,                                 78740000
                        PTR_INT_AREA);                                  78750000
                                                     /* SOC RC01353 */  78751000
   IF FILE_RCBDTB1.TYPE_OF_CONTRACT = 'SERVINT' THEN                    78752000
   DO;                                                                  78753000
      FILE_RCBDTB1.CONTRACT_SOURCE  = 'I';                              78754000
   END;                                              /* EOC RC01353 */  78755000
                                                                        78755100
                                                      /* SOC RC01359 */ 78756000
   IF FILE_RCBDTB1.SERIAL_LNG  = FILE_RCBDTB1.ORIGIN||                  78757000
                                 FILE_RCBDTB1.SEQUENCE_NUMBER THEN      78758000
    DO;                                                                 78758100
     IF (LENGTH(TRIM(FILE_RCBDTB1.SEQUENCE_NUMBER)) = 7 &               78759000
         SUBSTR(FILE_RCBDTB1.SEQUENCE_NUMBER,1,2) = '00') THEN          78759100
      DO;                                                               78760000
        FILE_RCBDTB1.SERIAL_LNG  = FILE_RCBDTB1.ORIGIN||                78761000
                     SUBSTR(FILE_RCBDTB1.SEQUENCE_NUMBER,3,5);          78762000
      END;                                                              78763000
    END;                                                                78764000
                                                      /* EOC RC01359 */ 78765000
   WRITE FILE(RCBDTB1) FROM (IO_AREA_RCBDTB1);                          78770000
                                                                        78780000
   WRK_CNT_COUNTRY = WRK_CNT_COUNTRY + 1;                               78790000
                                                                        78800000
 END R749_WRITE_RCBDTB1;                                                78810000
                                                                        78820000
1/*********************************************************************/78830000
 /*                                                                   */78840000
 /* MODULE NAME      :  R799_END_COUNTRY                              */78850000
 /*                                                                   */78860000
 /* DESCRIPTION      :                                                */78870000
 /*                                                                   */78880000
 /*********************************************************************/78890000
 R799_END_COUNTRY: PROC;                                                78900000
                                                                        78910000
   EXEC SQL                                                             78920000
   CLOSE CURSOR_INST_HW;                                                78930000
                                                                        78940000
   SELECT (SQLCODE);                                                    78950000
     WHEN (0);                                                          78960000
     OTHERWISE DO;                                                      78970000
       CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#048');                  78980000
     END;                                                               78990000
   END;                                                                 79000000
                                                      /* SOC RB01305 */ 79010000
   /* IF PARM_RCB005.PI_TO_BMT = 'Y' */                                 79020000
   IF PARM_RCB005.PI_TO_BMT = 'Y' | PARM_RCB005.PI_TO_BMT = 'I'         79030000
                                                      /* EOC RB01305 */ 79040000
   THEN DO;                                                             79050000
     EXEC SQL                                                           79060000
     CLOSE CURSOR_PI_HW;                                                79070000
                                                                        79080000
     SELECT (SQLCODE);                                                  79090000
       WHEN (0);                                                        79100000
       OTHERWISE DO;                                                    79110000
         CALL RCBDTBM_ERROR (ADDR (SQLCA),'DB2','#049');                79120000
       END;                                                             79130000
     END;                                                               79140000
   END;                                                                 79150000
                                                                        79160000
                             /* WRITE COUNT MESSAGE FOR COUNTRY      */ 79170000
   PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                79180000
   PARM_INT_AREA.MESSAGE_NUMBER  = '0004';                              79190000
   PARM_INT_AREA.MSG_VAR_CODES   = ' ';                                 79200000
   PARM_INT_AREA.MSG_VAR_CODE_6  = 'FL';                                79210000
   PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_FILE_NAME;                       79220000
   PARM_INT_AREA.MSG_VAR_CODE_7  = 'C6';                                79230000
   WRK_PIC_10                    = WRK_CNT_COUNTRY;                     79240000
   PARM_INT_AREA.MSG_VAR_VALUE_7 = WRK_PIC_10;                          79250000
   CALL RCB0M1M (PTR_INT_AREA);                                         79260000
                                      /* ADD CNT_COUNTRY TO TOTAL    */ 79270000
   WRK_CNT_RCBDTB1 = WRK_CNT_RCBDTB1 + WRK_CNT_COUNTRY;                 79280000
                                                                        79290000
   WRK_CTRYNO_NO = WRK_CTRYNO_NO + 1; /* INCREASE FOR NEXT CTRYNO    */ 79300000
                                                                        79310000
                          /* COMMIT TO RELEASE LOCK FOR THIS COUNTRY */ 79320000
   EXEC SQL COMMIT;                                                     79330000
                                                                        79340000
   SELECT (SQLCODE);                                                    79350000
     WHEN (0);                                                          79360000
     OTHERWISE                                                          79370000
       DO;                                                              79380000
          CALL RCBDTBM_ERROR (ADDR (SQLCA),                             79390000
                      'DB2',                                            79400000
                      '#050');                                          79410000
       END;                                                             79420000
   END;                                                                 79430000
                                                                        79440000
 END R799_END_COUNTRY;                                                  79450000
                                                                        79460000
1/********************************************************************/ 79470000
 /*                                                                  */ 79480000
 /* MODULE NAME      : R800_INIT_PROCESSING                          */ 79490000
 /*                                                                  */ 79500000
 /* DESCRIPTION      :                                               */ 79510000
 /*                                                                  */ 79520000
 /********************************************************************/ 79530000
 R800_INIT_PROCESSING: PROC;                                            79540000
                                                                        79550000
   OPEN FILE(RCBDTB1);                                                  79560000
                                                                        79570000
   FILE_RCBDTB1_H = '';                       /* FILL HEADER RECORD  */ 79580000
   FILE_RCBDTB1_H.KEY            = LOW(20);                             79590000
   FILE_RCBDTB1_H.PROCESS_NAME   = 'BMT INVEN';                         79600000
   FILE_RCBDTB1_H.FILE_TYPE      = 'DELTA EXTR';                        79610000
   FILE_RCBDTB1_H.COUNTRY_NUMBER = '';        /* PROCESS IS MCO      */ 79620000
   FILE_RCBDTB1_H.RUN_DATE       = '';                                  79630000
   FILE_RCBDTB1_H.TIME_STAMP     = WRK_TIME_STAMP;                      79640000
                                                                        79650000
   WRITE FILE(RCBDTB1) FROM(IO_AREA_RCBDTB1); /* WRITE HEADER REC    */ 79660000
                                                                        79670000
   WRK_CNT_RCBDTB1 = '';                      /* TOTAL OF DATA REC   */ 79680000
                                                                        79690000
 END R800_INIT_PROCESSING;                                              79700000
                                                                        79710000
1/********************************************************************/ 79720000
 /*                                                                  */ 79730000
 /* MODULE NAME      : R899_END_PROCESSING                           */ 79740000
 /*                                                                  */ 79750000
 /* DESCRIPTION      :                                               */ 79760000
 /*                                                                  */ 79770000
 /********************************************************************/ 79780000
 R899_END_PROCESSING: PROC;                                             79790000
                                                                        79800000
   FILE_RCBDTB1                  = '';                    /* RB01305 */ 79810000
   FILE_RCBDTB1_H = '';                 /* INIT AND FILL TRAILER REC */ 79820000
   FILE_RCBDTB1_H.KEY            = HIGH(20);                            79830000
   FILE_RCBDTB1_H.PROCESS_NAME   = 'BMT INVEN';                         79840000
   FILE_RCBDTB1_H.FILE_TYPE      = 'DELTA EXTR';                        79850000
   FILE_RCBDTB1_H.COUNTRY_NUMBER = '';                                  79860000
   FILE_RCBDTB1_H.RUN_DATE       = '';                                  79870000
   FILE_RCBDTB1_H.TIME_STAMP     = WRK_TIME_STAMP;                      79880000
                                                                        79890000
   WRITE FILE(RCBDTB1) FROM(IO_AREA_RCBDTB1); /* WRITE TRAILER REC   */ 79900000
                                                                        79910000
   CLOSE FILE(RCBDTB1);                    /* CLOSE FILE RCBDTB1     */ 79920000
                                                                        79930000
   TB_RCBV500   = '';         /* SAVE HASH TOTAL IN PARAMETER RCB024 */ 79940000
   TB_RCBV500_I = '';                                                   79950000
   TB_RCBP24S.NUMBER      = 'RCB024';                                   79960000
   TB_RCBP24S.PROC_ID     = WRK_PROC_ID;                                79970000
   TB_RCBP24S.CTRYNO      = COUNTRY_AREA.CTRY_SET_ID;      /* RC01219 */79980000
   TB_RCBP24S.FILE_NAME   = WRK_FILE_NAME;                              79990000
   TB_RCBP24S.TIME_STAMP  = WRK_TIME_STAMP;                             80000000
   TB_RCBP24S.HASH_TOTAL  = WRK_HASH_TOTAL;                             80010000
   TB_RCBP24S.LENGTH_PARM = STG(TB_RCBP24S.TIME_STAMP) +                80020000
                            STG(TB_RCBP24S.HASH_TOTAL);                 80030000
                                                                        80040000
   CALL RCBG50M (ADDR(TB_RCBV500),                                      80050000
                 ADDR(TB_RCBV500_I),                                    80060000
                 PTR_RETURN_AREA_BB,                                    80070000
                 PTR_INT_AREA);                                         80080000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  80090000
     WHEN (0);                                                          80100000
     WHEN (4) DO;                  /* WHEN NOT FOUND THEN INSERT  */    80110000
       CALL RCBF50M (ADDR(TB_RCBV500),                                  80120000
                     ADDR(TB_RCBV500_I),                                80130000
                     PTR_RETURN_AREA_BB,                                80140000
                     PTR_INT_AREA);                                     80150000
       SELECT(RETURN_AREA_BB.RETURN_CODE);                              80160000
         WHEN (0);                                                      80170000
         OTHERWISE DO;                                                  80180000
           CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),        80190000
                               'DB2',                                   80200000
                               '#051');                                 80210000
         END;                                                           80220000
       END;                                                             80230000
     END;                                                               80240000
     OTHERWISE                                                          80250000
     DO;                                                                80260000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            80270000
                           'DB2',                                       80280000
                           '#052');                                     80290000
     END;                                                               80300000
   END;                                                                 80310000
                                                                        80320000
 END R899_END_PROCESSING;                                               80330000
                                                                        80340000
1/********************************************************************/ 80350000
 /*                                                                  */ 80360000
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 80370000
 /*                                                                  */ 80380000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 80390000
 /*                                                                  */ 80400000
 /********************************************************************/ 80410000
 R900_INIT_PROGRAM: PROC;                                               80420000
                                             /* INITIALISE POINTERS  */ 80430000
   PTR_INT_AREA       = ADDR(PARM_INT_AREA);                            80440000
   PTR_RETURN_AREA_BB = ADDR(RETURN_AREA_BB);                           80450000
   PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA);                            80460000
   PTR_RUN_DATE_AREA  = ADDR (RUN_DATE_AREA);                           80470000
                                             /* INITIALISE VARIABLES */ 80480000
   PARM_INT_AREA.MSG_AREA       = '';                                   80490000
   PARM_INT_AREA.ERR_AREA       = ' ';                                  80500000
   PARM_INT_AREA.MSG_REQUEST    = 'O';                                  80510000
   PARM_INT_AREA.MSG_TARGET     = 'F';                                  80520000
   PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                80530000
   PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                         80540000
   PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                         80550000
   PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                    80560000
   PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                      80570000
   PARM_INT_AREA.TXN_CODE       = '';                                   80580000
   PARM_INT_AREA.VERSION        = '';                                   80590000
   PARM_INT_AREA.PTR_PCB_IO     = NULL;                                 80600000
   PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                 80610000
                                             /* INITIALISE WRK-FIELDS*/ 80620000
   CALL RCB0M1M(PTR_INT_AREA);                                          80630000
                                              /* RETR. SYSTEM DATE   */ 80640000
   PARM_INT_AREA.MSG_REQUEST    = 'P';                                  80650000
   CALL RCB0T1M(PTR_INT_AREA);                /* OPEN MESSAGE FILE   */ 80660000
                                   /* DETERMINE TIMESTAMP FOR HEADER */ 80670000
   WRK_TIME_STAMP = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();         80680000
                                                                        80690000
   CALL RCB019M (PTR_COUNTRY_AREA,PTR_INT_AREA);/* RETRIEVE COUNTRY  */ 80700000
                                                                        80710000
   IF COUNTRY_AREA.COUNT_CTRY = 0                                       80720000
   THEN DO;                                                             80730000
     PARM_INT_AREA.COUNTRY_NUMBER = '';                                 80740000
     PARM_INT_AREA.MSG_VAR_CODES  = '';                                 80750000
     PARM_INT_AREA.MESSAGE_TYPE   = 'IS';                               80760000
     PARM_INT_AREA.MESSAGE_NUMBER = '0005';                             80770000
     CALL RCB0M1M (PTR_INT_AREA);                                       80780000
     CALL RCBDTBM_ERROR (NULL, 'OTHER', '#053');                        80790000
   END;                                                                 80800000
   ELSE DO;                                                             80810000
     WRK_PROC_ID  = COUNTRY_AREA.PROC_ID;                               80820000
     WRK_CTRYNO   = COUNTRY_AREA.CTRY_ARRAY(1).CTRYNO;                  80830000
     WRK_PGR_TYPE = COUNTRY_AREA.CTRY_ARRAY(1).PGR_TYPE;                80840000
   END;                                                                 80850000
                                                                        80860000
   SAVE_RCBV470                 = '';                                   80870000
   SAVE_RCBV470_I               = '';                                   80880000
   WRK_SAVE                     = '';                                   80890000
                                                                        80900000
                                                      /* SOC RC01234 */ 80910000
                                      /* RETRIEVE PARAMETER RCB067   */ 80920000
                                      /* TRANS TABLE TPMNT --> MA_ST */ 80930000
   TB_RCBV500          = '';                                            80940000
   TB_RCBV500_I        = '';                                            80950000
   TB_RCBP67S.NUMBER   = 'RCB067';                                      80960000
                                                                        80970000
   CALL RCBI50M ('U',                                                   80980000
                 ADDR (TB_RCBV500),                                     80990000
                 ADDR (TB_RCBV500_I),                                   81000000
                 PTR_RETURN_AREA_BB,                                    81010000
                 PTR_INT_AREA);                                         81020000
                                                                        81030000
   SELECT(RETURN_AREA_BB.RETURN_CODE);                                  81040000
     WHEN (0)                                                           81050000
       DO;                                                              81060000
          PARM_RCB067 = TB_RCBP67S;                                     81070000
       END;                                                             81080000
     WHEN (4)                                                           81090000
       DO;                                                              81100000
          PARM_INT_AREA.MESSAGE_TYPE               = 'IS';              81110000
          PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';            81120000
          PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';               81130000
          PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';              81140000
          PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                    81150000
                                         TB_RCBV500.PARAMETER_NUMBER;   81160000
          PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';              81170000
          PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                    81180000
                                         TB_RCBV500.PARAMETER_KEY;      81190000
          CALL RCB0M1M (PTR_INT_AREA);                                  81200000
          CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),         81210000
                      'DB2',                                            81220000
                      '#054');                                          81230000
       END;                                                             81240000
     OTHERWISE                                                          81250000
       DO;                                                              81260000
          CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),         81270000
                      'DB2',                                            81280000
                      '#055');                                          81290000
       END;                                                             81300000
   END;                                               /* EOC RC01234 */ 81310000
                                                    /* SOC : RB01281 */ 81320000
                                        /* RETRIEVE PARAMETER RCB063 */ 81330000
 /* GET TOM/TOW FROM RCB063 AT GEO INSTALLATION LEVEL FOR FLEXIBLE   */ 81340000
 /* WARRANTY OR HARDBUNDLE MACHINES WHEN RCB064 IS UNAVAILABLE       */ 81350000
                                                                        81360000
 WRK_FWTOW = '';                                          /* RB01298 */ 81370000
 WRK_HBTOM = '';                                          /* RB01298 */ 81380000
                                                                        81390000
 TB_RCBV500                   = '';                                     81400000
 TB_RCBV500_I                 = '';                                     81410000
 TB_RCBP63S.NUMBER            = 'RCB063';                               81420000
                                                                        81430000
 CALL RCBI50M ('U',                                                     81440000
               ADDR (TB_RCBV500),                                       81450000
               ADDR (TB_RCBV500_I),                                     81460000
               PTR_RETURN_AREA_BB,                                      81470000
               PTR_INT_AREA);                                           81480000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   81490000
   WHEN(0)                                                              81500000
 /*  DO;                                                  /* RB01298 */ 81510000
      PARM_RCBP63 = TB_RCBP63S;                                         81520000
                                                                        81530000
              /* -- COMMENTED OUT THE FOLLOWING LOGIC -- SOC RB01298 */ 81540000
                                                                        81550000
 /* F_WARRANTY_MA_STATUS_GEO                   = TRUE;               */ 81560000
 /*                                                                  */ 81570000
 /*   IF TB_RCBV500.PARAMETER_VALUE              = ' '               */ 81580000
 /*   THEN                                                           */ 81590000
 /*     DO;                                                          */ 81600000
 /*       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';               */ 81610000
 /*       PARM_INT_AREA.MESSAGE_TYPE             = 'BU';             */ 81620000
 /*       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0217';           */ 81630000
 /*       PARM_INT_AREA.MSG_VAR_CODE_6           = 'PN';             */ 81640000
 /*       PARM_INT_AREA.MSG_VAR_VALUE_6          =                   */ 81650000
 /*                                   TB_RCBV500.PARAMETER_NUMBER;   */ 81660000
 /*       PARM_INT_AREA.MSG_VAR_CODE_8           = 'PV';             */ 81670000
 /*       PARM_INT_AREA.MSG_VAR_VALUE_8          =                   */ 81680000
 /*                                   'RCB063 VALUE NOT FOUND  ';    */ 81690000
 /*       CALL RCB0M1M (PTR_INT_AREA);                               */ 81700000
 /*       CALL RCBDTBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),        */ 81710000
 /*                        'DB2',                                    */ 81720000
 /*                        '#053');                                  */ 81730000
 /*     END;                                                         */ 81740000
 /*  END;                                                            */ 81750000
                                                      /* EOC RB01298 */ 81760000
        /* WHEN RCB063 PARAMETER IS NOT FOUND THEN ABEND THE PROGRAM */ 81770000
   WHEN(4)                                                              81780000
     DO;                                                                81790000
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                81800000
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              81810000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 81820000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                81830000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      81840000
                                       TB_RCBV500.PARAMETER_NUMBER;     81850000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                81860000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      81870000
                                       TB_RCBV500.PARAMETER_KEY;        81880000
        CALL RCB0M1M (PTR_INT_AREA);                                    81890000
        CALL RCBDTBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),             81900000
                         'DB2',                                         81910000
                        '#054');                                        81920000
     END;                                                               81930000
   OTHERWISE                                                            81940000
     DO;                                                                81950000
        CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           81960000
                    'DB2',                                              81970000
                    '#055');                                            81980000
     END;                                                               81990000
 END;                                                                   82000000
                                                    /* EOC : RB01281 */ 82010000
       /* PARAMETER RCB156 IS CHECKED FOR EMEA ONLY *//* SOC RC01352 */ 82020000
                                                                        82030000
 TB_RCBV500                  = '';                                      82040000
 TB_RCBV500_I                = '';                                      82050000
 TB_RCBP156.NUMBER           = 'RCB156';                                82060000
 TB_RCBP156.PROC_ID          = COUNTRY_AREA.PROC_ID;                    82070000
                                                                        82080000
0CALL RCBI50M ('U',                                                     82090000
               ADDR (TB_RCBV500),                                       82100000
               ADDR (TB_RCBV500_I),                                     82110000
               PTR_RETURN_AREA_BB,                                      82120000
               PTR_INT_AREA);                                           82130000
                                                                        82140000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   82150000
   WHEN (0)                                                             82160000
     DO;                                                                82170000
       PARM_RCBP156  = TB_RCBP156 , BY NAME;                            82180000
       PARM_RCBP156.GEO_INDICATOR = TRIM(PARM_RCBP156.GEO_INDICATOR);   82190000
       IF PARM_RCBP156.GEO_INDICATOR = 'EMEA' THEN                      82200000
         DO;                                                            82210000
          SWITCH_RCB156_EMEA = TRUE;                                    82220000
         END;                                                           82230000
     END;                                                               82240000
   WHEN (4)                                                             82250000
     DO;                                                                82260000
       SWITCH_RCB156_EMEA = FALSE;                                      82270000
       PARM_INT_AREA.COUNTRY_NUMBER           = '';                     82280000
       PARM_INT_AREA.MESSAGE_TYPE             = 'BU';                   82290000
       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0329';                 82300000
       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                    82310000
       CALL RCB0M1M (PTR_INT_AREA);                                     82320000
     END;                                                               82330000
   OTHERWISE                                                            82340000
     DO;                                                                82350000
       CALL RCBDTBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            82360000
                           'DB2','#080');                               82370000
     END;                                                               82380000
 END;                                                 /* EOC RC01352 */ 82390000
                                                                        82400000
 END R900_INIT_PROGRAM;                                                 82410000
                                                                        82420000
1/********************************************************************/ 82430000
 /*                                                                  */ 82440000
 /* MODULE NAME      : R999_END_PROGRAM                              */ 82450000
 /*                                                                  */ 82460000
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 82470000
 /*                                                                  */ 82480000
 /********************************************************************/ 82490000
 R999_END_PROGRAM:  PROC;                                               82500000
                                    /* WRITE COUNT MESSAGE           */ 82510000
   PARM_INT_AREA.COUNTRY_NUMBER           = '';                         82520000
   PARM_INT_AREA.MESSAGE_TYPE             = 'IS';                       82530000
   PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0004';                     82540000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';                         82550000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'FL';                       82560000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 = WRK_FILE_NAME;              82570000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'C6';                       82580000
   WRK_PIC_10                             = WRK_CNT_RCBDTB1;            82590000
   PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 = WRK_PIC_10;                 82600000
   CALL RCB0M1M (PTR_INT_AREA);                                         82610000
                                                                        82620000
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 82630000
   PARM_INT_AREA.COUNTRY_NUMBER  = '';                                  82640000
   PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                82650000
   PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                              82660000
   PARM_INT_AREA.MSG_VAR_CODES   = '';                                  82670000
   CALL RCB0M1M (PTR_INT_AREA);                                         82680000
                                                                        82690000
                                    /* CLOSE MESSAGE FILE            */ 82700000
   PARM_INT_AREA.MSG_REQUEST = 'C';                                     82710000
   CALL RCB0M1M (PTR_INT_AREA);                                         82720000
                                                                        82730000
 END R999_END_PROGRAM;                                                  82740000
                                                                        82750000
1/********************************************************************/ 82760000
 /*                                                                  */ 82770000
 /* MODULE NAME      : RCBDTBM_ERROR                                 */ 82780000
 /*                                                                  */ 82790000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 82800000
 /*                    THE INPUT VARIABLES                           */ 82810000
 /*                                                                  */ 82820000
 /********************************************************************/ 82830000
 RCBDTBM_ERROR: PROC (PTR_ERROR,ERR_TYPE,CALL_ID);                      82840000
                                                                        82850000
   DCL PTR_ERROR     PTR;                                               82860000
   DCL ERR_TYPE      CHAR(8);                                           82870000
   DCL CALL_ID       CHAR(4);                                           82880000
                                                                        82890000
   PARM_INT_AREA.PTR_ERROR = PTR_ERROR;                                 82900000
   PARM_INT_AREA.ERR_TYPE  = ERR_TYPE;                                  82910000
   PARM_INT_AREA.CALL_ID   = CALL_ID;                                   82920000
                                                                        82930000
   CALL RCB0E1M (ADDR(PARM_INT_AREA));                                  82940000
                                                                        82950000
 END RCBDTBM_ERROR;                                                     82960000
                                                                        82970000
1/*******************************************************************/  82980000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  82990000
 /*******************************************************************/  83000000
 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */   83010000
 $DAIMOD (RCBDTBM);                      /* MODULE TO BE COMPILED   */  83020000
 /*******************************************************************/  83030000
 /* END OF ABR BLOCK                                                */  83040000
 /*******************************************************************/  83050000
 END RCBDTBM;                                                           83060000