1/* RCBDS1U - CCMS CUSTOMER INTERFACE USER EXIT                      */ 00019112
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /* MODULE NAME      : RCBDS1U                                       */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME     : RCBDSEP                                       */ 00060000
 /*                                                                  */ 00070000
 /* LANGUAGE         : PLISQL                                        */ 00080000
 /*                                                                  */ 00090000
 /* TYPE             : LINKABLE MODULE                               */ 00100000
 /*                                                                  */ 00110000
 /* DESCRIPTION      : USER EXIT FOR CUSTOMER INFORMATION            */ 00120000
 /*                    TO BE USED IN THE CCMS CUSTOMER INTERFACE     */ 00130000
 /*                                                                  */ 00140000
 /* NOTE 1           : IF YOU WANT TO USE THIS EXIT BE SURE TO SET   */ 00150000
 /*                    SWITCH_USER_EXIT TO TRUE                      */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00180000
 /*                                                                  */ 00190000
 /*                      - FILE RCBDSE0_CU                           */ 00200000
 /*                      - EXTRA FILE INFO  :                        */ 00210000
 /*                        - CU_ENGINEERING_OU FROM RCBT0350         */ 00220000
 /*                        - ADDRESS LINES (MAXIMUM 9), BOTH FOR     */ 00230000
 /*                          MAILING AND INVOICE ADDRESS             */ 00240000
 /*                                                                  */ 00250000
 /*                                                                  */ 00260000
 /* OUTPUT           : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00270000
 /*                  : - FILE : RCB0M10                              */ 00280000
 /*                                                                  */ 00290000
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00300000
 /*                                                                  */ 00310000
 /* MESSAGES         : ----                                          */ 00320000
 /*                                                                  */ 00330000
 /* DEPENDENCIES     : NONE                                          */ 00340000
 /*                                                                  */ 00350000
 /* FREQUENCY        : ----                                          */ 00360000
 /*                                                                  */ 00370000
 /*  MAINTENANCE LOG :                                               */ 00380000
 /*  ---------------                                                 */ 00390000
 /*                                                                  */ 00400000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00410000
 /*  --------------------------------------------------------------  */ 00420000
 /*  1998-09-16 | RA01214      | CCMS EXTRACT                        */ 00430000
 /*                                                                  */ 00440000
 /*  1999-11-02 | RUN ONCE NORD| ADD NORDIC SPECIFIC CODE - BG       */ 00450000
 /*  1999-11-03 | ROSOUTH      | ADD SOUTHR SPECIFIC CODE - RG       */ 00460000
 /*  1999-11-08 | RUN ONCE CNTL| ADD CENTRAL REGION CODE  - SG       */ 00470000
 /*  1999-11-08 | RONORTH      | ADD REGION NORTH RO CODE - CP       */ 00480000
 /*  2000-08-23 | RONORD       | MODIFY NORDIC CODE       - BG       */ 00490000
 /*  2001-03-22 |ROCNTL - 644, | CHANGE NO. C0005-0301    - SR       */ 00500000
 /*             |668, 693, 704,|                                     */ 00510000
 /*             |708, 740, 820,|                                     */ 00520000
 /*             |821 AND 826   |                                     */ 00530000
 /*             |RONORTH - 788 |                                     */ 00540000
 /*             |              |                                     */ 00550000
 /*  2001-08-07 |RONORTH - 864 | CHANGE NO. C0030-0601    - SR       */ 00560000
 /*  2001-08-07 |CPMA 01427282 | CHANGE NO. CHG0111a      - SR       */ 00570000
 /*             |              | THE SUBSCRIPT 'I' WAS USED IN PLACE */ 00580000
 /*             |              | OF 'R'                              */ 00590000
 /*  2001-12-05 |C0048-1201    | CHANGE NO. CHG0133A        - SR     */ 00600000
 /*             |              | Retain Branch for 866 to have 0     */ 00610000
 /*             |              | concatenated with 2nd and 3rd chara */ 00620000
 /*             |              | cters of the OU_CODE                */ 00630000
 /*  2001-12-07 |chg0073D      | Set retain Branch to '689' for all  */ 00640000
 /*             |              | South Africa Customers  (864)       */ 00650000
 /*  2001-12-10 |CHG0133B      | Set retain Branch to '019' for UK   */ 00660000
 /*             |              | when OU_CODE is blank               */ 00670000
 /*  2002-01-11 |C0051-0102    | CHANGE NO. CHG0144A        - SR     */ 00680000
 /*             |              | Retain Branch for 754 to have 0     */ 00690000
 /*             |              | concatenated with 2nd and 3rd chara */ 00700000
 /*             |              | cters of the OU_CODE and            */ 00710000
 /*             |              | Set retain Branch to '001' for UK   */ 00720000
 /*             |              | when OU_CODE is blank               */ 00730000
 /********************************************************************/ 00740000
1RCBDS1U: PROC    (PTR_SWITCH_USER_EXIT,                                00750000
                   PTR_FILE_RCBDSE0_CU,                                 00760000
                   PTR_FILE_EXTRA_INFO,                                 00770000
                   PTR_INT_AREA)                                        00780000
          REORDER;                                                      00790000
0              @O6WQYV: ENTRY;     DCL @SCHFIRST BIT(1)                 00800000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00810000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00820000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00830000
               EDIT    ('RCBDS1U  VERSION 1999.09.09' ,                 00840000
               ' 10H53.23      MIT DEM VERSIONS-ENTRY',                 00850000
               ' @O6WQYV',' ')     (SKIP,A,A,A,SKIP,A);                 00860000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00870000
               END;     /* ENDE DER VERSIONS-GRUPPE  */                 00880000
0DEFAULT RANGE (*)        STATIC;                                       00890000
1/********************************************************************/ 00900000
 /*  PARAMETERS                                                      */ 00910000
 /********************************************************************/ 00920000
0DCL PTR_SWITCH_USER_EXIT    PTR;                                       00930000
 DCL PTR_FILE_RCBDSE0_CU     PTR;                                       00940000
 DCL PTR_FILE_EXTRA_INFO     PTR;                                       00950000
0DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 00960000
1/********************************************************************/ 00970000
 /*  EXTERNAL ENTRIES                                                */ 00980000
 /********************************************************************/ 00990000
0DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 01000000
0/********************************************************************/ 01010000
 /* ON ERROR CONDITIONS                                              */ 01020000
 /********************************************************************/ 01030000
0%INCLUDE (RCB0E0M);                                                    01040000
  END;                                                                  01050000
 /********************************************************************/ 01060000
 /*                                                                  */ 01070000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 01080000
 /* AND CALL THE ERROR ROUTINE:                                      */ 01090000
 /*                                                                  */ 01100000
 /*                                                                  */ 01110000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 01120000
 /*                                                                  */ 01130000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 01140000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 01150000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 01160000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 01170000
 /*                                                                  */ 01180000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 01190000
 /*                                                                  */ 01200000
 /********************************************************************/ 01210000
0/********************************************************************/ 01220000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01230000
 /********************************************************************/ 01240000
0DCL SWITCH_USER_EXIT BIT (1) BASED (PTR_SWITCH_USER_EXIT);             01250000
0DCL 1 PARM_FILE_RCBDSE0_CU   BASED (PTR_FILE_RCBDSE0_CU),              01260000
      %INCLUDE (RCBDSES);,                                              01270000
      3 FILLER         CHAR(45);                                        01280000
0DCL 1 FILE_EXTRA_INFO        BASED (PTR_FILE_EXTRA_INFO),              01290000
      3 OU_CODE        CHAR(07),                                        01300000
      3 MAILING_ADDRESS,                                                01310000
        5 ICUS1AD      CHAR(30),                  /* ADDRESS LINE 1 */  01320000
        5 ICUS2AD      CHAR(30),                  /* ADDRESS LINE 2 */  01330000
        5 ICUS3AD      CHAR(30),                  /* ADDRESS LINE 3 */  01340000
        5 ICUS4AD      CHAR(30),                  /* ADDRESS LINE 4 */  01350000
        5 ICUS5AD      CHAR(30),                  /* ADDRESS LINE 5 */  01360000
        5 ICUS6AD      CHAR(30),                  /* ADDRESS LINE 6 */  01370000
        5 ICUS7AD      CHAR(30),                  /* ADDRESS LINE 7 */  01380000
        5 ICUS8AD      CHAR(30),                  /* ADDRESS LINE 8 */  01390000
        5 ICUS9AD      CHAR(30),                  /* ADDRESS LINE 9 */  01400000
      3 INVOICE_ADDRESS,                                                01410000
        5 ICUS1AD      CHAR(30),                  /* ADDRESS LINE 1 */  01420000
        5 ICUS2AD      CHAR(30),                  /* ADDRESS LINE 2 */  01430000
        5 ICUS3AD      CHAR(30),                  /* ADDRESS LINE 3 */  01440000
        5 ICUS4AD      CHAR(30),                  /* ADDRESS LINE 4 */  01450000
        5 ICUS5AD      CHAR(30),                  /* ADDRESS LINE 5 */  01460000
        5 ICUS6AD      CHAR(30),                  /* ADDRESS LINE 6 */  01470000
        5 ICUS7AD      CHAR(30),                  /* ADDRESS LINE 7 */  01480000
        5 ICUS8AD      CHAR(30),                  /* ADDRESS LINE 8 */  01490000
        5 ICUS9AD      CHAR(30);                  /* ADDRESS LINE 9 */  01500000
0DCL 1 PARM_INT_AREA          BASED (PTR_INT_AREA),                     01510000
      %INCLUDE (RCBZ01S);;                                              01520000
1/********************************************************************/ 01530000
 /* DB2 TABLE STRUCTURES                                             */ 01540000
 /********************************************************************/ 01550000
0DCL 1 TB_RCBV150,                                                      01560000
      %INCLUDE (RCB150S);;                                              01570000
 DCL 1 TB_RCBV150_I,                                                    01580000
      %INCLUDE (RCB150SI);;                                             01590000
0DCL 1 TB_RCBV280,                                                      01600000
      %INCLUDE (RCB280S);;                                              01610000
 DCL 1 TB_RCBV280_I,                                                    01620000
      %INCLUDE (RCB280SI);;                                             01630000
1/********************************************************************/ 01640000
 /*  BIT SWITCHES                                                    */ 01650000
 /********************************************************************/ 01660000
0DCL TRUE     BIT (1) INIT ('1'B);                                      01670000
 DCL FALSE    BIT (1) INIT ('0'B);                                      01680000
 DCL INV_ZIP_FOUND  BIT(1) INIT('0'B);                  /*C0005-0301 */ 01690000
 DCL MAIL_ZIP_FOUND BIT(1) INIT('0'B);                  /*C0005-0301 */ 01700000
0/********************************************************************/ 01710000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01720000
 /********************************************************************/ 01730000
0DCL 1 WORK_FIELDS,                                                     01740000
       3 WRK_LEVEL      FIXED BIN (15),                                 01750000
       3 WRK_INDNULL    FIXED BIN (15);                                 01760000
 /*ROWEST START*/                                                       01770000
0DCL FRLETTER  CHAR (7) INIT ('@{}¦\âêîôûäëïöü') ;                      01780000
0DCL GNLLETTER CHAR (7) INIT ('aeeucaeiouaeiuo') ;                      01790000
1/********************************************************************/ 01800000
 /* BUREG FILE / ARRAY                                               */ 01810000
 /********************************************************************/ 01820000
 DCL BUREG       FILE RECORD SEQUENTIAL INPUT;                          01830000
 DCL 1 Z_LECT           ,                                               01840000
     2 BU       CHAR(3),                                                01850000
     2 FILLER1  CHAR(1),                                                01860000
     2 REG      CHAR(2),                                                01870000
     2 FILLER2  CHAR(74);                                               01880000
 DCL PREM_FOIS    BIT(1) INIT('1'B) STATIC    ;                         01890000
 DCL R            DEC FIXED (3) INIT(0)       ;                         01900000
 DCL IMAX         DEC FIXED (3) INIT(0) STATIC;                         01910000
 DCL 1 TAB_BUREG(999)                   STATIC,                         01920000
     2 BU       CHAR(3)                     ,                           01930000
     2 REG      CHAR(2)                     ;                           01940000
  /*---------------------------- FLAGS -------------------------------*/01950000
  DCL EOF_BUREG         BIT(1) INIT ('0'B);                             01960000
1 DCL BU_TROUVE         BIT(1)            ;                             01970000
 /********************************************************************/ 01980000
 /*ROWEST END*/                                                         01990000
 /*RONORD START */                                                      02000000
 DCL X CHAR(40);        /*WORK VARIABLE FOR ADDRESS TRANSLATIONS     */ 02010000
 DCL J FIXED BIN(15);   /* WORK VARIABLE FOR SUBSCRIPT*/                02020000
 DCL Y FIXED BIN(15);   /* WORK VARIABLE FOR SUBSCRIPT*/                02030000
 DCL TEMP_LINES(5)      CHAR(40);      /* WORK VARIABLE FOR ADDRESSES*/ 02040000
 DCL ZZZ_ADDR_LINES(5)  CHAR(40) init (''); /* WORK VARIABLE FOR ADDR*/ 02050000
 DCL ADDRESS_TYPE        CHAR(1);                                       02060000
 /*RONORD END*/                                                         02070000
 /* ROSOUTH START */                                                    02080000
 DCL K FIXED BIN(15);                                                   02090000
 /* ROSOUTH END */                                                      02100000
1/********************************************************************/ 02110000
 /*  BUILTIN FUNCTIONS                                               */ 02120000
 /********************************************************************/ 02130000
0DCL (ADDR,                                                             02140000
      SUBSTR, LENGTH, PLIRETC, /* ROSOUTH */                            02150000
      TRANSLATE,                                                        02160000
      VERIFY,                                                           02170000
      NULL) BUILTIN;                                                    02180000
1/********************************************************************/ 02190000
 /* DB2/SQL SQLCA                                                    */ 02200000
 /********************************************************************/ 02210000
0 EXEC SQL                                                              02220000
    INCLUDE SQLCA                                                       02230000
    ;                                                                   02240000
 /*******************************************************************/  02250000
 /**** LOKALE DECLARATIONS - CENTRAL REGION                     *****/  02260000
 /*******************************************************************/  02270000
                               /* ALTERNATE DCL FOR FILE_EXTRA_INFO */  02280000
0DCL 1 FILE_EXTRA_INFO_X      BASED (PTR_FILE_EXTRA_INFO),              02290000
      3 DUMMY          CHAR(07),                                        02300000
      3 MAILING_A(9)   CHAR(30),                                        02310000
      3 INVOICE_A(9)   CHAR(30);                                        02320000
                                                                        02330000
 DCL SYSPRINT FILE PRINT;                                               02340000
                                                                        02350000
 DCL I BINARY FIXED(31) INITIAL(0);                 /* LOOP VARIABLE */ 02360000
1/********************************************************************/ 02370000
 /*                 S T A R T   P R O C E S S I N G                  */ 02380000
 /********************************************************************/ 02390000
0                                        /* SET LEVEL AND MOD NAME   */ 02400000
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            02410000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     02420000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBDS1U';                     02430000
0                                        /* USER DEFINED PROCESS     */ 02440000
 SWITCH_USER_EXIT = TRUE;                                               02450000
1/*******************************************************************/  02460000
 /* BEGIN COUNTRY SPECIFIC CODE                                     */  02470000
 /*******************************************************************/  02480000
                                                                        02490000
 SELECT (PARM_INT_AREA.COUNTRY_NUMBER) ;                                02500000
 /* NORTH - START ***************************************************/  02510000
   WHEN ('866') DO;          /**** START COUNTRY 866 = UK         ****/ 02520000
 /**/PUT SKIP LIST('866 USER EXIT RCBDS1U STARTS HERE') ;               02530000
                                       /* RETAIN-AREA IS SET TO '80' */ 02540000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '80';     /* IN ANY CASE   */ 02550000
                                                                        02560000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       02570000
                                                                        02580000
       THEN DO;               /**** HVP CUSTOMER - START          ****/ 02590000
                              /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */ 02600000
                              /* RECORD TO '076' IN ANY CASE.        */ 02610000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '076';                   02620000
                                                                        02630000
                              /* COPY CUSTOMER_NAME AND              */ 02640000
                              /*   MAILING LINES 1,2 TO              */ 02650000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 02660000
                              /*   RESPECTIVELY.                     */ 02670000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1) =       02680000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      02690000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       02700000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      02710000
                                                                        02720000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2) =       02730000
                                           MAILING_ADDRESS.ICUS1AD;     02740000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       02750000
                                           MAILING_ADDRESS.ICUS1AD;     02760000
                                                                        02770000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3) =       02780000
                                           MAILING_ADDRESS.ICUS2AD;     02790000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       02800000
                                           MAILING_ADDRESS.ICUS2AD;     02810000
                                                                        02820000
                                         /* SET LINES 4 AND 5 TO     */ 02830000
                                         /* BLANK, SO NO CRAP IN THEM*/ 02840000
                                                                        02850000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4) = '';   02860000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = '';   02870000
                                                                        02880000
 /**/PUT SKIP LIST('ADDRESS ENTRIES FOR HVP ADDRESSES') ;               02890000
 /**/PUT SKIP LIST('INVC_ADDR_1:'                                       02900000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1));             02910000
 /**/PUT SKIP LIST('INVC_ADDR_2:'                                       02920000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2));             02930000
 /**/PUT SKIP LIST('INVC_ADDR_3:'                                       02940000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3));             02950000
 /**/PUT SKIP LIST('MAIL_ADDR_1:'                                       02960000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1));             02970000
 /**/PUT SKIP LIST('MAIL_ADDR_2:'                                       02980000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2));             02990000
 /**/PUT SKIP LIST('MAIL_ADDR_3:'                                       03000000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3));             03010000
                                                                        03020000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 03030000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 03040000
                              /*   CALLING PROGRAM.                  */ 03050000
          END;                /**** HVP CUSTOMER - END            ****/ 03060000
                                                                        03070000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 03080000
                              /* FETCH RETAIN-BRANCH FROM OU-CODE    */ 03090000
                              /* AND COPY TO CCMS CUSTOMER RECORD    */ 03100000
                              /******** BEGIN C0048 - 1201   *********/ 03110000
             IF FILE_EXTRA_INFO.OU_CODE ¬= ''                           03120000
             THEN                                                       03130000
                PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH =                    03140000
                           '0'||SUBSTR(FILE_EXTRA_INFO.OU_CODE,2,2);    03150000
             ELSE                                                       03160000
                PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '019' ;            03170000
                                                                        03180000
                              /******** END   C0048 - 1201   *********/ 03190000
    /*AD     PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1) =    03200000
    ¦                             PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;   03210000
    ¦        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =    03220000
    ¦                             PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;   03230000
    ¦                                                                   03240000
    ¦        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2) =    03250000
    ¦                                         MAILING_ADDRESS.ICUS1AD;  03260000
    ¦        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =    03270000
 PUT IN TO                                    MAILING_ADDRESS.ICUS1AD;  03280000
 PUT ADDRS                                                              03290000
 LINE BACK   PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3) =    03300000
 IN                                           MAILING_ADDRESS.ICUS2AD;  03310000
    ¦        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =    03320000
    ¦                                         MAILING_ADDRESS.ICUS2AD;  03330000
    ¦                                                                   03340000
    ¦        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4) =    03350000
    ¦                                         MAILING_ADDRESS.ICUS3AD;  03360000
    ¦        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(4) =    03370000
    ¦                                         MAILING_ADDRESS.ICUS3AD;  03380000
    ¦                                                                   03390000
    ¦        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(5) =    03400000
    ¦                                         MAILING_ADDRESS.ICUS4AD;  03410000
    ¦        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) =    03420000
    ¦                                         MAILING_ADDRESS.ICUS4AD;  03430000
      AD*/                                                              03440000
 /*   ¦   ¦  PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(6) =    03450000
 ¦    ¦   ¦                                   MAILING_ADDRESS.ICUS5AD;  03460000
 ¦    ¦   ¦  PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(6) =    03470000
 JUST ¦   ¦                                   MAILING_ADDRESS.ICUS5AD;  03480000
 CUT  ¦   ¦                                                             03490000
 THIS ¦LOT¦  PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(7) =    03500000
 TO   ¦   ¦                                   MAILING_ADDRESS.ICUS6AD;  03510000
 REMOVE   ¦  PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(7) =    03520000
 COMMENTS ¦                                   MAILING_ADDRESS.ICUS6AD;  03530000
 USING THE¦                                                             03540000
 CLIPBOARD¦  PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(8) =    03550000
 ¦    ¦   ¦                                   MAILING_ADDRESS.ICUS7AD;  03560000
 ¦    ¦   ¦  PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(8) =    03570000
 ¦    ¦   ¦                                   MAILING_ADDRESS.ICUS7AD;  03580000
 ¦    ¦   ¦                                                             03590000
 ¦    ¦   ¦  PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(9) =    03600000
 ¦    ¦   ¦                                   MAILING_ADDRESS.ICUS8AD;  03610000
 ¦    ¦   ¦  PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(9) =    03620000
 ¦    ¦   ¦                                   MAILING_ADDRESS.ICUS8AD;  03630000
 ¦    ¦   ¦                                                             03640000
 ¦    ¦  */                                                             03650000
                                                                        03660000
 /**/PUT SKIP LIST('ADDRESS ENTRIES FOR BAU ADDRESSES') ;               03670000
 /**/PUT SKIP LIST('INVC_ADDR_1:'                                       03680000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1));             03690000
 /**/PUT SKIP LIST('INVC_ADDR_2:'                                       03700000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2));             03710000
 /**/PUT SKIP LIST('INVC_ADDR_3:'                                       03720000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3));             03730000
 /**/PUT SKIP LIST('INVC_ADDR_4:'                                       03740000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4));             03750000
 /**/PUT SKIP LIST('INVC_ADDR_5:'                                       03760000
 || PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(5));             03770000
 /**/PUT SKIP LIST('MAIL_ADDR_1:'                                       03780000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1));             03790000
 /**/PUT SKIP LIST('MAIL_ADDR_2:'                                       03800000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2));             03810000
 /**/PUT SKIP LIST('MAIL_ADDR_3:'                                       03820000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3));             03830000
 /**/PUT SKIP LIST('MAIL_ADDR_4:'                                       03840000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(4));             03850000
 /**/PUT SKIP LIST('MAIL_ADDR_5:'                                       03860000
 || PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5));             03870000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 03880000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 03890000
                /* ALSO THE ZIP-CODE.                                */ 03900000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 03910000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 03920000
 /****                                                                  03930000
             DO I = 1 TO 5:                                             03940000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 03950000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                03960000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) = 03970000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                03980000
             END;                                                       03990000
                                                                        04000000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    04010000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      04020000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            04030000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      04040000
  ****/                                                                 04050000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */04060000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */04070000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */04080000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */04090000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */04100000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/04110000
                           /* GOES TO CCMS ADDRESSLINE 1.             */04120000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */04130000
                                                                        04140000
  NORTHA:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE*/ 04150000
                IF VERIFY(SUBSTR(MAILING_A(I),1,5),'0123456789') = 0 |  04160000
                   SUBSTR(MAILING_A(I),3,2) = '  '                      04170000
                   THEN DO;                   /* ZIP-CODE LINE FOUND.*/ 04180000
                        MAILING_ADDRESS.ADDRESS_LINES(*) =              04190000
                                      MAILING_A(I);                     04200000
                        LEAVE NORTHA;                                   04210000
                        END;                                            04220000
             END;                                                       04230000
                                                                        04240000
  NORTHB:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE*/ 04250000
                IF VERIFY(SUBSTR(INVOICE_A(I),1,5),'0123456789') = 0 |  04260000
                   SUBSTR(INVOICE_A(I),3,2) = '  '                      04270000
                   THEN DO;                   /* ZIP-CODE LINE FOUND.*/ 04280000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              04290000
                                      INVOICE_A(I);                     04300000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              04310000
                                      INVOICE_A(I-1);                   04320000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              04330000
                                      INVOICE_A(1);                     04340000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               04350000
                           INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';      04360000
                        LEAVE NORTHB;                                   04370000
                        END;                                            04380000
             END;                                                       04390000
                                                                        04400000
          END;                /**** BAU CUSTOMER - END            ****/ 04410000
   END;                      /**** END   COUNTRY 866 = UK         ****/ 04420000
                                                                        04430000
 /*******************************************************************/  04440000
   WHEN ('754') DO;          /**** START COUNTRY 754 = IR         ****/ 04450000
       /**/PUT SKIP LIST('754 CALL TO RCBDS1U ***********************');04460000
       /**/PUT SKIP LIST('CUSTOMER_NUMBER:'||                           04470000
       /**/              PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER);         04480000
       /**/PUT SKIP LIST('');                                           04490000
                                       /* RETAIN-AREA IS SET TO '80' */ 04500000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '80';     /* IN ANY CASE   */ 04510000
                                                                        04520000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       04530000
                                                                        04540000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 04550000
                              /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */ 04560000
                              /* RECORD TO '076' IN ANY CASE.        */ 04570000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '076';                   04580000
                                                                        04590000
                              /* COPY CUSTOMER_NAME AND              */ 04600000
                              /*   MAILING LINES 1,2 TO              */ 04610000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 04620000
                              /*   RESPECTIVELY.                     */ 04630000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        04640000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       04650000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      04660000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        04670000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       04680000
                                           MAILING_ADDRESS.ICUS1AD;     04690000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        04700000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       04710000
                                           MAILING_ADDRESS.ICUS2AD;     04720000
                                         /* SET LINES 4 AND 5 TO     */ 04730000
                                         /* BLANK, SO NO CRAP IN THEM*/ 04740000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        04750000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 04760000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 04770000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 04780000
                              /*   CALLING PROGRAM.                  */ 04790000
          END;                /**** HVP CUSTOMER - END            ****/ 04800000
                                                                        04810000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 04820000
                              /* FETCH RETAIN-BRANCH FROM OU-CODE    */ 04830000
                              /* AND COPY TO CCMS CUSTOMER RECORD    */ 04840000
             /******** BEGIN C0051 - 0102   *********/                  04850000
             IF FILE_EXTRA_INFO.OU_CODE ¬= ''                           04860000
             THEN                                                       04870000
                PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH =                    04880000
                           '0'||SUBSTR(FILE_EXTRA_INFO.OU_CODE,2,2);    04890000
             ELSE                                                       04900000
                PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '001' ;            04910000
             /******** End   C0051 - 0102   *********/                  04920000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 04930000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 04940000
                /* ALSO THE ZIP-CODE.                                */ 04950000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 04960000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 04970000
 /****                                                                  04980000
             DO I = 1 TO 5:                                             04990000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 05000000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                05010000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) = 05020000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                05030000
             END;                                                       05040000
                                                                        05050000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    05060000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      05070000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            05080000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      05090000
  ****/                                                                 05100000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */05110000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */05120000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */05130000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */05140000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */05150000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/05160000
                           /* GOES TO CCMS ADDRESSLINE 1.             */05170000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */05180000
  NORTHC:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */05190000
                IF VERIFY(SUBSTR(MAILING_A(I),1,5),'0123456789') = 0 |  05200000
                   SUBSTR(MAILING_A(I),3,2) = '  '                      05210000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */05220000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              05230000
                                      MAILING_A(I);                     05240000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              05250000
                                      MAILING_A(I-1);                   05260000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              05270000
                                      MAILING_A(1);                     05280000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               05290000
                           MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';      05300000
                        LEAVE NORTHC;                                   05310000
                        END;                                            05320000
             END;                                                       05330000
                                                                        05340000
  NORTHD:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */05350000
                IF VERIFY(SUBSTR(INVOICE_A(I),1,5),'0123456789') = 0 |  05360000
                   SUBSTR(INVOICE_A(I),3,2) = '  '                      05370000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */05380000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              05390000
                                      INVOICE_A(I);                     05400000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              05410000
                                      INVOICE_A(I-1);                   05420000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              05430000
                                      INVOICE_A(1);                     05440000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               05450000
                           INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';      05460000
                        LEAVE NORTHD;                                   05470000
                        END;                                            05480000
             END;                                                       05490000
                                                                        05500000
          END;                /**** BAU CUSTOMER - END            ****/ 05510000
      /**/PUT SKIP LIST('END OF 754');                                  05520000
      /**/PUT SKIP LIST('');                                            05530000
   END;                      /**** END   COUNTRY 754 = IR         ****/ 05540000
 /********************************************************************/ 05550000
   WHEN ('788') DO;          /**** START COUNTRY 788 = NETHERLANS  ****/05560000
                                       /* RETAIN-AREA IS SET TO '88' */ 05570000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '87';     /* IN ANY CASE   */ 05580000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           05590000
    /* RECORD TO BLANKS IN ANY CASE.        */                          05600000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '';                      05610000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       05620000
                                                                        05630000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 05640000
                                                                        05650000
                              /* COPY CUSTOMER_NAME AND              */ 05660000
                              /*   MAILING LINES 1,2 TO              */ 05670000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 05680000
                              /*   RESPECTIVELY.                     */ 05690000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        05700000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       05710000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      05720000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        05730000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       05740000
                                           MAILING_ADDRESS.ICUS1AD;     05750000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        05760000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       05770000
                                           MAILING_ADDRESS.ICUS2AD;     05780000
                                         /* SET LINES 4 AND 5 TO     */ 05790000
                                         /* BLANK, SO NO CRAP IN THEM*/ 05800000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        05810000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 05820000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 05830000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 05840000
                              /*   CALLING PROGRAM.                  */ 05850000
          END;                /**** HVP CUSTOMER - END            ****/ 05860000
                                                                        05870000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 05880000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 05890000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 05900000
                /* ALSO THE ZIP-CODE.                                */ 05910000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 05920000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 05930000
 /****                                                                  05940000
             DO I = 1 TO 5:                                             05950000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 05960000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                05970000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 05980000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                05990000
             END;                                                       06000000
                                                                        06010000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    06020000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      06030000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            06040000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      06050000
  ****/                                                                 06060000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */06070000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */06080000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */06090000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */06100000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */06110000
                           /* GOES TO CCMS ADDRESSLINE 2 ONLY IF THE  */06120000
                           /* FIRST 7 CHARACTERS DONOT CONTAIN THE    */06130000
                           /* WORD 'Postbus'. IF THIS LINE CONTAINS   */06140000
                           /* 'Postbus' THEN THIS LINE IS SKIPPED AND */06150000
                           /* THE LINE BEFORE THIS LINE GOES TO  THE  */06160000
                           /* ADDRESSLINE 2.                          */06170000
                           /* ADRESSLINE 1 GOES TO CCMS ADDRESSLINE 1.*/06180000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */06190000
  NORTHE:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */06200000
                IF MAILING_A(I) ¬= ' ' THEN                             06210000
                 IF VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0 & 06220000
                    SUBSTR(MAILING_A(I),5,1) = ' '                      06230000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */06240000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              06250000
                                      MAILING_A(I);                     06260000
                        IF SUBSTR(MAILING_A(I-1),1,7) ¬= 'Postbus' THEN 06270000
                          MAILING_ADDRESS.ADDRESS_LINES(2) =            06280000
                                      MAILING_A(I-1);                   06290000
                        ELSE                                            06300000
                          MAILING_ADDRESS.ADDRESS_LINES(2) =            06310000
                                      MAILING_A(I-2);                   06320000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              06330000
                                      MAILING_A(1);                     06340000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               06350000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         06360000
                        LEAVE NORTHE;                                   06370000
                        END;                                            06380000
             END;                                                       06390000
                                                                        06400000
  NORTHF:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */06410000
                IF INVOICE_A(I) ¬= ' ' THEN                             06420000
                 IF VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0 & 06430000
                    SUBSTR(INVOICE_A(I),5,1) = ' '                      06440000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */06450000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              06460000
                                      INVOICE_A(I);                     06470000
                        IF SUBSTR(INVOICE_A(I-1),1,7) ¬= 'Postbus' THEN 06480000
                          INVOICE_ADDRESS.ADDRESS_LINES(2) =            06490000
                                      INVOICE_A(I-1);                   06500000
                        ELSE                                            06510000
                          INVOICE_ADDRESS.ADDRESS_LINES(2) =            06520000
                                      INVOICE_A(I-2);                   06530000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              06540000
                                      INVOICE_A(1);                     06550000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               06560000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         06570000
                        LEAVE NORTHF;                                   06580000
                        END;                                            06590000
             END;                                                       06600000
                                                                        06610000
          END;                /**** BAU CUSTOMER - END            ****/ 06620000
   END;                      /**** END   COUNTRY 788 = NETHERLANDS ****/06630000
 /*********************************************************************/06640000
   WHEN ('864') DO;          /**** START COUNTRY 864 = south africa****/06650000
                                       /* RETAIN-AREA IS SET TO '58' */ 06660000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '58';     /* IN ANY CASE   */ 06670000
       PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '689';                      06680000
                             /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */  06690000
                             /* RECORD TO 689 IN ANY CASE           */  06700000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       06710000
                                                                        06720000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 06730000
                                                                        06740000
                              /* COPY CUSTOMER_NAME AND              */ 06750000
                              /*   MAILING LINES 1,2 TO              */ 06760000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 06770000
                              /*   RESPECTIVELY.                     */ 06780000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        06790000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       06800000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      06810000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        06820000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       06830000
                                           MAILING_ADDRESS.ICUS1AD;     06840000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        06850000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       06860000
                                           MAILING_ADDRESS.ICUS2AD;     06870000
                                         /* SET LINES 4 AND 5 TO     */ 06880000
                                         /* BLANK, SO NO CRAP IN THEM*/ 06890000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        06900000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 06910000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 06920000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 06930000
                              /*   CALLING PROGRAM.                  */ 06940000
          END;                /**** HVP CUSTOMER - END            ****/ 06950000
                                                                        06960000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 06970000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 06980000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 06990000
                /* ALSO THE ZIP-CODE.                                */ 07000000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 07010000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 07020000
 /****                                                                  07030000
             DO I = 1 TO 5:                                             07040000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 07050000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                07060000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 07070000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                07080000
             END;                                                       07090000
                                                                        07100000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    07110000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      07120000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            07130000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      07140000
  ****/                                                                 07150000
  /* CCMS address line 1  Should contain SOF address line 3  */         07160000
  /* (street address).                                       */         07170000
  /* CCMS address line 2: Should contain SOF address line 4  */         07180000
  /* (building or office park)......or if blank or           */         07190000
  /* a value of B, should contain SOF address line 2.        */         07200000
  /* CCMS address line 3: Should contain SOF address line 2  */         07210000
  /* (suburb/town)if not used in above field already,Otherwise blank.*/ 07220000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              07230000
                                      MAILING_A(3);                     07240000
                 IF MAILING_A(4)='' |                                   07250000
                    MAILING_A(4) = 'B'                                  07260000
                        THEN DO;                                        07270000
                            MAILING_ADDRESS.ADDRESS_LINES(2) =          07280000
                                      MAILING_A(2);                     07290000
                            MAILING_ADDRESS.ADDRESS_LINES(3) = '';      07300000
                        END;                                            07310000
                 ELSE DO;                                               07320000
                            MAILING_ADDRESS.ADDRESS_LINES(2) =          07330000
                                      MAILING_A(4);                     07340000
                            MAILING_ADDRESS.ADDRESS_LINES(3) =          07350000
                                      MAILING_A(2);                     07360000
                 END;                                                   07370000
                 MAILING_ADDRESS.ADDRESS_LINES(4),                      07380000
                 MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';                07390000
                                                                        07400000
                                                                        07410000
                 INVOICE_ADDRESS.ADDRESS_LINES(1) =                     07420000
                       INVOICE_A(3);                                    07430000
                 IF INVOICE_A(4)='' |                                   07440000
                    INVOICE_A(4) = 'B'                                  07450000
                 THEN DO;                                               07460000
                            INVOICE_ADDRESS.ADDRESS_LINES(2) =          07470000
                                      INVOICE_A(2);                     07480000
                            INVOICE_ADDRESS.ADDRESS_LINES(3) = '';      07490000
                 END;                                                   07500000
                 ELSE DO;                                               07510000
                            INVOICE_ADDRESS.ADDRESS_LINES(2) =          07520000
                                      INVOICE_A(4);                     07530000
                            INVOICE_ADDRESS.ADDRESS_LINES(3) =          07540000
                                      INVOICE_A(2);                     07550000
                 END;                                                   07560000
                 INVOICE_ADDRESS.ADDRESS_LINES(4),                      07570000
                 INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';                07580000
                                                                        07590000
          END;                /**** BAU CUSTOMER - END            ****/ 07600000
   END;                      /**** END   COUNTRY 864 = SOUTH AFRICA ***/07610000
 /*********************************************************************/07620000
 /* NORTH - END *****************************************************/  07630000
    WHEN ('758') /*      ROSOUTH*/                                      07640000
       DO ;                                                             07650000
          CALL C758_PROCEDURE ; /* ROSOUTH */                           07660000
       END ;                                                            07670000
    WHEN ('822') /*      ROSOUTH*/                                      07680000
       DO ;                                                             07690000
          CALL C822_PROCEDURE ; /* ROSOUTH */                           07700000
       END ;                                                            07710000
    WHEN ('838') /*      ROSOUTH*/                                      07720000
       DO ;                                                             07730000
          CALL C838_PROCEDURE ; /* ROSOUTH */                           07740000
       END ;                                                            07750000
                 /*      ROSOUTH*/                                      07760000
                                                                        07770000
 /********************************************************************/ 07780000
 /*  FOR NORDIC REGION - COUNTRIES 846, 702, 678, 806                */ 07790000
 /*  FOUR DIFFERENT AREAS ARE TO BE PROCESSED BY THIS USER EXIT:     */ 07800000
 /*  1) RETAIN AREA               (COUNTRY-SPECIFIC)                 */ 07810000
 /*  2) RETAIN BRANCH             (   -   "   -    )                 */ 07820000
 /*  3) INVOICE ADDRESS           (COMMON FOR ALL 4 COUNTRIES)       */ 07830000
 /*  4) MAILING ADDRESS           (     -      "      -      )       */ 07840000
 /*                                                                  */ 07850000
 /*  RETAIN AREA AND RETAIN BRANCH FIELDS ASSIGNMENTS ARE INDEPENDENT*/ 07860000
 /*  OF CUSTOMER TYPE, BUT INVOICE AND MAILING ADDRESSES ASSIGNMENTS */ 07870000
 /*  ARE HANDLED DIFFERENTLY FOR BAU RESP. HVP CUSTOMERS.            */ 07880000
 /********************************************************************/ 07890000
    WHEN ('846')      /*   SWEDEN   */                                  07900000
       DO ;                                                             07910000
          /*   RETAIN AREA & RETAIN BRANCH                 */           07920000
          PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '59';                      07930000
          IF SUBSTR(FILE_EXTRA_INFO.OU_CODE,1,3) = ' '                  07940000
             THEN PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '130';           07950000
          ELSE PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH =                     07960000
             SUBSTR(FILE_EXTRA_INFO.OU_CODE,1,3);                       07970000
          SELECT(SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2));     07980000
             WHEN('SH') CALL SH_ADDRESSES; /*ADDR 4 SHRINKWRAP CUST */  07990000
             WHEN('DS') CALL SH_ADDRESSES; /*-----------"-----------*/  08000000
             OTHERWISE  CALL BAU_ADDRESSES;/*ADDR FOR BAU CUSTOMERS */  08010000
          END;                                                          08020000
       END ;                                                            08030000
    WHEN ('702')      /*   FINLAND  */                                  08040000
       DO ;                                                             08050000
          /*   RETAIN AREA & RETAIN BRANCH                 */           08060000
          PARM_FILE_RCBDSE0_CU.RETAIN_AREA   = '55';                    08070000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '130';                   08080000
          SELECT(SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2));     08090000
             WHEN('SH') CALL SH_ADDRESSES; /*ADDR 4 SHRINKWRAP CUST */  08100000
             WHEN('DS') CALL SH_ADDRESSES; /*-----------"-----------*/  08110000
             OTHERWISE  CALL BAU_ADDRESSES;/*ADDR FOR BAU CUSTOMERS */  08120000
          END;                                                          08130000
       END ;                                                            08140000
    WHEN ('678')      /*   DENMARK  */                                  08150000
       DO ;                                                             08160000
          /*   RETAIN AREA & RETAIN BRANCH                 */           08170000
          PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '54';                      08180000
          IF SUBSTR(FILE_EXTRA_INFO.OU_CODE,1,3) = ' '                  08190000
             THEN PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '678';           08200000
          ELSE PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '0' ||              08210000
             SUBSTR(FILE_EXTRA_INFO.OU_CODE,5,1) || '0';                08220000
          SELECT(SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2));     08230000
             WHEN('SH') CALL SH_ADDRESSES; /*ADDR 4 SHRINKWRAP CUST */  08240000
             WHEN('DS') CALL SH_ADDRESSES; /*-----------"-----------*/  08250000
             OTHERWISE  CALL BAU_ADDRESSES;/*ADDR FOR BAU CUSTOMERS */  08260000
          END;                                                          08270000
       END ;                                                            08280000
    WHEN ('806')      /*   NORWAY   */                                  08290000
       DO ;                                                             08300000
          /*   RETAIN AREA & RETAIN BRANCH                 */           08310000
          PARM_FILE_RCBDSE0_CU.RETAIN_AREA   = '57';                    08320000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '001';                   08330000
          SELECT(SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2));     08340000
             WHEN('SH') CALL SH_ADDRESSES; /*ADDR 4 SHRINKWRAP CUST */  08350000
             WHEN('DS') CALL SH_ADDRESSES; /*-----------"-----------*/  08360000
             OTHERWISE  CALL BAU_ADDRESSES;/*ADDR FOR BAU CUSTOMERS */  08370000
          END;                                                          08380000
       END ;                                                            08390000
 /*********************************************************************/08400000
 /*  END NORDIC REGION                                                */08410000
 /*********************************************************************/08420000
 /* CENTRAL REGION START   */                                           08430000
                                                                        08440000
   WHEN ('724') DO;          /**** START COUNTRY 724 = DEUTSCHLAND ****/08450000
                                       /* RETAIN-AREA IS SET TO '80' */ 08460000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '80';     /* IN ANY CASE   */ 08470000
                                                                        08480000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       08490000
                                                                        08500000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 08510000
                              /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */ 08520000
                              /* RECORD TO '076' IN ANY CASE.        */ 08530000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '076';                   08540000
                                                                        08550000
                              /* COPY CUSTOMER_NAME AND              */ 08560000
                              /*   MAILING LINES 1,2 TO              */ 08570000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 08580000
                              /*   RESPECTIVELY.                     */ 08590000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        08600000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       08610000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      08620000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        08630000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       08640000
                                           MAILING_ADDRESS.ICUS1AD;     08650000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        08660000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       08670000
                                           MAILING_ADDRESS.ICUS2AD;     08680000
                                         /* SET LINES 4 AND 5 TO     */ 08690000
                                         /* BLANK, SO NO CRAP IN THEM*/ 08700000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        08710000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 08720000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 08730000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 08740000
                              /*   CALLING PROGRAM.                  */ 08750000
          END;                /**** HVP CUSTOMER - END            ****/ 08760000
                                                                        08770000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 08780000
                              /* FETCH RETAIN-BRANCH FROM OU-CODE    */ 08790000
                              /* AND COPY TO CCMS CUSTOMER RECORD    */ 08800000
             PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH =                       08810000
                               SUBSTR(FILE_EXTRA_INFO.OU_CODE,5,3);     08820000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 08830000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 08840000
                /* ALSO THE ZIP-CODE.                                */ 08850000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 08860000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 08870000
 /****                                                                  08880000
             DO I = 1 TO 5:                                             08890000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 08900000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                08910000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) = 08920000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                08930000
             END;                                                       08940000
                                                                        08950000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    08960000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      08970000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            08980000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      08990000
  ****/                                                                 09000000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */09010000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */09020000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */09030000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */09040000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */09050000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/09060000
                           /* GOES TO CCMS ADDRESSLINE 1.             */09070000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */09080000
  LOOPAA:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */09090000
                IF MAILING_A(I) ¬= ' ' THEN                             09100000
                 IF VERIFY(SUBSTR(MAILING_A(I),1,5),'0123456789') = 0 | 09110000
                    SUBSTR(MAILING_A(I),3,2) = '  '                     09120000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */09130000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              09140000
                                      MAILING_A(I);                     09150000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              09160000
                                      MAILING_A(I-1);                   09170000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              09180000
                                      MAILING_A(1);                     09190000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               09200000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         09210000
                        LEAVE LOOPAA;                                   09220000
                        END;                                            09230000
             END;                                                       09240000
                                                                        09250000
  LOOPAB:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */09260000
                IF INVOICE_A(I) ¬= ' ' THEN                             09270000
                 IF VERIFY(SUBSTR(INVOICE_A(I),1,5),'0123456789') = 0 | 09280000
                    SUBSTR(INVOICE_A(I),3,2) = '  '                     09290000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */09300000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              09310000
                                      INVOICE_A(I);                     09320000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              09330000
                                      INVOICE_A(I-1);                   09340000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              09350000
                                      INVOICE_A(1);                     09360000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               09370000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         09380000
                        LEAVE LOOPAB;                                   09390000
                        END;                                            09400000
             END;                                                       09410000
                                                                        09420000
          END;                /**** BAU CUSTOMER - END            ****/ 09430000
   END;                      /**** END   COUNTRY 724 = DEUTSCHLAND ****/09440000
 /********************************************************************/ 09450000
   WHEN ('618') DO;          /**** START COUNTRY 618 = AUSTRIA     ****/09460000
                                       /* RETAIN-AREA IS SET TO '86' */ 09470000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '86';     /* IN ANY CASE   */ 09480000
                              /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */ 09490000
                              /* RECORD TO '090' IN ANY CASE.        */ 09500000
       PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '090';                      09510000
                                                                        09520000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       09530000
                                                                        09540000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 09550000
                              /* COPY CUSTOMER_NAME AND              */ 09560000
                              /*   MAILING LINES 1,2 TO              */ 09570000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 09580000
                              /*   RESPECTIVELY.                     */ 09590000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        09600000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       09610000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      09620000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        09630000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       09640000
                                           MAILING_ADDRESS.ICUS1AD;     09650000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        09660000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       09670000
                                           MAILING_ADDRESS.ICUS2AD;     09680000
                                         /* SET LINES 4 AND 5 TO     */ 09690000
                                         /* BLANK, SO NO CRAP IN THEM*/ 09700000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        09710000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 09720000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 09730000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 09740000
                              /*   CALLING PROGRAM.                  */ 09750000
          END;                /**** HVP CUSTOMER - END            ****/ 09760000
                                                                        09770000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 09780000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 09790000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 09800000
                /* ALSO THE ZIP-CODE.                                */ 09810000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 09820000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 09830000
 /****                                                                  09840000
             DO I = 1 TO 5:                                             09850000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 09860000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                09870000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) = 09880000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                09890000
             END;                                                       09900000
                                                                        09910000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    09920000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      09930000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            09940000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      09950000
  ****/                                                                 09960000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */09970000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */09980000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */09990000
                           /* IF FOUND THEN COPY THIS LINE CONCATENATE*/10000000
                           /* WITH NEXT LINE (REDUCED BLANKS) TO CCMS */10010000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */10020000
                           /* GOES TO CCMS ADDRESSLINE 2. INPUT LINE 1*/10030000
                           /* PLUS 2 GOES TO CCMS ADDRESSLINE 1.      */10040000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */10050000
  LOOPBA:    DO I = 9 TO 4 BY -1;    /* 4 IS LATEST LINE FOR ZIP-CODE */10060000
                IF VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0    10070000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */10080000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              10090000
                            SHORTEN(MAILING_A(I) || MAILING_A(I+1));    10100000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              10110000
                                      MAILING_A(I-1);                   10120000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              10130000
                            SHORTEN(MAILING_A(1) || MAILING_A(2));      10140000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               10150000
                           MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';      10160000
                        LEAVE LOOPBA;                                   10170000
                        END;                                            10180000
             END;                                                       10190000
                                                                        10200000
  LOOPBB:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */10210000
                IF VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0    10220000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */10230000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              10240000
                            SHORTEN(INVOICE_A(I) || INVOICE_A(I+1));    10250000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              10260000
                                      INVOICE_A(I-1);                   10270000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              10280000
                            SHORTEN(INVOICE_A(1) || INVOICE_A(2));      10290000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               10300000
                           INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';      10310000
                        LEAVE LOOPBB;                                   10320000
                        END;                                            10330000
             END;                                                       10340000
                                                                        10350000
          END;                /**** BAU CUSTOMER - END            ****/ 10360000
   END;                      /**** END   COUNTRY 618 = AUSTRIA     ****/10370000
 /********************************************************************/ 10380000
   WHEN ('848') DO;          /**** START COUNTRY 848 = SCHWEIZ    ****/ 10390000
                                       /* RETAIN-AREA IS SET TO '89' */ 10400000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '89';     /* IN ANY CASE   */ 10410000
                                                                        10420000
                                                                        10430000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       10440000
                                                                        10450000
          THEN DO;  /********************START************************/ 10460000
                    /**** HVP CUSTOMER - / ODER PRIME INPUT KUNDE ****/ 10470000
                    /*************************************************/ 10480000
                              /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */ 10490000
                              /* RECORD TO '210' IN ANY CASE.        */ 10500000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '210';                   10510000
                              /* COPY CUSTOMER_NAME AND              */ 10520000
                              /*   MAILING LINES 1,2 TO              */ 10530000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 10540000
                              /*   RESPECTIVELY.                     */ 10550000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        10560000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       10570000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      10580000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        10590000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       10600000
                                           MAILING_ADDRESS.ICUS1AD;     10610000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        10620000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       10630000
                                           MAILING_ADDRESS.ICUS2AD;     10640000
                                         /* SET LINES 4 AND 5 TO     */ 10650000
                                         /* BLANK, SO NO CRAP IN THEM*/ 10660000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        10670000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 10680000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 10690000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 10700000
                              /*   CALLING PROGRAM.                  */ 10710000
          END;                /**** HVP CUSTOMER - END            ****/ 10720000
                                                                        10730000
          ELSE DO;  /********************START************************/ 10740000
                    /**** BAU CUSTOMER - / ODER CUSTOMER-RD KUNDE ??**/ 10750000
                    /*************************************************/ 10760000
                                       /* DEUTSCHE SCHWEIZ           */ 10770000
                                       /* ALREADY SET AS DEFAULT     */ 10780000
         /*  IF SUBSTR(FILE_EXTRA_INFO.OU_CODE,2,3) = '211'          */ 10790000
         /*   | SUBSTR(FILE_EXTRA_INFO.OU_CODE,2,3) = '212'          */ 10800000
         /*     THEN PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '89';        */ 10810000
                                                                        10820000
                                       /* ITALIENISCHE SCHWEIZ       */ 10830000
             IF SUBSTR(FILE_EXTRA_INFO.OU_CODE,2,3) = '252'             10840000
                THEN PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '52';           10850000
                                                                        10860000
                                       /* FRANZOESISCHE SCHWEIZ       */10870000
             IF SUBSTR(FILE_EXTRA_INFO.OU_CODE,2,3) = '292'             10880000
                THEN PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '92';           10890000
                                                                        10900000
             PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH =                       10910000
                               SUBSTR(FILE_EXTRA_INFO.OU_CODE,2,3);     10920000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 10930000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 10940000
                /* ALSO THE ZIP-CODE.                                */ 10950000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */10960000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */10970000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */10980000
                           /* IF FOUND THEN COPY THIS LINE TO         */10990000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */11000000
                           /* GOES TO CCMS ADDRESSLINE 2. INPUT LINE 1*/11010000
                           /* GOES TO CCMS ADDRESSLINE 1.             */11020000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED.  */11030000
  LOOPBC:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */11040000
                IF VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0    11050000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */11060000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              11070000
                                                        MAILING_A(I);   11080000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              11090000
                                                        MAILING_A(I-1); 11100000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              11110000
                                                        MAILING_A(1);   11120000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               11130000
                           MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';      11140000
                        LEAVE LOOPBC;                                   11150000
                        END;                                            11160000
             END;                                                       11170000
                                                                        11180000
  LOOPBD:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */11190000
                IF VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0    11200000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */11210000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              11220000
                                                        INVOICE_A(I);   11230000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              11240000
                                                        INVOICE_A(I-1); 11250000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              11260000
                                                        INVOICE_A(1);   11270000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               11280000
                           INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';      11290000
                        LEAVE LOOPBD;                                   11300000
                        END;                                            11310000
             END;                                                       11320000
                                                                        11330000
          END;                /**** BAU CUSTOMER - END            ****/ 11340000
   END;                      /**** END   COUNTRY 848 = SCHWEIZ     ****/11350000
                                                                        11360000
   WHEN ('644') DO;          /**** START COUNTRY 644 = BULGARIA    ****/11370000
                                       /* RETAIN-AREA IS SET TO '88' */ 11380000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 11390000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           11400000
    /* RECORD TO '644' IN ANY CASE.        */                           11410000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '644';                   11420000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       11430000
                                                                        11440000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 11450000
                                                                        11460000
                              /* COPY CUSTOMER_NAME AND              */ 11470000
                              /*   MAILING LINES 1,2 TO              */ 11480000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 11490000
                              /*   RESPECTIVELY.                     */ 11500000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        11510000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       11520000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      11530000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        11540000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       11550000
                                           MAILING_ADDRESS.ICUS1AD;     11560000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        11570000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       11580000
                                           MAILING_ADDRESS.ICUS2AD;     11590000
                                         /* SET LINES 4 AND 5 TO     */ 11600000
                                         /* BLANK, SO NO CRAP IN THEM*/ 11610000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        11620000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 11630000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 11640000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 11650000
                              /*   CALLING PROGRAM.                  */ 11660000
          END;                /**** HVP CUSTOMER - END            ****/ 11670000
                                                                        11680000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 11690000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 11700000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 11710000
                /* ALSO THE ZIP-CODE.                                */ 11720000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 11730000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 11740000
 /****                                                                  11750000
             DO I = 1 TO 5:                                             11760000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 11770000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                11780000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 11790000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                11800000
             END;                                                       11810000
                                                                        11820000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    11830000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      11840000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            11850000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      11860000
  ****/                                                                 11870000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */11880000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */11890000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */11900000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */11910000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */11920000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/11930000
                           /* GOES TO CCMS ADDRESSLINE 1.             */11940000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */11950000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */11960000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */11970000
                           /* GOES TO CCMS ADDRESSLINE 3              */11980000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */11990000
                           /* IN ANY CASE.                            */12000000
             MAIL_ZIP_FOUND = '0'B;                                     12010000
  LOOPCA:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */12020000
                IF MAILING_A(I) ¬= ' ' THEN                             12030000
                 IF VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0 & 12040000
                    SUBSTR(MAILING_A(I),5,1) = ' '                      12050000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */12060000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              12070000
                                      MAILING_A(I);                     12080000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              12090000
                                      MAILING_A(I-1);                   12100000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              12110000
                                      MAILING_A(1);                     12120000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               12130000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         12140000
                        MAIL_ZIP_FOUND = '1'B;                          12150000
                        LEAVE LOOPCA;                                   12160000
                        END;                                            12170000
             END;                                                       12180000
             IF ¬MAIL_ZIP_FOUND       /*** ZIP-CODE LINE NOT FOUND */   12190000
               THEN DO;                                                 12200000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              12210000
                                      MAILING_A(3);                     12220000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              12230000
                                      MAILING_A(2);                     12240000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              12250000
                                      MAILING_A(1);                     12260000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               12270000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         12280000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    12290000
             INV_ZIP_FOUND = '0'B;                                      12300000
  LOOPCB:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */12310000
                IF INVOICE_A(I) ¬= ' ' THEN                             12320000
                 IF VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0 & 12330000
                    SUBSTR(INVOICE_A(I),5,1) = ' '                      12340000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */12350000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              12360000
                                      INVOICE_A(I);                     12370000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              12380000
                                      INVOICE_A(I-1);                   12390000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              12400000
                                      INVOICE_A(1);                     12410000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               12420000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         12430000
                        INV_ZIP_FOUND = '1'B;                           12440000
                        LEAVE LOOPCB;                                   12450000
                        END;                                            12460000
             END;                                                       12470000
             IF ¬INV_ZIP_FOUND     /*** ZIP-CODE LINE NOT FOUND *****/  12480000
                 THEN DO;                                               12490000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              12500000
                                      INVOICE_A(3);                     12510000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              12520000
                                      INVOICE_A(2);                     12530000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              12540000
                                      INVOICE_A(1);                     12550000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               12560000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         12570000
                 END;         /*** ZIP- CODE LINE NOT FOUND - END  ****/12580000
                                                                        12590000
          END;                /**** BAU CUSTOMER - END             ****/12600000
   END;                      /**** END   COUNTRY 644 = BULGARIA    ****/12610000
 /*********************************************************************/12620000
   WHEN ('668') DO;    /**** START COUNTRY 668 = CZECH REPUBLIC */      12630000
                                       /* RETAIN-AREA IS SET TO '88' */ 12640000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 12650000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           12660000
    /* RECORD TO '668' IN ANY CASE.        */                           12670000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '668';                   12680000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       12690000
                                                                        12700000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 12710000
                                                                        12720000
                              /* COPY CUSTOMER_NAME AND              */ 12730000
                              /*   MAILING LINES 1,2 TO              */ 12740000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 12750000
                              /*   RESPECTIVELY.                     */ 12760000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        12770000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       12780000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      12790000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        12800000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       12810000
                                           MAILING_ADDRESS.ICUS1AD;     12820000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        12830000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       12840000
                                           MAILING_ADDRESS.ICUS2AD;     12850000
                                         /* SET LINES 4 AND 5 TO     */ 12860000
                                         /* BLANK, SO NO CRAP IN THEM*/ 12870000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        12880000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 12890000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 12900000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 12910000
                              /*   CALLING PROGRAM.                  */ 12920000
          END;                /**** HVP CUSTOMER - END            ****/ 12930000
                                                                        12940000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 12950000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 12960000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 12970000
                /* ALSO THE ZIP-CODE.                                */ 12980000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 12990000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 13000000
 /****                                                                  13010000
             DO I = 1 TO 5:                                             13020000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 13030000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                13040000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 13050000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                13060000
             END;                                                       13070000
                                                                        13080000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    13090000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      13100000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            13110000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      13120000
  ****/                                                                 13130000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */13140000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */13150000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */13160000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */13170000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */13180000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/13190000
                           /* GOES TO CCMS ADDRESSLINE 1.             */13200000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */13210000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */13220000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */13230000
                           /* GOES TO CCMS ADDRESSLINE 3              */13240000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */13250000
                           /* IN ANY CASE.                            */13260000
             MAIL_ZIP_FOUND = '0'B;                                     13270000
  LOOPCC:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */13280000
                IF MAILING_A(I) ¬= ' ' THEN                             13290000
                 IF VERIFY(SUBSTR(MAILING_A(I),1,3),'0123456789') = 0 & 13300000
                    VERIFY(SUBSTR(MAILING_A(I),5,2),'0123456789') = 0 & 13310000
                    SUBSTR(MAILING_A(I),4,1) = ' '                      13320000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */13330000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              13340000
                                      MAILING_A(I);                     13350000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              13360000
                                      MAILING_A(I-1);                   13370000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              13380000
                                      MAILING_A(1);                     13390000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               13400000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         13410000
                        MAIL_ZIP_FOUND = '1'B;                          13420000
                        LEAVE LOOPCC;                                   13430000
                        END;                                            13440000
             END;                                                       13450000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  13460000
               THEN DO;                                                 13470000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              13480000
                                      MAILING_A(3);                     13490000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              13500000
                                      MAILING_A(2);                     13510000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              13520000
                                      MAILING_A(1);                     13530000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               13540000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         13550000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    13560000
                                                                        13570000
             INV_ZIP_FOUND = '0'B;                                      13580000
  LOOPCD:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */13590000
                IF INVOICE_A(I) ¬= ' ' THEN                             13600000
                 IF VERIFY(SUBSTR(INVOICE_A(I),1,3),'0123456789') = 0 & 13610000
                    VERIFY(SUBSTR(INVOICE_A(I),5,2),'0123456789') = 0 & 13620000
                    SUBSTR(INVOICE_A(I),4,1) = ' '                      13630000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */13640000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              13650000
                                      INVOICE_A(I);                     13660000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              13670000
                                      INVOICE_A(I-1);                   13680000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              13690000
                                      INVOICE_A(1);                     13700000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               13710000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         13720000
                        INV_ZIP_FOUND = '1'B;                           13730000
                        LEAVE LOOPCD;                                   13740000
                        END;                                            13750000
             END;                                                       13760000
                                                                        13770000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   13780000
                 THEN DO;                                               13790000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              13800000
                                      INVOICE_A(3);                     13810000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              13820000
                                      INVOICE_A(2);                     13830000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              13840000
                                      INVOICE_A(1);                     13850000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               13860000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         13870000
                 END;         /*** ZIP- CODE LINE NOT FOUND - END  ****/13880000
                                                                        13890000
          END;                /**** BAU CUSTOMER - END             ****/13900000
   END;                      /**** END   COUNTRY 668 = CZECH REPUBLIC */13910000
 /*********************************************************************/13920000
   WHEN ('693') DO;    /**** START COUNTRY 693 = SLOVAKIA    ****/      13930000
                                                                        13940000
                                       /* RETAIN-AREA IS SET TO '88' */ 13950000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 13960000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           13970000
    /* RECORD TO '693' IN ANY CASE.        */                           13980000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '693';                   13990000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       14000000
                                                                        14010000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 14020000
                                                                        14030000
                              /* COPY CUSTOMER_NAME AND              */ 14040000
                              /*   MAILING LINES 1,2 TO              */ 14050000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 14060000
                              /*   RESPECTIVELY.                     */ 14070000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        14080000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       14090000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      14100000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        14110000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       14120000
                                           MAILING_ADDRESS.ICUS1AD;     14130000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        14140000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       14150000
                                           MAILING_ADDRESS.ICUS2AD;     14160000
                                         /* SET LINES 4 AND 5 TO     */ 14170000
                                         /* BLANK, SO NO CRAP IN THEM*/ 14180000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        14190000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 14200000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 14210000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 14220000
                              /*   CALLING PROGRAM.                  */ 14230000
          END;                /**** HVP CUSTOMER - END            ****/ 14240000
                                                                        14250000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 14260000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 14270000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 14280000
                /* ALSO THE ZIP-CODE.                                */ 14290000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 14300000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 14310000
 /****                                                                  14320000
             DO I = 1 TO 5:                                             14330000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 14340000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                14350000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 14360000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                14370000
             END;                                                       14380000
                                                                        14390000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    14400000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      14410000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            14420000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      14430000
  ****/                                                                 14440000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */14450000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */14460000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */14470000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */14480000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */14490000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/14500000
                           /* GOES TO CCMS ADDRESSLINE 1.             */14510000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */14520000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */14530000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */14540000
                           /* GOES TO CCMS ADDRESSLINE 3              */14550000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */14560000
                           /* IN ANY CASE.                            */14570000
             MAIL_ZIP_FOUND = '0'B;                                     14580000
  LOOPCE:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */14590000
                IF MAILING_A(I) ¬= ' ' THEN                             14600000
                 IF VERIFY(SUBSTR(MAILING_A(I),1,3),'0123456789') = 0 & 14610000
                    VERIFY(SUBSTR(MAILING_A(I),5,2),'0123456789') = 0 & 14620000
                    SUBSTR(MAILING_A(I),4,1) = ' '                      14630000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */14640000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              14650000
                                      MAILING_A(I);                     14660000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              14670000
                                      MAILING_A(I-1);                   14680000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              14690000
                                      MAILING_A(1);                     14700000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               14710000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         14720000
                        MAIL_ZIP_FOUND = '1'B;                          14730000
                        LEAVE LOOPCE;                                   14740000
                        END;                                            14750000
             END;                                                       14760000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  14770000
               THEN DO;                                                 14780000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              14790000
                                      MAILING_A(3);                     14800000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              14810000
                                      MAILING_A(2);                     14820000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              14830000
                                      MAILING_A(1);                     14840000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               14850000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         14860000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    14870000
                                                                        14880000
             INV_ZIP_FOUND = '0'B;                                      14890000
  LOOPCF:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */14900000
                IF INVOICE_A(I) ¬= ' ' THEN                             14910000
                 IF VERIFY(SUBSTR(INVOICE_A(I),1,3),'0123456789') = 0 & 14920000
                    VERIFY(SUBSTR(INVOICE_A(I),5,2),'0123456789') = 0 & 14930000
                    SUBSTR(INVOICE_A(I),4,1) = ' '                      14940000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */14950000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              14960000
                                      INVOICE_A(I);                     14970000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              14980000
                                      INVOICE_A(I-1);                   14990000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              15000000
                                      INVOICE_A(1);                     15010000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               15020000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         15030000
                        INV_ZIP_FOUND = '1'B;                           15040000
                        LEAVE LOOPCF;                                   15050000
                        END;                                            15060000
             END;                                                       15070000
                                                                        15080000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   15090000
                 THEN DO;                                               15100000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              15110000
                                      INVOICE_A(3);                     15120000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              15130000
                                      INVOICE_A(2);                     15140000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              15150000
                                      INVOICE_A(1);                     15160000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               15170000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         15180000
                 END;         /*** ZIP- CODE LINE NOT FOUND - END  ****/15190000
                                                                        15200000
          END;                /**** BAU CUSTOMER - END             ****/15210000
   END;                       /**** END   COUNTRY 693 = SLOVAKIA   ****/15220000
   /*******************************************************************/15230000
   WHEN ('704') DO;          /**** START COUNTRY 704 = CROATIA     ****/15240000
                                       /* RETAIN-AREA IS SET TO '88' */ 15250000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 15260000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           15270000
    /* RECORD TO '704' IN ANY CASE.        */                           15280000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '704';                   15290000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       15300000
                                                                        15310000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 15320000
                                                                        15330000
                              /* COPY CUSTOMER_NAME AND              */ 15340000
                              /*   MAILING LINES 1,2 TO              */ 15350000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 15360000
                              /*   RESPECTIVELY.                     */ 15370000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        15380000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       15390000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      15400000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        15410000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       15420000
                                           MAILING_ADDRESS.ICUS1AD;     15430000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        15440000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       15450000
                                           MAILING_ADDRESS.ICUS2AD;     15460000
                                         /* SET LINES 4 AND 5 TO     */ 15470000
                                         /* BLANK, SO NO CRAP IN THEM*/ 15480000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        15490000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 15500000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 15510000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 15520000
                              /*   CALLING PROGRAM.                  */ 15530000
          END;                /**** HVP CUSTOMER - END            ****/ 15540000
                                                                        15550000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 15560000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 15570000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 15580000
                /* ALSO THE ZIP-CODE.                                */ 15590000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 15600000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 15610000
 /****                                                                  15620000
             DO I = 1 TO 5:                                             15630000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 15640000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                15650000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 15660000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                15670000
             END;                                                       15680000
                                                                        15690000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    15700000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      15710000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            15720000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      15730000
  ****/                                                                 15740000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */15750000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */15760000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */15770000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */15780000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */15790000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/15800000
                           /* GOES TO CCMS ADDRESSLINE 1.             */15810000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */15820000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */15830000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */15840000
                           /* GOES TO CCMS ADDRESSLINE 3              */15850000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */15860000
                           /* IN ANY CASE.                            */15870000
             MAIL_ZIP_FOUND = '0'B;                                     15880000
  LOOPCG:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */15890000
                IF MAILING_A(I) ¬= ' ' THEN                             15900000
                 IF (VERIFY(SUBSTR(MAILING_A(I),1,5),'0123456789') = 0 &15910000
                     SUBSTR(MAILING_A(I),6,1) = ' ')|                   15920000
                    (VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0 &15930000
                     SUBSTR(MAILING_A(I),5,1) = ' ')                    15940000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */15950000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              15960000
                                      MAILING_A(I);                     15970000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              15980000
                                      MAILING_A(I-1);                   15990000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              16000000
                                      MAILING_A(1);                     16010000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               16020000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         16030000
                        MAIL_ZIP_FOUND = '1'B;                          16040000
                        LEAVE LOOPCG;                                   16050000
                        END;                                            16060000
             END;                                                       16070000
                                                                        16080000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  16090000
               THEN DO;                                                 16100000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              16110000
                                      MAILING_A(3);                     16120000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              16130000
                                      MAILING_A(2);                     16140000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              16150000
                                      MAILING_A(1);                     16160000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               16170000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         16180000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    16190000
                                                                        16200000
             INV_ZIP_FOUND = '0'B;                                      16210000
  LOOPCH:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */16220000
                IF INVOICE_A(I) ¬= ' ' THEN                             16230000
                 IF (VERIFY(SUBSTR(INVOICE_A(I),1,5),'0123456789') = 0 &16240000
                     SUBSTR(INVOICE_A(I),6,1) = ' ')|                   16250000
                    (VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0 &16260000
                     SUBSTR(INVOICE_A(I),5,1) = ' ')                    16270000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */16280000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              16290000
                                      INVOICE_A(I);                     16300000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              16310000
                                      INVOICE_A(I-1);                   16320000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              16330000
                                      INVOICE_A(1);                     16340000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               16350000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         16360000
                        INV_ZIP_FOUND = '1'B;                           16370000
                        LEAVE LOOPCH;                                   16380000
                        END;                                            16390000
             END;                                                       16400000
                                                                        16410000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   16420000
                 THEN DO;                                               16430000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              16440000
                                      INVOICE_A(3);                     16450000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              16460000
                                      INVOICE_A(2);                     16470000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              16480000
                                      INVOICE_A(1);                     16490000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               16500000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         16510000
                 END;        /*** ZIP- CODE LINE NOT FOUND - END  ****/ 16520000
                                                                        16530000
          END;                /**** BAU CUSTOMER - END            ****/ 16540000
   END;                      /**** END   COUNTRY 704 = CROATIA    ****/ 16550000
 /*********************************************************************/16560000
   WHEN ('708') DO;          /**** START COUNTRY 708 = SLOVENIA    ****/16570000
                                       /* RETAIN-AREA IS SET TO '88' */ 16580000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 16590000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           16600000
    /* RECORD TO '708' IN ANY CASE.        */                           16610000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '708';                   16620000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       16630000
                                                                        16640000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 16650000
                                                                        16660000
                              /* COPY CUSTOMER_NAME AND              */ 16670000
                              /*   MAILING LINES 1,2 TO              */ 16680000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 16690000
                              /*   RESPECTIVELY.                     */ 16700000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        16710000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       16720000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      16730000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        16740000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       16750000
                                           MAILING_ADDRESS.ICUS1AD;     16760000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        16770000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       16780000
                                           MAILING_ADDRESS.ICUS2AD;     16790000
                                         /* SET LINES 4 AND 5 TO     */ 16800000
                                         /* BLANK, SO NO CRAP IN THEM*/ 16810000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        16820000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 16830000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 16840000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 16850000
                              /*   CALLING PROGRAM.                  */ 16860000
          END;                /**** HVP CUSTOMER - END            ****/ 16870000
                                                                        16880000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 16890000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 16900000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 16910000
                /* ALSO THE ZIP-CODE.                                */ 16920000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 16930000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 16940000
 /****                                                                  16950000
             DO I = 1 TO 5:                                             16960000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 16970000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                16980000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 16990000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                17000000
             END;                                                       17010000
                                                                        17020000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    17030000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      17040000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            17050000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      17060000
  ****/                                                                 17070000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */17080000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */17090000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */17100000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */17110000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */17120000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/17130000
                           /* GOES TO CCMS ADDRESSLINE 1.             */17140000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */17150000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */17160000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */17170000
                           /* GOES TO CCMS ADDRESSLINE 3              */17180000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */17190000
                           /* IN ANY CASE.                            */17200000
             MAIL_ZIP_FOUND = '0'B;                                     17210000
  LOOPCI:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */17220000
                IF MAILING_A(I) ¬= ' ' THEN                             17230000
                 IF (VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0 &17240000
                     SUBSTR(MAILING_A(I),5,1) = ' ')|                   17250000
                    (VERIFY(SUBSTR(MAILING_A(I),3,4),'0123456789') = 0 &17260000
                     SUBSTR(MAILING_A(I),7,1) = ' ')                    17270000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */17280000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              17290000
                                      MAILING_A(I);                     17300000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              17310000
                                      MAILING_A(I-1);                   17320000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              17330000
                                      MAILING_A(1);                     17340000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               17350000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         17360000
                        MAIL_ZIP_FOUND = '1'B;                          17370000
                        LEAVE LOOPCI;                                   17380000
                        END;                                            17390000
             END;                                                       17400000
                                                                        17410000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  17420000
               THEN DO;                                                 17430000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              17440000
                                      MAILING_A(3);                     17450000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              17460000
                                      MAILING_A(2);                     17470000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              17480000
                                      MAILING_A(1);                     17490000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               17500000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         17510000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    17520000
                                                                        17530000
             INV_ZIP_FOUND = '0'B;                                      17540000
  LOOPCJ:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */17550000
                IF INVOICE_A(I) ¬= ' ' THEN                             17560000
                 IF (VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0 &17570000
                     SUBSTR(INVOICE_A(I),5,1) = ' ')|                   17580000
                    (VERIFY(SUBSTR(INVOICE_A(I),3,4),'0123456789') = 0 &17590000
                     SUBSTR(INVOICE_A(I),7,1) = ' ')                    17600000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */17610000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              17620000
                                      INVOICE_A(I);                     17630000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              17640000
                                      INVOICE_A(I-1);                   17650000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              17660000
                                      INVOICE_A(1);                     17670000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               17680000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         17690000
                        INV_ZIP_FOUND = '1'B;                           17700000
                        LEAVE LOOPCJ;                                   17710000
                        END;                                            17720000
             END;                                                       17730000
                                                                        17740000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   17750000
                 THEN DO;                                               17760000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              17770000
                                      INVOICE_A(3);                     17780000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              17790000
                                      INVOICE_A(2);                     17800000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              17810000
                                      INVOICE_A(1);                     17820000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               17830000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         17840000
                 END;        /*** ZIP- CODE LINE NOT FOUND - END  ****/ 17850000
                                                                        17860000
          END;                /**** BAU CUSTOMER - END            ****/ 17870000
   END;                      /**** END   COUNTRY 708 = SLOVENIA    ****/17880000
 /*********************************************************************/17890000
   WHEN ('740') DO;          /**** START COUNTRY 740 = HUNGARY     ****/17900000
                                       /* RETAIN-AREA IS SET TO '88' */ 17910000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 17920000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           17930000
    /* RECORD TO '740' IN ANY CASE.        */                           17940000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '740';                   17950000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       17960000
                                                                        17970000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 17980000
                                                                        17990000
                              /* COPY CUSTOMER_NAME AND              */ 18000000
                              /*   MAILING LINES 1,2 TO              */ 18010000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 18020000
                              /*   RESPECTIVELY.                     */ 18030000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        18040000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       18050000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      18060000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        18070000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       18080000
                                           MAILING_ADDRESS.ICUS1AD;     18090000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        18100000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       18110000
                                           MAILING_ADDRESS.ICUS2AD;     18120000
                                         /* SET LINES 4 AND 5 TO     */ 18130000
                                         /* BLANK, SO NO CRAP IN THEM*/ 18140000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        18150000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 18160000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 18170000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 18180000
                              /*   CALLING PROGRAM.                  */ 18190000
          END;                /**** HVP CUSTOMER - END            ****/ 18200000
                                                                        18210000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 18220000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 18230000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 18240000
                /* ALSO THE ZIP-CODE.                                */ 18250000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 18260000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 18270000
 /****                                                                  18280000
             DO I = 1 TO 5:                                             18290000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 18300000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                18310000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 18320000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                18330000
             END;                                                       18340000
                                                                        18350000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    18360000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      18370000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            18380000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      18390000
  ****/                                                                 18400000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */18410000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */18420000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */18430000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */18440000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */18450000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/18460000
                           /* GOES TO CCMS ADDRESSLINE 1.             */18470000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */18480000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */18490000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */18500000
                           /* GOES TO CCMS ADDRESSLINE 3              */18510000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */18520000
                           /* IN ANY CASE.                            */18530000
             MAIL_ZIP_FOUND = '0'B;                                     18540000
  LOOPCK:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */18550000
                IF MAILING_A(I) ¬= ' ' THEN                             18560000
                 IF (SUBSTR(MAILING_A(I),1,2) = 'H-' &                  18570000
                     SUBSTR(MAILING_A(I),7,1) = ' ')|                   18580000
                    (VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0 &18590000
                     SUBSTR(MAILING_A(I),5,1) = ' ' )                   18600000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */18610000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              18620000
                                      MAILING_A(I);                     18630000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              18640000
                                      MAILING_A(I-1);                   18650000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              18660000
                                      MAILING_A(1);                     18670000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               18680000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         18690000
                        MAIL_ZIP_FOUND = '1'B;                          18700000
                        LEAVE LOOPCK;                                   18710000
                        END;                                            18720000
             END;                                                       18730000
                                                                        18740000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  18750000
               THEN DO;                                                 18760000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              18770000
                                      MAILING_A(3);                     18780000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              18790000
                                      MAILING_A(2);                     18800000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              18810000
                                      MAILING_A(1);                     18820000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               18830000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         18840000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    18850000
                                                                        18860000
             INV_ZIP_FOUND = '0'B;                                      18870000
  LOOPCL:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */18880000
                IF INVOICE_A(I) ¬= ' ' THEN                             18890000
                 IF (SUBSTR(INVOICE_A(I),1,2) = 'H-' &                  18900000
                     SUBSTR(INVOICE_A(I),7,1) = ' ')|                   18910000
                    (VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0 &18920000
                     SUBSTR(INVOICE_A(I),5,1) = ' ')                    18930000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */18940000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              18950000
                                      INVOICE_A(I);                     18960000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              18970000
                                      INVOICE_A(I-1);                   18980000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              18990000
                                      INVOICE_A(1);                     19000000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               19010000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         19020000
                        INV_ZIP_FOUND = '1'B;                           19030000
                        LEAVE LOOPCL;                                   19040000
                        END;                                            19050000
             END;                                                       19060000
                                                                        19070000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   19080000
                 THEN DO;                                               19090000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              19100000
                                      INVOICE_A(3);                     19110000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              19120000
                                      INVOICE_A(2);                     19130000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              19140000
                                      INVOICE_A(1);                     19150000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               19160000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         19170000
                 END;        /*** ZIP- CODE LINE NOT FOUND - END  ****/ 19180000
                                                                        19190000
          END;                /**** BAU CUSTOMER - END             ****/19200000
   END;                       /**** END  COUNTRY 740 = HUNGARY     ****/19210000
 /*********************************************************************/19220000
   WHEN ('820') DO;          /**** START COUNTRY 820 = POLAND      ****/19230000
                                       /* RETAIN-AREA IS SET TO '88' */ 19240000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 19250000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           19260000
    /* RECORD TO '820' IN ANY CASE.        */                           19270000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '820';                   19280000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       19290000
                                                                        19300000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 19310000
                                                                        19320000
                              /* COPY CUSTOMER_NAME AND              */ 19330000
                              /*   MAILING LINES 1,2 TO              */ 19340000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 19350000
                              /*   RESPECTIVELY.                     */ 19360000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        19370000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       19380000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      19390000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        19400000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       19410000
                                           MAILING_ADDRESS.ICUS1AD;     19420000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        19430000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       19440000
                                           MAILING_ADDRESS.ICUS2AD;     19450000
                                         /* SET LINES 4 AND 5 TO     */ 19460000
                                         /* BLANK, SO NO CRAP IN THEM*/ 19470000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        19480000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 19490000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 19500000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 19510000
                              /*   CALLING PROGRAM.                  */ 19520000
          END;                /**** HVP CUSTOMER - END            ****/ 19530000
                                                                        19540000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 19550000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 19560000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 19570000
                /* ALSO THE ZIP-CODE.                                */ 19580000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 19590000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 19600000
 /****                                                                  19610000
             DO I = 1 TO 5:                                             19620000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 19630000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                19640000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 19650000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                19660000
             END;                                                       19670000
                                                                        19680000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    19690000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      19700000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            19710000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      19720000
  ****/                                                                 19730000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */19740000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */19750000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */19760000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */19770000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */19780000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/19790000
                           /* GOES TO CCMS ADDRESSLINE 1.             */19800000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */19810000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */19820000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */19830000
                           /* GOES TO CCMS ADDRESSLINE 3              */19840000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */19850000
                           /* IN ANY CASE.                            */19860000
             MAIL_ZIP_FOUND = '0'B;                                     19870000
  LOOPCM:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */19880000
                IF MAILING_A(I) ¬= ' ' THEN                             19890000
                 IF VERIFY(SUBSTR(MAILING_A(I),1,2),'0123456789') = 0 & 19900000
                    VERIFY(SUBSTR(MAILING_A(I),4,3),'0123456789') = 0 & 19910000
                    SUBSTR(MAILING_A(I),3,1) = '-'                      19920000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */19930000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              19940000
                                      MAILING_A(I);                     19950000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              19960000
                                      MAILING_A(I-1);                   19970000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              19980000
                                      MAILING_A(1);                     19990000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               20000000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         20010000
                        MAIL_ZIP_FOUND = '1'B;                          20020000
                        LEAVE LOOPCM;                                   20030000
                        END;                                            20040000
             END;                                                       20050000
                                                                        20060000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  20070000
               THEN DO;                                                 20080000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              20090000
                                      MAILING_A(3);                     20100000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              20110000
                                      MAILING_A(2);                     20120000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              20130000
                                      MAILING_A(1);                     20140000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               20150000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         20160000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    20170000
                                                                        20180000
             INV_ZIP_FOUND = '0'B;                                      20190000
  LOOPCN:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */20200000
                IF INVOICE_A(I) ¬= ' ' THEN                             20210000
                 IF VERIFY(SUBSTR(INVOICE_A(I),1,2),'0123456789') = 0 & 20220000
                    VERIFY(SUBSTR(INVOICE_A(I),4,3),'0123456789') = 0 & 20230000
                    SUBSTR(INVOICE_A(I),3,1) = '-'                      20240000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */20250000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              20260000
                                      INVOICE_A(I);                     20270000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              20280000
                                      INVOICE_A(I-1);                   20290000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              20300000
                                      INVOICE_A(1);                     20310000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               20320000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         20330000
                        INV_ZIP_FOUND = '1'B;                           20340000
                        LEAVE LOOPCN;                                   20350000
                        END;                                            20360000
             END;                                                       20370000
                                                                        20380000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   20390000
                 THEN DO;                                               20400000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              20410000
                                      INVOICE_A(3);                     20420000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              20430000
                                      INVOICE_A(2);                     20440000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              20450000
                                      INVOICE_A(1);                     20460000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               20470000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         20480000
                 END;        /*** ZIP- CODE LINE NOT FOUND - END  ****/ 20490000
                                                                        20500000
          END;                /**** BAU CUSTOMER - END            ****/ 20510000
   END;                      /**** END   COUNTRY 820 = POLAND      ****/20520000
 /*********************************************************************/20530000
   WHEN ('821') DO;          /**** START COUNTRY 821 = RUSSIA      ****/20540000
                                       /* RETAIN-AREA IS SET TO '88' */ 20550000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 20560000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           20570000
    /* RECORD TO '821' IN ANY CASE.        */                           20580000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '821';                   20590000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       20600000
                                                                        20610000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 20620000
                                                                        20630000
                              /* COPY CUSTOMER_NAME AND              */ 20640000
                              /*   MAILING LINES 1,2 TO              */ 20650000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 20660000
                              /*   RESPECTIVELY.                     */ 20670000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        20680000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       20690000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      20700000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        20710000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       20720000
                                           MAILING_ADDRESS.ICUS1AD;     20730000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        20740000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       20750000
                                           MAILING_ADDRESS.ICUS2AD;     20760000
                                         /* SET LINES 4 AND 5 TO     */ 20770000
                                         /* BLANK, SO NO CRAP IN THEM*/ 20780000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        20790000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 20800000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 20810000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 20820000
                              /*   CALLING PROGRAM.                  */ 20830000
          END;                /**** HVP CUSTOMER - END            ****/ 20840000
                                                                        20850000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 20860000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 20870000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 20880000
                /* ALSO THE ZIP-CODE.                                */ 20890000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 20900000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 20910000
 /****                                                                  20920000
             DO I = 1 TO 5:                                             20930000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 20940000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                20950000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 20960000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                20970000
             END;                                                       20980000
                                                                        20990000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    21000000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      21010000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            21020000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      21030000
  ****/                                                                 21040000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */21050000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */21060000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */21070000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */21080000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */21090000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/21100000
                           /* GOES TO CCMS ADDRESSLINE 1.             */21110000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */21120000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */21130000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */21140000
                           /* GOES TO CCMS ADDRESSLINE 3              */21150000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */21160000
                           /* IN ANY CASE.                            */21170000
             MAIL_ZIP_FOUND = '0'B;                                     21180000
  LOOPCO:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */21190000
                IF MAILING_A(I) ¬= ' ' THEN                             21200000
                 IF VERIFY(SUBSTR(MAILING_A(I),1,6),'0123456789') = 0   21210000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */21220000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              21230000
                                      MAILING_A(I);                     21240000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              21250000
                                      MAILING_A(I-1);                   21260000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              21270000
                                      MAILING_A(1);                     21280000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               21290000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         21300000
                        MAIL_ZIP_FOUND = '1'B;                          21310000
                        LEAVE LOOPCO;                                   21320000
                        END;                                            21330000
             END;                                                       21340000
                                                                        21350000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  21360000
               THEN DO;                                                 21370000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              21380000
                                      MAILING_A(3);                     21390000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              21400000
                                      MAILING_A(2);                     21410000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              21420000
                                      MAILING_A(1);                     21430000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               21440000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         21450000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    21460000
                                                                        21470000
             INV_ZIP_FOUND = '0'B;                                      21480000
  LOOPCP:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */21490000
                IF INVOICE_A(I) ¬= ' ' THEN                             21500000
                 IF VERIFY(SUBSTR(INVOICE_A(I),1,6),'0123456789') = 0   21510000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */21520000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              21530000
                                      INVOICE_A(I);                     21540000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              21550000
                                      INVOICE_A(I-1);                   21560000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              21570000
                                      INVOICE_A(1);                     21580000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               21590000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         21600000
                        INV_ZIP_FOUND = '1'B;                           21610000
                        LEAVE LOOPCP;                                   21620000
                        END;                                            21630000
             END;                                                       21640000
                                                                        21650000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   21660000
                 THEN DO;                                               21670000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              21680000
                                      INVOICE_A(3);                     21690000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              21700000
                                      INVOICE_A(2);                     21710000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              21720000
                                      INVOICE_A(1);                     21730000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               21740000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         21750000
                 END;        /*** ZIP- CODE LINE NOT FOUND - END  ****/ 21760000
                                                                        21770000
          END;                /**** BAU CUSTOMER - END            ****/ 21780000
   END;                      /**** END   COUNTRY 821 = RUSSIA      ****/21790000
 /*********************************************************************/21800000
   WHEN ('826') DO;          /**** START COUNTRY 826 = ROMANIA     ****/21810000
                                       /* RETAIN-AREA IS SET TO '88' */ 21820000
       PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '88';     /* IN ANY CASE   */ 21830000
    /* SET RETAIN-BRANCH IN CCMS CUSTOMER  */                           21840000
    /* RECORD TO '826' IN ANY CASE.        */                           21850000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '826';                   21860000
       IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = 'SH'       21870000
                                                                        21880000
          THEN DO;            /**** HVP CUSTOMER - START          ****/ 21890000
                                                                        21900000
                              /* COPY CUSTOMER_NAME AND              */ 21910000
                              /*   MAILING LINES 1,2 TO              */ 21920000
                              /*   INVOICE- AND MAILING-LINES 1,2,3  */ 21930000
                              /*   RESPECTIVELY.                     */ 21940000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),        21950000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =       21960000
                               PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME;      21970000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),        21980000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =       21990000
                                           MAILING_ADDRESS.ICUS1AD;     22000000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),        22010000
          PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =       22020000
                                           MAILING_ADDRESS.ICUS2AD;     22030000
                                         /* SET LINES 4 AND 5 TO     */ 22040000
                                         /* BLANK, SO NO CRAP IN THEM*/ 22050000
          PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),        22060000
            PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = ''; 22070000
                              /* ZIP-CODE SHOULD ALREADY BE SET IN   */ 22080000
                              /*   THE CCMS CUSTOMER RECORD BY       */ 22090000
                              /*   CALLING PROGRAM.                  */ 22100000
          END;                /**** HVP CUSTOMER - END            ****/ 22110000
                                                                        22120000
          ELSE DO;            /**** BAU CUSTOMER - START          ****/ 22130000
                /* THE ADDRESS LINES FOR INVOICE AND MAILING SHOULD  */ 22140000
                /* ALREADY BE FILLED BY THE CALLING PROGRAM,         */ 22150000
                /* ALSO THE ZIP-CODE.                                */ 22160000
                /**** THEREFORE, THE CODE IS SET TO COMMENT      *****/ 22170000
                /****    AND CHANGES COULD BE MADE IF NECESSARY  *****/ 22180000
 /****                                                                  22190000
             DO I = 1 TO 5:                                             22200000
                PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(I) = 22210000
                         FILE_EXTRA_INFO_X.INVOICE_A(I);                22220000
                PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(I) = 22230000
                         FILE_EXTRA_INFO_X.MAILING_A(I);                22240000
             END;                                                       22250000
                                                                        22260000
             PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE         =    22270000
                              SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);      22280000
             PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =            22290000
                              SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);      22300000
  ****/                                                                 22310000
             /*** COMPRESS ADDRESS-LINES FROM 5 LINES TO 3 LINES      */22320000
             /*** IF POSSIBLE, OTHERWISE LEAVE AS IS. METHOD IS:      */22330000
                           /* SEARCH THRU ADDRESS-LINES FOR ZIP-CODE  */22340000
                           /* IF FOUND THEN COPY THIS LINE TO CCMS    */22350000
                           /* ADDRESSLINE 3, THE LINE BEFORE ZIP-CODE */22360000
                           /* GOES TO CCMS ADDRESSLINE 2. ADRESSLINE 1*/22370000
                           /* GOES TO CCMS ADDRESSLINE 1.             */22380000
                           /* IF NOT FOUND ADDRESSLINE 1 GOES TO CCMS */22390000
                           /* ADDRESSLINE 1, ADDRESSLINE 2 GOES  TO   */22400000
                           /* CCMS ADDRESSLINE 2 AND ADDRESSLINE 3    */22410000
                           /* GOES TO CCMS ADDRESSLINE 3              */22420000
                           /* CCMS ADDRESSLINES 4 AND 5 ARE BLANKED   */22430000
                           /* IN ANY CASE.                            */22440000
             MAIL_ZIP_FOUND = '0'B;                                     22450000
  LOOPCQ:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */22460000
                IF MAILING_A(I) ¬= ' ' THEN                             22470000
                 IF (VERIFY(SUBSTR(MAILING_A(I),1,5),'0123456789') = 0 &22480000
                     SUBSTR(MAILING_A(I),6,1) = ' ')|                   22490000
                    (VERIFY(SUBSTR(MAILING_A(I),1,4),'0123456789') = 0 &22500000
                     SUBSTR(MAILING_A(I),5,1) = ' ')                    22510000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */22520000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              22530000
                                      MAILING_A(I);                     22540000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              22550000
                                      MAILING_A(I-1);                   22560000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              22570000
                                      MAILING_A(1);                     22580000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               22590000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         22600000
                        MAIL_ZIP_FOUND = '1'B;                          22610000
                        LEAVE LOOPCQ;                                   22620000
                        END;                                            22630000
             END;                                                       22640000
                                                                        22650000
             IF ¬MAIL_ZIP_FOUND   /*** ZIP- CODE LINE NOT FOUND *****/  22660000
               THEN DO;                                                 22670000
                        MAILING_ADDRESS.ADDRESS_LINES(3) =              22680000
                                      MAILING_A(3);                     22690000
                        MAILING_ADDRESS.ADDRESS_LINES(2) =              22700000
                                      MAILING_A(2);                     22710000
                        MAILING_ADDRESS.ADDRESS_LINES(1) =              22720000
                                      MAILING_A(1);                     22730000
                        MAILING_ADDRESS.ADDRESS_LINES(4),               22740000
                        MAILING_ADDRESS.ADDRESS_LINES(5) = ' ';         22750000
               END;       /*** ZIP- CODE LINE NOT FOUND        ****/    22760000
                                                                        22770000
             INV_ZIP_FOUND = '0'B;                                      22780000
  LOOPCR:    DO I = 9 TO 3 BY -1;    /* 3 IS LATEST LINE FOR ZIP-CODE */22790000
                IF INVOICE_A(I) ¬= ' ' THEN                             22800000
                 IF (VERIFY(SUBSTR(INVOICE_A(I),1,5),'0123456789') = 0 &22810000
                     SUBSTR(INVOICE_A(I),6,1) = ' ')|                   22820000
                    (VERIFY(SUBSTR(INVOICE_A(I),1,4),'0123456789') = 0 &22830000
                     SUBSTR(INVOICE_A(I),5,1) = ' ')                    22840000
                   THEN DO;                   /* ZIP-CODE LINE FOUND. */22850000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              22860000
                                      INVOICE_A(I);                     22870000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              22880000
                                      INVOICE_A(I-1);                   22890000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              22900000
                                      INVOICE_A(1);                     22910000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               22920000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         22930000
                        INV_ZIP_FOUND = '1'B;                           22940000
                        LEAVE LOOPCR;                                   22950000
                        END;                                            22960000
             END;                                                       22970000
                                                                        22980000
             IF ¬INV_ZIP_FOUND    /*** ZIP-CODE LINE NOT FOUND *****/   22990000
                 THEN DO;                                               23000000
                        INVOICE_ADDRESS.ADDRESS_LINES(3) =              23010000
                                      INVOICE_A(3);                     23020000
                        INVOICE_ADDRESS.ADDRESS_LINES(2) =              23030000
                                      INVOICE_A(2);                     23040000
                        INVOICE_ADDRESS.ADDRESS_LINES(1) =              23050000
                                      INVOICE_A(1);                     23060000
                        INVOICE_ADDRESS.ADDRESS_LINES(4),               23070000
                        INVOICE_ADDRESS.ADDRESS_LINES(5) = ' ';         23080000
                 END;        /*** ZIP- CODE LINE NOT FOUND - END  ****/ 23090000
                                                                        23100000
          END;                /**** BAU CUSTOMER - END            ****/ 23110000
   END;                      /**** END   COUNTRY 826 = ROMANIA    ****/ 23120000
 /*********************************************************************/23130000
 /* CENTRAL REGION END */                                               23140000
 /**********************/                                               23150000
 /* WEST REGION START  */                                               23160000
   WHEN ('706') DO ;         /**** START COUNTRY 706 = FRANCE     ****/ 23170000
     /*---------CHARGEMENT DE LA TABLE REGION AU PREMIER PASSAGE ---*/  23180000
        IF PREM_FOIS THEN DO;                                           23190000
           OPEN FILE(BUREG);                                            23200000
           ON ENDFILE(BUREG) EOF_BUREG = '1'B;                          23210000
           TAB_BUREG(*) ='';                                            23220000
           READ FILE(BUREG) INTO(Z_LECT);                               23230000
           DO R = 1 TO 999 WHILE(¬EOF_BUREG);                           23240000
              TAB_BUREG(R) = Z_LECT, BY NAME;          /*CHG0111A*/     23250000
              READ FILE(BUREG) INTO(Z_LECT);                            23260000
           END;                                                         23270000
           IMAX = R - 1;                                                23280000
           PREM_FOIS = '0'B;                                            23290000
           CLOSE FILE(BUREG);                                           23300000
        END;                                                            23310000
        /*-----------TRT CUSTOMER ------------------------------------*/23320000
        IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2)='00'        23330000
        THEN DO ;                                                       23340000
           /*---------- AFFECTATION BU : RETAIN_BRANCH ---------------*/23350000
           IF FILE_EXTRA_INFO.OU_CODE = '' THEN                         23360000
              PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '200';               23370000
           ELSE                                                         23380000
              PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH =                      23390000
                                  SUBSTR(FILE_EXTRA_INFO.OU_CODE,1,3);  23400000
           /*--------- AFFECTATION REGION : RETAIN_AREA -------------*/ 23410000
           BU_TROUVE = '0'B;                                            23420000
           DO R = 1 TO IMAX WHILE(¬BU_TROUVE);                          23430000
              IF TAB_BUREG(R).BU = PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH   23440000
              THEN BU_TROUVE = '1'B; /*CHG0111A*/                       23450000
           END;                                                         23460000
           IF BU_TROUVE THEN                                            23470000
              PARM_FILE_RCBDSE0_CU.RETAIN_AREA = TAB_BUREG(R-1).REG ;   23480000
           ELSE /*CHG0111A*/                                            23490000
              PARM_FILE_RCBDSE0_CU.RETAIN_AREA = '71';                  23500000
        END ; /*CUST '00' */                                            23510000
        /*----------------- INVOICE ADDRESS AFFECTATION ----------*/    23520000
        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1) =         23530000
              FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS3AD;                  23540000
        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2) =         23550000
              FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS4AD;                  23560000
        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3) =         23570000
              SUBSTR(FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS6AD,7,24);     23580000
        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4) = '' ;    23590000
        PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(5) = '' ;    23600000
        /*----------------- MAILING ADDRESS AFFECTATION ----------*/    23610000
        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =         23620000
              FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS3AD;                  23630000
        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =         23640000
              FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS4AD;                  23650000
        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =         23660000
              SUBSTR(FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS6AD,7,24);     23670000
        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(4) = '' ;    23680000
        PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = '' ;    23690000
        /*----------------------------------------------------------*/  23700000
        /* CALL TRANSLATE MODULE */                                     23710000
        CALL WEST_ADDR_TRANSLATE ;                                      23720000
   END ;               /* END COUNTRY 706 FRANCE */                     23730000
   WHEN ('624') DO ;   /**** START COUNTRY 624 = BENELUX    ****/       23740000
    IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2)='00'            23750000
    THEN DO ;                                                           23760000
       /*-------------- AFFECTATION BU : RETAIN_BRANCH ---------------*/23770000
       IF FILE_EXTRA_INFO.OU_CODE = '' THEN                             23780000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH = '300';                   23790000
       ELSE                                                             23800000
          PARM_FILE_RCBDSE0_CU.RETAIN_BRANCH =                          23810000
                                  SUBSTR(FILE_EXTRA_INFO.OU_CODE,1,3);  23820000
    END;                                /* END CUST '00'   */           23830000
    /*----------------- INVOICE ADDRESS AFFECTATION ----------*/        23840000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1) =             23850000
          FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS1AD;                      23860000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2) =             23870000
          FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS2AD;                      23880000
    IF SUBSTR(FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS3AD,1,1) = 'L'        23890000
    THEN PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3) =        23900000
          SUBSTR(FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS3AD,8);            23910000
    ELSE PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3) =        23920000
          SUBSTR(FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS3AD,6);            23930000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4) = '' ;        23940000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(5) = '' ;        23950000
    /*----------------- MAILING ADDRESS AFFECTATION ----------*/        23960000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =             23970000
          FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS1AD;                      23980000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =             23990000
          FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS2AD;                      24000000
    IF SUBSTR(FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS3AD,1,1) = 'L'        24010000
    THEN PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =        24020000
          SUBSTR(FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS3AD,8);            24030000
    ELSE PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =        24040000
          SUBSTR(FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS3AD,6);            24050000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(4) = '' ;        24060000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) = '' ;        24070000
    /* CALL TRANSLATE MODULE */                                         24080000
    CALL WEST_ADDR_TRANSLATE ;                                          24090000
   END ;               /* END COUNTRY 624 BENELUX */                    24100000
                                                                        24110000
 /********************************************************************/ 24120000
   OTHERWISE                 /**** FOR OTHER COUNTRIES             ****/24130000
      DO;                    /****   NO ACTIONS                    ****/24140000
                                                                        24150000
      END;                                                              24160000
 END ;   /*   SELECT COUNTRY NUMBER   */                                24170000
                                                                        24180000
1/********************************************************************/ 24190000
 /**** USER FUNCTION   SHORTEN         CENTRAL REGION            *****/ 24200000
 /****      REMOVES REDUNDANT BLANKS BETWEEN WORDS AND           *****/ 24210000
 /****      RETURNS A CHARACTER STRING OF LENGTH 40.             *****/ 24220000
 /********************************************************************/ 24230000
 SHORTEN: PROCEDURE (STR) RETURNS (CHARACTER(40));                      24240000
                                                                        24250000
 DCL STR CHARACTER(*);         /* CHARACTER STRING OF DIFFERENT LENGTH*/24260000
 DCL (I1, I2) BINARY FIXED(31) /* WORKING VARIABLES FOR POSITIONS     */24270000
              INITIAL(0);                                               24280000
 DCL BLKSW    BIT(1)           /* SWITCH FOR BLANK HANDLING           */24290000
              INITIAL('0'B);   /*    ON IF NO BLANK REQUIRED          */24300000
 DCL OUT_STR  CHARACTER(40)    /* WORKING AREA FOR OUTPUT STRING      */24310000
              INITIAL(' ');                                             24320000
 DCL LENGTH   BUILTIN;         /* BUILTIN FUNCTION                    */24330000
                                                                        24340000
    OUT_STR = ' ';                      /* INITIALIZE OUTPUT STRING   */24350000
    I2 = 1;                             /* INITIALIZE OUTPUT POSITION */24360000
    BLKSW = '0'B;                       /* INITIALIZE BLANK SWITCH    */24370000
    DO I1 = 1 TO LENGTH(STR);           /*                            */24380000
       IF SUBSTR(STR,I1,1) ¬= ' ' THEN  /* IF CHAR NOT BLANK THEN     */24390000
          DO;                           /*    COPY TO OUTPUT          */24400000
          SUBSTR(OUT_STR,I2,1) = SUBSTR(STR,I1,1);                      24410000
          BLKSW = '1'B;                 /* NEXT BLANK IS REQUIRED     */24420000
          I2 = I2 + 1;                  /* POINT TO NEXT POSITION     */24430000
          END;                          /*                            */24440000
                                  ELSE                                  24450000
          DO;                           /* CHARACTER IS A BLANK       */24460000
          IF BLKSW = '1'B THEN          /* IF BLANK IS REQUIRED THEN  */24470000
             DO;                        /*                            */24480000
             BLKSW = '0'B;              /* - RESET BLANK REQUIRED     */24490000
             I2 = I2 + 1;               /* - SKIP TO NEXT POSITION    */24500000
             END;                                                       24510000
          END;                                                          24520000
                                        /* IF NEXT OUTPUT POSITION IS */24530000
       IF I2 > 40 THEN LEAVE;           /*    OUTSIDE TARGET STRING   */24540000
                                        /*    THEN LEAVE DO LOOP      */24550000
    END;                 /*** END DO LOOP ***/                          24560000
                                                                        24570000
    RETURN(OUT_STR);                    /* RETURN THE CHARACTER STRING*/24580000
                                                                        24590000
 END SHORTEN;                                                           24600000
0/********************************************************************/ 24610000
 /**** LOKALE AENDERUNGEN - CENTRAL REGION                       *****/ 24620000
 /**** LOKALE AENDERUNGEN - CENTRAL REGION                       *****/ 24630000
 /**** LOKALE AENDERUNGEN - CENTRAL REGION                       *****/ 24640000
 /********************************************************************/ 24650000
                                                                        24660000
 /* ROWEST ADDRESS TRANSLATOR *************************************/    24670000
 WEST_ADDR_TRANSLATE: PROC;                                             24680000
    /*---  MCO  ------- INVOICE ADDRESS TRANSLATION ------------*/      24690000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1) =             24700000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(1),    24710000
              GNLLETTER,FRLETTER) ;                                     24720000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2) =             24730000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(2),    24740000
              GNLLETTER,FRLETTER) ;                                     24750000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3) =             24760000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(3),    24770000
              GNLLETTER,FRLETTER) ;                                     24780000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4) =             24790000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(4),    24800000
              GNLLETTER,FRLETTER) ;                                     24810000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(5) =             24820000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(5),    24830000
              GNLLETTER,FRLETTER) ;                                     24840000
    PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE =                     24850000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE,            24860000
              GNLLETTER,FRLETTER) ;                                     24870000
    /*---  MCO  ------- MAILING ADDRESS TRANSLATION ------------*/      24880000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1) =             24890000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(1),    24900000
              GNLLETTER,FRLETTER) ;                                     24910000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2) =             24920000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(2),    24930000
              GNLLETTER,FRLETTER) ;                                     24940000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3) =             24950000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(3),    24960000
              GNLLETTER,FRLETTER) ;                                     24970000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(4) =             24980000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(4),    24990000
              GNLLETTER,FRLETTER) ;                                     25000000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5) =             25010000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(5),    25020000
              GNLLETTER,FRLETTER) ;                                     25030000
    PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE =                     25040000
    TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE,            25050000
              GNLLETTER,FRLETTER) ;                                     25060000
   END WEST_ADDR_TRANSLATE ; /* END WEST TRANSLATE */                   25070000
                                                                        25080000
 /* ROSOUTH */                                                          25090000
                                                                        25100000
1C758_PROCEDURE: PROC;                                                  25110000
    RETAIN_AREA  = '61';                                                25120000
    MAILING_ADDRESS.ADDRESS_LINES(*),                                   25130000
    INVOICE_ADDRESS.ADDRESS_LINES(*)          = '';                     25140000
    IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER, 1, 2) = '00' THEN   25150000
    DO;                                                                 25160000
       RETAIN_BRANCH = SUBSTR(OU_CODE, 1, 3);                           25170000
                                                                        25180000
       IF MAILING_ADDRESS.ICUS2AD ¬= '*' THEN                           25190000
          MAILING_ADDRESS.ADDRESS_LINES(1)                              25200000
                = STRIP(ADDR(MAILING_ADDRESS.ICUS1AD))                  25210000
                  || ' '                                                25220000
                  || MAILING_ADDRESS.ICUS2AD;                           25230000
       ELSE                                                             25240000
          MAILING_ADDRESS.ADDRESS_LINES(1) = MAILING_ADDRESS.ICUS1AD;   25250000
                                                                        25260000
       MAILING_ADDRESS.ADDRESS_LINES(2) = MAILING_ADDRESS.ICUS4AD;      25270000
       MAILING_ADDRESS.ADDRESS_LINES(3)                                 25280000
                            = SUBSTR(MAILING_ADDRESS.ICUS5AD, 7, 24);   25290000
                                                                        25300000
       IF INVOICE_ADDRESS.ICUS2AD ¬= '*' THEN                           25310000
          INVOICE_ADDRESS.ADDRESS_LINES(1)                              25320000
                = STRIP(ADDR(INVOICE_ADDRESS.ICUS1AD))                  25330000
                  || ' '                                                25340000
                  || INVOICE_ADDRESS.ICUS2AD;                           25350000
       ELSE                                                             25360000
          INVOICE_ADDRESS.ADDRESS_LINES(1) = INVOICE_ADDRESS.ICUS1AD;   25370000
                                                                        25380000
       INVOICE_ADDRESS.ADDRESS_LINES(2)    = INVOICE_ADDRESS.ICUS4AD;   25390000
       INVOICE_ADDRESS.ADDRESS_LINES(3)                                 25400000
                            = SUBSTR(INVOICE_ADDRESS.ICUS5AD, 7, 24);   25410000
                                                                        25420000
       MAILING_ADDRESS.ZIP_CODE=SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);    25430000
       INVOICE_ADDRESS.ZIP_CODE=SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);    25440000
                                                                        25450000
    END;                                                                25460000
    ELSE                                                                25470000
      DO;                                                               25480000
       RETAIN_BRANCH = '999';                                           25490000
                                                                        25500000
       MAILING_ADDRESS.ADDRESS_LINES(1),                                25510000
       INVOICE_ADDRESS.ADDRESS_LINES(1) = CUSTOMER_NAME;                25520000
                                                                        25530000
       MAILING_ADDRESS.ADDRESS_LINES(2),                                25540000
       INVOICE_ADDRESS.ADDRESS_LINES(2) = MAILING_ADDRESS.ICUS1AD;      25550000
                                                                        25560000
       MAILING_ADDRESS.ADDRESS_LINES(3),                                25570000
       INVOICE_ADDRESS.ADDRESS_LINES(3) = MAILING_ADDRESS.ICUS2AD;      25580000
                                                                        25590000
       INVOICE_ADDRESS.ZIP_CODE         = MAILING_ADDRESS.ZIP_CODE;     25600000
    END;                                                                25610000
 END C758_PROCEDURE ;     /* ROSOUTH */                                 25620000
 /**********************    822 *************************************/  25630000
1C838_PROCEDURE: PROC;                                                  25640000
    RETAIN_AREA  = '78';                                                25650000
    MAILING_ADDRESS.ADDRESS_LINES(*),                                   25660000
    INVOICE_ADDRESS.ADDRESS_LINES(*)          = '';                     25670000
    IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER, 1, 2) = '00' THEN   25680000
    DO;                                                                 25690000
       RETAIN_BRANCH = SUBSTR(OU_CODE, 1, 3);                           25700000
                                                                        25710000
       MAILING_ADDRESS.ADDRESS_LINES(1) = MAILING_ADDRESS.ICUS1AD;      25720000
       MAILING_ADDRESS.ADDRESS_LINES(2) = MAILING_ADDRESS.ICUS3AD;      25730000
       MAILING_ADDRESS.ADDRESS_LINES(3) =                               25740000
                             SUBSTR(MAILING_ADDRESS.ICUS4AD,7,24);      25750000
                                                                        25760000
       INVOICE_ADDRESS.ADDRESS_LINES(1) = INVOICE_ADDRESS.ICUS1AD;      25770000
       INVOICE_ADDRESS.ADDRESS_LINES(2) = INVOICE_ADDRESS.ICUS3AD;      25780000
       INVOICE_ADDRESS.ADDRESS_LINES(3) =                               25790000
                             SUBSTR(INVOICE_ADDRESS.ICUS4AD,7,24);      25800000
                                                                        25810000
       MAILING_ADDRESS.ZIP_CODE=SUBSTR(MAILING_ADDRESS.ICUS5AD,1,5);    25820000
       INVOICE_ADDRESS.ZIP_CODE=SUBSTR(INVOICE_ADDRESS.ICUS5AD,1,5);    25830000
                                                                        25840000
    END;                                                                25850000
    ELSE                                                                25860000
      DO;                                                               25870000
       RETAIN_BRANCH = '999';                                           25880000
                                                                        25890000
       MAILING_ADDRESS.ADDRESS_LINES(1),                                25900000
       INVOICE_ADDRESS.ADDRESS_LINES(1) = CUSTOMER_NAME;                25910000
                                                                        25920000
       MAILING_ADDRESS.ADDRESS_LINES(2),                                25930000
       INVOICE_ADDRESS.ADDRESS_LINES(2) = MAILING_ADDRESS.ICUS1AD;      25940000
                                                                        25950000
       MAILING_ADDRESS.ADDRESS_LINES(3),                                25960000
       INVOICE_ADDRESS.ADDRESS_LINES(3) = MAILING_ADDRESS.ICUS2AD;      25970000
                                                                        25980000
       INVOICE_ADDRESS.ZIP_CODE = MAILING_ADDRESS.ZIP_CODE;             25990000
    END;                                                                26000000
 END C838_PROCEDURE ;     /* ROSOUTH */                                 26010000
 /********************   838  end     *******************************/  26020000
 /********************   822  start   *******************************/  26030000
1C822_PROCEDURE: PROC;                                                  26040000
    RETAIN_AREA  = '77';                                                26050000
    MAILING_ADDRESS.ADDRESS_LINES(*),                                   26060000
    INVOICE_ADDRESS.ADDRESS_LINES(*)    = '';                           26070000
    IF SUBSTR(PARM_FILE_RCBDSE0_CU.CUSTOMER_NUMBER,1,2) = '00' THEN     26080000
    DO;                                                                 26090000
       RETAIN_BRANCH                    = SUBSTR(OU_CODE, 1, 3);        26100000
                                                                        26110000
       MAILING_ADDRESS.ADDRESS_LINES(1) = MAILING_ADDRESS.ICUS1AD;      26120000
       MAILING_ADDRESS.ADDRESS_LINES(2) = MAILING_ADDRESS.ICUS3AD;      26130000
       MAILING_ADDRESS.ADDRESS_LINES(3) = MAILING_ADDRESS.ICUS4AD;      26140000
                                                                        26150000
       INVOICE_ADDRESS.ADDRESS_LINES(1) = INVOICE_ADDRESS.ICUS1AD;      26160000
       INVOICE_ADDRESS.ADDRESS_LINES(2) = INVOICE_ADDRESS.ICUS3AD;      26170000
       INVOICE_ADDRESS.ADDRESS_LINES(3) = INVOICE_ADDRESS.ICUS4AD;      26180000
                                                                        26190000
       MAILING_ADDRESS.ZIP_CODE         = '';                           26200000
       INVOICE_ADDRESS.ZIP_CODE         = '';                           26210000
    END;                                                                26220000
    ELSE                                                                26230000
      DO;                                                               26240000
       RETAIN_BRANCH = '999';                                           26250000
                                                                        26260000
       MAILING_ADDRESS.ADDRESS_LINES(1),                                26270000
       INVOICE_ADDRESS.ADDRESS_LINES(1) = CUSTOMER_NAME;                26280000
                                                                        26290000
       MAILING_ADDRESS.ADDRESS_LINES(2),                                26300000
       INVOICE_ADDRESS.ADDRESS_LINES(2) = MAILING_ADDRESS.ICUS1AD;      26310000
                                                                        26320000
       MAILING_ADDRESS.ADDRESS_LINES(3),                                26330000
       INVOICE_ADDRESS.ADDRESS_LINES(3) = MAILING_ADDRESS.ICUS2AD;      26340000
                                                                        26350000
       INVOICE_ADDRESS.ZIP_CODE         = MAILING_ADDRESS.ZIP_CODE;     26360000
    END;                                                                26370000
 END C822_PROCEDURE ;     /* ROSOUTH */                                 26380000
            /* ROSOUTH */                                               26390000
                                                                        26400000
 STRIP:  PROC(PTR_DEP) RETURNS(CHAR(250) VARYING) REORDER;              26410000
 DCL PTR_DEP   PTR;                                                     26420000
 DCL K FIXED BIN(15) INIT(0) AUTO;                                      26430000
 DCL STRINGA BASED(PTR_DEP) CHAR(30);                                   26440000
                                                                        26450000
 DO K = LENGTH(STRINGA) TO 0 BY -1 WHILE(SUBSTR(STRINGA, K, 1) = ' ');  26460000
 END;                                                                   26470000
 RETURN(SUBSTR(STRINGA, 1, K));                                         26480000
 END STRIP;                                                             26490000
            /*   RO SOUTH   */                                          26500000
1SH_ADDRESSES:   PROC;                                                  26510000
 /*******************************************************************/  26520000
 /*  DETERMINE INVOICING AND MAILING ADDRESSES FOR SHRINKWRAP-      */  26530000
 /*  CUSTOMERS.                                                     */  26540000
 /*  FOR THIS CUSTOMER TYPE, INVOICING AND MAILING ADDRESS IS       */  26550000
 /*  ONE AND THE SAME.                                              */  26560000
 /*                                                                 */  26570000
 /*  MOREOVER, ALL OCCURRENCES OF NATIONAL CHARACTERS MUST BE       */  26580000
 /*  TRANSLATED.                                                    */  26590000
 /*  THIS IS TRUE ALSO FOR CUSTOMER NAME.                           */  26600000
 /*                                                                 */  26610000
 /*******************************************************************/  26620000
                                                                        26630000
 DO Y = 1 TO 3;                                                         26640000
 X = TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(Y),   26650000
     'AaAaOo','$}#{@¦');                                                26660000
 PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(Y) = X;             26670000
 END;                                                      /*end DO */  26680000
                                                                        26690000
 DO Y = 1 TO 3;                                                         26700000
 X = TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(Y),   26710000
     'AaAaOo','$}#{@¦');                                                26720000
 PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(Y) = X;             26730000
 END;                                                      /*end DO */  26740000
                                                                        26750000
 X = TRANSLATE(PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME,'AaAaOo','$}#{@¦');   26760000
 PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME = X;                                26770000
                                                                        26780000
 END SH_ADDRESSES;                                                      26790000
                                                                        26800000
1BAU_ADDRESSES:   PROC;                                                 26810000
 /********************************************************************/ 26820000
 /*  MODIFY AND TRANSLATE INVOICING AND MAILING ADDRESSES            */ 26830000
 /*  AND TRANSLATE CUSTOMER NAME  FOR BAU CUSTOMERS                  */ 26840000
 /********************************************************************/ 26850000
    CALL MOD_INVOICE_ADDR;         /* MODIFY 5 INVOICE ADDRESS LINES */ 26860000
                                                                        26870000
    CALL MOD_MAILING_ADDR;         /* MODIFY 5 MAILING ADDRESS LINES */ 26880000
                                                                        26890000
    CALL TRANSLATE_ALL;     /* translate national char in addr.lines */ 26900000
                                                                        26910000
 END BAU_ADDRESSES;                                                     26920000
                                                                        26930000
1MOD_INVOICE_ADDR:  PROC;                                               26940000
 /********************************************************************/ 26950000
 /* BUILD ADDRESS LINES FOR INVOICE ADDRESS                          */ 26960000
 /********************************************************************/ 26970000
                                                                        26980000
   ZZZ_ADDR_LINES(2) = FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS2AD;         26990000
   ZZZ_ADDR_LINES(3) = FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS3AD;         27000000
   ZZZ_ADDR_LINES(4) = FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS4AD;         27010000
   ZZZ_ADDR_LINES(5) = FILE_EXTRA_INFO.INVOICE_ADDRESS.ICUS5AD;         27020000
   ADDRESS_TYPE = 'I';                                                  27030000
   CALL BUILD_ADDRESS;                                                  27040000
                                                                        27050000
   DO J = 2 TO 5;                                                       27060000
     PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(J) =            27070000
       TEMP_LINES(J);                                                   27080000
   END;                                                                 27090000
                                                                        27100000
 END MOD_INVOICE_ADDR;                                                  27110000
                                                                        27120000
                                                                        27130000
1MOD_MAILING_ADDR:  PROC;                                               27140000
 /********************************************************************/ 27150000
 /* BUILD ADDRESS LINES FOR MAILING ADDRESS                          */ 27160000
 /********************************************************************/ 27170000
                                                                        27180000
  ZZZ_ADDR_LINES(2) = FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS2AD;          27190000
  ZZZ_ADDR_LINES(3) = FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS3AD;          27200000
  ZZZ_ADDR_LINES(4) = FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS4AD;          27210000
  ZZZ_ADDR_LINES(5) = FILE_EXTRA_INFO.MAILING_ADDRESS.ICUS5AD;          27220000
 ADDRESS_TYPE = 'M';                                                    27230000
 CALL BUILD_ADDRESS;                                                    27240000
 /* J = 2; */                                                           27250000
 DO J = 2 to 5;                                                         27260000
   PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(J) =              27270000
   TEMP_LINES(J);                                                       27280000
 /*  J = J + 1; */                                                      27290000
 END;                                                                   27300000
                                                                        27310000
 END MOD_MAILING_ADDR;                                                  27320000
                                                                        27330000
1BUILD_ADDRESS: PROC;                                                   27340000
0/********************************************************************/ 27350000
 /* THE FUNCTION OF THIS PROCEDURE IS TO MODIFY AND PUT TOGETHER     */ 27360000
 /* THE "BEST POSSIBLE IADDRESS" FROM THE 5 ADDRESS                  */ 27370000
 /* LINES AND STORE IT INTO THE CCMS INTERFACE RECORD.               */ 27380000
 /*                                                                  */ 27390000
 /* THE ADDRESS LINE ASSIGNMENTS ARE EFFECTUATED ACCORDING TO THE    */ 27400000
 /* FOLLOWING RULES:                                                 */ 27410000
 /* LINE 1)  CUSTOMER NAME:        (NO SPECIAL TREATMENT)            */ 27420000
 /* LINE 2)  PREFERABLY POSTBOX NR, HOWEVER IF NONE CAN BE FOUND     */ 27430000
 /*          WE MUST TRY TO FIND A LINE WITH STREET AND NUMBER.      */ 27440000
 /*            - LINE 2,3,4,5 OF THE 5-LINE INPUT ARE SCANNED.       */ 27450000
 /*              LINES STARTING ON CERTAIN CHARACTER STRINGS ARE     */ 27460000
 /*              EXCLUDED AS BEING NOT APPLICABLE.                   */ 27470000
 /* LINE 3)  Zipcode and city                                        */ 27480000
 /* LINE 4)  blank                                                   */ 27490000
 /* LINE 5)  blank                                                   */ 27500000
 /*                                                                  */ 27510000
 /********************************************************************/ 27520000
 I = 1;                                                                 27530000
 CALL FIND_POSTBOX;         /* FIND THE POST BOX LINE, IF IT EXISTS. */ 27540000
 IF I < 6                                 /* i.e. we have found one| */ 27550000
   THEN                                                                 27560000
       TEMP_LINES(2) = ZZZ_ADDR_LINES(I);                               27570000
   ELSE                     /* i.e. none found| Then we must find an */ 27580000
     DO;                    /*     acceptable STREET/NO LINE instead.*/ 27590000
       CALL FIND_STREET;                                                27600000
       IF I = 6             /*i.e. no "acceptable" street line found.*/ 27610000
         THEN               /*                     leave line2 empty.*/ 27620000
           TEMP_LINES(2) = '';                                          27630000
         ELSE                                                           27640000
           TEMP_LINES(2) = ZZZ_ADDR_LINES(I);                           27650000
     END;                                                  /* end DO */ 27660000
 CALL FIND_LINE3;                  /* BUILD LINE 3 ZIP CODE AND CITY */ 27670000
 CALL ADDR_LINE45;                             /*BUILD LINES 4 AND 5 */ 27680000
                                                                        27690000
 END BUILD_ADDRESS;                                                     27700000
                                                                        27710000
1FIND_POSTBOX: PROC;                                                    27720000
 /********************************************************************/ 27730000
 /* SEARCH FOR ADDRESS LINE CONTAINING POST BOX INFO.                */ 27740000
 /* (IF IT EXISTS|)                                                  */ 27750000
 /********************************************************************/ 27760000
 I = 2;                                                                 27770000
 DO WHILE(I <= 5 &                                                      27780000
   (SUBSTR(ZZZ_ADDR_LINES(I),1,8)   ¬= 'Postbox '                       27790000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,8) ¬= 'POSTBOX '                       27800000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,9) ¬= 'Postboks '                      27810000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,9) ¬= 'POSTBOKS '                      27820000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,4) ¬= 'Box '                           27830000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,4) ¬= 'BOX '                           27840000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,3) ¬= 'PL '                            27850000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,8) ¬= 'P.O.BOX '                       27860000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,5) ¬= 'Post.'                          27870000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,5) ¬= 'POST.'                          27880000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,4) ¬= 'POB '                           27890000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,5) ¬= 'Boks '                          27900000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,5) ¬= 'BOKS '                          27910000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,3) ¬= 'PB '                            27920000
    & SUBSTR(ZZZ_ADDR_LINES(I),1,3) ¬= 'PB.'));                         27930000
                                                                        27940000
   I = I + 1;                                                           27950000
 END;                                              /* end while loop */ 27960000
                                                                        27970000
 END FIND_POSTBOX;                                                      27980000
                                                                        27990000
1FIND_STREET: PROC;                                                     28000000
                                                                        28010000
 /********************************************************************/ 28020000
 /* EXCLUDE SOME ADDRESS LINES DEPENDING ON CERTAIN CHARACTER        */ 28030000
 /* STRINGS IN THE BEGINNING OF THE ADDRESS DATA LINES.              */ 28040000
 /********************************************************************/ 28050000
 I = 2;                                                                 28060000
 DO WHILE(I <= 5 &                                                      28070000
   (ZZZ_ADDR_LINES(I) = ' '                                             28080000
      | VERIFY(ZZZ_ADDR_LINES(I),'0123456789 ') = 0                     28090000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,4) = 'ATT.'                          28100000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,4) = 'ATT:'                          28110000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,2) = '4 '                            28120000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'Pers '                         28130000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'PERS '                         28140000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'Budg.'                         28150000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'BUDG.'                         28160000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'Budg:'                         28170000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'BUDG'                          28180000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,4) = 'Ref.'                          28190000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,4) = 'REF.'                          28200000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'Bas1 '                         28210000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'BAS1 '                         28220000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'Supl '                         28230000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5) = 'SUPL '                         28240000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,9) = 'LITHUANIA'                     28250000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,8) = 'ESTONIA '                      28260000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,6) = 'EESTI '                        28270000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,7) = 'LATVIA '                       28280000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5)                                   28290000
         = SUBSTR(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE,1,5)    28300000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,5)                                   28310000
         = SUBSTR(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE,1,5)    28320000
      | SUBSTR(ZZZ_ADDR_LINES(I),1,2) = 'D:'));                         28330000
                                                                        28340000
   I = I + 1;                                                           28350000
 END;                                              /* end while loop */ 28360000
                                                                        28370000
 END FIND_STREET;                                                       28380000
                                                                        28390000
1FIND_LINE3:   PROC;                                                    28400000
 /********************************************************************/ 28410000
 /* BUILD ADDRESS LINE 3.                                            */ 28420000
 /********************************************************************/ 28430000
                                                                        28440000
 IF ADDRESS_TYPE = 'I' THEN                                             28450000
 DO;                                                                    28460000
 IF SUBSTR(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE,1,5) = ' '     28470000
   THEN TEMP_LINES(3) = '';            /* i.e. no ZIP-code available */ 28480000
   ELSE                                                                 28490000
   DO J = 2 TO 5;                                                       28500000
       IF SUBSTR(ZZZ_ADDR_LINES(J),1,5)                                 28510000
         = SUBSTR(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ZIP_CODE,1,5)    28520000
       THEN                                                             28530000
            TEMP_LINES(3) = ZZZ_ADDR_LINES(J);                          28540000
   END;                                               /* end of else */ 28550000
 END;                                                                   28560000
                                                                        28570000
 IF ADDRESS_TYPE = 'M' THEN                                             28580000
 DO;                                                                    28590000
 IF SUBSTR(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE,1,5) = ' '     28600000
   THEN TEMP_LINES(3) = '';            /* i.e. no ZIP-code available */ 28610000
   ELSE                                                                 28620000
   DO J = 2 TO 5;                                                       28630000
       IF SUBSTR(ZZZ_ADDR_LINES(J),1,5)                                 28640000
         = SUBSTR(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ZIP_CODE,1,5)    28650000
       THEN                                                             28660000
            TEMP_LINES(3) = ZZZ_ADDR_LINES(J);                          28670000
   END;                                               /* end of else */ 28680000
 END;                                                                   28690000
                                                                        28700000
 END FIND_LINE3;                                                        28710000
                                                                        28720000
1ADDR_LINE45:   PROC;                                                   28730000
 /********************************************************************/ 28740000
 /* BUILD ADDRESS LINES 4 AND 5.                                     */ 28750000
 /********************************************************************/ 28760000
                                                                        28770000
   TEMP_LINES(4) = '';                                                  28780000
   TEMP_LINES(5) = '';                                                  28790000
                                                                        28800000
 END ADDR_LINE45;                                                       28810000
                                                                        28820000
                                                                        28830000
1TRANSLATE_ALL:    PROC;                                                28840000
                                                                        28850000
 /********************************************************************/ 28860000
 /*   NATIONAL CHARACTERS MUST BE TRANSLATED TO STANDARD CHAR SET.  */  28870000
 /********************************************************************/ 28880000
                                                                        28890000
 DO Y = 1 TO 3;                                                         28900000
 X = TRANSLATE(PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(Y),   28910000
     'AaAaOo','$}#{@¦');                                                28920000
 PARM_FILE_RCBDSE0_CU.INVOICE_ADDRESS.ADDRESS_LINES(Y) = X;             28930000
 END;                                                      /*end DO */  28940000
                                                                        28950000
 DO Y = 1 TO 3;                                                         28960000
 X = TRANSLATE(PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(Y),   28970000
     'AaAaOo','$}#{@¦');                                                28980000
 PARM_FILE_RCBDSE0_CU.MAILING_ADDRESS.ADDRESS_LINES(Y) = X;             28990000
 END;                                                      /*end DO */  29000000
                                                                        29010000
                                                                        29020000
 X = TRANSLATE(PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME,'AaAaOo','$}#{@¦');   29030000
 PARM_FILE_RCBDSE0_CU.CUSTOMER_NAME = X;                                29040000
                                                                        29050000
                                                                        29060000
 END TRANSLATE_ALL;                                                     29070000
                                                                        29080000
 /**************************************** END USER DEFINED PROCESS */  29090000
                                         /* END USER DEFINED PROCESS */ 29100000
0                                        /* RESET LEVEL              */ 29110000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            29120000
1/*******************************************************************/  29130000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  29140000
 /*******************************************************************/  29150000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  29160000
 $DAIMOD (RCBDS1U);                      /* MODULE TO BE COMPILED   */  29170000
0/*******************************************************************/  29180000
 /* END OF ABR BLOCK                                                */  29190000
 /*******************************************************************/  29200000
0END RCBDS1U;                                                           29210000