1/* RCBDS2U - CCMS CONTRACT INTERFACE (CHIS) USER EXIT               */ 00019526
 /********************************************************************/ 00020004
 /*                                                                  */ 00030004
 /*                                                                  */ 00040004
 /* MODULE NAME      : RCBDS2U                                       */ 00050004
 /*                                                                  */ 00060004
 /* PROGRAM NAME     : RCBDSBP                                       */ 00070004
 /*                                                                  */ 00080004
 /* LANGUAGE         : PLISQL                                        */ 00090004
 /*                                                                  */ 00100004
 /* TYPE             : LINKABLE MODULE                               */ 00110004
 /*                                                                  */ 00120004
 /* DESCRIPTION      : USER EXIT TO GET CONTROL OVER THE OUTPUT      */ 00130004
 /*                    FROM THE 4 TYPES OF RETRIEVED CHIS LAM'S,     */ 00140004
 /*                    TO BE USED IN THE CCMS CONTRACT INTERFACE     */ 00150004
 /*                                                                  */ 00160004
 /* NOTE 1           : IF YOU WANT TO USE THIS EXIT BE SURE TO SET   */ 00170004
 /*                    SWITCH_USER_EXIT TO TRUE                      */ 00180004
 /*                                                                  */ 00190004
 /* NOTE 2           : THE USER EXIT IS USED FOR SEVERAL PURPOSES.   */ 00200004
 /*                    THEREFORE, AN INDICATOR IS PASSED THROUGH     */ 00210004
 /*                    THE USER EXIT.                                */ 00220004
 /*                    POSSIBLE VALUES AND PURPOSES ARE :            */ 00230004
 /*                    - 'Y', THE USER CAN OVERWRITE THE CONTENTS    */ 00240004
 /*                           OF CALL-BACK-TIME, HOURS-FROM / -TO.   */ 00250004
 /*                    - 'R', THE USER CAN OVERWRITE THE CONTENTS    */ 00260004
 /*                           OF BALANCE-UNITS AND BALANCE.          */ 00270004
 /*                    - 'O', THE USER CAN DECIDE TO ACCEPT OR       */ 00280004
 /*                           EXCLUDE THE RECORD FROM THE EXTRACT.   */ 00290004
 /*                    - 'N', THE USER CAN OVERWRITE THE CONTENTS    */ 00300004
 /*                           OF THE FOLLOWING FIELDS :              */ 00310004
 /*                           - PRODUCT-DEF-ID, POSITION 16 - 30     */ 00320004
 /*                           - BALANCE-UNITS                        */ 00330004
 /*                           - BALANCE                              */ 00340004
 /*                           - CALL-BACK-TIME                       */ 00350004
 /*                           - HOURS-FROM                           */ 00360004
 /*                           - HOURS-TO                             */ 00370004
 /*                           - ADDRESS-LINES                        */ 00380004
 /*                           - ZIP-CODE                             */ 00390004
 /*                           - CPU                                  */ 00400004
 /*                                                                  */ 00410004
 /* INPUT            : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00420004
 /*                    - AN INDICATOR TELLING WHICH TYPE OF ROW      */ 00430004
 /*                      WAS RETRIEVED                               */ 00440004
 /*                    - THE STRUCTURE OF THE 3 LAM'S INVOLVED       */ 00450004
 /*                    - FILE RCBDSB0                                */ 00460004
 /*                                                                  */ 00470004
 /* OUTPUT           : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00480004
 /*                    - FILE RCBDSB0 (POSSIBLY MODIFIED)            */ 00490004
 /*                    - AN ACCEPT/IGNORE-INDICATOR                  */ 00500004
 /*                    - FILE : RCB0M10                              */ 00510004
 /*                                                                  */ 00520004
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00530004
 /*                                                                  */ 00540004
 /* MESSAGES         : ----                                          */ 00550004
 /*                                                                  */ 00560004
 /* DEPENDENCIES     : NONE                                          */ 00570004
 /*                                                                  */ 00580004
 /* FREQUENCY        : ----                                          */ 00590004
 /*                                                                  */ 00600004
 /*  MAINTENANCE LOG :                                               */ 00610004
 /*  ---------------                                                 */ 00620004
 /*                                                                  */ 00630004
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00640004
 /*  --------------------------------------------------------------  */ 00650004
 /*  1998-09-16 | RA01214      | CCMS EXTRACT                        */ 00660004
 /*                                                                  */ 00670004
 /*  1999-11-02 |LOCAL CHANGES | NORDIC REGION UPDATES         BG    */ 00680004
 /*  1999-11-08 |RUN ONCE CNTL | ADD CENTRAL REGION CODE       SG    */ 00690004
 /*  1999-11-08 |RONORTH       | ADD REGION NORTH RO CODE      CP    */ 00700004
 /*  2000-07-17 |   BG Mod1    | NORDIC REGION UPDATES AFTER REVISED */ 00710004
 /*             |              | SUPPORT LINE                        */ 00720004
 /*  2001-11-08 |RONORTH - 788 | ADD RO CODE FOR '788'         SR    */ 00730004
 /*  2001-08-07 |RONORTH - 864 | CHANGE NO. C0030-0601         SR    */ 00740004
 /*  2001-09-19 |All Regions   | CHANGE NO. C0038-0901               */ 00750004
 /*             |              | Coverage hours for SLV2       SR    */ 00760004
 /*  2002-02-01 |CHG0156A      | Remove 'LEAVE LOOPFF' for Ctry 848  */ 00770004
 /*             |              | from ELSE DO; Statement             */ 00780004
 /*             |              |                               BRAD */  00790004
 /*  2002-03-11 |CHG0161A/     | Coverage hours for SLV2 for all     */ 00800004
 /*             |C0054-0202    | central countries  SR               */ 00810004
 /*             |              |                               BRAD */  00820004
 /*  2002-04-15 |CHG0262A/     | Logic for Coverage hours SLV2 to be */ 00830004
 /*             |C0082-0403    | commented implemented via C0054,    */ 00840004
 /*             |              | C0038 changes                       */ 00850004
 /*  2003-07-18 |CHG0283A/     | Assign Balance units and count      */ 00860004
 /*             |C0088-0703    | for 724 and 618                     */ 00870004
 /*  2003-09-04 |CHG0290A/     | Assign Callback Time for            */ 00880004
 /*             |C0090-0903    | all CCMS countries                  */ 00890004
 /*  2005-06-30 |CHG0378A      | Remove IOBJNIK check for South      */ 00900004
 /*             |              | Countries 758, 822 & 838            */ 00910004
 /*  2005-07-21 |CHG0378B      | Put Back IOBJNIK check for South    */ 00920004
 /*             |              | Countries 758, 822 & 838            */ 00930004
 /*  2005-12-28 |CHG0394I      | ADDING THE IF CONDITION FOR         */ 00940004
 /*             |              | LAM_QCH0CMSO.CXIDSRC                */ 00950004
 /*  2006-12-17 |chg0396a      | SLA hrs change for west             */ 00960004
 /*  2010-08-02 |R09-0047      | Removed warning Message 'ENTER JVB  */ 00961024
 /*             |              | CODE NOW'                           */ 00962024
 /********************************************************************/ 00970004
1RCBDS2U: PROC    (PTR_SWITCH_USER_EXIT,                                00980004
                   PTR_TYPE_INDICATOR,                                  00990004
                   PTR_ACCEPT_INDICATOR,                                01000004
                   PTR_LAM_AREA,                                        01010004
                   PTR_FILE_RCBDSB0,                                    01020004
                   PTR_INT_AREA)                                        01030004
          REORDER;                                                      01040004
0              @MTF2RC: ENTRY;     DCL @SCHFIRST BIT(1)                 01050004
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 01060004
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 01070004
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 01080004
               EDIT    ('RCBDS2U  VERSION 1999.08.25' ,                 01090004
               ' 14H32.39      MIT DEM VERSIONS-ENTRY',                 01100004
               ' @MTF2RC',' ')     (SKIP,A,A,A,SKIP,A);                 01110004
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 01120004
               END;     /* ENDE DER VERSIONS-GRUPPE  */                 01130004
0DEFAULT RANGE (*)        STATIC;                                       01140004
1/********************************************************************/ 01150004
 /*  PARAMETERS                                                      */ 01160004
 /********************************************************************/ 01170004
0DCL PTR_SWITCH_USER_EXIT    PTR;                                       01180004
 DCL PTR_TYPE_INDICATOR      PTR;                                       01190004
 DCL PTR_ACCEPT_INDICATOR    PTR;                                       01200004
 DCL PTR_LAM_AREA            PTR;                                       01210004
 DCL PTR_FILE_RCBDSB0        PTR;                                       01220004
0DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 01230004
1/********************************************************************/ 01240004
 /*  EXTERNAL ENTRIES                                                */ 01250004
 /********************************************************************/ 01260004
0DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 01270004
0/********************************************************************/ 01280004
 /* ON ERROR CONDITIONS                                              */ 01290004
 /********************************************************************/ 01300004
0%INCLUDE (RCB0E0M);                                                    01310004
  END;                                                                  01320004
 /********************************************************************/ 01330004
 /*                                                                  */ 01340004
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 01350004
 /* AND CALL THE ERROR ROUTINE:                                      */ 01360004
 /*                                                                  */ 01370004
 /*                                                                  */ 01380004
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 01390004
 /*                                                                  */ 01400004
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 01410004
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 01420004
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 01430004
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 01440004
 /*                                                                  */ 01450004
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 01460004
 /*                                                                  */ 01470004
 /********************************************************************/ 01480004
0/********************************************************************/ 01490004
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01500004
 /********************************************************************/ 01510004
0DCL SWITCH_USER_EXIT   BIT(1) BASED (PTR_SWITCH_USER_EXIT);            01520004
0DCL TYPE_INDICATOR    CHAR(1) BASED (PTR_TYPE_INDICATOR);              01530004
0DCL ACCEPT_INDICATOR  CHAR(1) BASED (PTR_ACCEPT_INDICATOR);            01540004
0DCL 1 LAM_QCH0CMSO            BASED (PTR_LAM_AREA),                    01550004
      %INCLUDE (QCH0CMSO);;                                             01560004
0DCL 1 LAM_QCH0RSSO            BASED (PTR_LAM_AREA),                    01570004
      %INCLUDE (QCH0RSSO);;                                             01580004
0DCL 1 LAM_QCH0SCSO            BASED (PTR_LAM_AREA),                    01590004
      %INCLUDE (QCH0SCSO);;                                             01600004
0DCL 1 FILE_RCBDSB0            BASED (PTR_FILE_RCBDSB0),                01610004
      %INCLUDE (RCBDSBS);;                                              01620004
0DCL 1 PARM_INT_AREA           BASED (PTR_INT_AREA),                    01630004
      %INCLUDE (RCBZ01S);;                                              01640004
1/********************************************************************/ 01650004
 /*  BIT SWITCHES                                                    */ 01660004
 /********************************************************************/ 01670004
0DCL TRUE     BIT (1) INIT ('1'B);                                      01680004
 DCL FALSE    BIT (1) INIT ('0'B);                                      01690004
0/********************************************************************/ 01700004
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01710004
 /********************************************************************/ 01720004
0DCL 1 WORK_FIELDS,                                                     01730004
       3 WRK_LEVEL      FIXED BIN (15),                                 01740004
       3 WRK_INDNULL    FIXED BIN (15);                                 01750004
 /* ROSOUTH */                                                          01760004
 DCL WORK_CHARSET1 CHAR(90) STATIC INTERNAL                             01770004
     INIT(('[*/|§£#&()_+-=.,;:éàè 0123456789'                           01780004
       || 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'        01790004
       || '7D7F'X));                                                    01800004
 DCL WORK_CHARSET2 CHAR(11) STATIC INTERNAL INIT(' 0123456789');        01810004
 DCL WORK_POSCHAR FIXED BIN(15);                                        01820004
                                                                        01830004
 DCL L,K FIXED BIN(15);                                                 01840004
 DCL COM_HOURS FIXED BIN(15);                                           01850004
 /* ROSOUTH */                                                          01860004
1/********************************************************************/ 01870004
 /*  BUILTIN FUNCTIONS                                               */ 01880004
 /********************************************************************/ 01890004
0DCL (ADDR, LENGTH, VERIFY,         /* ROSOUTH */                       01900004
      SUBSTR,STRING,INDEX,                                              01910004
      NULL) BUILTIN;                                                    01920004
1/********************************************************************/ 01930004
 /****         LOCAL DECLARATIONS   START                         ****/ 01940004
 /********************************************************************/ 01950004
 DCL SYSPRINT FILE PRINT;                                               01960004
 DCL FIRST_TIME BIT(1)            /* FIRST TIME SWITCH TO READ FILES */ 01970004
           STATIC INIT('1'B);     /*   PDW   AND  RCBBTA0            */ 01980004
 DCL PDW FILE RECORD INPUT;       /* FILE:  TABLE WITH SERVICE HOURS */ 01990004
 DCL PDW_INPUT CHAR(132);                                               02000004
 DCL 1 PDW_RECORD BASED(ADDR(PDW_INPUT)),/* TABLE WITH SERVICE HOURS */ 02010004
       2 CTRY       CHAR(3),      /* COUNTRY NUMBER                  */ 02020004
       2 FILLER1    CHAR(1),                                            02030004
       2 TUSCSDC    CHAR(30),     /* POSSIBLE VALUE FOR TUSCSDC      */ 02040004
       2 DAYS(7),                 /* SUNDAY, MONDAY, ... , SATURDAY  */ 02050004
         3 FROM     PIC'ZZZZ9',   /*     FROM HOURS                  */ 02060004
         3 TO       PIC'ZZZZ9';   /*     TO   HOURS                  */ 02070004
 DCL 1 PDW_TABLE(*) CONTROLLED,          /* TABLE WITH SERVICE HOURS */ 02080004
       2 CTRY       CHAR(3),      /* COUNTRY NUMBER                  */ 02090004
       2 TUSCSDC    CHAR(30),     /* POSSIBLE VALUE FOR TUSCSDC      */ 02100004
       2 DAYS(7),                 /* SUNDAY, MONDAY, ... , SATURDAY  */ 02110004
         3 FROM     BIN FIXED(31),/*     FROM HOURS                  */ 02120004
         3 TO       BIN FIXED(31);/*     TO   HOURS                  */ 02130004
 DCL PDW_EOF    BIT(1)            /* END-OF-FILE INDICATOR           */ 02140004
           STATIC INIT('0'B);     /*   FOR FILE PDW                  */ 02150004
 DCL PDW_ROWS BIN FIXED(15)       /* NUMBER OF ROWS IN TABLE PDW     */ 02160004
           STATIC INIT(0);                                              02170004
 DCL PDW_I    BIN FIXED(15);      /* RUNNING INDEX FOR TABLE PDW     */ 02180004
 /********************************************************************/ 02190004
 /* 1.1 NEW STRUCTURES FOR TRANSLATE TABLE                           */ 02200004
 /********************************************************************/ 02210004
 DCL TABIN    FILE RECORD INPUT ; /* FILE:  TRANSLATE TABLE IN       */ 02220004
 DCL TABIN_INPUT CHAR(60);                                              02230004
 DCL 1 TABIN_RECRD BASED(ADDR(TABIN_INPUT)),/*TABLE WITH SERVICE HOURS*/02240004
       3 IOFFNIK    CHAR(15),     /* COUNTRY NUMBER                  */ 02250004
       3 IOBJNIK    CHAR(15),                                           02260004
       3 COBJNIK    CHAR(15),                                           02270004
       3 OOBJNIK    CHAR(15);     /*                                 */ 02280004
 DCL 1 TABIN_TABLE (*) CONTROLLED ,                                     02290004
       3 IOFFNIK    CHAR(15),     /*                                 */ 02300004
       3 IOBJNIK    CHAR(15),                                           02310004
       3 COBJNIK    CHAR(15),     /*                                 */ 02320004
       3 OOBJNIK    CHAR(15);     /*                                 */ 02330004
 DCL TABIN_EOF  BIT(1)            /* END-OF-FILE INDICATOR           */ 02340004
           STATIC INIT('0'B);     /*   FOR FILE TRANSLATE TABLE      */ 02350004
 DCL TABIN_ROWS BIN FIXED(15)      /* NUMBER OF ROWS IN TABLE TABIN   */02360004
           STATIC INIT(0);                                              02370004
 DCL TABIN_COMP BIN FIXED(15)      /* NUMBER OF ROWS IN TABLE TABIN   */02380004
           STATIC INIT(0);                                              02390004
 DCL TABIN_COMP_MATCH BIN FIXED(15) /* NUMBER OF COMP MATCH */          02400004
           STATIC INIT(0);                                              02410004
 DCL TABIN_I  BIN FIXED(15);      /* RUNNING INDEX FOR TABLE TABIN   */ 02420004
 /********************************************************************/ 02430004
 DCL RCBBTA0 RECORD INPUT;        /* FILE:  TABLE 660 CCMS SELECTION */ 02440004
 DCL 1 BTAF_RECORD,                        /* CCMS SELECTION TABLE   */ 02450004
      %INCLUDE (RCBBTAS0);;                                             02460004
 DCL 1 BTAF_TABLE(*) CONTROLLED,  /* TABLE WITH OFFERING ID'S        */ 02470004
       2 CTRY       CHAR(3),      /* COUNTRY NUMBER                  */ 02480004
       2 STYPE_ID   CHAR(1),      /* SOURCE TYPE IDENTIFIER          */ 02490004
       2 OFFER_ID   CHAR(15),     /* OFFERING ID'S                   */ 02500004
       2 MAIN_OBJ   CHAR(15);                                           02510004
 DCL BTAF_EOF   BIT(1)            /* END-OF-FILE INDICATOR           */ 02520004
           STATIC INIT('0'B);     /*   FOR FILE RCBBTA0              */ 02530004
 DCL BTAF_ROWS BIN FIXED(15)      /* NUMBER OF ROWS IN TABLE BTAF    */ 02540004
           STATIC INIT(0);                                              02550004
 DCL BTAF_I   BIN FIXED(15);      /* RUNNING INDEX FOR TABLE BTAF    */ 02560004
 DCL I BINARY FIXED(31) INITIAL(0);                 /* LOOP VARIABLE */ 02570004
                                  /* BG Mod1                         */ 02580004
 DCL CO_NUMBER_OLD   CHAR(6);     /* CONTRACT ID                     */ 02590004
 /********************************************************************/ 02600004
 /****         LOCAL DECLARATIONS   END                           ****/ 02610004
 /********************************************************************/ 02620004
1/********************************************************************/ 02630004
 /* DB2/SQL SQLCA                                                    */ 02640004
 /********************************************************************/ 02650004
0 EXEC SQL                                                              02660004
    INCLUDE SQLCA                                                       02670004
    ;                                                                   02680004
1/********************************************************************/ 02690004
 /*                 S T A R T   P R O C E S S I N G                  */ 02700004
 /********************************************************************/ 02710004
0                                        /* SET LEVEL AND MOD NAME   */ 02720004
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            02730004
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     02740004
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBDS2U';                     02750004
0                                        /* USER DEFINED PROCESS     */ 02760004
 SWITCH_USER_EXIT = TRUE;                                               02770004
 /*SELECT (TYPE_INDICATOR);                                             02780004
   WHEN ('Y')                                                           02790004
     DO;                                                                02800004
                                         /* THE USER CAN DEFINE HERE */ 02810004
                                         /* STATEMENTS TO OVERWRITE  */ 02820004
                                         /* THE VALUE FOR HOURS_FROM,*/ 02830004
                                         /* HOURS_TO, CALL_BACK_TIME */ 02840004
   /*END; */                                                            02850004
 /*WHEN ('R')                                                           02860004
     DO;                                                                02870004
                                         /* THE USER CAN DEFINE HERE */ 02880004
                                         /* STATEMENTS TO OVERWRITE  */ 02890004
                                         /* THE VALUE FOR BALANCE AND*/ 02900004
                                         /* BALANCE_UNITS            */ 02910004
   /*END;*/                                                             02920004
 /*WHEN ('O')                                                           02930004
     DO;                                                                02940004
                                         /* THE USER CAN DEFINE HERE */ 02950004
                                         /* STATEMENTS TO SET THE    */ 02960004
                                         /* VALUE FOR THE ACCEPT_IND.*/ 02970004
                                         /* 'Y' TO ACCEPT THE RECORD,*/ 02980004
                                         /* 'N' TO IGNORE THE RECORD */ 02990004
   /*END;*/                                                             03000004
 /*WHEN ('N')                                                           03010004
     DO;                                                                03020004
                                         /* THE USER CAN DEFINE HERE */ 03030004
                                         /* STATEMENTS TO OVERWRITE  */ 03040004
                                         /* THE VALUE FOR ALL FIELDS,*/ 03050004
                                         /* MENTIONED IN THE PROLOG  */ 03060004
   /*END;                                                               03070004
   OTHERWISE;                                                           03080004
   END;*/                                /* END OF SELECT-STATEMENT  */ 03090004
1/********************************************************************/ 03100004
 /****    LOKALE AENDERUNG   BEGINN                               ****/ 03110004
 /********************************************************************/ 03120004
 /* THE FOLLOWING BLOCK OF CODE IS EXECUTED ONLY                     */ 03130004
 /*       WHEN EXIT IS ENTERED FIRST TIME.                           */ 03140004
 /********************************************************************/ 03150004
 IF FIRST_TIME = TRUE THEN DO;    /* IF IT IS THE FIRST TIME THE EXIT*/ 03160004
    FIRST_TIME = FALSE;           /*   IS ENTERED THEN EXECUTE BLOCK */ 03170004
 /********************************************************************/ 03180004
 /* READ IN TABLE WITH SERVICE HOUR DEFINITIONS                      */ 03190004
 /********************************************************************/ 03200004
    PDW_ROWS = 0;                                                       03210004
    OPEN FILE(PDW);                                                     03220004
    ON ENDFILE(PDW)               /* END-OF-FILE REACHED FOR PDW     */ 03230004
       PDW_EOF = TRUE;                                                  03240004
    READ FILE(PDW) INTO(PDW_INPUT);                                     03250004
                                  /* COUNT NUMBER OF VALID TABLE     */ 03260004
    DO WHILE(PDW_EOF = FALSE);    /*   ROWS FOR ALLOCATION           */ 03270004
       IF SUBSTR(PDW_INPUT,1,1) = '*' THEN;                             03280004
                                      ELSE PDW_ROWS = PDW_ROWS + 1;     03290004
       READ FILE(PDW) INTO(PDW_INPUT);                                  03300004
    END;                                                                03310004
    CLOSE FILE(PDW);                                                    03320004
                                  /* PROGRAM COULD BE ABENDED AT THIS*/ 03330004
                                  /* POINT IF VALUE OF PDW_ROWS IS 0 */ 03340004
    PDW_EOF = FALSE;                                                    03350004
    ALLOCATE PDW_TABLE (PDW_ROWS);                                      03360004
    OPEN FILE(PDW);               /* RE-OPEN FILE TO READ AND STORE  */ 03370004
                                  /*  ALL VALID ROWS.                */ 03380004
    READ FILE(PDW) INTO(PDW_INPUT);                                     03390004
    PDW_I = 0;                    /* SET RUNNING INDEX FOR TABLE     */ 03400004
    DO WHILE(PDW_EOF = FALSE);    /*                                 */ 03410004
       IF SUBSTR(PDW_INPUT,1,1) = '*' THEN;   /* SKIP COMMENT LINES  */ 03420004
                                      ELSE DO;                          03430004
          PDW_I = PDW_I + 1;      /* GO TO NEXT ROW                  */ 03440004
                                  /* STORE VALUES IN TABLE           */ 03450004
          PDW_TABLE.CTRY(PDW_I) = PDW_RECORD.CTRY;                      03460004
          PDW_TABLE.TUSCSDC(PDW_I) = PDW_RECORD.TUSCSDC;                03470004
          PDW_TABLE(PDW_I).DAYS.FROM(*) = PDW_RECORD.DAYS.FROM(*);      03480004
          PDW_TABLE(PDW_I).DAYS.TO  (*) = PDW_RECORD.DAYS.TO  (*);      03490004
          END;                                                          03500004
                                                                        03510004
       READ FILE(PDW) INTO(PDW_INPUT);   /* READ NEXT TABLE RECORD   */ 03520004
    END;                                                                03530004
                                         /* ALL TABLE RECORDS READ   */ 03540004
    CLOSE FILE(PDW);                     /*   AND STORED             */ 03550004
 /********************************************************************/ 03560004
 /* TABLE WITH SERVICE HOUR DEFINITIONS NOW FILLED FOR CHECKING AND  */ 03570004
 /*    SETTING THE RELEVANT RCBDSB0 FIELDS.                          */ 03580004
 /********************************************************************/ 03590004
                                                                        03600004
1/********************************************************************/ 03610004
 /* READ IN TABLE WITH SERVICE OFFERING ID'S TO BE ACCEPTED          */ 03620004
 /********************************************************************/ 03630004
    BTAF_ROWS = 0;                                                      03640004
    OPEN FILE(RCBBTA0);                                                 03650004
    ON ENDFILE(RCBBTA0)         /* END-OF-FILE REACHED FOR RCBBTA0   */ 03660004
       BTAF_EOF = TRUE;                                                 03670004
    READ FILE(RCBBTA0) INTO(BTAF_RECORD);                               03680004
                                  /* COUNT NUMBER OF VALID TABLE     */ 03690004
    DO WHILE(BTAF_EOF = FALSE);   /*   ROWS FOR ALLOCATION           */ 03700004
       IF BTAF_RECORD.SOURCE_TYPE_ID = 'C' THEN                         03710004
                                       BTAF_ROWS = BTAF_ROWS + 1;       03720004
       READ FILE(RCBBTA0) INTO(BTAF_RECORD);                            03730004
    END;                                                                03740004
    CLOSE FILE(RCBBTA0);                                                03750004
                                  /* PROGRAM COULD BE ABENDED AT THIS*/ 03760004
                                  /* POINT IF VALUE OF BTAF_ROWS IS 0*/ 03770004
    BTAF_EOF = FALSE;                                                   03780004
    ALLOCATE BTAF_TABLE (BTAF_ROWS);                                    03790004
    OPEN FILE(RCBBTA0);           /* RE-OPEN FILE TO READ AND STORE  */ 03800004
                                  /*  ALL VALID ROWS.                */ 03810004
    READ FILE(RCBBTA0) INTO(BTAF_RECORD);                               03820004
    BTAF_I = 0;                   /* SET RUNNING INDEX FOR TABLE     */ 03830004
    DO WHILE(BTAF_EOF = FALSE);   /*                                 */ 03840004
       IF BTAF_RECORD.SOURCE_TYPE_ID = 'C' THEN DO;                     03850004
          BTAF_I = BTAF_I + 1;    /* GO TO NEXT ROW                  */ 03860004
                                  /* STORE VALUES IN TABLE           */ 03870004
          BTAF_TABLE.CTRY(BTAF_I) = BTAF_RECORD.COUNTRY_NUMBER;         03880004
          BTAF_TABLE.STYPE_ID(BTAF_I) = BTAF_RECORD.SOURCE_TYPE_ID;     03890004
          BTAF_TABLE.OFFER_ID(BTAF_I) = BTAF_RECORD.CCMS_OFFERING_ID;   03900004
          BTAF_TABLE.MAIN_OBJ(BTAF_I) = BTAF_RECORD.MAIN_OBJECT ;       03910004
          END;                                                          03920004
                                                                        03930004
       READ FILE(RCBBTA0)         /* READ NEXT SELECTION RECORD      */ 03940004
            INTO(BTAF_RECORD);                                          03950004
    END;                                                                03960004
                                         /* ALL TABLE RECORDS READ   */ 03970004
    CLOSE FILE(RCBBTA0);                 /*   AND STORED             */ 03980004
                                                                        03990004
 /********************************************************************/ 04000004
 /* TABLE WITH ALL OFFERING SELECTION ID'S TO BE ACCEPTED ARE STORED */ 04010004
 /********************************************************************/ 04020004
    PUT FILE(SYSPRINT) SKIP                                             04030004
        EDIT('RCBDS1U: NUMBER OF PDW-RECORDS STORED: ',PDW_ROWS,        04040004
             '         NUMBER OF BTAF-RECORDS STORED:',BTAF_ROWS)       04050004
             (A,F(5),SKIP,A,F(5));                                      04060004
    END;                                                                04070004
 /********************************************************************/ 04080004
 /* END OF BLOCK BEING EXECUTED ONLY WHEN ENTERED FIRST TIME.        */ 04090004
 /********************************************************************/ 04100004
1SELECT (LAM_QCH0CMSO.IOPUCTY);  /* EACH LAM HAS IOPUCTY SAME POS    */ 04110004
                                                                        04120004
   WHEN ('678','702','806','846') DO; /** WHEN ('678',...) START NORD*/ 04130004
                                                                        04140004
     SELECT(TYPE_INDICATOR);                                            04150004
       WHEN ('O')        /****** WHEN ('O') START ********************/ 04160004
       DO;                                                              04170004
         ACCEPT_INDICATOR = 'N';                                        04180004
 /**/PUT SKIP LIST ('Accept Indicator',ACCEPT_INDICATOR);               04190004
 /**/PUT SKIP LIST ('Ioffnik',LAM_QCH0CMSO.IOFFNIK);                    04200004
                   /* SET ACCEPT_INDICATOR TO N BY DEFAULT.          */ 04210004
                   /* SEARCH TABLE BTAF_TABLE FOR OFFERING ID        */ 04220004
                   /*    AND SET ACCEPT_INDICATOR TO YES IF FOUND.   */ 04230004
 LOOPAA:           /*                                                */ 04240004
         DO BTAF_I = 1 TO BTAF_ROWS;                                    04250004
            IF BTAF_TABLE.CTRY(BTAF_I) = LAM_QCH0CMSO.IOPUCTY THEN      04260004
               IF LAM_QCH0CMSO.IOFFNIK = BTAF_TABLE.OFFER_ID(BTAF_I)    04270004
                  THEN DO;                                              04280004
                  ACCEPT_INDICATOR = 'Y';                               04290004
                  LEAVE LOOPAA;                                         04300004
                  END;                                                  04310004
         END;                                                           04320004
       END;              /****** WHEN ('O') END **********************/ 04330004
                                                                        04340004
                                                                        04350004
       WHEN ('Y')        /****** WHEN ('Y') START ********************/ 04360004
       DO;                                                              04370004
          IF CO_NUMBER_OLD ¬= LAM_QCH0SCSO.IAGRCID   /* BG Mod1  */     04380004
               THEN DO;                              /* BG Mod1  */     04390004
          FILE_RCBDSB0.HOURS_FROM(*) = 0;  /* SET HOURS TO STANDARD  */ 04400004
          FILE_RCBDSB0.HOURS_TO(*) = 0;    /*    VALUE ZERO          */ 04410004
           END;                                      /* BG Mod1  */     04420004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 04430004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 04440004
 LOOPBB:                 /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 04450004
          DO PDW_I = 1 TO PDW_ROWS;                                     04460004
             IF PDW_TABLE.CTRY(PDW_I) = LAM_QCH0CMSO.IOPUCTY THEN       04470004
                IF LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I) |    04480004
                   FILE_RCBDSB0.BASE_SC = PDW_TABLE.TUSCSDC(PDW_I)      04490004
                                                                        04500004
                   THEN DO;                                             04510004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         04520004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          04530004
                   FILE_RCBDSB0.HOURS_TO(*) =                           04540004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            04550004
                   CO_NUMBER_OLD = LAM_QCH0SCSO.IAGRCID;                04560004
                   LEAVE LOOPBB;                                        04570004
                   END;                                                 04580004
          END;                                                          04590004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0  /*C0090*/ 04600004
          THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;              /*-0903*/ 04610004
          /************ Begin C0038-0901 ****************************/  04620004
                                                                        04630004
          /************ Begin C0082-0403 ****************************/  04640004
          /*IF SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,5) = '6942 '        04650004
          THEN DO;                                                      04660004
              FILE_RCBDSB0.HOURS_FROM(*) = 0;                           04670004
              FILE_RCBDSB0.HOURS_TO(*)   = 1440;                        04680004
          END;*/                                                        04690004
          /************ End  C0082-0403 ****************************/   04700004
                                                                        04710004
 /**/PUT SKIP LIST ('Product def id :',FILE_RCBDSB0.PRODUCT_DEF_ID);    04720004
 /**/PUT SKIP LIST ('Hours From     :',FILE_RCBDSB0.HOURS_FROM(1));     04730004
 /**/PUT SKIP LIST ('Hours To       :',FILE_RCBDSB0.HOURS_FROM(1));     04740004
 /**/PUT SKIP LIST ('Hours From     :',FILE_RCBDSB0.HOURS_FROM(3));     04750004
 /**/PUT SKIP LIST ('Hours To       :',FILE_RCBDSB0.HOURS_FROM(3));     04760004
 /**/PUT SKIP LIST ('Hours From     :',FILE_RCBDSB0.HOURS_FROM(5));     04770004
 /**/PUT SKIP LIST ('Hours To       :',FILE_RCBDSB0.HOURS_FROM(5));     04780004
 /**/PUT SKIP LIST ('Hours From     :',FILE_RCBDSB0.HOURS_FROM(7));     04790004
 /**/PUT SKIP LIST ('Hours To       :',FILE_RCBDSB0.HOURS_FROM(7));     04800004
          /************ End   C0038-0901 ****************************/  04810004
       END;              /****** WHEN ('Y') END **********************/ 04820004
                                                                        04830004
       WHEN ('R')        /**  WHEN ('R') assign balance fields  *****/  04840004
          DO;                                                           04850004
          /************ start C0088-0703 ****************************/  04860004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           04870004
                                       LAM_QCH0RSSO.QUNITSA ;           04880004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           04890004
          /************ end   C0088-0703 ****************************/  04900004
          END;                                                          04910004
                                                  /* BG Mod1  */        04920004
       WHEN ('N')        /** WHEN ('N') - CORRECTION OF RCBDSB0.CPU **/ 04930004
                         /** DUE TO CHANGES IN RCBDSBM (PTF 15)     **/ 04940004
                         /** WRITE CPU ACCORDING TO NORDIC STANDARD **/ 04950004
                         /**           2000.02.01                   **/ 04960004
        DO;                                                             04970004
         IF (LAM_QCH0CMSO.CXIDSRC ¬= 'A') THEN                          04980004
              DO;                                                       04990004
               SELECT (LAM_QCH0CMSO.CXIDSRC);                           05000004
                WHEN ('E')                                              05010004
                 DO;                                                    05020004
                  SELECT (SUBSTR(LAM_QCH0CMSO.IOVSNIK,8,1));            05030004
                   WHEN (' ')                                           05040004
                    DO;                                                 05050004
                    END;                                                05060004
                   WHEN ('-')                                           05070004
                    DO;                                                 05080004
                    END;                                                05090004
                   OTHERWISE                                            05100004
                    DO;                                                 05110004
               FILE_RCBDSB0.CPU = SUBSTR(LAM_QCH0CMSO.IOVSNIK,1,4) ||   05120004
                               SUBSTR(LAM_QCH0CMSO.IOVSNIK,6,2) ||      05130004
                         '00' || SUBSTR(LAM_QCH0CMSO.IOVSNIK,8,5);      05140004
                    END;                                                05150004
                  END;                /* END SELECT SUBSTR.... */       05160004
                 END;                                                   05170004
                OTHERWISE;                                              05180004
               END;                   /* END SELECT CXIDSRC... */       05190004
         END;                                                           05200004
        END;              /* END WHEN ('N')  */                         05210004
                                                  /* BG Mod1  */        05220004
       OTHERWISE;                                                       05230004
                                                                        05240004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 05250004
                                                                        05260004
   END;             /****** WHEN ('678',...) END NORDIC **************/ 05270004
                                                                        05280004
   WHEN ('758') DO; /** WHEN ('758',...) START     */                   05290004
                                                                        05300004
     SELECT(TYPE_INDICATOR);                                            05310004
       WHEN ('O')        /*----- WHEN ('O') START ------------- 758 -*/ 05320004
       DO;                                                              05330004
         ACCEPT_INDICATOR = 'N';                                        05340004
                         /* SET ACCEPT_INDICATOR TO N BY DEFAULT.    */ 05350004
                         /* SEARCH TABLE BTAF_TABLE FOR OFFERING ID  */ 05360004
                         /* AND SET ACCEPT_INDICATOR TO YES IF FOUND.*/ 05370004
 LOOPIT1:                 /*                                          */05380004
         DO BTAF_I = 1 TO BTAF_ROWS;                                    05390004
            IF BTAF_TABLE.CTRY(BTAF_I) = LAM_QCH0CMSO.IOPUCTY           05400004
             & LAM_QCH0CMSO.IOFFNIK = BTAF_TABLE.OFFER_ID(BTAF_I)       05410004
             & LAM_QCH0CMSO.IOBJNIK = BTAF_TABLE.MAIN_OBJ(BTAF_I)       05420004
            THEN DO;                                                    05430004
                 ACCEPT_INDICATOR = 'Y';                                05440004
                 LEAVE LOOPIT1;                                         05450004
            END;                                                        05460004
         END;                                                           05470004
       END;              /*----- WHEN ('O') END --------------- 758 -*/ 05480004
                                                                        05490004
                                                                        05500004
       WHEN ('Y')        /*----- WHEN ('Y') START ------------- 758 -*/ 05510004
       DO;                                                              05520004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 05530004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 05540004
                         /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 05550004
                                                                        05560004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'COVERAGE') > 0 /* 03-08-2001 */05570004
          THEN DO ;                                                     05580004
 LOOPIT2:                                                               05590004
             DO PDW_I = 1 TO PDW_ROWS;                   /*20-03-2002*/ 05600004
                IF LAM_QCH0SCSO.IOPUCTY = PDW_TABLE.CTRY(PDW_I)         05610004
                 & LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I)      05620004
                THEN DO;                                                05630004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         05640004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          05650004
                   FILE_RCBDSB0.HOURS_TO(*) =                           05660004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            05670004
                   LEAVE LOOPIT2;                                       05680004
                END;                                                    05690004
             END;                                                       05700004
          END;                                                          05710004
                                                /*17-03-2003 - start */ 05720004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0            05730004
          THEN DO ;                                                     05740004
 LOOPIT3:                                                               05750004
             DO PDW_I = 1 TO PDW_ROWS;                                  05760004
                IF LAM_QCH0SCSO.IOPUCTY = PDW_TABLE.CTRY(PDW_I)         05770004
                 & LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I)      05780004
                THEN DO;                                                05790004
                   FILE_RCBDSB0.CALL_BACK_TIME =                        05800004
                                PDW_TABLE(PDW_I).DAYS(1).FROM;          05810004
                   LEAVE LOOPIT3;                                       05820004
                END;                                                    05830004
             END;                                                       05840004
          END;                                                          05850004
                                                /*17-03-2003 - END   */ 05860004
       END;              /*----- WHEN ('Y') END --------------- 758 -*/ 05870004
                                                                        05880004
       WHEN ('R');       /*----- WHEN ('R') - DO NOTHING ------ 758 -*/ 05890004
                                                                        05900004
     WHEN ('N') /* THE USER CAN DEFINE HERE STATEMENTS TO OVERWRITE  */ 05910004
       DO;      /* THE VALUE FOR ALL FIELDS,MENTIONED IN THE PROLOG  */ 05920004
         IF ADDRESS_LINES(2) ¬= '*' THEN                                05930004
           ADDRESS_LINES(1) = STRIP(ADDR(ADDRESS_LINES(1)))             05940004
                            || ' '                                      05950004
                            || ADDRESS_LINES(2);                        05960004
         ELSE                               /*  23-11-1999        */    05970004
           ADDRESS_LINES(1) = STRIP(ADDR(ADDRESS_LINES(1))) ;           05980004
                                                                        05990004
         ADDRESS_LINES(2) = ADDRESS_LINES(4);                           06000004
         ADDRESS_LINES(3) = SUBSTR(ADDRESS_LINES(5), 7, 24);            06010004
                                                                        06020004
         ZIP_CODE         = SUBSTR(ADDRESS_LINES(5), 1, 5);             06030004
                                                                        06040004
         ADDRESS_LINES(4), ADDRESS_LINES(5) = ' ';                      06050004
                                                                        06060004
         COM_HOURS = 0 ;                                                06070004
         DO L = 1 TO 7 ;                                                06080004
            COM_HOURS = COM_HOURS + FILE_RCBDSB0.HOURS_FROM(L) +        06090004
                        FILE_RCBDSB0.HOURS_TO(L) ;                      06100004
         END ;                                                          06110004
         IF COM_HOURS = 0                                               06120004
         THEN DO ;                                                      06130004
            FILE_RCBDSB0.HOURS_FROM(*) = 480;/*SET HOURS TO STANDARD */ 06140004
            FILE_RCBDSB0.HOURS_TO(*) = 1140;                            06150004
            FILE_RCBDSB0.HOURS_FROM(1) = 0;  /*SET HOURS TO STANDARD  */06160004
            FILE_RCBDSB0.HOURS_TO(1) = 0;    /*   VALUE ZERO SUNDAY   */06170004
            FILE_RCBDSB0.HOURS_FROM(7) = 0;  /*SET HOURS TO STANDARD  */06180004
            FILE_RCBDSB0.HOURS_TO(7) = 0;    /*   VALUE ZERO SATURDAY */06190004
         END;                                                           06200004
       END;                                                             06210004
                                                                        06220004
       OTHERWISE;                                                       06230004
                                                                        06240004
     END;                /*- SELECT TYPE_INDICATOR - END ------------*/ 06250004
                                                                        06260004
                                                                        06270004
   END;             /****** WHEN ('758') END *************************/ 06280004
                                                                        06290004
   WHEN ('822') DO;      /*- WHEN ('822') START                      */ 06300004
                                                                        06310004
     SELECT(TYPE_INDICATOR);                                            06320004
       WHEN ('O')        /*----- WHEN ('O') START ------------- 822 -*/ 06330004
       DO;                                                              06340004
         ACCEPT_INDICATOR = 'N';                                        06350004
                         /* SET ACCEPT_INDICATOR TO N BY DEFAULT.    */ 06360004
                         /* SEARCH TABLE BTAF_TABLE FOR OFFERING ID  */ 06370004
                         /* AND SET ACCEPT_INDICATOR TO YES IF FOUND.*/ 06380004
 LOOPPO1:                 /*                                          */06390004
         DO BTAF_I = 1 TO BTAF_ROWS;                                    06400004
            IF BTAF_TABLE.CTRY(BTAF_I) = LAM_QCH0CMSO.IOPUCTY           06410004
             & LAM_QCH0CMSO.IOFFNIK = BTAF_TABLE.OFFER_ID(BTAF_I)       06420004
             & LAM_QCH0CMSO.IOBJNIK = BTAF_TABLE.MAIN_OBJ(BTAF_I)       06430004
            THEN DO;                                                    06440004
                 ACCEPT_INDICATOR = 'Y';                                06450004
                 LEAVE LOOPPO1;                                         06460004
            END;                                                        06470004
         END;                                                           06480004
       END;              /*----- WHEN ('O') END --------------- 822 -*/ 06490004
                                                                        06500004
                                                                        06510004
       WHEN ('Y')        /*----- WHEN ('Y') START ------------- 822 -*/ 06520004
       DO;                                                              06530004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 06540004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 06550004
                         /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 06560004
                                                                        06570004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'COVERAGE') > 0 /* 03-08-2001 */06580004
          THEN DO ;                                                     06590004
 LOOPPO2:                                                               06600004
             DO PDW_I = 1 TO PDW_ROWS;                                  06610004
                IF LAM_QCH0SCSO.IOPUCTY = PDW_TABLE.CTRY(PDW_I)         06620004
                 & LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I)      06630004
                THEN DO;                                                06640004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         06650004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          06660004
                   FILE_RCBDSB0.HOURS_TO(*) =                           06670004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            06680004
                   LEAVE LOOPPO2;                                       06690004
                END;                                                    06700004
             END;                                                       06710004
          END;                                                          06720004
                                                /*17-03-2003 - START */ 06730004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0            06740004
          THEN DO ;                                                     06750004
 LOOPPO3:                                                               06760004
             DO PDW_I = 1 TO PDW_ROWS;                                  06770004
                IF LAM_QCH0SCSO.IOPUCTY = PDW_TABLE.CTRY(PDW_I)         06780004
                 & LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I)      06790004
                THEN DO;                                                06800004
                   FILE_RCBDSB0.CALL_BACK_TIME =                        06810004
                                PDW_TABLE(PDW_I).DAYS(1).FROM;          06820004
                   LEAVE LOOPPO3;                                       06830004
                END;                                                    06840004
             END;                                                       06850004
          END;                                                          06860004
                                                /*17-03-2003 - END   */ 06870004
       END;              /*----- WHEN ('Y') END --------------- 822 -*/ 06880004
                                                                        06890004
       WHEN ('R');       /*----- WHEN ('R') - DO NOTHING ------ 822 -*/ 06900004
                                                                        06910004
       WHEN ('N');       /*----- WHEN ('N') - DO NOTHING ------ 822 -*/ 06920004
                                                                        06930004
       OTHERWISE;                                                       06940004
                                                                        06950004
     END;                /*-- SELECT TYPE_INDICATOR - END ----- 822 -*/ 06960004
                                                                        06970004
   END;                  /*-- WHEN ('822') END ---------------- 822 -*/ 06980004
                                                                        06990004
   WHEN ('838',       /*-- WHEN ('838') START -------------- 838 -*/    07000004
         '726',       /*-- WHEN ('726') START -------------- 726 -*/    07010004
         '862',       /*-- WHEN ('862') START -------------- 862 -*/    07020004
         '755',       /*-- WHEN ('755') START -------------- 755 -*/    07030004
         '666',       /*-- WHEN ('666') START -------------- 666 -*/    07040018
         '704','826','620','808',                                       07043021
         '358','363','603','607',                                       07044021
         '626','694','695','699',                                       07045021
         '705','707','741','787',                                       07046021
         '889','610','636','645',                                       07047021
         '669','698','725','762',                                       07048021
         '764','768','769','770',                                       07049021
         '780','804','832','825',                                       07049121
         '831','849','851','857',                                       07049522
         '865','883','642','677',                                       07049622
         '767','805','823','359',                                       07049722
         '651') DO;                                                     07049822
                      /**** CHG008C ****/                               07050019
     SELECT(TYPE_INDICATOR);                                            07060004
       WHEN ('O')        /*-- WHEN ('O') START - 838,726,862,755,666-*/ 07070004
       DO;                                                              07080004
         ACCEPT_INDICATOR = 'N';                                        07090004
                   /* SET ACCEPT_INDICATOR TO N BY DEFAULT.          */ 07100004
                   /* SEARCH TABLE BTAF_TABLE FOR OFFERING ID        */ 07110004
                   /*    AND SET ACCEPT_INDICATOR TO YES IF FOUND.   */ 07120004
 LOOPSP1:          /*                                                */ 07130004
         DO BTAF_I = 1 TO BTAF_ROWS;                                    07140004
            IF BTAF_TABLE.CTRY(BTAF_I) = LAM_QCH0CMSO.IOPUCTY           07150004
             & LAM_QCH0CMSO.IOFFNIK = BTAF_TABLE.OFFER_ID(BTAF_I)       07160004
             & LAM_QCH0CMSO.IOBJNIK = BTAF_TABLE.MAIN_OBJ(BTAF_I)       07170004
            THEN DO;                                                    07180004
                 ACCEPT_INDICATOR = 'Y';                                07190004
                 LEAVE LOOPSP1;                                         07200004
            END;                                                        07210004
         END;                                                           07220004
       END;              /*--- WHEN ('O') END ---838,726,862,755,666-*/ 07230004
                                                                        07240004
                                                                        07250004
       WHEN ('Y')        /*--- WHEN ('Y') START -838,726,862,755,666-*/ 07260004
       DO;                                                              07270004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 07280004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 07290004
                         /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 07300004
                                                                        07310004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'COVERAGE') > 0 /* 03-08-2001 */07320004
          THEN DO ;                                                     07330004
 LOOPSP2:                                                               07340004
             DO PDW_I = 1 TO PDW_ROWS;                                  07350004
                IF LAM_QCH0SCSO.IOPUCTY = PDW_TABLE.CTRY(PDW_I)         07360004
                 & LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I)      07370004
                THEN DO;                                                07380004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         07390004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          07400004
                   FILE_RCBDSB0.HOURS_TO(*) =                           07410004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            07420004
                   LEAVE LOOPSP2;                                       07430004
                END;                                                    07440004
             END;                                                       07450004
          END;                                                          07460004
                                                /*17-03-2003 - START */ 07470004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0            07480004
          THEN DO ;                                                     07490004
 LOOPSP3:                                                               07500004
             DO PDW_I = 1 TO PDW_ROWS;                                  07510004
                IF LAM_QCH0SCSO.IOPUCTY = PDW_TABLE.CTRY(PDW_I)         07520004
                 & LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I)      07530004
                THEN DO;                                                07540004
                   FILE_RCBDSB0.CALL_BACK_TIME =                        07550004
                                PDW_TABLE(PDW_I).DAYS(1).FROM;          07560004
                   LEAVE LOOPSP3;                                       07570004
                END;                                                    07580004
             END;                                                       07590004
          END;                                                          07600004
                                                /*17-03-2003 - END   */ 07610004
       END;              /*---WHEN ('Y') END --- 838,726,862,755,666-*/ 07620004
                                                                        07630004
       WHEN ('R');       /*-WHEN ('R')-DO NOTHING 838,726,862,755,666*/ 07640004
                                                                        07650004
       WHEN ('N');       /*-WHEN ('N')-DO NOTHING 838,726,862,755,666*/ 07660004
                                                                        07670004
       OTHERWISE;                                                       07680004
                                                                        07690004
     END;           /*-SELECT TYPE_INDICATOR- END-838,726,862,755,666*/ 07700004
                                                                        07710004
   END;                  /*-- WHEN ('838')------------- END ---- 838 */ 07720004
                         /*-- WHEN ('726')------------- END ---- 726 */ 07730004
                         /*-- WHEN ('862')------------- END ---- 862 */ 07740004
                         /*-- WHEN ('755')------------- END ---- 755 */ 07750004
                         /*-- WHEN ('666')------------- END ---- 666 */ 07760004
 /* SOUTH   REGION END     */                                           07770004
 /* CENTRAL REGION START   */                                           07780004
                                                                        07790004
   WHEN ('724',     /****** WHEN ('724') START ***********************/ 07800004
         '618') DO; /****** WHEN ('618') START ***********************/ 07810004
                                                                        07820004
     SELECT(TYPE_INDICATOR);                                            07830004
       WHEN ('O')        /****** WHEN ('O') START ********************/ 07840004
       DO;                                                              07850004
         ACCEPT_INDICATOR = 'N';                                        07860004
                   /* SET ACCEPT_INDICATOR TO N BY DEFAULT.          */ 07870004
                   /* SEARCH TABLE BTAF_TABLE FOR OFFERING ID        */ 07880004
                   /*    AND SET ACCEPT_INDICATOR TO YES IF FOUND.   */ 07890004
 LOOPCC:           /*                                                */ 07900004
         DO BTAF_I = 1 TO BTAF_ROWS;                                    07910004
            IF BTAF_TABLE.CTRY(BTAF_I) = LAM_QCH0CMSO.IOPUCTY THEN      07920004
               IF LAM_QCH0CMSO.IOFFNIK = BTAF_TABLE.OFFER_ID(BTAF_I)    07930004
                  THEN DO;                                              07940004
                  ACCEPT_INDICATOR = 'Y';                               07950004
                  LEAVE LOOPCC;                                         07960004
                  END;                                                  07970004
         END;                                                           07980004
       END;              /****** WHEN ('O') END **********************/ 07990004
                                                                        08000004
                                                                        08010004
       WHEN ('Y')        /****** WHEN ('Y') START ********************/ 08020004
       DO;                                                              08030004
          FILE_RCBDSB0.HOURS_FROM(*) = 0;  /* SET HOURS TO STANDARD  */ 08040004
          FILE_RCBDSB0.HOURS_TO(*) = 0;    /*    VALUE ZERO          */ 08050004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 08060004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 08070004
 LOOPDD:                 /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 08080004
          DO PDW_I = 1 TO PDW_ROWS;                                     08090004
             IF PDW_TABLE.CTRY(PDW_I) = LAM_QCH0CMSO.IOPUCTY THEN       08100004
                IF LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I) |    08110004
                   FILE_RCBDSB0.BASE_SC = PDW_TABLE.TUSCSDC(PDW_I)      08120004
                   THEN DO;                                             08130004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         08140004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          08150004
                   FILE_RCBDSB0.HOURS_TO(*) =                           08160004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            08170004
                   LEAVE LOOPDD;                                        08180004
                   END;                                                 08190004
          END;                                                          08200004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0  /*C0090*/ 08210004
          THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;              /*-0903*/ 08220004
          /************ Begin C0038-0901 ****************************/  08230004
                                                                        08240004
          /************ Begin C0082-0403 ****************************/  08250004
          /*IF SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,5) = 'SLR2 ' |      08260004
          SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,5) = 'CLR2 '*//*161A*/   08270004
          /*THEN DO;                                                    08280004
              FILE_RCBDSB0.HOURS_FROM(*) = 0;                           08290004
              FILE_RCBDSB0.HOURS_TO(*)   = 1440;                        08300004
          END;*/                                                        08310004
          /************ End   C0082-0403 ****************************/  08320004
                                                                        08330004
          /************ End   C0038-0901 ****************************/  08340004
       END;              /****** WHEN ('Y') END **********************/ 08350004
                                                                        08360004
       WHEN ('R') DO;    /**     WHEN ('R') assign balance fields   **/ 08370004
          /************ start C0088-0703 ****************************/  08380004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           08390004
                                       LAM_QCH0RSSO.QUNITSA ;           08400004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           08410004
          /************ end   C0088-0703 ****************************/  08420004
       END;                                                             08430004
                                                                        08440004
       WHEN ('N') DO;    /**     WHEN ('n') assign balance fields   **/ 08450004
          /************ start C0088-0703 ****************************/  08460004
        /*FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           08470004
                                       LAM_QCH0RSSO.QUNITSA ;           08480004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ; */        08490004
          /************ end   C0088-0703 ****************************/  08500004
       END;                                                             08510004
                                                                        08520004
       OTHERWISE;                                                       08530004
                                                                        08540004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 08550004
                                                                        08560004
   END;             /****** WHEN ('724',     *************************/ 08570004
                    /******       '618') END *************************/ 08580004
   /**************** Begin C0038-0901 ****************************/     08590004
   WHEN ('358','359','363','644','651','603','607','626','668','693',   08600004
         '694','695','699','704','705','707','708','740','741','787',   08610004
         '820','821','826','889') DO;                                   08620004
     SELECT(TYPE_INDICATOR);                                            08630004
       WHEN ('O')        /****** WHEN ('O') START ********************/ 08640004
       DO;                                                              08650004
         ACCEPT_INDICATOR = 'Y';                                        08660004
       END;                                                             08670004
       WHEN ('Y')        /****** WHEN ('Y') START ********************/ 08680004
       DO;                                                              08690004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0  /*C0090*/ 08700004
          THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;              /*-0903*/ 08710004
                                                                        08720004
          /************ Begin C0082-0403 ****************************/  08730004
          /*IF SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,5) = 'SLR2 ' |      08740004
          SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,5) = 'CLR2 '*//*161A*/   08750004
          /*THEN DO;                                                    08760004
              FILE_RCBDSB0.HOURS_FROM(*) = 0 ;                          08770004
              FILE_RCBDSB0.HOURS_TO(*)   = 1440 ;                       08780004
          END;*/                                                        08790004
          /************ End C0082-0403 ****************************/    08800004
                                                                        08810004
       END;                                                             08820004
       WHEN ('R')        /***  WHEN ('R') assign balance fields ******/ 08830004
       DO;                                                              08840004
          /************ start C0088-0703 ****************************/  08850004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           08860004
                                       LAM_QCH0RSSO.QUNITSA ;           08870004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           08880004
          /************ end   C0088-0703 ****************************/  08890004
                                                                        08900004
       END;                                                             08910004
       WHEN ('N');       /****** WHEN ('N') - DO NOTHING *************/ 08920004
                                                                        08930004
       OTHERWISE;                                                       08940004
                                                                        08950004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 08960004
   END;                                                                 08970004
   /**************** End   C0038-0901 ****************************/     08980004
   WHEN ('848') DO; /****** WHEN ('848') START  SCHWEIZ **************/ 08990004
                                                                        09000004
     SELECT(TYPE_INDICATOR);                                            09010004
       WHEN ('O')        /****** WHEN ('O') START ********************/ 09020004
       DO;                                                              09030004
         ACCEPT_INDICATOR = 'N';                                        09040004
                   /* SET ACCEPT_INDICATOR TO N BY DEFAULT.          */ 09050004
                   /* SEARCH TABLE BTAF_TABLE FOR OFFERING ID        */ 09060004
                   /*    AND SET ACCEPT_INDICATOR TO YES IF FOUND.   */ 09070004
 LOOPEE:           /*                                                */ 09080004
         DO BTAF_I = 1 TO BTAF_ROWS;                                    09090004
            IF BTAF_TABLE.CTRY(BTAF_I) = LAM_QCH0CMSO.IOPUCTY THEN      09100004
               IF LAM_QCH0CMSO.IOFFNIK = BTAF_TABLE.OFFER_ID(BTAF_I)    09110004
                  THEN DO;                                              09120004
                  ACCEPT_INDICATOR = 'Y';                               09130004
                  LEAVE LOOPEE;                                         09140004
                  END;                                                  09150004
         END;                                                           09160004
       END;              /****** WHEN ('O') END **********************/ 09170004
                                                                        09180004
                                                                        09190004
       WHEN ('Y')        /****** WHEN ('Y') START ********************/ 09200004
       DO;                                                              09210004
          FILE_RCBDSB0.HOURS_FROM(*) = 0;  /* SET HOURS TO STANDARD  */ 09220004
          FILE_RCBDSB0.HOURS_TO(*) = 0;    /*    VALUE ZERO          */ 09230004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 09240004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 09250004
 LOOPFF:                 /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 09260004
          DO PDW_I = 1 TO PDW_ROWS;                                     09270004
             IF PDW_TABLE.CTRY(PDW_I) = LAM_QCH0CMSO.IOPUCTY            09280004
               THEN DO;                                                 09290004
                IF LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I) |    09300004
                   FILE_RCBDSB0.BASE_SC = PDW_TABLE.TUSCSDC(PDW_I)      09310004
                   THEN DO;                                             09320004
                     FILE_RCBDSB0.HOURS_FROM(*) =                       09330004
                                  PDW_TABLE(PDW_I).DAYS(*).FROM;        09340004
                     FILE_RCBDSB0.HOURS_TO(*) =                         09350004
                                  PDW_TABLE(PDW_I).DAYS(*).TO;          09360004
                     LEAVE LOOPFF;                                      09370004
                   END;                                                 09380004
                   ELSE DO;                                             09390004
                     FILE_RCBDSB0.HOURS_FROM(1) = 0;                    09400004
                     FILE_RCBDSB0.HOURS_TO(1) = 0;                      09410004
                     DO I = 2 TO 6;                                     09420004
                        FILE_RCBDSB0.HOURS_FROM(I) = 480;               09430004
                        FILE_RCBDSB0.HOURS_TO(I) = 1020;                09440004
                     END;                                               09450004
                     FILE_RCBDSB0.HOURS_FROM(7) = 0;                    09460004
                     FILE_RCBDSB0.HOURS_TO(7) = 0;                      09470004
          /************ BEGIN CHANGE 0156A ************************     09480004
                     LEAVE LOOPFF;                                      09490004
          ************* END CHANGE 0156A **************************/    09500004
                   END;                                                 09510004
               END;                                                     09520004
          END;                                                          09530004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0  /*C0090*/ 09540004
          THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;              /*-0903*/ 09550004
          /************ Begin C0038-0901 ****************************/  09560004
                                                                        09570004
          /************ Begin C0082-0403 ****************************/  09580004
          /*IF SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,5) = 'SLR2 ' |      09590004
          SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,5) = 'CLR2 '*//*161A*/   09600004
          /*THEN DO;                                                    09610004
              FILE_RCBDSB0.HOURS_FROM(*) = 0;                           09620004
              FILE_RCBDSB0.HOURS_TO(*)   = 1440;                        09630004
          END;*/                                                        09640004
          /************ End   C0082-0403 ****************************/  09650004
                                                                        09660004
          /************ End   C0038-0901 ****************************/  09670004
       END;              /****** WHEN ('Y') END **********************/ 09680004
                                                                        09690004
       WHEN ('R')        /**  WHEN ('R') assign balance fields *******/ 09700004
       DO;                                                              09710004
          /************ start C0088-0703 ****************************/  09720004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           09730004
                                       LAM_QCH0RSSO.QUNITSA ;           09740004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           09750004
          /************ end   C0088-0703 ****************************/  09760004
       END;                                                             09770004
       WHEN ('N');       /****** WHEN ('N') - DO NOTHING *************/ 09780004
                                                                        09790004
       OTHERWISE;                                                       09800004
                                                                        09810004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 09820004
                                                                        09830004
   END;             /****** WHEN ('848') END *************************/ 09840004
                                                                        09850004
 /* CENTRAL REGION END   */                                             09860004
 /* NORTH REGION START */                                               09870004
   WHEN ('866',     /****** WHEN ('866') START ***********************/ 09880004
         '754') DO; /****** WHEN ('754') START ***********************/ 09890004
                                                                        09900004
     SELECT(TYPE_INDICATOR);                                            09910004
       WHEN ('O') DO;    /****** WHEN ('O') START ********************/ 09920004
         ACCEPT_INDICATOR = 'N';                                        09930004
                   /* SET ACCEPT_INDICATOR TO N BY DEFAULT.          */ 09940004
                   /* SEARCH TABLE BTAF_TABLE FOR OFFERING ID        */ 09950004
                   /*    AND SET ACCEPT_INDICATOR TO YES IF FOUND.   */ 09960004
 NORTHA:           /*                                                */ 09970004
         DO BTAF_I = 1 TO BTAF_ROWS;                                    09980004
            IF BTAF_TABLE.CTRY(BTAF_I) = LAM_QCH0CMSO.IOPUCTY THEN      09990004
               IF LAM_QCH0CMSO.IOFFNIK = BTAF_TABLE.OFFER_ID(BTAF_I)    10000004
               THEN DO;                                                 10010004
                  ACCEPT_INDICATOR = 'Y';                               10020004
                  LEAVE NORTHA;                                         10030004
               END;                                                     10040004
         END;                                                           10050004
         FILE_RCBDSB0.HOURS_FROM(*) = 0;  /* SET HOURS TO STANDARD  */  10060004
         FILE_RCBDSB0.HOURS_TO(*) = 0;    /*    VALUE ZERO          */  10070004
       END;              /****** WHEN ('O') END **********************/ 10080004
                                                                        10090004
                                                                        10100004
       WHEN ('Y')        /****** WHEN ('Y') START ********************/ 10110004
       DO;                                                              10120004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 10130004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 10140004
 NORTHB:                 /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 10150004
          DO PDW_I = 1 TO PDW_ROWS;                                     10160004
             IF PDW_TABLE.CTRY(PDW_I) = LAM_QCH0CMSO.IOPUCTY THEN DO;   10170004
                IF LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I) |    10180004
                   FILE_RCBDSB0.BASE_SC = PDW_TABLE.TUSCSDC(PDW_I)      10190004
                THEN DO;                                                10200004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         10210004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          10220004
                   FILE_RCBDSB0.HOURS_TO(*) =                           10230004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            10240004
   /* END DIRTY FIX 1.2 */                                              10250004
                   LEAVE NORTHB;                                        10260004
                END;                                                    10270004
             END;                                                       10280004
          END;                                                          10290004
          /*CALL SLV2_COVERAGE_HOURS;*/ /*C0082-0403*/                  10300004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0  /*C0090*/ 10310004
          THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;              /*-0903*/ 10320004
       END;              /****** WHEN ('Y') END **********************/ 10330004
                                                                        10340004
       WHEN ('R') DO;    /*** WHEN ('R') assign balance fields *******/ 10350004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           10360004
                                       LAM_QCH0RSSO.QUNITSA ;           10370004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           10380004
       END;                                                             10390004
                                                                        10400004
       WHEN ('N') DO;    /****** WHEN ('N') - DO NOTHING *************/ 10410004
                                                                        10420004
          /*  PUT SKIP LIST('ENTER JVB CODE NOW!!!!!!');*/              10430024
          /**********************************************/              10440004
          /*1.1 CODE CHANGE STARTS HERE ROBG 23.09.1999 */              10450004
          /*1.1*/ CALL XLATE_COMP ;                                     10460004
          /*1.1 CODE CHANGE ENDS HERE ROBG 23.09.1999   */              10470004
          /**********************************************/              10480004
                                                                        10490004
          /*  PUT SKIP LIST('NO ACTION ....TYPE ''N'''); */             10500004
       END;                                                             10510004
                                                                        10520004
       OTHERWISE DO;                                                    10530004
       END;                                                             10540004
                                                                        10550004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 10560004
0/********************************************************************/ 10570004
  /*                                                           */       10580004
  /* START OF JVB 1.1 CODE INSERTION    ROBG 23.09.1999        */       10590004
 XLATE_COMP: PROC;                                                      10600004
 /*DCL MAX_ENTRIES   FIXED BIN(15) INIT(25);                  */        10610004
   DCL SEARCH_ARG  CHAR(45);                                            10620004
 /*1.1*/  DCL 1 TABIN_ARG,                                              10630004
 /*1.1*/        3 IOFFNIK CHAR(15),                                     10640004
 /*1.1*/        3 IOBJNIK CHAR(15),                                     10650004
 /*1.1*/        3 COBJNIK CHAR(15);                                     10660004
 /*1.1*/ DCL TABIN_ARG_PSK CHAR(45) ;                                   10670004
 /*DCL 1 XLATE_TAB DEFINED(CHGTAB_IN),                        */        10680004
 /*    3 SEARCH(25),                                          */        10690004
 /*    5 IOFFNIK CHAR(15),                                    */        10700004
 /*    5 IOBJNIK CHAR(15),                                    */        10710004
 /*    5 COBJNIK CHAR(15);                                    */        10720004
 /*DCL 1 XLATE_TAB2 DEFINED(CHGTAB_OUT),                      */        10730004
 /*    3 XLATE_OUT(25),                                       */        10740004
 /*    5 COBJNIK CHAR(15);                                    */        10750004
 /*DCL CHGTAB_IN(25) CHAR(45) INIT(                           */        10760004
 /*  '6941-A8Y       DEC            TRANSACTION    ',         */        10770004
 /*  '6941-A8Y       HP             TRANSACTION    ',         */        10780004
 /*  '6941-A8Y       HP             BASE           ',         */        10790004
 /*  '6941-A8Y       HP             CADAM          ',         */        10800004
 /*  '6941-A8Y       LINUX          BASE           ',         */        10810004
 /*  (20)' ');                                                */        10820004
 /*DCL CHGTAB_OUT(25) CHAR(15) INIT(                          */        10830004
 /*  'TRANSACTION DEC',                                       */        10840004
 /*  'TRANSACTION HP ',                                       */        10850004
 /*  'BASE        HP ',                                       */        10860004
 /*  'CADAM       HP ',                                       */        10870004
 /*  'BASE        LIN',                                       */        10880004
 /*  (20)' ');                                                */        10890004
   SEARCH_ARG = LAM_QCH0CMSO.IOFFNIK ||                                 10900004
                LAM_QCH0CMSO.IOBJNIK ||                                 10910004
                LAM_QCH0CMSO.COBJNIK;                                   10920004
   I = 1;                                                               10930004
   DO WHILE (I <= TABIN_I);                                             10940004
      IF TABIN_TABLE(I).IOFFNIK = ''                                    10950004
         THEN I = TABIN_I + 1;                                          10960004
      ELSE DO;                                                          10970004
        TABIN_ARG = '' ;                                                10980004
        TABIN_ARG.IOFFNIK = TABIN_TABLE(I).IOFFNIK ;                    10990004
        TABIN_ARG.IOBJNIK = TABIN_TABLE(I).IOBJNIK ;                    11000004
        TABIN_ARG.COBJNIK = TABIN_TABLE(I).COBJNIK ;                    11010004
 /*1.1*/PUT SKIP LIST('SEARCH_ARG    :'||SEARCH_ARG) ;                  11020004
 /*1.1*/TABIN_ARG_PSK = TABIN_ARG.IOFFNIK ||                            11030004
 /*1.1*/                TABIN_ARG.IOBJNIK ||                            11040004
 /*1.1*/                TABIN_ARG.COBJNIK ;                             11050004
 /*1.1*/PUT SKIP LIST('TABIN_CONTENTS:'||TABIN_ARG_PSK) ;               11060004
          TABIN_COMP = TABIN_COMP + 1 ;                                 11070004
 /*1.1*/PUT SKIP LIST('TABIN_COMPARES:'||TABIN_COMP) ;                  11080004
 /*1.1***************************************************/              11090004
        IF SEARCH_ARG = STRING (TABIN_ARG)                              11100004
        THEN DO;                                                        11110004
          SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,16,15)                     11120004
                               = TABIN_TABLE.OOBJNIK(I);                11130004
          TABIN_COMP_MATCH = TABIN_COMP_MATCH + 1 ;                     11140004
 /*1.1*/PUT SKIP LIST('TABIN_COMPARES_MATCHED:'||TABIN_COMP_MATCH) ;    11150004
        END;                                                            11160004
        I = I + 1;                                                      11170004
      END;                                                              11180004
   END;                                                                 11190004
   END XLATE_COMP;                                                      11200004
  /* END OF JVB 1.1 CODE INSERTION ROBG 23.09.1999           */         11210004
                                                                        11220004
                                                                        11230004
   END;             /****** WHEN ('866',     *************************/ 11240004
                    /******       '754') END *************************/ 11250004
     /****************************************************************/ 11260004
   WHEN ('788')    /****** WHEN ('788') START ***********************/  11270004
     DO;                                                                11280004
                                                                        11290004
     SELECT(TYPE_INDICATOR);                                            11300004
       WHEN ('O')        /****** WHEN ('O') START ********************/ 11310004
       DO;                                                              11320004
         ACCEPT_INDICATOR = 'Y';                                        11330004
       END;              /****** WHEN ('O') END **********************/ 11340004
                                                                        11350004
                                                                        11360004
       WHEN ('Y')        /****** WHEN ('Y') START ********************/ 11370004
       DO;                                                              11380004
     /*   FILE_RCBDSB0.HOURS_FROM(*) = 0;*//* SET HOURS TO STANDARD  */ 11390004
     /*   FILE_RCBDSB0.HOURS_TO(*) = 0;  *//*    VALUE ZERO          */ 11400004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 11410004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 11420004
 NORTHC:                 /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 11430004
          DO PDW_I = 1 TO PDW_ROWS;                                     11440004
             IF PDW_TABLE.CTRY(PDW_I) = LAM_QCH0CMSO.IOPUCTY THEN       11450004
                IF LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I) |    11460004
                   FILE_RCBDSB0.BASE_SC = PDW_TABLE.TUSCSDC(PDW_I)      11470004
                   THEN DO;                                             11480004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         11490004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          11500004
                   FILE_RCBDSB0.HOURS_TO(*) =                           11510004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            11520004
                   LEAVE NORTHC;                                        11530004
                   END;                                                 11540004
          END;                                                          11550004
          /*CALL SLV2_COVERAGE_HOURS;*/ /*C0082-0403*/                  11560004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0  /*C0090*/ 11570004
          THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;              /*-0903*/ 11580004
       END;              /****** WHEN ('Y') END **********************/ 11590004
                                                                        11600004
       WHEN ('R')        /*** WHEN ('R') assign balance fields *******/ 11610004
          DO;                                                           11620004
          /************ start C0088-0703 ****************************/  11630004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           11640004
                                       LAM_QCH0RSSO.QUNITSA ;           11650004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           11660004
          /************ end   C0088-0703 ****************************/  11670004
          END;                                                          11680004
       WHEN ('N');       /****** WHEN ('N') - DO NOTHING *************/ 11690004
                                                                        11700004
       OTHERWISE;                                                       11710004
                                                                        11720004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 11730004
                                                                        11740004
   END;             /****** WHEN ('788')     *************************/ 11750004
     /****************************************************************/ 11760004
   WHEN ('864')    /****** WHEN ('864') START ***********************/  11770004
     DO;                                                                11780004
                                                                        11790004
     SELECT(TYPE_INDICATOR);                                            11800004
       WHEN ('O')        /****** WHEN ('O') START ********************/ 11810004
       DO;                                                              11820004
         ACCEPT_INDICATOR = 'Y';                                        11830004
       END;              /****** WHEN ('O') END **********************/ 11840004
                                                                        11850004
                                                                        11860004
       WHEN ('Y')        /****** WHEN ('Y') START ********************/ 11870004
       DO;                                                              11880004
                         /* SEARCH TABLE PDW_TABLE FOR TUSCSDC VALUE */ 11890004
                         /*    AND INSERT RESPECTIVE HOURS VALUES    */ 11900004
 NORTHD:                 /*    FROM TABLE INTO RCBDSB0 RECORD.       */ 11910004
          DO PDW_I = 1 TO PDW_ROWS;                                     11920004
             IF PDW_TABLE.CTRY(PDW_I) = LAM_QCH0CMSO.IOPUCTY THEN       11930004
                IF LAM_QCH0SCSO.TUSCSDC = PDW_TABLE.TUSCSDC(PDW_I) |    11940004
                   FILE_RCBDSB0.BASE_SC = PDW_TABLE.TUSCSDC(PDW_I)      11950004
                   THEN DO;                                             11960004
                   FILE_RCBDSB0.HOURS_FROM(*) =                         11970004
                                PDW_TABLE(PDW_I).DAYS(*).FROM;          11980004
                   FILE_RCBDSB0.HOURS_TO(*) =                           11990004
                                PDW_TABLE(PDW_I).DAYS(*).TO;            12000004
                   LEAVE NORTHD;                                        12010004
                   END;                                                 12020004
          END;                                                          12030004
          /*CALL SLV2_COVERAGE_HOURS;*/ /*C0082-0403*/                  12040004
          IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0  /*C0090*/ 12050004
          THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;              /*-0903*/ 12060004
       END;              /****** WHEN ('Y') END **********************/ 12070004
                                                                        12080004
       WHEN ('R')        /*** WHEN ('R') assign balance fields *******/ 12090004
          DO;                                                           12100004
          /************ start C0088-0703 ****************************/  12110004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           12120004
                                       LAM_QCH0RSSO.QUNITSA ;           12130004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           12140004
          /************ end   C0088-0703 ****************************/  12150004
          END;                                                          12160004
                                                                        12170004
       WHEN ('N');       /****** WHEN ('N') - DO NOTHING *************/ 12180004
                                                                        12190004
       OTHERWISE;                                                       12200004
                                                                        12210004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 12220004
                                                                        12230004
   END;             /****** WHEN ('864')     *************************/ 12240004
0/********************************************************************/ 12250004
 /* NORTH REGION END   */                                               12260004
                                                                        12270004
  /* ROWEST LOCAL START */                                              12280004
   WHEN ('706','624') DO ;                                              12290004
      CALL WEST_EXIT ;                                                  12300004
   END;             /*** SELECT TYPE_INDICATOR - END ***************/   12310004
   /************ Begin C0038-0901 ****************************/         12320004
   WHEN ('620','677','680','767','805','808','823','832','865',         12330004
         '642','729','047','048')                                       12340004
      DO;                                                               12350004
         SELECT (TYPE_INDICATOR) ;                                      12360004
         WHEN ('O')                                                     12370004
         DO;                                                            12380004
              ACCEPT_INDICATOR = 'Y' ;   /* THE USER CAN DEFINE HERE */ 12390004
                                         /* STATEMENTS TO SET THE    */ 12400004
                                         /* VALUE FOR THE ACCEPT_IND.*/ 12410004
                                         /* 'Y' TO ACCEPT THE RECORD,*/ 12420004
         END;                            /* 'N' TO IGNORE THE RECORD */ 12430004
         WHEN ('Y')                                                     12440004
         DO;                                                            12450004
              /*CALL SLV2_COVERAGE_HOURS;*/ /*C0082-0403*/              12460004
         END;                                                           12470004
         WHEN ('R')    /*** WHEN ('R') assign balance fields *******/   12480004
          DO;                                                           12490004
          /************ start C0088-0703 ****************************/  12500004
          FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSP -           12510004
                                       LAM_QCH0RSSO.QUNITSA ;           12520004
          FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;           12530004
          /************ end   C0088-0703 ****************************/  12540004
          END;                                                          12550004
                                                                        12560004
         WHEN ('N');    /****** WHEN ('N') - DO NOTHING *************/  12570004
                                                                        12580004
       OTHERWISE;                                                       12590004
                                                                        12600004
     END;             /*** SELECT TYPE_INDICATOR - END ***************/ 12610004
   END;                                                                 12620004
  /************ END   C0038-0901 ****************************/          12630004
  /* ROWEST LOCAL END */                                                12640004
                                                                        12650004
0/********************************************************************/ 12660004
   OTHERWISE;                                                           12670004
                                                                        12680004
 END;               /**** SELECT COUNTRY-NUMBER - END ***************/  12690004
  /* */                                                                 12700004
                                                                        12710004
 WEST_EXIT: PROC ;                                                      12720004
 SELECT (TYPE_INDICATOR);                                               12730004
   WHEN ('Y')                                                           12740004
     DO;                                                                12750004
                                         /* THE USER CAN DEFINE HERE */ 12760004
                                         /* STATEMENTS TO OVERWRITE  */ 12770004
                                         /* THE VALUE FOR HOURS_FROM,*/ 12780004
                                         /* HOURS_TO, CALL_BACK_TIME */ 12790004
      FILE_RCBDSB0.HOURS_FROM(1) = 0;    /* CHG0396A                 */ 12800004
      FILE_RCBDSB0.HOURS_FROM(2) = 540;                                 12810004
      FILE_RCBDSB0.HOURS_FROM(3) = 540;                                 12820004
      FILE_RCBDSB0.HOURS_FROM(4) = 540;                                 12830004
      FILE_RCBDSB0.HOURS_FROM(5) = 540;                                 12840004
      FILE_RCBDSB0.HOURS_FROM(6) = 540;  /*CHG0396A                 */  12850004
      FILE_RCBDSB0.HOURS_FROM(7) = 0;                                   12860004
      FILE_RCBDSB0.HOURS_TO(1)   = 0;    /*CHG0396A                 */  12870004
      FILE_RCBDSB0.HOURS_TO(2)   = 1080;                                12880004
      FILE_RCBDSB0.HOURS_TO(3)   = 1080;                                12890004
      FILE_RCBDSB0.HOURS_TO(4)   = 1080;                                12900004
      FILE_RCBDSB0.HOURS_TO(5)   = 1080;                                12910004
      FILE_RCBDSB0.HOURS_TO(6)   = 1080; /*CHG0396A                 */  12920004
      FILE_RCBDSB0.HOURS_TO(7)   = 0;                                   12930004
                                                                        12940004
      /************ Begin C0038-0901 ****************************/      12950004
      /*CALL SLV2_COVERAGE_HOURS;*/ /*C0082-0403*/                      12960004
      /************ End   C0038-0901 ****************************/      12970004
      IF INDEX(LAM_QCH0SCSO.IUTSNIK,'CALLBACK TIME') > 0      /*C0090*/ 12980004
      THEN FILE_RCBDSB0.CALL_BACK_TIME = 30;                  /*-0903*/ 12990004
     END;                                                               13000004
   WHEN ('R')                                                           13010004
     DO;                                                                13020004
     /* NEW SPEC ON 1ST OF JULY 1999 */  /* THE USER CAN DEFINE HERE */ 13030004
                                         /* STATEMENTS TO OVERWRITE  */ 13040004
                                         /* THE VALUE FOR BALANCE AND*/ 13050004
                                         /* BALANCE_UNITS            */ 13060004
     FILE_RCBDSB0.BALANCE_UNITS = LAM_QCH0RSSO.IUNITNM ;                13070004
     FILE_RCBDSB0.BALANCE       = LAM_QCH0RSSO.QUNITSA ;                13080004
     END;                                                               13090004
   WHEN ('O')                                                           13100004
     DO;                                                                13110004
     ACCEPT_INDICATOR = 'Y' ;            /* THE USER CAN DEFINE HERE */ 13120004
                                         /* STATEMENTS TO SET THE    */ 13130004
                                         /* VALUE FOR THE ACCEPT_IND.*/ 13140004
                                         /* 'Y' TO ACCEPT THE RECORD,*/ 13150004
                                         /* 'N' TO IGNORE THE RECORD */ 13160004
     END;                                                               13170004
   WHEN ('N')                                                           13180004
     DO;                                                                13190004
                                         /* THE USER CAN DEFINE HERE */ 13200004
                                         /* STATEMENTS TO OVERWRITE  */ 13210004
                                         /* THE VALUE FOR ALL FIELDS,*/ 13220004
                                         /* MENTIONED IN THE PROLOG  */ 13230004
     END;                                                               13240004
   OTHERWISE;                                                           13250004
   END;                                  /* END OF SELECT-STATEMENT  */ 13260004
 END WEST_EXIT ;                                                        13270004
 /* WEST_EXIT PROCEDURE END */                                          13280004
                                                                        13290004
 /***************** Begin C0038-0901 ****************************/      13300004
                                                                        13310004
 /***************** Begin C0082-0403 ****************************/      13320004
 /*                                                                     13330004
 SLV2_COVERAGE_HOURS: PROC;                                             13340004
      SELECT (SUBSTR(FILE_RCBDSB0.PRODUCT_DEF_ID,1,15));                13350004
        WHEN('SL Z/OS SG     ','SL Z/VM VSE SG ','SL AIX&SP SG   ',     13360004
             'SL OS/400 SG   ','SL WINDOWS SG  ','SL OS/2 SG     ',     13370004
             'SL NOOPSYS SG  ','SL VMSALPHA SG ','SL VMSVAX SG   ',     13380004
             'SL DIG-UNIX SG ','SL DNX-NUM SG  ','SL DNX-SYM SG  ',     13390004
             'SL LINUX SG    ','SL LINUX PC SG ','SL SUN SG      ',     13400004
             'SL NOVELL SG   ','SL SANNAS SG   ','SL DISKTAPE SG ',     13410004
             'SL ACCTADV SG  ','SL ACCTADV ENT ','SL ENTERPRISE  ')     13420004
          DO;                                                           13430004
             FILE_RCBDSB0.HOURS_FROM(*) = 0;                            13440004
             FILE_RCBDSB0.HOURS_TO(*)   = 1440;                         13450004
          END;                                                          13460004
          OTHERWISE;                                                    13470004
      END;                                                              13480004
 END SLV2_COVERAGE_HOURS;*/                                             13490004
 /***************** End C0082-0403 ****************************/        13500004
                                                                        13510004
                                                                        13520004
 /***************** End   C0038-0901 ****************************/      13530004
 STRIP:  PROC(PTR_DEP) RETURNS(CHAR(250) VARYING) REORDER;              13540004
   DCL PTR_DEP   PTR;                                                   13550004
   DCL K FIXED BIN(15) INIT(0) AUTO;                                    13560004
   DCL STRINGA BASED(PTR_DEP) CHAR(30);                                 13570004
                                                                        13580004
   DO K = LENGTH(STRINGA) TO 0 BY -1 WHILE(SUBSTR(STRINGA, K, 1) = ' ');13590004
   END;                                                                 13600004
 RETURN(SUBSTR(STRINGA, 1, K));                                         13610004
 END STRIP;                                                             13620004
0/********************************************************************/ 13630004
 /****    LOKALE AENDERUNG   ENDE                                 ****/ 13640004
 /********************************************************************/ 13650004
                                                                        13660004
                                         /* END USER DEFINED PROCESS */ 13670004
0                                        /* RESET LEVEL              */ 13680004
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            13690004
1/*******************************************************************/  13700004
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  13710004
 /*******************************************************************/  13720004
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  13730004
 $DAIMOD (RCBDS2U);                      /* MODULE TO BE COMPILED   */  13740004
0/*******************************************************************/  13750004
 /* END OF ABR BLOCK                                                */  13760004
 /*******************************************************************/  13770004
0END RCBDS2U;                                                           13780004