1/* RCBDCBM - RETAIN/CCPF: EXTRACT                                   */ 00010000
 /********************************************************************/ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /********************************************************************/ 00060000
 /* PROGRAM          : RCBDCBM                                       */ 00070000
 /*                                                                  */ 00080000
 /* LANGUAGE         : PLISQL                                        */ 00090000
 /*                                                                  */ 00100000
 /* TYPE             : BATCH                                         */ 00110000
 /*                                                                  */ 00120000
 /* DESCRIPTION      : THE EXTRACT OF INVENTORY RELATED              */ 00130000
 /*                    INFORMATION FOR ONE COUNTRY GIVEN             */ 00140000
 /*                    AND FOR WHICH INFORMATION HAS CHANGED         */ 00150000
 /*                    SINCE THE LAST RETAIN INVENTORY EXTRACT       */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : - DB2   : RCBV0010_CUSTOMER                   */ 00180000
 /*                              RCBV0030_CONTRACT           RB01290 */ 00190000
 /*                              RCBV0060_SW_PR                      */ 00200000
 /*                              RCBV0070_HW_PO                      */ 00210000
 /*                              RCBV0125_DMMY_REAL          RB01320 */ 00220000
 /*                              RCBV0170_OU_HW                      */ 00230000
 /*                              RCBV0180_OU_SW                      */ 00240000
 /*                              RCBV0190_HW_CUST                    */ 00250000
 /*                              RCBV0200_SW_CUST                    */ 00260000
 /*                              RCBV0220_SUPPL_CTR                  */ 00270000
 /*                              RCBV0240_SERV_CTR                   */ 00280000
 /*                              RCBV0270_SW_IN_ORD                  */ 00290000
 /*                              RCBV0300_HW_REAL                    */ 00300000
 /*                              RCBV0320_SW_ON_HW                   */ 00310000
 /*                              RCBV0350_CUST_MOD                   */ 00320000
 /*                              RCBV0500_PARM                       */ 00330000
 /*                              RCBV0510_CUST_ADDR                  */ 00340000
 /*                              RCBV0600_TRANS_WC                   */ 00350000
 /*                              RCBV0724_CCPF_INV                   */ 00360000
 /*                                                                  */ 00370000
 /* OUTPUT           : - FILE  : RCBDCB1    CHANGED CUSTOMER RECORDS */ 00380000
 /*                              RCBDCB2    CHANGED INV RECORDS      */ 00390000
 /*                              RCB0M10                             */ 00400000
 /*                                                                  */ 00410000
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00420000
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00430000
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00440000
 /*                    RCB018M   UPDATE HASH TOTAL                   */ 00450000
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00460000
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00470000
 /*                    RCBF50M   INSERT PARAMETER                    */ 00480000
 /*                    RCBG50M   UPDATE PARAMETER                    */ 00490000
 /*                    RCBDC2U   HW PRODUCT USER EXIT                */ 00500000
 /*                    RCBDC3U   SW PRODUCT USER EXIT                */ 00510000
 /*                                                      SOC PTM1038 */ 00520000
 /*                    RCB021M   SUBSTRING FOR MIXED CHARACTER       */ 00530000
 /*                              STRINGS                             */ 00540000
 /*                                                      EOC PTM1038 */ 00550000
 /*                    RCB024M   LOCK DB2 TABLE PARTITIONS   RC01219 */ 00560000
 /*                                                                  */ 00570000
 /* MESSAGES         :                                               */ 00580000
 /*                                                                  */ 00590000
 /* DEPENDENCIES     : NONE                                          */ 00600000
 /*                                                                  */ 00610000
 /* FREQUENCY        : USER DEPENDENT                                */ 00620000
 /*                                                                  */ 00630000
 /* MAINTENANCE LOG  :                                               */ 00640000
 /* ---------------                                                  */ 00650000
 /*                                                                  */ 00660000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00670000
 /*             |              |                                     */ 00680000
 /*  1993-04-01 | ----         | CEDS INITIAL DEVELOPMENT            */ 00690000
 /*  1993-11-30 | CED0014      | CHANGE FETCH INTO CALL SEE PTM 374  */ 00700000
 /*  1993-12-09 | PTM0434      | PLANCODE MUST BE BLANK IF NO COVERAG*/ 00710000
 /*             |              | AT ALL (IE. STARTTIME = '00.00.00' &*/ 00720000
 /*             |              |             ENDTIME   = '00.00.00' )*/ 00730000
 /*  1994-10-03 | PTM0574      | DO NOT TEST PERIODS FOR TABLES      */ 00740000
 /*             |              | THAT DO NOT HAVE EFFDATE IN KEY     */ 00750000
 /*  1994-11-15 | RC01116      | STORE TYPE OF WARRANTY              */ 00760000
 /*  1995-01-09 | RA01117      | ENTERPRISE NUMBER, BRANCH OFFICE    */ 00770000
 /*             |              |  ADDED                              */ 00780000
 /*  1995-10-11 | RA01139      | IMPROVE INTERFACE CEDS CCPF         */ 00790000
 /*  1995-10-11 | RC01141      | SEQUENCE KEY                        */ 00800000
 /*  1997-01-28 | PTM0764      | EXTRACT ZIP CODE FROM RCBT0150      */ 00810000
 /*  1997-04-11 | PTM1036      | CORRECTED PROLOG                    */ 00820000
 /*  1997-04-29 | PTM0892      | REMOVE DECLARES UNUSED EXT.ENTRIES  */ 00830000
 /*  1997-05-05 | PTM1038      | CORRECT NAMES                       */ 00840000
 /*  1999-01-26 | RA01215      | RECOMPILED FOR EURO                 */ 00850000
 /*  1999-05-31 | PTM1271      | COVERAGE_END CORRECTION             */ 00860000
 /*  1999-07-06 | RC01219      | DORO                                */ 00870000
 /*  2004-08-18 | RB01242      | SEQUENCE NUMBER FROM 7 TO 28 CHAR.  */ 00880000
 /*  2007-05-14 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY       */ 00890000
 /*  2008-05-20 | RB01290      | ACCEPT CONTRACTS ON INTERNAL        */ 00900000
 /*             |              | MACHINES                            */ 00910000
 /*  2009-01-27 | RB01298      | ALIGNMENT FOR FLEXIBLE WARRANTY     */ 00920000
 /*             |              | MACHINES,                           */ 00930000
 /*             |              | PCR-0014: MOVING COUNTRY DEVIATIONS */ 00940000
 /*             |              | FOR TOM TO MACHINE STATUS FROM      */ 00950000
 /*             |              | RCB063/RCB064 TO RCB071             */ 00960000
 /*  2012-02-29 | RB01320      | CEDS 3.3 A17 RELEASE: SUPPORT FOR   */ 00970000
 /*             |              | LONG SERIAL IN DOWNSTREAM           */ 00980000
 /*  2015-04-24 | CEDS00000738 | T081567 : PERFORMANCE ISSUE FOR DP01*/ 00981022
 /*             |              | AND DC01 REAL_ORIGIN, REAL_SEQ_NUM  */ 00982022
 /*             |              | ADDED TO T724 AND T734              */ 00983022
 /*  2016-05-05 | CEDS00000792 | T081633 : PERFORMANCE ISSUE FOR DC02*/ 00984025
 /*             |              | CURSOR_SW UPDATED                   */ 00985023
 /********************************************************************/ 00990000
1RCBDCBM: PROC                                                          01000000
          OPTIONS (MAIN)                                                01010000
          REORDER;                                                      01020000
 DEFAULT RANGE (*)        STATIC;                                       01030000
1/********************************************************************/ 01040000
 /*  PARAMETERS                                                      */ 01050000
 /********************************************************************/ 01060000
 DCL PTR_INT_AREA        PTR;          /* INTERFACE AREA             */ 01070000
 DCL PTR_RETURN_AREA_BB  PTR;          /* RETURN AREA FROM BB        */ 01080000
 DCL PTR_COUNTRY_AREA    PTR;          /* INTERFACE RCB019M          */ 01090000
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 01100000
                                                                        01110000
 DCL 1 PARM_INT_AREA,                         /* INTERFACE AREA      */ 01120000
       %INCLUDE (RCBZ01S);;                                             01130000
 DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 01140000
       %INCLUDE (RCBZ02S);;                                             01150000
 DCL 1 PARM_DATE_CALC,                        /* DATE CALCULATION    */ 01160000
       %INCLUDE (RCBZ03S);;                                             01170000
 DCL 1 COUNTRY_AREA,                          /* COUNTRY AREA        */ 01180000
       %INCLUDE (RCBZ26S);;                                             01190000
 DCL 1 RUN_DATE_AREA,                         /* RUN DATE AREA       */ 01200000
       %INCLUDE (RCBZ28S);;                                             01210000
 DCL 1 PARM_RCB024M,                          /* RCB024M PARM        */ 01220000
       %INCLUDE (RCBZ33S);;                                             01230000
                                              /* SOC RB01281         */ 01240000
                                                      /* SOC RB01298 */ 01250000
 /*DCL 1 PARM_RCBP63S,                                               */ 01260000
 /*      %INCLUDE (RCBP63S);;                                        */ 01270000
 /*DCL 1 PARM_RCBP64S,                                               */ 01280000
 /*      %INCLUDE (RCBP64S);;                                        */ 01290000
                                                                        01300000
 DCL 1 PARM_RCBP67S,                                                    01310000
       %INCLUDE (RCBP67S);;                                             01320000
                                                                        01330000
 DCL 1 PARM_RCBP71S,                                                    01340000
       %INCLUDE (RCBP71S);;                                             01350000
                                                      /* EOC RB01298 */ 01360000
                                              /* EOC RB01281         */ 01370000
                                                      /* SOC RB01290 */ 01380000
 DCL 1 PARM_RCBP70S,                  /* TPMNT FOR INTERNAL MACHINES */ 01390000
       %INCLUDE (RCBP70S);;                                             01400000
                                                      /* EOC RB01290 */ 01410000
1/********************************************************************/ 01420000
 /* EXTERNAL ENTRIES                                                 */ 01430000
 /********************************************************************/ 01440000
                                                                        01450000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01460000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 01470000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 01480000
 DCL RCB018M   ENTRY  EXTERNAL;          /* UPDATE HASH TOTAL        */ 01490000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01500000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01510000
 DCL RCBF50M   ENTRY  EXTERNAL;          /* INSERT PARAMETER         */ 01520000
 DCL RCBG50M   ENTRY  EXTERNAL;          /* UPDATE PARAMETER         */ 01530000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01540000
 DCL RCBDC2U   ENTRY  EXTERNAL;          /* HW USER EXIT             */ 01550000
 DCL RCBDC3U   ENTRY  EXTERNAL;          /* SW USER EXIT             */ 01560000
                                                      /* SOC PTM1038 */ 01570000
 DCL RCB021M   ENTRY  EXTERNAL;          /* SUBSTRING MIX. CHAR STR. */ 01580000
                                                      /* EOC PTM1038 */ 01590000
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 01600000
1/********************************************************************/ 01610000
 /*  FILE DECLARATIONS                                               */ 01620000
 /********************************************************************/ 01630000
 DCL RCBDCB1        FILE         /* CCPF INV EXTRACT CU              */ 01640000
                    RECORD                                              01650000
                    OUTPUT                                              01660000
                    SEQUENTIAL                                          01670000
                    ENV (FB RECSIZE(190));                              01680000
                                                                        01690000
 DCL RCBDCB2        FILE         /* CCPF INV EXTRACT INV             */ 01700000
                    RECORD                                              01710000
                    OUTPUT                                              01720000
                    SEQUENTIAL                                          01730000
                    ENV (FB RECSIZE(235));                              01740000
                                                                        01750000
1/********************************************************************/ 01760000
 /* DB2 TABLE STRUCTURES                                             */ 01770000
 /********************************************************************/ 01780000
 DCL 1 TB_RCBV030,                                        /* RB01290 */ 01790000
      %INCLUDE (RCB030S);;                                /* RB01290 */ 01800000
 DCL 1 TB_RCBV150,                                        /* PTM0764 */ 01810000
      %INCLUDE (RCB150S);;                                /* PTM0764 */ 01820000
 DCL 1 TB_RCBV125,                                        /* RB01320 */ 01830000
      %INCLUDE (RCB125S);;                                /* RB01320 */ 01840000
 DCL 1 TB_RCBV240,                                                      01850000
      %INCLUDE (RCB240S);;                                              01860000
 DCL 1 TB_RCBV350,                                        /* RA01117 */ 01870000
      %INCLUDE (RCB350S);;                                /* RA01117 */ 01880000
                                                                        01890000
 DCL 1 TB_RCBV500,                                                      01900000
      %INCLUDE (RCB500S);;                                              01910000
 DCL 1 TB_RCBV500_I,                                                    01920000
      %INCLUDE (RCB500SI);;                                             01930000
 DCL 1 PARM_HASH             BASED (ADDR(TB_RCBV500)),                  01940000
      %INCLUDE (RCBP24S);;                                              01950000
                                                      /* SOC RB01281 */ 01960000
                                                      /* SOC RB01298 */ 01970000
 /*DCL 1 TB_RCBP63S            BASED (ADDR(TB_RCBV500)),             */ 01980000
 /*     %INCLUDE (RCBP63S);;                                         */ 01990000
 /*DCL 1 TB_RCBP64S            BASED (ADDR(TB_RCBV500)),             */ 02000000
 /*    %INCLUDE (RCBP64S);;                                          */ 02010000
                                                                        02020000
 DCL 1 TB_RCBP67S           BASED (ADDR(TB_RCBV500)),                   02030000
     %INCLUDE (RCBP67S);;                                               02040000
                                                                        02050000
 DCL 1 TB_RCBP71S           BASED (ADDR(TB_RCBV500)),                   02060000
     %INCLUDE (RCBP71S);;                                               02070000
                                                      /* EOC RB01298 */ 02080000
                                                        /*EOC RB01281 */02090000
 DCL 1 TB_RCBP70S           BASED (ADDR(TB_RCBV500)),    /* RB01290 */  02100000
     %INCLUDE (RCBP70S);;                                /* RB01290 */  02110000
                                                                        02120000
1/********************************************************************/ 02130000
 /* SELECT STRUCTURES                                                */ 02140000
 /********************************************************************/ 02150000
 DCL 1 CURSOR_CU_V724,                                                  02160000
        %INCLUDE (RCB724S);;                                            02170000
 DCL 1 CURSOR_CU_V010,                                                  02180000
        %INCLUDE (RCB010S);;                                            02190000
                                                                        02200000
 DCL 1 CURSOR_HW_V724,                                                  02210000
        %INCLUDE (RCB724S);;                                            02220000
 DCL 1 CURSOR_HW_V170,                                                  02230000
        %INCLUDE (RCB170S);;                                            02240000
 DCL 1 CURSOR_HW_V190,                                                  02250000
        %INCLUDE (RCB190S);;                                            02260000
 DCL 1 CURSOR_HW_V220,                                                  02270000
        %INCLUDE (RCB220S);;                                            02280000
 DCL 1 CURSOR_HW_V300,                                                  02290000
        %INCLUDE (RCB300S);;                                            02300000
 DCL 1 CURSOR_HW_V070,                                                  02310000
        %INCLUDE (RCB070S);;                                            02320000
 DCL 1 CURSOR_HW_STAT,                                                  02330000
        3 STATUS CHAR(1);                                               02340000
                                                                        02350000
 DCL 1 CURSOR_SW,                                                       02360000
      3 PRODUCT_TYPE_HW                 CHAR(04),                       02370000
      3 ORIGIN_HW                       CHAR(02),                       02380000
      3 SEQUENCE_NUMBER_HW              CHAR(28),         /* RB01242 */ 02390000
      3 PRODUCT_TYPE_SW                 CHAR(04),                       02400000
      3 MODEL_NUMBER_SW                 CHAR(03),                       02410000
      3 ORIGIN_SW                       CHAR(02),                       02420000
      3 SEQUENCE_NUMBER_SW              CHAR(28),         /* RB01242 */ 02430000
      3 DSLO_COPY_IND                   CHAR(01),                       02440000
      3 OU_CODE                         CHAR(07),                       02450000
      3 CUSTOMER_USER                   CHAR(08),                       02460000
      3 MARKETING_INSTDAT               CHAR(10),                       02470000
      3 END_DATE                        CHAR(10),                       02480000
      3 ORDER_REF_NUMBER                CHAR(06),                       02490000
      3 PRODUCT_CODE                    CHAR(01),                       02500000
      3 LICENCE_TYPE                    CHAR(01),                       02510000
      3 SERVICE_CLASS                   CHAR(01),                       02520000
      3 SUPPORT_TYPE                    CHAR(01),                       02530000
      3 SUPPORT_LOCATION                CHAR(02),                       02540000
      3 SERVICE_PERIOD                  CHAR(02),                       02550000
      3 DEVELOP_DIV_CODE                CHAR(01),                       02560000
      3 EFFECTIVE_DATE                  CHAR(10);                       02570000
 /********************************************************************/ 02580000
 /*  RECORD STRUCTURES                                               */ 02590000
 /********************************************************************/ 02600000
 DCL 1 FILE_RCBDCB1,             /* CCPF INV CU RECORD               */ 02610000
      %INCLUDE (RCBDCBS1);;                                             02620000
                                                                        02630000
 DCL 1 FILE_RCBDCB1_H BASED (ADDR(FILE_RCBDCB1)),/* HEADER/TRAILER   */ 02640000
      %INCLUDE (RCBD01S);;                                              02650000
                                                                        02660000
 DCL 1 FILE_RCBDCB2  CHAR(235);  /* CCPF INV HW/SW RECORD            */ 02670000
                                                                        02680000
 DCL 1 FILE_RCBDCB2_HW BASED(ADDR(FILE_RCBDCB2)),/* HW RECORD        */ 02690000
      %INCLUDE (RCBDCBS2);,                                             02700000
      2 EXTRA_INFO,              /* NEEDED FOR COMPARE PROCESS       */ 02710000
        3 CUSTOMER_NUMBER                CHAR(08),                      02720000
        3 PRODUCT_TYPE_HW                CHAR(04),                      02730000
        3 ORIGIN_HW                      CHAR(02),                      02740000
        3 SEQUENCE_NUMBER_HW             CHAR(07),                      02750000
        3 PRODUCT_TYPE_SW                CHAR(04),                      02760000
        3 MODEL_NUMBER_SW                CHAR(03),                      02770000
        3 ORIGIN_SW                      CHAR(02),                      02780000
        3 SEQUENCE_NUMBER_SW             CHAR(07),                      02790000
        3 OU_CODE                        CHAR(07),                      02800000
        3 RETAIN_FLAG                    CHAR(01);                      02810000
                                                                        02820000
 DCL 1 FILE_RCBDCB2_SW BASED(ADDR(FILE_RCBDCB2)),/* SW RECORD        */ 02830000
      %INCLUDE (RCBDCBS3);,                                             02840000
      2 EXTRA_INFO,              /* NEEDED FOR COMPARE PROCESS       */ 02850000
        3 CUSTOMER_NUMBER                CHAR(08),                      02860000
        3 PRODUCT_TYPE_HW                CHAR(04),                      02870000
        3 ORIGIN_HW                      CHAR(02),                      02880000
        3 SEQUENCE_NUMBER_HW             CHAR(07),                      02890000
        3 PRODUCT_TYPE_SW                CHAR(04),                      02900000
        3 MODEL_NUMBER_SW                CHAR(03),                      02910000
        3 ORIGIN_SW                      CHAR(02),                      02920000
        3 SEQUENCE_NUMBER_SW             CHAR(07),                      02930000
        3 OU_CODE                        CHAR(07),                      02940000
        3 FILLER                         CHAR(01);                      02950000
                                                                        02960000
 DCL 1 FILE_RCBDCB2_H BASED (ADDR(FILE_RCBDCB2)),/* HEADER/TRAILER   */ 02970000
      %INCLUDE (RCBD01S);;                                              02980000
                                                                        02990000
 /********************************************************************/ 03000000
 /*  USER EXIT INFORMATION                                           */ 03010000
 /********************************************************************/ 03020000
 DCL 1 USER_INFO_HW,                                                    03030000
      %INCLUDE (RCBDC2S);;                                              03040000
                                                                        03050000
 DCL 1 USER_INFO_SW,                                                    03060000
      %INCLUDE (RCBDC3S);;                                              03070000
                                                                        03080000
 DCL 1 USER_FILE_RCBDCB2_HW LIKE FILE_RCBDCB2_HW;                       03090000
 DCL 1 USER_FILE_RCBDCB2_SW LIKE FILE_RCBDCB2_SW;                       03100000
                                                                        03110000
 /********************************************************************/ 03120000
 /*  BIT SWITCHES                                                    */ 03130000
 /********************************************************************/ 03140000
 DCL 1 SWITCHES,                                                        03150000
     3 TRUE                          BIT (1)  INIT ('1'B),              03160000
     3 FALSE                         BIT (1)  INIT ('0'B),              03170000
     3 SWITCH_END_OF_CURSOR_CU       BIT (1)  INIT ('0'B),              03180000
     3 SWITCH_END_OF_CURSOR_HW       BIT (1)  INIT ('0'B),              03190000
     3 SWITCH_END_OF_CURSOR_SW       BIT (1)  INIT ('0'B),              03200000
                                                      /* SOC RB01281 */ 03220000
     3 F_WARRANTY_MA_STATUS          BIT (1)  INIT ('0'B),              03230000
                                                      /* SOC RB01298 */ 03240000
 /*  3 F_WARRANTY_MA_STATUS_GEO      BIT (1)  INIT ('0'B),           */ 03250000
                                                      /* EOC RB01298 */ 03260000
     3 FLEXIBLE_WARRANTY_BAU         BIT (1)  INIT ('0'B);              03270000
                                                      /* EOC RB01281 */ 03280000
 DCL   SWITCH_HW_EXIT                BIT (1)  INIT ('1'B);              03290000
 DCL   SWITCH_SW_EXIT                BIT (1)  INIT ('1'B);              03300000
 DCL   SWITCH_ACTIVE_CTR             BIT (1)  INIT ('0'B);/* RB01290 */ 03310000
 DCL   SWITCH_INTERNAL_CTR           BIT (1)  INIT ('0'B);/* RB01290 */ 03320000
 /********************************************************************/ 03330000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 03340000
 /********************************************************************/ 03350000
 DCL 1 WORK_FIELDS,                                                     03360000
    3 WRK_MOD_NAME                      CHAR (08)  INIT ('RCBDCBM'),    03370000
    3 WRK_PRG_NAME                      CHAR (08)  INIT ('RCBDCBP'),    03380000
    3 WRK_FILE_NAME_1                   CHAR (07)  INIT ('RCBDCB1'),    03390000
    3 WRK_FILE_NAME_2                   CHAR (07)  INIT ('RCBDCB2'),    03400000
    3 WRK_SYSTEM_TYPE                   CHAR (01)  INIT ('B'),          03410000
    3 WRK_PROC_ID                       CHAR (04),                      03420000
    3 WRK_CTRYNO                        CHAR (03),                      03430000
    3 WRK_PGR_TYPE                      CHAR (03),                      03440000
    3 WRK_RUN_DATE                      CHAR (10),                      03450000
    3 WRK_RUN_SEQ_NO                    PIC '99',                       03460000
    3 WRK_TIME_STAMP                    CHAR(20),                       03470000
    3 WRK_CURR_HW,                                                      03480000
      5 PRODUCT_TYPE                    CHAR(04),                       03490000
      5 ORIGIN                          CHAR(02),                       03500000
      5 SEQUENCE_NUMBER                 CHAR(28),         /* RB01242 */ 03510000
      5 CUSTOMER_NUMBER                 CHAR(08),                       03520000
                                                      /* SOC RB01320 */ 03521004
    3 WRK_ORIGIN                        CHAR(02),                       03530004
    3 WRK_SEQ_NO                        CHAR(28),                       03540004
    3 WRK_REAL_SERIAL_NUM               CHAR(30),                       03541004
    3 WRK_REAL_INDNULL                  FIXED BIN(15),                  03541104
                                                      /* EOC RB01320 */ 03542004
    3 WRK_INDNULL                       FIXED BIN(15),                  03550000
    3 WRK_INSTDAT                       CHAR (10),                      03560000
    3 WRK_MONTH                         FIXED BIN(31) INIT(0),          03570000
    3 WRK_MONTH_PIC                     PIC '99' INIT(0),               03580000
    3 WRK_CNT_RCBDCB1                   FIXED BIN(31) INIT(0),          03590000
    3 WRK_CNT_RCBDCB2                   FIXED BIN(31) INIT(0),          03600000
    3 WRK_HASH_TOTAL_1                  FIXED DEC(15) INIT(0),          03610000
    3 WRK_HASH_TOTAL_2                  FIXED DEC(15) INIT(0),          03620000
    3 WRK_PIC_10                        PIC 'Z,ZZZ,ZZZ,ZZ9',            03630000
    3 WRK_PIC_15                        PIC '(15)9',                    03640000
    3 WRK_TPMNT_VAL,                                                    03650000
      %INCLUDE (RCBZ99S);,                                              03660000
    3 WRK_TYPE_OF_MAINT                 CHAR (01),                      03670000
    3 WRK_RCB021M_START                 FIXED (15),   /* SOC PTM1038 */ 03680000
    3 WRK_RCB021M_LENGTH                FIXED (15),                     03690000
    3 WRK_RCB021M_RET                   FIXED (15),   /* EOC PTM1038 */ 03700000
    3 WRK_OPEN_DATE_CH6                 CHAR (06) INIT ('999999'),      03710000
                                                      /* SOC RB01290 */ 03720000
 /* 3 WRK_OPEN_DATE_CH10                CHAR (10) INIT('9999-12-31');*/ 03730000
    3 WRK_OPEN_DATE_CH10                CHAR (10) INIT('9999-12-31'),   03740000
    3 WRK_CONTRACT_NUMBER_INDNULL       FIXED BIN(15) INIT (0),         03750000
    3 WRK_TYPE_OF_CONTRACT_INDNULL      FIXED BIN(15) INIT (0);         03760000
                                                      /* EOC RB01290 */ 03770000
 DCL 1 SK_HW_S,                                                         03780000
      3 EOF                         CHAR(01),                           03790000
      3 PRODUCT_TYPE                CHAR(04),                           03800000
      3 ORIGIN                      CHAR(02),                           03810000
      3 SEQUENCE_NUMBER             CHAR(28);             /* RB01242 */ 03820000
 DCL 1 SK_HW  BASED(ADDR(SK_HW_S))  CHAR(35);             /* RB01242 */ 03830000
 DCL PREV_TOS                       CHAR(34);             /* RB01242 */ 03840000
                                                    /* START RC01141 */ 03850000
 DCL 1 SK_SW_S,                                                         03860000
      3 EOF                         CHAR(01),                           03870000
      3 PRODUCT_TYPE                CHAR(04),                           03880000
      3 ORIGIN                      CHAR(02),                           03890000
      3 SEQUENCE_NUMBER             CHAR(28),             /* RB01242 */ 03900000
      3 PRODUCT_TYPE_SW             CHAR(04),                           03910000
      3 MODEL_SW                    CHAR(03),                           03920000
      3 ORIGIN_SW                   CHAR(02),                           03930000
      3 SEQUENCE_NUMBER_SW          CHAR(28);             /* RB01242 */ 03940000
                                                     /* END RC01141 */  03950000
 DCL 1 SK_SW  BASED(ADDR(SK_SW_S))  CHAR(35);             /* RB01242 */ 03960000
                                                                        03970000
1/********************************************************************/ 03980000
 /*  BUILTIN FUNCTIONS                                               */ 03990000
 /********************************************************************/ 04000000
 DCL (ADDR,                                                             04010000
     DATE,                                                              04020000
     NULL,                                                              04030000
     STG,                                                               04040000
     STRING,                                                            04050000
     SUBSTR,                                                            04060000
     TRANSLATE,                                                         04070000
     VERIFY,                                                            04080000
     TIME)                   BUILTIN;                                   04090000
1/********************************************************************/ 04100000
 /* ON ERROR CONDITIONS                                              */ 04110000
 /********************************************************************/ 04120000
 %INCLUDE (RCB0E0M);                                                    04130000
 END;                                                                   04140000
1/********************************************************************/ 04150000
 /* DB2/SQL SQLCA                                                    */ 04160000
 /********************************************************************/ 04170000
 EXEC SQL                                                               04180000
   INCLUDE SQLCA                                                        04190000
   ;                                                                    04200000
 /********************************************************************/ 04210000
 /* DB2/SQL CURSORS                                                  */ 04220000
 /********************************************************************/ 04230000
                                         /* CURSOR_CU                */ 04240000
                                         /* CUSTOMER INFORMATION     */ 04250000
                                                                        04260000
 EXEC SQL                                                               04270000
   DECLARE CURSOR_CU CURSOR FOR                                         04280000
   SELECT DISTINCT                                                      04290000
          B.CUSTOMER_NUMBER                                             04300000
         ,B.CUSTOMER_NAME                                               04310000
         ,B.ENTERPRISE_NUMBER                             /* RA01117 */ 04320000
   FROM RCBV0724_CCPF_INV    A                                          04330000
       ,RCBV0010_CUSTOMER    B                                          04340000
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            04350000
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       04360000
     AND B.CUSTOMER_NUMBER     = A.CUSTOMER_NUMBER                      04370000
                                                                        04380000
   ORDER BY B.CUSTOMER_NUMBER DESC                                      04390000
   FOR FETCH ONLY                                         /* RC01219 */ 04400000
           ;                                                            04410000
                                                                        04420000
                                         /* CURSOR_HW                */ 04430000
                                         /* HW INFORMATION           */ 04440000
 EXEC SQL                                                               04450000
   DECLARE CURSOR_HW CURSOR FOR                                         04460000
   SELECT DISTINCT                                                      04470000
          A.PRODUCT_TYPE_HW                                             04480000
         ,A.ORIGIN_HW                                                   04490000
         ,A.SEQUENCE_NUMBER_HW                                          04500000
         ,'I'                                                           04510000
         ,B.OU_CODE                                                     04520000
         ,C.CUSTOMER_NUMBER                                             04530000
         ,C.MARKETING_INSTDAT                                           04540000
         ,D.TYPE_OF_MAINT                                               04550000
         ,D.TYPE_OF_WARRANTY                                            04560000
         ,D.WARRANTY_EXP_DATE                             /* RB01281 */ 04570000
         ,D.SOURCE_INDICATOR                              /* RB01290 */ 04580000
         ,D.F_TYPE_OF_WARRANTY                            /* RB01281 */ 04590000
         ,D.F_SPLT_DATE                                   /* RB01281 */ 04600000
         ,E.MODEL_NUMBER                                                04610000
         ,F.RETAIN_FLAG                                                 04620000
                                                      /* SOC RB01320 */ 04620104
 /*      ,I.REAL_SERIAL_NUMBER */                 /* SOC CEDS00000738 */04621017
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM           /* EOC CEDS00000738 */04622017
 /*FROM RCBV0724_CCPF_INV    A                                          04640006
       ,RCBV0170_OU_HW       B */                                       04650000
                                                  /* SOC CEDS00000738 */04651017
 /*    FROM  RCBV0170_OU_HW       B                   /* EOC RB01320 */ 04660006
 /*    ,RCBV0190_HW_CUST     C */                                       04670011
 /*    ,RCBV0220_SUPPL_CTR   D */                                       04680011
 /*    ,RCBV0300_HW_REAL     E */                                       04690011
 /*    ,RCBV0070_HW_PO       F */                                       04700011
 /*    ,RCBV0724_CCPF_INV    A */                     /* SOC RB01320 */ 04710011
                                                                        04720000
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL I                                 04730006
 /*  ON   A.PRODUCT_TYPE_HW    = I.PRODUCT_TYPE */                      04740012
 /*  AND  A.ORIGIN_HW          = I.DUMMY_ORIGIN */                      04750012
 /*  AND  A.SEQUENCE_NUMBER_HW = I.DUMMY_SEQUENCE_NUM */                04760012
 /*  AND  A.COUNTRY_NUMBER     = I.COUNTRY_NUMBER */                    04770012
                                                      /* EOC RB01320 */ 04780000
 /*WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO */                         04790012
 /*  AND A.PRODUCT_TYPE_HW     IS NOT NULL */                           04800012
 /*  AND A.PRODUCT_TYPE_HW     ¬= '9998' */                             04810012
   FROM RCBV0724_CCPF_INV    A                                          04810110
                                                /* EOC CEDS00000738 */  04811017
                                                      /* SOC RB01320 */ 04820000
  /* AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE_HW                      04830000
     AND B.ORIGIN              = A.ORIGIN_HW                            04840000
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW */                04850000
                                                /* SOC CEDS00000738 */  04850117
     INNER JOIN RCBV0170_OU_HW       B                                  04851006
  /* AND B.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW */                 04860006
     ON B.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW                     04861006
  /* AND ((B.ORIGIN              = A.ORIGIN_HW */                       04870013
  /* AND   B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW) */             04880013
  /* OR   (I.COUNTRY_NUMBER      = A.COUNTRY_NUMBER */                  04890013
  /* AND   I.PRODUCT_TYPE        = B.PRODUCT_TYPE */                    04900013
  /* AND  (I.REAL_SERIAL_NUMBER  = B.ORIGIN||B.SEQUENCE_NUMBER */       04910013
  /* AND  (I.DUMMY_ORIGIN        = A.ORIGIN_HW */                       04920013
  /* AND   I.DUMMY_SEQUENCE_NUM  = A.SEQUENCE_NUMBER_HW)))) */          04930013
     AND B.ORIGIN             = A.REAL_ORIGIN                           04931006
     AND B.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM  /* EOC CEDS00000738 */  04932017
                                                       /* EOC RB01320 */04940000
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       04950000
     AND :WRK_RUN_DATE         BETWEEN B.EFFECTIVE_DATE                 04960000
                                   AND B.END_DATE                       04970000
                                                                        04980000
                                                       /* SOC RB01320 */04990000
 /*  AND C.PRODUCT_TYPE        = A.PRODUCT_TYPE_HW                      05000000
     AND C.ORIGIN              = A.ORIGIN_HW                            05010000
     AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW  */               05020000
     INNER JOIN RCBV0190_HW_CUST     C         /* SOC CEDS00000738 */   05021017
  /* AND C.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW */                 05030006
     ON C.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW                     05031006
  /* AND ((C.ORIGIN              = A.ORIGIN_HW                          05040006
  /* AND   C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW)                05050014
  /* OR   (I.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                     05060014
  /* AND   I.PRODUCT_TYPE        = C.PRODUCT_TYPE                       05070014
  /* AND  (I.REAL_SERIAL_NUMBER  = C.ORIGIN||C.SEQUENCE_NUMBER          05080014
  /* AND  (I.DUMMY_ORIGIN        = A.ORIGIN_HW                          05090014
  /* AND   I.DUMMY_SEQUENCE_NUM  = A.SEQUENCE_NUMBER_HW)))) */          05100014
     AND C.ORIGIN             = A.REAL_ORIGIN                           05101006
     AND C.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM /* EOC CEDS00000738 */   05102017
                                                       /* EOC RB01320 */05110000
     AND C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       05120000
     AND C.TYPE_OF_RELATION    = 'U'                                    05130000
     AND :WRK_RUN_DATE         BETWEEN C.EFFECTIVE_DATE                 05140000
                                   AND C.END_DATE                       05150000
                                                                        05160000
                                                       /* SOC RB01320 */05170000
  /* AND D.PRODUCT_TYPE        = A.PRODUCT_TYPE_HW                      05180000
     AND D.ORIGIN              = A.ORIGIN_HW                            05190000
     AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW */                05200000
     INNER JOIN RCBV0220_SUPPL_CTR   D          /* SOC CEDS00000738 */  05201017
  /* AND D.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW */                 05210006
     ON D.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW                     05211006
  /* AND ((D.ORIGIN              = A.ORIGIN_HW                          05220006
  /* AND   D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW)                05230014
  /* OR   (I.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                     05240014
  /* AND   I.PRODUCT_TYPE        = D.PRODUCT_TYPE                       05250014
  /* AND  (I.REAL_SERIAL_NUMBER  = D.ORIGIN||D.SEQUENCE_NUMBER          05260014
  /* AND  (I.DUMMY_ORIGIN        = A.ORIGIN_HW                          05270014
  /* AND   I.DUMMY_SEQUENCE_NUM  = A.SEQUENCE_NUMBER_HW)))) */          05280014
     AND D.ORIGIN             = A.REAL_ORIGIN                           05281006
     AND D.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM  /* EOC CEDS00000738 */  05282017
                                                       /* EOC RB01320 */05290000
     AND D.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       05300000
     AND :WRK_RUN_DATE         BETWEEN D.EFFECTIVE_DATE                 05310000
                                   AND D.END_DATE                       05320000
                                                                        05330000
                                                       /* SOC RB01320 */05340000
  /* AND E.PRODUCT_TYPE        = A.PRODUCT_TYPE_HW                      05350000
     AND E.ORIGIN              = A.ORIGIN_HW                            05360000
     AND E.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW */                05370000
     INNER JOIN RCBV0300_HW_REAL     E         /* SOC CEDS00000738 */   05371017
  /* AND E.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW */                 05380006
     ON E.PRODUCT_TYPE          = A.PRODUCT_TYPE_HW                     05381006
  /* AND ((E.ORIGIN              = A.ORIGIN_HW                          05390006
  /* AND   E.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW)                05400014
  /* OR   (I.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                     05410014
  /* AND   I.PRODUCT_TYPE        = E.PRODUCT_TYPE                       05420014
  /* AND  (I.REAL_SERIAL_NUMBER  = E.ORIGIN||E.SEQUENCE_NUMBER          05430014
  /* AND  (I.DUMMY_ORIGIN        = A.ORIGIN_HW                          05440014
  /* AND   I.DUMMY_SEQUENCE_NUM  = A.SEQUENCE_NUMBER_HW)))) */          05450014
     AND E.ORIGIN             = A.REAL_ORIGIN                           05460006
     AND E.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM /* EOC CEDS00000738 */   05460117
                                                       /* EOC RB01320 */05461000
     AND E.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       05470000
     AND :WRK_RUN_DATE         BETWEEN E.EFFECTIVE_DATE                 05480000
                                   AND E.END_DATE                       05490000
                                                                        05500000
     INNER JOIN RCBV0070_HW_PO       F           /* SOC CEDS00000738 */ 05501017
  /* AND F.COUNTRY_NUMBER      = E.COUNTRY_NUMBER */                    05510014
     ON F.COUNTRY_NUMBER      = E.COUNTRY_NUMBER /* EOC CEDS00000738 */ 05511017
     AND F.PRODUCT_TYPE        = E.PRODUCT_TYPE                         05520000
     AND F.MODEL_NUMBER        = E.MODEL_NUMBER                         05530000
                                                 /* SOC CEDS00000738 */ 05530117
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            05531006
     AND A.PRODUCT_TYPE_HW     IS NOT NULL                              05532006
     AND A.PRODUCT_TYPE_HW     ¬= '9998'         /* EOC CEDS00000738 */ 05533017
                                                                        05540000
                                         /* CURSOR_HW                */ 05550000
                                         /* INCLUDE ORDERS           */ 05560000
   UNION                                                                05570000
   SELECT                                                               05580000
          A.PRODUCT_TYPE_HW                                             05590000
         ,A.ORIGIN_HW                                                   05600000
         ,A.SEQUENCE_NUMBER_HW                                          05610000
         ,'O'                                                           05620000
         ,G.OU_CODE                                                     05630000
         ,G.CUSTOMER_USER                                               05640000
         ,G.SCHED_COMPL_DATE                                            05650000
         ,G.TYPE_OF_MAINT                                               05660000
         ,G.TYPE_OF_WARRANTY                                            05670000
         ,DATE('3999-12-31')                                            05680000
         ,''                                              /* RB01290 */ 05690000
         ,''                                                            05700000
         ,DATE('3999-12-31')                                            05710000
         ,G.MODEL_NUMBER                                                05720000
         ,H.RETAIN_FLAG                                                 05730000
                                                      /* SOC RB01320 */ 05730104
 /*      ,I.REAL_SERIAL_NUMBER */            /* SOC CEDS00000738 */     05731017
         ,A.REAL_ORIGIN||A.REAL_SEQ_NUM      /* EOC CEDS00000738 */     05732017
 /*FROM RCBV0724_CCPF_INV    A                                          05750000
       ,RCBV0260_HW_IN_ORD   G */                                       05760000
                                                  /* SOC CEDS00000738 */05761017
 /*FROM RCBV0260_HW_IN_ORD   G                        /* EOC RB01320 */ 05770006
 /*    ,RCBV0070_HW_PO       H                                          05780006
 /*    ,RCBV0724_CCPF_INV    A                        /* SOC RB01320 */ 05790014
   FROM RCBV0724_CCPF_INV    A                                          05791006
                                                                        05800000
 /*LEFT OUTER JOIN RCBV0125_DMMY_REAL I                                 05810006
 /*  ON   A.PRODUCT_TYPE_HW    = I.PRODUCT_TYPE                         05820014
 /*  AND  A.ORIGIN_HW          = I.DUMMY_ORIGIN                         05830014
 /*  AND  A.SEQUENCE_NUMBER_HW = I.DUMMY_SEQUENCE_NUM                   05840014
 /*  AND   A.COUNTRY_NUMBER    = I.COUNTRY_NUMBER */                    05850014
                                                      /* EOC RB01320 */ 05860000
 /*WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            05870006
 /*  AND A.PRODUCT_TYPE_HW     IS NOT NULL                              05880014
 /*  AND A.PRODUCT_TYPE_HW     ¬= '9998' */                             05890014
     INNER JOIN RCBV0260_HW_IN_ORD   G                                  05900006
  /* AND G.PRODUCT_TYPE        = A.PRODUCT_TYPE_HW */                   05910006
     ON  G.PRODUCT_TYPE        = A.PRODUCT_TYPE_HW/* EOC CEDS00000738 */05911017
                                                       /* SOC RB01320 */05920000
  /* AND G.ORIGIN              = A.ORIGIN_HW                            05930000
     AND G.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER_HW */                05940000
  /* AND ((G.ORIGIN            = A.ORIGIN_HW */  /* SOC CEDS00000738 */ 05950020
  /* AND  G.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER_HW)                  05960006
  /* OR  (I.COUNTRY_NUMBER     = G.COUNTRY_NUMBER                       05970014
  /* AND  I.PRODUCT_TYPE       = G.PRODUCT_TYPE                         05980014
  /* AND  I.REAL_SERIAL_NUMBER = G.ORIGIN||G.SEQUENCE_NUMBER            05990014
  /* AND  I.DUMMY_ORIGIN       = A.ORIGIN_HW                            06000014
  /* AND  I.DUMMY_SEQUENCE_NUM = A.SEQUENCE_NUMBER_HW)) */              06010014
     AND G.ORIGIN             = A.REAL_ORIGIN                           06011006
     AND G.SEQUENCE_NUMBER    = A.REAL_SEQ_NUM   /* EOC CEDS00000738 */ 06012017
                                                       /* EOC RB01320 */06020000
     AND G.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       06030000
     AND :WRK_RUN_DATE         BETWEEN G.ORDER_DATE                     06040000
                                   AND G.END_DATE                       06050000
                                                                        06060000
     INNER JOIN RCBV0070_HW_PO       H           /* SOC CEDS00000738 */ 06061017
  /* AND H.COUNTRY_NUMBER      = G.COUNTRY_NUMBER */                    06070014
     ON H.COUNTRY_NUMBER      = G.COUNTRY_NUMBER /* EOC CEDS00000738 */ 06071017
     AND H.PRODUCT_TYPE        = G.PRODUCT_TYPE                         06080000
     AND H.MODEL_NUMBER        = G.MODEL_NUMBER                         06090000
                                                 /* SOC CEDS00000738 */ 06090117
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            06091006
     AND A.PRODUCT_TYPE_HW     IS NOT NULL                              06092006
     AND A.PRODUCT_TYPE_HW     ¬= '9998'         /* EOC CEDS00000738 */ 06093017
                                                                        06100000
   ORDER BY 1                                                           06110000
           ,2                                                           06120000
           ,3                                                           06130000
           ,4                                                           06140000
   FOR FETCH ONLY                                         /* RC01219 */ 06150000
           ;                                                            06160000
                                                                        06170000
                                                                        06180000
                                         /* CURSOR_SW                */ 06190000
                                         /* SW INFORMATION           */ 06200000
 EXEC SQL                                                               06210000
   DECLARE CURSOR_SW CURSOR FOR                                         06220000
   SELECT                                /* INSTALLED SW             */ 06230000
         E.PRODUCT_TYPE_HW                                              06240000
        ,E.ORIGIN_HW                                                    06250000
        ,E.SEQUENCE_NUMBER_HW                                           06260000
        ,A.PRODUCT_TYPE_SW                                              06270000
        ,A.MODEL_NUMBER_SW                                              06280000
        ,A.ORIGIN_SW                                                    06290000
        ,A.SEQUENCE_NUMBER_SW                                           06300000
        ,B.DSLO_COPY_IND                                                06310000
        ,C.OU_CODE                                                      06320000
        ,D.CUSTOMER_USER                                                06330000
        ,D.MARKETING_INSTDAT                                            06340000
        ,D.END_DATE                                                     06350000
        ,''                                                             06360000
     FROM RCBV0724_CCPF_INV  A                                          06370000
     /*  ,RCBV0060_SW_PR     B  */              /* SOC CEDS00000738 */  06380020
     /*  ,RCBV0180_OU_SW     C                                          06390006
     /*  ,RCBV0200_SW_CUST   D                                          06400014
         ,RCBV0320_SW_ON_HW  E */                                       06410007
 /* WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                            06420007
 /*   AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       06430014
 /*   AND C.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       06440014
 /*   AND D.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       06450014
 /*   AND A.PRODUCT_TYPE_SW    ¬= ''                                    06460014
 /*   AND A.ORIGIN_SW          ¬= ''   */                               06470014
    INNER JOIN RCBV0060_SW_PR     B                                     06480014
   /* AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW */                   06490006
      ON  B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER /* SOC CEDS00000792 */06490125
   /* ON  B.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW/* EOC CEDS00000738 */06491023
      AND B.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW/* EOC CEDS00000792 */06492025
      AND B.MODEL_NUMBER       = A.MODEL_NUMBER_SW                      06500000
      AND B.ORIGIN             = A.ORIGIN_SW                            06510000
      AND B.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER_SW                   06520000
    INNER JOIN RCBV0180_OU_SW     C               /* SOC CEDS00000738 */06530017
  /*  AND C.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW */                   06540006
      ON  C.COUNTRY_NUMBER     = A.COUNTRY_NUMBER /* SOC CEDS00000792 */06541025
  /*  ON  C.MODEL_NUMBER       = A.MODEL_NUMBER_SW/* EOC CEDS00000738 */06550023
      AND C.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW                      06551023
      AND C.MODEL_NUMBER       = A.MODEL_NUMBER_SW/* EOC CEDS00000792 */06552025
      AND C.ORIGIN             = A.ORIGIN_SW                            06560000
      AND C.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER_SW                   06570000
      AND C.TYPE_OF_RELATION   = 'M'                                    06580000
      AND :WRK_RUN_DATE        BETWEEN C.EFFECTIVE_DATE                 06590000
                                   AND C.END_DATE                       06600000
    INNER JOIN RCBV0200_SW_CUST   D               /* SOC CEDS00000738 */06610017
   /* AND D.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW */                   06620006
      ON  D.COUNTRY_NUMBER     = A.COUNTRY_NUMBER /* SOC CEDS00000792 */06620125
   /* ON  D.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW/* EOC CEDS00000738 */06621023
      AND D.PRODUCT_TYPE       = A.PRODUCT_TYPE_SW/* EOC CEDS00000792 */06622025
      AND D.MODEL_NUMBER       = A.MODEL_NUMBER_SW                      06630000
      AND D.ORIGIN             = A.ORIGIN_SW                            06640000
      AND D.SEQUENCE_NUMBER    = A.SEQUENCE_NUMBER_SW                   06650000
      AND :WRK_RUN_DATE        BETWEEN D.EFFECTIVE_DATE                 06660000
                                   AND D.END_DATE                       06670000
    INNER JOIN RCBV0320_SW_ON_HW  E               /* SOC CEDS00000738 */06680017
   /* AND E.PRODUCT_TYPE_SW    = A.PRODUCT_TYPE_SW */                   06690006
      ON  E.PRODUCT_TYPE_SW    = A.PRODUCT_TYPE_SW/* EOC CEDS00000738 */06691017
      AND E.MODEL_NUMBER_SW    = A.MODEL_NUMBER_SW                      06700000
      AND E.ORIGIN_SW          = A.ORIGIN_SW                            06710000
      AND E.SEQUENCE_NUMBER_SW = A.SEQUENCE_NUMBER_SW                   06720000
      AND E.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       06730000
      AND :WRK_RUN_DATE        BETWEEN E.EFFECTIVE_DATE                 06740000
                                   AND E.END_DATE                       06750000
                                                                        06760000
    WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO      /* SOC CEDS00000738 */06761017
  /*  AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER /* SOC CEDS00000792 */06762025
  /*  AND C.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       06763023
  /*  AND D.COUNTRY_NUMBER     = A.COUNTRY_NUMBER*//*EOC CEDS00000792 */06764025
      AND A.PRODUCT_TYPE_SW    ¬= ''                                    06765007
      AND A.ORIGIN_SW          ¬= ''                                    06766007
                                                  /* EOC CEDS00000738 */06767017
   UNION                                                                06770000
                                                                        06780000
                                   /* ON ORDER SW WITH UNKNOWN HW    */ 06790000
   SELECT                                                               06800000
         ' '                                                            06810000
        ,' '                                                            06820000
        ,' '                                                            06830000
        ,A.PRODUCT_TYPE_SW                                              06840000
        ,A.MODEL_NUMBER_SW                                              06850000
        ,''                                                             06860000
        ,''                                                             06870000
        ,B.DSLO_COPY_IND         /* PTM 0368                         */ 06880000
        ,B.OU_CODE                                                      06890000
        ,B.CUSTOMER_USER                                                06900000
        ,DATE('0001-01-01')                                             06910000
        ,DATE('0001-01-01')                                             06920000
        ,B.ORDER_REF_NUMBER                                             06930000
     FROM RCBV0724_CCPF_INV  A                                          06940000
         ,RCBV0270_SW_IN_ORD B                                          06950000
    WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                            06960000
      AND A.PRODUCT_TYPE_SW    ¬= ''                                    06970000
      AND A.ORIGIN_SW          = ''                                     06980000
      AND (                                                             06990000
           A.PRODUCT_TYPE_HW    = ''                                    07000000
          OR                                                            07010000
           A.PRODUCT_TYPE_HW    IS NULL                                 07020000
          )                                                             07030000
                                                                        07040000
      AND B.PRODUCT_TYPE_SW    = A.PRODUCT_TYPE_SW                      07050000
      AND B.MODEL_NUMBER_SW    = A.MODEL_NUMBER_SW                      07060000
      AND B.PRODUCT_TYPE_HW    IS NULL                                  07070000
      AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       07080000
      AND B.CUSTOMER_USER      = A.CUSTOMER_NUMBER                      07090000
      AND :WRK_RUN_DATE        BETWEEN B.ORDER_DATE                     07100000
                                   AND B.END_DATE                       07110000
                                                                        07120000
   UNION                                                                07130000
                                                                        07140000
                                   /* ON ORDER SW WITH OEM           */ 07150000
   SELECT                                                               07160000
         B.PRODUCT_TYPE_HW                                              07170000
        ,B.ORIGIN_HW                                                    07180000
        ,B.SEQUENCE_NUMBER_HW                                           07190000
        ,A.PRODUCT_TYPE_SW                                              07200000
        ,A.MODEL_NUMBER_SW                                              07210000
        ,''                                                             07220000
        ,''                                                             07230000
        ,B.DSLO_COPY_IND         /* PTM 0368                         */ 07240000
        ,B.OU_CODE                                                      07250000
        ,B.CUSTOMER_USER                                                07260000
        ,DATE('0001-01-01')                                             07270000
        ,DATE('0001-01-01')                                             07280000
        ,B.ORDER_REF_NUMBER                                             07290000
     FROM RCBV0724_CCPF_INV  A                                          07300000
         ,RCBV0270_SW_IN_ORD B                                          07310000
    WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                            07320000
      AND A.PRODUCT_TYPE_SW    ¬= ''                                    07330000
      AND A.ORIGIN_SW          = ''                                     07340000
      AND A.PRODUCT_TYPE_HW    = '9998'                                 07350000
                                                                        07360000
      AND B.PRODUCT_TYPE_SW    = A.PRODUCT_TYPE_SW                      07370000
      AND B.MODEL_NUMBER_SW    = A.MODEL_NUMBER_SW                      07380000
      AND B.PRODUCT_TYPE_HW    = '9998'                                 07390000
      AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       07400000
      AND B.CUSTOMER_USER      = A.CUSTOMER_NUMBER                      07410000
      AND :WRK_RUN_DATE        BETWEEN B.ORDER_DATE                     07420000
                                   AND B.END_DATE                       07430000
                                                                        07440000
   UNION                                                                07450000
                                                                        07460000
                                   /* ON ORDER SW WITH HW            */ 07470000
   SELECT                                                               07480000
         B.PRODUCT_TYPE_HW                                              07490000
        ,B.ORIGIN_HW                                                    07500000
        ,B.SEQUENCE_NUMBER_HW                                           07510000
        ,A.PRODUCT_TYPE_SW                                              07520000
        ,A.MODEL_NUMBER_SW                                              07530000
        ,''                                                             07540000
        ,''                                                             07550000
        ,B.DSLO_COPY_IND         /* PTM 0368                         */ 07560000
        ,B.OU_CODE                                                      07570000
        ,B.CUSTOMER_USER                                                07580000
        ,DATE('0001-01-01')                                             07590000
        ,DATE('0001-01-01')                                             07600000
        ,B.ORDER_REF_NUMBER                                             07610000
     FROM RCBV0724_CCPF_INV  A                                          07630000
         ,RCBV0270_SW_IN_ORD B                                          07640000
    WHERE A.COUNTRY_NUMBER     = :WRK_CTRYNO                            07660000
      AND A.PRODUCT_TYPE_SW    ¬= ''                                    07670000
      AND A.ORIGIN_SW          = ''                                     07680000
      AND A.PRODUCT_TYPE_HW    ¬= ''                                    07690000
      AND A.PRODUCT_TYPE_HW    ¬= '9998'                                07700000
      AND A.PRODUCT_TYPE_HW    IS NOT NULL                              07710000
                                                                        07720000
      AND B.PRODUCT_TYPE_SW    = A.PRODUCT_TYPE_SW                      07730000
      AND B.MODEL_NUMBER_SW    = A.MODEL_NUMBER_SW                      07740000
      AND B.PRODUCT_TYPE_HW    = A.PRODUCT_TYPE_HW                      07750000
      AND B.ORIGIN_HW          = A.ORIGIN_HW                            07760000
      AND B.SEQUENCE_NUMBER_HW = A.SEQUENCE_NUMBER_HW                   07761002
      AND B.COUNTRY_NUMBER     = A.COUNTRY_NUMBER                       07770000
      AND :WRK_RUN_DATE        BETWEEN B.ORDER_DATE                     07780000
                                   AND B.END_DATE                       07790000
                                                                        07800000
   ORDER BY 1                                                           07810000
           ,2                                                           07820000
           ,3                                                           07830000
           ,4                                                           07840000
           ,5                                                           07850000
           ,6                                                           07860000
           ,7                                                           07870000
   FOR FETCH ONLY                                         /* RC01219 */ 07880000
           ;                                                            07890000
                                                                        07900000
1/********************************************************************/ 07910000
 /*                 S T A R T   P R O C E S S I N G                  */ 07920000
 /********************************************************************/ 07930000
                                                                        07940000
 CALL R900_INIT_PROGRAM;                                                07950000
                                                                        07960000
                                /*************************************/ 07970000
                                /* PROCESS CUSTOMERS                 */ 07980000
                                /*************************************/ 07990000
 CALL R800_INIT_CUSTOMER;                                               08000000
                                                                        08010000
 DO WHILE ( ¬ SWITCH_END_OF_CURSOR_CU);                                 08020000
        CALL R704_RETRIEVE_CUST_MOD;                       /* RA01117 */08030000
        CALL R705_RETRIEVE_CUST_ADDR;                      /* PTM0764 */08040000
        CALL R700_FILL_RCBDCB1_RECORD;                                  08050000
        CALL R702_WRITE_RCBDCB1_RECORD;                                 08060000
        CALL R709_FETCH_CURSOR_CU;                                      08070000
 END;                                                                   08080000
                                                                        08090000
 CALL R809_END_CUSTOMER;                                                08100000
                                                                        08110000
                                /*************************************/ 08120000
                                /* PROCESS INVENTORY                 */ 08130000
                                /*************************************/ 08140000
 CALL R810_INIT_INV;                                                    08150000
                                                                        08160000
                                          /* PROCESS ALL CHANGED INV */ 08170000
 DO WHILE ( ¬ SWITCH_END_OF_CURSOR_HW                                   08180000
          | ¬ SWITCH_END_OF_CURSOR_SW);                                 08190000
                                                                        08200000
                                                                        08210000
   SELECT;                                                              08220000
                                            /* PROCESS HW WITHOUT SW */ 08230000
     WHEN(SK_HW < SK_SW)                                                08240000
       DO;                                                              08250000
         CALL R610_INIT_PROCESS_HW;                                     08260000
         CALL R612_RETRIEVE_ADD_HW_INFO;                                08270000
         CALL R614_FILL_RCBDCB2_HW;                                     08280000
         CALL R615_CALL_UEX_HW;                                         08290000
         CALL R616_WRITE_RCBDCB2_RECORD;                                08300000
         CALL R619_FETCH_CURSOR_HW;                                     08310000
       END;                                                             08320000
                                            /* PROCESS SW WITHOUT HW */ 08330000
     WHEN(SK_HW > SK_SW)                                                08340000
       DO;                                                              08350000
         CALL R620_INIT_PROCESS_SW;                                     08360000
                                                                        08370000
         CALL R624_FILL_RCBDCB2_SW;                                     08380000
         CALL R625_CALL_UEX_SW;                                         08390000
         CALL R616_WRITE_RCBDCB2_RECORD;                                08400000
         CALL R629_FETCH_CURSOR_SW;                                     08410000
       END;                                                             08420000
                                            /* PROCESS HW WITH SW    */ 08430000
     OTHERWISE                                                          08440000
       DO;                                                              08450000
         CALL R630_INIT_PROCESS_BOTH;                                   08460000
                                                  /* PROCESS HW      */ 08470000
         CALL R612_RETRIEVE_ADD_HW_INFO;                                08480000
         CALL R614_FILL_RCBDCB2_HW;                                     08490000
         CALL R615_CALL_UEX_HW;                                         08500000
         CALL R616_WRITE_RCBDCB2_RECORD;                                08510000
                                          /* PROCESS ALL SW FOR HW   */ 08520000
         DO WHILE(SK_SW = SK_HW);                                       08530000
                                                    /* START RC01141 */ 08540000
           PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_SW_S);                08550000
                                                      /* END RC01141 */ 08560000
           CALL R624_FILL_RCBDCB2_SW;                                   08570000
           CALL R625_CALL_UEX_SW;                                       08580000
           CALL R616_WRITE_RCBDCB2_RECORD;                              08590000
           CALL R629_FETCH_CURSOR_SW;                                   08600000
         END;                                                           08610000
         CALL R619_FETCH_CURSOR_HW;                                     08620000
       END;                                                             08630000
   END;                                                                 08640000
                                                    /* START RC01141 */ 08650000
   CALL R820_DETERMINE_SEQUENCE_KEY;                                    08660000
                                                      /* END RC01141 */ 08670000
 END;                                                                   08680000
                                                                        08690000
 CALL R819_END_INV;                                                     08700000
                                                                        08710000
 CALL R999_END_PROGRAM;                                                 08720000
                                                                        08730000
1/********************************************************************/ 08740000
 /*                                                                  */ 08750000
 /* MODULE NAME      : R001_LOCK_TABLES                              */ 08760000
 /*                                                                  */ 08770000
 /* DESCRIPTION      :                                               */ 08780000
 /*                                                                  */ 08790000
 /********************************************************************/ 08800000
 R001_LOCK_TABLES: PROC;                                                08810000
                                                                        08820000
                                                                        08830000
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;            /* SOC RC01219 */ 08840000
                                                                        08850000
 /********************************************************************/ 08860000
                                                                        08870000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0010_CUSTOMER';                     08880000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08890000
                                                                        08900000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08910000
               PTR_RETURN_AREA_BB,                                      08920000
               PTR_INT_AREA);                                           08930000
                                                                        08940000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08950000
   WHEN (0);                                                            08960000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08970000
     DO;                                                                08980000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#001');                      08990000
     END;                                                               09000000
   OTHERWISE                                                            09010000
     DO;                                                                09020000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09030000
                                 'DB2',                                 09040000
                                 '#002');                               09050000
     END;                                                               09060000
 END;                                                                   09070000
                                                                        09080000
 /********************************************************************/ 09090000
                                                      /* SOC RB01290 */ 09100000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0030_CONTRACT';                     09110000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09120000
                                                                        09130000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09140000
               PTR_RETURN_AREA_BB,                                      09150000
               PTR_INT_AREA);                                           09160000
                                                                        09170000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09180000
   WHEN (0);                                                            09190000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09200000
     CALL RCBDCBM_ERROR (NULL, 'OTHER', '#056');                        09210000
   OTHERWISE                                                            09220000
     CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              09230000
                           'DB2','#057');                               09240000
 END;                                                                   09250000
                                                      /* EOC RB01290 */ 09260000
                                                                        09270000
 /********************************************************************/ 09280000
                                                                        09290000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0060_SW_PR';                        09300000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09310000
                                                                        09320000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09330000
               PTR_RETURN_AREA_BB,                                      09340000
               PTR_INT_AREA);                                           09350000
                                                                        09360000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09370000
   WHEN (0);                                                            09380000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09390000
     DO;                                                                09400000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#003');                      09410000
     END;                                                               09420000
   OTHERWISE                                                            09430000
     DO;                                                                09440000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09450000
                                 'DB2',                                 09460000
                                 '#004');                               09470000
     END;                                                               09480000
 END;                                                                   09490000
                                                                        09500000
 /********************************************************************/ 09510000
                                                                        09520000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0070_HW_PO';                        09530000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09540000
                                                                        09550000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09560000
               PTR_RETURN_AREA_BB,                                      09570000
               PTR_INT_AREA);                                           09580000
                                                                        09590000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09600000
   WHEN (0);                                                            09610000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09620000
     DO;                                                                09630000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#005');                      09640000
     END;                                                               09650000
   OTHERWISE                                                            09660000
     DO;                                                                09670000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09680000
                                 'DB2',                                 09690000
                                 '#006');                               09700000
     END;                                                               09710000
 END;                                                                   09720000
                                                                        09730000
 /********************************************************************/ 09740000
                                                      /* SOC RB01320 */ 09750000
                                                                        09760000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0125_DMMY_REAL';                    09770000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 09780000
                                                                        09790000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      09800000
               PTR_RETURN_AREA_BB,                                      09810000
               PTR_INT_AREA);                                           09820000
                                                                        09830000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    09840000
   WHEN (0);                                                            09850000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 09860000
     DO;                                                                09870000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#059');                      09880000
     END;                                                               09890000
   OTHERWISE                                                            09900000
     DO;                                                                09910000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            09920000
                                 'DB2',                                 09930000
                                 '#060');                               09940000
     END;                                                               09950000
 END;                                                                   09960000
                                                      /* EOC RB01320 */ 09970000
 /********************************************************************/ 09980000
                                                                        09990000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0150_CUST_ADDR';                    10000000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10010000
                                                                        10020000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10030000
               PTR_RETURN_AREA_BB,                                      10040000
               PTR_INT_AREA);                                           10050000
                                                                        10060000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10070000
   WHEN (0);                                                            10080000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10090000
     DO;                                                                10100000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#007');                      10110000
     END;                                                               10120000
   OTHERWISE                                                            10130000
     DO;                                                                10140000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10150000
                                 'DB2',                                 10160000
                                 '#008');                               10170000
     END;                                                               10180000
 END;                                                                   10190000
                                                                        10200000
 /********************************************************************/ 10210000
                                                                        10220000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0170_OU_HW';                        10230000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10240000
                                                                        10250000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10260000
               PTR_RETURN_AREA_BB,                                      10270000
               PTR_INT_AREA);                                           10280000
                                                                        10290000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10300000
   WHEN (0);                                                            10310000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10320000
     DO;                                                                10330000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#009');                      10340000
     END;                                                               10350000
   OTHERWISE                                                            10360000
     DO;                                                                10370000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10380000
                                 'DB2',                                 10390000
                                 '#010');                               10400000
     END;                                                               10410000
 END;                                                                   10420000
                                                                        10430000
 /********************************************************************/ 10440000
                                                                        10450000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0180_OU_SW';                        10460000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10470000
                                                                        10480000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10490000
               PTR_RETURN_AREA_BB,                                      10500000
               PTR_INT_AREA);                                           10510000
                                                                        10520000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10530000
   WHEN (0);                                                            10540000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10550000
     DO;                                                                10560000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#011');                      10570000
     END;                                                               10580000
   OTHERWISE                                                            10590000
     DO;                                                                10600000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10610000
                                 'DB2',                                 10620000
                                 '#012');                               10630000
     END;                                                               10640000
 END;                                                                   10650000
                                                                        10660000
 /********************************************************************/ 10670000
                                                                        10680000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      10690000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10700000
                                                                        10710000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10720000
               PTR_RETURN_AREA_BB,                                      10730000
               PTR_INT_AREA);                                           10740000
                                                                        10750000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10760000
   WHEN (0);                                                            10770000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 10780000
     DO;                                                                10790000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#013');                      10800000
     END;                                                               10810000
   OTHERWISE                                                            10820000
     DO;                                                                10830000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            10840000
                                 'DB2',                                 10850000
                                 '#014');                               10860000
     END;                                                               10870000
 END;                                                                   10880000
                                                                        10890000
 /********************************************************************/ 10900000
                                                                        10910000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0200_SW_CUST';                      10920000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 10930000
                                                                        10940000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      10950000
               PTR_RETURN_AREA_BB,                                      10960000
               PTR_INT_AREA);                                           10970000
                                                                        10980000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    10990000
   WHEN (0);                                                            11000000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11010000
     DO;                                                                11020000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#015');                      11030000
     END;                                                               11040000
   OTHERWISE                                                            11050000
     DO;                                                                11060000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11070000
                                 'DB2',                                 11080000
                                 '#016');                               11090000
     END;                                                               11100000
 END;                                                                   11110000
                                                                        11120000
 /********************************************************************/ 11130000
                                                                        11140000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0220_SUPPL_CTR';                    11150000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11160000
                                                                        11170000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11180000
               PTR_RETURN_AREA_BB,                                      11190000
               PTR_INT_AREA);                                           11200000
                                                                        11210000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11220000
   WHEN (0);                                                            11230000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11240000
     DO;                                                                11250000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#017');                      11260000
     END;                                                               11270000
   OTHERWISE                                                            11280000
     DO;                                                                11290000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11300000
                                 'DB2',                                 11310000
                                 '#018');                               11320000
     END;                                                               11330000
 END;                                                                   11340000
                                                                        11350000
 /********************************************************************/ 11360000
                                                                        11370000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0240_SERV_CTR';                     11380000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11390000
                                                                        11400000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11410000
               PTR_RETURN_AREA_BB,                                      11420000
               PTR_INT_AREA);                                           11430000
                                                                        11440000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11450000
   WHEN (0);                                                            11460000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11470000
     DO;                                                                11480000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#019');                      11490000
     END;                                                               11500000
   OTHERWISE                                                            11510000
     DO;                                                                11520000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11530000
                                 'DB2',                                 11540000
                                 '#020');                               11550000
     END;                                                               11560000
 END;                                                                   11570000
                                                                        11580000
 /********************************************************************/ 11590000
                                                                        11600000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0260_HW_IN_ORD';                    11610000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11620000
                                                                        11630000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11640000
               PTR_RETURN_AREA_BB,                                      11650000
               PTR_INT_AREA);                                           11660000
                                                                        11670000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11680000
   WHEN (0);                                                            11690000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11700000
     DO;                                                                11710000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#021');                      11720000
     END;                                                               11730000
   OTHERWISE                                                            11740000
     DO;                                                                11750000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11760000
                                 'DB2',                                 11770000
                                 '#022');                               11780000
     END;                                                               11790000
 END;                                                                   11800000
                                                                        11810000
 /********************************************************************/ 11820000
                                                                        11830000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0270_SW_IN_ORD';                    11840000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 11850000
                                                                        11860000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      11870000
               PTR_RETURN_AREA_BB,                                      11880000
               PTR_INT_AREA);                                           11890000
                                                                        11900000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    11910000
   WHEN (0);                                                            11920000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 11930000
     DO;                                                                11940000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#023');                      11950000
     END;                                                               11960000
   OTHERWISE                                                            11970000
     DO;                                                                11980000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            11990000
                                 'DB2',                                 12000000
                                 '#024');                               12010000
     END;                                                               12020000
 END;                                                                   12030000
                                                                        12040000
 /********************************************************************/ 12050000
                                                                        12060000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0300_HW_REAL';                      12070000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12080000
                                                                        12090000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12100000
               PTR_RETURN_AREA_BB,                                      12110000
               PTR_INT_AREA);                                           12120000
                                                                        12130000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12140000
   WHEN (0);                                                            12150000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12160000
     DO;                                                                12170000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#025');                      12180000
     END;                                                               12190000
   OTHERWISE                                                            12200000
     DO;                                                                12210000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12220000
                                 'DB2',                                 12230000
                                 '#026');                               12240000
     END;                                                               12250000
 END;                                                                   12260000
                                                                        12270000
 /********************************************************************/ 12280000
                                                                        12290000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0320_SW_ON_HW';                     12300000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12310000
                                                                        12320000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12330000
               PTR_RETURN_AREA_BB,                                      12340000
               PTR_INT_AREA);                                           12350000
                                                                        12360000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12370000
   WHEN (0);                                                            12380000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12390000
     DO;                                                                12400000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#027');                      12410000
     END;                                                               12420000
   OTHERWISE                                                            12430000
     DO;                                                                12440000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12450000
                                 'DB2',                                 12460000
                                 '#028');                               12470000
     END;                                                               12480000
 END;                                                                   12490000
                                                                        12500000
 /********************************************************************/ 12510000
                                                                        12520000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0350_CUST_MOD';                     12530000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12540000
                                                                        12550000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12560000
               PTR_RETURN_AREA_BB,                                      12570000
               PTR_INT_AREA);                                           12580000
                                                                        12590000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12600000
   WHEN (0);                                                            12610000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12620000
     DO;                                                                12630000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#029');                      12640000
     END;                                                               12650000
   OTHERWISE                                                            12660000
     DO;                                                                12670000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12680000
                                 'DB2',                                 12690000
                                 '#030');                               12700000
     END;                                                               12710000
 END;                                                                   12720000
                                                                        12730000
 /********************************************************************/ 12740000
                                                                        12750000
 PARM_RCB024M.VIEW_NAME      = 'RCBT0724_CCPF_INV';                     12760000
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 12770000
                                                                        12780000
 CALL RCB024M (ADDR(PARM_RCB024M),                                      12790000
               PTR_RETURN_AREA_BB,                                      12800000
               PTR_INT_AREA);                                           12810000
                                                                        12820000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    12830000
   WHEN (0);                                                            12840000
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 12850000
     DO;                                                                12860000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#031');                      12870000
     END;                                                               12880000
   OTHERWISE                                                            12890000
     DO;                                                                12900000
       CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            12910000
                                 'DB2',                                 12920000
                                 '#032');                               12930000
     END;                                                               12940000
 END;                                                 /* EOC RC01219 */ 12950000
                                                                        12960000
 END R001_LOCK_TABLES;                                                  12970000
                                                                        12980000
1/*********************************************************************/12990000
 /*                                                                   */13000000
 /* MODULE NAME      :  R012_TRANS_TPMNT                              */13010000
 /*                                                                   */13020000
 /* DESCRIPTION      :  TRANSLATE TOM/TOW TO MACHINE STATUS           */13030000
 /*                                                                   */13040000
 /*********************************************************************/13050000
 R012_TRANS_TPMNT: PROC (TYPE_OF_MAINT)                                 13060000
                         RETURNS(CHAR(01));                             13070000
                                                                        13080000
 DCL I                FIXED BIN(15);                      /* RB01298 */ 13090000
 DCL TYPE_OF_MAINT    CHAR (1);                                         13100000
 DCL MACHINE_CATEGORY CHAR (1);                                         13110000
                                                                        13120000
 SELECT;                                                                13130000
 WHEN (VERIFY(TYPE_OF_MAINT,WRK_TPMNT_VAL.TPMNT_ST1) = 0)               13140000
   DO;                                                                  13150000
     MACHINE_CATEGORY = '1';                                            13160000
   END;                                                                 13170000
 WHEN (VERIFY(TYPE_OF_MAINT,WRK_TPMNT_VAL.TPMNT_ST2) = 0)               13180000
   DO;                                                                  13190000
     MACHINE_CATEGORY = '2';                                            13200000
   END;                                                                 13210000
 WHEN (VERIFY(TYPE_OF_MAINT,WRK_TPMNT_VAL.TPMNT_ST3) = 0)               13220000
   DO;                                                                  13230000
     MACHINE_CATEGORY = '3';                                            13240000
   END;                                                                 13250000
 WHEN (VERIFY(TYPE_OF_MAINT,WRK_TPMNT_VAL.TPMNT_ST6) = 0)               13260000
   DO;                                                                  13270000
     MACHINE_CATEGORY = '6';                                            13280000
   END;                                                                 13290000
 WHEN (VERIFY(TYPE_OF_MAINT,WRK_TPMNT_VAL.TPMNT_ST9) = 0)               13300000
   DO;                                                                  13310000
     MACHINE_CATEGORY = '9';                                            13320000
   END;                                                                 13330000
 OTHERWISE;                                                             13340000
 END;                                                                   13350000
                                                    /* SOC : RB01281  */13360000
 IF FLEXIBLE_WARRANTY_BAU                                               13370000
 THEN                                                                   13380000
 DO;                                                                    13390000
  IF F_WARRANTY_MA_STATUS                                               13400000
   THEN                                                                 13410000
                                                      /* SOC RB01298 */ 13420000
 /*DO;                                                               */ 13430000
 /* IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,1,1)   */ 13440000
 /* THEN                                                             */ 13450000
 /*   DO;                                                            */ 13460000
 /*   MACHINE_CATEGORY = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,2,1);*/ 13470000
 /*   END;                                                           */ 13480000
 /* ELSE                                                             */ 13490000
 /*   DO;                                                            */ 13500000
 /*    IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,1,1)*/ 13510000
 /*    THEN                                                          */ 13520000
 /*    DO;                                                           */ 13530000
 /*    MACHINE_CATEGORY = SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,2,1)*/ 13540000
 /*    END;                                                          */ 13550000
 /*   END;                                                           */ 13560000
                                                                        13570000
    DO I = 1 TO PARM_RCBP71S.NUMBER_OF_TPMNT;                           13580000
      IF TYPE_OF_MAINT = PARM_RCBP71S.TPMNT_TABLE.TYPE_MNT(I)           13590000
      THEN                                                              13600000
        DO;                                                             13610000
          MACHINE_CATEGORY = PARM_RCBP71S.TPMNT_TABLE.MA_ST(I);         13620000
          I = 999;                                                      13630000
        END;                                                            13640000
    END;                                                                13650000
  ELSE                                                                  13660000
    DO I = 1 TO PARM_RCBP67S.NUMBER_OF_TPMNT;                           13670000
      IF TYPE_OF_MAINT = PARM_RCBP67S.TPMNT_TABLE.TYPE_MNT(I)           13680000
      THEN                                                              13690000
        DO;                                                             13700000
          MACHINE_CATEGORY = PARM_RCBP67S.TPMNT_TABLE.MA_ST(I);         13710000
          I = 999;                                                      13720000
        END;                                                            13730000
    END;                                                                13740000
                                                      /* EOC RB01298 */ 13750000
 END;                                                                   13760000
                                                    /* EOC : RB01281 */ 13770000
 RETURN(MACHINE_CATEGORY);                                              13780000
                                                                        13790000
 END R012_TRANS_TPMNT;                                                  13800000
1/********************************************************************/ 13810000
 /*                                                                  */ 13820000
 /* MODULE NAME      : R013_TRANS_DATE                               */ 13830000
 /*                                                                  */ 13840000
 /* DESCRIPTION      : TRANSLATE DB2 DATE FORMAT TO EXTRACT FILE     */ 13850000
 /*                    DATE FORMAT WITH RESPECT FOR OPEN END DATES   */ 13860000
 /*                                                                  */ 13870000
 /********************************************************************/ 13880000
 R013_TRANS_DATE: PROC (DB2_DATE_IN)                                    13890000
                       RETURNS (CHAR(06));                              13900000
                              /* DECLARE VARIABLES                   */ 13910000
 DCL DB2_DATE_IN         CHAR(10);                                      13920000
                                                                        13930000
 IF DB2_DATE_IN = WRK_OPEN_DATE_CH10                                    13940000
   THEN RETURN(WRK_OPEN_DATE_CH6);                                      13950000
   ELSE RETURN(TRANSLATE('YRMNDA',DB2_DATE_IN ,'CEYR-MN-DA'));          13960000
                                                                        13970000
                                                                        13980000
 END R013_TRANS_DATE;                                                   13990000
1/********************************************************************/ 14000000
 /*                                                                  */ 14010000
 /* MODULE NAME      : R020_PLANCODE_1                               */ 14020000
 /*                                                                  */ 14030000
 /* DESCRIPTION      : DETERMINE STARTTIME AND PLANCODE FOR          */ 14040000
 /*                    WEEKDAYS                                      */ 14050000
 /*                                                                  */ 14060000
 /********************************************************************/ 14070000
 R020_PLANCODE_1:     PROC (COVERAGE_START,                             14080000
                            COVERAGE_END,                               14090000
                            START_TIME,                                 14100000
                            PLAN_CODE);                                 14110000
                                                                        14120000
 DCL COVERAGE_START  CHAR(8);                                           14130000
 DCL COVERAGE_END    CHAR(8);                                           14140000
 DCL START_TIME      CHAR(3);                                           14150000
 DCL PLAN_CODE       CHAR(1);                                           14160000
                                                                        14170000
 DCL 1 WRK_COV_START BASED (ADDR(COVERAGE_START)),                      14180000
       3 HOURS       PIC '99',                                          14190000
       3 FILLER_G1   CHAR (1),                                          14200000
       3 MINUTES     PIC '99',                                          14210000
       3 FILLER_G2   CHAR (3);                                          14220000
                                                                        14230000
 DCL 1 WRK_COV_END   BASED (ADDR(COVERAGE_END)),                        14240000
       3 HOURS       PIC '99',                                          14250000
       3 FILLER_G1   CHAR (1),                                          14260000
       3 MINUTES     PIC '99',                                          14270000
       3 FILLER_G2   CHAR (3);                                          14280000
                                                                        14290000
 DCL WRK_HOURS_DELTA FIXED BIN (31);                                    14300000
                                                                        14310000
 START_TIME = '';                                                       14320000
 PLAN_CODE  = '';                                                       14330000
                                                                        14340000
     START_TIME = SUBSTR (COVERAGE_START,1,2) ||                        14350000
                  SUBSTR (COVERAGE_START,4,1) ;                         14360000
                                                                        14370000
                                    /* START PTM 434 */                 14380000
                                                                        14390000
 IF (SUBSTR(COVERAGE_START,1,2) || SUBSTR(COVERAGE_START,4,2) = '0000') 14400000
    &                                                                   14410000
    (SUBSTR(COVERAGE_END,1,2) || SUBSTR(COVERAGE_END,4,2) = '0000')     14420000
 THEN                                                                   14430000
   DO;                                                                  14440000
     PLAN_CODE  = ' ';              /* NO COVERAGE AT ALL */            14450000
     START_TIME = ' ';              /* NO COVERAGE AT ALL */            14460000
   END;                                                                 14470000
 ELSE                               /* END PTM 434 */                   14480000
   DO;                                                                  14490000
     IF COVERAGE_START ¬= '' |                                          14500000
        COVERAGE_END   ¬= ''                                            14510000
     THEN                                                               14520000
       DO;                                                              14530000
                                                                        14540000
         IF COVERAGE_START >= COVERAGE_END            /* SOC PTM1271 */ 14550000
         THEN DO;                                                       14560000
           WRK_HOURS_DELTA = (24 + WRK_COV_END.HOURS)                   14570000
                             - WRK_COV_START.HOURS;                     14580000
         END;                                                           14590000
         ELSE DO;                                                       14600000
           WRK_HOURS_DELTA = WRK_COV_END.HOURS - WRK_COV_START.HOURS;   14610000
         END;                                         /* EOC PTM1271 */ 14620000
                                                                        14630000
         IF WRK_COV_START.MINUTES > WRK_COV_END.MINUTES                 14640000
         THEN                                                           14650000
           DO;                                                          14660000
             WRK_HOURS_DELTA = WRK_HOURS_DELTA - 1;                     14670000
           END;                                                         14680000
                                                                        14690000
         SELECT;                                                        14700000
           WHEN (0 <= WRK_HOURS_DELTA &                                 14710000
                      WRK_HOURS_DELTA < 7)                              14720000
             DO;                                                        14730000
               PLAN_CODE = '1';                                         14740000
             END;                                                       14750000
           WHEN (7 <= WRK_HOURS_DELTA &                                 14760000
                      WRK_HOURS_DELTA < 10)                             14770000
             DO;                                                        14780000
               PLAN_CODE = '0';                                         14790000
             END;                                                       14800000
           WHEN (10 <= WRK_HOURS_DELTA &                                14810000
                       WRK_HOURS_DELTA < 14)                            14820000
             DO;                                                        14830000
               PLAN_CODE = '2';                                         14840000
             END;                                                       14850000
           WHEN (14 <= WRK_HOURS_DELTA &                                14860000
                       WRK_HOURS_DELTA < 19)                            14870000
             DO;                                                        14880000
               PLAN_CODE = '3';                                         14890000
             END;                                                       14900000
           WHEN (19 <= WRK_HOURS_DELTA &                                14910000
                       WRK_HOURS_DELTA < 22)                            14920000
             DO;                                                        14930000
               PLAN_CODE = '4';                                         14940000
             END;                                                       14950000
           OTHERWISE                                                    14960000
             DO;                                                        14970000
               PLAN_CODE = '5';                                         14980000
             END;                                                       14990000
         END;                                                           15000000
       END;                                                             15010000
   END;                                                                 15020000
                                                                        15030000
 END R020_PLANCODE_1;                                                   15040000
1/********************************************************************/ 15050000
 /*                                                                  */ 15060000
 /* MODULE NAME      : R021_PLANCODE_2                               */ 15070000
 /*                                                                  */ 15080000
 /* DESCRIPTION      : DETERMINE STARTTIME AND PLANCODE FOR          */ 15090000
 /*                    WEEKEND-DAYS                                  */ 15100000
 /*                                                                  */ 15110000
 /********************************************************************/ 15120000
 R021_PLANCODE_2:     PROC (COVERAGE_START,                             15130000
                            COVERAGE_END,                               15140000
                            START_TIME,                                 15150000
                            PLAN_CODE);                                 15160000
                                                                        15170000
 DCL COVERAGE_START  CHAR(8);                                           15180000
 DCL COVERAGE_END    CHAR(8);                                           15190000
 DCL START_TIME      CHAR(3);                                           15200000
 DCL PLAN_CODE       CHAR(1);                                           15210000
                                                                        15220000
 DCL 1 WRK_COV_START BASED (ADDR(COVERAGE_START)),                      15230000
       3 HOURS       PIC '99',                                          15240000
       3 FILLER_G1   CHAR (1),                                          15250000
       3 MINUTES     PIC '99',                                          15260000
       3 FILLER_G2   CHAR (3);                                          15270000
                                                                        15280000
 DCL 1 WRK_COV_END   BASED (ADDR(COVERAGE_END)),                        15290000
       3 HOURS       PIC '99',                                          15300000
       3 FILLER_G1   CHAR (1),                                          15310000
       3 MINUTES     PIC '99',                                          15320000
       3 FILLER_G2   CHAR (3);                                          15330000
                                                                        15340000
 DCL WRK_HOURS_DELTA FIXED BIN (31);                                    15350000
                                                                        15360000
 START_TIME = '';                                                       15370000
 PLAN_CODE  = '';                                                       15380000
                                                                        15390000
 START_TIME = SUBSTR (COVERAGE_START,1,2) ||                            15400000
              SUBSTR (COVERAGE_START,4,1) ;                             15410000
                                                                        15420000
                                    /* START PTM 434 */                 15430000
                                                                        15440000
 IF (SUBSTR(COVERAGE_START,1,2) || SUBSTR(COVERAGE_START,4,2) = '0000') 15450000
    &                                                                   15460000
    (SUBSTR(COVERAGE_END,1,2) || SUBSTR(COVERAGE_END,4,2) = '0000')     15470000
 THEN                                                                   15480000
   DO;                                                                  15490000
     PLAN_CODE  = ' ';              /* NO COVERAGE AT ALL */            15500000
     START_TIME = ' ';              /* NO COVERAGE AT ALL */            15510000
   END;                                                                 15520000
 ELSE                               /* END PTM 434 */                   15530000
   DO;                                                                  15540000
     IF COVERAGE_START ¬= '' |                                          15550000
        COVERAGE_END   ¬= ''                                            15560000
     THEN                                                               15570000
       DO;                                                              15580000
                                                                        15590000
         IF COVERAGE_START >= COVERAGE_END            /* SOC PTM1271 */ 15600000
         THEN DO;                                                       15610000
           WRK_HOURS_DELTA = (24 + WRK_COV_END.HOURS)                   15620000
                             - WRK_COV_START.HOURS;                     15630000
         END;                                                           15640000
         ELSE DO;                                                       15650000
           WRK_HOURS_DELTA = WRK_COV_END.HOURS - WRK_COV_START.HOURS;   15660000
         END;                                         /* EOC PTM1271 */ 15670000
                                                                        15680000
         IF WRK_COV_START.MINUTES > WRK_COV_END.MINUTES                 15690000
         THEN                                                           15700000
           DO;                                                          15710000
             WRK_HOURS_DELTA = WRK_HOURS_DELTA - 1;                     15720000
           END;                                                         15730000
                                                                        15740000
         SELECT;                                                        15750000
           WHEN (0 <= WRK_HOURS_DELTA &                                 15760000
                      WRK_HOURS_DELTA < 10)                             15770000
             DO;                                                        15780000
               PLAN_CODE = '1';                                         15790000
             END;                                                       15800000
           WHEN (10 <= WRK_HOURS_DELTA &                                15810000
                       WRK_HOURS_DELTA < 14)                            15820000
             DO;                                                        15830000
               PLAN_CODE = '2';                                         15840000
             END;                                                       15850000
           WHEN (14 <= WRK_HOURS_DELTA &                                15860000
                       WRK_HOURS_DELTA < 19)                            15870000
             DO;                                                        15880000
               PLAN_CODE = '3';                                         15890000
             END;                                                       15900000
           WHEN (19 <= WRK_HOURS_DELTA &                                15910000
                       WRK_HOURS_DELTA < 22)                            15920000
             DO;                                                        15930000
               PLAN_CODE = '4';                                         15940000
             END;                                                       15950000
           OTHERWISE                                                    15960000
             DO;                                                        15970000
               PLAN_CODE = '5';                                         15980000
             END;                                                       15990000
           END;                                                         16000000
       END;                                                             16010000
   END;                                                                 16020000
                                                                        16030000
 END R021_PLANCODE_2;                                                   16040000
1/*********************************************************************/16050000
 /*                                                                   */16060000
 /* MODULE NAME      :  R610_INIT_PROCESS_HW                          */16070000
 /*                                                                   */16080000
 /* DESCRIPTION      :                                                */16090000
 /*                                                                   */16100000
 /*********************************************************************/16110000
 R610_INIT_PROCESS_HW: PROC;                                            16120000
                                                                        16130000
                    /* CURRENT HW + CUSTOMER IS FROM HW OCCURENCE    */ 16140000
 WRK_CURR_HW.PRODUCT_TYPE    = CURSOR_HW_V724.PRODUCT_TYPE_HW;          16150000
 WRK_CURR_HW.ORIGIN          = CURSOR_HW_V724.ORIGIN_HW;                16160000
 WRK_CURR_HW.SEQUENCE_NUMBER = CURSOR_HW_V724.SEQUENCE_NUMBER_HW;       16170000
 WRK_CURR_HW.CUSTOMER_NUMBER = CURSOR_HW_V190.CUSTOMER_NUMBER;          16180000
                                                                        16190000
 END R610_INIT_PROCESS_HW;                                              16200000
                                                                        16210000
1/*********************************************************************/16220000
 /*                                                                   */16230000
 /* MODULE NAME      :  R611_CHECK_TYPE_OF_CONTRACT           RB01290 */16240000
 /*                                                                   */16250000
 /* DESCRIPTION      :  RETRIEVE TYPE_OF_CONTRACT FROM T0030 BASED ON */16260000
 /*                     T0240 CONTRACT NUMBER                         */16270000
 /*                                                                   */16280000
 /*********************************************************************/16290000
 R611_CHECK_TYPE_OF_CONTRACT: PROC;                                     16300000
                                                                        16310000
 TB_RCBV030 = '';                                                       16320000
 TB_RCBV240 = '';                                                       16330000
                                                                        16340000
 WRK_CONTRACT_NUMBER_INDNULL  = 0;                                      16350000
 WRK_TYPE_OF_CONTRACT_INDNULL = 0;                                      16360000
 IF WRK_REAL_INDNULL = -1 THEN                         /* SOC RB01320 */16361004
 DO;                                                                    16362004
    WRK_ORIGIN  = CURSOR_HW_V724.ORIGIN_HW;                             16362104
    WRK_SEQ_NO  = CURSOR_HW_V724.SEQUENCE_NUMBER_HW;                    16362204
 END;                                                                   16363004
 ELSE                                                                   16364004
 DO;                                                                    16365004
    WRK_ORIGIN  = SUBSTR(WRK_REAL_SERIAL_NUM,1,2);                      16365104
    WRK_SEQ_NO  = SUBSTR(WRK_REAL_SERIAL_NUM,3);                        16365204
 END;                                                  /* EOC RB01320 */16366004
                                                                        16370000
 EXEC SQL                                                               16380000
   SELECT CONTRACT_NUMBER                                               16390000
     INTO :TB_RCBV240.CONTRACT_NUMBER  :WRK_CONTRACT_NUMBER_INDNULL     16400000
     FROM RCBV0240_SERV_CTR                                             16410004
    WHERE PRODUCT_TYPE     = :CURSOR_HW_V724.PRODUCT_TYPE_HW            16440004
                                                      /* SOC RB01320 */ 16441004
   /* AND ORIGIN           = :CURSOR_HW_V724.ORIGIN_HW                  16450004
      AND SEQUENCE_NUMBER  = :CURSOR_HW_V724.SEQUENCE_NUMBER_HW */      16460004
      AND ORIGIN           = :WRK_ORIGIN                                16461004
      AND SEQUENCE_NUMBER  = :WRK_SEQ_NO              /* EOC RB01320 */ 16462004
      AND COUNTRY_NUMBER   = :WRK_CTRYNO                                16470000
      AND :WRK_RUN_DATE    BETWEEN EFFECTIVE_DATE                       16480000
                               AND END_DATE                             16490004
   ;                                                                    16610000
                                                                        16620000
 SELECT (SQLCODE);                                                      16630000
   WHEN (0)                                                             16640000
   DO;                                                                  16650000
      IF WRK_CONTRACT_NUMBER_INDNULL ¬= -1                              16660000
      & TB_RCBV240.CONTRACT_NUMBER ¬= ''                                16670000
      THEN                                                              16680000
        DO;                                                             16690000
           EXEC SQL                                                     16700000
             SELECT TYPE_OF_CONTRACT                                    16710000
               INTO :TB_RCBV030.TYPE_OF_CONTRACT                        16720000
                                        :WRK_TYPE_OF_CONTRACT_INDNULL   16730000
               FROM RCBV0030_CONTRACT                                   16740000
              WHERE COUNTRY_NUMBER      = :WRK_CTRYNO                   16750000
                AND CONTRACT_NUMBER     = :TB_RCBV240.CONTRACT_NUMBER   16760000
             ;                                                          16770000
                                                                        16780000
           SELECT (SQLCODE);                                            16790000
             WHEN (0)                                                   16800000
             DO;                                                        16810000
               IF WRK_TYPE_OF_CONTRACT_INDNULL ¬= -1                    16820000
               & TB_RCBV030.TYPE_OF_CONTRACT ¬= ''                      16830000
               THEN CALL R613_FETCH_TOC_TOM_MS_RCB070;                  16840000
             END;                                                       16850000
                                                                        16860000
             WHEN (100);                                                16870000
             OTHERWISE                                                  16880000
               DO;                                                      16890000
                  CALL RCBDCBM_ERROR (ADDR (SQLCA),                     16900000
                                      'DB2',                            16910000
                                      '#053');                          16920000
               END;                                                     16930000
           END;                                                         16940000
        END;                                                            16950000
   END;                                                                 16960000
   OTHERWISE                                                            16970000
     DO;                                                                16980000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               16990000
                            'DB2',                                      17000000
                            '#054');                                    17010000
     END;                                                               17020000
 END;                                                                   17030000
                                                                        17040000
 END R611_CHECK_TYPE_OF_CONTRACT;                                       17050000
                                                                        17060000
1/*********************************************************************/17070000
 /*                                                                   */17080000
 /* MODULE NAME      :  R612_RETRIEVE_ADD_HW_INFO                     */17090000
 /*                                                                   */17100000
 /* DESCRIPTION      :                                                */17110000
 /*                                                                   */17120000
 /*********************************************************************/17130000
 R612_RETRIEVE_ADD_HW_INFO: PROC;                                       17140000
                                                                        17150000
                          /* RETRIEVE SERVICE CONTRACT IF APPLICABLE */ 17160000
 TB_RCBV240 = '';                                                       17170000
                                                                        17180000
 IF WRK_REAL_INDNULL = -1 THEN                        /* SOC RB01320 */ 17181004
 DO;                                                                    17182004
    WRK_ORIGIN  = CURSOR_HW_V724.ORIGIN_HW;                             17183004
    WRK_SEQ_NO  = CURSOR_HW_V724.SEQUENCE_NUMBER_HW;                    17184004
 END;                                                                   17185004
 ELSE                                                                   17186004
 DO;                                                                    17187004
    WRK_ORIGIN  = SUBSTR(WRK_REAL_SERIAL_NUM,1,2);                      17188004
    WRK_SEQ_NO  = SUBSTR(WRK_REAL_SERIAL_NUM,3);                        17189004
 END;                                                  /* EOC RB01320 */17189104
 IF CURSOR_HW_V220.TYPE_OF_MAINT = WRK_TPMNT_VAL.TPMNT_ST2_DEF          17190000
  | SWITCH_ACTIVE_CTR = TRUE                              /* RB01290 */ 17200000
                                                                        17210000
 THEN                                                                   17220000
   DO;                                                                  17230000
     EXEC SQL                                                           17240000
       SELECT                                                           17250000
            COVERAGE_START_1                                            17260000
           ,COVERAGE_END_1                                              17270000
           ,COVERAGE_START_6                                            17280000
           ,COVERAGE_END_6                                              17290000
           ,COVERAGE_START_7                                            17300000
           ,COVERAGE_END_7                                              17310000
         INTO                                                           17320000
           :TB_RCBV240.COVERAGE_START_1   :WRK_INDNULL                  17330000
          ,:TB_RCBV240.COVERAGE_END_1     :WRK_INDNULL                  17340000
          ,:TB_RCBV240.COVERAGE_START_6   :WRK_INDNULL                  17350000
          ,:TB_RCBV240.COVERAGE_END_6     :WRK_INDNULL                  17360000
          ,:TB_RCBV240.COVERAGE_START_7   :WRK_INDNULL                  17370000
          ,:TB_RCBV240.COVERAGE_END_7     :WRK_INDNULL                  17380000
         FROM RCBV0240_SERV_CTR                                         17390004
        WHERE PRODUCT_TYPE     = :CURSOR_HW_V724.PRODUCT_TYPE_HW        17420004
                                                       /* SOC RB01320 */17421004
      /* AND ORIGIN           = :CURSOR_HW_V724.ORIGIN_HW               17430004
         AND SEQUENCE_NUMBER  = :CURSOR_HW_V724.SEQUENCE_NUMBER_HW */   17440004
         AND ORIGIN           = :WRK_ORIGIN                             17441004
         AND SEQUENCE_NUMBER  = :WRK_SEQ_NO            /* EOC RB01320 */17442004
          AND COUNTRY_NUMBER   = :WRK_CTRYNO                            17450004
          AND :WRK_RUN_DATE    BETWEEN EFFECTIVE_DATE                   17460004
                                   AND END_DATE                         17470004
         ;                                                              17590000
     SELECT (SQLCODE);                                                  17600000
       WHEN (0);                                                        17610000
       OTHERWISE                                                        17620000
         DO;                                                            17630000
            CALL RCBDCBM_ERROR (ADDR (SQLCA),                           17640000
                                'DB2',                                  17650000
                                '#033');                                17660000
         END;                                                           17670000
     END;                                                               17680000
   END;                                                                 17690000
                                                                        17700000
 END R612_RETRIEVE_ADD_HW_INFO;                                         17710000
1/*********************************************************************/17720000
 /*                                                                   */17730000
 /* MODULE NAME      :  R613_FETCH_TOC_TOM_MS_RCB070          RB01290 */17740000
 /*                                                                   */17750000
 /* DESCRIPTION      :  RETRIEVE RCB070 PARAMETER VALUES BASED ON     */17760000
 /*                     T0030 TYPE_OF_CONTRACT                        */17770000
 /*********************************************************************/17780000
 R613_FETCH_TOC_TOM_MS_RCB070: PROC;                                    17790000
                                                                        17800000
 TB_RCBV500                   = '';                                     17810000
 TB_RCBV500_I                 = '';                                     17820000
 TB_RCBP70S.NUMBER            = 'RCB070';                               17830000
 TB_RCBP70S.CTRYNO            = WRK_CTRYNO;                             17840000
 TB_RCBP70S.TYPE_OF_CONTRACT  = TB_RCBV030.TYPE_OF_CONTRACT;            17850000
                                                                        17860000
 CALL RCBI50M ('U',                                                     17870000
               ADDR (TB_RCBV500),                                       17880000
               ADDR (TB_RCBV500_I),                                     17890000
               PTR_RETURN_AREA_BB,                                      17900000
               PTR_INT_AREA);                                           17910000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   17920000
   WHEN (0)                                                             17930000
   DO;                                                                  17940000
      PARM_RCBP70S = TB_RCBP70S, BY NAME;                               17950000
                                                                        17960000
      SWITCH_INTERNAL_CTR          = TRUE;                              17970000
      CURSOR_HW_V220.TYPE_OF_MAINT = PARM_RCBP70S.TOM_INTERNAL_CONTRACT;17980000
   END;                                                                 17990000
                                                                        18000000
   WHEN (4);                                      /* NO RECORD FOUND */ 18010000
   OTHERWISE                                                            18020000
     DO;                                                                18030000
        CALL RCBDCBM_ERROR (ADDR(RETURN_AREA_BB.RETURN_SQL),            18040000
                            'DB2',                                      18050000
                            '#055');                                    18060000
     END;                                                               18070000
 END;                                                                   18080000
                                                                        18090000
 END R613_FETCH_TOC_TOM_MS_RCB070;                                      18100000
1/*********************************************************************/18110000
 /*                                                                   */18120000
 /* MODULE NAME      :  R614_FILL_RCBDCB2_HW                          */18130000
 /*                                                                   */18140000
 /* DESCRIPTION      :                                                */18150000
 /*                                                                   */18160000
 /*********************************************************************/18170000
 R614_FILL_RCBDCB2_HW: PROC;                                            18180000
                                                                        18190000
 FILE_RCBDCB2 = '';                                                     18200000
 FILE_RCBDCB2_HW.ICUSCNO = SUBSTR(CURSOR_HW_V190.CUSTOMER_NUMBER,2,7);  18210000
 FILE_RCBDCB2_HW.CDBSRTC = '2';                                         18220000
 FILE_RCBDCB2_HW.CSLMTYP = CURSOR_HW_V724.PRODUCT_TYPE_HW;              18230000
 FILE_RCBDCB2_HW.IOLCPLM = CURSOR_HW_V724.ORIGIN_HW;                    18240000
 FILE_RCBDCB2_HW.IHSINBR =                                              18250000
                          SUBSTR(CURSOR_HW_V724.SEQUENCE_NUMBER_HW,3,5);18260000
 FILE_RCBDCB2_HW.CDBSPRD = '1';                                         18270000
 FILE_RCBDCB2_HW.CSLMMOD = CURSOR_HW_V300.MODEL_NUMBER;                 18280000
 FILE_RCBDCB2_HW.FHSIRPD = '0';                                         18290000
                                                                        18300000
 SELECT;                                                                18310000
   WHEN (CURSOR_HW_V220.TYPE_OF_MAINT ¬= '')                            18320000
     DO;                                                                18330000
       WRK_TYPE_OF_MAINT = CURSOR_HW_V220.TYPE_OF_MAINT;                18340000
     END;                                                               18350000
   WHEN (CURSOR_HW_V220.TYPE_OF_WARRANTY ¬= '')                         18360000
     DO;                                                   /* RC01116 */18370000
                                                      /* SOC RB01298 */ 18380000
 /*    WRK_TYPE_OF_MAINT = CURSOR_HW_V220.TYPE_OF_WARRANTY;          */ 18390000
 /*                                                   /* SOC RB01281 */ 18400000
 /*    IF (CURSOR_HW_V220.F_TYPE_OF_WARRANTY ¬= '' &                 */ 18410000
 /*        CURSOR_HW_V220.F_SPLT_DATE ¬= '' &                        */ 18420000
 /*        WRK_RUN_DATE >  CURSOR_HW_V220.F_SPLT_DATE &              */ 18430000
 /*        WRK_RUN_DATE <= CURSOR_HW_V220.WARRANTY_EXP_DATE)         */ 18440000
                                                                        18450000
       IF FLEXIBLE_WARRANTY_BAU                                         18460000
                                                      /* EOC RB01298 */ 18470000
       THEN                                                             18480000
           WRK_TYPE_OF_MAINT = CURSOR_HW_V220.F_TYPE_OF_WARRANTY;       18490000
       ELSE                                                             18500000
         DO;                                                            18510000
           WRK_TYPE_OF_MAINT = CURSOR_HW_V220.TYPE_OF_WARRANTY;         18520000
         END;                                                           18530000
                                                        /*EOC RB01281*/ 18540000
       FILE_RCBDCB2_HW.FHSIMOW = 'Y';                                   18550000
     END;                                                               18560000
   OTHERWISE;                                                           18570000
 END;                                                                   18580000
                                                      /* SOC RB01290 */ 18590000
 /* WRITE MACHINE STATUS FROM RCB070 FOR INTERNAL CONTRACT MACHINES */  18600000
                                                                        18610000
 IF SWITCH_INTERNAL_CTR                                                 18620000
 THEN                                                                   18630000
 FILE_RCBDCB2_HW.CHSICMS = PARM_RCBP70S.MACHINE_STATUS;                 18640000
                                                                        18650000
 ELSE                                                 /* EOC RB01290 */ 18660000
 FILE_RCBDCB2_HW.CHSICMS = R012_TRANS_TPMNT(WRK_TYPE_OF_MAINT);         18670000
                                                                        18680000
 FILE_RCBDCB2_HW.CODPDIV = '02';                                        18690000
                                                                        18700000
 IF FILE_RCBDCB2_HW.CHSICMS = '1'                                       18710000
 THEN                                                                   18720000
   DO;                                                                  18730000
     FILE_RCBDCB2_HW.CAGRWKY = '5';                                     18740000
     FILE_RCBDCB2_HW.CAGRSDY = '5';                                     18750000
     FILE_RCBDCB2_HW.CAGRSUY = '5';                                     18760000
   END;                                                                 18770000
 ELSE                                                                   18780000
   DO;                                                                  18790000
                                                                        18800000
     IF FILE_RCBDCB2_HW.CHSICMS = '2'                                   18810000
      | SWITCH_ACTIVE_CTR = TRUE                          /* RB01290 */ 18820000
                                                                        18830000
     THEN                                                               18840000
       DO;                                                              18850000
         CALL R020_PLANCODE_1 (TB_RCBV240.COVERAGE_START_1,             18860000
                               TB_RCBV240.COVERAGE_END_1,               18870000
                               FILE_RCBDCB2_HW.DAGRFWD,                 18880000
                               FILE_RCBDCB2_HW.CAGRWKY);                18890000
         CALL R021_PLANCODE_2 (TB_RCBV240.COVERAGE_START_6,             18900000
                               TB_RCBV240.COVERAGE_END_6,               18910000
                               FILE_RCBDCB2_HW.DAGRFAS,                 18920000
                               FILE_RCBDCB2_HW.CAGRSDY);                18930000
         CALL R021_PLANCODE_2 (TB_RCBV240.COVERAGE_START_7,             18940000
                               TB_RCBV240.COVERAGE_END_7,               18950000
                               FILE_RCBDCB2_HW.DAGRFUS,                 18960000
                               FILE_RCBDCB2_HW.CAGRSUY);                18970000
      END;                                                              18980000
   END;                                                                 18990000
                                                                        19000000
 IF SUBSTR(FILE_RCBDCB2_HW.ICUSCNO,2,2) = '99'                          19010000
 THEN                                                                   19020000
   DO;                                                                  19030000
     IF FILE_RCBDCB2_HW.CHSICMS = ''                                    19040000
     THEN                                                               19050000
       DO;                                                              19060000
         FILE_RCBDCB2_HW.CHSICMS = '6';                                 19070000
       END;                                                             19080000
     FILE_RCBDCB2_HW.FCUSINT = '1';                                     19090000
   END;                                                                 19100000
                                                                        19110000
 IF CURSOR_HW_V190.MARKETING_INSTDAT ¬= ''                              19120000
 THEN                                                                   19130000
   DO;                                                                  19140000
     FILE_RCBDCB2_HW.DHSIINS =                                          19150000
                R013_TRANS_DATE (CURSOR_HW_V190.MARKETING_INSTDAT);     19160000
   END;                                                                 19170000
                                                                        19180000
                          /* FILL EXTRA INFO, NEEDED FOR COMPARE     */ 19190000
                          /* PROCESS                                 */ 19200000
 FILE_RCBDCB2_HW.EXTRA_INFO.CUSTOMER_NUMBER    =                        19210000
                          CURSOR_HW_V190.CUSTOMER_NUMBER;               19220000
 FILE_RCBDCB2_HW.EXTRA_INFO.PRODUCT_TYPE_HW    =                        19230000
                          CURSOR_HW_V724.PRODUCT_TYPE_HW;               19240000
 FILE_RCBDCB2_HW.EXTRA_INFO.ORIGIN_HW          =                        19250000
                          CURSOR_HW_V724.ORIGIN_HW;                     19260000
 FILE_RCBDCB2_HW.EXTRA_INFO.SEQUENCE_NUMBER_HW =                        19270000
                          CURSOR_HW_V724.SEQUENCE_NUMBER_HW;            19280000
 FILE_RCBDCB2_HW.EXTRA_INFO.OU_CODE            =                        19290000
                          CURSOR_HW_V170.OU_CODE;                       19300000
 FILE_RCBDCB2_HW.EXTRA_INFO.RETAIN_FLAG        =                        19310000
                          CURSOR_HW_V070.RETAIN_FLAG;                   19320000
                                                                        19330000
 END R614_FILL_RCBDCB2_HW;                                              19340000
                                                                        19350000
1/*********************************************************************/19360000
 /*                                                                   */19370000
 /* MODULE NAME      :  R615_CALL_UEX_HW                              */19380000
 /*                                                                   */19390000
 /* DESCRIPTION      :                                                */19400000
 /*                                                                   */19410000
 /*********************************************************************/19420000
 R615_CALL_UEX_HW: PROC;                                                19430000
                                                                        19440000
 IF SWITCH_HW_EXIT = TRUE                                               19450000
 THEN                                                                   19460000
   DO;                                                                  19470000
     USER_INFO_HW.PRODUCT_TYPE_HW    = CURSOR_HW_V724.PRODUCT_TYPE_HW;  19480000
     USER_INFO_HW.ORIGIN_HW          = CURSOR_HW_V724.ORIGIN_HW;        19490000
     USER_INFO_HW.SEQUENCE_NUMBER_HW =                                  19500000
                                      CURSOR_HW_V724.SEQUENCE_NUMBER_HW;19510000
     USER_INFO_HW.RUN_DATE           = WRK_RUN_DATE;                    19520000
     USER_INFO_HW.OU_CODE            = CURSOR_HW_V170.OU_CODE;          19530000
     USER_INFO_HW.CUSTOMER_NUMBER    = CURSOR_HW_V190.CUSTOMER_NUMBER;  19540000
     USER_INFO_HW.MARKETING_INSTDAT  = CURSOR_HW_V190.MARKETING_INSTDAT;19550000
     USER_INFO_HW.TYPE_OF_MAINT      = CURSOR_HW_V220.TYPE_OF_MAINT;    19560000
     USER_INFO_HW.TYPE_OF_WARRANTY   = CURSOR_HW_V220.TYPE_OF_WARRANTY; 19570000
     USER_INFO_HW.MODEL_NUMBER       = CURSOR_HW_V300.MODEL_NUMBER;     19580000
     USER_INFO_HW.RETAIN_FLAG        = CURSOR_HW_V070.RETAIN_FLAG;      19590000
     USER_INFO_HW.COVERAGE_START_1   = TB_RCBV240.COVERAGE_START_1;     19600000
     USER_INFO_HW.COVERAGE_END_1     = TB_RCBV240.COVERAGE_END_1;       19610000
     USER_INFO_HW.COVERAGE_START_6   = TB_RCBV240.COVERAGE_START_6;     19620000
     USER_INFO_HW.COVERAGE_END_6     = TB_RCBV240.COVERAGE_END_6;       19630000
     USER_INFO_HW.COVERAGE_START_7   = TB_RCBV240.COVERAGE_START_7;     19640000
     USER_INFO_HW.COVERAGE_END_7     = TB_RCBV240.COVERAGE_END_7;       19650000
                                                                        19660000
     USER_FILE_RCBDCB2_HW            = FILE_RCBDCB2_HW;                 19670000
                                                                        19680000
     CALL RCBDC2U (ADDR(SWITCH_HW_EXIT),                                19690000
                   ADDR(USER_INFO_HW),                                  19700000
                   ADDR(USER_FILE_RCBDCB2_HW),                          19710000
                   PTR_INT_AREA);                                       19720000
                                                                        19730000
     IF SWITCH_HW_EXIT = TRUE                                           19740000
     THEN                                                               19750000
       DO;                                                              19760000
         FILE_RCBDCB2_HW.CODPLBU = USER_FILE_RCBDCB2_HW.CODPLBU;        19770000
         FILE_RCBDCB2_HW.IODPRCE = USER_FILE_RCBDCB2_HW.IODPRCE;        19780000
         FILE_RCBDCB2_HW.IODPMBO = USER_FILE_RCBDCB2_HW.IODPMBO;        19790000
         FILE_RCBDCB2_HW.IODPTRN = USER_FILE_RCBDCB2_HW.IODPTRN;        19800000
       END;                                                             19810000
   END;                                                                 19820000
                                                                        19830000
 END R615_CALL_UEX_HW;                                                  19840000
1/*********************************************************************/19850000
 /*                                                                   */19860000
 /* MODULE NAME      :  R616_WRITE_RCBDCB2_RECORD                     */19870000
 /*                                                                   */19880000
 /* DESCRIPTION      :                                                */19890000
 /*                                                                   */19900000
 /*********************************************************************/19910000
 R616_WRITE_RCBDCB2_RECORD: PROC;                                       19920000
                                                                        19930000
                                          /* UPDATE HASH_TOTAL       */ 19940000
 CALL RCB018M (SUBSTR(FILE_RCBDCB2,3,4),                                19950000
               WRK_HASH_TOTAL_2,                                        19960000
               PTR_INT_AREA);                                           19970000
                                                                        19980000
                                          /* WRITE RECORD            */ 19990000
 WRITE FILE(RCBDCB2) FROM (FILE_RCBDCB2);                               20000000
                                                                        20010000
 WRK_CNT_RCBDCB2 = WRK_CNT_RCBDCB2 + 1;                                 20020000
                                                                        20030000
 END R616_WRITE_RCBDCB2_RECORD;                                         20040000
                                                                        20050000
1/********************************************************************/ 20060000
 /*                                                                  */ 20070000
 /* MODULE NAME      :  R619_FETCH_CURSOR_HW                         */ 20080000
 /*                                                                  */ 20090000
 /* DESCRIPTION      :                                               */ 20100000
 /*                                                                  */ 20110000
 /********************************************************************/ 20120000
 R619_FETCH_CURSOR_HW: PROC;                                            20130000
                                   /* INIT STRUCTURES                */ 20140000
 CURSOR_HW_V724 = '';                                                   20150000
 CURSOR_HW_V170 = '';                                                   20160000
 CURSOR_HW_V190 = '';                                                   20170000
 CURSOR_HW_V220 = '';                                                   20180000
 CURSOR_HW_V300 = '';                                                   20190000
 CURSOR_HW_V070 = '';                                                   20200000
 CURSOR_HW_STAT = '';                                                   20210000
 WRK_REAL_SERIAL_NUM = '';                                 /* RB01320 */20211004
 WRK_REAL_INDNULL    = '';                                 /* RB01320 */20212004
 SWITCH_ACTIVE_CTR    = FALSE;                             /* RB01290 */20220000
 SWITCH_INTERNAL_CTR  = FALSE;                             /* RB01290 */20230000
                                   /* FETCH CURSOR                   */ 20240000
 EXEC SQL                                                               20250000
   FETCH CURSOR_HW                                                      20260000
     INTO :CURSOR_HW_V724.PRODUCT_TYPE_HW     :WRK_INDNULL              20270000
         ,:CURSOR_HW_V724.ORIGIN_HW           :WRK_INDNULL              20280000
         ,:CURSOR_HW_V724.SEQUENCE_NUMBER_HW  :WRK_INDNULL              20290000
         ,:CURSOR_HW_STAT.STATUS              :WRK_INDNULL              20300000
         ,:CURSOR_HW_V170.OU_CODE             :WRK_INDNULL              20310000
         ,:CURSOR_HW_V190.CUSTOMER_NUMBER     :WRK_INDNULL              20320000
         ,:CURSOR_HW_V190.MARKETING_INSTDAT   :WRK_INDNULL              20330000
         ,:CURSOR_HW_V220.TYPE_OF_MAINT       :WRK_INDNULL              20340000
         ,:CURSOR_HW_V220.TYPE_OF_WARRANTY    :WRK_INDNULL              20350000
                                                      /* SOC RB01281 */ 20360000
         ,:CURSOR_HW_V220.WARRANTY_EXP_DATE   :WRK_INDNULL              20370000
         ,:CURSOR_HW_V220.SOURCE_INDICATOR    :WRK_INDNULL/* RB01290 */ 20380000
         ,:CURSOR_HW_V220.F_TYPE_OF_WARRANTY  :WRK_INDNULL              20390000
         ,:CURSOR_HW_V220.F_SPLT_DATE         :WRK_INDNULL              20400000
                                                     /* EOC RB01281  */ 20410000
         ,:CURSOR_HW_V300.MODEL_NUMBER        :WRK_INDNULL              20420000
         ,:CURSOR_HW_V070.RETAIN_FLAG         :WRK_INDNULL              20430000
                                                      /* SOC RB01320 */ 20431004
         ,:WRK_REAL_SERIAL_NUM                :WRK_REAL_INDNULL         20432004
                                                      /* EOC RB01320 */ 20433004
       ;                                                                20440000
                           /* SKIP RECORD IF SAME TOS, NOW ON ORDER? */ 20450000
 DO WHILE ((SQLCODE = 0) &                                              20460000
           (PREV_TOS = CURSOR_HW_V724.PRODUCT_TYPE_HW   ||              20470000
                       CURSOR_HW_V724.ORIGIN_HW         ||              20480000
                       CURSOR_HW_V724.SEQUENCE_NUMBER_HW));             20490000
   EXEC SQL                                                             20500000
     FETCH CURSOR_HW                                                    20510000
       INTO :CURSOR_HW_V724.PRODUCT_TYPE_HW   :WRK_INDNULL              20520000
           ,:CURSOR_HW_V724.ORIGIN_HW         :WRK_INDNULL              20530000
           ,:CURSOR_HW_V724.SEQUENCE_NUMBER_HW:WRK_INDNULL              20540000
           ,:CURSOR_HW_STAT.STATUS            :WRK_INDNULL              20550000
           ,:CURSOR_HW_V170.OU_CODE           :WRK_INDNULL              20560000
           ,:CURSOR_HW_V190.CUSTOMER_NUMBER   :WRK_INDNULL              20570000
           ,:CURSOR_HW_V190.MARKETING_INSTDAT :WRK_INDNULL              20580000
           ,:CURSOR_HW_V220.TYPE_OF_MAINT     :WRK_INDNULL              20590000
           ,:CURSOR_HW_V220.TYPE_OF_WARRANTY  :WRK_INDNULL              20600000
                                                      /* SOC RB01281 */ 20610000
           ,:CURSOR_HW_V220.WARRANTY_EXP_DATE :WRK_INDNULL              20620000
           ,:CURSOR_HW_V220.SOURCE_INDICATOR  :WRK_INDNULL/* RB01290 */ 20630000
           ,:CURSOR_HW_V220.F_TYPE_OF_WARRANTY:WRK_INDNULL              20640000
           ,:CURSOR_HW_V220.F_SPLT_DATE       :WRK_INDNULL              20650000
                                                      /* EOC RB01281 */ 20660000
           ,:CURSOR_HW_V300.MODEL_NUMBER      :WRK_INDNULL              20670000
           ,:CURSOR_HW_V070.RETAIN_FLAG       :WRK_INDNULL              20680000
                                                      /* SOC RB01320 */ 20680104
           ,:WRK_REAL_SERIAL_NUM              :WRK_REAL_INDNULL         20681004
                                                      /* EOC RB01320 */ 20682004
         ;                                                              20690000
 END;                                                                   20700000
 SELECT (SQLCODE);                                                      20710000
   WHEN (0)                                                             20720000
     DO;                                                                20730000
        SWITCH_END_OF_CURSOR_HW = FALSE;                                20740000
                                                      /* SOC RB01281 */ 20750000
        IF (CURSOR_HW_V220.F_TYPE_OF_WARRANTY ¬= '' &                   20760000
                                                      /* SOC RB01298 */ 20770000
 /*         CURSOR_HW_V220.F_SPLT_DATE ¬= '')                        */ 20780000
            CURSOR_HW_V220.F_SPLT_DATE ¬= ''        &                   20790000
            WRK_RUN_DATE >= CURSOR_HW_V220.F_SPLT_DATE &                20800000
            WRK_RUN_DATE <= CURSOR_HW_V220.WARRANTY_EXP_DATE)           20810000
                                                      /* EOC RB01298 */ 20820000
        THEN                                                            20830000
            FLEXIBLE_WARRANTY_BAU = TRUE;                               20840000
        ELSE                                                            20850000
            FLEXIBLE_WARRANTY_BAU = FALSE;                              20860000
                                                      /* EOC RB01281 */ 20870000
                                                      /* SOC RB01290 */ 20880000
        IF ((CURSOR_HW_V220.TYPE_OF_MAINT = '2' |                       20890000
             CURSOR_HW_V220.TYPE_OF_MAINT = 'A' |                       20900000
             CURSOR_HW_V220.TYPE_OF_MAINT = 'B')&                       20910000
            CURSOR_HW_V220.SOURCE_INDICATOR = 'C')                      20920000
        THEN                                                            20930000
          DO;                                                           20940000
             SWITCH_ACTIVE_CTR = TRUE;                                  20950000
             CALL R611_CHECK_TYPE_OF_CONTRACT;                          20960000
          END;                                        /* EOC RB01290 */ 20970000
                                                                        20980000
        SK_HW_S.EOF             = '0';                                  20990000
        SK_HW_S.PRODUCT_TYPE    = CURSOR_HW_V724.PRODUCT_TYPE_HW;       21000000
        SK_HW_S.ORIGIN          = CURSOR_HW_V724.ORIGIN_HW;             21010000
        SK_HW_S.SEQUENCE_NUMBER = CURSOR_HW_V724.SEQUENCE_NUMBER_HW;    21020000
        PREV_TOS                = CURSOR_HW_V724.PRODUCT_TYPE_HW ||     21030000
                                  CURSOR_HW_V724.ORIGIN_HW ||           21040000
                                  CURSOR_HW_V724.SEQUENCE_NUMBER_HW;    21050000
     END;                                                               21060000
   WHEN (100)                                                           21070000
     DO;                                                                21080000
        SWITCH_END_OF_CURSOR_HW = TRUE;                                 21090000
        SK_HW_S.EOF             = '1';                                  21100000
     END;                                                               21110000
   OTHERWISE                                                            21120000
     DO;                                                                21130000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               21140000
                            'DB2',                                      21150000
                            '#034');                                    21160000
     END;                                                               21170000
 END;                                                                   21180000
                                                                        21190000
 END R619_FETCH_CURSOR_HW;                                              21200000
                                                                        21210000
1/*********************************************************************/21220000
 /*                                                                   */21230000
 /* MODULE NAME      :  R620_INIT_PROCESS_SW                          */21240000
 /*                                                                   */21250000
 /* DESCRIPTION      :                                                */21260000
 /*                                                                   */21270000
 /*********************************************************************/21280000
 R620_INIT_PROCESS_SW: PROC;                                            21290000
                                                                        21300000
                    /* CURRENT HW + CUSTOMER IS FROM SW OCCURENCE    */ 21310000
 WRK_CURR_HW.PRODUCT_TYPE    = CURSOR_SW.PRODUCT_TYPE_HW;               21320000
 WRK_CURR_HW.ORIGIN          = CURSOR_SW.ORIGIN_HW;                     21360000
 WRK_CURR_HW.SEQUENCE_NUMBER = CURSOR_SW.SEQUENCE_NUMBER_HW;            21370001
 WRK_CURR_HW.CUSTOMER_NUMBER = CURSOR_SW.CUSTOMER_USER;                 21371001
                                                                        21380000
 END R620_INIT_PROCESS_SW;                                              21560000
1/*********************************************************************/21570000
 /*                                                                   */21580000
 /* MODULE NAME      :  R624_FILL_RCBDCB2_SW                          */21590000
 /*                                                                   */21600000
 /* DESCRIPTION      :                                                */21610000
 /*                                                                   */21620000
 /*********************************************************************/21630000
 R624_FILL_RCBDCB2_SW: PROC;                                            21640000
                                                                        21650000
 FILE_RCBDCB2 = '';                                                     21660000
 FILE_RCBDCB2_SW.ICUSCNO = SUBSTR (WRK_CURR_HW.CUSTOMER_NUMBER,2,7);    21670000
 FILE_RCBDCB2_SW.CDBSRTC = '2';                                         21680000
                                    /* DETERMINE HW                   */21690000
 SELECT(WRK_CURR_HW.PRODUCT_TYPE);                                      21700000
   WHEN ('9998')                                                        21710000
     DO;                                                                21720000
       FILE_RCBDCB2_SW.CSLMTYP = WRK_CURR_HW.PRODUCT_TYPE;              21730000
       FILE_RCBDCB2_SW.IOLCPLM = WRK_CURR_HW.ORIGIN;                    21740000
       FILE_RCBDCB2_SW.IHSINBR =                                        21750000
                                SUBSTR(WRK_CURR_HW.SEQUENCE_NUMBER,3,5);21760000
     END;                                                               21770000
   WHEN ('')                                                            21780000
     DO;                                                                21790000
       FILE_RCBDCB2_SW.CSLMTYP = WRK_CTRYNO || 'U';                     21800000
       FILE_RCBDCB2_SW.IOLCPLM =                                        21810000
                                SUBSTR(WRK_CURR_HW.CUSTOMER_NUMBER,3,2);21820000
       FILE_RCBDCB2_SW.IHSINBR =                                        21830000
                         SUBSTR(WRK_CURR_HW.CUSTOMER_NUMBER,5,4) || '0';21840000
     END;                                                               21850000
   OTHERWISE                                                            21860000
     DO;                                                                21870000
       FILE_RCBDCB2_SW.CSLMTYP = WRK_CURR_HW.PRODUCT_TYPE;              21880000
       FILE_RCBDCB2_SW.IOLCPLM = WRK_CURR_HW.ORIGIN;                    21890000
       FILE_RCBDCB2_SW.IHSINBR =                                        21900000
                                SUBSTR(WRK_CURR_HW.SEQUENCE_NUMBER,3,5);21910000
     END;                                                               21920000
 END;                                                                   21930000
                                                                        21940000
 FILE_RCBDCB2_SW.CDBSPRD = '3';                                         21950000
 FILE_RCBDCB2_SW.CSLMBTP = CURSOR_SW.PRODUCT_TYPE_SW;                   21960000
 FILE_RCBDCB2_SW.CSLMBMD = CURSOR_SW.MODEL_NUMBER_SW;                   21970000
                                                                        21980000
 IF CURSOR_SW.SEQUENCE_NUMBER_SW ¬= ''                                  21990000
 THEN                                                                   22000000
   DO;                                                                  22010000
     FILE_RCBDCB2_SW.ISLMPSR =                                          22020000
                      SUBSTR(CURSOR_SW.SEQUENCE_NUMBER_SW,3,5);         22030000
     FILE_RCBDCB2_SW.EXTRA_INFO.SEQUENCE_NUMBER_SW =                    22040000
                      CURSOR_SW.SEQUENCE_NUMBER_SW;                     22050000
   END;                                                                 22060000
 ELSE                                                                   22070000
   DO;                                                                  22080000
     FILE_RCBDCB2_SW.ISLMPSR =                                          22090000
                      SUBSTR(CURSOR_SW.ORDER_REF_NUMBER,3,4) || '';     22100000
     FILE_RCBDCB2_SW.EXTRA_INFO.SEQUENCE_NUMBER_SW =                    22110000
                      FILE_RCBDCB2_SW.ISLMPSR;                          22120000
   END;                                                                 22130000
                                                                        22140000
 IF CURSOR_SW.MARKETING_INSTDAT ¬= '0001-01-01'                         22150000
 THEN                                                                   22160000
   DO;                                                                  22170000
     FILE_RCBDCB2_SW.DHSIICS =                                          22180000
                      R013_TRANS_DATE(CURSOR_SW.MARKETING_INSTDAT);     22190000
   END;                                                                 22200000
                                                                        22210000
 IF CURSOR_SW.END_DATE ¬= '0001-01-01'                                  22220000
 THEN                                                                   22230000
   DO;                                                                  22240000
     FILE_RCBDCB2_SW.DAGRRES = R013_TRANS_DATE (CURSOR_SW.END_DATE);    22250000
   END;                                                                 22260000
                                                                        22270000
 FILE_RCBDCB2_SW.CSLMLIC = CURSOR_SW.DSLO_COPY_IND;                     22280000
                                                                        22290000
                          /* FILL EXTRA INFO, NEEDED FOR COMPARE     */ 22300000
                          /* PROCESS                                 */ 22310000
 FILE_RCBDCB2_SW.EXTRA_INFO.CUSTOMER_NUMBER    =                        22320000
                                           WRK_CURR_HW.CUSTOMER_NUMBER; 22330000
 FILE_RCBDCB2_SW.EXTRA_INFO.PRODUCT_TYPE_HW    =                        22340000
                                           WRK_CURR_HW.PRODUCT_TYPE;    22350000
 FILE_RCBDCB2_SW.EXTRA_INFO.ORIGIN_HW          =                        22360000
                                           WRK_CURR_HW.ORIGIN;          22370000
 FILE_RCBDCB2_SW.EXTRA_INFO.SEQUENCE_NUMBER_HW =                        22380000
                                           WRK_CURR_HW.SEQUENCE_NUMBER; 22390000
 FILE_RCBDCB2_SW.EXTRA_INFO.PRODUCT_TYPE_SW    =                        22400000
                                           CURSOR_SW.PRODUCT_TYPE_SW;   22410000
 FILE_RCBDCB2_SW.EXTRA_INFO.MODEL_NUMBER_SW    =                        22420000
                                           CURSOR_SW.MODEL_NUMBER_SW;   22430000
 FILE_RCBDCB2_SW.EXTRA_INFO.ORIGIN_SW          =                        22440000
                                           CURSOR_SW.ORIGIN_SW;         22450000
       /* EXTRA INFO SEQUENCE NUMBER SW IS FILLED EARLIER       */      22460000
       /* TO KEEP SW ORDERS IN SEQUENCE                         */      22470000
       /* BUT NOW THE SK* KEY SEQUENCE IS NOT MATCHING          */      22480000
       /* TEMP KEY, SO IN RCBDCCM THIS MUST BE BLANKED OUT      */      22490000
       /* WHERE THE SK* KEY IS BUILT, FOR ORDERS ONLY           */      22500000
 FILE_RCBDCB2_SW.EXTRA_INFO.OU_CODE            =                        22510000
                                           CURSOR_SW.OU_CODE;           22520000
                                                                        22530000
 END R624_FILL_RCBDCB2_SW;                                              22540000
1/*********************************************************************/22840000
 /*                                                                   */22850000
 /* MODULE NAME      :  R625_CALL_UEX_SW                              */22860000
 /*                                                                   */22870000
 /* DESCRIPTION      :                                                */22880000
 /*                                                                   */22890000
 /*********************************************************************/22900000
 R625_CALL_UEX_SW: PROC;                                                22910000
                                                                        22920000
 IF SWITCH_SW_EXIT = TRUE                                               22930000
 THEN                                                                   22940000
   DO;                                                                  22950000
     USER_INFO_SW.PRODUCT_TYPE_HW        = CURSOR_SW.PRODUCT_TYPE_HW;   22960000
     USER_INFO_SW.ORIGIN_HW              = CURSOR_SW.ORIGIN_HW;         22980001
     USER_INFO_SW.SEQUENCE_NUMBER_HW     = CURSOR_SW.SEQUENCE_NUMBER_HW;22990000
     USER_INFO_SW.PRODUCT_TYPE_SW        = CURSOR_SW.PRODUCT_TYPE_SW;   23190000
     USER_INFO_SW.MODEL_NUMBER_SW        = CURSOR_SW.MODEL_NUMBER_SW;   23200000
     USER_INFO_SW.ORIGIN_SW              = CURSOR_SW.ORIGIN_SW;         23210000
     USER_INFO_SW.SEQUENCE_NUMBER_SW     = CURSOR_SW.SEQUENCE_NUMBER_SW;23220000
     USER_INFO_SW.RUN_DATE               = WRK_RUN_DATE;                23230000
     USER_INFO_SW.DSLO_COPY_IND          = CURSOR_SW.DSLO_COPY_IND;     23240000
     USER_INFO_SW.OU_CODE                = CURSOR_SW.OU_CODE;           23250000
     USER_INFO_SW.CUSTOMER_USER          = CURSOR_SW.CUSTOMER_USER;     23260000
     USER_INFO_SW.MARKETING_INSTDAT      = CURSOR_SW.MARKETING_INSTDAT; 23270000
     USER_INFO_SW.END_DATE               = CURSOR_SW.END_DATE;          23280000
     USER_INFO_SW.ORDER_REF_NUMBER       = CURSOR_SW.ORDER_REF_NUMBER;  23290000
                                                     /* START RA01139 */23300000
     USER_INFO_SW.PRODUCT_CODE           = '';                          23310000
     USER_INFO_SW.LICENCE_TYPE           = '';                          23320000
     USER_INFO_SW.SERVICE_CLASS          = '';                          23330000
     USER_INFO_SW.SUPPORT_TYPE           = '';                          23340000
     USER_INFO_SW.SUPPORT_LOCATION       = '';                          23350000
     USER_INFO_SW.SERVICE_PERIOD         = '';                          23360000
     USER_INFO_SW.DEVELOP_DIV_CODE       = '';                          23370000
     USER_INFO_SW.EFFECTIVE_DATE         = '';                          23380000
                                                       /* END RA01139 */23390000
     USER_FILE_RCBDCB2_SW = FILE_RCBDCB2_SW;                            23400000
                                                                        23410000
     CALL RCBDC3U (ADDR(SWITCH_SW_EXIT),                                23420000
                   ADDR(USER_INFO_SW),                                  23430000
                   ADDR(USER_FILE_RCBDCB2_SW),                          23440000
                   PTR_INT_AREA);                                       23450000
                                                                        23460000
     IF SWITCH_SW_EXIT = TRUE                                           23470000
     THEN                                                               23480000
       DO;                                                              23490000
         FILE_RCBDCB2_SW.IODPMBO = USER_FILE_RCBDCB2_SW.IODPMBO;        23500000
       END;                                                             23510000
   END;                                                                 23520000
 END R625_CALL_UEX_SW;                                                  23530000
1/*********************************************************************/23540000
 /*                                                                   */23550000
 /* MODULE NAME      :  R629_FETCH_CURSOR_SW                          */23560000
 /*                                                                   */23570000
 /* DESCRIPTION      :                                                */23580000
 /*                                                                   */23590000
 /*********************************************************************/23600000
 R629_FETCH_CURSOR_SW: PROC;                                            23610000
                                   /* INIT STRUCTURES                */ 23620000
 CURSOR_SW = '';                                                        23630000
                                   /* FETCH CURSOR                   */ 23640000
 EXEC SQL                                                               23650000
   FETCH CURSOR_SW                                                      23660000
    INTO :CURSOR_SW.PRODUCT_TYPE_HW      :WRK_INDNULL                   23670000
        ,:CURSOR_SW.ORIGIN_HW            :WRK_INDNULL                   23680000
        ,:CURSOR_SW.SEQUENCE_NUMBER_HW   :WRK_INDNULL                   23690000
        ,:CURSOR_SW.PRODUCT_TYPE_SW      :WRK_INDNULL                   23700000
        ,:CURSOR_SW.MODEL_NUMBER_SW      :WRK_INDNULL                   23710000
        ,:CURSOR_SW.ORIGIN_SW            :WRK_INDNULL                   23720000
        ,:CURSOR_SW.SEQUENCE_NUMBER_SW   :WRK_INDNULL                   23730000
        ,:CURSOR_SW.DSLO_COPY_IND        :WRK_INDNULL                   23740000
        ,:CURSOR_SW.OU_CODE              :WRK_INDNULL                   23750000
        ,:CURSOR_SW.CUSTOMER_USER        :WRK_INDNULL                   23760000
        ,:CURSOR_SW.MARKETING_INSTDAT    :WRK_INDNULL                   23770000
        ,:CURSOR_SW.END_DATE             :WRK_INDNULL                   23780000
        ,:CURSOR_SW.ORDER_REF_NUMBER     :WRK_INDNULL                   23790000
        ,:CURSOR_SW.PRODUCT_CODE         :WRK_INDNULL                   23800000
        ,:CURSOR_SW.LICENCE_TYPE         :WRK_INDNULL                   23810000
        ,:CURSOR_SW.SERVICE_CLASS        :WRK_INDNULL                   23820000
        ,:CURSOR_SW.SUPPORT_TYPE         :WRK_INDNULL                   23830000
        ,:CURSOR_SW.SUPPORT_LOCATION     :WRK_INDNULL                   23840000
        ,:CURSOR_SW.SERVICE_PERIOD       :WRK_INDNULL                   23850000
        ,:CURSOR_SW.DEVELOP_DIV_CODE     :WRK_INDNULL                   23860000
        ,:CURSOR_SW.EFFECTIVE_DATE       :WRK_INDNULL                   23870000
       ;                                                                23880000
 SELECT (SQLCODE);                                                      23890000
   WHEN (0)                                                             23900000
     DO;                                                                23910000
        SWITCH_END_OF_CURSOR_SW = FALSE;                                23920000
        SK_SW_S.EOF             = '0';                                  23940000
        SK_SW_S.PRODUCT_TYPE    = CURSOR_SW.PRODUCT_TYPE_HW;            23950000
        SK_SW_S.ORIGIN          = CURSOR_SW.ORIGIN_HW;                  23970001
        SK_SW_S.SEQUENCE_NUMBER = CURSOR_SW.SEQUENCE_NUMBER_HW;         23980001
                                                    /* START RC01141 */ 24180000
        SK_SW_S.PRODUCT_TYPE_SW = CURSOR_SW.PRODUCT_TYPE_SW;            24190000
        SK_SW_S.MODEL_SW        = CURSOR_SW.MODEL_NUMBER_SW;            24200000
        SK_SW_S.ORIGIN_SW       = CURSOR_SW.ORIGIN_SW;                  24210000
        SK_SW_S.SEQUENCE_NUMBER_SW = CURSOR_SW.SEQUENCE_NUMBER_SW;      24220000
                                                      /* END RC01141 */ 24230000
     END;                                                               24240000
   WHEN (100)                                                           24250000
     DO;                                                                24260000
        SWITCH_END_OF_CURSOR_SW = TRUE;                                 24270000
        SK_SW_S.EOF             = '1';                                  24280000
     END;                                                               24290000
   OTHERWISE                                                            24300000
     DO;                                                                24310000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               24320000
                            'DB2',                                      24330000
                            '#035');                                    24340000
     END;                                                               24350000
 END;                                                                   24360000
                                                                        24370000
 END R629_FETCH_CURSOR_SW;                                              24380000
1/*********************************************************************/24390000
 /*                                                                   */24400000
 /* MODULE NAME      :  R630_INIT_PROCESS_BOTH                        */24410000
 /*                                                                   */24420000
 /* DESCRIPTION      :                                                */24430000
 /*                                                                   */24440000
 /*********************************************************************/24450000
 R630_INIT_PROCESS_BOTH: PROC;                                          24460000
                                                                        24470000
                    /* CURRENT HW + CUSTOMER IS FROM HW OCCURENCE    */ 24480000
 WRK_CURR_HW.PRODUCT_TYPE    = CURSOR_HW_V724.PRODUCT_TYPE_HW;          24490000
 WRK_CURR_HW.ORIGIN          = CURSOR_HW_V724.ORIGIN_HW;                24500000
 WRK_CURR_HW.SEQUENCE_NUMBER = CURSOR_HW_V724.SEQUENCE_NUMBER_HW;       24510000
 WRK_CURR_HW.CUSTOMER_NUMBER = CURSOR_HW_V190.CUSTOMER_NUMBER;          24520000
                                                                        24530000
 END R630_INIT_PROCESS_BOTH;                                            24540000
1/*********************************************************************/24550000
 /*                                                                   */24560000
 /* MODULE NAME      :  R700_FILL_RCBDCB1_RECORD                      */24570000
 /*                                                                   */24580000
 /* DESCRIPTION      :                                                */24590000
 /*                                                                   */24600000
 /*********************************************************************/24610000
 R700_FILL_RCBDCB1_RECORD: PROC;                                        24620000
                              /* INIT AND FILL RECORD                */ 24630000
 FILE_RCBDCB1 = '';                                                     24640000
                                                                        24650000
 FILE_RCBDCB1.ICUSCNO = SUBSTR(CURSOR_CU_V010.CUSTOMER_NUMBER,2,7);     24660000
 FILE_RCBDCB1.CDBSRTC = '1';                                            24670000
                                                           /* RA01117 */24680000
 FILE_RCBDCB1.ICUSENT = SUBSTR(CURSOR_CU_V010.ENTERPRISE_NUMBER,2,7);   24690000
                                                                        24700000
                                                      /* SOC PTM1038 */ 24710000
 WRK_RCB021M_START    = 1;         /* CUSTOMER_NAME IS POSSIBLY DBCS */ 24720000
 WRK_RCB021M_LENGTH   = 28;                                             24730000
 CALL RCB021M(CURSOR_CU_V010.CUSTOMER_NAME,WRK_RCB021M_START,           24740000
              WRK_RCB021M_LENGTH,FILE_RCBDCB1.NCUSNAM,WRK_RCB021M_RET); 24750000
                                                                        24760000
 IF WRK_RCB021M_RET ¬= 0 THEN                         /* EOC PTM1038 */ 24770000
   DO;                                                                  24780000
     CALL RCBDCBM_ERROR (NULL, 'OTHER', '#036');                        24790000
   END;                                                                 24800000
                                                                        24810000
 FILE_RCBDCB1.IMKTMBO = TB_RCBV350.MKT_INSTALLING_OU;      /* RA01117 */24820000
 FILE_RCBDCB1.IODPCEB = TB_RCBV350.CU_ENGINEERING_OU;      /* RA01117 */24830000
                                                                        24840000
 FILE_RCBDCB1.ICUSZIP = TB_RCBV150.ZIP_CODE;               /* PTM0764 */24850000
                                                                        24860000
 END R700_FILL_RCBDCB1_RECORD;                                          24870000
1/********************************************************************/ 24880000
 /*                                                                  */ 24890000
 /* MODULE NAME      : R702_WRITE_RCBDCB1_RECORD                     */ 24900000
 /*                                                                  */ 24910000
 /* DESCRIPTION      : WRITE RCBDCB1 RECORD                          */ 24920000
 /*                                                                  */ 24930000
 /********************************************************************/ 24940000
 R702_WRITE_RCBDCB1_RECORD: PROC;                                       24950000
                                                                        24960000
                                          /* UPDATE HASH_TOTAL       */ 24970000
 CALL RCB018M (SUBSTR(FILE_RCBDCB1.ICUSCNO,3,4),                        24980000
               WRK_HASH_TOTAL_1,                                        24990000
               PTR_INT_AREA);                                           25000000
                                                                        25010000
                                          /* WRITE RECORD            */ 25020000
 WRITE FILE(RCBDCB1) FROM (FILE_RCBDCB1);                               25030000
                                                                        25040000
 WRK_CNT_RCBDCB1 = WRK_CNT_RCBDCB1 + 1;                                 25050000
                                                                        25060000
 END R702_WRITE_RCBDCB1_RECORD;                                         25070000
                                                                        25080000
1/*********************************************************************/25090000
 /*                                                                   */25100000
 /* MODULE NAME      :  R704_RETRIEVE_CUST_MOD                RA01117 */25110000
 /*                                                                   */25120000
 /* DESCRIPTION      :  RETRIEVE CUSTOMER MODIFIABLE INFO             */25130000
 /*                                                                   */25140000
 /*********************************************************************/25150000
 R704_RETRIEVE_CUST_MOD: PROC;                                          25160000
                                                                        25170000
                          /* RETRIEVE CUSTOMER MODIFIABLE INFO       */ 25180000
 TB_RCBV350 = '';                                                       25190000
                                                                        25200000
  EXEC SQL                                                              25210000
    SELECT                                                              25220000
         MKT_INSTALLING_OU                                              25230000
        ,CU_ENGINEERING_OU                                              25240000
      INTO                                                              25250000
        :TB_RCBV350.MKT_INSTALLING_OU  :WRK_INDNULL                     25260000
       ,:TB_RCBV350.CU_ENGINEERING_OU  :WRK_INDNULL                     25270000
      FROM RCBV0350_CUST_MOD                                            25280000
     WHERE CUSTOMER_NUMBER  = :CURSOR_CU_V010.CUSTOMER_NUMBER           25290000
       AND COUNTRY_NUMBER   = :WRK_CTRYNO                               25300000
       AND :WRK_RUN_DATE    BETWEEN EFFECTIVE_DATE                      25310000
                                AND END_DATE                            25320000
      ;                                                                 25330000
                                                                        25340000
  SELECT (SQLCODE);                                                     25350000
    WHEN (0, 100)                                                       25360000
      DO;                                                               25370000
      END;                                                              25380000
    OTHERWISE                                                           25390000
      DO;                                                               25400000
         CALL RCBDCBM_ERROR (ADDR (SQLCA),                              25410000
                             'DB2',                                     25420000
                             '#037');                                   25430000
     END;                                                               25440000
   END;                                                                 25450000
                                                                        25460000
 END R704_RETRIEVE_CUST_MOD;                                            25470000
                                                                        25480000
1/*********************************************************************/25490000
 /*                                                                   */25500000
 /* MODULE NAME      :  R705_RETRIEVE_CUST_ADDR               PTM0764 */25510000
 /*                                                                   */25520000
 /* DESCRIPTION      :  RETRIEVE CUSTOMER ADDRESS INFO                */25530000
 /*                                                                   */25540000
 /*********************************************************************/25550000
 R705_RETRIEVE_CUST_ADDR: PROC;                                         25560000
                                                                        25570000
                          /* RETRIEVE CUSTOMER ADDRESS INFO       */    25580000
 TB_RCBV150 = '';                                                       25590000
                                                                        25600000
  EXEC SQL                                                              25610000
    SELECT                                                              25620000
         ZIP_CODE                                                       25630000
      INTO                                                              25640000
        :TB_RCBV150.ZIP_CODE :WRK_INDNULL                               25650000
      FROM RCBV0150_CUST_ADDR                                           25660000
     WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                               25670000
       AND CUSTOMER_NUMBER  = :CURSOR_CU_V010.CUSTOMER_NUMBER           25680000
       AND ADDRESS_MASK     LIKE '__1%'                                 25690000
       AND ADDRESS_NUMBER   =                                           25700000
         ( SELECT MIN(ADDRESS_NUMBER)                                   25710000
             FROM RCBV0150_CUST_ADDR                                    25720000
            WHERE COUNTRY_NUMBER   = :WRK_CTRYNO                        25730000
              AND CUSTOMER_NUMBER  = :CURSOR_CU_V010.CUSTOMER_NUMBER    25740000
              AND ADDRESS_MASK     LIKE '__1%'                          25750000
              AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                25760000
                                  AND END_DATE                          25770000
         )                                                              25780000
       AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                       25790000
                               AND END_DATE                             25800000
      ;                                                                 25810000
                                                                        25820000
  SELECT (SQLCODE);                                                     25830000
    WHEN (0, 100)                                                       25840000
      DO;                                                               25850000
      END;                                                              25860000
    OTHERWISE                                                           25870000
      DO;                                                               25880000
         CALL RCBDCBM_ERROR (ADDR (SQLCA),                              25890000
                             'DB2',                                     25900000
                             '#038');                                   25910000
     END;                                                               25920000
   END;                                                                 25930000
                                                                        25940000
 END R705_RETRIEVE_CUST_ADDR;                                           25950000
                                                                        25960000
1/********************************************************************/ 25970000
 /*                                                                  */ 25980000
 /* MODULE NAME      : R709_FETCH_CURSOR_CU                          */ 25990000
 /*                                                                  */ 26000000
 /* DESCRIPTION      : FETCH CURSOR CURSOR_CU                        */ 26010000
 /*                                                                  */ 26020000
 /********************************************************************/ 26030000
 R709_FETCH_CURSOR_CU: PROC;                                            26040000
                                   /* INIT STRUCTURES                */ 26050000
 CURSOR_CU_V010 = '';                                                   26060000
                                   /* FETCH CURSOR                   */ 26070000
 EXEC SQL                                                               26080000
   FETCH CURSOR_CU                                                      26090000
   INTO   :CURSOR_CU_V010.CUSTOMER_NUMBER   :WRK_INDNULL                26100000
         ,:CURSOR_CU_V010.CUSTOMER_NAME     :WRK_INDNULL                26110000
         ,:CURSOR_CU_V010.ENTERPRISE_NUMBER :WRK_INDNULL   /* RA01117 */26120000
       ;                                                                26130000
 SELECT (SQLCODE);                                                      26140000
   WHEN (0)                                                             26150000
     DO;                                                                26160000
                                                     /* START RA01139 */26170000
        PARM_INT_AREA.SEQUENCE_KEY = 'CU:' || WRK_CTRYNO                26180000
                             || CURSOR_CU_V010.CUSTOMER_NUMBER;         26190000
                                                       /* END RA01139 */26200000
        SWITCH_END_OF_CURSOR_CU = FALSE;                                26210000
     END;                                                               26220000
   WHEN (100)                                                           26230000
     DO;                                                                26240000
        SWITCH_END_OF_CURSOR_CU = TRUE;                                 26250000
     END;                                                               26260000
   OTHERWISE                                                            26270000
     DO;                                                                26280000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               26290000
                            'DB2',                                      26300000
                            '#039');                                    26310000
     END;                                                               26320000
 END;                                                                   26330000
                                                                        26340000
 END R709_FETCH_CURSOR_CU;                                              26350000
                                                                        26360000
1/*********************************************************************/26370000
 /*                                                                   */26380000
 /* MODULE NAME      :  R800_INIT_CUSTOMER                            */26390000
 /*                                                                   */26400000
 /* DESCRIPTION      :                                                */26410000
 /*                                                                   */26420000
 /*********************************************************************/26430000
 R800_INIT_CUSTOMER: PROC;                                              26440000
                                         /* INIT CURSOR CURSOR_CU    */ 26450000
 EXEC SQL                                                               26460000
   OPEN CURSOR_CU;                                                      26470000
                                                                        26480000
 SELECT (SQLCODE);                                                      26490000
   WHEN (0);                                                            26500000
   OTHERWISE                                                            26510000
     DO;                                                                26520000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               26530000
                    'DB2',                                              26540000
                    '#040');                                            26550000
     END;                                                               26560000
 END;                                                                   26570000
               /* FETCH FIRST OCCURENCE OF CURSOR_CU                 */ 26580000
 CALL R709_FETCH_CURSOR_CU;                                             26590000
                                                                        26600000
                                            /* OPEN FILE RCBDCB1     */ 26610000
 OPEN FILE(RCBDCB1);                                                    26620000
                                                                        26630000
                                        /* INIT AND FILL HEADER REC  */ 26640000
 FILE_RCBDCB1 = '';                                                     26650000
 FILE_RCBDCB1_H.KEY                     = (20)'9';                      26660000
 FILE_RCBDCB1_H.PROCESS_NAME            = 'RETAIN INV';                 26670000
 FILE_RCBDCB1_H.FILE_TYPE               = 'DELTA EXTR';                 26680000
 FILE_RCBDCB1_H.COUNTRY_NUMBER          = WRK_CTRYNO;                   26690000
 FILE_RCBDCB1_H.RUN_DATE                = WRK_RUN_DATE;                 26700000
 FILE_RCBDCB1_H.TIME_STAMP              = WRK_TIME_STAMP;               26710000
                                                                        26720000
                                        /* WRITE HEADER REC          */ 26730000
 WRITE FILE(RCBDCB1) FROM(FILE_RCBDCB1);                                26740000
                                                                        26750000
 END R800_INIT_CUSTOMER;                                                26760000
                                                                        26770000
1/*********************************************************************/26780000
 /*                                                                   */26790000
 /* MODULE NAME      :  R809_END_CUSTOMER                             */26800000
 /*                                                                   */26810000
 /* DESCRIPTION      :                                                */26820000
 /*                                                                   */26830000
 /*********************************************************************/26840000
 R809_END_CUSTOMER: PROC;                                               26850000
                             /* CLOSE CURSOR CURSOR_CU               */ 26860000
 EXEC SQL                                                               26870000
   CLOSE CURSOR_CU;                                                     26880000
                                                                        26890000
 SELECT (SQLCODE);                                                      26900000
   WHEN (0);                                                            26910000
   OTHERWISE                                                            26920000
     DO;                                                                26930000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               26940000
                            'DB2',                                      26950000
                            '#041');                                    26960000
     END;                                                               26970000
 END;                                                                   26980000
                                                                        26990000
                                        /* INIT AND FILL TRAILER REC */ 27000000
 FILE_RCBDCB1 = '';                                                     27010000
 FILE_RCBDCB1_H.KEY                     = '';                           27020000
 FILE_RCBDCB1_H.PROCESS_NAME            = 'RETAIN INV';                 27030000
 FILE_RCBDCB1_H.FILE_TYPE               = 'DELTA EXTR';                 27040000
 FILE_RCBDCB1_H.COUNTRY_NUMBER          = WRK_CTRYNO;                   27050000
 FILE_RCBDCB1_H.RUN_DATE                = WRK_RUN_DATE;                 27060000
                                                                        27070000
                                        /* WRITE TRAILER REC         */ 27080000
 WRITE FILE(RCBDCB1) FROM(FILE_RCBDCB1);                                27090000
                                                                        27100000
                               /* CLOSE FILE RCBDCB1                 */ 27110000
 CLOSE FILE(RCBDCB1);                                                   27120000
                                                                        27130000
 END R809_END_CUSTOMER;                                                 27140000
                                                                        27150000
1/*********************************************************************/27160000
 /*                                                                   */27170000
 /* MODULE NAME      :  R810_INIT_INV                                 */27180000
 /*                                                                   */27190000
 /* DESCRIPTION      :                                                */27200000
 /*                                                                   */27210000
 /*********************************************************************/27220000
 R810_INIT_INV: PROC;                                                   27230000
                                         /* INIT CURSOR CURSOR_HW    */ 27240000
 EXEC SQL                                                               27250000
   OPEN CURSOR_HW;                                                      27260000
                                                                        27270000
 SELECT (SQLCODE);                                                      27280000
   WHEN (0);                                                            27290000
   OTHERWISE                                                            27300000
     DO;                                                                27310000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               27320000
                    'DB2',                                              27330000
                    '#042');                                            27340000
     END;                                                               27350000
 END;                                                                   27360000
               /* FETCH FIRST OCCURENCE OF CURSOR_HW                 */ 27370000
 CALL R619_FETCH_CURSOR_HW;                                             27380000
                                                                        27390000
                                         /* INIT CURSOR CURSOR_SW    */ 27400000
 EXEC SQL                                                               27410000
   OPEN CURSOR_SW;                                                      27420000
                                                                        27430000
 SELECT (SQLCODE);                                                      27440000
   WHEN (0);                                                            27450000
   OTHERWISE                                                            27460000
     DO;                                                                27470000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               27480000
                    'DB2',                                              27490000
                    '#043');                                            27500000
     END;                                                               27510000
 END;                                                                   27520000
               /* FETCH FIRST OCCURENCE OF CURSOR_SW                 */ 27530000
 CALL R629_FETCH_CURSOR_SW;                                             27540000
                                                                        27550000
                                            /* OPEN FILE RCBDCB2     */ 27560000
 OPEN FILE(RCBDCB2);                                                    27570000
                                                                        27580000
                                        /* INIT AND FILL HEADER REC  */ 27590000
 FILE_RCBDCB2 = '';                                                     27600000
 FILE_RCBDCB2_H.KEY                     = (20)'9';                      27610000
 FILE_RCBDCB2_H.PROCESS_NAME            = 'RETAIN INV';                 27620000
 FILE_RCBDCB2_H.FILE_TYPE               = 'DELTA EXTR';                 27630000
 FILE_RCBDCB2_H.COUNTRY_NUMBER          = WRK_CTRYNO;                   27640000
 FILE_RCBDCB2_H.RUN_DATE                = WRK_RUN_DATE;                 27650000
 FILE_RCBDCB2_H.TIME_STAMP              = WRK_TIME_STAMP;               27660000
                                                                        27670000
                                        /* WRITE HEADER REC          */ 27680000
 WRITE FILE(RCBDCB2) FROM(FILE_RCBDCB2);                                27690000
                                                  /* START RC01141 */   27700000
 CALL R820_DETERMINE_SEQUENCE_KEY;                                      27710000
                                                    /* END RC01141 */   27720000
 END R810_INIT_INV;                                                     27730000
                                                                        27740000
1/*********************************************************************/27750000
 /*                                                                   */27760000
 /* MODULE NAME      :  R819_END_INV                                  */27770000
 /*                                                                   */27780000
 /* DESCRIPTION      : END PROCESSING INVENTORY                       */27790000
 /*                                                                   */27800000
 /*********************************************************************/27810000
 R819_END_INV: PROC;                                                    27820000
                             /* CLOSE CURSOR CURSOR_HW               */ 27830000
 EXEC SQL                                                               27840000
   CLOSE CURSOR_HW;                                                     27850000
                                                                        27860000
 SELECT (SQLCODE);                                                      27870000
   WHEN (0);                                                            27880000
   OTHERWISE                                                            27890000
     DO;                                                                27900000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               27910000
                            'DB2',                                      27920000
                            '#044');                                    27930000
     END;                                                               27940000
 END;                                                                   27950000
                                                                        27960000
                             /* CLOSE CURSOR CURSOR_SW               */ 27970000
 EXEC SQL                                                               27980000
   CLOSE CURSOR_SW;                                                     27990000
                                                                        28000000
 SELECT (SQLCODE);                                                      28010000
   WHEN (0);                                                            28020000
   OTHERWISE                                                            28030000
     DO;                                                                28040000
        CALL RCBDCBM_ERROR (ADDR (SQLCA),                               28050000
                            'DB2',                                      28060000
                            '#045');                                    28070000
     END;                                                               28080000
 END;                                                                   28090000
                                                                        28100000
                                        /* INIT AND FILL TRAILER REC */ 28110000
 FILE_RCBDCB2 = '';                                                     28120000
 FILE_RCBDCB2_H.KEY                     = '';                           28130000
 FILE_RCBDCB2_H.PROCESS_NAME            = 'RETAIN INV';                 28140000
 FILE_RCBDCB2_H.FILE_TYPE               = 'DELTA EXTR';                 28150000
 FILE_RCBDCB2_H.COUNTRY_NUMBER          = WRK_CTRYNO;                   28160000
 FILE_RCBDCB2_H.RUN_DATE                = WRK_RUN_DATE;                 28170000
                                                                        28180000
                                        /* WRITE TRAILER REC         */ 28190000
 WRITE FILE(RCBDCB2) FROM(FILE_RCBDCB2);                                28200000
                                                                        28210000
                               /* CLOSE FILE RCBDCB2                 */ 28220000
 CLOSE FILE(RCBDCB2);                                                   28230000
                                                                        28240000
                    /* SAVE HASH TOTAL RCBDCB1 IN PARAMETER RCB024   */ 28250000
 TB_RCBV500 = '';                                                       28260000
 TB_RCBV500_I = '';                                                     28270000
 PARM_HASH.NUMBER      = 'RCB024';                                      28280000
 PARM_HASH.PROC_ID     = WRK_PROC_ID;                                   28290000
 PARM_HASH.CTRYNO      = WRK_CTRYNO;                                    28300000
 PARM_HASH.FILE_NAME   = WRK_FILE_NAME_1;                               28310000
 PARM_HASH.TIME_STAMP  = WRK_TIME_STAMP;                                28320000
 PARM_HASH.HASH_TOTAL  = WRK_HASH_TOTAL_1;                              28330000
 PARM_HASH.LENGTH_PARM = STG(PARM_HASH.TIME_STAMP) +                    28340000
                          STG(PARM_HASH.HASH_TOTAL);                    28350000
                                                                        28360000
 CALL RCBG50M (ADDR(TB_RCBV500),                                        28370000
               ADDR(TB_RCBV500_I),                                      28380000
               PTR_RETURN_AREA_BB,                                      28390000
               PTR_INT_AREA);                                           28400000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    28410000
 WHEN (0);                                                              28420000
 WHEN (4)                          /* WHEN NOT FOUND THEN INSERT  */    28430000
   DO;                                                                  28440000
     CALL RCBF50M (ADDR(TB_RCBV500),                                    28450000
                   ADDR(TB_RCBV500_I),                                  28460000
                   PTR_RETURN_AREA_BB,                                  28470000
                   PTR_INT_AREA);                                       28480000
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                28490000
     WHEN (0);                                                          28500000
     OTHERWISE                                                          28510000
       DO;                                                              28520000
         CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          28530000
                             'DB2',                                     28540000
                             '#046');                                   28550000
       END;                                                             28560000
     END;                                                               28570000
   END;                                                                 28580000
 OTHERWISE                                                              28590000
   DO;                                                                  28600000
     CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              28610000
                         'DB2',                                         28620000
                         '#047');                                       28630000
   END;                                                                 28640000
 END;                                                                   28650000
                                                                        28660000
                    /* SAVE HASH TOTAL RCBDCB2 IN PARAMETER RCB024   */ 28670000
 TB_RCBV500 = '';                                                       28680000
 TB_RCBV500_I = '';                                                     28690000
 PARM_HASH.NUMBER      = 'RCB024';                                      28700000
 PARM_HASH.PROC_ID     = WRK_PROC_ID;                                   28710000
 PARM_HASH.CTRYNO      = WRK_CTRYNO;                                    28720000
 PARM_HASH.FILE_NAME   = WRK_FILE_NAME_2;                               28730000
 PARM_HASH.TIME_STAMP  = WRK_TIME_STAMP;                                28740000
 PARM_HASH.HASH_TOTAL  = WRK_HASH_TOTAL_2;                              28750000
 PARM_HASH.LENGTH_PARM = STG(PARM_HASH.TIME_STAMP) +                    28760000
                          STG(PARM_HASH.HASH_TOTAL);                    28770000
                                                                        28780000
                                                                        28790000
 CALL RCBG50M (ADDR(TB_RCBV500),                                        28800000
               ADDR(TB_RCBV500_I),                                      28810000
               PTR_RETURN_AREA_BB,                                      28820000
               PTR_INT_AREA);                                           28830000
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    28840000
 WHEN (0);                                                              28850000
 WHEN (4)                          /* WHEN NOT FOUND THEN INSERT  */    28860000
   DO;                                                                  28870000
     CALL RCBF50M (ADDR(TB_RCBV500),                                    28880000
                   ADDR(TB_RCBV500_I),                                  28890000
                   PTR_RETURN_AREA_BB,                                  28900000
                   PTR_INT_AREA);                                       28910000
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                28920000
     WHEN (0);                                                          28930000
     OTHERWISE                                                          28940000
       DO;                                                              28950000
         CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          28960000
                             'DB2',                                     28970000
                             '#048');                                   28980000
       END;                                                             28990000
     END;                                                               29000000
   END;                                                                 29010000
 OTHERWISE                                                              29020000
   DO;                                                                  29030000
     CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              29040000
                         'DB2',                                         29050000
                         '#049');                                       29060000
   END;                                                                 29070000
 END;                                                                   29080000
                                                                        29090000
 END R819_END_INV;                                                      29100000
                                                                        29110000
1/*********************************************************************/29120000
 /*                                                                   */29130000
 /* MODULE NAME      :  R820_DETERMINE_SEQUENCE_KEY      (RC01141)    */29140000
 /*                                                                   */29150000
 /* DESCRIPTION      : DETERMINE SEQUENCE_KEY                         */29160000
 /*                                                                   */29170000
 /*********************************************************************/29180000
 R820_DETERMINE_SEQUENCE_KEY: PROC;                                     29190000
                                                                        29200000
 IF SK_HW < SK_SW                                                       29210000
 THEN                                                                   29220000
     PARM_INT_AREA.SEQUENCE_KEY = SK_HW;                                29230000
 ELSE                                                                   29240000
     PARM_INT_AREA.SEQUENCE_KEY = STRING(SK_SW_S);                      29250000
                                                                        29260000
 END R820_DETERMINE_SEQUENCE_KEY;                                       29270000
1/********************************************************************/ 29280000
 /*                                                                  */ 29290000
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 29300000
 /*                                                                  */ 29310000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 29320000
 /*                                                                  */ 29330000
 /********************************************************************/ 29340000
 R900_INIT_PROGRAM: PROC;                                               29350000
                                             /* INITIALISE POINTERS  */ 29360000
 PTR_INT_AREA       = ADDR(PARM_INT_AREA);                              29370000
 PTR_RETURN_AREA_BB = ADDR(RETURN_AREA_BB);                             29380000
 PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA);                              29390000
 PTR_RUN_DATE_AREA  = ADDR (RUN_DATE_AREA);                             29400000
                                             /* INITIALISE VARIABLES */ 29410000
 PARM_INT_AREA.MSG_AREA       = '';                                     29420000
 PARM_INT_AREA.ERR_AREA       = ' ';                                    29430000
 PARM_INT_AREA.MSG_REQUEST    = 'O';                                    29440000
 PARM_INT_AREA.MSG_TARGET     = 'F';                                    29450000
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB';                                  29460000
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                           29470000
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           29480000
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      29490000
 PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                        29500000
 PARM_INT_AREA.TXN_CODE       = '';                                     29510000
 PARM_INT_AREA.VERSION        = '';                                     29520000
 PARM_INT_AREA.PTR_PCB_IO     = NULL;                                   29530000
 PARM_INT_AREA.PTR_PCB_ALT    = NULL;                                   29540000
                                              /* OPEN MESSAGE FILE   */ 29550000
 CALL RCB0M1M(PTR_INT_AREA);                                            29560000
                                              /* RETR. SYSTEM DATE   */ 29570000
 CALL RCB0T1M(PTR_INT_AREA);                                            29580000
                                                                        29590000
                                                    /* SOC : RB01281 */ 29600000
 TB_RCBV500                   = '';                                     29610000
 TB_RCBV500_I                 = '';                                     29620000
 TB_RCBP67S.NUMBER            = 'RCB067';                 /* RB01298 */ 29630000
 /*TB_RCBP63S.NUMBER            = 'RCB063';               /* RB01298 */ 29640000
                                                                        29650000
 CALL RCBI50M ('U',                                                     29660000
               ADDR (TB_RCBV500),                                       29670000
               ADDR (TB_RCBV500_I),                                     29680000
               PTR_RETURN_AREA_BB,                                      29690000
               PTR_INT_AREA);                                           29700000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   29710000
   WHEN(0)                                                              29720000
                                                      /* SOC RB01298 */ 29730000
     PARM_RCBP67S = TB_RCBP67S;                                         29740000
                                                                        29750000
 /*  DO;                                                             */ 29760000
 /*   PARM_RCBP63S = TB_RCBP63S;                                     */ 29770000
 /*                                                                  */ 29780000
 /*  /* WHEN RCB063 PARAMETER VALUE IS BLANK THEN ABEND THE PROGRAM  */ 29790000
 /*                                                                  */ 29800000
 /*    F_WARRANTY_MA_STATUS_GEO                   = TRUE;            */ 29810000
 /*                                                                  */ 29820000
 /*   IF TB_RCBV500.PARAMETER_VALUE              = ' '               */ 29830000
 /*   THEN                                                           */ 29840000
 /*     DO;                                                          */ 29850000
 /*       PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';               */ 29860000
 /*       PARM_INT_AREA.MESSAGE_TYPE             = 'BU';             */ 29870000
 /*       PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0217';           */ 29880000
 /*       PARM_INT_AREA.MSG_VAR_CODE_6           = 'PN';             */ 29890000
 /*       PARM_INT_AREA.MSG_VAR_VALUE_6          =                   */ 29900000
 /*                                   TB_RCBV500.PARAMETER_NUMBER;   */ 29910000
 /*       PARM_INT_AREA.MSG_VAR_CODE_8           = 'PV';             */ 29920000
 /*       PARM_INT_AREA.MSG_VAR_VALUE_8          =                   */ 29930000
 /*                                      'RCB063 VALUE NOT FOUND  '; */ 29940000
 /*       CALL RCB0M1M (PTR_INT_AREA);                               */ 29950000
 /*       CALL RCBDCBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),        */ 29960000
 /*                        'DB2',                                    */ 29970000
 /*                        '#050');                                  */ 29980000
 /*     END;                                                         */ 29990000
 /*  END;                                                            */ 30000000
                                                      /* EOC RB01298 */ 30010000
   WHEN(4)                                                              30020000
     DO;                                                                30030000
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                30040000
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              30050000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 30060000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                30070000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      30080000
                                       TB_RCBV500.PARAMETER_NUMBER;     30090000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                30100000
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      30110000
                                       TB_RCBV500.PARAMETER_KEY;        30120000
        CALL RCB0M1M (PTR_INT_AREA);                                    30130000
        CALL RCBDCBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),             30140000
                         'DB2',                                         30150000
                        '#051');                                        30160000
     END;                                                               30170000
   OTHERWISE                                                            30180000
     DO;                                                                30190000
        CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           30200000
                    'DB2',                                              30210000
                    '#052');                                            30220000
     END;                                                               30230000
 END;                                                                   30240000
                                                    /* EOC : RB01281 */ 30250000
                                              /* RETRIEVE COUNTRY    */ 30260000
 CALL RCB019M (PTR_COUNTRY_AREA,                                        30270000
               PTR_INT_AREA);                                           30280000
                                                                        30290000
 SELECT;                                      /* ONLY ONE COUNTRY    */ 30300000
   WHEN(COUNTRY_AREA.COUNT_CTRY = 0)                                    30310000
     DO;                                                                30320000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            30330000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            30340000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          30350000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                        30360000
       CALL RCB0M1M (PTR_INT_AREA);                                     30370000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#050');                      30380000
     END;                                                               30390000
   WHEN(COUNTRY_AREA.COUNT_CTRY > 1)                                    30400000
     DO;                                                                30410000
       PARM_INT_AREA.COUNTRY_NUMBER    = '';                            30420000
       PARM_INT_AREA.MSG_VAR_CODES     = '';                            30430000
       PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                          30440000
       PARM_INT_AREA.MESSAGE_NUMBER    = '0189';                        30450000
       CALL RCB0M1M (PTR_INT_AREA);                                     30460000
       CALL RCBDCBM_ERROR (NULL, 'OTHER', '#051');                      30470000
     END;                                                               30480000
   OTHERWISE                                                            30490000
     DO;                                                                30500000
       WRK_PROC_ID  = COUNTRY_AREA.PROC_ID;                             30510000
       WRK_CTRYNO   = COUNTRY_AREA.CTRY_ARRAY(1).CTRYNO;                30520000
       WRK_PGR_TYPE = COUNTRY_AREA.CTRY_ARRAY(1).PGR_TYPE;              30530000
     END;                                                               30540000
 END;                                                                   30550000
                                                /* LOCK TABLES       */ 30560000
 CALL R001_LOCK_TABLES;                                                 30570000
                                                /* RETRIEVE RUN DATE */ 30580000
 RUN_DATE_AREA.PROC_ID   =  WRK_PROC_ID;                                30590000
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 30600000
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               30610000
                                                                        30620000
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       30630000
               PTR_INT_AREA);                                           30640000
                                                                        30650000
 IF RUN_DATE_AREA.RUN_DATE = ''         /* NO RUN DATE RCB001 FOUND  */ 30660000
 THEN                                                                   30670000
   DO;                                                                  30680000
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          30690000
   END;                                                                 30700000
 ELSE                                                                   30710000
   DO;                                                                  30720000
     WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                             30730000
   END;                                                                 30740000
                                                                        30750000
                                      /* WRITE MESSAGE WITH RUN DATE */ 30760000
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           30770000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 30780000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               30790000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30800000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 30810000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         30820000
 CALL RCB0M1M (PTR_INT_AREA);                                           30830000
                                                                        30840000
                           /* DETERMINE TIMESTAMP FOR HEADER + HASH  */ 30850000
 WRK_TIME_STAMP = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();           30860000
                                                    /* SOC : RB01281 */ 30870000
 TB_RCBV500                 = '';                                       30880000
 TB_RCBV500_I               = '';                                       30890000
                                                      /* SOC RB01298 */ 30900000
 /*TB_RCBP64S.NUMBER          = 'RCB064';                            */ 30910000
 /*TB_RCBP64S.CTRYNO          = WRK_CTRYNO;                          */ 30920000
 /*TB_RCBP64S.PGR_TYPE        = WRK_PGR_TYPE;                        */ 30930000
                                                                        30940000
 TB_RCBP71S.NUMBER          = 'RCB071';                                 30950000
 TB_RCBP71S.CTRYNO          = WRK_CTRYNO;                               30960000
                                                      /* EOC RB01298 */ 30970000
 CALL RCBI50M ('U',                                                     30980000
               ADDR (TB_RCBV500),                                       30990000
               ADDR (TB_RCBV500_I),                                     31000000
               PTR_RETURN_AREA_BB,                                      31010000
               PTR_INT_AREA);                                           31020000
 SELECT (RETURN_AREA_BB.RETURN_CODE);                                   31030000
   WHEN(0)                                                              31040000
     DO;                                                                31050000
                                                      /* SOC RB01298 */ 31060000
      PARM_RCBP71S = TB_RCBP71S, BY NAME;                               31070000
      F_WARRANTY_MA_STATUS = TRUE;                                      31080000
                                                                        31090000
 /*   PARM_RCBP64S = TB_RCBP64S, BY NAME;                            */ 31100000
 /*   IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1) ¬= ' ' |             */ 31110000
 /*      F_WARRANTY_MA_STATUS_GEO THEN                               */ 31120000
 /*      F_WARRANTY_MA_STATUS                    = TRUE;             */ 31130000
                                                      /* EOC RB01298 */ 31140000
     END;                                                               31150000
   WHEN(4)                                                              31160000
                                                      /* SOC RB01298 */ 31170000
     F_WARRANTY_MA_STATUS = FALSE;                                      31180000
                                                                        31190000
 /*  DO;                                                             */ 31200000
 /*   IF F_WARRANTY_MA_STATUS_GEO THEN                               */ 31210000
 /*      F_WARRANTY_MA_STATUS                    = TRUE;             */ 31220000
 /*  END;                                                            */ 31230000
                                                                        31240000
   OTHERWISE                                                            31250000
     DO;                                                                31260000
        CALL RCBDCBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           31270000
                    'DB2',                                              31280000
                    '#058');                                            31290000
     END;                                                               31300000
                                                      /* EOC RB01298 */ 31310000
 END;                                                                   31320000
                                                    /* EOC : RB01281 */ 31330000
 END R900_INIT_PROGRAM;                                                 31340000
1/********************************************************************/ 31350000
 /*                                                                  */ 31360000
 /* MODULE NAME      : R999_END_PROGRAM                              */ 31370000
 /*                                                                  */ 31380000
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 31390000
 /*                                                                  */ 31400000
 /********************************************************************/ 31410000
 R999_END_PROGRAM:  PROC;                                               31420000
                                    /* WRITE COUNT MESSAGES          */ 31430000
                                   /* RCBDCB1 WRITTEN                */ 31440000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     31450000
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0004';                   31460000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       31470000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'FL';                     31480000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = 'RCBDCB1';                31490000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C6';                     31500000
 WRK_PIC_10 = WRK_CNT_RCBDCB1;                                          31510000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = WRK_PIC_10;               31520000
 CALL RCB0M1M (PTR_INT_AREA);                                           31530000
                                                                        31540000
                                   /* RCBDCB2 WRITTEN                */ 31550000
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     31560000
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0004';                   31570000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       31580000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'FL';                     31590000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = 'RCBDCB2';                31600000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C6';                     31610000
 WRK_PIC_10 = WRK_CNT_RCBDCB2;                                          31620000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = WRK_PIC_10;               31630000
 CALL RCB0M1M (PTR_INT_AREA);                                           31640000
                                                                        31650000
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 31660000
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  31670000
 PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                                31680000
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    31690000
 CALL RCB0M1M (PTR_INT_AREA);                                           31700000
                                                                        31710000
                                    /* CLOSE MESSAGE FILE            */ 31720000
 PARM_INT_AREA.MSG_REQUEST = 'C';                                       31730000
 CALL RCB0M1M (PTR_INT_AREA);                                           31740000
                                                                        31750000
                                                                        31760000
 END R999_END_PROGRAM;                                                  31770000
1/********************************************************************/ 31780000
 /*                                                                  */ 31790000
 /* MODULE NAME      : RCBDCBM_ERROR                                 */ 31800000
 /*                                                                  */ 31810000
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 31820000
 /*                    THE INPUT VARIABLES                           */ 31830000
 /*                                                                  */ 31840000
 /********************************************************************/ 31850000
 RCBDCBM_ERROR: PROC             (PTR_ERROR,                            31860000
                         ERR_TYPE,                                      31870000
                         CALL_ID);                                      31880000
 DCL PTR_ERROR    PTR;                                                  31890000
 DCL ERR_TYPE      CHAR(8);                                             31900000
 DCL CALL_ID       CHAR(4);                                             31910000
 PARM_INT_AREA.PTR_ERROR          = PTR_ERROR;                          31920000
 PARM_INT_AREA.ERR_TYPE           = ERR_TYPE;                           31930000
 PARM_INT_AREA.CALL_ID            = CALL_ID;                            31940000
 CALL RCB0E1M (ADDR(PARM_INT_AREA));                                    31950000
 END RCBDCBM_ERROR;                                                     31960000
1/*******************************************************************/  31970000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  31980000
 /*******************************************************************/  31990000
 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */   32000000
 $DAIMOD (RCBDCBM);                      /* MODULE TO BE COMPILED   */  32010000
 /*******************************************************************/  32020000
 /* END OF ABR BLOCK                                                */  32030000
 /*******************************************************************/  32040000
 END RCBDCBM;                                                           32050000