1/* RCBDC2U - RETAIN/CCPF HW PO INFO USER EXIT                       */ 00021328
 /********************************************************************/ 00022008
 /*                                                                  */ 00030000
 /* MODULE NAME      : RCBDC2U                                       */ 00040000
 /*                                                                  */ 00050000
 /* PROGRAM NAME     : RCBDCBP                                       */ 00060000
 /*                                                                  */ 00070000
 /* LANGUAGE         : PLISQL                                        */ 00080000
 /*                                                                  */ 00090000
 /* TYPE             : LINKABLE MODULE                               */ 00100000
 /*                                                                  */ 00110000
 /* DESCRIPTION      : USER EXIT FOR HW PRODUCT INFORMATION          */ 00120000
 /*                    TO BE USED IN THE RETAIN/CCPF EXTRACT         */ 00130000
 /*                                                                  */ 00140000
 /* NOTE 1           : IF YOU WANT TO USE THIS EXIT BE SURE TO SET   */ 00150000
 /*                    SWITCH_USER_EXIT TO TRUE                      */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00180000
 /*                      - SWITCH_USER_EXIT                          */ 00190000
 /*                      - USER_INFO_HW                              */ 00201006
 /*                      - FILE_CCPF_HW                              */ 00210000
 /*                                                                  */ 00220000
 /* OUTPUT           : - PARAMETER INTERFACE (FROM CALLING MODULE)   */ 00230000
 /*                  : - FILE : RCB0M10                              */ 00240000
 /*                                                                  */ 00250000
 /* EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE              */ 00260000
 /*                                                                  */ 00270000
 /* MESSAGES         : ----                                          */ 00280000
 /*                                                                  */ 00290000
 /* DEPENDENCIES     : NONE                                          */ 00300000
 /*                                                                  */ 00310000
 /* FREQUENCY        : ----                                          */ 00320000
 /*                                                                  */ 00330000
 /*  MAINTENANCE LOG :                                               */ 00340000
 /*  ---------------                                                 */ 00350000
 /*                                                                  */ 00360000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00370000
 /*  --------------------------------------------------------------  */ 00380000
 /*  1993-04-23 | ----         | CEDS INITIAL DEVELOPMENT            */ 00390000
 /*  1993-11-30 | CED0014      | CHANGE FETCH INTO CALL SEE PTM 374  */ 00400000
 /*  1997-04-11 | PTM1036      | CORRECTED PROLOG                    */ 00410000
 /*  1997-04-29 | PTM0892      | REMOVE DECLARES UNUSED EXT.ENTRIES  */ 00420000
 /*                                                                  */ 00430000
 /*  1999-11-02 | RUN ONCE NORD| ADD NORDIC SPECIFIC CODE - BG       */ 00440000
 /*  1999-11-03 | ROSOUTH      | ADD SOUTHR SPECIFIC CODE - RG       */ 00450000
 /*  1999-11-04 | ROWEST       | ADD WEST   SPECIFIC CODE - RG       */ 00460000
 /*  1999-11-08 | RUN ONCE CNTL| ADD CENTRAL REGION RO CODE - SG     */ 00470000
 /*  1999-11-09 | RONORTH      | ADD REGION NORTH RO CODE   - SG     */ 00480000
 /*  2000-05-15 | CENTRAL      | '699' ADDED TO COUNTRY LIST - CP    */ 00490000
 /*  2007-11-21  | RB01242      | INCREASE LENGTH OF SERIAL NUMBER   */ 00500041
 /*  2011-08-05 | CEEMEA-16    |  R09-09-0221                        */ 00501041
 /********************************************************************/ 00510000
1RCBDC2U: PROC    (PTR_SWITCH_USER_EXIT,                                00520000
                   PTR_USER_INFO_HW,                                    00530000
                   PTR_FILE_CCPF_HW,                                    00540000
                   PTR_INT_AREA)                                        00550000
          REORDER;                                                      00560000
0              @O77O2Z: ENTRY;     DCL @SCHFIRST BIT(1)                 00570000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00580000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00590000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00600000
               EDIT    ('RCBDC2U  VERSION 1999.09.09' ,                 00610000
               ' 13H11.05      MIT DEM VERSIONS-ENTRY',                 00620000
               ' @O77O2Z',' ')     (SKIP,A,A,A,SKIP,A);                 00630000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00640000
               END;     /* ENDE DER VERSIONS-GRUPPE  */                 00650000
 DEFAULT RANGE (*)        STATIC;                                       00660000
1/********************************************************************/ 00670000
 /*  PARAMETERS                                                      */ 00680000
 /********************************************************************/ 00690000
 DCL PTR_SWITCH_USER_EXIT    PTR;                                       00700000
 DCL PTR_USER_INFO_HW        PTR;                                       00710000
 DCL PTR_FILE_CCPF_HW        PTR;                                       00720000
 DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 00730000
1/********************************************************************/ 00740000
 /*  EXTERNAL ENTRIES                                                */ 00750000
 /********************************************************************/ 00760000
 DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 00770000
 /********************************************************************/ 00780000
 /* ON ERROR CONDITIONS                                              */ 00790000
 /********************************************************************/ 00800000
 %INCLUDE (RCB0E0M);                                                    00810000
  END;                                                                  00820000
 /********************************************************************/ 00830000
 /*                                                                  */ 00840000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 00850000
 /* AND CALL THE ERROR ROUTINE:                                      */ 00860000
 /*                                                                  */ 00870000
 /*                                                                  */ 00880000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 00890000
 /*                                                                  */ 00900000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 00910000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 00920000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 00930000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 00940000
 /*                                                                  */ 00950000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 00960000
 /*                                                                  */ 00970000
 /********************************************************************/ 00980000
1/********************************************************************/ 00990000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01000000
 /********************************************************************/ 01010000
 DCL SWITCH_USER_EXIT BIT (1) BASED (PTR_SWITCH_USER_EXIT);             01020000
                                                                        01030000
 DCL 1 PARM_USER_INFO_HW      BASED (PTR_USER_INFO_HW),                 01040000
      %INCLUDE (RCBDC2S);;                                              01050000
                                                                        01060000
 DCL 1 PARM_FILE_CCPF_HW   BASED (PTR_FILE_CCPF_HW),                    01070000
      %INCLUDE (RCBDCBS2);,                                             01080000
      2 EXTRA_INFO,                                                     01090000
        3 FILLER      CHAR(37),                                         01100000
        3 OU_CODE     CHAR(07),                                         01110000
        3 RETAIN_FLAG CHAR(01);                                         01120000
                                                                        01130000
 DCL 1 PARM_INT_AREA          BASED (PTR_INT_AREA),                     01140000
      %INCLUDE (RCBZ01S);;                                              01150000
1/********************************************************************/ 01160000
 /* DATAS FOR ROWEST                                                 */ 01170000
 /********************************************************************/ 01180000
 /*-------------------------- FICHIERS ------------------------*/       01190000
 DCL BUREG       FILE RECORD SEQUENTIAL INPUT;                          01200000
 DCL 1 Z_LECT           ,                                               01210000
       2 BU       CHAR(3),                                              01220000
       2 FILLER1  CHAR(1),                                              01230000
       2 REG      CHAR(2),                                              01240000
       2 FILLER2  CHAR(74);                                             01250000
 DCL PREM_FOIS    BIT(1) INIT('1'B) STATIC    ;                         01260000
 DCL I            DEC FIXED (3) INIT(0)       ;                         01270000
 DCL IMAX         DEC FIXED (3) INIT(0) STATIC;                         01280000
 DCL 1 TAB_BUREG(999)                   STATIC,                         01290000
       2 BU       CHAR(3)                     ,                         01300000
       2 REG      CHAR(2)                     ;                         01310000
 /*------------------------------------------------------------*/       01320000
   DCL EOF_BUREG         BIT(1) INIT ('0'B);                            01330000
   DCL BU_TROUVE         BIT(1)            ;                            01340000
                                                                        01350000
1/********************************************************************/ 01360000
 /* DB2 TABLE STRUCTURES                                             */ 01370000
 /********************************************************************/ 01380000
 %INCLUDE RCBT0070;                        /* EXEC SQL DECLARE TBL */   01390000
 %INCLUDE RCBT0170;                                                     01400000
 %INCLUDE RCBT0190;                                                     01410000
 %INCLUDE RCBT0220;                                                     01420000
 %INCLUDE RCBT0240;                                                     01430000
 %INCLUDE RCBT0300;                                                     01440000
 /*---------------------------------------- USER DEFINED PROCESS     */ 01450000
0DCL 1 TB_RCBV070,                                                      01460000
      %INCLUDE (RCB070S);;                                              01470000
 DCL 1 TB_RCBV070_I,                                                    01480000
      %INCLUDE (RCB070SI);;                                             01490000
0DCL 1 TB_RCBV170,                                                      01500000
      %INCLUDE (RCB170S);;                                              01510000
 DCL 1 TB_RCBV170_I,                                                    01520000
      %INCLUDE (RCB170SI);;                                             01530000
0DCL 1 TB_RCBV190,                                                      01540000
      %INCLUDE (RCB190S);;                                              01550000
 DCL 1 TB_RCBV190_I,                                                    01560000
      %INCLUDE (RCB190SI);;                                             01570000
0DCL 1 TB_RCBV220,                                                      01580000
      %INCLUDE (RCB220S);;                                              01590000
 DCL 1 TB_RCBV220_I,                                                    01600000
      %INCLUDE (RCB220SI);;                                             01610000
0DCL 1 TB_RCBV240,                                                      01620000
      %INCLUDE (RCB240S);;                                              01630000
 DCL 1 TB_RCBV240_I,                                                    01640000
      %INCLUDE (RCB240SI);;                                             01650000
0DCL 1 TB_RCBV300,                                                      01660000
      %INCLUDE (RCB300S);;                                              01670000
 DCL 1 TB_RCBV300_I,                                                    01680000
      %INCLUDE (RCB300SI);;                                             01690000
 /*---------------------------------------- END USER DEFINED PROCESS */ 01700000
 /* REGION NORTH START   */                                             01710000
 DCL 1 TB_RCBV040,                                                      01720000
      %INCLUDE (RCB040S);;                                              01730000
 DCL 1 TB_RCBV040_I,                                                    01740000
      %INCLUDE (RCB040SI);;                                             01750000
 /* REGION NORTH END     */                                             01760000
1/********************************************************************/ 01770000
 /*  BIT SWITCHES                                                    */ 01780000
 /********************************************************************/ 01790000
0DCL TRUE       BIT (1) INIT ('1'B);                                    01800000
 DCL FALSE      BIT (1) INIT ('0'B);                                    01810000
 DCL ROW_FOUND  BIT (1) INIT ('0'B);              /* REGION NORTH    */ 01820000
0/********************************************************************/ 01830000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01840000
 /********************************************************************/ 01850000
0DCL 1 WORK_FIELDS,                                                     01860000
       3 WRK_LEVEL                FIXED BIN (15),                       01870000
       3 WRK_INDNULL              FIXED BIN (15),                       01880000
       3 WRK_TPMNT_VAL,                                                 01890000
        %INCLUDE (RCBZ99S);;                                            01900000
1/********************************************************************/ 01910000
 /*  BUILTIN FUNCTIONS                                               */ 01920000
 /********************************************************************/ 01930000
0DCL (ADDR,                                                             01940000
      NULL)   BUILTIN;                                                  01950000
1/********************************************************************/ 01960000
 /*  REGION NORTH - MISCELLANEOUS                                    */ 01970000
 /********************************************************************/ 01980000
 DCL WRK_CYCLE_TS  CHAR (26) INIT('');                                  01990000
 DCL TODAY CHAR(10);                                                    02000000
 DCL EFFDATE CHAR(10) INIT('');                                         02010000
 DCL ENDDATE CHAR(10) INIT('');                                         02020000
 DCL TEST_OU CHAR(7) INIT('');                                          02030000
1/********************************************************************/ 02040000
 /* DB2/SQL SQLCA                                                    */ 02050000
 /********************************************************************/ 02060000
0 EXEC SQL                                                              02070000
    INCLUDE SQLCA                                                       02080000
    ;                                                                   02090000
 /********************************************************************/ 02100000
 /***       LOKALE DECLARES CENTRAL REGION START                    ***/02110000
 /***       LOKALE DECLARES CENTRAL REGION START                    ***/02120000
 /***       LOKALE DECLARES CENTRAL REGION START                    ***/02130000
 /********************************************************************/ 02140000
 /*-------------------------------------------------------------------*/02150000
 /***   BIT                                                         ***/02160000
 /*-------------------------------------------------------------------*/02170000
   DCL  FIRST      BIT(1) EXTERNAL INIT ('1'B);  /*1. AUFRUF USER EXIT*/02180000
 /*-------------------------------------------------------------------*/02190000
 /***   ENTRIES                                                     ***/02200000
 /*-------------------------------------------------------------------*/02210000
   DCL  SUG400M    EXTERNAL ENTRY;          /* LADEN STRUKTURTABELLE  */02220000
   DCL  SUG401M    EXTERNAL ENTRY;          /* BINARY SEARCH STRUKTAB */02230000
   DCL  SUG410M    EXTERNAL ENTRY;          /* LADEN FILE AUS TAB 350 */02240000
 /*-------------------------------------------------------------------*/02250000
 /***   BUILTIN                                                     ***/02260000
 /*-------------------------------------------------------------------*/02270000
   DCL  SUBSTR     BUILTIN;                                             02280000
 /*-------------------------------------------------------------------*/02290000
 /***   FILES                                                       ***/02300000
 /*-------------------------------------------------------------------*/02310000
   DCL  SYSPRINT   FILE EXTERNAL PRINT;                                 02320000
 /*-------------------------------------------------------------------*/02330000
 /***   INCLUDES                                                    ***/02340000
 /*-------------------------------------------------------------------*/02350000
   DCL  1 ST_TB (*) CTL EXTERNAL,             /* STRUKTURTABELLE      */02360000
         % INCLUDE SUG400I;                                             02370000
 /*-------------------------------------------------------------------*/02380000
 /***   ARBEITSVARIABLE                                             ***/02390000
 /*-------------------------------------------------------------------*/02400000
   DCL  XREF       CHAR(4) EXTERNAL;          /*ZU SUCHENDE KST       */02410000
   DCL  I1         BIN FIXED(31) EXTERNAL;    /*TABELLENPLATZ V. XREF */02420000
                                                                        02430000
 /********************************************************************/ 02440000
 /***       LOKALE DECLARES CENTRAL REGION END                      ***/02450000
 /***       LOKALE DECLARES CENTRAL REGION END                      ***/02460000
 /***       LOKALE DECLARES CENTRAL REGION END                      ***/02470000
 /********************************************************************/ 02480000
                                                                        02490000
 /*---------------------------------------- USER DEFINED PROCESS   --*/ 02500000
 /*--  BEGIN DECLARES FOR NORDIC REGION                            --*/ 02510000
 /*---------------------------------------- USER DEFINED PROCESS   --*/ 02520000
 /* Y2K */                                                              02530000
 /* DCL (DATE,SUBSTR)            BUILTIN; */                            02540000
 DCL (DATETIME)               BUILTIN;                                  02550000
                                                                        02560000
 DCL ZCS_COUNTRY_SWEDEN       CHAR (03) INIT ('846');                   02570000
 DCL ZCS_HIGH_DATE            PIC  '99999999'  INIT (0);                02580000
 DCL ZCS_END_DATE             PIC  '99999999'  INIT (0);                02590000
 DCL 1 ZCS_DATE_1             DEFINED ZCS_END_DATE,                     02600000
      3 ZCS_END_YEAR          PIC  '9999',                              02610000
      3 ZCS_END_MON           PIC  '99',                                02620000
      3 ZCS_END_DAY           PIC  '99';                                02630000
 /* Y2K */                                                              02640000
 /* DCL ZCS_EFF_DATE             PIC  '999999'  INIT (0); */            02650000
 DCL ZCS_EFF_DATE             PIC  '99999999'  INIT (0);                02660000
 DCL 1 ZCS_DATE_2             DEFINED ZCS_EFF_DATE,                     02670000
      3 ZCS_EFF_YEAR          PIC  '9999',                              02680000
      3 ZCS_EFF_MON           PIC  '99',                                02690000
      3 ZCS_EFF_DAY           PIC  '99';                                02700000
 DCL ZCS_SEQ_NUMBER           CHAR (28);                     /*RB01242*/02710002
 DCL 1 ZCS_SEQ_NUMBER_DEF     DEFINED ZCS_SEQ_NUMBER,                   02720000
       3 ZCS_SEQ_NR1O2        CHAR (02),                                02730000
       3 ZCS_SEQ_NR           CHAR (05),                                02740016
       3 ZCS_FILLER           CHAR (21);                     /*RB01242*/02741023
                                                                        02750000
 DCL ZCF_COUNTRY_FINLAND      CHAR (03) INIT ('702');                   02760000
 DCL ZCF_HIGH_DATE            PIC  '99999999'  INIT (0);                02770000
 DCL ZCF_END_DATE             PIC  '99999999'  INIT (0);                02780000
 DCL 1 ZCF_DATE1              DEFINED ZCF_END_DATE,                     02790000
      3 ZCF_END_YEAR          PIC  '9999',                              02800000
      3 ZCF_END_MON           PIC  '99',                                02810000
      3 ZCF_END_DAY           PIC  '99';                                02820000
 /* Y2K */                                                              02830000
 /* DCL ZCF_EFF_DATE             PIC  '999999'  INIT (0); */            02840000
 DCL ZCF_EFF_DATE             PIC  '99999999'  INIT (0);                02850000
 DCL 1 ZCF_DATE2              DEFINED ZCF_EFF_DATE,                     02860000
      3 ZCF_EFF_YEAR          PIC  '9999',                              02870000
      3 ZCF_EFF_MON           PIC  '99',                                02880000
      3 ZCF_EFF_DAY           PIC  '99';                                02890000
 DCL ZCF_SEQ_NUMBER           CHAR (28);                     /*RB01242*/02900002
 DCL 1 ZCF_SEQ_NUMBER_DEF     DEFINED ZCF_SEQ_NUMBER,                   02910000
       3 ZCF_SEQ_NR1O2        CHAR (02),                                02920000
       3 ZCF_SEQ_NR           CHAR (05),                                02930023
       3 ZCF_FILLER           CHAR (21);                     /*RB01242*/02931023
                                                                        02940000
 DCL ZCD_COUNTRY_DENMARK      CHAR (03) INIT ('678');                   02950000
 DCL ZCD_HIGH_DATE            PIC  '99999999'  INIT (0);                02960000
 DCL ZCD_END_DATE             PIC  '99999999'  INIT (0);                02970000
 DCL 1 ZCD_DATE1              DEFINED ZCD_END_DATE,                     02980000
      3 ZCD_END_YEAR          PIC  '9999',                              02990000
      3 ZCD_END_MON           PIC  '99',                                03000000
      3 ZCD_END_DAY           PIC  '99';                                03010000
 /* Y2K */                                                              03020000
 /* DCL ZCD_EFF_DATE             PIC  '999999'  INIT (0);  */           03030000
 DCL ZCD_EFF_DATE             PIC  '99999999'  INIT (0);                03040000
 DCL 1 ZCD_DATE2              DEFINED ZCD_EFF_DATE,                     03050000
      3 ZCD_EFF_YEAR          PIC  '9999',                              03060000
      3 ZCD_EFF_MON           PIC  '99',                                03070000
      3 ZCD_EFF_DAY           PIC  '99';                                03080000
 DCL ZCD_SEQ_NUMBER           CHAR (28);                     /*RB01242*/03090002
 DCL 1 ZCD_SEQ_NUMBER_DEF     DEFINED ZCD_SEQ_NUMBER,                   03100000
       3 ZCD_SEQ_NR1O2        CHAR (02),                                03110000
       3 ZCD_SEQ_NR           CHAR (05),                                03120023
       3 ZCD_FILLER           CHAR (21);                     /*RB01242*/03121023
                                                                        03130000
 DCL ZCN_COUNTRY_NORWAY       CHAR (03) INIT ('806');                   03140000
 DCL ZCN_HIGH_DATE            PIC  '99999999'  INIT (0);                03150000
 DCL ZCN_END_DATE             PIC  '99999999'  INIT (0);                03160000
 DCL 1 ZCN_DATE1              DEFINED ZCN_END_DATE,                     03170000
      3 ZCN_END_YEAR          PIC  '9999',                              03180000
      3 ZCN_END_MON           PIC  '99',                                03190000
      3 ZCN_END_DAY           PIC  '99';                                03200000
 /* Y2K */                                                              03210000
 /* DCL ZCN_EFF_DATE             PIC  '999999'  INIT (0);  */           03220000
 DCL ZCN_EFF_DATE             PIC  '99999999'  INIT (0);                03230000
 DCL 1 ZCN_DATE2              DEFINED ZCN_EFF_DATE,                     03240000
      3 ZCN_EFF_YEAR          PIC  '9999',                              03250000
      3 ZCN_EFF_MON           PIC  '99',                                03260000
      3 ZCN_EFF_DAY           PIC  '99';                                03270000
 DCL ZCN_SEQ_NUMBER           CHAR (28);                    /*RB01242*/ 03280002
 DCL 1 ZCN_SEQ_NUMBER_DEF     DEFINED ZCN_SEQ_NUMBER,                   03290000
       3 ZCN_SEQ_NR1O2        CHAR (02),                                03300000
       3 ZCN_SEQ_NR           CHAR (05),                                03310023
       3 ZCN_FILLER           CHAR (21);                    /*RB01242*/ 03311023
 /*---------------------------------------- END USER DEFINED PROCESS */ 03320000
 /*--  END DECLARES FOR NORDIC REGION                              --*/ 03330000
 /*---------------------------------------- END USER DEFINED PROCESS */ 03340000
1/********************************************************************/ 03350000
 /*                 S T A R T   P R O C E S S I N G                  */ 03360000
 /********************************************************************/ 03370000
0                                        /* SET LEVEL AND MOD NAME   */ 03380000
0WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            03390000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     03400000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBDC2U';                     03410000
0                                        /* USER DEFINED PROCESS     */ 03420000
 SWITCH_USER_EXIT = TRUE;                                               03430000
                                                                        03440000
 SELECT (PARM_INT_AREA.COUNTRY_NUMBER) ;                                03450000
    WHEN ('846')      /*   SWEDEN   */                                  03460000
       DO ;                                                             03470000
          CALL C846_PROC;                                               03480000
       END ;                                                            03490000
    WHEN ('702')      /*   FINLAND  */                                  03500000
       DO ;                                                             03510000
          CALL C702_PROC;                                               03520000
       END ;                                                            03530000
    WHEN ('678')      /*   DENMARK  */                                  03540000
       DO ;                                                             03550000
          CALL C678_PROC;                                               03560000
       END ;                                                            03570000
    WHEN ('806')      /*   NORWAY   */                                  03580000
       DO ;                                                             03590000
          CALL C806_PROC;                                               03600000
       END ;                                                            03610000
   /* ROSOUTH START */                                                  03620000
   WHEN ('758') DO  ;          /* --- START COUNTRY "758" - 16/12/97 */ 03630000
    PARM_FILE_CCPF_HW.IODPMBO =                    /* IMP.  12/01/95 */ 03640000
         SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3);    /* MABO  12/01/95 */ 03650000
                                                   /*       12/01/95 */ 03660000
    IF PARM_FILE_CCPF_HW.IODPMBO = '   ' THEN      /* SET   12/01/95 */ 03670000
       PARM_FILE_CCPF_HW.IODPMBO = '000';          /* ZERO  12/01/95 */ 03680000
                                                   /*       12/01/95 */ 03690000
    /****************************************************** 12/01/95 */ 03700000
    /* SET CE REGION BY DEFAULT                            16/01/98 */  03710000
    /****************************************************** 12/01/95 */ 03720000
                                                   /*       12/01/95 */ 03730000
    PARM_FILE_CCPF_HW.IODPRCE = '61';              /* VAR. -29/06/98 */ 03740000
                                                   /*       12/01/95 */ 03750000
   END  ;                      /* --- END COUNTRY "758" --- 16/12/97 */ 03760000
   WHEN ('726') DO  ;          /* --- START COUNTRY "726" - 22/07/99 */ 03770000
    PARM_FILE_CCPF_HW.IODPMBO =                    /* IMP.  22/07/99 */ 03780000
         SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3);    /* MABO  22/07/99 */ 03790000
                                                   /*       22/07/99 */ 03800000
    IF PARM_FILE_CCPF_HW.IODPMBO = '   ' THEN      /* SET   22/07/99 */ 03810000
       PARM_FILE_CCPF_HW.IODPMBO = '000';          /* ZERO  22/07/99 */ 03820000
                                                   /*       22/07/99 */ 03830000
    PARM_FILE_CCPF_HW.IODPRCE = '64';              /* VAR. -22/07/99 */ 03840000
                                                   /*       22/07/99 */ 03850000
   END  ;                      /* --- END COUNTRY "726" --- 16/12/99 */ 03860000
   WHEN ('666') DO  ;          /* --- START COUNTRY "666" - 22/07/99 */ 03870000
    PARM_FILE_CCPF_HW.IODPMBO =                    /* IMP.  22/07/99 */ 03880000
         SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3);    /* MABO  22/07/99 */ 03890000
                                                   /*       22/07/99 */ 03900000
    IF PARM_FILE_CCPF_HW.IODPMBO = '   ' THEN      /* SET   22/07/99 */ 03910000
       PARM_FILE_CCPF_HW.IODPMBO = '000';          /* ZERO  22/07/99 */ 03920000
                                                   /*       22/07/99 */ 03930000
    PARM_FILE_CCPF_HW.IODPRCE = '64';              /* VAR. -22/07/99 */ 03940000
                                                   /*       22/07/99 */ 03950000
   END  ;                      /* --- END COUNTRY "666" --- 16/12/99 */ 03960000
   WHEN ('755') DO  ;          /* --- START COUNTRY "755" - 22/07/99 */ 03970000
    PARM_FILE_CCPF_HW.IODPMBO =                    /* IMP.  22/07/99 */ 03980000
         SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3);    /* MABO  22/07/99 */ 03990000
                                                   /*       22/07/99 */ 04000000
    IF PARM_FILE_CCPF_HW.IODPMBO = '   ' THEN      /* SET   22/07/99 */ 04010000
       PARM_FILE_CCPF_HW.IODPMBO = '000';          /* ZERO  22/07/99 */ 04020000
                                                   /*       22/07/99 */ 04030000
    PARM_FILE_CCPF_HW.IODPRCE = '56';              /* VAR. -22/07/99 */ 04040000
                                                   /*       22/07/99 */ 04050000
   END  ;                      /* --- END COUNTRY "755" --- 16/12/99 */ 04060000
   WHEN ('862') DO  ;          /* --- START COUNTRY "862" - 22/07/99 */ 04070000
    PARM_FILE_CCPF_HW.IODPMBO =                    /* IMP.  22/07/99 */ 04080000
         SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3);    /* MABO  22/07/99 */ 04090000
                                                   /*       22/07/99 */ 04100000
    IF PARM_FILE_CCPF_HW.IODPMBO = '   ' THEN      /* SET   22/07/99 */ 04110000
       PARM_FILE_CCPF_HW.IODPMBO = '000';          /* ZERO  22/07/99 */ 04120000
                                                   /*       22/07/99 */ 04130000
    PARM_FILE_CCPF_HW.IODPRCE = '68';              /* VAR. -22/07/99 */ 04140000
                                                   /*       22/07/99 */ 04150000
   END  ;                      /* --- END COUNTRY "862" --- 16/12/99 */ 04160000
   WHEN ('838') DO  ;          /* --- START COUNTRY "838" - 12/01/99 */ 04170000
       IF PARM_USER_INFO_HW.PRODUCT_TYPE_HW = '' THEN DO;/* 12/01/95 */ 04180000
          IF PARM_USER_INFO_HW.OU_CODE = '' THEN         /* 12/01/95 */ 04190000
             PARM_FILE_CCPF_HW.IODPMBO='100';            /* 12/01/95 */ 04200000
          ELSE DO ;                                      /* 12/01/95 */ 04210000
             SELECT (SUBSTR(PARM_USER_INFO_HW.OU_CODE,3,2));            04220000
                WHEN('05','13','16','19','28','34','37',                04230000
                     '40','45','47','49')                               04240000
                  PARM_FILE_CCPF_HW.IODPMBO= '100';                     04250000
                WHEN('02','03','07','08','12','17','22',                04260000
                     '25','30','43','44','46','50')                     04270000
                  PARM_FILE_CCPF_HW.IODPMBO= '200';                     04280000
                WHEN('01','09','15','20','24','26','27',                04290000
                    '31','32','33','36','39','42','48')                 04300000
                  PARM_FILE_CCPF_HW.IODPMBO= '300';                     04310000
                WHEN('04','06','10','11','14','18','21','23','29',      04320000
                    '35','38','41')                                     04330000
                  PARM_FILE_CCPF_HW.IODPMBO= '400';                     04340000
                OTHERWISE                                               04350000
                  PARM_FILE_CCPF_HW.IODPMBO= '100';                     04360000
             END;                                                       04370000
          END;                                                          04380000
       END;                                                             04390000
       ELSE DO ;                                                        04400000
          IF PARM_USER_INFO_HW.OU_CODE = '' THEN DO ;                   04410000
             PARM_FILE_CCPF_HW.IODPMBO='100';                           04420000
             PARM_USER_INFO_HW.OU_CODE = PARM_FILE_CCPF_HW.IODPMBO;     04430000
          END;                                                          04440000
          ELSE DO ;                                                     04450000
             SELECT (SUBSTR(PARM_USER_INFO_HW.OU_CODE,3,2));            04460000
                WHEN('05','13','16','19','28','34','37',                04470000
                     '40','45','47','49')                               04480000
                  PARM_FILE_CCPF_HW.IODPMBO= '100';                     04490000
                WHEN('02','03','07','08','12','17','22',                04500000
                     '25','30','43','44','46','50')                     04510000
                  PARM_FILE_CCPF_HW.IODPMBO= '200';                     04520000
                WHEN('01','09','15','20','24','26','27',                04530000
                     '31','32','33','36','39','42','48')                04540000
                  PARM_FILE_CCPF_HW.IODPMBO= '300';                     04550000
                WHEN('04','06','10','11','14','18','21','23','29',      04560000
                     '35','38','41')                                    04570000
                  PARM_FILE_CCPF_HW.IODPMBO= '400';                     04580000
                OTHERWISE                                               04590000
                  PARM_FILE_CCPF_HW.IODPMBO= '100';                     04600000
             END;                                                       04610000
          END;                                                          04620000
       END;                                                             04630000
       PARM_FILE_CCPF_HW.IODPRCE = '78' ;                /* 12/01/95 */ 04640000
   END  ;                      /* --- END COUNTRY "838" --- 12/01/99 */ 04650000
   WHEN ('822') DO  ;          /* --- START COUNTRY "822" - 12/01/99 */ 04660000
       PARM_FILE_CCPF_HW.IODPRCE = '77';                 /* 12/01/95 */ 04670000
       PARM_FILE_CCPF_HW.IODPMBO = '001';                /* 12/01/95 */ 04680000
                                                         /* 12/01/95 */ 04690000
   END  ;                      /* --- END COUNTRY "822" --- 12/01/99 */ 04700000
   WHEN ('624') DO  ;          /* --- ROWEST                         */ 04710000
   IF SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,1) ¬= ' ' THEN                 04720000
      PARM_FILE_CCPF_HW.IODPMBO = SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,1) 04730000
                                  || '00' ;                             04740000
   /* PARM_FILE_CCPF_HW.IODPTRN = SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,3) 04750000
   */                                                                   04760000
      PARM_FILE_CCPF_HW.IODPRCE = '76';                                 04770000
                                                                        04780000
   END  ;                      /* --- END COUNTRY "624"              */ 04790000
   WHEN ('706') DO  ;          /* --- ROWEST                         */ 04800000
     CALL C706_PROCEDURE ;                                              04810000
   END  ;                      /* --- END COUNTRY "624"              */ 04820000
                                                                        04830000
 /* CENTRAL REGION START   */                                           04840000
                                                                        04850000
   WHEN ('724') DO;          /**** START COUNTRY 724 = DEUTSCHLAND ****/04860000
                                                                        04870000
      IF FIRST = '1'B                                                   04880000
         THEN DO;                                                       04890000
            FIRST = '0'B;                 /* BEIM 1. AUFRUF USER EXIT */04900000
            CALL SUG400M;                 /*-> LADEN STRUKTURTABELLE  */04910000
            CALL SUG410M;                 /*-> LADEN FILE AUS TAB.350 */04920000
         END;                                                           04930000
                                                                        04940000
      PARM_FILE_CCPF_HW.IODPRCE = '80';     /*STANDARDZUWEISUNG REGION*/04950000
                                                                        04960000
      XREF = SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,4);                     04970000
      CALL SUG401M;                       /*BINARY SEARCH AUF STRUKTAB*/04980000
                                                                        04990000
      IF XREF = ST_TB.REF(I1)                           /*KST GEFUNDEN*/05000000
         THEN DO;                                                       05010000
                                                                        05020000
            PARM_FILE_CCPF_HW.CODPLBU = ST_TB.OULVL(I1);   /*OU LEVEL */05030000
                                                                        05040000
            SELECT;                                                     05050000
                                                                        05060000
               WHEN (PARM_FILE_CCPF_HW.CODPLBU = '3')      /*TERRITORY*/05070000
                DO;                                                     05080000
                  PARM_FILE_CCPF_HW.IODPTRN =                           05090000
                              SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,3);    05100000
                  PARM_FILE_CCPF_HW.IODPMBO =                           05110000
                                         SUBSTR(ST_TB.SUBO(I1),2,3);    05120000
                END;                                                    05130000
                                                                        05140000
               WHEN (PARM_FILE_CCPF_HW.CODPLBU > '3')                   05150000
                DO;                                                     05160000
                  PARM_FILE_CCPF_HW.IODPTRN = '000';                    05170000
                  PARM_FILE_CCPF_HW.IODPMBO =                           05180000
                              SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,3);    05190000
                END;                                                    05200000
                                                                        05210000
               OTHER;                                                   05220000
            END;                                          /*END SELECT*/05230000
         END;                                       /*END KST GEFUNDEN*/05240000
   END;                      /**** END   COUNTRY 724 = DEUTSCHLAND ****/05250000
 /*********************************************************************/05260000
       /**** SWITZERLAND (848):                                    ****/05270000
       /****  ZUM FUELLEN DER FOLGENDEN FELDER WIRD DER OU-CODE    ****/05280000
       /****  AUS DEM CEDS-HARDWARE-RECORD (T170) GENOMMEN         ****/05290000
       /****  (PARM_USER_INFO_HW.OU_CODE):                         ****/05300000
       /****  - FELD IOLCREG WIRD AUS   SUBSTR(OU_CODE,2,3)        ****/05310000
       /****    NACH FOLGENDER LOGIK GEFUELLT:                     ****/05320000
       /****    . WENN DIESER WERT 211 ODER 212, DANN WIRD DER     ****/05330000
       /****      WERT '89' EINGESTELLT,                           ****/05340000
       /****    . WENN DIESER WERT 252, DANN WIRD DER WERT '52'    ****/05350000
       /****      EINGESTELLT                                      ****/05360000
       /****    . WENN DIESER WERT 292, DANN WIRD DER WERT '92'    ****/05370000
       /****      EINGESTELLT                                      ****/05380000
       /****    . ANSONSTEN WIRD DER WERT '89' EINGESTELLT.        ****/05390000
       /****  - FELD CODPLBU HAT DEN WERT BLANK ALS KONSTANTE.     ****/05400000
       /****  - FELD IODPMBO WIRD MIT SUBSTR(OU_CODE,2,3) GEFUELLT.****/05410000
       /****  - FELD IODPTRN WIRD MIT SUBSTR(OU_CODE,5,1) || "  "  ****/05420000
       /****    (KONKATINIERT MIT ZWEI BLANKS) GEFUELLT.           ****/05430000
                                                                        05440000
   WHEN ('848') DO;          /**** START COUNTRY 848 = SWITZERLAND ****/05450000
                                                                        05460000
                           /* FILL CUSTOMER ENGINEERING REGION NUMBER */05470000
      SELECT (SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,3));                   05480000
        WHEN ('211','212')                                              05490000
             PARM_FILE_CCPF_HW.IODPRCE =    '89';                       05500000
        WHEN ('252')                                                    05510000
             PARM_FILE_CCPF_HW.IODPRCE =    '52';                       05520000
        WHEN ('292')                                                    05530000
             PARM_FILE_CCPF_HW.IODPRCE =    '92';                       05540000
        OTHERWISE                                                       05550000
             PARM_FILE_CCPF_HW.IODPRCE =    '89';                       05560000
      END;           /* END SELECT */                                   05570000
                           /* FILL IN CE BUSINESS UNIT LEVEL          */05580000
      PARM_FILE_CCPF_HW.CODPLBU = ' ';                                  05590000
                           /* FILL IN CE MACHINE BRANCH OFFICE NUMBER */05600000
      PARM_FILE_CCPF_HW.IODPMBO =                                       05610000
                       SUBSTR(PARM_USER_INFO_HW.OU_CODE,3,3);           05620005
                           /* FILL IN IBM TERRITORY NUMBER            */05630000
      PARM_FILE_CCPF_HW.IODPTRN =                                       05640000
                       SUBSTR(PARM_USER_INFO_HW.OU_CODE,5,1) || '  ';   05650000
   END;                      /**** END   COUNTRY 848 = SWITZERLAND ****/05660000
 /*********************************************************************/05670000
       /**** AUSTRIA (618):                                        ****/05680000
       /****  ZUM FUELLEN DER FOLGENDEN FELDER WIRD DER OU-CODE    ****/05690000
       /****  AUS DEM CEDS-HARDWARE-RECORD (T170) GENOMMEN         ****/05700000
       /****  (PARM_USER_INFO_HW.OU_CODE):                         ****/05710000
       /****  - FELD IOLCREG WIRD MIT DER KONSTANTE '86' GEFUELLT. ****/05720000
       /****  - FELD IODPMBO WIRD MIT  '0' || SUBSTR(OU_CODE,2,2)  ****/05730000
       /****    GEFUELLT.                                          ****/05740000
       /****  - FELD IODPTRN WIRD MIT  '0' || SUBSTR(OU_CODE,2,2)  ****/05750000
       /****    GEFUELLT. WENN ABER  SUBSTR(OU_CODE = '010' IST,   ****/05760000
       /****    DANN WIRD DAS FELD MIT SUBSTR(OU_CODE,2,3)         ****/05770000
       /****    GEFUELLT.                                          ****/05780000
                                                                        05790000
   WHEN ('618') DO;          /**** START COUNTRY 618 = AUSTRIA     ****/05800000
                           /* FILL CUSTOMER ENGINEERING REGION NUMBER */05810000
      PARM_FILE_CCPF_HW.IODPRCE =    '86';                              05820000
                                                                        05830000
                           /* FILL IN CE MACHINE BRANCH OFFICE NUMBER */05840000
      PARM_FILE_CCPF_HW.IODPMBO =                                       05850000
                       '0' || SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,2);    05860000
                                                                        05870000
                           /* FILL IN IBM TERRITORY NUMBER            */05880000
      IF SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3) = '010'                  05890000
         THEN                                                           05900000
            PARM_FILE_CCPF_HW.IODPTRN =                                 05910000
                       SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,3);           05920000
         ELSE                                                           05930000
            PARM_FILE_CCPF_HW.IODPTRN =                                 05940000
                       '0' || SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,2);    05950000
                                                                        05960000
                           /* FILL IN CE BUSINESS UNIT LEVEL          */05970000
      PARM_FILE_CCPF_HW.CODPLBU = ' ';                                  05980000
                                                                        05990000
   END;                      /**** END   COUNTRY 618 = AUSTRIA     ****/06000000
 /*********************************************************************/06010000
       /**** CER-COUNTRIES:                                        ****/06020000
       /**** - FELD IODPRCE WIRD MIT DER KONSTANTE '88' GEFUELLT.  ****/06030000
       /**** - FELD IODPMBO WIRD MIT DER LAENDERNUMMER ALS         ****/06040000
       /****   KONSTANTE GEFUELLT.                                 ****/06050000
       /**** - FELD IODPTRN WIRD MIT DER LAENDERNUMMER ALS         ****/06060000
       /**** - KONSTANTE GEFUELLT.                                 ****/06070000
                                                                        06080000
                             /**** START CER COUNTRIES             ****/06090000
 WHEN ('603','607','626','644','651','668','693','694','695','699',     06100036
      '704','705','707','708','740','741','787','820','821','826','889')06110000
      DO;                                                               06120000
                                                                        06130000
                           /* FILL CUSTOMER ENGINEERING REGION NUMBER */06140000
      PARM_FILE_CCPF_HW.IODPRCE =    '88';                              06150000
                                                                        06160000
                           /* FILL IN CE MACHINE BRANCH OFFICE NUMBER */06170000
      PARM_FILE_CCPF_HW.IODPMBO = PARM_INT_AREA.COUNTRY_NUMBER;         06180000
                                                                        06190000
                           /* FILL IN IBM TERRITORY NUMBER            */06200000
    PARM_FILE_CCPF_HW.IODPTRN = PARM_INT_AREA.COUNTRY_NUMBER;           06210034
    END;                                                                06220138
                                                                        06220241
   /*** CEEMEA16 - R09-0221 START ***/                                  06220341
                                                                        06221134
  WHEN('610','635','782','851','857','883')                             06223037
     DO;                                                                06224034
     PARM_FILE_CCPF_HW.IODPMBO = PARM_INT_AREA.COUNTRY_NUMBER;          06224137
     PARM_FILE_CCPF_HW.IODPTRN = '01';                                  06225034
     PARM_FILE_CCPF_HW.IODPRCE =    '01';                               06225135
     END;                                                               06226034
 WHEN('642','729')                                                      06227037
     DO;                                                                06228034
     PARM_FILE_CCPF_HW.IODPMBO = PARM_INT_AREA.COUNTRY_NUMBER;          06228137
     PARM_FILE_CCPF_HW.IODPTRN = '76';                                  06229034
     PARM_FILE_CCPF_HW.IODPRCE =    '76';                               06229135
     END;                                                               06229234
 WHEN('677','767','823','832')                                          06229337
     DO;                                                                06229434
     PARM_FILE_CCPF_HW.IODPMBO = PARM_INT_AREA.COUNTRY_NUMBER;          06229537
     PARM_FILE_CCPF_HW.IODPTRN = '65';                                  06229634
     PARM_FILE_CCPF_HW.IODPRCE =    '65';                               06229735
     END;                                                               06229834
 WHEN('725','808','865')                                                06230337
     DO;                                                                06230434
     PARM_FILE_CCPF_HW.IODPMBO = PARM_INT_AREA.COUNTRY_NUMBER;          06230537
     PARM_FILE_CCPF_HW.IODPTRN = '67';                                  06230634
     PARM_FILE_CCPF_HW.IODPRCE =    '67';                               06230735
     END;                                                               06230834
 WHEN('764','804')                                                      06230937
     DO;                                                                06231034
     PARM_FILE_CCPF_HW.IODPMBO = PARM_INT_AREA.COUNTRY_NUMBER;          06231137
     PARM_FILE_CCPF_HW.IODPTRN = '51';                                  06231234
     PARM_FILE_CCPF_HW.IODPRCE =    '51';                               06231335
     END;                                                               06231434
                                                                        06231541
     /*** CEEMEA16 - R09-0221 END   ***/                                06231641
                                                                        06231741
                       /* FILL IN CE BUSINESS UNIT LEVEL          */    06232034
 /**  PARM_FILE_CCPF_HW.CODPLBU = ' ';    >> NO ACTION DEFINED <<     */06240000
                                                                        06250000
                             /**** END   CER COUNTRIES             ****/06260037
                                                                        06270000
 /* CENTRAL REGION END  */                                              06280000
                                                                        06290000
 /* REGION NORTH START  */                                              06300000
                                                                        06310000
   WHEN('788') DO;                                                      06320000
                                                                        06330000
         PARM_FILE_CCPF_HW.IODPRCE = '87';                              06340000
         PARM_FILE_CCPF_HW.IODPMBO =                                    06350000
                  SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3);                06360000
         PARM_FILE_CCPF_HW.IODPTRN =                                    06370000
                  SUBSTR(PARM_USER_INFO_HW.OU_CODE,4,1) || '  ';        06380000
   END;                                               /* END DO       */06390000
                                                                        06400000
   OTHERWISE               /* NO OTHER ACTIONS                        */06410000
     DO ;                                                               06420000
     END ;                                                              06430000
 END ;   /*   SELECT COUNTRY NUMBER   */                                06440000
                                                                        06450000
1/*-------------------------------------------------------------------*/06460000
 /* C846_PROC                                                         */06470000
 /* CALLED FROM USER DEFINED PROCESS FOR SWEDEN                       */06480000
 /*-------------------------------------------------------------------*/06490000
 C846_PROC: PROCEDURE;                                                  06500000
0/*------------------------------------------------------------------*/ 06510000
 /*   @PPNA CURSOR F@R ADRESS TABELL                                 */ 06520000
 /*------------------------------------------------------------------*/ 06530000
    ZCS_SEQ_NR1O2 = '00';                                               06540000
    ZCS_SEQ_NR = PARM_FILE_CCPF_HW.IHSINBR;                             06550000
    ZCS_FILLER = '';                                    /*RB01242*/     06551023
                                                                        06560000
    CALL C846_OPEN_ADDR_CURSOR;                                         06570000
0/*------------------------------------------------------------------*/ 06580000
 /*   L#S ALLA AKTUELLA RECORD I ADDR_LINE TABELL VIA CURSOR         */ 06590000
 /*------------------------------------------------------------------*/ 06600000
                                                                        06610000
    CALL C846_READ_ADDR_CURSOR;                                         06620000
                                                                        06630000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      06640000
      WHEN (0)                                                          06650000
      DO;                                                               06660000
          PARM_FILE_CCPF_HW.IODPMBO = ' ';                              06670000
                                                                        06680000
          DO WHILE (SQLCA.SQLCODE = 0);                                 06690000
                                                                        06700000
             ZCS_EFF_YEAR = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,1,4);      06710000
             ZCS_EFF_MON = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,6,2);       06720000
             ZCS_EFF_DAY = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,9,2);       06730000
             ZCS_END_YEAR = SUBSTR(TB_RCBV170.END_DATE,1,4);            06740000
             ZCS_END_MON = SUBSTR(TB_RCBV170.END_DATE,6,2);             06750000
             ZCS_END_DAY = SUBSTR(TB_RCBV170.END_DATE,9,2);             06760000
                                                                        06770000
 /* Y2K */                                                              06780000
 /*          IF ZCS_END_DATE > DATE &                     */            06790000
 /*             ZCS_EFF_DATE < DATE THEN                  */            06800000
             IF ZCS_END_DATE > SUBSTR(DATETIME,1,8) &                   06810000
                ZCS_EFF_DATE < SUBSTR(DATETIME,1,8) THEN                06820000
                DO;                                                     06830000
                   PARM_FILE_CCPF_HW.IODPMBO =                          06840000
                            SUBSTR(TB_RCBV170.OU_CODE,1,3);             06850000
                   PARM_FILE_CCPF_HW.IODPRCE = '59';                    06860000
                   SUBSTR(PARM_FILE_CCPF_HW.IODPTRN,1,1) =              06870000
                            SUBSTR(TB_RCBV170.OU_CODE,4,1);             06880000
                   SUBSTR(PARM_FILE_CCPF_HW.IODPTRN,2,1) =              06890000
                            SUBSTR(TB_RCBV170.OU_CODE,7,1);             06900000
                   IF PARM_FILE_CCPF_HW.IODPMBO = ' ' THEN              06910000
                      PARM_FILE_CCPF_HW.IODPMBO = '130';                06920000
                                                    /* DEFAULTV#RDE  */ 06930000
                END;                                                    06940000
             ELSE                                                       06950000
                DO;                                                     06960000
                                                                        06961015
                   PARM_FILE_CCPF_HW.IODPMBO = '130'; /* DEFAULTV#RDE */06970000
                   PARM_FILE_CCPF_HW.IODPRCE = '59';                    06980000
                END;                                                    06990000
                                                                        07000000
             CALL C846_READ_ADDR_CURSOR;                                07010000
                                                                        07020000
          END;                                                          07030000
                                                                        07040000
      END;                                                              07050000
                                                                        07060000
      WHEN (100)                                                        07070000
  /*     DO; */                                                         07080000
                                                                        07090000
           IF PARM_FILE_CCPF_HW.IODPMBO = ' ' THEN                      07100000
              DO;                                                       07110000
                 PARM_FILE_CCPF_HW.IODPMBO = '130'; /* DEFAULTV#RDE */  07120000
                 PARM_FILE_CCPF_HW.IODPRCE = '59';                      07130000
              END;                                                      07140000
         END;                                                           07150000
                                                                        07160000
    CALL C846_CLOSE_ADDR_CURSOR;        /* ST#NG CURSOR */              07170000
 END C846_PROC;                                                         07180000
                                                                        07190000
1C846_OPEN_ADDR_CURSOR: PROC;                                           07200000
0/*******************************************************************/  07210000
 /* FUNCTION:  DEKLARERA OCH @PPNA CURSOR F@R ADDR_LINE TABELLEN    */  07220000
 /*            SELEKTERA ADRESSER F@R COUNTRY, CUSTOMER OCH ADRESSNR*/  07230000
 /*******************************************************************/  07240000
    EXEC SQL                                                            07250000
         DECLARE ADDR_CURSOR_S CURSOR FOR                               07260000
         SELECT                                                         07270000
             OU_CODE,                                                   07280000
             EFFECTIVE_DATE,                                            07290000
             END_DATE                                                   07300000
         FROM RCBT0170_OU_HW                                            07310000
         WHERE PRODUCT_TYPE = :PARM_FILE_CCPF_HW.CSLMTYP AND            07320000
               ORIGIN       = :PARM_FILE_CCPF_HW.IOLCPLM AND            07330000
               SEQUENCE_NUMBER = :ZCS_SEQ_NUMBER AND                    07340000
               COUNTRY_NUMBER  = :ZCS_COUNTRY_SWEDEN                    07350000
         FOR FETCH ONLY;                                                07360000
                                                                        07370000
    EXEC SQL                            /* OPEN CURSOR           */     07380000
         OPEN ADDR_CURSOR_S;                                            07390000
                                                                        07400000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      07410000
         WHEN(0);                   /* TEST FOR VALID SQL CODES */      07420000
         OTHERWISE                     /* NO VALID SQL CODE ABEND  */   07430000
         DO;                                                            07440000
           CALL C846_CLOSE_ADDR_CURSOR;                                 07450000
           PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                      07460000
           PARM_INT_AREA.ERR_TYPE  = 'DB2';                             07470000
           PARM_INT_AREA.CALL_ID   = '#001';                            07480000
           CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */        07490000
         END;                                                           07500000
    END;                                                                07510000
 END C846_OPEN_ADDR_CURSOR;                                             07520000
                                                                        07530000
1C846_READ_ADDR_CURSOR: PROC;                                           07540000
0/*********************************************************************/07550000
 /* FUNCTION    DEKLARERA OCH @PPNA CURSER F¦R ADDR_LINE TABLE        */07560000
 /*             SELECTERA ALLA ADRESSRADER F@R DENNA                  */07570000
 /*********************************************************************/07580000
                                                                        07590000
    EXEC SQL                                                            07600000
         FETCH ADDR_CURSOR_S                                            07610000
         INTO                                                           07620000
           :TB_RCBV170.OU_CODE,                                         07630000
           :TB_RCBV170.EFFECTIVE_DATE,                                  07640000
           :TB_RCBV170.END_DATE;                                        07650000
                                                                        07660000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      07670000
       WHEN(0);                    /* TEST FOR VALID SQL CODES */       07680000
       WHEN(100);                                                       07690000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     07700000
       DO;                                                              07710000
         CALL C846_CLOSE_ADDR_CURSOR;                                   07720000
         PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                        07730000
         PARM_INT_AREA.ERR_TYPE  = 'DB2';                               07740000
         PARM_INT_AREA.CALL_ID   = '#003';                              07750000
         CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */          07760000
       END;                                                             07770000
    END;                                                                07780000
 END C846_READ_ADDR_CURSOR;                                             07790000
                                                                        07800000
1C846_CLOSE_ADDR_CURSOR: PROC;                                          07810000
0/*********************************************************************/07820000
 /* FUNCTION    ST#NGA CURSER F¦R ADDR_LINE TABLE                     */07830000
 /*                                                                   */07840000
 /*********************************************************************/07850000
    EXEC SQL                                                            07860000
       CLOSE ADDR_CURSOR_S;                                             07870000
                                                                        07880000
    SELECT(SQLCA.SQLCODE);       /* CHECK SQL CODE           */         07890000
       WHEN(0);                   /* TEST FOR VALID SQL CODES */        07900000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     07910000
       DO;                                                              07920000
          PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                       07930000
          PARM_INT_AREA.ERR_TYPE  = 'DB2';                              07940000
          PARM_INT_AREA.CALL_ID   = '#002';                             07950000
          CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */         07960000
       END;                                                             07970000
    END;                                                                07980000
 END C846_CLOSE_ADDR_CURSOR;                                            07990000
1/*-------------------------------------------------------------------*/08000000
 /* C702_PROC                                                         */08010000
 /* CALLED FROM USER DEFINED PROCESS FOR FINLAND                      */08020000
 /*-------------------------------------------------------------------*/08030000
 C702_PROC: PROCEDURE;                                                  08040000
0/*------------------------------------------------------------------*/ 08050000
 /*   @PPNA CURSOR F@R ADRESS TABELL                                 */ 08060000
 /*------------------------------------------------------------------*/ 08070000
                                                                        08080000
    ZCF_SEQ_NR1O2 = '00';                                               08090000
    ZCF_SEQ_NR = PARM_FILE_CCPF_HW.IHSINBR;                             08100000
    ZCF_FILLER = '';                                      /*RB01242*/   08101023
                                                                        08110000
    CALL C702_OPEN_ADDR_CURSOR;                                         08120000
0/*------------------------------------------------------------------*/ 08130000
 /*   L#S ALLA AKTUELLA RECORD I ADDR_LINE TABELL VIA CURSOR         */ 08140000
 /*------------------------------------------------------------------*/ 08150000
                                                                        08160000
    CALL C702_READ_ADDR_CURSOR;                                         08170000
                                                                        08180000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      08190000
      WHEN (0)                                                          08200000
      DO;                                                               08210000
          PARM_FILE_CCPF_HW.IODPMBO = ' ';                              08220000
                                                                        08230000
          DO WHILE (SQLCA.SQLCODE = 0);                                 08240000
                                                                        08250000
             ZCF_EFF_YEAR = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,1,4);      08260000
             ZCF_EFF_MON = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,6,2);       08270000
             ZCF_EFF_DAY = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,9,2);       08280000
             ZCF_END_YEAR = SUBSTR(TB_RCBV170.END_DATE,1,4);            08290000
             ZCF_END_MON = SUBSTR(TB_RCBV170.END_DATE,6,2);             08300000
             ZCF_END_DAY = SUBSTR(TB_RCBV170.END_DATE,9,2);             08310000
                                                                        08320000
   /* Y2K */                                                            08330000
   /*        IF ZCF_END_DATE > DATE &                    */             08340000
   /*           ZCF_EFF_DATE < DATE THEN                 */             08350000
             IF ZCF_END_DATE > SUBSTR(DATETIME,1,8) &                   08360000
                ZCF_EFF_DATE < SUBSTR(DATETIME,1,8) THEN                08370000
                DO;                                                     08380000
                   PARM_FILE_CCPF_HW.IODPMBO =                          08390000
                            SUBSTR(TB_RCBV170.OU_CODE,1,3);             08400000
                   PARM_FILE_CCPF_HW.IODPRCE = '55';                    08410000
                   SUBSTR(PARM_FILE_CCPF_HW.IODPTRN,1,2) =              08420000
                            SUBSTR(TB_RCBV170.OU_CODE,4,2);             08430000
                   SUBSTR(PARM_FILE_CCPF_HW.IODPTRN,3,1) =              08440000
                            SUBSTR(TB_RCBV170.OU_CODE,7,1);             08450000
                   IF PARM_FILE_CCPF_HW.IODPMBO = ' ' THEN              08460000
                      PARM_FILE_CCPF_HW.IODPMBO = '130';                08470000
                                                    /* DEFAULTV#RDE  */ 08480000
                END;                                                    08490000
             ELSE                                                       08500000
                DO;                                                     08510000
                   PARM_FILE_CCPF_HW.IODPMBO = '130'; /* DEF.V#RDE */   08520000
                   PARM_FILE_CCPF_HW.IODPRCE = '55';                    08530000
                END;                                                    08540000
                                                                        08550000
             CALL C702_READ_ADDR_CURSOR;                                08560000
                                                                        08570000
          END;                                                          08580000
                                                                        08590000
      END;                                                              08600000
                                                                        08610000
      WHEN (100)                                                        08620000
  /*     DO; */                                                         08630000
                                                                        08640000
           IF PARM_FILE_CCPF_HW.IODPMBO = ' ' THEN                      08650000
              DO;                                                       08660000
                 PARM_FILE_CCPF_HW.IODPMBO = '130'; /* DEFAULTV#RDE */  08670000
                 PARM_FILE_CCPF_HW.IODPRCE = '55';                      08680000
              END;                                                      08690000
         END;                                                           08700000
                                                                        08710000
    CALL C702_CLOSE_ADDR_CURSOR;        /* ST#NG CURSOR */              08720000
 END C702_PROC;                                                         08730000
                                                                        08740000
1C702_OPEN_ADDR_CURSOR: PROC;                                           08750000
0/*******************************************************************/  08760000
 /* FUNCTION:  DEKLARERA OCH @PPNA CURSOR F@R ADDR_LINE TABELLEN    */  08770000
 /*            SELEKTERA ADRESSER F@R COUNTRY, CUSTOMER OCH ADRESSNR*/  08780000
 /*******************************************************************/  08790000
    EXEC SQL                                                            08800000
         DECLARE ADDR_CURSOR_F CURSOR FOR                               08810000
         SELECT                                                         08820000
             OU_CODE,                                                   08830000
             EFFECTIVE_DATE,                                            08840000
             END_DATE                                                   08850000
         FROM RCBT0170_OU_HW                                            08860000
         WHERE PRODUCT_TYPE = :PARM_FILE_CCPF_HW.CSLMTYP AND            08870000
               ORIGIN       = :PARM_FILE_CCPF_HW.IOLCPLM AND            08880000
               SEQUENCE_NUMBER = :ZCF_SEQ_NUMBER AND                    08890000
               COUNTRY_NUMBER  = :ZCF_COUNTRY_FINLAND                   08900000
         FOR FETCH ONLY;                                                08910000
                                                                        08920000
    EXEC SQL                            /* OPEN CURSOR           */     08930000
         OPEN ADDR_CURSOR_F;                                            08940000
                                                                        08950000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      08960000
         WHEN(0);                   /* TEST FOR VALID SQL CODES */      08970000
         OTHERWISE                     /* NO VALID SQL CODE ABEND  */   08980000
         DO;                                                            08990000
           CALL C702_CLOSE_ADDR_CURSOR;                                 09000000
           PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                      09010000
           PARM_INT_AREA.ERR_TYPE  = 'DB2';                             09020000
           PARM_INT_AREA.CALL_ID   = '#001';                            09030000
           CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */        09040000
         END;                                                           09050000
    END;                                                                09060000
 END C702_OPEN_ADDR_CURSOR;                                             09070000
                                                                        09080000
1C702_READ_ADDR_CURSOR: PROC;                                           09090000
0/*********************************************************************/09100000
 /* FUNCTION    DEKLARERA OCH @PPNA CURSER F¦R ADDR_LINE TABLE        */09110000
 /*             SELECTERA ALLA ADRESSRADER F@R DENNA                  */09120000
 /*********************************************************************/09130000
                                                                        09140000
    EXEC SQL                                                            09150000
         FETCH ADDR_CURSOR_F                                            09160000
         INTO                                                           09170000
           :TB_RCBV170.OU_CODE,                                         09180000
           :TB_RCBV170.EFFECTIVE_DATE,                                  09190000
           :TB_RCBV170.END_DATE;                                        09200000
                                                                        09210000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      09220000
       WHEN(0);                    /* TEST FOR VALID SQL CODES */       09230000
       WHEN(100);                                                       09240000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     09250000
       DO;                                                              09260000
         CALL C702_CLOSE_ADDR_CURSOR;                                   09270000
         PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                        09280000
         PARM_INT_AREA.ERR_TYPE  = 'DB2';                               09290000
         PARM_INT_AREA.CALL_ID   = '#003';                              09300000
         CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */          09310000
       END;                                                             09320000
    END;                                                                09330000
 END C702_READ_ADDR_CURSOR;                                             09340000
                                                                        09350000
1C702_CLOSE_ADDR_CURSOR: PROC;                                          09360000
0/*********************************************************************/09370000
 /* FUNCTION    ST#NGA CURSER F¦R ADDR_LINE TABLE                     */09380000
 /*                                                                   */09390000
 /*********************************************************************/09400000
    EXEC SQL                                                            09410000
       CLOSE ADDR_CURSOR_F;                                             09420000
                                                                        09430000
    SELECT(SQLCA.SQLCODE);       /* CHECK SQL CODE           */         09440000
       WHEN(0);                   /* TEST FOR VALID SQL CODES */        09450000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     09460000
       DO;                                                              09470000
          PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                       09480000
          PARM_INT_AREA.ERR_TYPE  = 'DB2';                              09490000
          PARM_INT_AREA.CALL_ID   = '#002';                             09500000
          CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */         09510000
       END;                                                             09520000
    END;                                                                09530000
 END C702_CLOSE_ADDR_CURSOR;                                            09540000
1/*-------------------------------------------------------------------*/09550000
 /* C678_PROC                                                         */09560000
 /* CALLED FROM USER DEFINED PROCESS FOR DENMARK                      */09570000
 /*-------------------------------------------------------------------*/09580000
 C678_PROC: PROCEDURE;                                                  09590000
0/*------------------------------------------------------------------*/ 09600000
 /*   @PPNA CURSOR F@R ADRESS TABELL                                 */ 09610000
 /*------------------------------------------------------------------*/ 09620000
    ZCD_SEQ_NR1O2 = '00';                                               09630000
    ZCD_SEQ_NR = PARM_FILE_CCPF_HW.IHSINBR;                             09640000
    ZCD_FILLER = '';                                      /*RB01242*/   09641023
                                                                        09650000
    CALL C678_OPEN_ADDR_CURSOR;                                         09660000
0/*------------------------------------------------------------------*/ 09670000
 /*   L#S ALLA AKTUELLA RECORD I ADDR_LINE TABELL VIA CURSOR         */ 09680000
 /*------------------------------------------------------------------*/ 09690000
                                                                        09700000
    CALL C678_READ_ADDR_CURSOR;                                         09710000
                                                                        09720000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      09730000
      WHEN (0)                                                          09740000
      DO;                                                               09750000
          PARM_FILE_CCPF_HW.IODPMBO = ' ';                              09760000
                                                                        09770000
          DO WHILE (SQLCA.SQLCODE = 0);                                 09780000
                                                                        09790000
             ZCD_EFF_YEAR = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,1,4);      09800000
             ZCD_EFF_MON = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,6,2);       09810000
             ZCD_EFF_DAY = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,9,2);       09820000
             ZCD_END_YEAR = SUBSTR(TB_RCBV170.END_DATE,1,4);            09830000
             ZCD_END_MON = SUBSTR(TB_RCBV170.END_DATE,6,2);             09840000
             ZCD_END_DAY = SUBSTR(TB_RCBV170.END_DATE,9,2);             09850000
                                                                        09860000
    /* Y2K */                                                           09870000
    /*       IF ZCD_END_DATE > DATE &         */                        09880000
    /*          ZCD_EFF_DATE < DATE THEN      */                        09890000
             IF ZCD_END_DATE > SUBSTR(DATETIME,1,8) &                   09900000
                ZCD_EFF_DATE < SUBSTR(DATETIME,1,8) THEN                09910000
                DO;                                                     09920000
 /*------------------------------------------------------------------*/ 09930000
 /*                PARM_FILE_CCPF_HW.IODPMBO =                       */ 09940000
 /*                         SUBSTR(TB_RCBV170.OU_CODE,4,3);          */ 09950000
                                                                        09960000
                   IF SUBSTR(TB_RCBV170.OU_CODE,5,1) = ' ' THEN         09970000
                      DO;                                               09980000
                        PARM_FILE_CCPF_HW.IODPMBO = '678';              09990000
                                                    /* DEFAULTV#RDE  */ 10000000
                      END;                                              10010000
                   ELSE                                                 10020000
                      DO;                                               10030000
                        SUBSTR(PARM_FILE_CCPF_HW.IODPMBO,1,1) = '0';    10040000
                        SUBSTR(PARM_FILE_CCPF_HW.IODPMBO,2,1) =         10050000
                            SUBSTR(TB_RCBV170.OU_CODE,3,1);             10060000
                        SUBSTR(PARM_FILE_CCPF_HW.IODPMBO,3,1) = '0';    10070000
                      END;                                              10080000
                                                                        10090000
                   SUBSTR(PARM_FILE_CCPF_HW.IODPTRN,1,1) = ' ';         10100000
                   PARM_FILE_CCPF_HW.IODPRCE = '54';                    10110000
                END;                                                    10120000
             ELSE                                                       10130000
                DO;                                                     10140000
                   PARM_FILE_CCPF_HW.IODPMBO = '678'; /* DEFAULTV#RDE */10150000
                   PARM_FILE_CCPF_HW.IODPRCE = '54';                    10160000
                END;                                                    10170000
                                                                        10180000
             CALL C678_READ_ADDR_CURSOR;                                10190000
                                                                        10200000
          END;                                                          10210000
                                                                        10220000
      END;                                                              10230000
                                                                        10240000
      WHEN (100)                                                        10250000
  /*     DO; */                                                         10260000
                                                                        10270000
           IF PARM_FILE_CCPF_HW.IODPMBO = ' ' THEN                      10280000
              DO;                                                       10290000
                 PARM_FILE_CCPF_HW.IODPMBO = '678'; /* DEFAULTV#RDE */  10300000
                 PARM_FILE_CCPF_HW.IODPRCE = '54';                      10310000
              END;                                                      10320000
         END;                                                           10330000
                                                                        10340000
    CALL C678_CLOSE_ADDR_CURSOR;        /* ST#NG CURSOR */              10350000
 END C678_PROC;                                                         10360000
                                                                        10370000
1C678_OPEN_ADDR_CURSOR: PROC;                                           10380000
0/*******************************************************************/  10390000
 /* FUNCTION:  DEKLARERA OCH @PPNA CURSOR F@R ADDR_LINE TABELLEN    */  10400000
 /*            SELEKTERA ADRESSER F@R COUNTRY, CUSTOMER OCH ADRESSNR*/  10410000
 /*******************************************************************/  10420000
    EXEC SQL                                                            10430000
         DECLARE ADDR_CURSOR_D CURSOR FOR                               10440000
         SELECT                                                         10450000
             OU_CODE,                                                   10460000
             EFFECTIVE_DATE,                                            10470000
             END_DATE                                                   10480000
         FROM RCBT0170_OU_HW                                            10490000
         WHERE PRODUCT_TYPE = :PARM_FILE_CCPF_HW.CSLMTYP AND            10500000
               ORIGIN       = :PARM_FILE_CCPF_HW.IOLCPLM AND            10510000
               SEQUENCE_NUMBER = :ZCD_SEQ_NUMBER AND                    10520000
               COUNTRY_NUMBER  = :ZCD_COUNTRY_DENMARK                   10530000
         FOR FETCH ONLY;                                                10540000
                                                                        10550000
    EXEC SQL                            /* OPEN CURSOR           */     10560000
         OPEN ADDR_CURSOR_D;                                            10570000
                                                                        10580000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      10590000
         WHEN(0);                   /* TEST FOR VALID SQL CODES */      10600000
         OTHERWISE                     /* NO VALID SQL CODE ABEND  */   10610000
         DO;                                                            10620000
           CALL C678_CLOSE_ADDR_CURSOR;                                 10630000
           PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                      10640000
           PARM_INT_AREA.ERR_TYPE  = 'DB2';                             10650000
           PARM_INT_AREA.CALL_ID   = '#001';                            10660000
           CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */        10670000
         END;                                                           10680000
    END;                                                                10690000
 END C678_OPEN_ADDR_CURSOR;                                             10700000
                                                                        10710000
1C678_READ_ADDR_CURSOR: PROC;                                           10720000
0/*********************************************************************/10730000
 /* FUNCTION    DEKLARERA OCH @PPNA CURSER F¦R ADDR_LINE TABLE        */10740000
 /*             SELECTERA ALLA ADRESSRADER F@R DENNA                  */10750000
 /*********************************************************************/10760000
                                                                        10770000
    EXEC SQL                                                            10780000
         FETCH ADDR_CURSOR_D                                            10790000
         INTO                                                           10800000
           :TB_RCBV170.OU_CODE,                                         10810000
           :TB_RCBV170.EFFECTIVE_DATE,                                  10820000
           :TB_RCBV170.END_DATE;                                        10830000
                                                                        10840000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      10850000
       WHEN(0);                    /* TEST FOR VALID SQL CODES */       10860000
       WHEN(100);                                                       10870000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     10880000
       DO;                                                              10890000
         CALL C678_CLOSE_ADDR_CURSOR;                                   10900000
         PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                        10910000
         PARM_INT_AREA.ERR_TYPE  = 'DB2';                               10920000
         PARM_INT_AREA.CALL_ID   = '#003';                              10930000
         CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */          10940000
       END;                                                             10950000
    END;                                                                10960000
 END C678_READ_ADDR_CURSOR;                                             10970000
                                                                        10980000
1C678_CLOSE_ADDR_CURSOR: PROC;                                          10990000
0/*********************************************************************/11000000
 /* FUNCTION    ST#NGA CURSER F¦R ADDR_LINE TABLE                     */11010000
 /*                                                                   */11020000
 /*********************************************************************/11030000
    EXEC SQL                                                            11040000
       CLOSE ADDR_CURSOR_D;                                             11050000
                                                                        11060000
    SELECT(SQLCA.SQLCODE);       /* CHECK SQL CODE           */         11070000
       WHEN(0);                   /* TEST FOR VALID SQL CODES */        11080000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     11090000
       DO;                                                              11100000
          PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                       11110000
          PARM_INT_AREA.ERR_TYPE  = 'DB2';                              11120000
          PARM_INT_AREA.CALL_ID   = '#002';                             11130000
          CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */         11140000
       END;                                                             11150000
    END;                                                                11160000
 END C678_CLOSE_ADDR_CURSOR;                                            11170000
1/*-------------------------------------------------------------------*/11180000
 /* C806_PROC                                                         */11190000
 /* CALLED FROM USER DEFINED PROCESS FOR NORWAY                       */11200000
 /*-------------------------------------------------------------------*/11210000
 C806_PROC: PROCEDURE;                                                  11220000
0/*------------------------------------------------------------------*/ 11230000
 /*   @PPNA CURSOR F@R ADRESS TABELL                                 */ 11240000
 /*------------------------------------------------------------------*/ 11250000
                                                                        11260000
    ZCN_SEQ_NR1O2 = '00';                                               11270000
    ZCN_SEQ_NR = PARM_FILE_CCPF_HW.IHSINBR;                             11280000
    ZCN_FILLER = '';                                      /*RB01242*/   11281023
                                                                        11290000
    CALL C806_OPEN_ADDR_CURSOR;                                         11300000
0/*------------------------------------------------------------------*/ 11310000
 /*   L#S ALLA AKTUELLA RECORD I ADDR_LINE TABELL VIA CURSOR         */ 11320000
 /*------------------------------------------------------------------*/ 11330000
                                                                        11340000
    CALL C806_READ_ADDR_CURSOR;                                         11350000
                                                                        11360000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      11370000
      WHEN (0)                                                          11380000
      DO;                                                               11390000
          PARM_FILE_CCPF_HW.IODPMBO = ' ';                              11400000
                                                                        11410000
          DO WHILE (SQLCA.SQLCODE = 0);                                 11420000
                                                                        11430000
             ZCN_EFF_YEAR = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,1,4);      11440000
             ZCN_EFF_MON = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,6,2);       11450000
             ZCN_EFF_DAY = SUBSTR(TB_RCBV170.EFFECTIVE_DATE,9,2);       11460000
             ZCN_END_YEAR = SUBSTR(TB_RCBV170.END_DATE,1,4);            11470000
             ZCN_END_MON = SUBSTR(TB_RCBV170.END_DATE,6,2);             11480000
             ZCN_END_DAY = SUBSTR(TB_RCBV170.END_DATE,9,2);             11490000
                                                                        11500000
  /* Y2K */                                                             11510000
  /*         IF ZCN_END_DATE > DATE &                         */        11520000
  /*            ZCN_EFF_DATE < DATE THEN                      */        11530000
             IF ZCN_END_DATE > SUBSTR(DATETIME,1,8) &                   11540000
                ZCN_EFF_DATE < SUBSTR(DATETIME,1,8) THEN                11550000
                DO;                                                     11560000
                   /* PARM_FILE_CCPF_HW.IODPMBO =             */        11570000
                   /*         SUBSTR(TB_RCBV170.OU_CODE,1,3); */        11580000
                   PARM_FILE_CCPF_HW.IODPRCE = '57';                    11590000
                   SUBSTR(PARM_FILE_CCPF_HW.IODPTRN,1,2) =              11600000
                            SUBSTR(TB_RCBV170.OU_CODE,4,2);             11610000
                   SUBSTR(PARM_FILE_CCPF_HW.IODPTRN,3,1) =              11620000
                            SUBSTR(TB_RCBV170.OU_CODE,7,1);             11630000
                   /* IF PARM_FILE_CCPF_HW.IODPMBO = ' ' THEN */        11640000
                   /*   PARM_FILE_CCPF_HW.IODPMBO = '806';    */        11650000
                   PARM_FILE_CCPF_HW.IODPMBO = '001';                   11660000
                               /* DEFAULTV#RDE, #NDRAT 960103 LSA  */   11670000
                END;                                                    11680000
             ELSE                                                       11690000
                DO;                                                     11700000
                   /* PARM_FILE_CCPF_HW.IODPMBO = '806'; */             11710000
                   PARM_FILE_CCPF_HW.IODPMBO = '001';                   11720000
                               /* DEFAULTV#RDE #NDRAT 960103, LSA  */   11730000
                   PARM_FILE_CCPF_HW.IODPRCE = '57';                    11740000
                END;                                                    11750000
                                                                        11760000
             CALL C806_READ_ADDR_CURSOR;                                11770000
                                                                        11780000
          END;                                                          11790000
                                                                        11800000
      END;                                                              11810000
                                                                        11820000
      WHEN (100)                                                        11830000
  /*     DO; */                                                         11840000
                                                                        11850000
           IF PARM_FILE_CCPF_HW.IODPMBO = ' ' THEN                      11860000
              DO;                                                       11870000
             /*  PARM_FILE_CCPF_HW.IODPMBO = '806';    DEFAULTV#RDE */  11880000
                 PARM_FILE_CCPF_HW.IODPMBO = '001';                     11890000
                               /* DEFAULTV#RDE #NDRAT 960103, LSA  */   11900000
                 PARM_FILE_CCPF_HW.IODPRCE = '57';                      11910000
              END;                                                      11920000
         END;                                                           11930000
                                                                        11940000
    CALL C806_CLOSE_ADDR_CURSOR;        /* ST#NG CURSOR */              11950000
 END C806_PROC;                                                         11960000
                                                                        11970000
1C806_OPEN_ADDR_CURSOR: PROC;                                           11980000
0/*******************************************************************/  11990000
 /* FUNCTION:  DEKLARERA OCH @PPNA CURSOR F@R ADDR_LINE TABELLEN    */  12000000
 /*            SELEKTERA ADRESSER F@R COUNTRY, CUSTOMER OCH ADRESSNR*/  12010000
 /*******************************************************************/  12020000
    EXEC SQL                                                            12030000
         DECLARE ADDR_CURSOR_N CURSOR FOR                               12040000
         SELECT                                                         12050000
             OU_CODE,                                                   12060000
             EFFECTIVE_DATE,                                            12070000
             END_DATE                                                   12080000
         FROM RCBT0170_OU_HW                                            12090000
         WHERE PRODUCT_TYPE = :PARM_FILE_CCPF_HW.CSLMTYP AND            12100000
               ORIGIN       = :PARM_FILE_CCPF_HW.IOLCPLM AND            12110000
               SEQUENCE_NUMBER = :ZCN_SEQ_NUMBER AND                    12120000
               COUNTRY_NUMBER  = :ZCN_COUNTRY_NORWAY                    12130000
         FOR FETCH ONLY;                                                12140000
                                                                        12150000
    EXEC SQL                            /* OPEN CURSOR           */     12160000
         OPEN ADDR_CURSOR_N;                                            12170000
                                                                        12180000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      12190000
         WHEN(0);                   /* TEST FOR VALID SQL CODES */      12200000
         OTHERWISE                     /* NO VALID SQL CODE ABEND  */   12210000
         DO;                                                            12220000
           CALL C806_CLOSE_ADDR_CURSOR;                                 12230000
           PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                      12240000
           PARM_INT_AREA.ERR_TYPE  = 'DB2';                             12250000
           PARM_INT_AREA.CALL_ID   = '#001';                            12260000
           CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */        12270000
         END;                                                           12280000
    END;                                                                12290000
 END C806_OPEN_ADDR_CURSOR;                                             12300000
                                                                        12310000
1C806_READ_ADDR_CURSOR: PROC;                                           12320000
0/*********************************************************************/12330000
 /* FUNCTION    DEKLARERA OCH @PPNA CURSER F¦R ADDR_LINE TABLE        */12340000
 /*             SELECTERA ALLA ADRESSRADER F@R DENNA                  */12350000
 /*********************************************************************/12360000
                                                                        12370000
    EXEC SQL                                                            12380000
         FETCH ADDR_CURSOR_N                                            12390000
         INTO                                                           12400000
           :TB_RCBV170.OU_CODE,                                         12410000
           :TB_RCBV170.EFFECTIVE_DATE,                                  12420000
           :TB_RCBV170.END_DATE;                                        12430000
                                                                        12440000
    SELECT(SQLCA.SQLCODE);          /* CHECK SQL CODE           */      12450000
       WHEN(0);                    /* TEST FOR VALID SQL CODES */       12460000
       WHEN(100);                                                       12470000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     12480000
       DO;                                                              12490000
         CALL C806_CLOSE_ADDR_CURSOR;                                   12500000
         PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                        12510000
         PARM_INT_AREA.ERR_TYPE  = 'DB2';                               12520000
         PARM_INT_AREA.CALL_ID   = '#003';                              12530000
         CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */          12540000
       END;                                                             12550000
    END;                                                                12560000
 END C806_READ_ADDR_CURSOR;                                             12570000
                                                                        12580000
1C806_CLOSE_ADDR_CURSOR: PROC;                                          12590000
0/*********************************************************************/12600000
 /* FUNCTION    ST#NGA CURSER F¦R ADDR_LINE TABLE                     */12610000
 /*                                                                   */12620000
 /*********************************************************************/12630000
    EXEC SQL                                                            12640000
       CLOSE ADDR_CURSOR_N;                                             12650000
                                                                        12660000
    SELECT(SQLCA.SQLCODE);       /* CHECK SQL CODE           */         12670000
       WHEN(0);                   /* TEST FOR VALID SQL CODES */        12680000
       OTHERWISE                     /* NO VALID SQL CODE ABEND  */     12690000
       DO;                                                              12700000
          PARM_INT_AREA.PTR_ERROR = ADDR (SQLCA);                       12710000
          PARM_INT_AREA.ERR_TYPE  = 'DB2';                              12720000
          PARM_INT_AREA.CALL_ID   = '#002';                             12730000
          CALL RCB0E1M (PTR_INT_AREA);  /* CALL ERROR RUTINE */         12740000
       END;                                                             12750000
    END;                                                                12760000
 END C806_CLOSE_ADDR_CURSOR;                                            12770000
 /*-------------------------------------------------------------------*/12780000
 /*-------------------------------------------------------------------*/12790000
1C706_PROCEDURE: PROC;                                                  12800000
0/*********************************************************************/12810000
 /* FUNCTION    PROCESS ROWEST USER EXIT FOR COUNTRY 706              */12820000
 /*                                                                   */12830000
 /*********************************************************************/12840000
      PARM_FILE_CCPF_HW.IODPMBO = SUBSTR(PARM_USER_INFO_HW.OU_CODE,1,3);12850000
      PARM_FILE_CCPF_HW.IODPTRN = SUBSTR(PARM_USER_INFO_HW.OU_CODE,2,3);12860000
                                                                        12870000
 /*-----------------------CHARGEMENT DE LA TABLE REGION--------*/       12880000
      IF PREM_FOIS THEN DO;                                             12890000
                   OPEN FILE(BUREG);                                    12900000
                   ON ENDFILE(BUREG) EOF_BUREG = '1'B;                  12910000
                   TAB_BUREG(*) ='';                                    12920000
                   READ FILE(BUREG) INTO(Z_LECT);                       12930000
                   DO I = 1 TO 999 WHILE(¬EOF_BUREG);                   12940000
                      TAB_BUREG(I) = Z_LECT, BY NAME;                   12950000
                      READ FILE(BUREG) INTO(Z_LECT);                    12960000
                   END;                                                 12970000
                   IMAX = I - 1;                                        12980000
                   PREM_FOIS = '0'B;                                    12990000
                   CLOSE FILE(BUREG);                                   13000000
      END;                                                              13010000
                                                                        13020000
 /*-----------------------RECUPERATION REGION------------------*/       13030000
      BU_TROUVE = '0'B;                                                 13040000
      IF PARM_FILE_CCPF_HW.IODPMBO = '299'                              13050000
      THEN PARM_FILE_CCPF_HW.IODPMBO = ' ';       /* ELIMINER BU 299 */ 13060000
      ELSE                                                              13070000
      DO I = 1 TO IMAX WHILE(¬BU_TROUVE);                               13080000
         IF TAB_BUREG(I).BU = PARM_FILE_CCPF_HW.IODPMBO                 13090000
            THEN BU_TROUVE = '1'B;                                      13100000
      END;                                                              13110000
      IF BU_TROUVE THEN PARM_FILE_CCPF_HW.IODPRCE = TAB_BUREG(I-1).REG; 13120000
                   ELSE DO;                                             13130000
                          IF PARM_FILE_CCPF_HW.IODPMBO = ' '            13140000
                          THEN PARM_FILE_CCPF_HW.IODPRCE = ' ';         13150000
                          ELSE PARM_FILE_CCPF_HW.IODPRCE = '99';        13160000
                   END ;                                                13170000
 END C706_PROCEDURE ;                                                   13180000
 /*-------------------------------------------------------------------*/13190000
 /*-------------------------------------------------------------------*/13200000
                                                                        13210000
                                         /* END USED DEFINED PROCESS */ 13220000
0                                        /* RESET LEVEL              */ 13230000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            13240000
1/*******************************************************************/  13250000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  13260000
 /*******************************************************************/  13270000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  13280000
 $DAIMOD (RCBDC2U);                      /* MODULE TO BE COMPILED   */  13290000
0/*******************************************************************/  13300000
 /* END OF ABR BLOCK                                                */  13310000
 /*******************************************************************/  13320000
0END RCBDC2U;                                                           13330000