 /* RCBF18N - CREATE ROW IN RCBV0180_OU_SW                           */ 00019312
 /*                                                                  */ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /*                                                                  */ 00060000
 /********************************************************************/ 00070000
 /* PROGRAM          : RCBF18N                                       */ 00080000
 /*                                                                  */ 00090000
 /* LANGUAGE         : PLISQL                                        */ 00100000
 /*                                                                  */ 00110000
 /* TYPE             : LINKABLE MODULE                               */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION      : INSERT ROW IN RCBV0180_OU_SW                  */ 00140000
 /*                    RCBV0180_OU_SW                                */ 00150000
 /*                    CICS VERSION WITH RBC0M1M REMOVED             */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : RCBV0180_OU_SW                                */ 00180000
 /*                                                                  */ 00190000
 /* OUTPUT           : RCBV0180_OU_SW                                */ 00200000
 /*                                                                  */ 00210000
 /* MESSAGES         :                                               */ 00220000
 /*                                                                  */ 00230000
 /* MAINTENANCE LOG  :                                               */ 00240000
 /* ---------------                                                  */ 00250000
 /*                                                                  */ 00260000
 /* DATE       | WORK-ITEMNO. | DESCRIPTION                          */ 00270000
 /* ---------------------------------------------------------------  */ 00280000
 /* 2001-10-24 | RC01230      | CSP TO PL1/CICS CONVERSION           */ 00290000
 /*            |              |                                      */ 00300000
 /********************************************************************/ 00310000
1RCBF18N: PROC (RCB180S_PTR,                                            00320000
                RCB180SI_PTR,                                           00330000
                RCBZ02S_PTR,                                            00340000
                PARM_INT_AREA_PTR)                                      00350000
          OPTIONS (REENTRANT)                                           00360000
          REORDER;                                                      00370000
0/********************************************************************/ 00380000
 /*                 P A R A M E T E R S                              */ 00390000
 /********************************************************************/ 00400000
 DCL RCB180S_PTR    PTR;               /* PTR ROW                    */ 00410000
 DCL 1 RCB180S      BASED(RCB180S_PTR),                                 00420000
      %INCLUDE RCB180S;;                                                00430000
 DCL RCB180SI_PTR   PTR;               /* PTR NULL INDICATORS        */ 00440000
 DCL 1 RCB180SI     BASED(RCB180SI_PTR),                                00450000
      %INCLUDE RCB180SI;;                                               00460000
 DCL RCBZ02S_PTR    PTR;               /* PTR RETURN INFO            */ 00470000
 DCL 1 RCBZ02S      BASED(RCBZ02S_PTR),                                 00480000
      %INCLUDE RCBZ02S;;                                                00490000
 DCL 1 SQLCA_R      BASED(ADDR(RCBZ02S.RETURN_SQL))                     00500000
                    LIKE SQLCA;                                         00510000
 DCL PARM_INT_AREA_PTR PTR;            /* PTR INTERFACE AREA         */ 00520000
 DCL 1 PARM_INT_AREA BASED(PARM_INT_AREA_PTR),                          00530000
      %INCLUDE RCBZ01S;;                                                00540000
0/********************************************************************/ 00550000
 /*                 S Q L    D E C L A R A T I O N S                 */ 00560000
 /********************************************************************/ 00570000
 EXEC SQL INCLUDE SQLCA;                                                00580000
0/********************************************************************/ 00590000
 /*                 M I S C E L L A N I O U S   F I E L D S          */ 00600000
 /********************************************************************/ 00610000
 DCL WRK_LEVEL      FIXED BIN (15);                                     00620000
 DCL ADDR           BUILTIN;                                            00630000
 DCL STRING         BUILTIN;                                            00640000
1/********************************************************************/ 00650000
 /*                 S T A R T   P R O C E S S I N G                  */ 00660000
 /********************************************************************/ 00670000
                                         /* SET LEVEL AND MOD NAME   */ 00680000
 WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            00690000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     00700000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBF18N';                     00710000
                                                                        00720000
0/********************************************************************/ 00730000
 /*      INSERT ROW                                                  */ 00740000
 /********************************************************************/ 00750000
                                                                        00760000
 RCB180S.LAST_CHANGE_DATE = PARM_INT_AREA.RUN_DATE;     /* SET DATE */  00770000
 RCB180SI.INDNULL(8)      = 0;                                          00780000
                                                                        00790000
 EXEC SQL                                                               00800000
      INSERT INTO RCBV0180_OU_SW                                        00810000
      (COUNTRY_NUMBER,                                                  00820000
       OU_CODE,                                                         00830000
       PRODUCT_TYPE,                                                    00840000
       MODEL_NUMBER,                                                    00850000
       ORIGIN,                                                          00860000
       SEQUENCE_NUMBER,                                                 00870000
       TYPE_OF_RELATION,                                                00880000
       LAST_CHANGE_DATE,                                                00890000
       EFFECTIVE_DATE,                                                  00900000
       END_DATE)                                                        00910000
        VALUES (:RCB180S:RCB180SI.INDNULL);                             00920000
                                                                        00930000
 SELECT (SQLCA.SQLCODE);                                                00940000
   WHEN (0) DO;                                                         00950000
     RCBZ02S.RETURN_CODE = 0;                                           00960000
   END;                                                                 00970000
   WHEN (-803) DO;                                                      00980000
     SQLCA_R             = SQLCA;                                       00990000
     RCBZ02S.RETURN_CODE = 4;                                           01000000
   END;                                                                 01010000
   WHEN(-530) DO;                                                       01020000
     SQLCA_R             = SQLCA;                                       01030000
     RCBZ02S.RETURN_FK   = SQLCA.SQLERRM;                               01040000
     RCBZ02S.RETURN_CODE = 8;                                           01050000
   END;                                                                 01060000
   OTHERWISE DO;                                                        01070000
     SQLCA_R             = SQLCA;                                       01080000
     RCBZ02S.RETURN_CODE = 20;                                          01090000
   END;                                                                 01100000
 END;                                                                   01110000
0/********************************************************************/ 01120000
                                         /* RESET LEVEL              */ 01130000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            01140000
                                                                        01150000
 %INCLUDE DAIFPLH ;                    /* COMPILE DATE/TIME STAMP    */ 01160000
 $DAIMOD (RCBF18N);                    /* MODULE TO BE COMPILED      */ 01170000
 END RCBF18N;                                                           01180000