 /* RCBF24N - CREATE ROW IN RCBV0240_SERV_CTR                        */ 00019211
 /*                                                                  */ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /*                                                                  */ 00060000
 /********************************************************************/ 00070000
 /* PROGRAM          : RCBF24N                                       */ 00080000
 /*                                                                  */ 00090000
 /* LANGUAGE         : PLISQL                                        */ 00100000
 /*                                                                  */ 00110000
 /* TYPE             : LINKABLE MODULE                               */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION      : INSERT ROW IN RCBV0240_SERV_CTR               */ 00140000
 /*                    RCBV0240_SERV_CTR                             */ 00150000
 /*                    CICS VERSION WITH RCB0M1M REMOVED             */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : RCBV0240_SERV_CTR                             */ 00180000
 /*                                                                  */ 00190000
 /* OUTPUT           : RCBV0240_SERV_CTR                             */ 00200000
 /*                                                                  */ 00210000
 /* MESSAGES         :                                               */ 00220000
 /*                                                                  */ 00230000
 /* MAINTENANCE LOG  :                                               */ 00240000
 /* ---------------                                                  */ 00250000
 /*                                                                  */ 00260000
 /* DATE       | WORK-ITEMNO. | DESCRIPTION                          */ 00270000
 /* ---------------------------------------------------------------  */ 00280000
 /* 2001-10-29 | RC01230      | CSP TO PL1/CICS CONVERSION           */ 00290000
 /*            |              |                                      */ 00300000
 /********************************************************************/ 00310000
1RCBF24N: PROC (RCB240S_PTR,                                            00320000
                RCB240SI_PTR,                                           00330000
                RCBZ02S_PTR,                                            00340000
                PARM_INT_AREA_PTR)                                      00350000
          OPTIONS (REENTRANT)                                           00360000
          REORDER;                                                      00370000
0/********************************************************************/ 00380000
 /*                 P A R A M E T E R S                              */ 00390000
 /********************************************************************/ 00400000
 DCL RCB240S_PTR    PTR;               /* PTR ROW                    */ 00410000
 DCL 1 RCB240S      BASED(RCB240S_PTR),                                 00420000
      %INCLUDE RCB240S;;                                                00430000
 DCL RCB240SI_PTR   PTR;               /* PTR NULL INDICATORS        */ 00440000
 DCL 1 RCB240SI     BASED(RCB240SI_PTR),                                00450000
      %INCLUDE RCB240SI;;                                               00460000
 DCL RCBZ02S_PTR    PTR;               /* PTR RETURN INFO            */ 00470000
 DCL 1 RCBZ02S      BASED(RCBZ02S_PTR),                                 00480000
      %INCLUDE RCBZ02S;;                                                00490000
 DCL 1 SQLCA_R      BASED(ADDR(RCBZ02S.RETURN_SQL))                     00500000
                    LIKE SQLCA;                                         00510000
 DCL PARM_INT_AREA_PTR PTR;            /* PTR INTERFACE AREA         */ 00520000
 DCL 1 PARM_INT_AREA BASED(PARM_INT_AREA_PTR),                          00530000
      %INCLUDE RCBZ01S;;                                                00540000
0/********************************************************************/ 00550000
 /*                 S Q L    D E C L A R A T I O N S                 */ 00560000
 /********************************************************************/ 00570000
 EXEC SQL INCLUDE SQLCA;                                                00580000
0/********************************************************************/ 00590000
 /*                 M I S C E L L A N I O U S   F I E L D S          */ 00600000
 /********************************************************************/ 00610000
 DCL WRK_LEVEL      FIXED BIN (15);                                     00620000
 DCL RCB0M1M        EXT ENTRY;         /* MESSAGE MODULE             */ 00630000
 DCL ADDR           BUILTIN;                                            00640000
 DCL STRING         BUILTIN;                                            00650000
1/********************************************************************/ 00660000
 /*                 S T A R T   P R O C E S S I N G                  */ 00670000
 /********************************************************************/ 00680000
                                         /* SET LEVEL AND MOD NAME   */ 00690000
 WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            00700000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     00710000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBF24N';                     00720000
                                                                        00730000
0/********************************************************************/ 00740000
 /*      INSERT ROW                                                  */ 00750000
 /********************************************************************/ 00760000
                                                                        00770000
 RCB240S.LAST_CHANGE_DATE = PARM_INT_AREA.RUN_DATE;     /* SET DATE */  00780000
 RCB240SI.INDNULL(36)     = 0;                                          00790000
                                                                        00800000
 EXEC SQL                                                               00810000
      INSERT INTO RCBV0240_SERV_CTR                                     00820000
      (COUNTRY_NUMBER,                                                  00830000
       PRODUCT_TYPE,                                                    00840000
       ORIGIN,                                                          00850000
       SEQUENCE_NUMBER,                                                 00860000
       HVP_QUANTITY,                                                    00870000
       CONTRACT_NUMBER,                                                 00880000
       SERVICE_START_DATE,                                              00890000
       SERVICE_STOP_DATE,                                               00900000
       SUPPL_CTR_NUMBER,                                                00910000
       SERVICE_MODULE_1,                                                00920000
       SERVICE_MODULE_2,                                                00930000
       SERVICE_MODULE_3,                                                00940000
       SERVICE_MODULE_4,                                                00950000
       SERVICE_MODULE_5,                                                00960000
       AGREEMENT_TYPE,                                                  00970000
       AGREEMENT_OPTION,                                                00980000
       SPECIAL_OPTION,                                                  00990000
       AMENDM_COMB_CODE,                                                01000000
       COVERAGE_START_1,                                                01010000
       COVERAGE_END_1,                                                  01020000
       COVERAGE_START_2,                                                01030000
       COVERAGE_END_2,                                                  01040000
       COVERAGE_START_3,                                                01050000
       COVERAGE_END_3,                                                  01060000
       COVERAGE_START_4,                                                01070000
       COVERAGE_END_4,                                                  01080000
       COVERAGE_START_5,                                                01090000
       COVERAGE_END_5,                                                  01100000
       COVERAGE_START_6,                                                01110000
       COVERAGE_END_6,                                                  01120000
       COVERAGE_START_7,                                                01130000
       COVERAGE_END_7,                                                  01140000
       SERVICE_TYPE,                                                    01150000
       SERVICE_LVL_CODE,                                                01160000
       SOURCE_INDICATOR,                                                01170000
       LAST_CHANGE_DATE,                                                01180000
       EFFECTIVE_DATE,                                                  01190000
       END_DATE)                                                        01200000
        VALUES (:RCB240S:RCB240SI.INDNULL);                             01210000
                                                                        01220000
 SELECT (SQLCA.SQLCODE);                                                01230000
   WHEN (0) DO;                                                         01240000
     RCBZ02S.RETURN_CODE = 0;                                           01250000
   END;                                                                 01260000
   WHEN (-803) DO;                                                      01270000
     SQLCA_R             = SQLCA;                                       01280000
     RCBZ02S.RETURN_CODE = 4;                                           01290000
   END;                                                                 01300000
   WHEN(-530) DO;                                                       01310000
     SQLCA_R             = SQLCA;                                       01320000
     RCBZ02S.RETURN_FK   = SQLCA.SQLERRM;                               01330000
     RCBZ02S.RETURN_CODE = 8;                                           01340000
   END;                                                                 01350000
   OTHERWISE DO;                                                        01360000
     SQLCA_R             = SQLCA;                                       01370000
     RCBZ02S.RETURN_CODE = 20;                                          01380000
   END;                                                                 01390000
 END;                                                                   01400000
0/********************************************************************/ 01410000
                                         /* RESET LEVEL              */ 01420000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            01430000
                                                                        01440000
 %INCLUDE DAIFPLH ;                    /* COMPILE DATE/TIME STAMP    */ 01450000
 $DAIMOD (RCBF24N);                    /* MODULE TO BE COMPILED      */ 01460000
 END RCBF24N;                                                           01470000