 /* RCBFAXN - INT.SUP. RCBV0240_SERV_CTR (SPECIAL)                   */ 00019211
 /*                                                                  */ 00020000
 /********************************************************************/ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /********************************************************************/ 00070000
 /*                                                                  */ 00080000
 /* MODULE NAME         : RCBFAXN                                    */ 00090000
 /*                                                                  */ 00100000
 /* TYPE                : LINKABLE MODULE                            */ 00110000
 /*                                                                  */ 00120000
 /* DESCRIPTION         : INTEGRATE SUPERIOR INTO TABLE              */ 00130000
 /*                       RCBV0240_SERV_CTR                          */ 00140000
 /*                       CICS VERSION WITH RCB0M1M REMOVED          */ 00150000
 /*                                                                  */ 00160000
 /* INPUT               : - DB2   : RCBV0240_SERV_CTR                */ 00170000
 /*                                                                  */ 00180000
 /* OUTPUT              : - DB2   : RCBV0240_SERV_CTR                */ 00190000
 /*                       - FILE  : MESSAGE  RCB0M1F0                */ 00200000
 /*                                                                  */ 00210000
 /* EXTERNAL MODULES    : - RCBF24N   INSERT BUILDING BLOCK          */ 00220000
 /*                       - RCBG24N   UPDATE BUILDING BLOCK          */ 00230000
 /*                       - RCBH24N   DELETE BUILDING BLOCK          */ 00240000
 /*                       - RCB004N   DATE CALCULATION               */ 00250000
 /*                                                                  */ 00260000
 /* MESSAGES            :                                            */ 00270000
 /*                                                                  */ 00280000
 /* PROCESSING DETAILS  : THIS MODULE HAS NOT BEEN GENERATED !!!!!!! */ 00290000
 /*                                                                  */ 00300000
 /*                                                                  */ 00310000
 /* NOTE                : DETECTED ERRORS SHOULD NOT BE HANDLED IN   */ 00320000
 /*                       THIS BUILDING BLOCK, BUT IN THE CALLING    */ 00330000
 /*  MODULE. THEREFOR THE PROCESSING HAS TO STOP IMMEDIATELY IF AN   */ 00340000
 /*  ERROR IS DETECTED, WITHOUT CAUSING AN ABEND. TO IMPROVE         */ 00350000
 /*  READABILITY THIS HAS BEEN DONE USING A 'EXIT LABEL' INSTEAD     */ 00360000
 /*  OF THE CONTINUOUS 'IF TO CONTINUE' CLAUSE.                      */ 00370000
 /*                                                                  */ 00380000
 /*  THE FOLLOWING PICTURES GIVE AN ILLUSTRATION OF THE POSSIBLE     */ 00390000
 /*  SITUATIONS, WHICH MAY OCCUR AND HAVE TO BE HANDLED              */ 00400000
 /*                                                                  */ 00410000
 /*  INPUT:           |--------------|                               */ 00420000
 /*                                                                  */ 00430000
 /*  CEDS:  1 - |----|                                               */ 00440000
 /*         2 - |----------|                                         */ 00450000
 /*         3 - |--------------------------|                         */ 00460000
 /*         4 -            |----|                                    */ 00470000
 /*         5 -            |---------------|                         */ 00480000
 /*         6 -                       |----|                         */ 00490000
 /*                                                                  */ 00500000
 /*  THOSE FIELDS IN CEDS FOR WHICH THE INPUT IS NOT THE OWNER,      */ 00510000
 /*  I.E. INDNULL HAS BEEN SET TO '99', ARE TO REMAIN UNCHANGED      */ 00520000
 /*                                                                  */ 00530000
 /*  CONCURRENT PERIODS WITH THE SAME DATA ARE TO BE MERGED          */ 00540000
 /*                                                                  */ 00550000
 /*  INPUT RECORD IS FILLED CORRECTLY, I.E. FIELD IS BLANK OR        */ 00560000
 /*  DECIMAL ZERO IF NULL.                                           */ 00570000
 /*                                                                  */ 00580000
 /*  MAINTENANCE LOG :                                               */ 00590000
 /*  ---------------                                                 */ 00600000
 /*                                                                  */ 00610000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00620000
 /*  --------------------------------------------------------------  */ 00630000
 /*  2001-10-29 | RC01230      | CSP TO PL1/CICS CONVERSION          */ 00640000
 /*                                                                  */ 00650000
 /********************************************************************/ 00660000
1RCBFAXN: PROC    (PTR_RCB240S_IN,                                      00670000
                   PTR_RCB240SI_IN,                                     00680000
                   PTR_RET_AREA_BB,                                     00690000
                   PTR_INT_AREA)                                        00700000
          OPTIONS (REENTRANT)                                           00710000
          REORDER;                                                      00720000
0/********************************************************************/ 00730000
 /*  PARAMETERS                                                      */ 00740000
 /********************************************************************/ 00750000
0DCL PTR_RCB240S_IN          PTR;                                       00760000
 DCL PTR_RCB240SI_IN         PTR;                                       00770000
 DCL PTR_RET_AREA_BB         PTR;                                       00780000
 DCL PTR_INT_AREA            PTR;                                       00790000
 DCL PTR_DATE_CALC           PTR;                                       00800000
 DCL SITUATION               CHAR (01);                  /* PTM 0437 */ 00810000
0/********************************************************************/ 00820000
 /* EXTERNAL ENTRIES                                                 */ 00830000
 /********************************************************************/ 00840000
0DCL RCB0E1M   ENTRY  EXTERNAL;      /* COMMON ERROR ROUTINE         */ 00850000
 DCL RCB0M1M   ENTRY  EXTERNAL;      /* COMMON MESSAGES ROUT         */ 00860000
 DCL RCBF24N   ENTRY  EXTERNAL;      /* INSERT BUILDING BLOCK        */ 00870000
 DCL RCBG24N   ENTRY  EXTERNAL;      /* UPDATE BUILDING BLOCK        */ 00880000
 DCL RCBH24N   ENTRY  EXTERNAL;      /* DELETE BUILDING BLOCK        */ 00890000
 DCL RCB004N   ENTRY  EXTERNAL;      /* DATE CALCULATION             */ 00900000
0/********************************************************************/ 00910000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 00920000
 /********************************************************************/ 00930000
0DCL 1 PARM_INT_AREA    BASED (PTR_INT_AREA),                           00940000
       %INCLUDE (RCBZ01S);;                                             00950000
 DCL 1 PARM_RET_AREA_BB BASED (PTR_RET_AREA_BB),                        00960000
       %INCLUDE (RCBZ02S);;                                             00970000
 DCL 1 PARM_DATE_CALC,                                                  00980000
       %INCLUDE (RCBZ03S);;                                             00990000
0/********************************************************************/ 01000000
 /* DB2 TABLE STRUCTURES                                             */ 01010000
 /********************************************************************/ 01020000
0DCL PTR_RCB240S_FETCH       PTR;                                       01030000
 DCL PTR_RCB240SI_FETCH      PTR;                                       01040000
 DCL PTR_RCB240S_OLD         PTR;                                       01050000
 DCL PTR_RCB240SI_OLD        PTR;                                       01060000
 DCL PTR_RCB240S_MERGE       PTR;                                       01070000
 DCL PTR_RCB240SI_MERGE      PTR;                                       01080000
 DCL PTR_RCB240S_OUT         PTR;                                       01090000
 DCL PTR_RCB240SI_OUT        PTR;                                       01100000
0DCL 1 RCB240S_IN       BASED (PTR_RCB240S_IN),                         01110000
       %INCLUDE (RCB240S);;                                             01120000
 DCL 1 RCB240SI_IN      BASED (PTR_RCB240SI_IN),                        01130000
       %INCLUDE (RCB240SI);;                                            01140000
 DCL 1 RCB240S_FETCH,                                                   01150000
       %INCLUDE (RCB240S);;                                             01160000
 DCL 1 RCB240SI_FETCH,                                                  01170000
       %INCLUDE (RCB240SI);;                                            01180000
 DCL 1 RCB240S_OLD,                                                     01190000
       %INCLUDE (RCB240S);;                                             01200000
 DCL 1 RCB240SI_OLD,                                                    01210000
       %INCLUDE (RCB240SI);;                                            01220000
 DCL 1 RCB240S_MERGE,                                                   01230000
       %INCLUDE (RCB240S);;                                             01240000
 DCL 1 RCB240SI_MERGE,                                                  01250000
       %INCLUDE (RCB240SI);;                                            01260000
 DCL 1 RCB240S_OUT,                                                     01270000
       %INCLUDE (RCB240S);;                                             01280000
 DCL 1 RCB240SI_OUT,                                                    01290000
       %INCLUDE (RCB240SI);;                                            01300000
0/********************************************************************/ 01310000
 /*  BIT SWITCHES                                                    */ 01320000
 /********************************************************************/ 01330000
0DCL TRUE                  BIT (1)         INIT ('1'B);                 01340000
 DCL FALSE                 BIT (1)         INIT ('0'B);                 01350000
 DCL SWITCH_CURSOR_OPEN    BIT (1)         INIT ('0'B);                 01360000
 DCL SWITCH_END_OF_CURSOR  BIT (1)         INIT ('0'B);                 01370000
 DCL SWITCH_CHANGE         BIT (1)         INIT ('0'B);                 01380000
 DCL SWITCH_CHANGE_ALLOWED BIT (1)         INIT ('1'B);                 01390000
0/********************************************************************/ 01400000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 01410000
 /********************************************************************/ 01420000
0DCL 1 WRK_SQLCA  BASED (ADDR(PARM_RET_AREA_BB.RETURN_SQL))             01430000
                  LIKE SQLCA;                                           01440000
0DCL 1 WRK_FIELDS,                                                      01450000
       3 WRK_LEVEL          FIXED BIN (15),                             01460000
       3 WRK_MOD_NAME       CHAR (08),                                  01470000
       3 WRK_TABLE_NAME     CHAR (25)  INIT ('RCBV0240_SERV_CTR'),      01480000
       3 WRK_PREV_DATE      CHAR (10),                                  01490000
       3 WRK_NEXT_DATE      CHAR (10);                                  01500000
 DCL 1 WRK_RCBZ29S,                                                     01510000
       %INCLUDE (RCBZ29S);;                                             01520000
0/********************************************************************/ 01530000
 /*  BUILTIN FUNCTIONS                                               */ 01540000
 /********************************************************************/ 01550000
0DCL (ADDR,                                                             01560000
      LOW,                                                              01570000
      HIGH,                                                             01580000
      NULL,                                                             01590000
      STRING,                                                           01600000
      SUBSTR,                                                           01610000
      VERIFY)   BUILTIN;                                                01620000
0/********************************************************************/ 01630000
 /*  DB2/SQL SQLCA                                                   */ 01640000
 /********************************************************************/ 01650000
0 EXEC SQL                                                              01660000
    INCLUDE SQLCA                                                       01670000
    ;                                                                   01680000
0/********************************************************************/ 01690000
 /* DB2/SQL CURSORS                                                  */ 01700000
 /********************************************************************/ 01710000
0 EXEC SQL                                /* CURSOR TABEL            */ 01720000
    DECLARE CURS_TABLE CURSOR FOR                                       01730000
    SELECT *                                                            01740000
    FROM RCBV0240_SERV_CTR                                              01750000
    WHERE COUNTRY_NUMBER           = :RCB240S_IN.COUNTRY_NUMBER         01760000
      AND PRODUCT_TYPE             = :RCB240S_IN.PRODUCT_TYPE           01770000
      AND ORIGIN                   = :RCB240S_IN.ORIGIN                 01780000
      AND SEQUENCE_NUMBER          = :RCB240S_IN.SEQUENCE_NUMBER        01790000
      AND EFFECTIVE_DATE          <= :WRK_NEXT_DATE                     01800000
      AND END_DATE                >= :WRK_PREV_DATE                     01810000
    ORDER BY                                                            01820000
      EFFECTIVE_DATE                                                    01830000
    FOR FETCH ONLY                                        /* RC01219 */ 01840000
    ;                                                                   01850000
1/********************************************************************/ 01860000
 /*                 S T A R T   P R O C E S S I N G                  */ 01870000
 /********************************************************************/ 01880000
0 CALL RCBFAXN_INIT_COMMON;                                             01890000
0 CALL RCBFAXN_OPEN_CURS_TABLE;                                         01900000
  CALL RCBFAXN_FETCH_CURS_TABLE;                                        01910000
                                     /* PROCESS ALL CEDS TABLE INFO  */ 01920000
0 DO WHILE (¬ SWITCH_END_OF_CURSOR);                                    01930000
    CALL RCBFAXN_PROCESS_FETCH;                                         01940000
                                     /* STILL INFO LEFT TO INSERT    */ 01950000
0   IF RCB240S_IN.EFFECTIVE_DATE <= RCB240S_IN.END_DATE                 01960000
    THEN                                                                01970000
      DO;                                                               01980000
        CALL RCBFAXN_FETCH_CURS_TABLE_1;                                01990000
      END;                                                              02000000
    ELSE                                                                02010000
      DO;                                                               02020000
        SWITCH_END_OF_CURSOR = TRUE;                                    02030000
      END;                                                              02040000
  END;                                                                  02050000
  CALL RCBFAXN_PROCESS_RECORD;                                          02060000
                                     /* EXIT LABEL, SEE PROLOGUE     */ 02070000
  RCBFAXN_EXIT:                                                         02080000
0 IF SWITCH_CURSOR_OPEN                                                 02090000
  THEN                                                                  02100000
    DO;                                                                 02110000
      CALL RCBFAXN_CLOSE_CURS_TABLE;                                    02120000
    END;                                                                02130000
0 CALL RCBFAXN_END_COMMON;                                              02140000
1/********************************************************************/ 02150000
 /*                                                                  */ 02160000
 /* MODULE NAME      : RCBFAXN_INIT_COMMON                           */ 02170000
 /*                                                                  */ 02180000
 /* DESCRIPTION      : INIT PROGRAM                                  */ 02190000
 /*                                                                  */ 02200000
 /********************************************************************/ 02210000
0RCBFAXN_INIT_COMMON: PROC;                                             02220000
                                     /* INITIALISE POINTERS          */ 02230000
  PTR_RCB240S_FETCH  = ADDR(RCB240S_FETCH);                             02240000
  PTR_RCB240SI_FETCH = ADDR(RCB240SI_FETCH);                            02250000
  PTR_RCB240S_OLD    = ADDR(RCB240S_OLD);                               02260000
  PTR_RCB240SI_OLD   = ADDR(RCB240SI_OLD);                              02270000
  PTR_RCB240S_MERGE  = ADDR(RCB240S_MERGE);                             02280000
  PTR_RCB240SI_MERGE = ADDR(RCB240SI_MERGE);                            02290000
  PTR_RCB240S_OUT    = ADDR(RCB240S_OUT);                               02300000
  PTR_RCB240SI_OUT   = ADDR(RCB240SI_OUT);                              02310000
  PTR_DATE_CALC      = ADDR(PARM_DATE_CALC);                            02320000
                                     /* ADAPT MESSAGE AREA           */ 02330000
  WRK_MOD_NAME  = SDAISTP.SDAINAM;                                      02340000
  WRK_LEVEL     = PARM_INT_AREA.ID_MOD_LEVEL + 1;                       02350000
  PARM_INT_AREA.ID_MOD_PATH(WRK_LEVEL) = WRK_MOD_NAME;                  02360000
  PARM_INT_AREA.ID_MOD_LEVEL           = WRK_LEVEL;                     02370000
                                     /* START PROCESSING             */ 02380000
  PARM_RET_AREA_BB.RETURN_CODE = 0;                                     02390000
                                     /* SET SEARCH BOUNDARIES        */ 02400000
  IF RCB240S_IN.EFFECTIVE_DATE = '0001-01-01'                           02410000
  THEN                                                                  02420000
    DO;                                                                 02430000
      WRK_PREV_DATE = '0001-01-01';                                     02440000
    END;                                                                02450000
  ELSE                                                                  02460000
    DO;                                                                 02470000
      CALL RCBFAXN_TRANS_DATE (RCB240S_IN.EFFECTIVE_DATE, -1,           02480000
                               WRK_PREV_DATE);                          02490000
    END;                                                                02500000
  IF RCB240S_IN.END_DATE = '9999-12-31'                                 02510000
  THEN                                                                  02520000
    DO;                                                                 02530000
      WRK_NEXT_DATE = '9999-12-31';                                     02540000
    END;                                                                02550000
  ELSE                                                                  02560000
    DO;                                                                 02570000
      CALL RCBFAXN_TRANS_DATE (RCB240S_IN.END_DATE,+1,                  02580000
                               WRK_NEXT_DATE);                          02590000
    END;                                                                02600000
                                     /* STORE NEW PREVIOUS RECORD    */ 02610000
  RCB240S_OLD              = '';                                        02620000
  RCB240SI_OLD.INDNULL (*) = -1;                                        02630000
0 END RCBFAXN_INIT_COMMON;                                              02640000
1/********************************************************************/ 02650000
 /*                                                                  */ 02660000
 /* MODULE NAME      : PROCESS_FETCH                                 */ 02670000
 /*                                                                  */ 02680000
 /* DESCRIPTION      : PROCESS FETCHED RECORD                        */ 02690000
 /*                                                                  */ 02700000
 /********************************************************************/ 02710000
0RCBFAXN_PROCESS_FETCH: PROC;                                           02720000
 SELECT;                                                                02730000
1                                    /* SITUATION - 1                */ 02740000
 WHEN (RCB240S_FETCH.END_DATE       <  RCB240S_IN.EFFECTIVE_DATE)       02750000
   DO;                                                                  02760000
     SITUATION    = '1';                                 /* PTM 0437 */ 02770000
                                     /* STORE NEW PREVIOUS RECORD    */ 02780000
     RCB240S_OLD  = RCB240S_FETCH, BY NAME;                             02790000
     RCB240SI_OLD = RCB240SI_FETCH, BY NAME;                            02800000
   END;                                                                 02810000
1                                    /* SITUATION - 2                */ 02820000
 WHEN (RCB240S_FETCH.EFFECTIVE_DATE <  RCB240S_IN.EFFECTIVE_DATE &      02830000
       RCB240S_FETCH.END_DATE       >= RCB240S_IN.EFFECTIVE_DATE &      02840000
       RCB240S_FETCH.END_DATE       <= RCB240S_IN.END_DATE)             02850000
   DO;                                                                  02860000
     SITUATION    = '2';                                 /* PTM 0437 */ 02870000
                                     /* STORE NEW PREVIOUS RECORD    */ 02880000
     RCB240S_OLD  = RCB240S_FETCH, BY NAME;                             02890000
     RCB240SI_OLD = RCB240SI_FETCH, BY NAME;                            02900000
                                     /* MERGE NEW INFORMATION        */ 02910000
     CALL RCBFAXN_MERGE;                                                02920000
     CALL RCBFAXN_COMPARE;                                              02930000
     IF SWITCH_CHANGE                                                   02940000
     THEN                                                               02950000
       DO;                                                              02960000
                                 /* CHECK IF CHANGE ALLOWED      */     02970000
         CALL RCBFAXN_CHANGE_ALLOWED;                                   02980000
         IF SWITCH_CHANGE_ALLOWED                                       02990000
         THEN                                                           03000000
           DO;                                                          03010000
                                 /* STORE NEW PREVIOUS RECORD    */     03020000
             RCB240S_OLD          = RCB240S_MERGE, BY NAME;             03030000
             RCB240SI_OLD         = RCB240SI_MERGE, BY NAME;            03040000
             RCB240S_OLD.END_DATE = RCB240S_FETCH.END_DATE;             03050000
                                 /* INSERT NEW PREVIOUS RECORD   */     03060000
             RCB240S_OUT          = RCB240S_OLD, BY NAME;               03070000
             RCB240SI_OUT         = RCB240SI_OLD, BY NAME;              03080000
             CALL RCBFAXN_INSERT;                                       03090000
                                 /* CLOSE CEDS RECORD            */     03100000
             RCB240S_OUT          = RCB240S_FETCH, BY NAME;             03110000
             RCB240SI_OUT         = RCB240SI_FETCH, BY NAME;            03120000
             RCB240S_OUT.END_DATE = WRK_PREV_DATE;                      03130000
             CALL RCBFAXN_UPDATE;                                       03140000
           END;                                                         03150000
       END;                                                             03160000
                                     /* SET REMAINING PERIOD         */ 03170000
     IF RCB240S_FETCH.END_DATE = '9999-12-31'                           03180000
     THEN                                                               03190000
       DO;                                      /* TO FORCE LOOP END */ 03200000
         RCB240S_IN.EFFECTIVE_DATE = '9999-99-99';                      03210000
       END;                                                             03220000
     ELSE                                                               03230000
       DO;                                                              03240000
         CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.END_DATE, +1,           03250000
                                  RCB240S_IN.EFFECTIVE_DATE);           03260000
         SITUATION  = '1';                               /* PTM 0437 */ 03270000
       END;                                                             03280000
   END;                                                                 03290000
1                                    /* SITUATION - 3                */ 03300000
 WHEN (RCB240S_FETCH.EFFECTIVE_DATE <  RCB240S_IN.EFFECTIVE_DATE &      03310000
       RCB240S_FETCH.END_DATE       >  RCB240S_IN.END_DATE)             03320000
   DO;                                                                  03330000
     SITUATION    = '3';                                 /* PTM 0437 */ 03340000
                                     /* STORE NEW PREVIOUS RECORD    */ 03350000
     RCB240S_OLD  = RCB240S_FETCH, BY NAME;                             03360000
     RCB240SI_OLD = RCB240SI_FETCH, BY NAME;                            03370000
                                     /* MERGE NEW INFORMATION        */ 03380000
     CALL RCBFAXN_MERGE;                                                03390000
     CALL RCBFAXN_COMPARE;                                              03400000
     IF SWITCH_CHANGE                                                   03410000
     THEN                                                               03420000
       DO;                                                              03430000
                                     /* CHECK IF CHANGE ALLOWED      */ 03440000
         CALL RCBFAXN_CHANGE_ALLOWED;                                   03450000
         IF SWITCH_CHANGE_ALLOWED                                       03460000
         THEN                                                           03470000
           DO;                                                          03480000
                                 /* STORE NEW PREVIOUS RECORD    */     03490000
             RCB240S_OLD          = RCB240S_MERGE, BY NAME;             03500000
             RCB240SI_OLD         = RCB240SI_MERGE, BY NAME;            03510000
                                 /* INSERT NEW RECORD            */     03520000
             RCB240S_OUT          = RCB240S_OLD, BY NAME;               03530000
             RCB240SI_OUT         = RCB240SI_OLD, BY NAME;              03540000
             CALL RCBFAXN_INSERT;                                       03550000
                                 /* CLOSE CEDS RECORD            */     03560000
             RCB240S_OUT          = RCB240S_FETCH, BY NAME;             03570000
             RCB240SI_OUT         = RCB240SI_FETCH, BY NAME;            03580000
             RCB240S_OUT.END_DATE = WRK_PREV_DATE;                      03590000
             CALL RCBFAXN_UPDATE;                                       03600000
                                     /* INSERT CEDS RECORD FUTURE    */ 03610000
             RCB240S_OUT          = RCB240S_FETCH, BY NAME;             03620000
             RCB240SI_OUT         = RCB240SI_FETCH, BY NAME;            03630000
             RCB240S_OUT.EFFECTIVE_DATE  = WRK_NEXT_DATE;               03640000
             CALL RCBFAXN_INSERT;                                       03650000
           END;                                                         03660000
       END;                                                             03670000
                                     /* SET REMAINING PERIOD         */ 03680000
     RCB240S_IN.EFFECTIVE_DATE = '9999-99-99';                          03690000
   END;                                                                 03700000
1                                    /* SITUATION - 4                */ 03710000
 WHEN (RCB240S_FETCH.EFFECTIVE_DATE >= RCB240S_IN.EFFECTIVE_DATE &      03720000
       RCB240S_FETCH.END_DATE       >= RCB240S_IN.EFFECTIVE_DATE &      03730000
       RCB240S_FETCH.END_DATE       <= RCB240S_IN.END_DATE)             03740000
   DO;                                                                  03750000
     SITUATION    = '4';                                                03760000
     CALL RCBFAXN_MERGE;                                                03770000
                                                   /* START PTM 496 */  03780000
     IF RCB240S_FETCH.SOURCE_INDICATOR = RCB240S_IN.SOURCE_INDICATOR    03790000
     THEN                                                               03800000
       CALL RCBFAXN_PROCESS_SIT4;                                       03810000
     ELSE                                                               03820000
       DO;                                                              03830000
         CALL RCBFAXN_CHANGE_ALLOWED;                                   03840000
         IF SWITCH_CHANGE_ALLOWED                                       03850000
         THEN                                                           03860000
           CALL RCBFAXN_PROCESS_SIT4;                                   03870000
         ELSE                                                           03880000
           DO;                                                          03890000
             IF RCB240S_FETCH.EFFECTIVE_DATE                            03900000
                                     > RCB240S_IN.EFFECTIVE_DATE        03910000
             THEN                                                       03920000
                 CALL RCBFAXN_PROCESS_SIT4_SP;                          03930000
             ELSE                                                       03940000
               DO;         /* CREATE OLD RECORD              */         03950000
                 RCB240S_OLD        = RCB240S_FETCH, BY NAME;           03960000
                 RCB240SI_OLD       = RCB240SI_FETCH, BY NAME;          03970000
               END;                                                     03980000
           END;                                                         03990000
       END;                                                             04000000
                                                   /*   END PTM 496 */  04010000
                                                                        04020000
                                     /* SET REMAINING PERIOD         */ 04030000
     IF RCB240S_FETCH.END_DATE     = '9999-12-31'                       04040000
     THEN                                                               04050000
       DO;                                                              04060000
         RCB240S_IN.EFFECTIVE_DATE = '9999-99-99';                      04070000
       END;                                                             04080000
     ELSE                                                               04090000
       DO;                                                              04100000
         CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.END_DATE, +1,           04110000
                                 RCB240S_IN.EFFECTIVE_DATE);            04120000
         SITUATION = '1';                                 /* PTM 0437 */04130000
       END;                                                             04140000
   END;                                                                 04150000
1                                    /* SITUATION - 5                */ 04160000
 WHEN (RCB240S_FETCH.EFFECTIVE_DATE >= RCB240S_IN.EFFECTIVE_DATE &      04170000
       RCB240S_FETCH.EFFECTIVE_DATE <= RCB240S_IN.END_DATE       &      04180000
       RCB240S_FETCH.END_DATE       >  RCB240S_IN.END_DATE)             04190000
   DO;                                                                  04200000
     SITUATION    = '5';                                                04210000
     CALL RCBFAXN_MERGE;                                                04220000
                                                   /* START PTM 496 */  04230000
     IF RCB240S_FETCH.SOURCE_INDICATOR = RCB240S_IN.SOURCE_INDICATOR    04240000
     THEN                                                               04250000
       CALL RCBFAXN_PROCESS_SIT5;                                       04260000
     ELSE                                                               04270000
       DO;                                                              04280000
         CALL RCBFAXN_CHANGE_ALLOWED;                                   04290000
         IF SWITCH_CHANGE_ALLOWED                                       04300000
         THEN                                                           04310000
           CALL RCBFAXN_PROCESS_SIT5;                                   04320000
         ELSE                                                           04330000
           DO;                                                          04340000
             IF RCB240S_FETCH.EFFECTIVE_DATE                            04350000
                                     > RCB240S_IN.EFFECTIVE_DATE        04360000
             THEN                                                       04370000
               CALL RCBFAXN_PROCESS_SIT5_SP;                            04380000
           END;                                                         04390000
       END;                                                             04400000
                                                   /*   END PTM 496 */  04410000
                                     /* SET REMAINING PERIOD         */ 04420000
     RCB240S_IN.EFFECTIVE_DATE = '9999-99-99';                          04430000
   END;  /* WHEN */                                                     04440000
1                                    /* SITUATION - 6                */ 04450000
 WHEN (RCB240S_FETCH.EFFECTIVE_DATE >  RCB240S_IN.END_DATE)             04460000
   DO;                                                                  04470000
     SITUATION    = '6';                                 /* PTM 0437 */ 04480000
                                     /* INSERT NEW PERIOD            */ 04490000
     IF RCB240S_FETCH.EFFECTIVE_DATE > RCB240S_IN.EFFECTIVE_DATE        04500000
     THEN                                                               04510000
       DO;                                                              04520000
         CALL RCBFAXN_NO_CEDS;                                          04530000
                                     /* SET REMAINING PERIOD         */ 04540000
         RCB240S_IN.EFFECTIVE_DATE = RCB240S_FETCH.EFFECTIVE_DATE;      04550000
       END;                                                             04560000
                                     /* HANDLE EXISTING PERIOD       */ 04570000
     RCB240S_MERGE  = RCB240S_FETCH, BY NAME;                           04580000
     RCB240SI_MERGE = RCB240SI_FETCH, BY NAME;                          04590000
     CALL RCBFAXN_COMPARE;                                              04600000
     IF ¬SWITCH_CHANGE                                                  04610000
     THEN                                                               04620000
       DO;                                                              04630000
                                     /* UPDATE PREVIOUS RECORD       */ 04640000
         RCB240S_OLD.END_DATE = RCB240S_FETCH.END_DATE;                 04650000
         RCB240S_OUT          = RCB240S_OLD, BY NAME;                   04660000
         RCB240SI_OUT         = RCB240SI_OLD, BY NAME;                  04670000
         CALL RCBFAXN_UPDATE;                                           04680000
                                     /* DELETE CEDS RECORD           */ 04690000
         RCB240S_OUT          = RCB240S_FETCH, BY NAME;                 04700000
         RCB240SI_OUT         = RCB240SI_FETCH, BY NAME;                04710000
         CALL RCBFAXN_DELETE;                                           04720000
       END;                                                             04730000
     ELSE                                                               04740000
       DO;                                                              04750000
         CALL RCBFAXN_CHANGE_ALLOWED;                                   04760000
         IF ¬SWITCH_CHANGE_ALLOWED                                      04770000
         THEN                                                           04780000
           DO;                                                          04790000
                                     /* DELETE CEDS RECORD           */ 04800000
             RCB240S_OUT  = RCB240S_FETCH, BY NAME;                     04810000
             RCB240SI_OUT = RCB240SI_FETCH, BY NAME;                    04820000
             CALL RCBFAXN_DELETE;                                       04830000
           END;                                                         04840000
       END;                                                             04850000
                                     /* SET REMAINING PERIOD         */ 04860000
     RCB240S_IN.EFFECTIVE_DATE = '9999-99-99';                          04870000
   END;                                                                 04880000
 OTHERWISE;                                                             04890000
 END;                                                                   04900000
 END RCBFAXN_PROCESS_FETCH;                                             04910000
1/********************************************************************/ 04920000
 /*                                                                  */ 04930000
 /* MODULE NAME      : PROCESS_SIT4                                  */ 04940000
 /*                                                                  */ 04950000
 /* DESCRIPTION      : PROCESS FOR SITUATION - 4                     */ 04960000
 /*                                                                  */ 04970000
 /* COMMENT          : INSERTED DURING PTM 496 IMPLEMENTATION        */ 04980000
 /*                                                                  */ 04990000
 /********************************************************************/ 05000000
0RCBFAXN_PROCESS_SIT4: PROC;                                            05010000
                                                                        05020000
 RCB240S_OUT            = RCB240S_FETCH, BY NAME;                       05030000
 RCB240SI_OUT           = RCB240SI_FETCH, BY NAME;                      05040000
 CALL RCBFAXN_DELETE;                                                   05050000
                                   /* UPDATE/INSERT                  */ 05060000
 CALL RCBFAXN_COMPARE;                                                  05070000
 IF ¬SWITCH_CHANGE                                                      05080000
 THEN                                                                   05090000
   DO;                                                                  05100000
     RCB240S_OUT            = RCB240S_OLD, BY NAME;                     05110000
     RCB240SI_OUT           = RCB240SI_OLD, BY NAME;                    05120000
     RCB240S_OUT.END_DATE   = RCB240S_FETCH.END_DATE;                   05130000
     CALL RCBFAXN_UPDATE;                                               05140000
   END;                                                                 05150000
 ELSE                                                                   05160000
   DO;                                                                  05170000
     RCB240S_OUT            = RCB240S_MERGE, BY NAME;                   05180000
     RCB240SI_OUT           = RCB240SI_MERGE, BY NAME;                  05190000
     RCB240S_OUT.END_DATE   = RCB240S_FETCH.END_DATE;                   05200000
     CALL RCBFAXN_INSERT;                                               05210000
   END;                                                                 05220000
                           /* CREATE OLD RECORD              */         05230000
 RCB240S_OLD            = RCB240S_OUT, BY NAME;                         05240000
 RCB240SI_OLD           = RCB240SI_OUT, BY NAME;                        05250000
                                                                        05260000
 END RCBFAXN_PROCESS_SIT4;                                              05270000
1/********************************************************************/ 05280000
 /*                                                                  */ 05290000
 /* MODULE NAME      : PROCESS_SIT4_SP                               */ 05300000
 /*                                                                  */ 05310000
 /* DESCRIPTION      : PROCESS FOR SPECIAL SITUATION - 4             */ 05320000
 /*                                                                  */ 05330000
 /* COMMENT          : INSERTED DURING PTM 496 IMPLEMENTATION        */ 05340000
 /*                                                                  */ 05350000
 /********************************************************************/ 05360000
0RCBFAXN_PROCESS_SIT4_SP: PROC;                                         05370000
                                   /* UPDATE/INSERT                  */ 05380000
 CALL RCBFAXN_COMPARE;                                                  05390000
 IF ¬SWITCH_CHANGE                                                      05400000
 THEN                                                                   05410000
   DO;                                                                  05420000
     RCB240S_OUT            = RCB240S_OLD, BY NAME;                     05430000
     RCB240SI_OUT           = RCB240SI_OLD, BY NAME;                    05440000
     CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.EFFECTIVE_DATE,-1,          05450000
                              RCB240S_OUT.END_DATE);                    05460000
     CALL RCBFAXN_UPDATE;                                               05470000
   END;                                                                 05480000
 ELSE                                                                   05490000
   DO;                                                                  05500000
     RCB240S_OUT            = RCB240S_MERGE, BY NAME;                   05510000
     RCB240SI_OUT           = RCB240SI_MERGE, BY NAME;                  05520000
     CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.EFFECTIVE_DATE,-1,          05530000
                              RCB240S_OUT.END_DATE);                    05540000
     CALL RCBFAXN_INSERT;                                               05550000
   END;                                                                 05560000
                                 /* CREATE OLD RECORD              */   05570000
 RCB240S_OLD            = RCB240S_FETCH, BY NAME;                       05580000
 RCB240SI_OLD           = RCB240SI_FETCH, BY NAME;                      05590000
                                                                        05600000
 END RCBFAXN_PROCESS_SIT4_SP;                                           05610000
1/********************************************************************/ 05620000
 /*                                                                  */ 05630000
 /* MODULE NAME      : PROCESS_SIT5                                  */ 05640000
 /*                                                                  */ 05650000
 /* DESCRIPTION      : PROCESS FOR SITUATION - 5                     */ 05660000
 /*                                                                  */ 05670000
 /* COMMENT          : INSERTED DURING PTM 496 IMPLEMENTATION        */ 05680000
 /*                                                                  */ 05690000
 /********************************************************************/ 05700000
0RCBFAXN_PROCESS_SIT5: PROC;                                            05710000
                                  /* DELETE CEDS RECORD             */  05720000
 RCB240S_OUT          = RCB240S_FETCH, BY NAME;                         05730000
 RCB240SI_OUT         = RCB240SI_FETCH, BY NAME;                        05740000
 CALL RCBFAXN_DELETE;                                                   05750000
                                 /* INSERT CEDS RECORD WITH NEW    */   05760000
                                 /* EFFECTIVE DATE                 */   05770000
 RCB240S_OUT                = RCB240S_FETCH, BY NAME;                   05780000
 RCB240SI_OUT               = RCB240SI_FETCH, BY NAME;                  05790000
 RCB240S_OUT.EFFECTIVE_DATE = WRK_NEXT_DATE;                            05800000
 CALL RCBFAXN_INSERT;                                                   05810000
                                 /*  UPDATE/INSERT                 */   05820000
 CALL RCBFAXN_COMPARE;                                                  05830000
 IF ¬SWITCH_CHANGE                                                      05840000
 THEN                                                                   05850000
   DO;                                                                  05860000
     RCB240S_OUT            = RCB240S_OLD, BY NAME;                     05870000
     RCB240SI_OUT           = RCB240SI_OLD, BY NAME;                    05880000
     RCB240S_OUT.END_DATE   = RCB240S_MERGE.END_DATE;                   05890000
     CALL RCBFAXN_UPDATE;                                               05900000
   END;                                                                 05910000
 ELSE                                                                   05920000
   DO;                                                                  05930000
     RCB240S_OUT            = RCB240S_MERGE, BY NAME;                   05940000
     RCB240SI_OUT           = RCB240SI_MERGE, BY NAME;                  05950000
     CALL RCBFAXN_INSERT;                                               05960000
   END;                                                                 05970000
                                                                        05980000
 END RCBFAXN_PROCESS_SIT5;                                              05990000
1/********************************************************************/ 06000000
 /*                                                                  */ 06010000
 /* MODULE NAME      : PROCESS_SIT5_SP                               */ 06020000
 /*                                                                  */ 06030000
 /* DESCRIPTION      : PROCESS FOR SPECIAL SITUATION - 5             */ 06040000
 /*                                                                  */ 06050000
 /* COMMENT          : INSERTED DURING PTM 496 IMPLEMENTATION        */ 06060000
 /*                                                                  */ 06070000
 /********************************************************************/ 06080000
0RCBFAXN_PROCESS_SIT5_SP: PROC;                                         06090000
                                   /* UPDATE/INSERT                  */ 06100000
 CALL RCBFAXN_COMPARE;                                                  06110000
 IF ¬SWITCH_CHANGE                                                      06120000
 THEN                                                                   06130000
   DO;                                                                  06140000
     RCB240S_OUT            = RCB240S_OLD, BY NAME;                     06150000
     RCB240SI_OUT           = RCB240SI_OLD, BY NAME;                    06160000
     CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.EFFECTIVE_DATE,-1,          06170000
                              RCB240S_OUT.END_DATE);                    06180000
     CALL RCBFAXN_UPDATE;                                               06190000
   END;                                                                 06200000
 ELSE                                                                   06210000
   DO;                                                                  06220000
     RCB240S_OUT            = RCB240S_MERGE, BY NAME;                   06230000
     RCB240SI_OUT           = RCB240SI_MERGE, BY NAME;                  06240000
     CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.EFFECTIVE_DATE,-1,          06250000
                              RCB240S_OUT.END_DATE);                    06260000
     CALL RCBFAXN_INSERT;                                               06270000
   END;                                                                 06280000
                                                                        06290000
 END RCBFAXN_PROCESS_SIT5_SP;                                           06300000
1/********************************************************************/ 06310000
 /*                                                                  */ 06320000
 /* MODULE NAME      : PROCESS_RECORD                                */ 06330000
 /*                                                                  */ 06340000
 /* DESCRIPTION      : PROCESS INPUT RECORD                          */ 06350000
 /*                                                                  */ 06360000
 /********************************************************************/ 06370000
0RCBFAXN_PROCESS_RECORD: PROC;                                          06380000
0IF RCB240S_IN.EFFECTIVE_DATE <= RCB240S_IN.END_DATE                    06390000
 THEN                                                                   06400000
   DO;                                                                  06410000
                                     /* BLANK OUT NOT OWNED FIELDS   */ 06420000
     RCB240S_MERGE  = RCB240S_IN, BY NAME;                              06430000
     RCB240SI_MERGE = RCB240SI_IN, BY NAME;                             06440000
     CALL RCBFAXN_COMPLETE;                                             06450000
     CALL RCBFAXN_COMPARE;                                              06460000
     IF ¬SWITCH_CHANGE                                                  06470000
     THEN                                                               06480000
       DO;                                                              06490000
                                     /* UPDATE OLD PREVIOUS RECORD   */ 06500000
         RCB240S_OLD.END_DATE = RCB240S_IN.END_DATE;                    06510000
         RCB240S_OUT          = RCB240S_OLD, BY NAME;                   06520000
         RCB240SI_OUT         = RCB240SI_OLD, BY NAME;                  06530000
         CALL RCBFAXN_UPDATE;                                           06540000
       END;                                                             06550000
     ELSE                                                               06560000
       DO;                                                              06570000
         CALL RCBFAXN_CHANGE_ALLOWED;                                   06580000
         IF SWITCH_CHANGE_ALLOWED                                       06590000
         THEN                                                           06600000
           DO;                                                          06610000
                                     /* INSERT NEW PREVIOUS RECORD   */ 06620000
             RCB240S_OUT          = RCB240S_MERGE, BY NAME;             06630000
             RCB240SI_OUT         = RCB240SI_MERGE, BY NAME;            06640000
             CALL RCBFAXN_INSERT;                                       06650000
           END;                                                         06660000
       END;                                                             06670000
   END;                                                                 06680000
 END RCBFAXN_PROCESS_RECORD;                                            06690000
1/********************************************************************/ 06700000
 /*                                                                  */ 06710000
 /* MODULE NAME      : NO_CEDS                                       */ 06720000
 /*                                                                  */ 06730000
 /* DESCRIPTION      : PROCESS INPUT RECORD FOR PERIOD WHERE NO      */ 06740000
 /*                    CEDS INFORMATION EXISTS                       */ 06750000
 /*                                                                  */ 06760000
 /********************************************************************/ 06770000
0RCBFAXN_NO_CEDS: PROC;                                                 06780000
0RCB240S_MERGE  = RCB240S_IN, BY NAME;                                  06790000
 RCB240SI_MERGE = RCB240SI_IN, BY NAME;                                 06800000
 CALL RCBFAXN_COMPLETE;                                                 06810000
0CALL RCBFAXN_COMPARE;                                                  06820000
 IF ¬SWITCH_CHANGE                                                      06830000
 THEN                                                                   06840000
   DO;                                                                  06850000
                                     /* UPDATE OLD PREVIOUS RECORD   */ 06860000
     CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.EFFECTIVE_DATE, -1,         06870000
                              RCB240S_OLD.END_DATE);                    06880000
     RCB240S_OUT  = RCB240S_OLD, BY NAME;                               06890000
     RCB240SI_OUT = RCB240SI_OLD, BY NAME;                              06900000
     CALL RCBFAXN_UPDATE;                                               06910000
   END;                                                                 06920000
 ELSE                                                                   06930000
   DO;                                                                  06940000
                                     /* STORE NEW PREVIOUS RECORD    */ 06950000
     RCB240S_OLD  = RCB240S_MERGE, BY NAME;                             06960000
     RCB240SI_OLD = RCB240SI_MERGE, BY NAME;                            06970000
     CALL RCBFAXN_TRANS_DATE (RCB240S_FETCH.EFFECTIVE_DATE, -1,         06980000
                              RCB240S_OLD.END_DATE);                    06990000
                                 /* INSERT NEW PREVIOUS RECORD   */     07000000
     RCB240S_OUT  = RCB240S_OLD, BY NAME;                               07010000
     RCB240SI_OUT = RCB240SI_OLD, BY NAME;                              07020000
     CALL RCBFAXN_INSERT;                                               07030000
   END;                                                                 07040000
0END RCBFAXN_NO_CEDS;                                                   07050000
1/********************************************************************/ 07060000
 /*                                                                  */ 07070000
 /* MODULE NAME      : COMPARE                                       */ 07080000
 /*                                                                  */ 07090000
 /* DESCRIPTION      : COMPARE ALL FIELDS OF THE MERGED AND OLD      */ 07100000
 /*                    RECORD, EXCEPT FOR THE DATES                  */ 07110000
 /*                                                                  */ 07120000
 /********************************************************************/ 07130000
0RCBFAXN_COMPARE: PROC;                                                 07140000
0SWITCH_CHANGE = FALSE;                                                 07150000
                                     /* COMPARE FIELDS               */ 07160000
 /* CHECK ON COUNTRY_NUMBER DELETED DURING RA01104 IMPLEMENTATION */    07170000
                                                 /* START PTM 496 */    07180000
 IF RCB240SI_OLD.INDNULL(5)        ¬= RCB240SI_MERGE.INDNULL(5)         07190000
 THEN                                                                   07200000
   DO;                                                                  07210000
     SWITCH_CHANGE = TRUE;                                              07220000
   END;                                                                 07230000
 ELSE                                                                   07240000
   DO;                                                                  07250000
     IF RCB240SI_OLD.INDNULL(5)     = 0 &                               07260000
        RCB240SI_MERGE.INDNULL(5)   = 0 &                               07270000
        RCB240S_OLD.HVP_QUANTITY   ¬= RCB240S_MERGE.HVP_QUANTITY        07280000
     THEN                                                               07290000
       DO;                                                              07300000
         SWITCH_CHANGE = TRUE;                                          07310000
       END;                                                             07320000
   END;                                                                 07330000
                                                 /*   END PTM 496 */    07340000
 IF RCB240SI_OLD.INDNULL(6)        ¬= RCB240SI_MERGE.INDNULL(6)         07350000
 THEN                                                                   07360000
   DO;                                                                  07370000
     SWITCH_CHANGE = TRUE;                                              07380000
   END;                                                                 07390000
 ELSE                                                                   07400000
   DO;                                                                  07410000
     IF RCB240SI_OLD.INDNULL(6)     = 0 &                               07420000
        RCB240SI_MERGE.INDNULL(6)   = 0 &                               07430000
        RCB240S_OLD.CONTRACT_NUMBER¬= RCB240S_MERGE.CONTRACT_NUMBER     07440000
     THEN                                                               07450000
       DO;                                                              07460000
         SWITCH_CHANGE = TRUE;                                          07470000
       END;                                                             07480000
   END;                                                                 07490000
 IF RCB240SI_OLD.INDNULL(7)        ¬= RCB240SI_MERGE.INDNULL(7)         07500000
 THEN                                                                   07510000
   DO;                                                                  07520000
     SWITCH_CHANGE = TRUE;                                              07530000
   END;                                                                 07540000
 ELSE                                                                   07550000
   DO;                                                                  07560000
     IF RCB240SI_OLD.INDNULL(7)     = 0 &                               07570000
        RCB240SI_MERGE.INDNULL(7)   = 0 &                               07580000
        RCB240S_OLD.SERVICE_START_DATE                                  07590000
                                   ¬= RCB240S_MERGE.SERVICE_START_DATE  07600000
     THEN                                                               07610000
       DO;                                                              07620000
         SWITCH_CHANGE = TRUE;                                          07630000
       END;                                                             07640000
   END;                                                                 07650000
 IF RCB240SI_OLD.INDNULL(8)        ¬= RCB240SI_MERGE.INDNULL(8)         07660000
 THEN                                                                   07670000
   DO;                                                                  07680000
     SWITCH_CHANGE = TRUE;                                              07690000
   END;                                                                 07700000
 ELSE                                                                   07710000
   DO;                                                                  07720000
     IF RCB240SI_OLD.INDNULL(8)     = 0 &                               07730000
        RCB240SI_MERGE.INDNULL(8)   = 0 &                               07740000
        RCB240S_OLD.SERVICE_STOP_DATE                                   07750000
                                   ¬= RCB240S_MERGE.SERVICE_STOP_DATE   07760000
     THEN                                                               07770000
       DO;                                                              07780000
         SWITCH_CHANGE = TRUE;                                          07790000
       END;                                                             07800000
   END;                                                                 07810000
 IF RCB240SI_OLD.INDNULL(9)        ¬= RCB240SI_MERGE.INDNULL(9)         07820000
 THEN                                                                   07830000
   DO;                                                                  07840000
     SWITCH_CHANGE = TRUE;                                              07850000
   END;                                                                 07860000
 ELSE                                                                   07870000
   DO;                                                                  07880000
     IF RCB240SI_OLD.INDNULL(9)     = 0 &                               07890000
        RCB240SI_MERGE.INDNULL(9)   = 0 &                               07900000
        RCB240S_OLD.SUPPL_CTR_NUMBER                                    07910000
                                   ¬= RCB240S_MERGE.SUPPL_CTR_NUMBER    07920000
     THEN                                                               07930000
       DO;                                                              07940000
         SWITCH_CHANGE = TRUE;                                          07950000
       END;                                                             07960000
   END;                                                                 07970000
 IF RCB240SI_OLD.INDNULL(10)       ¬= RCB240SI_MERGE.INDNULL(10)        07980000
 THEN                                                                   07990000
   DO;                                                                  08000000
     SWITCH_CHANGE = TRUE;                                              08010000
   END;                                                                 08020000
 ELSE                                                                   08030000
   DO;                                                                  08040000
     IF RCB240SI_OLD.INDNULL(10)    = 0 &                               08050000
        RCB240SI_MERGE.INDNULL(10)  = 0 &                               08060000
        RCB240S_OLD.SERVICE_MODULE_1                                    08070000
                                   ¬= RCB240S_MERGE.SERVICE_MODULE_1    08080000
     THEN                                                               08090000
       DO;                                                              08100000
         SWITCH_CHANGE = TRUE;                                          08110000
       END;                                                             08120000
   END;                                                                 08130000
 IF RCB240SI_OLD.INDNULL(11)       ¬= RCB240SI_MERGE.INDNULL(11)        08140000
 THEN                                                                   08150000
   DO;                                                                  08160000
     SWITCH_CHANGE = TRUE;                                              08170000
   END;                                                                 08180000
 ELSE                                                                   08190000
   DO;                                                                  08200000
     IF RCB240SI_OLD.INDNULL(11)    = 0 &                               08210000
        RCB240SI_MERGE.INDNULL(11)  = 0 &                               08220000
        RCB240S_OLD.SERVICE_MODULE_2                                    08230000
                                   ¬= RCB240S_MERGE.SERVICE_MODULE_2    08240000
     THEN                                                               08250000
       DO;                                                              08260000
         SWITCH_CHANGE = TRUE;                                          08270000
       END;                                                             08280000
   END;                                                                 08290000
 IF RCB240SI_OLD.INDNULL(12)       ¬= RCB240SI_MERGE.INDNULL(12)        08300000
 THEN                                                                   08310000
   DO;                                                                  08320000
     SWITCH_CHANGE = TRUE;                                              08330000
   END;                                                                 08340000
 ELSE                                                                   08350000
   DO;                                                                  08360000
     IF RCB240SI_OLD.INDNULL(12)    = 0 &                               08370000
        RCB240SI_MERGE.INDNULL(12)  = 0 &                               08380000
        RCB240S_OLD.SERVICE_MODULE_3                                    08390000
                                   ¬= RCB240S_MERGE.SERVICE_MODULE_3    08400000
     THEN                                                               08410000
       DO;                                                              08420000
         SWITCH_CHANGE = TRUE;                                          08430000
       END;                                                             08440000
   END;                                                                 08450000
 IF RCB240SI_OLD.INDNULL(13)       ¬= RCB240SI_MERGE.INDNULL(13)        08460000
 THEN                                                                   08470000
   DO;                                                                  08480000
     SWITCH_CHANGE = TRUE;                                              08490000
   END;                                                                 08500000
 ELSE                                                                   08510000
   DO;                                                                  08520000
     IF RCB240SI_OLD.INDNULL(13)    = 0 &                               08530000
        RCB240SI_MERGE.INDNULL(13)  = 0 &                               08540000
        RCB240S_OLD.SERVICE_MODULE_4                                    08550000
                                   ¬= RCB240S_MERGE.SERVICE_MODULE_4    08560000
     THEN                                                               08570000
       DO;                                                              08580000
         SWITCH_CHANGE = TRUE;                                          08590000
       END;                                                             08600000
   END;                                                                 08610000
 IF RCB240SI_OLD.INDNULL(14)       ¬= RCB240SI_MERGE.INDNULL(14)        08620000
 THEN                                                                   08630000
   DO;                                                                  08640000
     SWITCH_CHANGE = TRUE;                                              08650000
   END;                                                                 08660000
 ELSE                                                                   08670000
   DO;                                                                  08680000
     IF RCB240SI_OLD.INDNULL(14)    = 0 &                               08690000
        RCB240SI_MERGE.INDNULL(14)  = 0 &                               08700000
        RCB240S_OLD.SERVICE_MODULE_5                                    08710000
                                   ¬= RCB240S_MERGE.SERVICE_MODULE_5    08720000
     THEN                                                               08730000
       DO;                                                              08740000
         SWITCH_CHANGE = TRUE;                                          08750000
       END;                                                             08760000
   END;                                                                 08770000
 IF RCB240SI_OLD.INDNULL(15)       ¬= RCB240SI_MERGE.INDNULL(15)        08780000
 THEN                                                                   08790000
   DO;                                                                  08800000
     SWITCH_CHANGE = TRUE;                                              08810000
   END;                                                                 08820000
 ELSE                                                                   08830000
   DO;                                                                  08840000
     IF RCB240SI_OLD.INDNULL(15)    = 0 &                               08850000
        RCB240SI_MERGE.INDNULL(15)  = 0 &                               08860000
        RCB240S_OLD.AGREEMENT_TYPE ¬= RCB240S_MERGE.AGREEMENT_TYPE      08870000
     THEN                                                               08880000
       DO;                                                              08890000
         SWITCH_CHANGE = TRUE;                                          08900000
       END;                                                             08910000
   END;                                                                 08920000
 IF RCB240SI_OLD.INDNULL(16)       ¬= RCB240SI_MERGE.INDNULL(16)        08930000
 THEN                                                                   08940000
   DO;                                                                  08950000
     SWITCH_CHANGE = TRUE;                                              08960000
   END;                                                                 08970000
 ELSE                                                                   08980000
   DO;                                                                  08990000
     IF RCB240SI_OLD.INDNULL(16)    = 0 &                               09000000
        RCB240SI_MERGE.INDNULL(16)  = 0 &                               09010000
        RCB240S_OLD.AGREEMENT_OPTION                                    09020000
                                   ¬= RCB240S_MERGE.AGREEMENT_OPTION    09030000
     THEN                                                               09040000
       DO;                                                              09050000
         SWITCH_CHANGE = TRUE;                                          09060000
       END;                                                             09070000
   END;                                                                 09080000
 IF RCB240SI_OLD.INDNULL(17)       ¬= RCB240SI_MERGE.INDNULL(17)        09090000
 THEN                                                                   09100000
   DO;                                                                  09110000
     SWITCH_CHANGE = TRUE;                                              09120000
   END;                                                                 09130000
 ELSE                                                                   09140000
   DO;                                                                  09150000
     IF RCB240SI_OLD.INDNULL(17)    = 0 &                               09160000
        RCB240SI_MERGE.INDNULL(17)  = 0 &                               09170000
        RCB240S_OLD.SPECIAL_OPTION ¬= RCB240S_MERGE.SPECIAL_OPTION      09180000
     THEN                                                               09190000
       DO;                                                              09200000
         SWITCH_CHANGE = TRUE;                                          09210000
       END;                                                             09220000
   END;                                                                 09230000
 IF RCB240SI_OLD.INDNULL(18)       ¬= RCB240SI_MERGE.INDNULL(18)        09240000
 THEN                                                                   09250000
   DO;                                                                  09260000
     SWITCH_CHANGE = TRUE;                                              09270000
   END;                                                                 09280000
 ELSE                                                                   09290000
   DO;                                                                  09300000
     IF RCB240SI_OLD.INDNULL(18)    = 0 &                               09310000
        RCB240SI_MERGE.INDNULL(18)  = 0 &                               09320000
        RCB240S_OLD.AMENDM_COMB_CODE                                    09330000
                                   ¬= RCB240S_MERGE.AMENDM_COMB_CODE    09340000
     THEN                                                               09350000
       DO;                                                              09360000
         SWITCH_CHANGE = TRUE;                                          09370000
       END;                                                             09380000
   END;                                                                 09390000
 IF RCB240SI_OLD.INDNULL(19)       ¬= RCB240SI_MERGE.INDNULL(19)        09400000
 THEN                                                                   09410000
   DO;                                                                  09420000
     SWITCH_CHANGE = TRUE;                                              09430000
   END;                                                                 09440000
 ELSE                                                                   09450000
   DO;                                                                  09460000
     IF RCB240SI_OLD.INDNULL(19)    = 0 &                               09470000
        RCB240SI_MERGE.INDNULL(19)  = 0 &                               09480000
        RCB240S_OLD.COVERAGE_START_1                                    09490000
                                   ¬= RCB240S_MERGE.COVERAGE_START_1    09500000
     THEN                                                               09510000
       DO;                                                              09520000
         SWITCH_CHANGE = TRUE;                                          09530000
       END;                                                             09540000
   END;                                                                 09550000
 IF RCB240SI_OLD.INDNULL(20)       ¬= RCB240SI_MERGE.INDNULL(20)        09560000
 THEN                                                                   09570000
   DO;                                                                  09580000
     SWITCH_CHANGE = TRUE;                                              09590000
   END;                                                                 09600000
 ELSE                                                                   09610000
   DO;                                                                  09620000
     IF RCB240SI_OLD.INDNULL(20)    = 0 &                               09630000
        RCB240SI_MERGE.INDNULL(20)  = 0 &                               09640000
        RCB240S_OLD.COVERAGE_END_1 ¬= RCB240S_MERGE.COVERAGE_END_1      09650000
     THEN                                                               09660000
       DO;                                                              09670000
         SWITCH_CHANGE = TRUE;                                          09680000
       END;                                                             09690000
   END;                                                                 09700000
 IF RCB240SI_OLD.INDNULL(21)       ¬= RCB240SI_MERGE.INDNULL(21)        09710000
 THEN                                                                   09720000
   DO;                                                                  09730000
     SWITCH_CHANGE = TRUE;                                              09740000
   END;                                                                 09750000
 ELSE                                                                   09760000
   DO;                                                                  09770000
     IF RCB240SI_OLD.INDNULL(21)    = 0 &                               09780000
        RCB240SI_MERGE.INDNULL(21)  = 0 &                               09790000
        RCB240S_OLD.COVERAGE_START_2                                    09800000
                                   ¬= RCB240S_MERGE.COVERAGE_START_2    09810000
     THEN                                                               09820000
       DO;                                                              09830000
         SWITCH_CHANGE = TRUE;                                          09840000
       END;                                                             09850000
   END;                                                                 09860000
 IF RCB240SI_OLD.INDNULL(22)       ¬= RCB240SI_MERGE.INDNULL(22)        09870000
 THEN                                                                   09880000
   DO;                                                                  09890000
     SWITCH_CHANGE = TRUE;                                              09900000
   END;                                                                 09910000
 ELSE                                                                   09920000
   DO;                                                                  09930000
     IF RCB240SI_OLD.INDNULL(22)    = 0 &                               09940000
        RCB240SI_MERGE.INDNULL(22)  = 0 &                               09950000
        RCB240S_OLD.COVERAGE_END_2 ¬= RCB240S_MERGE.COVERAGE_END_2      09960000
     THEN                                                               09970000
       DO;                                                              09980000
         SWITCH_CHANGE = TRUE;                                          09990000
       END;                                                             10000000
   END;                                                                 10010000
 IF RCB240SI_OLD.INDNULL(23)       ¬= RCB240SI_MERGE.INDNULL(23)        10020000
 THEN                                                                   10030000
   DO;                                                                  10040000
     SWITCH_CHANGE = TRUE;                                              10050000
   END;                                                                 10060000
 ELSE                                                                   10070000
   DO;                                                                  10080000
     IF RCB240SI_OLD.INDNULL(23)    = 0 &                               10090000
        RCB240SI_MERGE.INDNULL(23)  = 0 &                               10100000
        RCB240S_OLD.COVERAGE_START_3                                    10110000
                                   ¬= RCB240S_MERGE.COVERAGE_START_3    10120000
     THEN                                                               10130000
       DO;                                                              10140000
         SWITCH_CHANGE = TRUE;                                          10150000
       END;                                                             10160000
   END;                                                                 10170000
 IF RCB240SI_OLD.INDNULL(24)       ¬= RCB240SI_MERGE.INDNULL(24)        10180000
 THEN                                                                   10190000
   DO;                                                                  10200000
     SWITCH_CHANGE = TRUE;                                              10210000
   END;                                                                 10220000
 ELSE                                                                   10230000
   DO;                                                                  10240000
     IF RCB240SI_OLD.INDNULL(24)    = 0 &                               10250000
        RCB240SI_MERGE.INDNULL(24)  = 0 &                               10260000
        RCB240S_OLD.COVERAGE_END_3 ¬= RCB240S_MERGE.COVERAGE_END_3      10270000
     THEN                                                               10280000
       DO;                                                              10290000
         SWITCH_CHANGE = TRUE;                                          10300000
       END;                                                             10310000
   END;                                                                 10320000
 IF RCB240SI_OLD.INDNULL(25)       ¬= RCB240SI_MERGE.INDNULL(25)        10330000
 THEN                                                                   10340000
   DO;                                                                  10350000
     SWITCH_CHANGE = TRUE;                                              10360000
   END;                                                                 10370000
 ELSE                                                                   10380000
   DO;                                                                  10390000
     IF RCB240SI_OLD.INDNULL(25)    = 0 &                               10400000
        RCB240SI_MERGE.INDNULL(25)  = 0 &                               10410000
        RCB240S_OLD.COVERAGE_START_4                                    10420000
                                   ¬= RCB240S_MERGE.COVERAGE_START_4    10430000
     THEN                                                               10440000
       DO;                                                              10450000
         SWITCH_CHANGE = TRUE;                                          10460000
       END;                                                             10470000
   END;                                                                 10480000
 IF RCB240SI_OLD.INDNULL(26)       ¬= RCB240SI_MERGE.INDNULL(26)        10490000
 THEN                                                                   10500000
   DO;                                                                  10510000
     SWITCH_CHANGE = TRUE;                                              10520000
   END;                                                                 10530000
 ELSE                                                                   10540000
   DO;                                                                  10550000
     IF RCB240SI_OLD.INDNULL(26)    = 0 &                               10560000
        RCB240SI_MERGE.INDNULL(26)  = 0 &                               10570000
        RCB240S_OLD.COVERAGE_END_4 ¬= RCB240S_MERGE.COVERAGE_END_4      10580000
     THEN                                                               10590000
       DO;                                                              10600000
         SWITCH_CHANGE = TRUE;                                          10610000
       END;                                                             10620000
   END;                                                                 10630000
 IF RCB240SI_OLD.INDNULL(27)       ¬= RCB240SI_MERGE.INDNULL(27)        10640000
 THEN                                                                   10650000
   DO;                                                                  10660000
     SWITCH_CHANGE = TRUE;                                              10670000
   END;                                                                 10680000
 ELSE                                                                   10690000
   DO;                                                                  10700000
     IF RCB240SI_OLD.INDNULL(27)    = 0 &                               10710000
        RCB240SI_MERGE.INDNULL(27)  = 0 &                               10720000
        RCB240S_OLD.COVERAGE_START_5                                    10730000
                                   ¬= RCB240S_MERGE.COVERAGE_START_5    10740000
     THEN                                                               10750000
       DO;                                                              10760000
         SWITCH_CHANGE = TRUE;                                          10770000
       END;                                                             10780000
   END;                                                                 10790000
 IF RCB240SI_OLD.INDNULL(28)       ¬= RCB240SI_MERGE.INDNULL(28)        10800000
 THEN                                                                   10810000
   DO;                                                                  10820000
     SWITCH_CHANGE = TRUE;                                              10830000
   END;                                                                 10840000
 ELSE                                                                   10850000
   DO;                                                                  10860000
     IF RCB240SI_OLD.INDNULL(28)    = 0 &                               10870000
        RCB240SI_MERGE.INDNULL(28)  = 0 &                               10880000
        RCB240S_OLD.COVERAGE_END_5 ¬= RCB240S_MERGE.COVERAGE_END_5      10890000
     THEN                                                               10900000
       DO;                                                              10910000
         SWITCH_CHANGE = TRUE;                                          10920000
       END;                                                             10930000
   END;                                                                 10940000
 IF RCB240SI_OLD.INDNULL(29)       ¬= RCB240SI_MERGE.INDNULL(29)        10950000
 THEN                                                                   10960000
   DO;                                                                  10970000
     SWITCH_CHANGE = TRUE;                                              10980000
   END;                                                                 10990000
 ELSE                                                                   11000000
   DO;                                                                  11010000
     IF RCB240SI_OLD.INDNULL(29)    = 0 &                               11020000
        RCB240SI_MERGE.INDNULL(29)  = 0 &                               11030000
        RCB240S_OLD.COVERAGE_START_6                                    11040000
                                   ¬= RCB240S_MERGE.COVERAGE_START_6    11050000
     THEN                                                               11060000
       DO;                                                              11070000
         SWITCH_CHANGE = TRUE;                                          11080000
       END;                                                             11090000
   END;                                                                 11100000
 IF RCB240SI_OLD.INDNULL(30)       ¬= RCB240SI_MERGE.INDNULL(30)        11110000
 THEN                                                                   11120000
   DO;                                                                  11130000
     SWITCH_CHANGE = TRUE;                                              11140000
   END;                                                                 11150000
 ELSE                                                                   11160000
   DO;                                                                  11170000
     IF RCB240SI_OLD.INDNULL(30)    = 0 &                               11180000
        RCB240SI_MERGE.INDNULL(30)  = 0 &                               11190000
        RCB240S_OLD.COVERAGE_END_6 ¬= RCB240S_MERGE.COVERAGE_END_6      11200000
     THEN                                                               11210000
       DO;                                                              11220000
         SWITCH_CHANGE = TRUE;                                          11230000
       END;                                                             11240000
   END;                                                                 11250000
 IF RCB240SI_OLD.INDNULL(31)       ¬= RCB240SI_MERGE.INDNULL(31)        11260000
 THEN                                                                   11270000
   DO;                                                                  11280000
     SWITCH_CHANGE = TRUE;                                              11290000
   END;                                                                 11300000
 ELSE                                                                   11310000
   DO;                                                                  11320000
     IF RCB240SI_OLD.INDNULL(31)    = 0 &                               11330000
        RCB240SI_MERGE.INDNULL(31)  = 0 &                               11340000
        RCB240S_OLD.COVERAGE_START_7                                    11350000
                                   ¬= RCB240S_MERGE.COVERAGE_START_7    11360000
     THEN                                                               11370000
       DO;                                                              11380000
         SWITCH_CHANGE = TRUE;                                          11390000
       END;                                                             11400000
   END;                                                                 11410000
 IF RCB240SI_OLD.INDNULL(32)       ¬= RCB240SI_MERGE.INDNULL(32)        11420000
 THEN                                                                   11430000
   DO;                                                                  11440000
     SWITCH_CHANGE = TRUE;                                              11450000
   END;                                                                 11460000
 ELSE                                                                   11470000
   DO;                                                                  11480000
     IF RCB240SI_OLD.INDNULL(32)    = 0 &                               11490000
        RCB240SI_MERGE.INDNULL(32)  = 0 &                               11500000
        RCB240S_OLD.COVERAGE_END_7 ¬= RCB240S_MERGE.COVERAGE_END_7      11510000
     THEN                                                               11520000
       DO;                                                              11530000
         SWITCH_CHANGE = TRUE;                                          11540000
       END;                                                             11550000
   END;                                                                 11560000
 IF RCB240SI_OLD.INDNULL(33)       ¬= RCB240SI_MERGE.INDNULL(33)        11570000
 THEN                                                                   11580000
   DO;                                                                  11590000
     SWITCH_CHANGE = TRUE;                                              11600000
   END;                                                                 11610000
 ELSE                                                                   11620000
   DO;                                                                  11630000
     IF RCB240SI_OLD.INDNULL(33)    = 0 &                               11640000
        RCB240SI_MERGE.INDNULL(33)  = 0 &                               11650000
        RCB240S_OLD.SERVICE_TYPE   ¬= RCB240S_MERGE.SERVICE_TYPE        11660000
     THEN                                                               11670000
       DO;                                                              11680000
         SWITCH_CHANGE = TRUE;                                          11690000
       END;                                                             11700000
   END;                                                                 11710000
                                                 /* START OF RC01192 */ 11720000
   IF RCB240SI_OLD.INDNULL(34)       ¬= RCB240SI_MERGE.INDNULL(34)      11730000
   THEN                                                                 11740000
     DO;                                                                11750000
       SWITCH_CHANGE = TRUE;                                            11760000
     END;                                                               11770000
   ELSE                                                                 11780000
     DO;                                                                11790000
       IF RCB240SI_OLD.INDNULL(34)    = 0 &                             11800000
          RCB240SI_MERGE.INDNULL(34)  = 0 &                             11810000
          RCB240S_OLD.SERVICE_LVL_CODE                                  11820000
                                     ¬= RCB240S_MERGE.SERVICE_LVL_CODE  11830000
       THEN                                                             11840000
         DO;                                                            11850000
           SWITCH_CHANGE = TRUE;                                        11860000
         END;                                                           11870000
       END;                                                             11880000
                                                   /* END OF RC01192 */ 11890000
 IF RCB240SI_OLD.INDNULL(35)       ¬= RCB240SI_MERGE.INDNULL(35)        11900000
 THEN                                                                   11910000
   DO;                                                                  11920000
     SWITCH_CHANGE = TRUE;                                              11930000
   END;                                                                 11940000
 ELSE                                                                   11950000
   DO;                                                                  11960000
     IF RCB240SI_OLD.INDNULL(35)    = 0 &                 /* RC01192 */ 11970000
        RCB240SI_MERGE.INDNULL(35)  = 0 &                 /* RC01192 */ 11980000
        RCB240S_OLD.SOURCE_INDICATOR                                    11990000
                                   ¬= RCB240S_MERGE.SOURCE_INDICATOR    12000000
     THEN                                                               12010000
       DO;                                                              12020000
         SWITCH_CHANGE = TRUE;                                          12030000
       END;                                                             12040000
   END;                                                                 12050000
 END RCBFAXN_COMPARE;                                                   12060000
1/********************************************************************/ 12070000
 /*                                                                  */ 12080000
 /* MODULE NAME      : CHANGE_ALLOWED                                */ 12090000
 /*                                                                  */ 12100000
 /* DESCRIPTION      : CHECK IF THE PROPOSED CHANGE IS ALLOWED FROM  */ 12110000
 /*                    OLD TO MERGED RECORD. IF NOT ALLOWED SKIP     */ 12120000
 /*                    PERIOD                                        */ 12130000
 /*                                                                  */ 12140000
 /*         - INSERT OR UPDATE ACTIONS ARE ONLY ALLOWED IF:          */ 12150000
 /*           *  SUPPLYING SYSTEM IS THE CURRENT OWNER         OR    */ 12160000
 /*           *  SUPPLYING SYSTEM IS THE PREFERED OWNER              */ 12170000
 /*           *  CURRENT OWNER IS ONLINE                             */ 12180000
 /*                                                                  */ 12190000
 /* COMMENT           : ADAPTED DURING IMPLEMENTATION OF PTM 0437    */ 12200000
 /********************************************************************/ 12210000
0RCBFAXN_CHANGE_ALLOWED: PROC;                                          12220000
                                                                        12230000
0SWITCH_CHANGE_ALLOWED = FALSE;                                         12240000
                                                                        12250000
 IF  RCB240S_FETCH.EFFECTIVE_DATE = ' ' |       /* NO RECORD FETCHED */ 12260000
     RCB240S_FETCH.SOURCE_INDICATOR = RCB240S_IN.SOURCE_INDICATOR |     12270000
     RCB240S_FETCH.SOURCE_INDICATOR = WRK_RCBZ29S.SRC_ONLINE            12280000
 THEN                                                                   12290000
   DO;                                                                  12300000
     SWITCH_CHANGE_ALLOWED = TRUE;                                      12310000
   END;                                                                 12320000
 ELSE                                                                   12330000
   DO;                                                                  12340000
     SELECT (SITUATION);                                                12350000
     WHEN ('1')                                                         12360000
       DO;                                                              12370000
         SWITCH_CHANGE_ALLOWED = TRUE;                                  12380000
       END;                                                             12390000
     WHEN ('2');                                                        12400000
     WHEN ('3');                                                        12410000
     WHEN ('4');                                                        12420000
     WHEN ('5');                                                        12430000
     WHEN ('6')                                                         12440000
       DO;                                                              12450000
         SWITCH_CHANGE_ALLOWED = TRUE;                                  12460000
       END;                                                             12470000
     OTHERWISE                                                          12480000
        DO;                                                             12490000
          GO TO RCBFAXN_EXIT;                                           12500000
        END; /* OTHERWISE */                                            12510000
     END;   /* SELECT    */                                             12520000
   END;     /* ELSE      */                                             12530000
                                                                        12540000
 END RCBFAXN_CHANGE_ALLOWED;                                            12550000
1/********************************************************************/ 12560000
 /*                                                                  */ 12570000
 /* MODULE NAME      : MERGE                                         */ 12580000
 /*                                                                  */ 12590000
 /* DESCRIPTION      : MERGE INPUT RECORD AND CEDS RECORD INTO       */ 12600000
 /*                    MERGE RECORD                                  */ 12610000
 /*                                                                  */ 12620000
 /********************************************************************/ 12630000
0RCBFAXN_MERGE: PROC;                                                   12640000
                                     /* FIRST COPY INPUT RECORD      */ 12650000
0RCB240S_MERGE  = RCB240S_IN, BY NAME;                                  12660000
 RCB240SI_MERGE = RCB240SI_IN, BY NAME;                                 12670000
                                     /* MERGE FETCHED INTO RECORD    */ 12680000
 /* CHECK FOR COUNTRY_NUMBER DELETED DURING RA01104 IMPLEMENTATION */   12690000
                                                    /* START PTM 496 */ 12700000
 IF RCB240SI_IN.INDNULL(5)          = 99                                12710000
 THEN                                                                   12720000
   DO;                                                                  12730000
     RCB240S_MERGE.HVP_QUANTITY     = RCB240S_FETCH.HVP_QUANTITY;       12740000
     RCB240SI_MERGE.INDNULL(5)      = RCB240SI_FETCH.INDNULL(5);        12750000
   END;                                                                 12760000
                                                    /*   END PTM 496 */ 12770000
 IF RCB240SI_IN.INDNULL(6)          = 99                                12780000
 THEN                                                                   12790000
   DO;                                                                  12800000
     RCB240S_MERGE.CONTRACT_NUMBER  = RCB240S_FETCH.CONTRACT_NUMBER;    12810000
     RCB240SI_MERGE.INDNULL(6)      = RCB240SI_FETCH.INDNULL(6);        12820000
   END;                                                                 12830000
 IF RCB240SI_IN.INDNULL(7)          = 99                                12840000
 THEN                                                                   12850000
   DO;                                                                  12860000
     RCB240S_MERGE.SERVICE_START_DATE                                   12870000
                                    = RCB240S_FETCH.SERVICE_START_DATE; 12880000
     RCB240SI_MERGE.INDNULL(7)      = RCB240SI_FETCH.INDNULL(7);        12890000
   END;                                                                 12900000
 IF RCB240SI_IN.INDNULL(8)          = 99                                12910000
 THEN                                                                   12920000
   DO;                                                                  12930000
     RCB240S_MERGE.SERVICE_STOP_DATE                                    12940000
                                    = RCB240S_FETCH.SERVICE_STOP_DATE;  12950000
     RCB240SI_MERGE.INDNULL(8)      = RCB240SI_FETCH.INDNULL(8);        12960000
   END;                                                                 12970000
 IF RCB240SI_IN.INDNULL(9)          = 99                                12980000
 THEN                                                                   12990000
   DO;                                                                  13000000
     RCB240S_MERGE.SUPPL_CTR_NUMBER = RCB240S_FETCH.SUPPL_CTR_NUMBER;   13010000
     RCB240SI_MERGE.INDNULL(9)      = RCB240SI_FETCH.INDNULL(9);        13020000
   END;                                                                 13030000
 IF RCB240SI_IN.INDNULL(10)         = 99                                13040000
 THEN                                                                   13050000
   DO;                                                                  13060000
     RCB240S_MERGE.SERVICE_MODULE_1 = RCB240S_FETCH.SERVICE_MODULE_1;   13070000
     RCB240SI_MERGE.INDNULL(10)     = RCB240SI_FETCH.INDNULL(10);       13080000
   END;                                                                 13090000
 IF RCB240SI_IN.INDNULL(11)         = 99                                13100000
 THEN                                                                   13110000
   DO;                                                                  13120000
     RCB240S_MERGE.SERVICE_MODULE_2 = RCB240S_FETCH.SERVICE_MODULE_2;   13130000
     RCB240SI_MERGE.INDNULL(11)     = RCB240SI_FETCH.INDNULL(11);       13140000
   END;                                                                 13150000
 IF RCB240SI_IN.INDNULL(12)         = 99                                13160000
 THEN                                                                   13170000
   DO;                                                                  13180000
     RCB240S_MERGE.SERVICE_MODULE_3 = RCB240S_FETCH.SERVICE_MODULE_3;   13190000
     RCB240SI_MERGE.INDNULL(12)     = RCB240SI_FETCH.INDNULL(12);       13200000
   END;                                                                 13210000
 IF RCB240SI_IN.INDNULL(13)         = 99                                13220000
 THEN                                                                   13230000
   DO;                                                                  13240000
     RCB240S_MERGE.SERVICE_MODULE_4 = RCB240S_FETCH.SERVICE_MODULE_4;   13250000
     RCB240SI_MERGE.INDNULL(13)     = RCB240SI_FETCH.INDNULL(13);       13260000
   END;                                                                 13270000
 IF RCB240SI_IN.INDNULL(14)         = 99                                13280000
 THEN                                                                   13290000
   DO;                                                                  13300000
     RCB240S_MERGE.SERVICE_MODULE_5 = RCB240S_FETCH.SERVICE_MODULE_5;   13310000
     RCB240SI_MERGE.INDNULL(14)     = RCB240SI_FETCH.INDNULL(14);       13320000
   END;                                                                 13330000
 IF RCB240SI_IN.INDNULL(15)         = 99                                13340000
 THEN                                                                   13350000
   DO;                                                                  13360000
     RCB240S_MERGE.AGREEMENT_TYPE   = RCB240S_FETCH.AGREEMENT_TYPE;     13370000
     RCB240SI_MERGE.INDNULL(15)     = RCB240SI_FETCH.INDNULL(15);       13380000
   END;                                                                 13390000
 IF RCB240SI_IN.INDNULL(16)         = 99                                13400000
 THEN                                                                   13410000
   DO;                                                                  13420000
     RCB240S_MERGE.AGREEMENT_OPTION = RCB240S_FETCH.AGREEMENT_OPTION;   13430000
     RCB240SI_MERGE.INDNULL(16)     = RCB240SI_FETCH.INDNULL(16);       13440000
   END;                                                                 13450000
 IF RCB240SI_IN.INDNULL(17)         = 99                                13460000
 THEN                                                                   13470000
   DO;                                                                  13480000
     RCB240S_MERGE.SPECIAL_OPTION   = RCB240S_FETCH.SPECIAL_OPTION;     13490000
     RCB240SI_MERGE.INDNULL(17)     = RCB240SI_FETCH.INDNULL(17);       13500000
   END;                                                                 13510000
 IF RCB240SI_IN.INDNULL(18)         = 99                                13520000
 THEN                                                                   13530000
   DO;                                                                  13540000
     RCB240S_MERGE.AMENDM_COMB_CODE = RCB240S_FETCH.AMENDM_COMB_CODE;   13550000
     RCB240SI_MERGE.INDNULL(18)     = RCB240SI_FETCH.INDNULL(18);       13560000
   END;                                                                 13570000
 IF RCB240SI_IN.INDNULL(19)         = 99                                13580000
 THEN                                                                   13590000
   DO;                                                                  13600000
     RCB240S_MERGE.COVERAGE_START_1 = RCB240S_FETCH.COVERAGE_START_1;   13610000
     RCB240SI_MERGE.INDNULL(19)     = RCB240SI_FETCH.INDNULL(19);       13620000
   END;                                                                 13630000
 IF RCB240SI_IN.INDNULL(20)         = 99                                13640000
 THEN                                                                   13650000
   DO;                                                                  13660000
     RCB240S_MERGE.COVERAGE_END_1   = RCB240S_FETCH.COVERAGE_END_1;     13670000
     RCB240SI_MERGE.INDNULL(20)     = RCB240SI_FETCH.INDNULL(20);       13680000
   END;                                                                 13690000
 IF RCB240SI_IN.INDNULL(21)         = 99                                13700000
 THEN                                                                   13710000
   DO;                                                                  13720000
     RCB240S_MERGE.COVERAGE_START_2 = RCB240S_FETCH.COVERAGE_START_2;   13730000
     RCB240SI_MERGE.INDNULL(21)     = RCB240SI_FETCH.INDNULL(21);       13740000
   END;                                                                 13750000
 IF RCB240SI_IN.INDNULL(22)         = 99                                13760000
 THEN                                                                   13770000
   DO;                                                                  13780000
     RCB240S_MERGE.COVERAGE_END_2   = RCB240S_FETCH.COVERAGE_END_2;     13790000
     RCB240SI_MERGE.INDNULL(22)     = RCB240SI_FETCH.INDNULL(22);       13800000
   END;                                                                 13810000
 IF RCB240SI_IN.INDNULL(23)         = 99                                13820000
 THEN                                                                   13830000
   DO;                                                                  13840000
     RCB240S_MERGE.COVERAGE_START_3 = RCB240S_FETCH.COVERAGE_START_3;   13850000
     RCB240SI_MERGE.INDNULL(23)     = RCB240SI_FETCH.INDNULL(23);       13860000
   END;                                                                 13870000
 IF RCB240SI_IN.INDNULL(24)         = 99                                13880000
 THEN                                                                   13890000
   DO;                                                                  13900000
     RCB240S_MERGE.COVERAGE_END_3   = RCB240S_FETCH.COVERAGE_END_3;     13910000
     RCB240SI_MERGE.INDNULL(24)     = RCB240SI_FETCH.INDNULL(24);       13920000
   END;                                                                 13930000
 IF RCB240SI_IN.INDNULL(25)         = 99                                13940000
 THEN                                                                   13950000
   DO;                                                                  13960000
     RCB240S_MERGE.COVERAGE_START_4 = RCB240S_FETCH.COVERAGE_START_4;   13970000
     RCB240SI_MERGE.INDNULL(25)     = RCB240SI_FETCH.INDNULL(25);       13980000
   END;                                                                 13990000
 IF RCB240SI_IN.INDNULL(26)         = 99                                14000000
 THEN                                                                   14010000
   DO;                                                                  14020000
     RCB240S_MERGE.COVERAGE_END_4   = RCB240S_FETCH.COVERAGE_END_4;     14030000
     RCB240SI_MERGE.INDNULL(26)     = RCB240SI_FETCH.INDNULL(26);       14040000
   END;                                                                 14050000
 IF RCB240SI_IN.INDNULL(27)         = 99                                14060000
 THEN                                                                   14070000
   DO;                                                                  14080000
     RCB240S_MERGE.COVERAGE_START_5 = RCB240S_FETCH.COVERAGE_START_5;   14090000
     RCB240SI_MERGE.INDNULL(27)     = RCB240SI_FETCH.INDNULL(27);       14100000
   END;                                                                 14110000
 IF RCB240SI_IN.INDNULL(28)         = 99                                14120000
 THEN                                                                   14130000
   DO;                                                                  14140000
     RCB240S_MERGE.COVERAGE_END_5   = RCB240S_FETCH.COVERAGE_END_5;     14150000
     RCB240SI_MERGE.INDNULL(28)     = RCB240SI_FETCH.INDNULL(28);       14160000
   END;                                                                 14170000
 IF RCB240SI_IN.INDNULL(29)         = 99                                14180000
 THEN                                                                   14190000
   DO;                                                                  14200000
     RCB240S_MERGE.COVERAGE_START_6 = RCB240S_FETCH.COVERAGE_START_6;   14210000
     RCB240SI_MERGE.INDNULL(29)     = RCB240SI_FETCH.INDNULL(29);       14220000
   END;                                                                 14230000
 IF RCB240SI_IN.INDNULL(30)         = 99                                14240000
 THEN                                                                   14250000
   DO;                                                                  14260000
     RCB240S_MERGE.COVERAGE_END_6   = RCB240S_FETCH.COVERAGE_END_6;     14270000
     RCB240SI_MERGE.INDNULL(30)     = RCB240SI_FETCH.INDNULL(30);       14280000
   END;                                                                 14290000
 IF RCB240SI_IN.INDNULL(31)         = 99                                14300000
 THEN                                                                   14310000
   DO;                                                                  14320000
     RCB240S_MERGE.COVERAGE_START_7 = RCB240S_FETCH.COVERAGE_START_7;   14330000
     RCB240SI_MERGE.INDNULL(31)     = RCB240SI_FETCH.INDNULL(31);       14340000
   END;                                                                 14350000
 IF RCB240SI_IN.INDNULL(32)         = 99                                14360000
 THEN                                                                   14370000
   DO;                                                                  14380000
     RCB240S_MERGE.COVERAGE_END_7   = RCB240S_FETCH.COVERAGE_END_7;     14390000
     RCB240SI_MERGE.INDNULL(32)     = RCB240SI_FETCH.INDNULL(32);       14400000
   END;                                                                 14410000
 IF RCB240SI_IN.INDNULL(33)         = 99                                14420000
 THEN                                                                   14430000
   DO;                                                                  14440000
     RCB240S_MERGE.SERVICE_TYPE     = RCB240S_FETCH.SERVICE_TYPE;       14450000
     RCB240SI_MERGE.INDNULL(33)     = RCB240SI_FETCH.INDNULL(33);       14460000
   END;                                                                 14470000
                                                 /* START OF RC01192 */ 14480000
   IF RCB240SI_IN.INDNULL(34)         = 99                              14490000
   THEN                                                                 14500000
     DO;                                                                14510000
       RCB240S_MERGE.SERVICE_LVL_CODE = RCB240S_FETCH.SERVICE_LVL_CODE; 14520000
       RCB240SI_MERGE.INDNULL(34)     = RCB240SI_FETCH.INDNULL(34);     14530000
     END;                                                               14540000
                                                   /* END OF RC01192 */ 14550000
 IF RCB240SI_IN.INDNULL(35)         = 99                  /* RC01192 */ 14560000
 THEN                                                                   14570000
   DO;                                                                  14580000
     RCB240S_MERGE.SOURCE_INDICATOR = RCB240S_FETCH.SOURCE_INDICATOR;   14590000
     RCB240SI_MERGE.INDNULL(35)     = RCB240SI_FETCH.INDNULL(35);       14600000
   END;                                                                 14610000
 END RCBFAXN_MERGE;                                                     14620000
1/********************************************************************/ 14630000
 /*                                                                  */ 14640000
 /* MODULE NAME      : COMPLETE                                      */ 14650000
 /*                                                                  */ 14660000
 /* DESCRIPTION      : COMPLETE MERGE RECORD IF NO CEDS DATA         */ 14670000
 /*                    AVAILABLE                                     */ 14680000
 /*                                                                  */ 14690000
 /********************************************************************/ 14700000
0RCBFAXN_COMPLETE: PROC;                                                14710000
                                     /* COMPLETE OLD RECORD          */ 14720000
                                                    /* START PTM 496 */ 14730000
 IF RCB240SI_MERGE.INDNULL(5)       = 99                                14740000
 THEN                                                                   14750000
   DO;                                                                  14760000
     RCB240S_MERGE.HVP_QUANTITY     = '';                               14770000
     RCB240SI_MERGE.INDNULL(5)      = -1;                               14780000
   END;                                                                 14790000
                                                    /*   END PTM 496 */ 14800000
 IF RCB240SI_MERGE.INDNULL(6)       = 99                                14810000
 THEN                                                                   14820000
   DO;                                                                  14830000
     RCB240S_MERGE.CONTRACT_NUMBER  = '';                               14840000
     RCB240SI_MERGE.INDNULL(6)      = -1;                               14850000
   END;                                                                 14860000
 IF RCB240SI_MERGE.INDNULL(7)       = 99                                14870000
 THEN                                                                   14880000
   DO;                                                                  14890000
     RCB240S_MERGE.SERVICE_START_DATE                                   14900000
                                    = '';                               14910000
     RCB240SI_MERGE.INDNULL(7)      = -1;                               14920000
   END;                                                                 14930000
 IF RCB240SI_MERGE.INDNULL(8)       = 99                                14940000
 THEN                                                                   14950000
   DO;                                                                  14960000
     RCB240S_MERGE.SERVICE_STOP_DATE                                    14970000
                                    = '';                               14980000
     RCB240SI_MERGE.INDNULL(8)      = -1;                               14990000
   END;                                                                 15000000
 IF RCB240SI_MERGE.INDNULL(9)       = 99                                15010000
 THEN                                                                   15020000
   DO;                                                                  15030000
     RCB240S_MERGE.SUPPL_CTR_NUMBER = '';                               15040000
     RCB240SI_MERGE.INDNULL(9)      = -1;                               15050000
   END;                                                                 15060000
 IF RCB240SI_MERGE.INDNULL(10)      = 99                                15070000
 THEN                                                                   15080000
   DO;                                                                  15090000
     RCB240S_MERGE.SERVICE_MODULE_1 = '';                               15100000
     RCB240SI_MERGE.INDNULL(10)     = -1;                               15110000
   END;                                                                 15120000
 IF RCB240SI_MERGE.INDNULL(11)      = 99                                15130000
 THEN                                                                   15140000
   DO;                                                                  15150000
     RCB240S_MERGE.SERVICE_MODULE_2 = '';                               15160000
     RCB240SI_MERGE.INDNULL(11)     = -1;                               15170000
   END;                                                                 15180000
 IF RCB240SI_MERGE.INDNULL(12)      = 99                                15190000
 THEN                                                                   15200000
   DO;                                                                  15210000
     RCB240S_MERGE.SERVICE_MODULE_3 = '';                               15220000
     RCB240SI_MERGE.INDNULL(12)     = -1;                               15230000
   END;                                                                 15240000
 IF RCB240SI_MERGE.INDNULL(13)      = 99                                15250000
 THEN                                                                   15260000
   DO;                                                                  15270000
     RCB240S_MERGE.SERVICE_MODULE_4 = '';                               15280000
     RCB240SI_MERGE.INDNULL(13)     = -1;                               15290000
   END;                                                                 15300000
 IF RCB240SI_MERGE.INDNULL(14)      = 99                                15310000
 THEN                                                                   15320000
   DO;                                                                  15330000
     RCB240S_MERGE.SERVICE_MODULE_5 = '';                               15340000
     RCB240SI_MERGE.INDNULL(14)     = -1;                               15350000
   END;                                                                 15360000
 IF RCB240SI_MERGE.INDNULL(15)      = 99                                15370000
 THEN                                                                   15380000
   DO;                                                                  15390000
     RCB240S_MERGE.AGREEMENT_TYPE   = '';                               15400000
     RCB240SI_MERGE.INDNULL(15)     = -1;                               15410000
   END;                                                                 15420000
 IF RCB240SI_MERGE.INDNULL(16)      = 99                                15430000
 THEN                                                                   15440000
   DO;                                                                  15450000
     RCB240S_MERGE.AGREEMENT_OPTION = '';                               15460000
     RCB240SI_MERGE.INDNULL(16)     = -1;                               15470000
   END;                                                                 15480000
 IF RCB240SI_MERGE.INDNULL(17)      = 99                                15490000
 THEN                                                                   15500000
   DO;                                                                  15510000
     RCB240S_MERGE.SPECIAL_OPTION   = '';                               15520000
     RCB240SI_MERGE.INDNULL(17)     = -1;                               15530000
   END;                                                                 15540000
 IF RCB240SI_MERGE.INDNULL(18)      = 99                                15550000
 THEN                                                                   15560000
   DO;                                                                  15570000
     RCB240S_MERGE.AMENDM_COMB_CODE = '';                               15580000
     RCB240SI_MERGE.INDNULL(18)     = -1;                               15590000
   END;                                                                 15600000
 IF RCB240SI_MERGE.INDNULL(19)      = 99                                15610000
 THEN                                                                   15620000
   DO;                                                                  15630000
     RCB240S_MERGE.COVERAGE_START_1 = '';                               15640000
     RCB240SI_MERGE.INDNULL(19)     = -1;                               15650000
   END;                                                                 15660000
 IF RCB240SI_MERGE.INDNULL(20)      = 99                                15670000
 THEN                                                                   15680000
   DO;                                                                  15690000
     RCB240S_MERGE.COVERAGE_END_1   = '';                               15700000
     RCB240SI_MERGE.INDNULL(20)     = -1;                               15710000
   END;                                                                 15720000
 IF RCB240SI_MERGE.INDNULL(21)      = 99                                15730000
 THEN                                                                   15740000
   DO;                                                                  15750000
     RCB240S_MERGE.COVERAGE_START_2 = '';                               15760000
     RCB240SI_MERGE.INDNULL(21)     = -1;                               15770000
   END;                                                                 15780000
 IF RCB240SI_MERGE.INDNULL(22)      = 99                                15790000
 THEN                                                                   15800000
   DO;                                                                  15810000
     RCB240S_MERGE.COVERAGE_END_2   = '';                               15820000
     RCB240SI_MERGE.INDNULL(22)     = -1;                               15830000
   END;                                                                 15840000
 IF RCB240SI_MERGE.INDNULL(23)      = 99                                15850000
 THEN                                                                   15860000
   DO;                                                                  15870000
     RCB240S_MERGE.COVERAGE_START_3 = '';                               15880000
     RCB240SI_MERGE.INDNULL(23)     = -1;                               15890000
   END;                                                                 15900000
 IF RCB240SI_MERGE.INDNULL(24)      = 99                                15910000
 THEN                                                                   15920000
   DO;                                                                  15930000
     RCB240S_MERGE.COVERAGE_END_3   = '';                               15940000
     RCB240SI_MERGE.INDNULL(24)     = -1;                               15950000
   END;                                                                 15960000
 IF RCB240SI_MERGE.INDNULL(25)      = 99                                15970000
 THEN                                                                   15980000
   DO;                                                                  15990000
     RCB240S_MERGE.COVERAGE_START_4 = '';                               16000000
     RCB240SI_MERGE.INDNULL(25)     = -1;                               16010000
   END;                                                                 16020000
 IF RCB240SI_MERGE.INDNULL(26)      = 99                                16030000
 THEN                                                                   16040000
   DO;                                                                  16050000
     RCB240S_MERGE.COVERAGE_END_4   = '';                               16060000
     RCB240SI_MERGE.INDNULL(26)     = -1;                               16070000
   END;                                                                 16080000
 IF RCB240SI_MERGE.INDNULL(27)      = 99                                16090000
 THEN                                                                   16100000
   DO;                                                                  16110000
     RCB240S_MERGE.COVERAGE_START_5 = '';                               16120000
     RCB240SI_MERGE.INDNULL(27)     = -1;                               16130000
   END;                                                                 16140000
 IF RCB240SI_MERGE.INDNULL(28)      = 99                                16150000
 THEN                                                                   16160000
   DO;                                                                  16170000
     RCB240S_MERGE.COVERAGE_END_5   = '';                               16180000
     RCB240SI_MERGE.INDNULL(28)     = -1;                               16190000
   END;                                                                 16200000
 IF RCB240SI_MERGE.INDNULL(29)      = 99                                16210000
 THEN                                                                   16220000
   DO;                                                                  16230000
     RCB240S_MERGE.COVERAGE_START_6 = '';                               16240000
     RCB240SI_MERGE.INDNULL(29)     = -1;                               16250000
   END;                                                                 16260000
 IF RCB240SI_MERGE.INDNULL(30)      = 99                                16270000
 THEN                                                                   16280000
   DO;                                                                  16290000
     RCB240S_MERGE.COVERAGE_END_6   = '';                               16300000
     RCB240SI_MERGE.INDNULL(30)     = -1;                               16310000
   END;                                                                 16320000
 IF RCB240SI_MERGE.INDNULL(31)      = 99                                16330000
 THEN                                                                   16340000
   DO;                                                                  16350000
     RCB240S_MERGE.COVERAGE_START_7 = '';                               16360000
     RCB240SI_MERGE.INDNULL(31)     = -1;                               16370000
   END;                                                                 16380000
 IF RCB240SI_MERGE.INDNULL(32)      = 99                                16390000
 THEN                                                                   16400000
   DO;                                                                  16410000
     RCB240S_MERGE.COVERAGE_END_7   = '';                               16420000
     RCB240SI_MERGE.INDNULL(32)     = -1;                               16430000
   END;                                                                 16440000
 IF RCB240SI_MERGE.INDNULL(33)      = 99                                16450000
 THEN                                                                   16460000
   DO;                                                                  16470000
     RCB240S_MERGE.SERVICE_TYPE     = '';                               16480000
     RCB240SI_MERGE.INDNULL(33)     = -1;                               16490000
   END;                                                                 16500000
                                                 /* START OF RC01192 */ 16510000
   IF RCB240SI_MERGE.INDNULL(34)          = 99                          16520000
   THEN                                                                 16530000
     DO;                                                                16540000
       RCB240S_MERGE.SERVICE_LVL_CODE = HIGH(3);                        16550000
       RCB240SI_MERGE.INDNULL(34)     = -1;                             16560000
     END;                                                               16570000
                                                   /* END OF RC01192 */ 16580000
 END RCBFAXN_COMPLETE;                                                  16590000
1/********************************************************************/ 16600000
 /*                                                                  */ 16610000
 /* MODULE NAME      : INSERT                                        */ 16620000
 /*                                                                  */ 16630000
 /* DESCRIPTION      : INSERT ROW INTO RCBV0240_SERV_CTR USING       */ 16640000
 /*                    RCBF24N                                       */ 16650000
 /*                                                                  */ 16660000
 /********************************************************************/ 16670000
0RCBFAXN_INSERT: PROC;                                                  16680000
                                     /* INSERT INTO TABLE            */ 16690000
 CALL RCBF24N (PTR_RCB240S_OUT,                                         16700000
               PTR_RCB240SI_OUT,                                        16710000
               PTR_RET_AREA_BB,                                         16720000
               PTR_INT_AREA);                                           16730000
 SELECT (PARM_RET_AREA_BB.RETURN_CODE);                                 16740000
 WHEN (0);                                                              16750000
 OTHERWISE                                                              16760000
   DO;                               /* STOP PROCESSING IMMEDIATELY  */ 16770000
     GO TO RCBFAXN_EXIT;                                                16780000
   END;                                                                 16790000
 END;                                                                   16800000
 END RCBFAXN_INSERT;                                                    16810000
1/********************************************************************/ 16820000
 /*                                                                  */ 16830000
 /* MODULE NAME      : UPDATE                                        */ 16840000
 /*                                                                  */ 16850000
 /* DESCRIPTION      : UPDATE ROW OF RCBV0240_SERV_CTR USING         */ 16860000
 /*                    RCBG24N                                       */ 16870000
 /*                                                                  */ 16880000
 /********************************************************************/ 16890000
0RCBFAXN_UPDATE: PROC;                                                  16900000
                                     /* UPDATE OF TABLE              */ 16910000
 CALL RCBG24N (PTR_RCB240S_OUT,                                         16920000
               PTR_RCB240SI_OUT,                                        16930000
               PTR_RET_AREA_BB,                                         16940000
               PTR_INT_AREA);                                           16950000
 SELECT (PARM_RET_AREA_BB.RETURN_CODE);                                 16960000
 WHEN (0);                                                              16970000
 OTHERWISE                                                              16980000
   DO;                               /* STOP PROCESSING IMMEDIATELY  */ 16990000
     GO TO RCBFAXN_EXIT;                                                17000000
   END;                                                                 17010000
 END;                                                                   17020000
 END RCBFAXN_UPDATE;                                                    17030000
1/********************************************************************/ 17040000
 /*                                                                  */ 17050000
 /* MODULE NAME      : DELETE                                        */ 17060000
 /*                                                                  */ 17070000
 /* DESCRIPTION      : CLOSE ROW FROM RCBV0240_SERV_CTR USING        */ 17080000
 /*                    RCBH24N                                       */ 17090000
 /*                                                                  */ 17100000
 /********************************************************************/ 17110000
0RCBFAXN_DELETE: PROC;                                                  17120000
                                     /* DELETE OF TABLE ROW          */ 17130000
 CALL RCBH24N (PTR_RCB240S_OUT,                                         17140000
               PTR_RCB240SI_OUT,                                        17150000
               PTR_RET_AREA_BB,                                         17160000
               PTR_INT_AREA);                                           17170000
 SELECT (PARM_RET_AREA_BB.RETURN_CODE);                                 17180000
 WHEN (0,4);                                                            17190000
 OTHERWISE                                                              17200000
   DO;                               /* STOP PROCESSING IMMEDIATELY  */ 17210000
     GO TO RCBFAXN_EXIT;                                                17220000
   END;                                                                 17230000
 END;                                                                   17240000
 END RCBFAXN_DELETE;                                                    17250000
1/********************************************************************/ 17260000
 /*                                                                  */ 17270000
 /* MODULE NAME      : RCBFAXN_OPEN_CURS_TABLE                       */ 17280000
 /*                                                                  */ 17290000
 /* DESCRIPTION      : OPEN CURSOR TABLE                             */ 17300000
 /*                                                                  */ 17310000
 /********************************************************************/ 17320000
0RCBFAXN_OPEN_CURS_TABLE: PROC;                                         17330000
0EXEC SQL                                                               17340000
   OPEN CURS_TABLE                                                      17350000
   ;                                                                    17360000
 SELECT (SQLCA.SQLCODE);                                                17370000
 WHEN (0)                                                               17380000
   DO;                                                                  17390000
     SWITCH_CURSOR_OPEN   = TRUE;                                       17400000
     SWITCH_END_OF_CURSOR = FALSE;                                      17410000
   END;                                                                 17420000
 OTHERWISE                                                              17430000
   DO;                               /* STOP PROCESSING IMMEDIATELY  */ 17440000
     WRK_SQLCA                    = SQLCA;                              17450000
     PARM_RET_AREA_BB.RETURN_CODE = 20;                                 17460000
     GO TO RCBFAXN_EXIT;                                                17470000
   END;                                                                 17480000
 END;                                                                   17490000
 END RCBFAXN_OPEN_CURS_TABLE;                                           17500000
1/********************************************************************/ 17510000
 /*                                                                  */ 17520000
 /* MODULE NAME      : RCBFAXN_FETCH_CURS_TABLE                      */ 17530000
 /*                                                                  */ 17540000
 /* DESCRIPTION      : FETCH CURSOR FOR TABLE                        */ 17550000
 /*                                                                  */ 17560000
 /********************************************************************/ 17570000
0RCBFAXN_FETCH_CURS_TABLE: PROC;                                        17580000
                                     /* INIT STRUCTURES              */ 17590000
 RCB240S_FETCH  = '';                                                   17600000
 RCB240SI_FETCH = '';                                                   17610000
                                     /* FETCH CURSOR                 */ 17620000
 EXEC SQL                                                               17630000
   FETCH CURS_TABLE                                                     17640000
   INTO :RCB240S_FETCH  :RCB240SI_FETCH.INDNULL                         17650000
   ;                                                                    17660000
 SELECT (SQLCA.SQLCODE);                                                17670000
 WHEN (0);                                                              17680000
 WHEN (100)                                                             17690000
   DO;                                                                  17700000
     SWITCH_END_OF_CURSOR = TRUE;                                       17710000
   END;                                                                 17720000
 OTHERWISE                                                              17730000
   DO;                               /* STOP PROCESSING IMMEDIATELY  */ 17740000
     WRK_SQLCA                    = SQLCA;                              17750000
     PARM_RET_AREA_BB.RETURN_CODE = 20;                                 17760000
     GO TO RCBFAXN_EXIT;                                                17770000
   END;                                                                 17780000
 END;                                                                   17790000
 END RCBFAXN_FETCH_CURS_TABLE;                                          17800000
1/********************************************************************/ 17810000
 /*                                                                  */ 17820000
 /* MODULE NAME      : RCBFAXN_FETCH_CURS_TABLE_1                    */ 17830000
 /*                                                                  */ 17840000
 /* DESCRIPTION      : FETCH CURSOR FOR TABLE SKIPPING THOSE RECORDS */ 17850000
 /*                    WHICH HAVE BEEN INSERTED DURING THE INTEGRATE */ 17860000
 /*                    SUPERIOR PROCESS                              */ 17870000
 /*                                                                  */ 17880000
 /********************************************************************/ 17890000
0RCBFAXN_FETCH_CURS_TABLE_1: PROC;                                      17900000
 CALL RCBFAXN_FETCH_CURS_TABLE;                                         17910000
 DO WHILE (¬SWITCH_END_OF_CURSOR  &                                     17920000
           RCB240S_FETCH.END_DATE <                                     17930000
           RCB240S_IN.EFFECTIVE_DATE);                                  17940000
   CALL RCBFAXN_FETCH_CURS_TABLE;                                       17950000
 END;                                                                   17960000
 END RCBFAXN_FETCH_CURS_TABLE_1;                                        17970000
1/********************************************************************/ 17980000
 /*                                                                  */ 17990000
 /* MODULE NAME      : RCBFAXN_CLOSE_CURS_TABLE                      */ 18000000
 /*                                                                  */ 18010000
 /* DESCRIPTION      : CLOSE CURSOR TABLE                            */ 18020000
 /*                                                                  */ 18030000
 /********************************************************************/ 18040000
0RCBFAXN_CLOSE_CURS_TABLE: PROC;                                        18050000
0EXEC SQL                                                               18060000
   CLOSE CURS_TABLE                                                     18070000
   ;                                                                    18080000
 SELECT (SQLCA.SQLCODE);                                                18090000
 WHEN (0)                                                               18100000
   DO;                                                                  18110000
     SWITCH_CURSOR_OPEN = FALSE;                                        18120000
   END;                                                                 18130000
 OTHERWISE                                                              18140000
   DO;                               /* STOP PROCESSING IMMEDIATELY  */ 18150000
     WRK_SQLCA                    = SQLCA;                              18160000
     PARM_RET_AREA_BB.RETURN_CODE = 20;                                 18170000
     GO TO RCBFAXN_EXIT;                                                18180000
   END;                                                                 18190000
 END;                                                                   18200000
 END RCBFAXN_CLOSE_CURS_TABLE;                                          18210000
1/********************************************************************/ 18220000
 /*                                                                  */ 18230000
 /* MODULE NAME      : RCBFAXN_END_COMMON                            */ 18240000
 /*                                                                  */ 18250000
 /* DESCRIPTION      :                                               */ 18260000
 /*                                                                  */ 18270000
 /********************************************************************/ 18280000
0RCBFAXN_END_COMMON: PROC;                                              18290000
                                     /* END PROCESSING               */ 18300000
                                     /* RESET LEVEL                  */ 18310000
0PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            18320000
 END RCBFAXN_END_COMMON;                                                18330000
1/********************************************************************/ 18340000
 /*                                                                  */ 18350000
 /* MODULE NAME      : RCBFAXN_TRANS_DATE                            */ 18360000
 /*                                                                  */ 18370000
 /* DESCRIPTION      : CHANGE DATE BY NUMBER OF DAYS                 */ 18380000
 /*                                                                  */ 18390000
 /********************************************************************/ 18400000
0RCBFAXN_TRANS_DATE:  PROC (DATE_IN,                                    18410000
                            NUMBER,                                     18420000
                            DATE_OUT);                                  18430000
 DCL DATE_IN  CHAR (10);                                                18440000
 DCL DATE_OUT CHAR (10);                                                18450000
 DCL NUMBER   FIXED BIN (31);                                           18460000
 PARM_DATE_CALC                = '';                                    18470000
 PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                                 18480000
 PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                                 18490000
 PARM_DATE_CALC.WD_IN_DATE     = DATE_IN;                               18500000
 PARM_DATE_CALC.WD_FUNCTION    = 'C';                                   18510000
 PARM_DATE_CALC.WD_PERIOD      = NUMBER;                                18520000
 PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                                   18530000
 CALL RCB004N (PTR_DATE_CALC);                                          18540000
 SELECT (PARM_DATE_CALC.WD_STATUS);                                     18550000
 WHEN ('')                                                              18560000
   DO;                                                                  18570000
     DATE_OUT = SUBSTR(PARM_DATE_CALC.WD_OUT_DATE,1,10);                18580000
   END;                                                                 18590000
 OTHERWISE                                                              18600000
   DO;                                                                  18610000
     PARM_RET_AREA_BB.RETURN_CODE = 20;                                 18620000
     GO TO RCBFAXN_EXIT;                                                18630000
   END;                                                                 18640000
 END;                                                                   18650000
0END RCBFAXN_TRANS_DATE;                                                18660000
1/*******************************************************************/  18670000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  18680000
 /*******************************************************************/  18690000
0 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */  18700000
  $DAIMOD (RCBFAXN);                     /* MODULE TO BE COMPILED   */  18710000
0/*******************************************************************/  18720000
 /* END OF ABR BLOCK '                                              */  18730000
 /*******************************************************************/  18740000
0 END RCBFAXN;                                                          18750000