 /* RCBG24N - UPDATE ROW IN RCBV0240_SERV_CTR                        */ 00019211
 /*                                                                  */ 00020000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00030000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00040000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00050000
 /*                                                                  */ 00060000
 /********************************************************************/ 00070000
 /* PROGRAM          : RCBG24N                                       */ 00080000
 /*                                                                  */ 00090000
 /* LANGUAGE         : PLISQL                                        */ 00100000
 /*                                                                  */ 00110000
 /* TYPE             : LINKABLE MODULE                               */ 00120000
 /*                                                                  */ 00130000
 /* DESCRIPTION      : ELEMENTARY UPDATE FOR ROW IN TABLE            */ 00140000
 /*                    RCBV0240_SERV_CTR                             */ 00150000
 /*                    CICS VERSION WITH RCB0M1M REMOVED             */ 00160000
 /*                                                                  */ 00170000
 /* INPUT            : RCBV0240_SERV_CTR                             */ 00180000
 /*                                                                  */ 00190000
 /* OUTPUT           : RCBV0240_SERV_CTR                             */ 00200000
 /*                                                                  */ 00210000
 /* MESSAGES         : G124                                          */ 00220000
 /*                                                                  */ 00230000
 /* MAINTENANCE LOG  :                                               */ 00240000
 /* ---------------                                                  */ 00250000
 /*                                                                  */ 00260000
 /* DATE       | WORK-ITEMNO. | DESCRIPTION                          */ 00270000
 /* ---------------------------------------------------------------  */ 00280000
 /* 2001-10-29 | RC01230      | CSP TO PL1/CICS CONVERSION           */ 00290000
 /*            |              |                                      */ 00300000
 /********************************************************************/ 00310000
1RCBG24N: PROC (RCB240S_PTR,                                            00320000
                RCB240SI_PTR,                                           00330000
                RCBZ02S_PTR,                                            00340000
                PARM_INT_AREA_PTR)                                      00350000
          OPTIONS (REENTRANT)                                           00360000
          REORDER;                                                      00370000
0/********************************************************************/ 00380000
 /*                 P A R A M E T E R S                              */ 00390000
 /********************************************************************/ 00400000
 DCL RCB240S_PTR    PTR;               /* PTR ROW                    */ 00410000
 DCL 1 RCB240S      BASED(RCB240S_PTR),                                 00420000
      %INCLUDE RCB240S;;                                                00430000
 DCL RCB240SI_PTR   PTR;               /* PTR NULL INDICATORS        */ 00440000
 DCL 1 RCB240SI     BASED(RCB240SI_PTR),                                00450000
      %INCLUDE RCB240SI;;                                               00460000
 DCL 1 RCB000SI     BASED(RCB240SI_PTR),                                00470000
      %INCLUDE RCB000SI;;                                               00480000
 DCL RCBZ02S_PTR    PTR;               /* PTR RETURN INFO            */ 00490000
 DCL 1 RCBZ02S      BASED(RCBZ02S_PTR),                                 00500000
      %INCLUDE RCBZ02S;;                                                00510000
 DCL 1 SQLCA_R      BASED(ADDR(RCBZ02S.RETURN_SQL))                     00520000
                    LIKE SQLCA;                                         00530000
 DCL PARM_INT_AREA_PTR PTR;            /* PTR INTERFACE AREA         */ 00540000
 DCL 1 PARM_INT_AREA BASED(PARM_INT_AREA_PTR),                          00550000
      %INCLUDE RCBZ01S;;                                                00560000
0/********************************************************************/ 00570000
 /*                 S Q L    D E C L A R A T I O N S                 */ 00580000
 /********************************************************************/ 00590000
 EXEC SQL INCLUDE SQLCA;                                                00600000
0/********************************************************************/ 00610000
 /*                 M I S C E L L A N I O U S   F I E L D S          */ 00620000
 /********************************************************************/ 00630000
 DCL RCB0M1M        EXT ENTRY;         /* MESSAGE MODULE             */ 00640000
 DCL WRK_LEVEL      FIXED BIN (15);                                     00650000
 DCL ADDR           BUILTIN;                                            00660000
 DCL NULL           BUILTIN;                                            00670000
 DCL STRING         BUILTIN;                                            00680000
1/********************************************************************/ 00690000
 /*                 S T A R T   P R O C E S S I N G                  */ 00700000
 /********************************************************************/ 00710000
                                         /* SET LEVEL AND MOD NAME   */ 00720000
 WRK_LEVEL = PARM_INT_AREA.ID_MOD_LEVEL + 1;                            00730000
 PARM_INT_AREA.ID_MOD_LEVEL            = WRK_LEVEL;                     00740000
 PARM_INT_AREA.ID_MOD_PATH (WRK_LEVEL) = 'RCBG24N';                     00750000
                                                                        00760000
0/********************************************************************/ 00770000
 /*      UPDATE ROW                                                  */ 00780000
 /********************************************************************/ 00790000
                                                                        00800000
 RCB240S.LAST_CHANGE_DATE = PARM_INT_AREA.RUN_DATE;     /* SET DATE */  00810000
 RCB240SI.INDNULL(36)     = 0;                                          00820000
                                                                        00830000
 EXEC SQL                                                               00840000
      UPDATE RCBV0240_SERV_CTR                                          00850000
      SET    HVP_QUANTITY       = :RCB240S.HVP_QUANTITY                 00860000
                                  :RCB000SI.INDNULL_5,                  00870000
             CONTRACT_NUMBER    = :RCB240S.CONTRACT_NUMBER              00880000
                                  :RCB000SI.INDNULL_6,                  00890000
             SERVICE_START_DATE = :RCB240S.SERVICE_START_DATE           00900000
                                  :RCB000SI.INDNULL_7,                  00910000
             SERVICE_STOP_DATE  = :RCB240S.SERVICE_STOP_DATE            00920000
                                  :RCB000SI.INDNULL_8,                  00930000
             SUPPL_CTR_NUMBER   = :RCB240S.SUPPL_CTR_NUMBER             00940000
                                  :RCB000SI.INDNULL_9,                  00950000
             SERVICE_MODULE_1   = :RCB240S.SERVICE_MODULE_1             00960000
                                  :RCB000SI.INDNULL_10,                 00970000
             SERVICE_MODULE_2   = :RCB240S.SERVICE_MODULE_2             00980000
                                  :RCB000SI.INDNULL_11,                 00990000
             SERVICE_MODULE_3   = :RCB240S.SERVICE_MODULE_3             01000000
                                  :RCB000SI.INDNULL_12,                 01010000
             SERVICE_MODULE_4   = :RCB240S.SERVICE_MODULE_4             01020000
                                  :RCB000SI.INDNULL_13,                 01030000
             SERVICE_MODULE_5   = :RCB240S.SERVICE_MODULE_5             01040000
                                  :RCB000SI.INDNULL_14,                 01050000
             AGREEMENT_TYPE     = :RCB240S.AGREEMENT_TYPE               01060000
                                  :RCB000SI.INDNULL_15,                 01070000
             AGREEMENT_OPTION   = :RCB240S.AGREEMENT_OPTION             01080000
                                  :RCB000SI.INDNULL_16,                 01090000
             SPECIAL_OPTION     = :RCB240S.SPECIAL_OPTION               01100000
                                  :RCB000SI.INDNULL_17,                 01110000
             AMENDM_COMB_CODE   = :RCB240S.AMENDM_COMB_CODE             01120000
                                  :RCB000SI.INDNULL_18,                 01130000
             COVERAGE_START_1   = :RCB240S.COVERAGE_START_1             01140000
                                  :RCB000SI.INDNULL_19,                 01150000
             COVERAGE_END_1     = :RCB240S.COVERAGE_END_1               01160000
                                  :RCB000SI.INDNULL_20,                 01170000
             COVERAGE_START_2   = :RCB240S.COVERAGE_START_2             01180000
                                  :RCB000SI.INDNULL_21,                 01190000
             COVERAGE_END_2     = :RCB240S.COVERAGE_END_2               01200000
                                  :RCB000SI.INDNULL_22,                 01210000
             COVERAGE_START_3   = :RCB240S.COVERAGE_START_3             01220000
                                  :RCB000SI.INDNULL_23,                 01230000
             COVERAGE_END_3     = :RCB240S.COVERAGE_END_3               01240000
                                  :RCB000SI.INDNULL_24,                 01250000
             COVERAGE_START_4   = :RCB240S.COVERAGE_START_4             01260000
                                  :RCB000SI.INDNULL_25,                 01270000
             COVERAGE_END_4     = :RCB240S.COVERAGE_END_4               01280000
                                  :RCB000SI.INDNULL_26,                 01290000
             COVERAGE_START_5   = :RCB240S.COVERAGE_START_5             01300000
                                  :RCB000SI.INDNULL_27,                 01310000
             COVERAGE_END_5     = :RCB240S.COVERAGE_END_5               01320000
                                  :RCB000SI.INDNULL_28,                 01330000
             COVERAGE_START_6   = :RCB240S.COVERAGE_START_6             01340000
                                  :RCB000SI.INDNULL_29,                 01350000
             COVERAGE_END_6     = :RCB240S.COVERAGE_END_6               01360000
                                  :RCB000SI.INDNULL_30,                 01370000
             COVERAGE_START_7   = :RCB240S.COVERAGE_START_7             01380000
                                  :RCB000SI.INDNULL_31,                 01390000
             COVERAGE_END_7     = :RCB240S.COVERAGE_END_7               01400000
                                  :RCB000SI.INDNULL_32,                 01410000
             SERVICE_TYPE       = :RCB240S.SERVICE_TYPE                 01420000
                                  :RCB000SI.INDNULL_33,                 01430000
             SERVICE_LVL_CODE   = :RCB240S.SERVICE_LVL_CODE             01440000
                                  :RCB000SI.INDNULL_34,                 01450000
             SOURCE_INDICATOR   = :RCB240S.SOURCE_INDICATOR             01460000
                                  :RCB000SI.INDNULL_35,                 01470000
             LAST_CHANGE_DATE   = :RCB240S.LAST_CHANGE_DATE             01480000
                                  :RCB000SI.INDNULL_36,                 01490000
             END_DATE           = :RCB240S.END_DATE                     01500000
                                  :RCB000SI.INDNULL_38                  01510000
      WHERE  COUNTRY_NUMBER     = :RCB240S.COUNTRY_NUMBER               01520000
        AND  PRODUCT_TYPE       = :RCB240S.PRODUCT_TYPE                 01530000
        AND  ORIGIN             = :RCB240S.ORIGIN                       01540000
        AND  SEQUENCE_NUMBER    = :RCB240S.SEQUENCE_NUMBER              01550000
        AND  EFFECTIVE_DATE     = :RCB240S.EFFECTIVE_DATE;              01560000
0SELECT (SQLCA.SQLCODE);                                                01570000
   WHEN (0) DO;                                                         01580000
     RCBZ02S.RETURN_CODE = 0;                                           01590000
   END;                                                                 01600000
   WHEN (+100) DO;                                                      01610000
     SQLCA_R             = SQLCA;                                       01620000
     RCBZ02S.RETURN_CODE = 4;                                           01630000
   END;                                                                 01640000
   WHEN (-530) DO;                                                      01650000
     SQLCA_R             = SQLCA;                                       01660000
     RCBZ02S.RETURN_FK   = SQLCA.SQLERRM;                               01670000
     RCBZ02S.RETURN_CODE = 8;                                           01680000
   END;                                                                 01690000
   OTHERWISE DO;                                                        01700000
     SQLCA_R             = SQLCA;                                       01710000
     RCBZ02S.RETURN_CODE = 20;                                          01720000
   END;                                                                 01730000
 END;                                                                   01740000
0/********************************************************************/ 01750000
                                         /* RESET LEVEL              */ 01760000
 PARM_INT_AREA.ID_MOD_LEVEL = WRK_LEVEL - 1;                            01770000
                                                                        01780000
 %INCLUDE DAIFPLH ;                    /* COMPILE DATE/TIME STAMP    */ 01790000
 $DAIMOD (RCBG24N);                    /* MODULE TO BE COMPILED      */ 01800000
 END RCBG24N;                                                           01810000