 /* RCBXC2M - XML PARSER: MODEL UPDATE TRANSACTION                   */ 00010000
 /*                                                                  */ 00020000
 /********************************************************************/ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /********************************************************************/ 00070000
 /*                                                                  */ 00080000
 /* MODULE NAME      : RCBXC2M                                       */ 00090000
 /*                                                                  */ 00100000
 /* PROGRAM NAME     : RCBXC2P                                       */ 00110000
 /*                                                                  */ 00120093
 /* LANGUAGE         : PLISQL                                        */ 00130000
 /*                                                                  */ 00140093
 /* TYPE             : BATCH                                         */ 00150000
 /*                                                                  */ 00160000
 /* DESCRIPTION      : WW AND COUNTRY LEVEL INFORMATION  ON IBM      */ 00170000
 /*                    BRAND MACHINES RECEVIED FROM MODEL_UPDATE     */ 00180000
 /*                    TRANSACTION IS PARSED USING PLISAXC PARSER    */ 00190000
 /*                    AND SUB-MODULE ARE CALLED TO INSERT/UPDATE    */ 00200000
 /*                    TABLES T693/T694/T696                         */ 00210000
 /*                                                                  */ 00220000
 /* INPUT            : XML DOCUMENT(MODEL_UPDATE TRANSACTION)        */ 00230000
 /*                                                                  */ 00240000
 /* OUTPUT           : -DB2 : RCBT0693_TYPE_MOD_WW_LVL               */ 00250000
 /*                    -DB2 : RCBT0694_TYPE_MOD_CRTY_LVL             */ 00260000
 /*                    -DB2 : RCBT0696_TYPE_MOD_DESC                 */ 00270000
 /*                    -FILE: RCB0M10 MESSAGE FILE                   */ 00280000
 /*                                                                  */ 00290000
 /* EXTERNAL MODULES : RCB0T1M  RETRIEVE SYSTEM DATE                 */ 00300000
 /*                    RCB0M1M  COMMON MESSAGE ROUTINE               */ 00310000
 /*                    RCB004M  DATE VALIDATION                      */ 00320000
 /*                    RCBF89M  INSERT/UPDATE IN T693                */ 00330000
 /*                    RCBF90M  INSERT/UPDATE IN T694                */ 00340000
 /*                    RCBF92M  INSERT/UPDATE IN T696                */ 00350000
 /*                                                                  */ 00360000
 /* MESSAGES         : 0292 / 0293 / 0294 / 0295 / 0296 / 0297       */ 00370000
 /*                    0299 / 0300 / 0306 / 0326                     */ 00380000
 /*                                                                  */ 00390000
 /* DEPENDENCIES     : NONE                                          */ 00400000
 /*                                                                  */ 00410000
 /*  MAINTENANCE LOG :                                               */ 00420000
 /*  ---------------                                                 */ 00430000
 /*                                                                  */ 00440000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00450000
 /*  --------------------------------------------------------------  */ 00460000
 /*  2011-08-10 | RB01315      | OIMS EACM REQUIREMENT-CEDS 3.3 A16  */ 00470000
 /*             |              | RELEASE                             */ 00480000
 /*  2012-04-12 | CEDS00000578 | ADDITION OF QMANAGER CCSID AS INPUT */ 00490000
 /*             |              | TO 'C' PARSER                       */ 00500000
 /*  2012-05-29 | RC01319      | PCRS ON CEDS 3.3 A16 RELEASE        */ 00510000
 /*             |              | PCEDSP-0237,PCEDSP-0239             */ 00520000
 /*  2012-11-28 | RC01324      | PCR 10-501 RELATED TO TREC 10-1850  */ 00530000
 /*  2012-12-17 | CEDS00000617 | MACHTYPE XML TAG HIERACHY CORRECTION*/ 00540000
 /*  2014-03-03 | RC01337      | PCR 314: RESTRICT FURTHER UPDATES   */ 00550000
 /*             |              | TO TABLES T694 AND T696 IF T693     */ 00560000
 /*             |              | REGISTRATION FAILS.                 */ 00570000
 /*             |              | COMMENTED MESSAGES 0298 AND 0313    */ 00580000
 /*             |              | PCR 389: STORE ADDITIONAL PRODUCT   */ 00590000
 /*             |              | INFORMATION,                        */ 00600000
 /*             |              | COMMENTED MESSAGE 0315              */ 00610000
 /*  2014-04-25 | CEDS00000679 | TREC 1826 - CHANGES TO PROCESS      */ 00620000
 /*             |              | NON-ENGLISH CHARACTERS SENT FROM    */ 00630000
 /*             |              | OIMS                                */ 00640000
 /*  2014-09-01 | CEDS00000692 | HANDLING VARCHAR FOR VENDOR NAME    */ 00641099
 /*             |              | AND PRODUCT DESCRIPTION             */ 00642099
 /*  2014-09-01 | RB01342      | CEDS 3.3 A23 RELEASE - SEO_UPDATE   */ 00650000
 /*             |              | XML (MELODY)                        */ 00660000
 /*  2018-02-15 | S1304835     | HANDLE NEW TAGS FROM OIMS           */ 00670099
 /********************************************************************/ 00680000
 RCBXC2M: PACKAGE EXPORTS(RCBXC2M);                                     00690000
                                                                        00700000
    DEFINE ALIAS EVENT                                                  00710000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31) )                00720000
        RETURNS( BYVALUE FIXED BIN(31) )                                00730000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00740000
                                                                        00750000
    DEFINE ALIAS EVENT_WITH_FLAG                                        00760000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00770000
                       BIT(8) ALIGNED )                                 00780000
        RETURNS( BYVALUE FIXED BIN(31) )                                00790000
        OPTIONS( NODESCRIPTOR BYVALUE LINKAGE(OPTLINK) );               00800000
                                                                        00810000
    DEFINE ALIAS EVENT_WITH_NAMESPACE                                   00820000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00830000
                       POINTER, FIXED BIN(31),                          00840000
                       POINTER, FIXED BIN(31) )                         00850000
        RETURNS( BYVALUE FIXED BIN(31) )                                00860000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00870000
                                                                        00880000
    DEFINE ALIAS EVENT_WITHOUT_DATA                                     00890000
        LIMITED ENTRY( POINTER )                                        00900000
        RETURNS( BYVALUE FIXED BIN(31) )                                00910000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00920000
                                                                        00930000
    DEFINE ALIAS EVENT_PI                                               00940000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00950000
                       POINTER, FIXED BIN(31) )                         00960000
        RETURNS( BYVALUE FIXED BIN(31) )                                00970000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00980000
                                                                        00990000
    DEFINE ALIAS EVENT_NAMESPACE_DCL                                    01000000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 01010000
                       POINTER, FIXED BIN(31) )                         01020000
        RETURNS( BYVALUE FIXED BIN(31) )                                01030000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            01040000
                                                                        01050000
    DEFINE ALIAS EVENT_EXCEPTION                                        01060000
        LIMITED ENTRY( POINTER, FIXED BIN(31),                          01070000
                       FIXED BIN(31),                                   01080000
                       FIXED BIN(31) )                                  01090000
        RETURNS( BYVALUE FIXED BIN(31) )                                01100000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            01110000
                                                                        01120000
    DEFINE ALIAS EVENT_END_OF_INPUT                                     01130000
        LIMITED ENTRY( POINTER,                                         01140000
                       POINTER BYADDR,                                  01150000
                       FIXED BIN(31) BYADDR )                           01160000
        RETURNS( BYVALUE FIXED BIN(31) )                                01170000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            01180000
                                                                        01190000
  RCBXC2M: PROC (COUNTRY_PTR,                                           01200000
                 PARSER_INPUT_AREA_PTR,                                 01210000
                 PTR_MQDATA,                                            01220000
                 PARSER_RETURN_AREA_PTR,                                01230000
                 PTR_ERROR_RETURN,                                      01240000
                                                  /* SOC CEDS00000578 */01250000
              /* PTR_INT_AREA, */                                       01260000
                 PTR_INT_AREA,                                          01270000
                 PTR_CCSID)                                             01280000
                                                  /* EOC CEDS00000578 */01290000
           OPTIONS (REENTRANT)                                          01300000
           REORDER;                                                     01310000
                                                                        01320000
  DCL                                                                   01330000
    1 EVENTHANDLER STATIC                                               01340000
                                                                        01350000
      ,2 E01 TYPE EVENT_WITHOUT_DATA                                    01360000
             INIT( START_OF_DOCUMENT )                                  01370000
                                                                        01380000
      ,2 E02 TYPE EVENT                                                 01390000
             INIT( VERSION_INFORMATION )                                01400000
                                                                        01410000
      ,2 E03 TYPE EVENT                                                 01420000
             INIT( ENCODING_DECLARATION )                               01430000
                                                                        01440000
      ,2 E04 TYPE EVENT                                                 01450000
             INIT( STANDALONE_DECLARATION )                             01460000
                                                                        01470000
      ,2 E05 TYPE EVENT                                                 01480000
             INIT( DOCUMENT_TYPE_DECLARATION )                          01490000
                                                                        01500000
      ,2 E06 TYPE EVENT_WITHOUT_DATA                                    01510000
             INIT( END_OF_DOCUMENT )                                    01520000
                                                                        01530000
      ,2 E07 TYPE EVENT_WITH_NAMESPACE                                  01540000
             INIT( START_OF_ELEMENT )                                   01550000
                                                                        01560000
      ,2 E08 TYPE EVENT_WITH_NAMESPACE                                  01570000
             INIT( ATTRIBUTE_NAME )                                     01580000
                                                                        01590000
      ,2 E09 TYPE EVENT                                                 01600000
             INIT( ATTRIBUTE_CHARACTERS )                               01610000
                                                                        01620000
      ,2 E10 TYPE EVENT_WITH_NAMESPACE                                  01630000
             INIT( END_OF_ELEMENT )                                     01640000
                                                                        01650000
      ,2 E11 TYPE EVENT_WITHOUT_DATA                                    01660000
             INIT( START_OF_CDATA )                                     01670000
                                                                        01680000
      ,2 E12 TYPE EVENT_WITHOUT_DATA                                    01690000
             INIT( END_OF_CDATA )                                       01700000
                                                                        01710000
      ,2 E13 TYPE EVENT_WITH_FLAG                                       01720000
             INIT( CONTENT_CHARACTERS )                                 01730000
                                                                        01740000
      ,2 E14 TYPE EVENT_PI                                              01750000
             INIT( PROCESSING_INSTRUCTION )                             01760000
                                                                        01770000
      ,2 E15 TYPE EVENT                                                 01780000
             INIT( COMMENT )                                            01790000
                                                                        01800000
      ,2 E16 TYPE EVENT_NAMESPACE_DCL                                   01810000
             INIT( NAMESPACE_DECLARE )                                  01820000
                                                                        01830000
      ,2 E17 TYPE EVENT_END_OF_INPUT                                    01840000
             INIT( END_OF_INPUT )                                       01850000
                                                                        01860000
      ,2 E18 TYPE EVENT                                                 01870000
             INIT( UNRESOLVED_REFERENCE )                               01880000
                                                                        01890000
      ,2 E19 TYPE EVENT_EXCEPTION                                       01900000
             INIT( EXCEPTION )                                          01910000
      ;                                                                 01920000
1/********************************************************************/ 01930000
 /*  BUILTIN FUNCTIONS                                               */ 01940000
 /********************************************************************/ 01950000
    DCL NULL BUILTIN;                                                   01960000
 /********************************************************************/ 01970000
 /* DB2/SQL SQLCA                                                    */ 01980000
 /********************************************************************/ 01990000
0 EXEC SQL                                                              02000000
    INCLUDE SQLCA                                                       02010000
    ;                                                                   02020000
1/********************************************************************/ 02140000
 /* DB2 TABLE STRUCTURES                                             */ 02150000
 /********************************************************************/ 02160000
0DCL 1 TB_RCBV693,                                                      02170000
      %INCLUDE (RCB693S);;                                              02180000
0DCL 1 TB_RCBV693_I,                                                    02190000
      %INCLUDE (RCB693SI);;                                             02200000
0DCL 1 TB_RCBV694,                                                      02210000
      %INCLUDE (RCB694S);;                                              02220000
0DCL 1 TB_RCBV696,                                                      02230000
      %INCLUDE (RCB696S);;                                              02240000
 /********************************************************************/ 02250000
 /*  PTR & TEMP VARIABLE DECLARATION                                */  02260000
 /********************************************************************/ 02270000
  DCL TOKEN             CHAR(8);                                        02280000
  DCL COUNTRY_PTR       PTR;                                            02290000
  DCL PARSER_INPUT_PTR  PTR;                                            02300000
  DCL PTR_MQDATA        PTR;                                            02310000
  DCL PARSER_RETURN_AREA_PTR PTR;                                       02320000
  DCL PARSER_INPUT_AREA_PTR PTR;                                        02330000
  DCL PTR_DATE_AREA     PTR;                                            02340000
                                                                        02350000
  DCL PTR_INT_AREA      PTR;                                            02360000
  DCL PTR_ERROR_RETURN  PTR;                                            02370000
  DCL PTR_CCSID         PTR;                         /* CEDS00000578 */ 02380000
                                                /* SOC CEDS00000679 */  02390000
  DCL LEN_INSTALL       FIXED BIN(31) INIT(03);                         02400000
  DCL LEN_PRODTYP       FIXED BIN(31) INIT(04);                         02410000
  DCL LEN_MDLNUMBR      FIXED BIN(31) INIT(03);                         02420000
  DCL LEN_PRODREV       FIXED BIN(31) INIT(02);                         02430000
  DCL LEN_MACHCAT       FIXED BIN(31) INIT(01);                         02440000
  /*DCL LEN_VENDNAM       FIXED BIN(31) INIT(30);*//*SOC CEDS00000692*/ 02441099
  DCL LEN_VENDNAM       FIXED BIN(31) INIT(120);   /*EOC CEDS00000692*/ 02450099
  DCL LEN_CEPRODK       FIXED BIN(31) INIT(01);                         02460000
  DCL LEN_PRODSUP       FIXED BIN(31) INIT(03);                         02470000
  DCL LEN_RETAIN        FIXED BIN(31) INIT(01);                         02480000
  DCL LEN_LASTCD        FIXED BIN(31) INIT(10);                         02490000
  DCL LEN_AVAILD        FIXED BIN(31) INIT(10);                         02500000
  DCL LEN_EOSERD        FIXED BIN(31) INIT(10);                         02510000
  DCL LEN_CPRODTYP      FIXED BIN(31) INIT(04);                         02520000
  DCL LEN_CMDLNUMBR     FIXED BIN(31) INIT(03);                         02530000
  DCL LEN_CEACMTRY      FIXED BIN(31) INIT(04);                         02540000
  DCL LEN_CAVAILD       FIXED BIN(31) INIT(10);                         02550000
  DCL LEN_CEOSD         FIXED BIN(31) INIT(10);                         02560000
  DCL LEN_CLASTCD       FIXED BIN(31) INIT(10);                         02570000
  DCL LEN_LPRODTYP      FIXED BIN(31) INIT(04);                         02580000
  DCL LEN_LMDLNUMBR     FIXED BIN(31) INIT(03);                         02590000
  DCL LEN_LLANGID       FIXED BIN(31) INIT(02);                         02600000
  DCL LEN_LLASTCD       FIXED BIN(31) INIT(10);                         02610000
                                                 /* EOC CEDS00000679 */ 02620000
                                                                        02630000
  DCL XMLDOCUMENT BASED(PTR_MQDATA) CHAR(MQ_MSG_LENGTH);                02640000
  DCL MQ_CCSID    BASED(PTR_CCSID)  FIXED BIN(31);   /* CEDS00000578 */ 02650000
  DCL IC_CNTRY(300) BASED(COUNTRY_PTR) CHAR(4);                         02660000
                                                /* PARSER INPUT AREA */ 02670000
  DCL 1 PARSER_INPUT_AREA BASED(PARSER_INPUT_AREA_PTR),                 02680000
        %INCLUDE (RCBBE6S);;                                            02690000
                                                /* PARSER RETURN AREA */02700000
  DCL 1 PARSER_RETURN_AREA BASED(PARSER_RETURN_AREA_PTR),               02710000
        %INCLUDE (RCBBE4S);;                                            02720000
                                                                        02730000
  DCL 1 PARM_INT_AREA BASED(PTR_INT_AREA),      /*   INTERFACE AREA   */02740000
        %INCLUDE (RCBZ01S);;                                            02750000
                                                                        02760000
  DCL 1 ERROR_CODE_DET BASED (PTR_ERROR_RETURN),/* ERROR RETURN AREA  */02770000
          5 PTR_ERROR                    PTR,                           02780000
          5 ERR_TYPE                     CHAR(8),                       02790000
          5 CALL_ID                      CHAR(4);                       02800000
                                                                        02810000
  DCL 1 DATE_AREA,                              /*      DATE AREA     */02820000
        %INCLUDE (RCBZ03S);;                                            02830000
                                                                        02840000
 /*********************************************************************/02850000
 /*                  S T A R T   P R O C E S S I N G                  */02860000
 /*********************************************************************/02870000
  CALL RCBXC2M_INIT_PROGRAM;                                            02880000
                                                                        02890000
  CNT_AVAIL_ELEMENT1 = MODEL_UPD_UCOUNT_DET.CNT_AVAIL_ELEMENT;          02900000
  CNT_LANG_ELEMENT1  = MODEL_UPD_UCOUNT_DET.CNT_LANG_ELEMENT;           02910000
                                                                        02920000
  CALL PLISAXC( EVENTHANDLER,                                           02930000
                ADDR(TOKEN),                                            02940000
                ADDRDATA(XMLDOCUMENT),                                  02950000
                                                 /* SOC CEDS00000578 */ 02960000
            /*  MQ_MSG_LENGTH); */                                      02970000
                MQ_MSG_LENGTH,                                          02980000
                MQ_CCSID);                                              02990000
                                                 /* EOC CEDS00000578 */ 03000000
  CALL RCBXC2M_TYPE_VALIDATION;                                         03010000
                                                                        03020000
  /*MODEL_TEMP = '';                           *//* SOC CEDS00000692 */ 03030099
  /*    MODEL_TEMP = STRING(MODEL_UP);         *//* EOC CEDS00000692 */ 03040099
                                                                        03050000
                                                 /* SOC CEDS00000692 */ 03051099
  /*MODEL_TEMP1 = '';                          *//* SOC CEDS00000679 */ 03060099
                                                 /* EOC CEDS00000692 */ 03061099
  /******** EBCDIC BLANK IS CHANGED WITH UNICODE SPACE X'20' **********/03070000
                                                                        03080000
  MODEL_UP1.INSTALL           = RCBXC2M_TSN(MODEL_UP1.INSTALL,          03090000
                                         LEN_INSTALL);                  03100000
  MODEL_UP1.PRODUCT_TYPE      = RCBXC2M_TSN(MODEL_UP1.PRODUCT_TYPE,     03110000
                                         LEN_PRODTYP);                  03120000
  MODEL_UP1.MODEL_NUMBER      = RCBXC2M_TSN(MODEL_UP1.MODEL_NUMBER,     03130000
                                         LEN_MDLNUMBR);                 03140000
  MODEL_UP1.PROD_REVENUE_DIV  = RCBXC2M_TSN(MODEL_UP1.PROD_REVENUE_DIV, 03150000
                                         LEN_PRODREV);                  03160000
  MODEL_UP1.MACHINE_CATEGORY  = RCBXC2M_TSN(MODEL_UP1.MACHINE_CATEGORY, 03170000
                                         LEN_MACHCAT);                  03180000
  MODEL_UP1.VENDOR_NAME       = RCBXC2M_TSN(MODEL_UP1.VENDOR_NAME,      03190000
                                         LEN_VENDNAM);                  03200000
  MODEL_UP1.CE_PRODUCT_KEY    = RCBXC2M_TSN(MODEL_UP1.CE_PRODUCT_KEY,   03210000
                                         LEN_CEPRODK);                  03220000
  MODEL_UP1.PROD_SUP_COD      = RCBXC2M_TSN(MODEL_UP1.PROD_SUP_COD,     03230000
                                         LEN_PRODSUP);                  03240000
  MODEL_UP1.RETAIN_FLAG       = RCBXC2M_TSN(MODEL_UP1.RETAIN_FLAG,      03250000
                                         LEN_RETAIN);                   03260000
  MODEL_UP1.LAST_CHANGE_DATE  = RCBXC2M_TSN(MODEL_UP1.LAST_CHANGE_DATE, 03270000
                                         LEN_LASTCD);                   03280000
  MODEL_UP1.AVAILABILITY_DATE = RCBXC2M_TSN(MODEL_UP1.AVAILABILITY_DATE 03290000
                                        ,LEN_AVAILD);                   03300000
  MODEL_UP1.END_OF_SERVICE_DATE =                                       03310000
                  RCBXC2M_TSN(MODEL_UP1.END_OF_SERVICE_DATE,LEN_EOSERD);03320000
                                                                        03330000
                                                 /* SOC CEDS00000692 */ 03331099
  /*MODEL_TEMP1 = STRING(MODEL_UP1);           *//* EOC CEDS00000679 */ 03340099
                                                 /* EOC CEDS00000692 */ 03340199
  IF (VALID_FLAG) THEN                                                  03350000
  DO;                                                                   03360000
    CALL RCBXC2M_WW_VALIDATION;                                         03370000
                                                                        03380000
    IF (WW_ELEMENT_FLAG) THEN                                           03390000
    DO;                                                                 03400000
  /*  RCB693S_PTR = ADDR(MODEL_TEMP);          *//* SOC CEDS00000692 */ 03401099
      RCB693S_PTR = ADDR(MODEL_UP);              /* EOC CEDS00000692 */ 03402099
                                                 /* SOC CEDS00000679 */ 03420000
   /* CALL RCBF89M (RCB693S_PTR,PTR_RET_AREA_BB,PTR_INT_AREA);*/        03430000
   /* RCB693S_PTR1 = ADDR(MODEL_TEMP1);         *//* SOC CEDS00000692 */03440099
      RCB693S_PTR1 = ADDR(MODEL_UP1);             /* EOC CEDS00000692 */03441099
                                                                        03460000
      CALL RCBF89M (RCB693S_PTR,RCB693S_PTR1,PTR_RET_AREA_BB,           03470000
                    PTR_INT_AREA);                                      03480000
                                                 /* EOC CEDS00000679 */ 03490000
                                                                        03500000
      SELECT (PARM_RET_AREA_BB.RETURN_CODE);                            03510000
       WHEN (0)                                                         03520000
       DO;                                                              03530000
         PARSER_RETURN_AREA.T693_DETAILS.T693_INSERTS =                 03540000
                  PARSER_RETURN_AREA.T693_DETAILS.T693_INSERTS + 1;     03550000
         CHECK_INS_T693 = TRUE; /* SET FLAG TO TRUE */     /* RC01337 */03560000
       END;                                                             03570000
       WHEN (4)                                                         03580000
       DO;                                                              03590000
         PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES =                 03600000
                  PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES + 1;     03610000
                                                       /* SOC RB01342 */03620000
         PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES_MODEL =           03630000
           PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES_MODEL + 1;      03640000
                                                       /* EOC RB01342 */03650000
         CHECK_INS_T693 = TRUE; /* SET FLAG TO TRUE */ /*CEDS00000679 */03660000
                                                       /* SOC RB01342 */03670000
         T693_MACHINE_CATEGORY   = RCB693S1.MACHINE_CATEGORY;           03680000
         T693_CE_PRODUCT_KEY     = RCB693S1.CE_PRODUCT_KEY;             03690000
         T693_PROD_SUP_COD       = RCB693S1.PROD_SUP_COD;               03700000
         T693_RETAIN_FLAG        = RCB693S1.RETAIN_FLAG;                03710000
         T693_INSTALL            = RCB693S1.INSTALL;                    03720000
                                                                        03730000
         EXEC SQL                                                       03770000
           UPDATE RCBV0693_TYPE_MOD_WW_LVL                              03780000
           SET MACHINE_CATEGORY    =:T693_MACHINE_CATEGORY,             03790000
               CE_PRODUCT_KEY      =:T693_CE_PRODUCT_KEY,               03800000
               PROD_SUP_COD        =:T693_PROD_SUP_COD,                 03810000
               RETAIN_FLAG         =:T693_RETAIN_FLAG,                  03820000
               INSTALL             =:T693_INSTALL                       03830000
           WHERE  PARENT_PRODTYPE  =:RCB693S.PRODUCT_TYPE               03840000
            AND   PARENT_MODEL     =:RCB693S.MODEL_NUMBER;              03850000
                                                                        03860000
         SELECT (SQLCA.SQLCODE);                                        03870000
          WHEN(0)                                                       03880000
           DO;                                                          03890000
            SEO_FLAG_T693 = TRUE;                                       03900000
            PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES =              03910000
               PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES +           03920000
                 SQLCA.SQLERRD(3);                                      03921000
            PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES_SEO =          03930000
               PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES_SEO +       03940000
                 SQLCA.SQLERRD(3);                                      03941000
           END;                                                         03950000
                                                                        03960000
          WHEN(100)                                                     03961000
            CALL RCBXC2M_MSG('0326');                                   03962099
                                                                        03963000
          OTHERWISE                                                     03970000
           DO;                                                          03980000
            ERROR_CODE_DET.ERR_TYPE  ='DB2';                            04010000
            ERROR_CODE_DET.CALL_ID   ='#006';                           04020000
            SIGNAL ERROR;                                               04030000
           END;          /* OTHERWISE */                                04040099
         END;            /*  SELECT   */                                04050099
       END;              /*  WHEN     */                                04060099
                                                       /* EOC RB01342 */04261000
       OTHERWISE                                                        04270000
       DO;                                                              04280000
         ERROR_CODE_DET.PTR_ERROR = ADDR(PARM_RET_AREA_BB.RETURN_SQL);  04290000
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               04300000
         ERROR_CODE_DET.CALL_ID   ='#001';                              04310000
         SIGNAL ERROR;                                                  04320000
       END;                                                             04330000
      END;                                                              04331000
    END;                                                                04340000
  IF (CHECK_INS_T693) THEN                             /* SOC RC01337 */04360000
  DO;                                                  /* EOC RC01337 */04370000
  /*IF(((WW_ELEMENT_FLAG) | (CTRY_DATA_FLAG)) & (CNT_AVAIL_ELEMENT ¬=0))04380000
                                                     *//* SOC RB01342 */04380193
    IF((WW_ELEMENT_FLAG) & (CNT_AVAIL_ELEMENT ¬=0))    /* EOC RB01342 */04381093
    THEN DO;                                                            04390000
                                                                        04400000
     IF (CNT_CTRY_REQ ¬= 0) THEN                                        04410000
     DO;                                                                04420000
                                                                        04430000
       DO I = 1 TO CNT_AVAIL_ELEMENT BY 1;                              04440000
                                                                        04450000
         IF ((COUNTRY_LIST(I).EACM_COUNTRY_FC ¬= ''    )  &             04460000
             (COUNTRY_LIST(I).EACM_COUNTRY_FC >= '1000')  &             04470000
             (COUNTRY_LIST(I).EACM_COUNTRY_FC <= '9999')) THEN          04480000
         DO;                                                            04490000
           CALL RCBXC2M_CTRY_VALIDATION;                                04500000
                                                                        04510000
           IF(CTRY_ELEMENT_FLAG) THEN                                   04520000
           DO;                                                          04530000
             IF(COUNTRY_LIST(I).END_OF_SERVICE_DATE = '') THEN          04540000
             DO;                                      /* CEDS00000679 */04550000
                COUNTRY_LIST(I).END_OF_SERVICE_DATE = '9999-12-31';     04560000
                                                 /* SOC CEDS00000679 */ 04570000
               ELE_CONVERT        = 0;                                  04580000
               PTR_MODEL_ESDA     =                                     04590000
                            ADDR(COUNTRY_LIST1(I).END_OF_SERVICE_DATE); 04600000
               PTR_MODEL_ESDB     =                                     04610000
                            ADDR(COUNTRY_LIST(I).END_OF_SERVICE_DATE);  04620000
               ELE_CONVERT        = MEMCONVERT (PTR_MODEL_ESDA,         04630000
                                                10,                     04640000
                                                1208,                   04650000
                                                PTR_MODEL_ESDB,         04660000
                                                10,                     04670000
                                                500);                   04680000
             END;                                /* EOC CEDS00000679 */ 04690000
                                                                        04700000
             CALL RCBXC2M_DATE_VALIDATION;                              04710000
                                                                        04720000
             IF(VALID_CTRY) THEN                                        04730000
             DO;                                                        04740000
               COUNTRY_LIST_TEMP = '';                                  04750000
               COUNTRY_LIST_TEMP = STRING(COUNTRY_LIST(I));             04760000
                                                  /* SOC CEDS00000679 */04770000
  /******** EBCDIC BLANK IS CHANGED WITH UNICODE SPACE X'20' **********/04780000
               COUNTRY_LIST1(I).PRODUCT_TYPE = RCBXC2M_TSN(             04790000
                        COUNTRY_LIST1(I).PRODUCT_TYPE,LEN_CPRODTYP);    04800000
               COUNTRY_LIST1(I).MODEL_NUMBER = RCBXC2M_TSN(             04810000
                        COUNTRY_LIST1(I).MODEL_NUMBER,LEN_CMDLNUMBR);   04820000
               COUNTRY_LIST1(I).EACM_COUNTRY_FC = RCBXC2M_TSN(          04830000
                        COUNTRY_LIST1(I).EACM_COUNTRY_FC,LEN_CEACMTRY); 04840000
               COUNTRY_LIST1(I).AVAILABILITY_DATE = RCBXC2M_TSN(        04850000
                        COUNTRY_LIST1(I).AVAILABILITY_DATE,LEN_CAVAILD);04860000
               COUNTRY_LIST1(I).END_OF_SERVICE_DATE = RCBXC2M_TSN(      04870000
                        COUNTRY_LIST1(I).END_OF_SERVICE_DATE,LEN_CEOSD);04880000
               COUNTRY_LIST1(I).LAST_CHANGE_DATE = RCBXC2M_TSN(         04890000
                        COUNTRY_LIST1(I).LAST_CHANGE_DATE,LEN_CLASTCD); 04900000
                                                                        04910000
               COUNTRY_LIST_TEMP1 = '';                                 04920000
               COUNTRY_LIST_TEMP1= STRING(COUNTRY_LIST1(I));            04930000
               RCB694S_PTR1 = ADDR(COUNTRY_LIST_TEMP1);                 04940000
                                                  /* EOC CEDS00000679 */04950000
                                                                        04960000
               RCB694S_PTR = ADDR(COUNTRY_LIST_TEMP);                   04970000
                                                  /* SOC CEDS00000679 */04980000
            /* CALL RCBF90M (RCB694S_PTR,PTR_RET_AREA_BB,PTR_INT_AREA); 04990000
            */                                                          05000000
               CALL RCBF90M (RCB694S_PTR,RCB694S_PTR1,PTR_RET_AREA_BB,  05010000
                             PTR_INT_AREA);                             05020000
                                                  /* EOC CEDS00000679 */05030000
                                                                        05040000
               SELECT (PARM_RET_AREA_BB.RETURN_CODE);                   05050000
                WHEN (0)                                                05060000
                  PARSER_RETURN_AREA.T694_DETAILS.T694_INSERTS =        05070000
                       PARSER_RETURN_AREA.T694_DETAILS.T694_INSERTS + 1;05080000
                WHEN (4)                                                05090000
                DO;                                       /* RB01342 */ 05100000
                  PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES =        05110000
                       PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES + 1;05120000
                                                       /* SOC RB01342 */05130093
                 PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES_MODEL =   05140000
                 PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES_MODEL + 1;05150000
                                                                        05160000
               IF SEO_FLAG_T693 = TRUE THEN                             05160700
                DO;                                                     05160800
                T694_END_OF_SERVICE_DATE = RCB694S1.END_OF_SERVICE_DATE;05301000
                                                                        05302000
                 EXEC SQL                                               05310000
                   UPDATE RCBV0694_TYPE_MOD_CTRY_LVL                    05320000
                   SET END_OF_SERVICE_DATE  =:T694_END_OF_SERVICE_DATE  05330000
                    WHERE PRODUCT_TYPE IN (SELECT PRODUCT_TYPE FROM     05350000
                      RCBT0693_TYPE_MOD_WW_LVL                          05351000
                      WHERE PARENT_PRODTYPE =:RCB693S.PRODUCT_TYPE)     05352000
                    AND MODEL_NUMBER IN (SELECT MODEL_NUMBER FROM       05360000
                      RCBT0693_TYPE_MOD_WW_LVL                          05361000
                      WHERE PARENT_MODEL    =:RCB693S.MODEL_NUMBER)     05362000
                    AND EACM_COUNTRY_FC     =:RCB694S.EACM_COUNTRY_FC;  05370000
                 SELECT (SQLCA.SQLCODE);                                05390000
                  WHEN(0)                                               05400000
                   DO;                                                  05410000
                   PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES =       05420000
                      PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES +    05430000
                         SQLCA.SQLERRD(3);                              05431000
                   PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES_SEO =   05440000
                      PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES_SEO +05450000
                         SQLCA.SQLERRD(3);                              05451000
                   END;                                                 05460000
                                                                        05470000
                   WHEN(100)                                            05471000
                   CALL RCBXC2M_MSG('0326');                            05472000
                                                                        05473000
                   OTHERWISE                                            05480000
                    DO;                                                 05490000
                     ERROR_CODE_DET.ERR_TYPE  ='DB2';                   05520000
                     ERROR_CODE_DET.CALL_ID   ='#007';                  05530000
                     SIGNAL ERROR;                                      05540000
                    END;             /* OTHERWISE */                    05550093
                 END;                /*  SELECT   */                    05560093
                END;                 /*  IF       */                    05731093
                END;                 /*  WHEN     */ /* EOC RB01342 */  05732093
                                                                        05740000
                OTHERWISE                                               05750000
                DO;                                                     05760000
                  ERROR_CODE_DET.PTR_ERROR =                            05770000
                                      ADDR(PARM_RET_AREA_BB.RETURN_SQL);05780000
                  ERROR_CODE_DET.ERR_TYPE  ='DB2';                      05790000
                  ERROR_CODE_DET.CALL_ID   ='#002';                     05800000
                  SIGNAL ERROR;                                         05810000
                END;                                                    05820000
               END;                                                     05830000
             END;                                                       05840000
           END;                                                         05850000
         END;                                                           05860000
         ELSE DO;                                                       05870000
                VALID_CTRY = FALSE;                                     05880000
                CALL RCBXC2M_MSG('0296');                               05890000
         END;                                                           05900000
       END;                                                             05910000
     END;                                                               05920000
     ELSE                                                               05930000
     DO;                                                                05940000
       CALL RCBXC2M_MSG('0297');                                        05950000
       CTRY_ELEMENT_FLAG = FALSE;                                       05960000
       DO L = 1 TO CNT_AVAIL_ELEMENT BY 1;                              05970000
          MODEL_UPD_DETAILS.LIST_OF_CTRY_NOT_REQ(L) =                   05980000
                               COUNTRY_LIST(I).EACM_COUNTRY_FC;         05990000
          I = I - 1;                                                    06000000
       END;                                                             06010000
     END;                                                               06020000
    END;                                                                06030000
                                                                        06040000
    IF (MODEL_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ ¬= 0) THEN          06050000
    DO;                                                                 06060000
      DO L = 1 TO K BY 1;                                               06070000
         MODEL_UPD_DETAILS.LIST_OF_CTRY_NOT_REQ(L) = SKIP_CTRY_ARRAY(K);06080000
         K = K - 1;                                                     06090000
      END;                                                              06100000
    END;                                                                06110000
                                                                        06120000
    IF (MODEL_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ ¬= 0) &             06130000
       (CNT_AVAIL_ELEMENT ¬= 0)                           &             06140000
       (MODEL_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ = CNT_AVAIL_ELEMENT)06150000
    THEN                                                                06160000
        CALL RCBXC2M_MSG('0300');                                       06170000
                                                                        06180000
  IF WW_ELEMENT_FLAG THEN                /* SOC RC01319 - PCEDSP-0239 */06190000
  DO;                                    /* EOC RC01319 - PCEDSP-0239 */06200000
    DO J = 1 TO MODEL_UPD_UCOUNT_DET.CNT_LANG_ELEMENT;                  06210099
                                                                        06220099
      CALL RCBXC2M_LANG_VALIDATION;                                     06230000
                                                                        06240000
      IF (LANG_ELEMENT_FLAG) THEN                                       06250000
      DO;                                                               06260000
                                                                        06270000
                                                  /* SOC CEDS00000692 */06272099
        /*LANG_LIST_TEMP = '';                                        */06280099
        /*LANG_LIST_TEMP = STRING(LANGUAGE_LIST(J));                  */06290099
        /*LANG_LIST_TEMP1 = '';                 *//* SOC CEDS00000679 */06300099
                                                  /* EOC CEDS00000692 */06301099
  /******** EBCDIC BLANK IS CHANGED WITH UNICODE SPACE X'20' **********/06310000
        LANG_LIST(J).PRODUCT_TYPE =                                     06320000
         RCBXC2M_TSN(LANG_LIST(J).PRODUCT_TYPE,LEN_LPRODTYP);           06330000
        LANG_LIST(J).MODEL_NUMBER =                                     06340000
         RCBXC2M_TSN(LANG_LIST(J).MODEL_NUMBER,LEN_LMDLNUMBR);          06350000
        LANG_LIST(J).LANG_ID =                                          06360000
         RCBXC2M_TSN(LANG_LIST(J).LANG_ID,LEN_LLANGID);                 06370000
        LANG_LIST(J).LAST_CHANGE_DATE =                                 06380000
               RCBXC2M_TSN(LANG_LIST(J).LAST_CHANGE_DATE,               06390000
                                         LEN_LLASTCD);                  06400000
                                                  /* SOC CEDS00000692 */06401099
        /*LANG_LIST_TEMP1 = STRING(LANG_LIST(J));                     */06410099
        /*RCB696S_PTR1 = ADDR(LANG_LIST_TEMP1); *//* EOC CEDS00000679 */06420099
        RCB696S_PTR1  = ADDR(LANG_LIST(J));                             06420199
                                                  /* EOC CEDS00000692 */06421099
                                                                        06430000
        /*RCB696S_PTR = ADDR(LANG_LIST_TEMP);   *//* SOC CEDS00000692 */06440099
        RCB696S_PTR = ADDR(LANGUAGE_LIST(J));     /* EOC CEDS00000692 */06441099
                                                  /* SOC CEDS00000679 */06450000
      /*CALL RCBF92M (RCB696S_PTR,PTR_RET_AREA_BB,PTR_INT_AREA);*/      06460000
        CALL RCBF92M (RCB696S_PTR,RCB696S_PTR1,PTR_RET_AREA_BB,         06470000
                      PTR_INT_AREA);                                    06480000
                                                  /* EOC CEDS00000679 */06490099
                                                                        06500000
        SELECT (PARM_RET_AREA_BB.RETURN_CODE);                          06510000
         WHEN (0)                                                       06520000
           PARSER_RETURN_AREA.T696_DETAILS.T696_INSERTS =               06530000
                       PARSER_RETURN_AREA.T696_DETAILS.T696_INSERTS + 1;06540000
         WHEN (4)                                                       06550000
           PARSER_RETURN_AREA.T696_DETAILS.T696_UPDATES =               06560000
                       PARSER_RETURN_AREA.T696_DETAILS.T696_UPDATES + 1;06570000
         OTHERWISE                                                      06580000
         DO;                                                            06590000
           ERROR_CODE_DET.PTR_ERROR = ADDR(PARM_RET_AREA_BB.RETURN_SQL);06600000
           ERROR_CODE_DET.ERR_TYPE  ='DB2';                             06610000
           ERROR_CODE_DET.CALL_ID   ='#003';                            06620000
           SIGNAL ERROR;                                                06630000
         END;                                                           06640000
        END;                                                            06650000
      END;                                                              06660000
    END;                                                                06670000
  END;                                   /* EOC RC01319 - PCEDSP-0239 */06680000
 END;                                                       /* RC01337*/06690000
                                                                        06700000
    CALL RCBXC2M_END_PROGRAM;                                           06710000
                                                                        06720000
  END;                                                                  06730000
                                                                        06740000
1/********************************************************************/ 06750000
 /*                                                                  */ 06760000
 /* MODULE NAME      : RCBXC2M_END_PROGRAM                           */ 06770000
 /*                                                                  */ 06780000
 /* DESCRIPTION      : CLOSING RCBXC2M PROGRAM                       */ 06790000
 /*                                                                  */ 06800000
 /********************************************************************/ 06810000
 RCBXC2M_END_PROGRAM: PROC;                                             06820000
                                                                        06830000
 PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'N';                       06840000
                                                                        06850000
 IF (MODEL_UPD_DETAILS.NO_MSG_SKIP_CTRY_NOT_REQ ¬= '1') THEN            06860000
 /*DO                                               *//*SOC RB01342 */  06870000
 DO;                                                  /*EOC RB01342 */  06880000
    IF ((T693_DETAILS.T693_INSERTS = 0) &                               06890000
        (T693_DETAILS.T693_UPDATES = 0) &                               06900000
        (T694_DETAILS.T694_INSERTS = 0) &                               06910000
        (T694_DETAILS.T694_UPDATES = 0) &                               06920000
        (T696_DETAILS.T696_INSERTS = 0) &                               06930000
        (T696_DETAILS.T696_UPDATES = 0)) THEN                           06940000
        DO;                                                             06950000
          PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'Y';              06960000
          CALL RCBXC2M_MSG('0306');                                     06970000
       END;                                                             06980000
 END;                                                                   06990000
 FREE COUNTRY_LIST;                                   /* SOC RC01324 */ 07000099
 FREE LANGUAGE_LIST;                                                    07003099
 FREE SKIP_CTRY_ARRAY;                                /* EOC RC01324 */ 07020000
 FREE LANG_LIST;                                 /* SOC CEDS00000679 */ 07030000
 FREE COUNTRY_LIST1;                             /* EOC CEDS00000679 */ 07040000
                                                                        07050000
 END RCBXC2M_END_PROGRAM;                                               07060000
1/********************************************************************/ 07070000
 /*                                                                  */ 07080000
 /* MODULE NAME      : RCBXC2M_TYPE_VALIDATION                       */ 07090000
 /*                                                                  */ 07100000
 /* DESCRIPTION      : VALIDATION OF DATA                            */ 07110000
 /*                                                                  */ 07120000
 /********************************************************************/ 07130000
 RCBXC2M_TYPE_VALIDATION: PROC;                                         07140000
                                                                        07150000
  PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'N';                      07160000
  VALID_FLAG = TRUE;                                                    07170000
                                                                        07180000
  IF ((MODEL_UP.PRODUCT_TYPE =' ') | (MODEL_UP.MODEL_NUMBER =' '))THEN  07190000
  DO;                                                                   07200000
     VALID_FLAG = FALSE;                                                07210000
     PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'Y';                   07220000
     CALL RCBXC2M_MSG('0292');                                          07230000
  END;                                                                  07240000
                                                                        07250000
  IF (VALID_FLAG) THEN                                                  07260000
  DO;                                                                   07270000
    IF (VERIFY(MODEL_UP.PRODUCT_TYPE,ALPHANUM) ¬= 0) |                  07280000
       (VERIFY(MODEL_UP.MODEL_NUMBER,ALPHANUM) ¬= 0) THEN               07290000
    DO;                                                                 07300000
        VALID_FLAG = FALSE;                                             07310000
        PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'Y';                07320000
        CALL RCBXC2M_MSG('0293');                                       07330000
    END;                                                                07340000
  END;                                                                  07350000
  END RCBXC2M_TYPE_VALIDATION;                                          07360000
1/********************************************************************/ 07370000
 /*                                                                  */ 07380000
 /* MODULE NAME      : RCBXC2M_WW_VALIDATION                         */ 07390000
 /*                                                                  */ 07400000
 /* DESCRIPTION      : VALIDATION OF WW DATA                         */ 07410000
 /*                                                                  */ 07420000
 /********************************************************************/ 07430000
 RCBXC2M_WW_VALIDATION: PROC;                                           07440000
                                                                        07450000
 PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION  = 'N';                      07460000
 T693_INSERT_FLAG = FALSE;                                              07470000
 T693_UPDATE_FLAG = FALSE;                                              07480000
 CHECK_INS_T693 = FALSE;    /* SET FLAG TO FALSE  */      /* RC01337 */ 07490000
                                                                        07500000
 CALL RCBXC2M_SELECT_T693;                                              07510000
                                                                        07520000
  IF (T693_INSERT_FLAG) THEN                                            07530000
  DO;                                                                   07540000
    IF MODEL_UP.PROD_REVENUE_DIV   ¬= '' &                              07550000
       MODEL_UP.MACHINE_CATEGORY   ¬= '' &                              07560000
   /*  MODEL_UP.CE_PRODUCT_KEY     ¬= '' & *//*SOC RC01319-PCEDSP-0237*/07570000
   /*  MODEL_UP.PROD_SUP_COD       ¬= '' & *//*EOC RC01319-PCEDSP-0237*/07580000
       MODEL_UP.RETAIN_FLAG        ¬= '' &                              07590000
       MODEL_UP.INSTALL            ¬= '' THEN                           07600000
    DO;                                                                 07610000
           WW_ELEMENT_FLAG = TRUE;                                      07620000
    END;                                                                07630000
    ELSE                                                                07640000
    DO;                                                                 07650000
      CALL RCBXC2M_MSG('0294');                                         07660000
      WW_ELEMENT_FLAG = FALSE;                                          07670000
                                                                        07680000
      IF CNT_AVAIL_ELEMENT > 0 THEN                                     07690000
      DO;                                                               07700000
   /*   CALL RCBXC2M_MSG('0298');                        *//* RC01337 */07710000
        CTRY_ELEMENT_FLAG = FALSE;                                      07720000
        /*CTRY_DATA_FLAG    = FALSE;                     *//* RB01342 */07730000
        MODEL_UPD_DETAILS.NO_REJ_CTRY_WW_DATA_NOT_REG =                 07740000
                                               CNT_AVAIL_ELEMENT;       07750000
      END;                                                              07760000
      IF CNT_LANG_ELEMENT1 > 0 THEN          /*SOC RC01319-PCEDSP-0239*/07770000
      DO;                                                               07780000
   /*   CALL RCBXC2M_MSG('0313');                        *//* RC01337 */07790000
        LANG_ELEMENT_FLAG = FALSE;                                      07800000
        MODEL_UPD_DETAILS.NO_REJ_LANG_WW_DATA_NOT_REG =                 07810000
                                               CNT_LANG_ELEMENT1;       07820000
      END;                                   /*EOC RC01319-PCEDSP-0239*/07830000
    END;                                                                07840000
  END;                                                                  07850000
                                                                        07860000
  IF (T693_UPDATE_FLAG) THEN                                            07870000
  DO;                                                                   07880000
    IF MODEL_UP.PROD_REVENUE_DIV   ¬= '' |                              07890000
       MODEL_UP.MACHINE_CATEGORY   ¬= '' |                              07900000
       MODEL_UP.CE_PRODUCT_KEY     ¬= '' |                              07910000
       MODEL_UP.PROD_SUP_COD       ¬= '' |                              07920000
       MODEL_UP.RETAIN_FLAG        ¬= '' |                              07930000
       MODEL_UP.INSTALL            ¬= '' THEN                           07940000
           WW_ELEMENT_FLAG = TRUE;                                      07950000
    ELSE                                                                07960000
    DO;                                                                 07970000
      IF MODEL_UP.PROD_REVENUE_DIV   = '' &                             07980000
         MODEL_UP.MACHINE_CATEGORY   = '' &                             07990000
         MODEL_UP.CE_PRODUCT_KEY     = '' &                             08000000
         MODEL_UP.PROD_SUP_COD       = '' &                             08010000
         MODEL_UP.RETAIN_FLAG        = '' &                             08020000
         MODEL_UP.INSTALL            = '' THEN                          08030000
      DO;                                                               08040000
        WW_ELEMENT_FLAG = FALSE;                                        08050000
      /*CTRY_DATA_FLAG  = TRUE;                        *//*  RB01342  */08060000
      END;                                                              08070000
      /*ELSE                                         *//* SOC RB01342 */08080000
      /*  CTRY_DATA_FLAG = FALSE;                    *//* EOC RB01342 */08090000
    END;                                                                08100000
  END;                                                                  08110000
                                                                        08120000
 END RCBXC2M_WW_VALIDATION;                                             08130000
1/********************************************************************/ 08140000
 /*                                                                  */ 08150000
 /* MODULE NAME      : RCBXC2M_LANG_VALIDATION                       */ 08160000
 /*                                                                  */ 08170000
 /* DESCRIPTION      : VALIDATION OF LANGUAGE LIST DATA              */ 08180000
 /*                                                                  */ 08190000
 /********************************************************************/ 08200000
 RCBXC2M_LANG_VALIDATION: PROC;                                         08210000
                                                                        08220000
  T696_INSERT_FLAG = FALSE;                                             08230000
  T696_UPDATE_FLAG = FALSE;                                             08240000
                                                                        08250000
                                                                        08251099
  IF (LANGUAGE_LIST(J).LANG_ID = '1') THEN                              08260099
  DO;                                                                   08270000
                                             /* SOC RC01337  */         08280000
  /*  IF (LANGUAGE_LIST(J).PROD_DESC  ¬= '') THEN */                    08290000
  /*ELSE */                                  /*SOC RC01319-PCEDSP-0237*/08300000
  /*DO;                                                                 08310000
           LANG_ELEMENT_FLAG = FALSE;                                   08320000
           CALL RCBXC2M_MSG('0315');                                    08330000
    END; */                                  /*EOC RC01319-PCEDSP-0237*/08340000
           LANG_ELEMENT_FLAG = TRUE;                                    08350000
                                             /* EOC RC01337  */         08360000
  END;                                                                  08370000
  ELSE                                                                  08380000
  DO;                                                                   08390000
    CALL RCBXC2M_SELECT_T696;                                           08400000
    IF(T696_UPDATE_FLAG) THEN                                           08410099
           LANG_ELEMENT_FLAG = FALSE;                                   08420000
    ELSE                                                                08430000
    DO;                                                                 08440000
           CALL RCBXC2M_MSG('0295');                                    08450000
                                             /* SOC RC01337  */         08460000
       /*  LANGUAGE_LIST(J).PROD_DESC = 'INVNAME NOT IN ENGLISH';*/     08470000
                                                  /* SOC CEDS00000679 */08480000
       /*  LANGUAGE_LIST(J).PROD_DESC = 'MKTGNAME NOT IN ENGLISH';*/    08490000
                                             /* EOC RC01337  */         08500000
       /*  LANGUAGE_LIST(J).LANG_ID   = '1'; */                         08510000
                                                  /* EOC CEDS00000679 */08520000
                                                  /* SOC CEDS00000692 */08520112
           DCL PROD_DESC_TEMP CHAR(23) INIT('MKTGNAME NOT IN ENGLISH'); 08521099
           DCL PROD_DESC_TEMP1 CHAR(23);                                08521199
           LANG_LIST(J).PROD_DESC = (23)'20'X;                          08521299
           PROD_DESC_TEMP1 = (23)'20'X;                                 08521399
                                                                        08521407
           ELE_CONVERT             = 0;                                 08521506
           PTR_MODEL_ESDA          = ADDR(PROD_DESC_TEMP);              08521699
           PTR_MODEL_ESDB          = ADDR(PROD_DESC_TEMP1);             08521799
           ELE_CONVERT             = MEMCONVERT (PTR_MODEL_ESDB,        08521899
                                                 23,                    08521999
                                                 1208,                  08522006
                                                 PTR_MODEL_ESDA,        08522199
                                                 23,                    08522207
                                                 500);                  08522306
           LANGUAGE_LIST(J).PROD_DESC = PROD_DESC_TEMP;                 08522499
           LANG_LIST(J).PROD_DESC     = PROD_DESC_TEMP1;                08522599
                                                                        08522699
           LANGUAGE_LIST(J).LANG_ID   = ' ';                            08522799
           LANG_LIST(J).LANG_ID       = (1)'20'X;                       08522899
           LANGUAGE_LIST(J).LANG_ID   = '1';                            08522999
           ELE_CONVERT             = 0;                                 08523099
           PTR_MODEL_ESDA          = ADDR(LANG_LIST(J).LANG_ID);        08523199
           PTR_MODEL_ESDB          = ADDR(LANGUAGE_LIST(J).LANG_ID);    08523299
           ELE_CONVERT             = MEMCONVERT (PTR_MODEL_ESDA,        08523399
                                                 1,                     08523499
                                                 1208,                  08523599
                                                 PTR_MODEL_ESDB,        08523699
                                                 1,                     08523799
                                                 500);                  08523899
                                                  /* EOC CEDS00000692 */08524012
           LANG_ELEMENT_FLAG          = TRUE;                           08530000
                                                                        08531099
    END;                                                                08540000
                                                                        08550099
   END;                                                                 08551099
 END RCBXC2M_LANG_VALIDATION;                                           08560000
1/********************************************************************/ 08570000
 /*                                                                  */ 08580000
 /* MODULE NAME      : RCBXC2M_CTRY_VALIDATION                       */ 08590000
 /*                                                                  */ 08600000
 /* DESCRIPTION      : VALIDATION OF CTRY DEVIATED DATA              */ 08610000
 /*                                                                  */ 08620000
 /********************************************************************/ 08630000
 RCBXC2M_CTRY_VALIDATION: PROC;                                         08640000
                                                                        08650000
 DCL CTRY_EXIST    BIT(1) INIT('0');                                    08660000
                                                                        08670000
 DO T = 1 TO CNT_CTRY_REQ BY 1;                                         08680000
    IF (COUNTRY_LIST(I).EACM_COUNTRY_FC = IC_CNTRY(T))                  08690000
    THEN                                                                08700099
           CTRY_EXIST = TRUE;                                           08710000
 END;                                                                   08720000
                                                                        08730000
 IF (CTRY_EXIST) THEN                                                   08740099
  CTRY_ELEMENT_FLAG = TRUE;                                             08750000
                                                                        08760000
 ELSE                                                                   08770000
 DO;                                                                    08780000
   CTRY_ELEMENT_FLAG = FALSE;                                           08790000
   K = K + 1;                                                           08800000
   SKIP_CTRY_ARRAY(K) = COUNTRY_LIST(I).EACM_COUNTRY_FC;                08810000
   CALL RCBXC2M_MSG('0299');                                            08820000
                                                                        08830000
   /*IF(CTRY_DATA_FLAG) THEN                        *//* SOC RB01342 */ 08840000
   /*DO;                                            *//* EOC RB01342 */ 08850000
     IF(NO_CTRY_SKIP_CTRY_NOT_REQ  = CNT_AVAIL_ELEMENT) THEN            08860000
        MODEL_UPD_DETAILS.NO_MSG_SKIP_CTRY_NOT_REQ  = 1;                08870000
                                    /* NONE OF THE CTRY ARE REQUESTED*/ 08880000
   /*END;                                             *//*  RB01342  */ 08890000
 END;                                                                   08900000
                                                                        08910000
 END RCBXC2M_CTRY_VALIDATION;                                           08920000
1/********************************************************************/ 08930000
 /*                                                                  */ 08940000
 /* MODULE NAME      : RCBXC2M_DATE_VALIDATION                       */ 08950000
 /*                                                                  */ 08960000
 /* DESCRIPTION      : CALLS THE DATE VALIDATION ROUTINE             */ 08970000
 /*                                                                  */ 08980000
 /********************************************************************/ 08990000
 RCBXC2M_DATE_VALIDATION: PROC;                                         09000000
                                                                        09010000
 DCL AWRK_DATE CHAR(10);                                                09020000
 DCL EWRK_DATE CHAR(10);                                                09030000
                                                                        09040000
 AWRK_DATE = COUNTRY_LIST.AVAILABILITY_DATE(I);                         09050000
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      09060000
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      09070000
 DATE_AREA.WD_FUNCTION    = 'V';                                        09080000
 DATE_AREA.WD_PERIOD_TYPE = 'D';                                        09090000
 DATE_AREA.WD_PERIOD      = 0;                                          09100000
 DATE_AREA.WD_IN_DATE     = AWRK_DATE;                                  09110000
 PTR_DATE_AREA            = ADDR(DATE_AREA);                            09120000
                                                                        09130000
 CALL RCB004M (PTR_DATE_AREA);                                          09140000
                                                                        09150000
 IF DATE_AREA.WD_STATUS   ¬= ' ' THEN                                   09160000
 DO;                                                                    09170000
   VALID_CTRY = FALSE;                                                  09180000
   CALL RCBXC2M_MSG('0296');                                            09190000
 END;                                                                   09200000
 ELSE DO;                                                               09210000
   COUNTRY_LIST.AVAILABILITY_DATE(I) = WD_IN_DATE;                      09220000
   VALID_CTRY = TRUE;                                                   09230000
 END;                                                                   09240000
                                                                        09250000
 IF (VALID_CTRY) THEN                                                   09260000
 DO;                                                                    09270000
   EWRK_DATE = COUNTRY_LIST.END_OF_SERVICE_DATE(I);                     09280000
   DATE_AREA.WD_IN_FORMAT   = 'ISO';                                    09290000
   DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                    09300000
   DATE_AREA.WD_FUNCTION    = 'V';                                      09310000
   DATE_AREA.WD_PERIOD_TYPE = 'D';                                      09320000
   DATE_AREA.WD_PERIOD      = 0;                                        09330000
   DATE_AREA.WD_IN_DATE     = EWRK_DATE;                                09340000
   PTR_DATE_AREA            = ADDR(DATE_AREA);                          09350000
                                                                        09360000
   CALL RCB004M (PTR_DATE_AREA);                                        09370000
                                                                        09380000
   IF DATE_AREA.WD_STATUS ¬= ' ' THEN                                   09390000
   DO;                                                                  09400000
     VALID_CTRY = FALSE;                                                09410000
     CALL RCBXC2M_MSG('0296');                                          09420000
   END;                                                                 09430000
   ELSE                                                                 09440000
   DO;                                                                  09450000
     COUNTRY_LIST.END_OF_SERVICE_DATE(I) = WD_IN_DATE;                  09460000
     VALID_CTRY = TRUE;                                                 09470000
   END;                                                                 09480000
 END;                                                                   09490000
                                                                        09500000
 END RCBXC2M_DATE_VALIDATION;                                           09510000
1/********************************************************************/ 09520000
 /*                                                                  */ 09530000
 /* MODULE NAME      : RCBXC2M_MSG                                   */ 09540000
 /*                                                                  */ 09550000
 /* DESCRIPTION      : CALLS THE MESSAGE ROUTINE AFTER FILLING       */ 09560000
 /*                    THE INPUT VARIABLES                           */ 09570000
 /*                                                                  */ 09580000
 /********************************************************************/ 09590000
 RCBXC2M_MSG: PROC (A_MSG_NR);                                          09600000
                                                                        09610000
 DCL A_MSG_NR          CHAR(04);                                        09620000
 PARM_INT_AREA.MSG_VAR_CODES = ' ';             /*RESET COMMON FIELDS*/ 09630000
                                                                        09640000
 SELECT (A_MSG_NR);                                                     09650000
 /* 0292: MANDATORY FIELDS CANNOT BE BLANK MESSAGE REJECTED */          09660000
    WHEN ('0292')                                                       09670000
    DO;                                                                 09680000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            09690000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        09700000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            09710000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   09720000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            09730000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           09740000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            09750000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           09760000
    END;                                                                09770000
                                                                        09780000
 /* 0293: FIELDS MUST BE FILLED WITH ALPHANUMERIC ONLY  */              09790000
    WHEN ('0293')                                                       09800000
    DO;                                                                 09810000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            09820000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        09830000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            09840000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   09850000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            09860000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           09870000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            09880000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           09890000
    END;                                                                09900000
                                                                        09910000
 /* 0294: T693 REGISTRATION FAILURE */                                  09920000
    WHEN ('0294')                                                       09930000
    DO;                                                                 09940000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            09950000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        09960000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            09970000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   09980000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            09990000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           10000000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            10010000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           10020000
      PARM_INT_AREA.MSG_VAR_CODE_9   = 'IL'; /*SOC RC01319-PCEDSP-0237*/10030000
      PARM_INT_AREA.MSG_VAR_VALUE_9  = MODEL_UP.INSTALL;                10040000
      PARM_INT_AREA.MSG_VAR_CODE_10  = 'MC';                            10050000
      PARM_INT_AREA.MSG_VAR_VALUE_10 = MODEL_UP.MACHINE_CATEGORY;       10060000
      PARM_INT_AREA.MSG_VAR_CODE_11  = 'DI';                            10070000
      PARM_INT_AREA.MSG_VAR_VALUE_11 = MODEL_UP.PROD_REVENUE_DIV;       10080000
      PARM_INT_AREA.MSG_VAR_CODE_12  = 'RF';                            10090000
      PARM_INT_AREA.MSG_VAR_VALUE_12 = MODEL_UP.RETAIN_FLAG;            10100000
                                             /*EOC RC01319-PCEDSP-0237*/10110000
    END;                                                                10120000
                                                                        10130000
 /* 0295: PRODUCT DESCRIPTION NOT AVAILABLE IN ENGLISH */               10140000
    WHEN ('0295')                                                       10150000
    DO;                                                                 10160000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            10170000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        10180000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            10190000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   10200000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'ND';                            10210000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = LANGUAGE_LIST(J).LANG_ID;        10220000
    END;                                                                10230000
                                                                        10240000
 /* 0296: COUNTRY DATA FAILED VALIDATION */                             10250000
    WHEN ('0296')                                                       10260000
    DO;                                                                 10270000
      MODEL_UPD_DETAILS.NO_REJ_CTRY_SPEC_DATA_VIOL =                    10280000
                       MODEL_UPD_DETAILS.NO_REJ_CTRY_SPEC_DATA_VIOL + 1;10290000
                                                                        10300000
      PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                             10310000
      PARM_INT_AREA.MESSAGE_NUMBER  = A_MSG_NR;                         10320000
      PARM_INT_AREA.MSG_VAR_CODE_6  = 'EI';                             10330000
      PARM_INT_AREA.MSG_VAR_VALUE_6 = MODELENTITYID;                    10340000
      PARM_INT_AREA.MSG_VAR_CODE_7  = 'C5';                             10350000
      PARM_INT_AREA.MSG_VAR_VALUE_7 = COUNTRY_LIST(I).EACM_COUNTRY_FC;  10360000
      PARM_INT_AREA.MSG_VAR_CODE_8  = 'D1';                             10370000
      PARM_INT_AREA.MSG_VAR_VALUE_8 = COUNTRY_LIST.AVAILABILITY_DATE(I);10380000
      PARM_INT_AREA.MSG_VAR_CODE_9  = 'D2';                             10390000
      PARM_INT_AREA.MSG_VAR_VALUE_9 =                                   10400000
                                    COUNTRY_LIST.END_OF_SERVICE_DATE(I);10410000
    END;                                                                10420000
                                                                        10430000
 /* 0297: EMPTY COUNTRY MAPPING ARRAY */                                10440000
    WHEN ('0297')                                                       10450000
    DO;                                                                 10460000
      MODEL_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ = CNT_AVAIL_ELEMENT;  10470000
                                                                        10480000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            10490000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        10500000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            10510000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   10520000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            10530000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           10540000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            10550000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           10560000
    END;                                                                10570000
                                                                        10580000
 /* 0298: COUNTRY DATA REJECTED DUE TO T693 REGISTRATION FAILURE */     10590000
 /* WHEN ('0298') */                                   /* SOC RC01337 */10600000
 /* DO;                                                                 10610000
      PARM_INT_AREA.MESSAGE_NUMBER               = A_MSG_NR;            10620000
      PARM_INT_AREA.MSG_VAR_CODE_7               = 'EI';                10630000
      PARM_INT_AREA.MSG_VAR_VALUE_7              = MODELENTITYID;       10640000
      PARM_INT_AREA.MSG_VAR_CODE_8               = 'CT';                10650000
      PARM_INT_AREA.MSG_VAR_VALUE_8              = CNT_AVAIL_ELEMENT;   10660000
    END; */                                            /* EOC RC01337 */10670000
                                                                        10680000
 /* 0299: COUNTRY DATA SKIPPED AS IT IS NOT REQUESTED FOR PROCESSING */ 10690000
    WHEN ('0299')                                                       10700000
    DO;                                                                 10710000
      MODEL_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ =                     10720000
                        MODEL_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ + 1;10730000
                                                                        10740000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            10750000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        10760000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'EI';                            10770000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODELENTITYID;                   10780000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'C5';                            10790000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = COUNTRY_LIST(I).EACM_COUNTRY_FC; 10800000
                                                                        10810000
    END;                                                                10820000
                                                                        10830000
 /* 0300: ALL CTRY DATA SKIPPED AS NONE REQUESTED FOR PROCESSING */     10840000
    WHEN ('0300')                                                       10850000
    DO;                                                                 10860000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            10870000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        10880000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            10890000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   10900000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            10910000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           10920000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            10930000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           10940000
    END;                                                                10950000
                                                                        10960000
 /* 0306: MESSAGE HAS BEEN REJECTED */                                  10970000
    WHEN ('0306')                                                       10980000
    DO;                                                                 10990000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            11000000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        11010000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            11020000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   11030000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            11040000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           11050000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            11060000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           11070000
    END;                                                                11080000
                                             /*SOC RC01319-PCEDSP-0239*/11090000
 /* 0313: PRODUCT DESC REJECTED DUE TO T693 REGISTRATION FAILURE */     11100000
 /* WHEN ('0313') */                                   /* SOC RC01337 */11110000
 /* DO;                                                                 11120000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            11130000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        11140000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            11150000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   11160000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            11170000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           11180000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            11190000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           11200000
      PARM_INT_AREA.MSG_VAR_CODE_9   = 'ND';                            11210000
      PARM_INT_AREA.MSG_VAR_VALUE_9  = LANGUAGE_LIST(J).LANG_ID;        11220000
      PARM_INT_AREA.MSG_VAR_CODE_10  = 'PD';                            11230000
      PARM_INT_AREA.MSG_VAR_VALUE_10 = LANGUAGE_LIST(J).PROD_DESC;      11240000
    END; */                                  /*EOC RC01319-PCEDSP-0239*/11250000
                                                                        11260000
                                             /*SOC RC01319-PCEDSP-0237*/11270000
 /* 0315: LANG ELEMENT REJECTED DUE TO BLANK PRODUCT DESCRIPTION */     11280000
 /* WHEN ('0315')                                                       11290000
    DO;                                                                 11300000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            11310000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        11320000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            11330000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   11340000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            11350000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           11360000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            11370000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           11380000
      PARM_INT_AREA.MSG_VAR_CODE_10  = 'PD';                            11390000
      PARM_INT_AREA.MSG_VAR_VALUE_10 = LANGUAGE_LIST(J).PROD_DESC;      11400000
    END;   */                                /*EOC RC01319-PCEDSP-0237*/11410000
                                                       /* EOC RC01337 */11420000
                                                       /* SOC RB01342 */11430000
  /* 0326: NO CHILD SEO UPDATE FOUND FOR THE MODEL UPDATE */            11440000
    WHEN ('0326')                                                       11450000
    DO;                                                                 11460000
      PARM_INT_AREA.MESSAGE_TYPE     = 'BU';                            11470099
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        11480000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            11490000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = MODELENTITYID;                   11500000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            11510000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = MODEL_UP.PRODUCT_TYPE;           11520000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            11530000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = MODEL_UP.MODEL_NUMBER;           11540000
    END;                                                                11550000
                                                       /* EOC RB01342 */11560000
    OTHERWISE;                                                          11570000
 END;                                                                   11580000
 CALL RCB0M1M(PTR_INT_AREA);                                            11590000
 END RCBXC2M_MSG;                                                       11600000
1/********************************************************************/ 11610000
 /*                                                                  */ 11620000
 /* MODULE NAME      : RCBXC2M_SELECT_T693                           */ 11630000
 /*                                                                  */ 11640000
 /* DESCRIPTION      : CHECK FOR TYPE, MODEL IN RCBT0693 TABLE       */ 11650000
 /********************************************************************/ 11660000
  RCBXC2M_SELECT_T693: PROC;                                            11670000
                                                                        11680000
  DCL WRK_MACHTYPE CHAR(04);                                            11690000
  DCL WRK_MODEL CHAR(03);                                               11700000
  WRK_MACHTYPE = MODEL_UP.PRODUCT_TYPE;                                 11710000
  WRK_MODEL = MODEL_UP.MODEL_NUMBER;                                    11720000
                                                                        11731099
  EXEC SQL                                                              11740000
  SELECT PRODUCT_TYPE,MODEL_NUMBER                                      11750000
  INTO :TB_RCBV693.PRODUCT_TYPE , :TB_RCBV693.MODEL_NUMBER              11760000
  FROM RCBV0693_TYPE_MOD_WW_LVL                                         11770000
  WHERE PRODUCT_TYPE = :WRK_MACHTYPE  AND                               11780000
        MODEL_NUMBER = :WRK_MODEL ;                                     11790000
                                                                        11800000
  SELECT(SQLCA.SQLCODE);                                                11810000
   WHEN(0)                                                              11820000
        T693_UPDATE_FLAG = TRUE;                                        11830000
   WHEN(100)                                                            11840000
        T693_INSERT_FLAG = TRUE;                                        11850000
   OTHERWISE                                                            11860000
   DO;                                                                  11870000
                                                      /* SOC RC01324 */ 11880000
   /*   ERROR_CODE_DET.PTR_ERROR = ADDR(PARM_RET_AREA_BB.RETURN_SQL);*/ 11890000
        ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                         11900000
                                                      /* EOC RC01324 */ 11910000
        ERROR_CODE_DET.ERR_TYPE  ='DB2';                                11920000
        ERROR_CODE_DET.CALL_ID   ='#004';                               11930000
        SIGNAL ERROR;                                                   11940000
   END;                                                                 11950000
  END;                                                                  11960000
                                                                        11970000
  END RCBXC2M_SELECT_T693;                                              11980000
1/********************************************************************/ 11990000
 /*                                                                  */ 12000000
 /* MODULE NAME      : RCBXC2M_SELECT_T696                           */ 12010000
 /*                                                                  */ 12020000
 /* DESCRIPTION      : CHECK FOR TYPE, MODEL IN RCBT0696 TABLE       */ 12030000
 /********************************************************************/ 12040000
  RCBXC2M_SELECT_T696: PROC;                                            12050000
                                                                        12060000
  DCL WRK_MACHTYPE CHAR(04);                                            12070000
  DCL WRK_MODEL CHAR(03);                                               12080000
  WRK_MACHTYPE = MODEL_UP.PRODUCT_TYPE;                                 12090000
  WRK_MODEL    = MODEL_UP.MODEL_NUMBER;                                 12100000
                                                                        12110000
                                                                        12113099
  EXEC SQL                                                              12120000
  SELECT * INTO :TB_RCBV696                                             12130000
  FROM RCBV0696_TYPE_MOD_DESC                                           12140000
  WHERE PRODUCT_TYPE = :WRK_MACHTYPE  AND                               12150000
        MODEL_NUMBER = :WRK_MODEL;                                      12160000
                                                                        12170000
  SELECT(SQLCA.SQLCODE);                                                12180000
    WHEN(0)                                                             12190000
         T696_UPDATE_FLAG = TRUE;                                       12200000
    WHEN(100)                                                           12210000
         T696_INSERT_FLAG = TRUE;                                       12220000
    OTHERWISE                                                           12230000
    DO;                                                                 12240000
                                                      /* SOC RC01324 */ 12250000
   /*   ERROR_CODE_DET.PTR_ERROR = ADDR(PARM_RET_AREA_BB.RETURN_SQL);*/ 12260000
        ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                         12270000
                                                      /* EOC RC01324 */ 12280000
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               12290000
         ERROR_CODE_DET.CALL_ID   ='#005';                              12300000
         SIGNAL ERROR;                                                  12310000
    END;                                                                12320000
  END;                                                                  12330000
                                                                        12340000
  END RCBXC2M_SELECT_T696;                                              12350000
                                                 /* SOC CEDS00000679 */ 12360000
 /********************************************************************/ 12370000
 /*                                                                  */ 12380000
 /* MODULE NAME      : RCBXC2M_TRANSLATE                             */ 12390000
 /*                                                                  */ 12400000
 /* DESCRIPTION      : HANDLING OF '@' PADDINGS WHILE INSERTING      */ 12410000
 /*                    UNICODE DATA INTO TABLES                      */ 12420000
 /********************************************************************/ 12430000
                                                  /* SOC CEDS00000692 */12431099
  /*RCBXC2M_TSN: PROC (MODELVAR,LENGTHA) RETURNS (CHAR(30) VARYING);  */12432099
  RCBXC2M_TSN: PROC (MODELVAR,LENGTHA) RETURNS (CHAR(120) VARYING);     12440088
                                                  /* SOC CEDS00000692 */12441099
                                                                        12450000
     DCL INDEX2 FIXED BIN(31);                                          12460000
     DCL INDEX3 FIXED BIN(31);                                          12470000
     DCL LENGTHA FIXED BIN(31);                                         12480000
                                                  /* SOC CEDS00000692 */12481099
     /*DCL MODELVAR CHAR(30) VARYING;                                 */12482099
     /*DCL MODELVAR1 CHAR(30) VARYING;                                */12483099
     DCL MODELVAR  CHAR(120) VARYING;                                   12490093
     DCL MODELVAR1 CHAR(120) VARYING;                                   12500088
                                                  /* EOC CEDS00000692 */12501099
     DCL TRANSLATE BUILTIN;                                             12510000
                                                                        12520000
     MODELVAR1  = ' ';                                                  12530000
     MODELVAR = SUBSTR(MODELVAR,1,LENGTHA);                             12540000
     INDEX2 = 0;                                                        12550000
     INDEX3 = 0;                                                        12560000
     INDEX2 = INDEX(MODELVAR,' ');                                      12570000
                                                 /* SOC CEDS00000692 */ 12571099
     /*DO UNTIL (INDEX3 <= LENGTHA & INDEX2 ¬= 0)                    */ 12580099
     DO UNTIL (INDEX3 <= LENGTHA & INDEX2 ¬= 0);                        12590099
                                                 /* EOC CEDS00000692 */ 12591099
       INDEX3 = INDEX(MODELVAR,' ',INDEX2);                             12600000
       MODELVAR1 = TRANSLATE(MODELVAR,'20'X,' ');                       12610000
       INDEX3 = INDEX3 + 1;                                             12620000
       INDEX2 = INDEX2 + 1;                                             12630000
     END;                                                               12640000
    RETURN(MODELVAR1);                                                  12650000
                                                                        12660000
  END RCBXC2M_TSN;                                                      12670000
                                                 /* EOC CEDS00000679 */ 12680000
1/********************************************************************/ 12690000
 /*                                                                  */ 12700000
 /* MODULE NAME      : RCBXC2M_INIT_PROGRAM                          */ 12710000
 /*                                                                  */ 12720000
 /* DESCRIPTION      : PROGRAM INITIALISATIONS                       */ 12730000
 /********************************************************************/ 12740000
 RCBXC2M_INIT_PROGRAM: PROC;                                            12750000
                                              /* INITIALISE POINTERS */ 12760000
 PARSER_RETURN_AREA = '';                                               12770000
 PARM_RET_AREA_BB   = '';                                               12780000
 PTR_RET_AREA_BB    = ADDR(PARM_RET_AREA_BB);                           12790000
                                                                        12800000
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      12810000
                                                       /* SOC RC01324 */12820000
 /*                                                                     12830000
 PARM_INT_AREA.ID_MOD_PATH(1) = 'MODEL'; */                             12840000
 PARM_INT_AREA.ID_MOD_PATH(1) = 'RCBXC2M';                              12850000
                                                       /* EOC RC01324 */12860000
                                                                        12870000
 PARM_INT_AREA.MSG_REQUEST = 'P';                                       12880000
 CALL RCB0T1M(PTR_INT_AREA);                                            12890000
                                                                        12900000
 END RCBXC2M_INIT_PROGRAM;                                              12910000
                                                                        12920099
 END RCBXC2M;                                 /* END OF MAIN PROGRAM */ 13480000
 /********************************************************************/ 13490000
 /*  USED TEMPORARY FIELDS DECLARATION                               */ 13500000
 /********************************************************************/ 13510000
  DCL CHARS CHAR(32000) BASED;                                          13520000
  DCL ST_OF_ELEMENT CHAR(20) VAR;                                       13560000
  DCL ED_OF_ELEMENT CHAR(20) VAR;                                       13570000
  DCL I FIXED BIN(31) INIT(0);          /* AVAILABILITY_LIST COUNT  */  13580000
  DCL J FIXED BIN(31) INIT(0);          /* LANGUAGE_LIST COUNT      */  13590000
  DCL T FIXED BIN(31) INIT(0);          /* INT_CRTY ARRAY COUNT     */  13600000
  DCL K FIXED BIN(31) INIT(0);                                          13610000
  DCL L FIXED BIN(31) INIT(0);                                          13620000
  DCL M FIXED BIN(31) INIT(0);                        /* SOC S1304835 */13621099
  DCL N FIXED BIN(31) INIT(0);                        /* EOC S1304835 */13622099
  DCL MODELENTITYID CHAR(8);                                            13630000
  DCL DTSOFMSG      CHAR(10);                                           13640000
                                                  /* SOC CEDS00000679 */13650000
  DCL MODELENTITYID1 CHAR(8);                                           13660000
  DCL MODELDTSOFMSG  CHAR(10);                                          13670000
  DCL ELE_CONVERT    FIXED BIN(31) INIT(0);                             13680000
  DCL TEMP_LENGTH    FIXED BIN(31) INIT(0);                             13690000
                                                  /* EOC CEDS00000679 */13700000
  DCL 1 MODEL_UP,                                                       13710000
        3  PRODUCT_TYPE        CHAR(4),                                 13720000
        3  MODEL_NUMBER        CHAR(3),                                 13730000
        3  PROD_REVENUE_DIV    CHAR(2),                                 13740000
        3  MACHINE_CATEGORY    CHAR(1),                                 13750000
                                                   /* SOC CEDS0000692 */13751012
      /*3  VENDOR_NAME         CHAR(30) INIT('IBM'),*/                  13760012
        3  VENDOR_NAME         CHAR(120) VARYING INIT('IBM'),           13761086
                                                   /* EOC CEDS0000692 */13762012
        3  CE_PRODUCT_KEY      CHAR(1),                                 13770000
        3  PROD_SUP_COD        CHAR(3),                                 13780000
        3  RETAIN_FLAG         CHAR(1),                                 13790000
        3  INSTALL             CHAR(3),                                 13800000
        3  LAST_CHANGE_DATE    CHAR(10),                                13810000
        3  AVAILABILITY_DATE   CHAR(10) INIT(''),                       13820000
     /* 3  END_OF_SERVICE_DATE CHAR(10) INIT('');    *//* SOC RB01342 */13830099
        3  END_OF_SERVICE_DATE CHAR(10) INIT(''),                       13831099
        3  PARENT_PRODTYPE     CHAR(04),                                13832098
        3  PARENT_MODEL        CHAR(03);               /* EOC RB01342 */13833099
  DCL 1 MODEL_UP1 LIKE MODEL_UP;                     /* CEDS00000679 */ 13840099
  DCL SKIP_CTRY_ARRAY(*) CTL CHAR(4);                                   13850000
  DCL 1 COUNTRY_LIST(*) CTL,                                            13860000
        3 PRODUCT_TYPE         CHAR(4),                                 13870000
        3 MODEL_NUMBER         CHAR(3),                                 13880000
        3 EACM_COUNTRY_FC      CHAR(4),                                 13890000
        3 AVAILABILITY_DATE    CHAR(10),                                13900000
        3 END_OF_SERVICE_DATE  CHAR(10),                                13910000
        3 LAST_CHANGE_DATE     CHAR(10);                                13920000
  DCL 1 COUNTRY_LIST1(*) CTL LIKE COUNTRY_LIST;     /* CEDS00000679 */  13930000
  DCL 1 LANGUAGE_LIST(*) CTL,                                           13940000
        3 PRODUCT_TYPE         CHAR(4),                                 13950000
        3 MODEL_NUMBER         CHAR(3),                                 13960000
        3 LANG_ID              CHAR(2),                                 13970000
                                                /* SOC CEDS00000692 */  13971093
     /* 3 PROD_DESC            CHAR(30), */     /* SOC CEDS00000679 */  13972093
     /* 3 PROD_DESC            CHAR(120),     *//* EOC CEDS00000679 */  13980093
        3 PROD_DESC            CHAR(120) VARYING,                       13990098
                                                /* EOC CEDS00000692 */  13990193
        3 LAST_CHANGE_DATE     CHAR(10);                                14000000
  DCL 1 LANG_LIST(*) CTL LIKE LANGUAGE_LIST;        /* CEDS00000679 */  14010000
                                                                        14020000
  /*DCL MODEL_TEMP        CHAR(78);              *//* CEDS000000692  */ 14030099
  DCL COUNTRY_LIST_TEMP CHAR(41);                                       14050000
                                               /* SOC CEDS000000692 */  14051099
  /*DCL LANG_LIST_TEMP    CHAR(49);                                 */  14060099
  /*DCL MODEL_TEMP1       CHAR(78);             *//* SOC CEDS00000679 */14070099
                                               /* EOC CEDS000000692 */  14080099
  DCL COUNTRY_LIST_TEMP1 CHAR(41);                                      14090000
                                               /* SOC CEDS000000692 */  14091099
  /*DCL LANG_LIST_TEMP1   CHAR(49);           *//* EOC CEDS00000679 */  14100099
                                               /* EOC CEDS000000692 */  14101099
  DCL RCB693S_PTR       PTR;                                            14110000
  DCL RCB694S_PTR       PTR;                                            14120000
  DCL RCB696S_PTR       PTR;                                            14130000
  DCL RCB693S_PTR1      PTR;                   /* SOC CEDS00000679 */   14140000
  DCL RCB694S_PTR1      PTR;                                            14150000
  DCL RCB696S_PTR1      PTR;                                            14160000
  DCL PTR_MODEL_ESDA    PTR;                                            14170000
  DCL PTR_MODEL_ESDB    PTR;                   /* EOC CEDS00000679 */   14180000
  DCL PTR_RET_AREA_BB   PTR;                                            14190000
                                                    /* SOC RB01342 */   14200000
  DCL 1 RCB693S BASED(RCB693S_PTR),                                     14210000
       %INCLUDE RCB693S;;                                               14220000
                                                                        14230000
  DCL 1 RCB694S BASED(RCB694S_PTR),                                     14231000
       %INCLUDE RCB694S;;                                               14232000
                                                                        14233000
  DCL 1 RCB693S1 BASED(RCB693S_PTR1),                                   14240000
       %INCLUDE RCB693S;;                                               14250000
                                                                        14260000
  DCL 1 RCB694S1 BASED(RCB694S_PTR1),                                   14270000
       %INCLUDE RCB694S;;                                               14280000
                                                                        14290000
  DCL T693_MACHINE_CATEGORY        CHAR(1);                             14300000
    EXEC SQL DECLARE :T693_MACHINE_CATEGORY VARIABLE CCSID 1208;        14310000
  DCL   T693_CE_PRODUCT_KEY        CHAR(1);                             14320000
    EXEC SQL DECLARE :T693_CE_PRODUCT_KEY VARIABLE CCSID 1208;          14330000
  DCL   T693_PROD_SUP_COD          CHAR(3);                             14340000
    EXEC SQL DECLARE :T693_PROD_SUP_COD VARIABLE CCSID 1208;            14350000
  DCL   T693_RETAIN_FLAG           CHAR(1);                             14360000
    EXEC SQL DECLARE :T693_RETAIN_FLAG VARIABLE CCSID 1208;             14370000
  DCL   T693_INSTALL               CHAR(3);                             14380000
    EXEC SQL DECLARE :T693_INSTALL VARIABLE CCSID 1208;                 14390000
  DCL T694_END_OF_SERVICE_DATE     CHAR(10);                            14400000
    EXEC SQL DECLARE :T694_END_OF_SERVICE_DATE VARIABLE CCSID 1208;     14410000
                                                    /* EOC RB01342 */   14420000
  DCL 1 PARM_RET_AREA_BB,                                               14430000
        %INCLUDE (RCBZ02S);;                                            14440000
  DCL ALPHANUM      CHAR(36)                                            14450000
      INIT('ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789');/* ALPHANUM VALUES */14460000
  DCL ALPHABET      CHAR(26)                                            14470000
      INIT('ABCDEFGHIJKLMNOPQRSTUVWXYZ');         /*ALPHABETIC VALUES */14480000
  /********************************************************************/14491000
  /*  BIT SWITCHES                                                    */14500000
  /********************************************************************/14510000
  DCL MODEL_UPDATE_FLAG            BIT(1) INIT('0'B);                   14521099
  DCL MODEL_UPDATE_MMLIST          BIT(1) INIT('0'B); /* CEDS00000692 */14522099
  DCL REPLMODELLIST_FLAG           BIT(1) INIT('0'B); /* CEDS00000617 */14530000
  DCL LANG_LIST_FLAG               BIT(1) INIT('0'B);                   14540000
  DCL LANG_ELEM_FLAG               BIT(1) INIT('0'B);                   14550000
  DCL AVAILABILITY_LIST_FLAG       BIT(1) INIT('0'B);                   14560000
  DCL AVAILABILITY_ELEMENT_FLAG    BIT(1) INIT('0'B);                   14570000
  DCL MACH_TYPE_FLAG               BIT(1) INIT('0'B);/* SOC S1304835 */ 14571099
  DCL MODEL_TYPE_FLAG              BIT(1) INIT('0'B);                   14572099
  DCL MODEL_ENTITYID_FLAG          BIT(1) INIT('0'B);                   14573099
  DCL DTSOF_MSG_FLAG               BIT(1) INIT('0'B);                   14574099
  DCL DIVISION_FLAG                BIT(1) INIT('0'B);                   14575099
  DCL MACHRATE_CATG_FLAG           BIT(1) INIT('0'B);                   14576099
  DCL CECSPROD_KEY_FLAG            BIT(1) INIT('0'B);                   14577099
  DCL PROD_SUPRTCD_FLAG            BIT(1) INIT('0'B);                   14578099
  DCL RETAN_INDC_FLAG              BIT(1) INIT('0'B);                   14579099
  DCL INSTALL_FLAG                 BIT(1) INIT('0'B);                   14579199
  DCL NLSID_FLAG                   BIT(1) INIT('0'B);                   14579299
  DCL MKTG_NAME_FLAG               BIT(1) INIT('0'B);                   14579399
  DCL COUNTRY_FC_FLAG              BIT(1) INIT('0'B);                   14579499
  DCL PLANNED_AVAILABILITY_FLAG    BIT(1) INIT('0'B);                   14579599
  DCL ENDOFSERVICE_DATE_FLAG       BIT(1) INIT('0'B);                   14579699
  DCL GEO_STD_MAINTFLAG            BIT(1) INIT('0'B);/* EOC S1304835 */ 14579799
  DCL T693_INSERT_FLAG             BIT(1) INIT('0'B);                   14580000
  DCL T693_UPDATE_FLAG             BIT(1) INIT('0'B);                   14590000
  DCL T696_INSERT_FLAG             BIT(1) INIT('0'B);                   14600000
  DCL T696_UPDATE_FLAG             BIT(1) INIT('0'B);                   14610000
  DCL WW_ELEMENT_FLAG              BIT(1) INIT('0'B);                   14620000
  DCL LANG_ELEMENT_FLAG            BIT(1) INIT('0'B);                   14630000
  DCL CTRY_ELEMENT_FLAG            BIT(1) INIT('0'B);                   14640000
 /* DCL CTRY_DATA_FLAG               BIT(1) INIT('0'B); *//* RB01342 */ 14650000
  DCL VALID_FLAG                   BIT(1) INIT('0'B);                   14660000
  DCL SEO_FLAG_T693                BIT(1) INIT('0'B);     /* RB01342 */ 14670000
  DCL VALID_CTRY                   BIT(1) INIT('0'B);                   14680000
  DCL CHECK_INS_T693               BIT(1) INIT('0'B);     /* RC01337 */ 14690000
  DCL CNT_AVAIL_ELEMENT1           FIXED  BIN(31);                      14700000
  DCL CNT_LANG_ELEMENT1            FIXED  BIN(31);                      14710000
  DCL 1 SWITCHES,                                                       14720000
      3 TRUE                       BIT(1) INIT ('1'B),                  14730000
      3 FALSE                      BIT(1) INIT ('0'B);                  14740000
1/********************************************************************/ 14750000
 /* EXTERNAL ENTRIES DECLARATION                                     */ 14760000
 /********************************************************************/ 14770000
 DCL RCB0T1M   ENTRY EXTERNAL;         /* RETRIEVE SYSTEM DATE       */ 14780000
 DCL RCB0M1M   ENTRY EXTERNAL;         /* COMMON MESSAGE ROUTINE     */ 14790000
 DCL RCB004M   ENTRY EXTERNAL;         /* DATE VALIDATION ROUTINE    */ 14800000
 DCL RCBF89M   ENTRY EXTERNAL;         /* T693 INSERT/UPDATE         */ 14810000
 DCL RCBF90M   ENTRY EXTERNAL;         /* T694 INSERT/UPDATE         */ 14820000
 DCL RCBF92M   ENTRY EXTERNAL;         /* T696 INSERT/UPDATE         */ 14830000
1/********************************************************************/ 14840000
 /* MODULE NAME      : START_OF_DOCUMENT                             */ 14850000
 /*                                                                  */ 14860000
 /********************************************************************/ 14870000
  START_OF_DOCUMENT:                                                    14880000
    PROC( USERTOKEN )                                                   14890000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14900000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14910000
                                          /* ALLOCATE DYNAMIC ARRAYS */ 14920000
    ALLOCATE LANGUAGE_LIST(CNT_LANG_ELEMENT1);                          14930000
    ALLOCATE COUNTRY_LIST(CNT_AVAIL_ELEMENT1);                          14940000
    ALLOCATE SKIP_CTRY_ARRAY(CNT_AVAIL_ELEMENT1);                       14950000
    ALLOCATE LANG_LIST(CNT_LANG_ELEMENT1);       /* SOC CEDS00000679 */ 14960000
    ALLOCATE COUNTRY_LIST1(CNT_AVAIL_ELEMENT1);  /* EOC CEDS00000679 */ 14970000
                                                                        14980000
    MODEL_UP      = '';                                                 14990000
                                                 /* SOC CEDS00000692 */ 14991099
    /*MODEL_UP1     = '';                           *//* CEDS00000679 */15000099
    MODEL_UP1     = (175)'20'X;                                         15001099
                                                 /* EOC CEDS00000692 */ 15002099
                                                       /* SOC RC01324 */15010000
 /* LANGUAGE_LIST = '';                                                 15020000
    COUNTRY_LIST  = ''; */                                              15030000
    LANGUAGE_LIST(*) = '';                                              15040000
    COUNTRY_LIST(*)  = '';                                              15050000
    LANG_LIST(*) = '';                            /* SOC CEDS00000679 */15060000
    COUNTRY_LIST1(*)  = '';                       /* EOC CEDS00000679 */15070000
                                                       /* EOC RC01324 */15080000
 /* MODEL_UPD_DETAILS = '';   */             /* S1304835 *//* RC01319 */15090099
                                                                        15100000
     I  = 0;                                                            15110000
     J  = 0;                                                            15120000
     T  = 0;                                                            15130000
     K  = 0;                                                            15140000
     L  = 0;                                                            15150000
     M  = 0;                                          /* SOC S1304835 */15151099
     N  = 0;                                          /* EOC S1304835 */15151199
                                                                        15160000
    DCL USERTOKEN      POINTER;                                         15170000
    DCL XMLTOKEN       POINTER;                                         15180000
    DCL TOKENLENGTH    FIXED BIN(31);                                   15190000
                                                                        15200000
    RETURN(0);                                                          15210000
  END;                                                                  15220000
                                                                        15230000
1/********************************************************************/ 15240000
 /* MODULE NAME      : VERSION_INFORMATION                           */ 15250000
 /*                                                                  */ 15260000
 /********************************************************************/ 15270000
  VERSION_INFORMATION:                                                  15280000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            15290000
    RETURNS( BYVALUE FIXED BIN(31) )                                    15300000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                15310000
                                                                        15320000
    DCL USERTOKEN      POINTER;                                         15330000
    DCL XMLTOKEN       POINTER;                                         15340000
    DCL TOKENLENGTH    FIXED BIN(31);                                   15350000
                                                                        15360000
    RETURN(0);                                                          15370000
  END;                                                                  15380000
                                                                        15390000
1/********************************************************************/ 15400000
 /* MODULE NAME      : ENCODING_DECLARATION                          */ 15410000
 /*                                                                  */ 15420000
 /********************************************************************/ 15430000
  ENCODING_DECLARATION:                                                 15440000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            15450000
    RETURNS( BYVALUE FIXED BIN(31) )                                    15460000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                15470000
                                                                        15480000
    DCL USERTOKEN      POINTER;                                         15490000
    DCL XMLTOKEN       POINTER;                                         15500000
    DCL TOKENLENGTH    FIXED BIN(31);                                   15510000
    RETURN(0);                                                          15520000
  END;                                                                  15530000
                                                                        15540000
1/********************************************************************/ 15550000
 /* MODULE NAME      : STANDALONE_DECLARATION                        */ 15560000
 /*                                                                  */ 15570000
 /********************************************************************/ 15580000
  STANDALONE_DECLARATION:                                               15590000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            15600000
    RETURNS( BYVALUE FIXED BIN(31))                                     15610000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                15620000
                                                                        15630000
    DCL USERTOKEN      POINTER;                                         15640000
    DCL XMLTOKEN       POINTER;                                         15650000
    DCL TOKENLENGTH    FIXED BIN(31);                                   15660000
                                                                        15670000
    RETURN(0);                                                          15680000
  END;                                                                  15690000
                                                                        15700000
1/********************************************************************/ 15710000
 /* MODULE NAME      : DOCUMENT_TYPE_DECLARATION                     */ 15720000
 /*                                                                  */ 15730000
 /********************************************************************/ 15740000
  DOCUMENT_TYPE_DECLARATION:                                            15750000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            15760000
    RETURNS( BYVALUE FIXED BIN(31) )                                    15770000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                15780000
                                                                        15790000
    DCL USERTOKEN      POINTER;                                         15800000
    DCL XMLTOKEN       POINTER;                                         15810000
    DCL TOKENLENGTH    FIXED BIN(31);                                   15820000
                                                                        15830000
    RETURN(0);                                                          15840000
  END;                                                                  15850000
                                                                        15860000
1/********************************************************************/ 15870000
 /* MODULE NAME      : NAMESPACE_DECLARE                             */ 15880000
 /*                                                                  */ 15890000
 /********************************************************************/ 15900000
  NAMESPACE_DECLARE:                                                    15910000
    PROC( USERTOKEN, NSPREFIX, NSPREFIXLENGTH,                          15920000
                     NSURI, NSURILENGTH )                               15930000
    RETURNS( BYVALUE FIXED BIN(31) )                                    15940000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                15950000
                                                                        15960000
    DCL USERTOKEN      POINTER;                                         15970000
    DCL NSPREFIX       POINTER;                                         15980000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   15990000
    DCL NSURI          POINTER;                                         16000000
    DCL NSURILENGTH    FIXED BIN(31);                                   16010000
                                                                        16020000
    RETURN(0);                                                          16030000
  END;                                                                  16040000
                                                                        16050000
1/********************************************************************/ 16060000
 /* MODULE NAME      : END_OF_DOCUMENT                               */ 16070000
 /*                                                                  */ 16080000
 /********************************************************************/ 16090000
  END_OF_DOCUMENT:                                                      16100000
    PROC( USERTOKEN )                                                   16110000
    RETURNS( BYVALUE FIXED BIN(31) )                                    16120000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                16130000
                                                                        16140000
    DCL USERTOKEN      POINTER;                                         16150000
                                                                        16160000
    RETURN(0);                                                          16170000
  END;                                                                  16180000
                                                                        16190000
1/********************************************************************/ 16200000
 /* MODULE NAME      : START_OF_ELEMENT                              */ 16210000
 /*                                                                  */ 16220000
 /********************************************************************/ 16230000
  START_OF_ELEMENT:                                                     16240000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             16250000
          NSPREFIX, NSPREFIXLENGTH,                                     16260000
          NSURI, NSURILENGTH )                                          16270000
    RETURNS( BYVALUE FIXED BIN(31) )                                    16280000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                16290000
                                                                        16300000
    DCL USERTOKEN      POINTER;                                         16310000
    DCL XMLTOKEN       POINTER;                                         16320000
    DCL TOKENLENGTH    FIXED BIN(31);                                   16330000
    DCL NSPREFIX       POINTER;                                         16340000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   16350000
    DCL NSURI          POINTER;                                         16360000
    DCL NSURILENGTH    FIXED BIN(31);                                   16370000
                                                /* SOC CEDS00000679 */  16380000
    DCL ST_ELEMENT_PTR               POINTER;                           16390000
    DCL TEMP_ST_ELEMENT              CHAR(50) VARYING;                  16400000
    DCL ST_ELEMENT_PTR_1             POINTER;                           16410000
    DCL TEMP_ST_ELEMENT_1            CHAR(50) VARYING;                  16420000
                                                /* EOC CEDS00000679 */  16430000
                                                                        16440000
                                                /* SOC CEDS00000679 */  16450000
  /*ST_OF_ELEMENT = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );*/           16460000
    TEMP_ST_ELEMENT            = '';                                    16470000
    TEMP_ST_ELEMENT_1          = '';                                    16480000
    /***************** CONVERTING TO EBCDIC ********************/       16490000
                                                                        16500000
    TEMP_ST_ELEMENT_1          = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );16510000
    ST_ELEMENT_PTR_1           = ADDR(TEMP_ST_ELEMENT_1);               16520000
    ST_ELEMENT_PTR             = ADDR(TEMP_ST_ELEMENT);                 16530000
    TEMP_LENGTH                = TOKENLENGTH + 2;                       16540000
                                                                        16550000
    ELE_CONVERT   = MEMCONVERT (ST_ELEMENT_PTR,TEMP_LENGTH,500,         16560000
                               ST_ELEMENT_PTR_1,TEMP_LENGTH,1208);      16570000
    ST_OF_ELEMENT = SUBSTR(TEMP_ST_ELEMENT,1,TOKENLENGTH);              16580000
                                                /* EOC CEDS00000679 */  16590000
                                                                        16590199
    IF ST_OF_ELEMENT='MMLIST' THEN                /* SOC CEDS00000692 */16591099
    MODEL_UPDATE_MMLIST = TRUE;                                         16592099
                                                  /* EOC CEDS00000692 */16593099
    IF ST_OF_ELEMENT='MODEL_UPDATE' THEN                                16600000
    MODEL_UPDATE_FLAG = TRUE;                                           16610000
                                                  /* SOC CEDS00000617 */16620000
    IF ST_OF_ELEMENT='REPLMODELLIST' THEN                               16630000
    REPLMODELLIST_FLAG = TRUE;                                          16640000
                                                  /* EOC CEDS00000617 */16650000
    IF ST_OF_ELEMENT='LANGUAGELIST' THEN                                16660000
    LANG_LIST_FLAG = TRUE;                                              16670000
                                                                        16680000
    IF ST_OF_ELEMENT='LANGUAGEELEMENT' THEN                             16690099
    DO;                                                                 16700000
      J = J + 1;                                                        16710000
      LANG_ELEM_FLAG = TRUE;                                            16720000
    END;                                                                16730000
                                                                        16740000
    IF ST_OF_ELEMENT='AVAILABILITYLIST' THEN                            16750000
    AVAILABILITY_LIST_FLAG = TRUE;                                      16760000
                                                                        16770000
    IF ST_OF_ELEMENT='AVAILABILITYELEMENT' THEN                         16780099
    DO;                                                                 16790099
      I = I + 1;                                                        16800099
      AVAILABILITY_ELEMENT_FLAG = TRUE;                                 16810099
    END;                                                                16821099
                                                      /* SOC S1304835 */16830099
    IF ST_OF_ELEMENT='MACHTYPE' THEN                                    16831099
    MACH_TYPE_FLAG = TRUE;                                              16832099
                                                                        16832199
    IF ST_OF_ELEMENT='MODEL' THEN                                       16832299
    MODEL_TYPE_FLAG = TRUE;                                             16832399
                                                                        16833099
    IF ST_OF_ELEMENT='MODELENTITYID' THEN                               16834099
    MODEL_ENTITYID_FLAG = TRUE;                                         16835099
                                                                        16836099
    IF ST_OF_ELEMENT='DTSOFMSG' THEN                                    16837099
    DTSOF_MSG_FLAG = TRUE;                                              16838099
                                                                        16839099
    IF ST_OF_ELEMENT='DIVISION' THEN                                    16839199
    DIVISION_FLAG = TRUE;                                               16839299
                                                                        16839399
    IF ST_OF_ELEMENT='MACHRATECATG' THEN                                16839499
    MACHRATE_CATG_FLAG = TRUE;                                          16839599
                                                                        16839699
    IF ST_OF_ELEMENT='CECSPRODKEY' THEN                                 16839799
    CECSPROD_KEY_FLAG = TRUE;                                           16839899
                                                                        16839999
    IF ST_OF_ELEMENT='PRODSUPRTCD' THEN                                 16840099
    PROD_SUPRTCD_FLAG = TRUE;                                           16840199
                                                                        16840299
    IF ST_OF_ELEMENT='RETANINDC' THEN                                   16840399
    RETAN_INDC_FLAG = TRUE;                                             16840499
                                                                        16840599
    IF ST_OF_ELEMENT='INSTALL' THEN                                     16840699
    INSTALL_FLAG = TRUE;                                                16840799
                                                                        16840899
    IF ST_OF_ELEMENT='NLSID' THEN                                       16840999
    NLSID_FLAG = TRUE;                                                  16841099
                                                                        16841199
    IF ST_OF_ELEMENT='MKTGNAME' THEN                                    16841299
    MKTG_NAME_FLAG = TRUE;                                              16841399
                                                                        16841499
    IF ST_OF_ELEMENT='COUNTRY_FC' THEN                                  16841599
    COUNTRY_FC_FLAG = TRUE;                                             16841699
                                                                        16841799
    IF ST_OF_ELEMENT='PLANNEDAVAILABILITY' THEN                         16841899
    PLANNED_AVAILABILITY_FLAG = TRUE;                                   16841999
                                                                        16842099
    IF ST_OF_ELEMENT='ENDOFSERVICEDATE' THEN                            16842199
    ENDOFSERVICE_DATE_FLAG = TRUE;                                      16842299
                                                                        16842399
    IF ST_OF_ELEMENT='GEOMODLIST' | ST_OF_ELEMENT='STDMAINTLIST' THEN   16842499
    GEO_STD_MAINTFLAG  = TRUE;                        /* EOC S1304835 */16842599
                                                                        16842699
    RETURN(0);                                                          16843099
  END;                                                                  16850000
                                                                        16860000
1/********************************************************************/ 16870000
 /* MODULE NAME      : ATTRIBUTE_NAME                                */ 16880000
 /*                                                                  */ 16890000
 /********************************************************************/ 16900000
  ATTRIBUTE_NAME:                                                       16910000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             16920000
          NSPREFIX, NSPREFIXLENGTH,                                     16930000
          NSURI, NSURILENGTH )                                          16940000
    RETURNS( BYVALUE FIXED BIN(31) )                                    16950000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                16960000
                                                                        16970000
    DCL USERTOKEN      POINTER;                                         16980000
    DCL XMLTOKEN       POINTER;                                         16990000
    DCL TOKENLENGTH    FIXED BIN(31);                                   17000000
    DCL NSPREFIX       POINTER;                                         17010000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   17020000
    DCL NSURI          POINTER;                                         17030000
    DCL NSURILENGTH    FIXED BIN(31);                                   17040000
                                                                        17050000
    RETURN(0);                                                          17060000
  END;                                                                  17070000
                                                                        17080000
1/********************************************************************/ 17090000
 /* MODULE NAME      : END_OF_ELEMENT                                */ 17100000
 /*                                                                  */ 17110000
 /********************************************************************/ 17120000
  END_OF_ELEMENT:                                                       17130000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             17140000
          NSPREFIX, NSPREFIXLENGTH,                                     17150000
          NSURI, NSURILENGTH )                                          17160000
    RETURNS( BYVALUE FIXED BIN(31) )                                    17170000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                17180000
                                                                        17190000
    DCL USERTOKEN      POINTER;                                         17200000
    DCL XMLTOKEN       POINTER;                                         17210000
    DCL TOKENLENGTH    FIXED BIN(31);                                   17220000
    DCL NSPREFIX       POINTER;                                         17230000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   17240000
    DCL NSURI          POINTER;                                         17250000
    DCL NSURILENGTH    FIXED BIN(31);                                   17260000
                                                /* SOC CEDS00000679 */  17270000
    DCL ED_ELEMENT_PTR               POINTER;                           17280000
    DCL TEMP_ED_ELEMENT              CHAR(50) VARYING;                  17290000
    DCL ED_ELEMENT_PTR_1             POINTER;                           17300000
    DCL TEMP_ED_ELEMENT_1            CHAR(50) VARYING;                  17310000
                                                /* EOC CEDS00000679 */  17320000
                                                                        17330000
                                                /* SOC CEDS00000679 */  17340000
 /*ED_OF_ELEMENT = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );*/            17350000
   TEMP_ED_ELEMENT            = '';                                     17360000
   TEMP_ED_ELEMENT_1          = '';                                     17370000
  /***************** CONVERTING TO EBCDIC ********************/         17380000
                                                                        17390000
   TEMP_ED_ELEMENT_1          = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH ); 17400000
   ED_ELEMENT_PTR_1           = ADDR(TEMP_ED_ELEMENT_1);                17410000
   ED_ELEMENT_PTR             = ADDR(TEMP_ED_ELEMENT);                  17420000
   TEMP_LENGTH                = TOKENLENGTH + 2;                        17430000
                                                                        17440000
   ELE_CONVERT   = MEMCONVERT (ED_ELEMENT_PTR,TEMP_LENGTH,500,          17450000
                              ED_ELEMENT_PTR_1,TEMP_LENGTH,1208);       17460000
   ED_OF_ELEMENT = SUBSTR(TEMP_ED_ELEMENT,1,TOKENLENGTH);               17470000
                                                /* EOC CEDS00000679 */  17480000
   IF ED_OF_ELEMENT='MODEL_UPDATE' THEN                                 17490000
   MODEL_UPDATE_FLAG = FALSE;                                           17500000
                                                                        17510000
                                                  /* SOC CEDS00000617 */17520000
   IF ED_OF_ELEMENT='REPLMODELLIST' THEN                                17530000
   REPLMODELLIST_FLAG = FALSE;                                          17540000
                                                  /* EOC CEDS00000617 */17550000
                                                                        17560000
   IF ED_OF_ELEMENT='LANGUAGELIST' THEN                                 17570000
   LANG_LIST_FLAG    = FALSE;                                           17580000
   IF ED_OF_ELEMENT='LANGUAGEELEMENT' THEN                              17590000
   LANG_ELEM_FLAG = FALSE;                                              17600000
                                                                        17610000
   IF ED_OF_ELEMENT='AVAILABILITYLIST' THEN                             17620000
   AVAILABILITY_LIST_FLAG = FALSE;                                      17630000
   IF ED_OF_ELEMENT='AVAILABILITYELEMENT' THEN                          17640000
   AVAILABILITY_ELEMENT_FLAG = FALSE;                                   17650000
                                                 /* SOC CEDS00000692 */ 17660099
   IF ED_OF_ELEMENT='MMLIST' THEN                                       17661099
   MODEL_UPDATE_MMLIST = FALSE;                  /* EOC CEDS00000692 */ 17662099
                                                     /* SOC S1304835 */ 17669199
   IF ED_OF_ELEMENT='MACHTYPE' THEN                                     17669299
   MACH_TYPE_FLAG = FALSE;                                              17669399
                                                                        17669499
   IF ED_OF_ELEMENT='MODEL' THEN                                        17669599
   MODEL_TYPE_FLAG = FALSE;                                             17669699
                                                                        17669799
   IF ED_OF_ELEMENT='MODELENTITYID' THEN                                17669899
   MODEL_ENTITYID_FLAG = FALSE;                                         17669999
                                                                        17670099
   IF ED_OF_ELEMENT='DTSOFMSG' THEN                                     17670199
   DTSOF_MSG_FLAG = FALSE;                                              17670299
                                                                        17670399
   IF ED_OF_ELEMENT='DIVISION' THEN                                     17670499
   DIVISION_FLAG = FALSE;                                               17670599
                                                                        17670699
   IF ED_OF_ELEMENT='MACHRATECATG' THEN                                 17670799
   MACHRATE_CATG_FLAG = FALSE;                                          17670899
                                                                        17670999
   IF ED_OF_ELEMENT='CECSPRODKEY' THEN                                  17671099
   CECSPROD_KEY_FLAG = FALSE;                                           17671199
                                                                        17671299
   IF ED_OF_ELEMENT='PRODSUPRTCD' THEN                                  17671399
   PROD_SUPRTCD_FLAG = FALSE;                                           17671499
                                                                        17671599
   IF ED_OF_ELEMENT='RETANINDC' THEN                                    17671699
   RETAN_INDC_FLAG = FALSE;                                             17671799
                                                                        17671899
   IF ED_OF_ELEMENT='INSTALL' THEN                                      17671999
   INSTALL_FLAG = FALSE;                                                17672099
                                                                        17672199
   IF ED_OF_ELEMENT='NLSID' THEN                                        17672299
   NLSID_FLAG = FALSE;                                                  17672399
                                                                        17672499
   IF ED_OF_ELEMENT='MKTGNAME' THEN                                     17672599
   MKTG_NAME_FLAG = FALSE;                                              17672699
                                                                        17672799
   IF ED_OF_ELEMENT='COUNTRY_FC' THEN                                   17672899
   COUNTRY_FC_FLAG = FALSE;                                             17672999
                                                                        17673099
   IF ED_OF_ELEMENT='PLANNEDAVAILABILITY' THEN                          17673199
   PLANNED_AVAILABILITY_FLAG = FALSE;                                   17673299
                                                                        17673399
   IF ED_OF_ELEMENT='ENDOFSERVICEDATE' THEN                             17673499
   ENDOFSERVICE_DATE_FLAG = FALSE;                                      17673599
                                                                        17673699
   IF ED_OF_ELEMENT='GEOMODLIST' | ST_OF_ELEMENT='STDMAINTLIST' THEN    17673799
   GEO_STD_MAINTFLAG  = FALSE;                       /* EOC S1304835 */ 17673899
                                                                        17673999
    RETURN(0);                                                          17674000
  END;                                                                  17680000
                                                                        17690000
1/********************************************************************/ 17700000
 /* MODULE NAME      : CONTENT_CHARACTERS                            */ 17710000
 /*                                                                  */ 17720000
 /********************************************************************/ 17730000
  CONTENT_CHARACTERS:                                                   17740000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH, FLAGS )                     17750000
    RETURNS( BYVALUE FIXED BIN(31) )                                    17760000
    OPTIONS( NODESCRIPTOR, BYVALUE LINKAGE(OPTLINK) );                  17770000
                                                                        17780000
    DCL USERTOKEN      POINTER;                                         17790000
    DCL XMLTOKEN       POINTER;                                         17800000
    DCL TOKENLENGTH    FIXED BIN(31);                                   17810000
    DCL FLAGS          BIT(8) ALIGNED;                                  17820000
    DCL PTR_MODEL      POINTER;                   /* SOC CEDS00000679 */17830000
    DCL PTR_MODEL_1    POINTER;                   /* EOC CEDS00000679 */17840000
                                                  /* SOC CEDS00000617 */17850000
  /*                                                                    17860000
  IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'MACHTYPE') THEN DO; */     17870000
                                                      /* SOC S1304835 */17871099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'MACHTYPE') & */          17880099
  IF (MODEL_UPDATE_FLAG) & (MACH_TYPE_FLAG) &         /* EOC S1304835 */17881099
     (REPLMODELLIST_FLAG ¬= TRUE) THEN DO;        /* EOC CEDS00000617 */17890000
                                                /* SOC CEDS00000679 */  17900000
   /* MODEL_UP.PRODUCT_TYPE = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/  17910000
                                                /* EOC CEDS00000679 */  17920000
      MODEL_UP.VENDOR_NAME  = 'IBM';                                    17930000
                                                /* SOC CEDS00000679 */  17940000
      IF (M = 0) THEN DO;                                 /* S1304835 */17941099
      MODEL_UP.PRODUCT_TYPE = ' ';                                      17950099
      MODEL_UP1.PRODUCT_TYPE = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);   17960099
                                                                        17970000
      PTR_MODEL               = ADDR(MODEL_UP.PRODUCT_TYPE);            17980099
      PTR_MODEL_1             = ADDR(MODEL_UP1.PRODUCT_TYPE);           17990099
      ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                  18000099
                                            TOKENLENGTH,                18010016
                                            500,                        18020000
                                            PTR_MODEL_1,                18030000
                                            TOKENLENGTH,                18040016
                                            1208);                      18050000
                                                      /* SOC S1304835 */18051099
      M = M + 1;                                                        18060399
      END;                                            /* EOC S1304835 */18061099
      MODEL_UP1.VENDOR_NAME = ' ';                                      18070000
      MODEL_UP1.VENDOR_NAME = (120)'20'X;                               18071089
      DCL LEN_VENDORNAME FIXED BIN(31);                                 18080000
                                                                        18090000
  /*  LEN_VENDORNAME          = 3;             *//* SOC CEDS00000692 */ 18100048
      LEN_VENDORNAME          = 5;               /* EOC CEDS00000692 */ 18101048
      ELE_CONVERT             = 0;                                      18110000
      PTR_MODEL               = ADDR(MODEL_UP.VENDOR_NAME);             18120000
      PTR_MODEL_1             = ADDR(MODEL_UP1.VENDOR_NAME);            18130000
      ELE_CONVERT             = MEMCONVERT (PTR_MODEL_1,                18140000
                                            LEN_VENDORNAME,             18150000
                                            1208,                       18160000
                                            PTR_MODEL,                  18170000
                                            LEN_VENDORNAME,             18180000
                                            500);                       18190000
                                                /* EOC CEDS00000679 */  18200000
  END;                                                                  18210000
                                                  /* SOC CEDS00000617 */18220000
  /*                                                                    18230000
  IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'MODEL') THEN DO; */        18240000
                                                      /* SOC S1304835 */18241099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'MODEL') & */             18250099
  IF (MODEL_UPDATE_FLAG) & (MODEL_TYPE_FLAG) &        /* EOC S1304835 */18251099
     (REPLMODELLIST_FLAG ¬= TRUE) THEN DO;        /* EOC CEDS00000617 */18260000
                                                  /* SOC CEDS00000679 */18270000
    /*MODEL_UP.MODEL_NUMBER = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/  18280000
     IF (N = 0) THEN DO;                                  /* S1304835 */18281099
      MODEL_UP.MODEL_NUMBER = ' ';                                      18290099
      MODEL_UP1.MODEL_NUMBER = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);   18300099
      ELE_CONVERT             = 0;                                      18310000
                                                                        18320000
      PTR_MODEL               = ADDR(MODEL_UP.MODEL_NUMBER);            18330000
      PTR_MODEL_1             = ADDR(MODEL_UP1.MODEL_NUMBER);           18340000
      ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                  18350000
                                            TOKENLENGTH,                18360000
                                            500,                        18370000
                                            PTR_MODEL_1,                18380000
                                            TOKENLENGTH,                18390000
                                            1208);                      18400000
      N = N + 1;                                      /* SOC S1304835 */18400399
     END;                                             /* EOC S1304835 */18401099
                                                  /* EOC CEDS00000679 */18410000
  END;                                                                  18420000
                                                  /* SOC CEDS00000617 */18430000
  /*                                                                    18440000
  IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'MODELENTITYID') THEN DO;*/ 18450000
                                                      /* SOC S1304835 */18451099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'MODELENTITYID') & */     18460099
  IF (MODEL_UPDATE_FLAG) & (MODEL_ENTITYID_FLAG) &    /* EOC S1304835 */18461099
     (REPLMODELLIST_FLAG ¬= TRUE) THEN DO;        /* EOC CEDS00000617 */18470000
                                                  /* SOC CEDS00000679 */18480000
    /*MODELENTITYID = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/          18490000
      MODELENTITYID         = ' ';                                      18500000
      MODELENTITYID1        = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    18510000
                                                                        18520000
      ELE_CONVERT             = 0;                                      18530000
      PTR_MODEL               = ADDR(MODELENTITYID);                    18540000
      PTR_MODEL_1             = ADDR(MODELENTITYID1);                   18550000
      ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                  18560000
                                            TOKENLENGTH,                18570000
                                            500,                        18580000
                                            PTR_MODEL_1,                18590000
                                            TOKENLENGTH,                18600000
                                            1208);                      18610000
                                                  /* EOC CEDS00000679 */18620000
  END;                                                                  18630000
                                                      /* SOC S1304835 */18640099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'DTSOFMSG') THEN DO; */   18650099
  IF (MODEL_UPDATE_FLAG) & (DTSOF_MSG_FLAG) THEN DO;                    18651099
                                                      /* EOC S1304835 */18652099
                                                 /* SOC CEDS00000679 */ 18660000
      /* DTSOFMSG   = SUBSTR(XMLTOKEN->CHARS,1,10);*/                   18670000
         DTSOFMSG              = ' ';                                   18680000
         MODELDTSOFMSG         = SUBSTR(XMLTOKEN->CHARS,1,10);          18690000
                                                                        18700000
         ELE_CONVERT             = 0;                                   18710000
         TEMP_LENGTH             = 10;                                  18720000
         PTR_MODEL               = ADDR(DTSOFMSG);                      18730000
         PTR_MODEL_1             = ADDR(MODELDTSOFMSG);                 18740000
         ELE_CONVERT             = MEMCONVERT (PTR_MODEL,               18750000
                                               TEMP_LENGTH,             18760000
                                               500,                     18770000
                                               PTR_MODEL_1,             18780000
                                               TEMP_LENGTH,             18790000
                                               1208);                   18800000
                                                 /* EOC CEDS00000679 */ 18810000
  END;                                                                  18820000
                                                      /* SOC S1304835 */18830099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'DIVISION') THEN DO; */   18840099
  IF (MODEL_UPDATE_FLAG) & (DIVISION_FLAG) THEN DO;                     18841099
                                                      /* EOC S1304835 */18842099
                                                  /* SOC CEDS00000679 */18850000
   /* MODEL_UP.PROD_REVENUE_DIV=SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/18860000
     MODEL_UP.PROD_REVENUE_DIV = ' ';                                   18870000
     MODEL_UP1.PROD_REVENUE_DIV = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);18880000
                                                                        18890000
      ELE_CONVERT             = 0;                                      18900000
      PTR_MODEL               = ADDR(MODEL_UP.PROD_REVENUE_DIV);        18910000
      PTR_MODEL_1             = ADDR(MODEL_UP1.PROD_REVENUE_DIV);       18920000
      ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                  18930000
                                            TOKENLENGTH,                18940000
                                            500,                        18950000
                                            PTR_MODEL_1,                18960000
                                            TOKENLENGTH,                18970000
                                            1208);                      18980000
                                                  /* EOC CEDS00000679 */18990000
  END;                                                                  19000000
                                                      /* SOC S1304835 */19010099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'MACHRATECATG') THEN DO;*/19020099
  IF (MODEL_UPDATE_FLAG) & (MACHRATE_CATG_FLAG) THEN DO;                19021099
                                                      /* EOC S1304835 */19022099
                                                  /* SOC CEDS00000679 */19030000
   /* MODEL_UP.MACHINE_CATEGORY=SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/19040000
     MODEL_UP.MACHINE_CATEGORY = ' ';                                   19050000
     MODEL_UP1.MACHINE_CATEGORY = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);19060000
                                                                        19070000
     ELE_CONVERT             = 0;                                       19080000
     PTR_MODEL               = ADDR(MODEL_UP.MACHINE_CATEGORY);         19090000
     PTR_MODEL_1             = ADDR(MODEL_UP1.MACHINE_CATEGORY);        19100000
     ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                   19110000
                                           TOKENLENGTH,                 19120000
                                           500,                         19130000
                                           PTR_MODEL_1,                 19140000
                                           TOKENLENGTH,                 19150000
                                           1208);                       19160000
                                                  /* EOC CEDS00000679 */19170000
  END;                                                                  19180000
                                                      /* SOC S1304835 */19190099
 /* IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'CECSPRODKEY') THEN DO;*/ 19200099
  IF (MODEL_UPDATE_FLAG) & (CECSPROD_KEY_FLAG) THEN DO;/* EOC S1304835*/19201099
                                                  /* SOC CEDS00000679 */19210000
 /*MODEL_UP.CE_PRODUCT_KEY=SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/     19220000
    MODEL_UP.CE_PRODUCT_KEY   = ' ';                                    19230000
    MODEL_UP1.CE_PRODUCT_KEY = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);   19240000
                                                                        19250000
    ELE_CONVERT             = 0;                                        19260000
    PTR_MODEL               = ADDR(MODEL_UP.CE_PRODUCT_KEY);            19270000
    PTR_MODEL_1             = ADDR(MODEL_UP1.CE_PRODUCT_KEY);           19280000
    ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                    19290000
                                          TOKENLENGTH,                  19300000
                                          500,                          19310000
                                          PTR_MODEL_1,                  19320000
                                          TOKENLENGTH,                  19330000
                                          1208);                        19340000
                                                  /* EOC CEDS00000679 */19350000
  END;                                                                  19360000
                                                     /* SOC S1304835 */ 19370099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'PRODSUPRTCD') THEN DO;*/ 19380099
  IF (MODEL_UPDATE_FLAG) & (PROD_SUPRTCD_FLAG) THEN DO;/* EOC S1304835*/19381099
                                                  /* SOC CEDS00000679 */19390000
  /*MODEL_UP.PROD_SUP_COD   =SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/   19400000
    MODEL_UP.PROD_SUP_COD     = ' ';                                    19410000
    MODEL_UP1.PROD_SUP_COD  = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    19420000
                                                                        19430000
    ELE_CONVERT             = 0;                                        19440000
    PTR_MODEL               = ADDR(MODEL_UP.PROD_SUP_COD);              19450000
    PTR_MODEL_1             = ADDR(MODEL_UP1.PROD_SUP_COD);             19460000
    ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                    19470000
                                          TOKENLENGTH,                  19480000
                                          500,                          19490000
                                          PTR_MODEL_1,                  19500000
                                          TOKENLENGTH,                  19510000
                                          1208);                        19520000
                                                  /* EOC CEDS00000679 */19530000
  END;                                                                  19540000
                                                      /* SOC S1304835 */19550099
 /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'RETANINDC') THEN DO;*/    19560099
  IF (MODEL_UPDATE_FLAG) & (RETAN_INDC_FLAG) THEN DO; /* EOC S1304835 */19561099
                                                  /* SOC CEDS00000679 */19570000
  /*MODEL_UP.RETAIN_FLAG=SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/       19580000
    MODEL_UP.RETAIN_FLAG      = ' ';                                    19590000
    MODEL_UP1.RETAIN_FLAG  = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);     19600000
                                                                        19610000
    ELE_CONVERT             = 0;                                        19620000
    PTR_MODEL               = ADDR(MODEL_UP.RETAIN_FLAG);               19630000
    PTR_MODEL_1             = ADDR(MODEL_UP1.RETAIN_FLAG);              19640000
    ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                    19650000
                                          TOKENLENGTH,                  19660000
                                          500,                          19670000
                                          PTR_MODEL_1,                  19680000
                                          TOKENLENGTH,                  19690000
                                          1208);                        19700000
                                                  /* EOC CEDS00000679 */19710000
  END;                                                                  19720000
                                                      /* SOC S1304835 */19730099
  /*IF (MODEL_UPDATE_FLAG) & (ST_OF_ELEMENT = 'INSTALL') THEN DO;*/     19740099
  IF (MODEL_UPDATE_FLAG) & (INSTALL_FLAG) THEN DO;    /* EOC S1304835 */19741099
                                                  /* SOC CEDS00000679 */19750000
    /*MODEL_UP.INSTALL=SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);*/         19760000
      MODEL_UP.INSTALL          = ' ';                                  19770000
      MODEL_UP1.INSTALL     = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    19780000
                                                                        19790000
      ELE_CONVERT             = 0;                                      19800000
      PTR_MODEL               = ADDR(MODEL_UP.INSTALL);                 19810000
      PTR_MODEL_1             = ADDR(MODEL_UP1.INSTALL);                19820000
      ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                  19830000
                                            TOKENLENGTH,                19840000
                                            500,                        19850000
                                            PTR_MODEL_1,                19860000
                                            TOKENLENGTH,                19870000
                                            1208);                      19880000
                                                  /* EOC CEDS00000679 */19890000
  END;                                                                  19900000
                                                                        19910000
  IF (MODEL_UPDATE_FLAG) & (LANG_LIST_FLAG) & (LANG_ELEM_FLAG)          19920000
  THEN DO;                                                              19930000
     LANGUAGE_LIST(J).PRODUCT_TYPE = MODEL_UP.PRODUCT_TYPE;             19940000
     LANGUAGE_LIST(J).MODEL_NUMBER = MODEL_UP.MODEL_NUMBER;             19950000
                                                  /* SOC CEDS00000679 */19960000
     LANG_LIST(J).PRODUCT_TYPE = MODEL_UP1.PRODUCT_TYPE;                19970000
     LANG_LIST(J).MODEL_NUMBER = MODEL_UP1.MODEL_NUMBER;                19980000
                                                  /* EOC CEDS00000679 */19990000
                                                                        20000000
  END;                                                                  20010000
                                                                        20020000
  IF MODEL_UPDATE_MMLIST = FALSE THEN DO;             /* CEDS00000692 */20021099
  IF (MODEL_UPDATE_FLAG) & (LANG_LIST_FLAG) & (LANG_ELEM_FLAG) &        20030000
  /* (ST_OF_ELEMENT = 'NLSID') THEN DO;               /* SOC S1304835 */20040099
     (NLSID_FLAG) THEN DO;                            /* EOC S1304835 */20041099
                                                  /* SOC CEDS00000679 */20050000
    /* LANGUAGE_LIST(J).LANG_ID = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);20060000
    */                                                                  20070000
       LANGUAGE_LIST(J).LANG_ID  = ' ';                                 20080000
       LANG_LIST(J).LANG_ID = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    20090000
                                                                        20100000
       ELE_CONVERT             = 0;                                     20110000
       PTR_MODEL               = ADDR(LANGUAGE_LIST(J).LANG_ID);        20120000
       PTR_MODEL_1             = ADDR(LANG_LIST(J).LANG_ID);            20130000
       ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                 20140000
                                             TOKENLENGTH,               20150000
                                             500,                       20160000
                                             PTR_MODEL_1,               20170000
                                             TOKENLENGTH,               20180000
                                             1208);                     20190000
                                                  /* EOC CEDS00000679 */20200000
  END;                                                                  20210000
                                                                        20220000
  IF (MODEL_UPDATE_FLAG) & (LANG_LIST_FLAG) & (LANG_ELEM_FLAG) &        20230000
                                                      /* SOC RC01337 */ 20240000
   /*(ST_OF_ELEMENT = 'INVNAME') THEN DO;                               20250000
     LANGUAGE_LIST(J).PROD_DESC = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);20260000
                                                      /* SOC S1304835 */20270099
   /*(ST_OF_ELEMENT = 'MKTGNAME') THEN DO; */                           20280099
     (MKTG_NAME_FLAG) THEN DO;                        /* EOC S1304835 */20281099
     IF (LANGUAGE_LIST(J).LANG_ID = '1') THEN     /* SOC CEDS00000692 */20281199
     DO;                                                                20281206
     LANGUAGE_LIST(J).PROD_DESC = ' ';                                  20281508
     LANG_LIST(J).PROD_DESC = (120)'20'X;                               20281662
     LANG_LIST(J).PROD_DESC = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    20282000
                                                                        20283000
     TEMP_LENGTH             = TOKENLENGTH + 2;                         20283121
     ELE_CONVERT             = 0;                                       20284000
     PTR_MODEL               = ADDR(LANGUAGE_LIST(J).PROD_DESC);        20285000
     PTR_MODEL_1             = ADDR(LANG_LIST(J).PROD_DESC);            20286000
     ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                   20287000
                                           TEMP_LENGTH,                 20288157
                                           500,                         20289000
                                           PTR_MODEL_1,                 20289100
                                           TEMP_LENGTH,                 20289466
                                           1208); /* EOC CEDS00000692 */20289599
                                                                        20289952
     IF (TOKENLENGTH <= 30) THEN DO;                                    20290000
                                                  /* SOC CEDS00000692 */20291012
   /*LANGUAGE_LIST(J).PROD_DESC = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);20291100
     */                                                                 20291202
     LANGUAGE_LIST(J).PROD_DESC = SUBSTR(LANGUAGE_LIST(J).PROD_DESC,    20292058
                                                      1,30);            20293099
                                                                        20295047
     LANG_LIST(J).PROD_DESC  = (120)'20'X;                              20296099
     ELE_CONVERT             = 0;                                       20298039
     PTR_MODEL               = ADDR(LANGUAGE_LIST(J).PROD_DESC);        20299039
     PTR_MODEL_1             = ADDR(LANG_LIST(J).PROD_DESC);            20300039
     ELE_CONVERT             = MEMCONVERT (PTR_MODEL_1,                 20301039
                                           122,                         20302066
                                           1208,                        20303039
                                           PTR_MODEL,                   20304039
                                           TOKENLENGTH+2,               20305042
                                           500);  /* EOC CEDS00000692 */20306047
     END;                                                               20310000
     ELSE DO;                                                           20320026
                                                  /* SOC CEDS00000692 */20321012
 /*  LANGUAGE_LIST(J).PROD_DESC =SUBSTR(XMLTOKEN->CHARS,TOKENLENGTH-29);20321147
     */                                                                 20321205
     LANGUAGE_LIST(J).PROD_DESC =SUBSTR(LANGUAGE_LIST(J).PROD_DESC,     20322099
                                        TOKENLENGTH-29,30);             20323099
                                                                        20323647
     LANG_LIST(J).PROD_DESC  = (120)'20'X;                              20325099
     ELE_CONVERT             = 0;                                       20327039
     PTR_MODEL               = ADDR(LANGUAGE_LIST(J).PROD_DESC);        20328039
     PTR_MODEL_1             = ADDR(LANG_LIST(J).PROD_DESC);            20329039
     ELE_CONVERT             = MEMCONVERT (PTR_MODEL_1,                 20330039
                                           122,                         20331040
                                           1208,                        20332039
                                           PTR_MODEL,                   20333039
                                           32,                          20334039
                                           500);  /* EOC CEDS00000692 */20335047
     END;                                              /* EOC RC01337 */20340026
     END;                                             /* CEDS00000692 */20349512
                                                  /* SOC CEDS00000679 */20350000
   /*LANG_LIST(J).PROD_DESC = LANGUAGE_LIST(J).PROD_DESC;               20360000
     LANGUAGE_LIST(J).PROD_DESC = ' ';                                  20370000
                                                                        20380000
     ELE_CONVERT             = 0;                                       20390000
     PTR_MODEL               = ADDR(LANGUAGE_LIST(J).PROD_DESC);        20400000
     PTR_MODEL_1             = ADDR(LANG_LIST(J).PROD_DESC);            20410000
     ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                   20420000
                                           TOKENLENGTH,                 20430000
                                           500,                         20440000
                                           PTR_MODEL_1,                 20450000
                                           TOKENLENGTH,                 20460000
                                           1208);                       20470000
                                                  /* EOC CEDS00000679 */20480000
  END;                                                                  20490001
    END;                                              /* CEDS00000692 */20491099
                                                                        20500000
  IF (MODEL_UPDATE_FLAG) & (AVAILABILITY_LIST_FLAG)                     20510000
                         & (AVAILABILITY_ELEMENT_FLAG)                  20520000
  THEN DO;                                                              20530000
     COUNTRY_LIST(I).PRODUCT_TYPE = MODEL_UP.PRODUCT_TYPE;              20540000
     COUNTRY_LIST(I).MODEL_NUMBER = MODEL_UP.MODEL_NUMBER;              20550000
                                                 /* SOC CEDS00000679 */ 20560000
     COUNTRY_LIST1(I).PRODUCT_TYPE = MODEL_UP1.PRODUCT_TYPE;            20570000
     COUNTRY_LIST1(I).MODEL_NUMBER = MODEL_UP1.MODEL_NUMBER;            20580000
                                                 /* EOC CEDS00000679 */ 20590000
  END;                                                                  20600000
                                                                        20610000
                                                                        20613099
  IF (MODEL_UPDATE_FLAG) & (AVAILABILITY_LIST_FLAG) &                   20620000
                                                      /* SOC S1304835 */20621099
  /* (AVAILABILITY_ELEMENT_FLAG) & (ST_OF_ELEMENT = 'COUNTRY_FC') */    20630099
     (AVAILABILITY_ELEMENT_FLAG) & (COUNTRY_FC_FLAG) &                  20631099
       (GEO_STD_MAINTFLAG ¬= TRUE )                   /* EOC S1304835 */20632099
      THEN DO;                                                          20640000
                                                  /* SOC CEDS00000679 */20650000
      /*COUNTRY_LIST(I).EACM_COUNTRY_FC=                                20660000
                                  SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);20670000
      */                                                                20680000
                                                                        20683099
    COUNTRY_LIST(I).EACM_COUNTRY_FC = ' ';                              20690000
    COUNTRY_LIST1(I).EACM_COUNTRY_FC =                                  20700000
                                  SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);20710000
                                                                        20720000
    ELE_CONVERT             = 0;                                        20730000
    PTR_MODEL               = ADDR(COUNTRY_LIST(I).EACM_COUNTRY_FC);    20740000
    PTR_MODEL_1             = ADDR(COUNTRY_LIST1(I).EACM_COUNTRY_FC);   20750000
    ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                    20760000
                                          TOKENLENGTH,                  20770000
                                          500,                          20780000
                                          PTR_MODEL_1,                  20790000
                                          TOKENLENGTH,                  20800000
                                          1208);                        20810000
                                                  /* EOC CEDS00000679 */20820000
  END;                                                                  20830000
                                                                        20840000
  IF (MODEL_UPDATE_FLAG) & (AVAILABILITY_LIST_FLAG) &                   20850000
     (AVAILABILITY_ELEMENT_FLAG) &                                      20860000
  /* (ST_OF_ELEMENT = 'PLANNEDAVAILABILITY')THEN DO;  /* SOC S1304835 */20870099
     (PLANNED_AVAILABILITY_FLAG) THEN DO;             /* EOC S1304835 */20871099
                                                  /* SOC CEDS00000679 */20880000
    /* COUNTRY_LIST(I).AVAILABILITY_DATE =                              20890000
                                  SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);20900000
    */                                                                  20910000
    COUNTRY_LIST(I).AVAILABILITY_DATE = ' ';                            20920000
    COUNTRY_LIST1(I).AVAILABILITY_DATE =                                20930000
                              SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    20940000
                                                                        20950000
    ELE_CONVERT             = 0;                                        20960000
    PTR_MODEL               = ADDR(COUNTRY_LIST(I).AVAILABILITY_DATE);  20970000
    PTR_MODEL_1             = ADDR(COUNTRY_LIST1(I).AVAILABILITY_DATE); 20980000
    ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                    20990000
                                          TOKENLENGTH,                  21000000
                                          500,                          21010000
                                          PTR_MODEL_1,                  21020000
                                          TOKENLENGTH,                  21030000
                                          1208);                        21040000
                                                  /* EOC CEDS00000679 */21050000
  END;                                                                  21060000
                                                                        21070000
  IF (MODEL_UPDATE_FLAG) & (AVAILABILITY_LIST_FLAG) &                   21080000
     (AVAILABILITY_ELEMENT_FLAG) &                                      21090000
  /* (ST_OF_ELEMENT = 'ENDOFSERVICEDATE') THEN DO;    /* SOC S1304835 */21100099
     (ENDOFSERVICE_DATE_FLAG) THEN DO;                /* EOC S1304835 */21101099
                                                                        21110000
                                                  /* SOC CEDS00000679 */21120000
     /* COUNTRY_LIST(I).END_OF_SERVICE_DATE  =                          21130000
                                  SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);21140000
     */                                                                 21150000
    COUNTRY_LIST(I).END_OF_SERVICE_DATE = ' ';                          21160000
    COUNTRY_LIST1(I).END_OF_SERVICE_DATE =                              21170000
                              SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    21180000
                                                                        21190000
    ELE_CONVERT             = 0;                                        21200000
    PTR_MODEL               = ADDR(COUNTRY_LIST(I).END_OF_SERVICE_DATE);21210000
    PTR_MODEL_1             = ADDR(COUNTRY_LIST1(I).                    21220000
                                         END_OF_SERVICE_DATE);          21230000
    ELE_CONVERT             = MEMCONVERT (PTR_MODEL,                    21240000
                                          TOKENLENGTH,                  21250000
                                          500,                          21260000
                                          PTR_MODEL_1,                  21270000
                                          TOKENLENGTH,                  21280000
                                          1208);                        21290000
                                                  /* EOC CEDS00000679 */21300000
  END;                                                                  21310000
                                                                        21320000
    RETURN(0);                                                          21330000
  END;                                                                  21340000
                                                                        21350000
1/********************************************************************/ 21360000
 /* MODULE NAME      : ATTRIBUTE_CHARACTERS                          */ 21370000
 /*                                                                  */ 21380000
 /********************************************************************/ 21390000
  ATTRIBUTE_CHARACTERS:                                                 21400000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            21410000
    RETURNS( BYVALUE FIXED BIN(31) )                                    21420000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                21430000
                                                                        21440000
    DCL USERTOKEN      POINTER;                                         21450000
    DCL XMLTOKEN       POINTER;                                         21460000
    DCL TOKENLENGTH    FIXED BIN(31);                                   21470000
                                                                        21480000
    RETURN(0);                                                          21490000
  END;                                                                  21500000
                                                                        21510000
1/********************************************************************/ 21520000
 /* MODULE NAME      : START_OF_CDATA                                */ 21530000
 /*                                                                  */ 21540000
 /********************************************************************/ 21550000
  START_OF_CDATA:                                                       21560000
    PROC( USERTOKEN )                                                   21570000
    RETURNS( BYVALUE FIXED BIN(31) )                                    21580000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                21590000
                                                                        21600000
    DCL USERTOKEN      POINTER;                                         21610000
                                                                        21620000
    RETURN(0);                                                          21630000
  END;                                                                  21640000
                                                                        21650000
1/********************************************************************/ 21660000
 /* MODULE NAME      : END_OF_CDATA                                  */ 21670000
 /*                                                                  */ 21680000
 /********************************************************************/ 21690000
  END_OF_CDATA:                                                         21700000
    PROC( USERTOKEN )                                                   21710000
    RETURNS( BYVALUE FIXED BIN(31) )                                    21720000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                21730000
                                                                        21740000
    DCL USERTOKEN      POINTER;                                         21750000
                                                                        21760000
    RETURN(0);                                                          21770000
  END;                                                                  21780000
                                                                        21790000
1/********************************************************************/ 21800000
 /* MODULE NAME      : PROCESSING_INSTRUCTION                        */ 21810000
 /*                                                                  */ 21820000
 /********************************************************************/ 21830000
  PROCESSING_INSTRUCTION:                                               21840000
    PROC( USERTOKEN,                                                    21850000
          PITARGET, PITARGETLENGTH,                                     21860000
          PIDATA, PIDATALENGTH )                                        21870000
    RETURNS( BYVALUE FIXED BIN(31) )                                    21880000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                21890000
                                                                        21900000
    DCL USERTOKEN      POINTER;                                         21910000
    DCL PITARGET       POINTER;                                         21920000
    DCL PITARGETLENGTH FIXED BIN(31);                                   21930000
    DCL PIDATA         POINTER;                                         21940000
    DCL PIDATALENGTH   FIXED BIN(31);                                   21950000
                                                                        21960000
    RETURN(0);                                                          21970000
  END;                                                                  21980000
                                                                        21990000
1/********************************************************************/ 22000000
 /* MODULE NAME      : COMMENT                                       */ 22010000
 /*                                                                  */ 22020000
 /********************************************************************/ 22030000
  COMMENT:                                                              22040000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            22050000
    RETURNS( BYVALUE FIXED BIN(31) )                                    22060000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                22070000
                                                                        22080000
    DCL USERTOKEN      POINTER;                                         22090000
    DCL XMLTOKEN       POINTER;                                         22100000
    DCL TOKENLENGTH    FIXED BIN(31);                                   22110000
                                                                        22120000
    RETURN(0);                                                          22130000
  END;                                                                  22140000
                                                                        22150000
1/********************************************************************/ 22160000
 /* MODULE NAME      : UNRESOLVED_REFERENCE                          */ 22170000
 /*                                                                  */ 22180000
 /********************************************************************/ 22190000
  UNRESOLVED_REFERENCE:                                                 22200000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            22210000
    RETURNS( BYVALUE FIXED BIN(31) )                                    22220000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                22230000
                                                                        22240000
    DCL USERTOKEN      POINTER;                                         22250000
    DCL XMLTOKEN       POINTER;                                         22260000
    DCL TOKENLENGTH    FIXED BIN(31);                                   22270000
                                                                        22280000
    RETURN(0);                                                          22290000
  END;                                                                  22300000
                                                                        22310000
1/********************************************************************/ 22320000
 /* MODULE NAME      : EXCEPTION                                     */ 22330000
 /*                                                                  */ 22340000
 /********************************************************************/ 22350000
  EXCEPTION:                                                            22360000
    PROC( USERTOKEN, CURRENTOFFSET, RETURN_CODE, REASON_CODE )          22370000
    RETURNS( BYVALUE FIXED BIN(31) )                                    22380000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                22390000
                                                                        22400000
    DCL USERTOKEN      POINTER;                                         22410000
    DCL CURRENTOFFSET  FIXED BIN(31);                                   22420000
    DCL RETURN_CODE    FIXED BIN(31);                                   22430000
    DCL REASON_CODE    FIXED BIN(31);                                   22440000
                                                                        22450000
    RETURN(0);                                                          22460000
  END;                                                                  22470000
                                                                        22480000
1/********************************************************************/ 22490000
 /* MODULE NAME      : END_OF_INPUT                                  */ 22500000
 /*                                                                  */ 22510000
 /********************************************************************/ 22520000
  END_OF_INPUT:                                                         22530000
    PROC( USERTOKEN, ADDR_XML, LENGTH_XML )                             22540000
    RETURNS( BYVALUE FIXED BIN(31) )                                    22550000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                22560000
                                                                        22570000
    DCL USERTOKEN      POINTER;                                         22580000
    DCL ADDR_XML       BYADDR POINTER;                                  22590000
    DCL LENGTH_XML     BYADDR FIXED BIN(31);                            22600000
                                                                        22610000
    RETURN(1);                                                          22620000
  END;                                                                  22630000
 END;                                                                   22640000
                                                                        22650000