 /* RCBXC5M - XML PARSER: SEO UPDATE TRANSACTION                     */ 00010000
 /*                                                                  */ 00020000
 /********************************************************************/ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /********************************************************************/ 00070000
 /*                                                                  */ 00080000
 /* MODULE NAME      : RCBXC5M                                       */ 00090000
 /*                                                                  */ 00100000
 /* PROGRAM NAME     : RCBXC5P                                       */ 00110000
 /*                                                                  */ 00120000
 /* LANGUAGE         : PLISQL                                        */ 00130000
 /*                                                                  */ 00140000
 /* TYPE             : BATCH                                         */ 00150000
 /*                                                                  */ 00160000
 /* DESCRIPTION      : WW AND COUNTRY LEVEL INFORMATION  ON IBM OR   */ 00170000
 /*                    LENOVO MACHINES RECEVIED FROM SEO_UPDATE      */ 00180000
 /*                    TRANSACTION IS PARSED USING PLISAXC PARSER    */ 00190000
 /*                    AND SUB-MODULE ARE CALLED TO INSERT/UPDATE    */ 00200000
 /*                    TABLES T693/T694/T696                         */ 00210000
 /*                                                                  */ 00220000
 /* INPUT            : XML DOCUMENT(SEO_UPDATE TRANSACTION)          */ 00230000
 /*                                                                  */ 00240000
 /* OUTPUT           : -DB2 : RCBT0693_TYPE_MOD_WW_LVL               */ 00250000
 /*                    -DB2 : RCBT0694_TYPE_MOD_CRTY_LVL             */ 00260000
 /*                    -DB2 : RCBT0696_TYPE_MOD_DESC                 */ 00270000
 /*                    -FILE: RCB0M10 MESSAGE FILE                   */ 00280000
 /*                                                                  */ 00290000
 /* EXTERNAL MODULES : RCB0T1M  RETRIEVE SYSTEM DATE                 */ 00300000
 /*                    RCB0M1M  COMMON MESSAGE ROUTINE               */ 00310000
 /*                    RCB004M  DATE VALIDATION                      */ 00320000
 /*                    RCBF89M  INSERT/UPDATE IN T693                */ 00330000
 /*                    RCBF90M  INSERT/UPDATE IN T694                */ 00340000
 /*                    RCBF92M  INSERT/UPDATE IN T696                */ 00350000
 /*                                                                  */ 00360000
 /* MESSAGES         : 0292 / 0293 / 0294 / 0295 / 0296 / 0297       */ 00370000
 /*                    0299 / 0300 / 0306 / 0327                     */ 00380000
 /*                                                                  */ 00390000
 /* DEPENDENCIES     : NONE                                          */ 00400000
 /*                                                                  */ 00410000
 /*  MAINTENANCE LOG :                                               */ 00420000
 /*  ---------------                                                 */ 00430000
 /*                                                                  */ 00440000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00450000
 /*  --------------------------------------------------------------  */ 00460000
 /*  2014-09-01 | RB01342      | CEDS 3.3 A23 RELEASE - SEO_UPDATE   */ 00461000
 /*             |              | XML(MELODY)                         */ 00462000
 /*  2017-03-27 | CEDS00000812 | T10-2215 & T10-2216 CCSID SETTING   */ 00463017
 /*             |              | NOT CONSISTENT WITH CEDS & JP TABLES*/ 00464015
 /********************************************************************/ 00650000
 RCBXC5M: PACKAGE EXPORTS(RCBXC5M);                                     00660000
                                                                        00670000
    DEFINE ALIAS EVENT                                                  00680000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31) )                00690000
        RETURNS( BYVALUE FIXED BIN(31) )                                00700000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00710000
                                                                        00720000
    DEFINE ALIAS EVENT_WITH_FLAG                                        00730000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00740000
                       BIT(8) ALIGNED )                                 00750000
        RETURNS( BYVALUE FIXED BIN(31) )                                00760000
        OPTIONS( NODESCRIPTOR BYVALUE LINKAGE(OPTLINK) );               00770000
                                                                        00780000
    DEFINE ALIAS EVENT_WITH_NAMESPACE                                   00790000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00800000
                       POINTER, FIXED BIN(31),                          00810000
                       POINTER, FIXED BIN(31) )                         00820000
        RETURNS( BYVALUE FIXED BIN(31) )                                00830000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00840000
                                                                        00850000
    DEFINE ALIAS EVENT_WITHOUT_DATA                                     00860000
        LIMITED ENTRY( POINTER )                                        00870000
        RETURNS( BYVALUE FIXED BIN(31) )                                00880000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00890000
                                                                        00900000
    DEFINE ALIAS EVENT_PI                                               00910000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00920000
                       POINTER, FIXED BIN(31) )                         00930000
        RETURNS( BYVALUE FIXED BIN(31) )                                00940000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00950000
                                                                        00960000
    DEFINE ALIAS EVENT_NAMESPACE_DCL                                    00970000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00980000
                       POINTER, FIXED BIN(31) )                         00990000
        RETURNS( BYVALUE FIXED BIN(31) )                                01000000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            01010000
                                                                        01020000
    DEFINE ALIAS EVENT_EXCEPTION                                        01030000
        LIMITED ENTRY( POINTER, FIXED BIN(31),                          01040000
                       FIXED BIN(31),                                   01050000
                       FIXED BIN(31) )                                  01060000
        RETURNS( BYVALUE FIXED BIN(31) )                                01070000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            01080000
                                                                        01090000
    DEFINE ALIAS EVENT_END_OF_INPUT                                     01100000
        LIMITED ENTRY( POINTER,                                         01110000
                       POINTER BYADDR,                                  01120000
                       FIXED BIN(31) BYADDR )                           01130000
        RETURNS( BYVALUE FIXED BIN(31) )                                01140000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            01150000
                                                                        01160000
  RCBXC5M: PROC (COUNTRY_PTR,                                           01170000
                 PARSER_INPUT_AREA_PTR,                                 01180000
                 PTR_MQDATA,                                            01190000
                 PARSER_RETURN_AREA_PTR,                                01200000
                 PTR_ERROR_RETURN,                                      01210000
                 PTR_INT_AREA,                                          01240000
                 PTR_CCSID)                                             01250000
           OPTIONS (REENTRANT)                                          01270000
           REORDER;                                                     01280000
                                                                        01290000
  DCL                                                                   01300000
    1 EVENTHANDLER STATIC                                               01310000
                                                                        01320000
      ,2 E01 TYPE EVENT_WITHOUT_DATA                                    01330000
             INIT( START_OF_DOCUMENT )                                  01340000
                                                                        01350000
      ,2 E02 TYPE EVENT                                                 01360000
             INIT( VERSION_INFORMATION )                                01370000
                                                                        01380000
      ,2 E03 TYPE EVENT                                                 01390000
             INIT( ENCODING_DECLARATION )                               01400000
                                                                        01410000
      ,2 E04 TYPE EVENT                                                 01420000
             INIT( STANDALONE_DECLARATION )                             01430000
                                                                        01440000
      ,2 E05 TYPE EVENT                                                 01450000
             INIT( DOCUMENT_TYPE_DECLARATION )                          01460000
                                                                        01470000
      ,2 E06 TYPE EVENT_WITHOUT_DATA                                    01480000
             INIT( END_OF_DOCUMENT )                                    01490000
                                                                        01500000
      ,2 E07 TYPE EVENT_WITH_NAMESPACE                                  01510000
             INIT( START_OF_ELEMENT )                                   01520000
                                                                        01530000
      ,2 E08 TYPE EVENT_WITH_NAMESPACE                                  01540000
             INIT( ATTRIBUTE_NAME )                                     01550000
                                                                        01560000
      ,2 E09 TYPE EVENT                                                 01570000
             INIT( ATTRIBUTE_CHARACTERS )                               01580000
                                                                        01590000
      ,2 E10 TYPE EVENT_WITH_NAMESPACE                                  01600000
             INIT( END_OF_ELEMENT )                                     01610000
                                                                        01620000
      ,2 E11 TYPE EVENT_WITHOUT_DATA                                    01630000
             INIT( START_OF_CDATA )                                     01640000
                                                                        01650000
      ,2 E12 TYPE EVENT_WITHOUT_DATA                                    01660000
             INIT( END_OF_CDATA )                                       01670000
                                                                        01680000
      ,2 E13 TYPE EVENT_WITH_FLAG                                       01690000
             INIT( CONTENT_CHARACTERS )                                 01700000
                                                                        01710000
      ,2 E14 TYPE EVENT_PI                                              01720000
             INIT( PROCESSING_INSTRUCTION )                             01730000
                                                                        01740000
      ,2 E15 TYPE EVENT                                                 01750000
             INIT( COMMENT )                                            01760000
                                                                        01770000
      ,2 E16 TYPE EVENT_NAMESPACE_DCL                                   01780000
             INIT( NAMESPACE_DECLARE )                                  01790000
                                                                        01800000
      ,2 E17 TYPE EVENT_END_OF_INPUT                                    01810000
             INIT( END_OF_INPUT )                                       01820000
                                                                        01830000
      ,2 E18 TYPE EVENT                                                 01840000
             INIT( UNRESOLVED_REFERENCE )                               01850000
                                                                        01860000
      ,2 E19 TYPE EVENT_EXCEPTION                                       01870000
             INIT( EXCEPTION )                                          01880000
      ;                                                                 01890000
1/********************************************************************/ 01900000
 /*  BUILTIN FUNCTIONS                                               */ 01910000
 /********************************************************************/ 01920000
  DCL (NULL,                                                            01930000
       VERIFY) BUILTIN;                                                 01931000
 /********************************************************************/ 01940000
 /* DB2/SQL SQLCA                                                    */ 01950000
 /********************************************************************/ 01960000
0 EXEC SQL                                                              01970000
    INCLUDE SQLCA                                                       01980000
    ;                                                                   01990000
1/********************************************************************/ 02000000
 /* DB2 TABLE STRUCTURES                                             */ 02010000
 /********************************************************************/ 02020000
0DCL 1 TB_RCBV693,                                                      02030000
      %INCLUDE (RCB693S);;                                              02040000
0DCL 1 TB_RCBV694,                                                      02070000
      %INCLUDE (RCB694S);;                                              02080000
0DCL 1 TB_RCBV696,                                                      02090000
      %INCLUDE (RCB696S);;                                              02100000
 /********************************************************************/ 02110000
 /*  PTR & TEMP VARIABLE DECLARATION                                */  02120000
 /********************************************************************/ 02130000
  DCL TOKEN             CHAR(8);                                        02140000
  DCL COUNTRY_PTR       PTR;                                            02150000
  DCL PARSER_INPUT_PTR  PTR;                                            02160000
  DCL PTR_MQDATA        PTR;                                            02170000
  DCL PARSER_RETURN_AREA_PTR PTR;                                       02180000
  DCL PARSER_INPUT_AREA_PTR PTR;                                        02190000
  DCL PTR_DATE_AREA     PTR;                                            02200000
  DCL PTR_INT_AREA      PTR;                                            02220000
  DCL PTR_ERROR_RETURN  PTR;                                            02230000
  DCL PTR_CCSID         PTR;                                            02240000
  DCL PTR_SEO           POINTER;                                        02241000
  DCL PTR_SEO_1         POINTER;                                        02242000
                                                                        02250000
  DCL DUMMY             FIXED BIN(31);               /* CEDS00000812 */ 02251015
  DCL LEN_INSTALL       FIXED BIN(31) INIT(03);                         02260000
  DCL LEN_PRODTYP       FIXED BIN(31) INIT(04);                         02270000
  DCL LEN_MDLNUMBR      FIXED BIN(31) INIT(03);                         02280000
  DCL LEN_PRODREV       FIXED BIN(31) INIT(02);                         02290000
  DCL LEN_MACHCAT       FIXED BIN(31) INIT(01);                         02300000
  DCL LEN_VENDNAM       FIXED BIN(31) INIT(120);                        02310000
  DCL LEN_CEPRODK       FIXED BIN(31) INIT(01);                         02320000
  DCL LEN_PRODSUP       FIXED BIN(31) INIT(03);                         02330000
  DCL LEN_RETAIN        FIXED BIN(31) INIT(01);                         02340000
  DCL LEN_LASTCD        FIXED BIN(31) INIT(10);                         02350000
  DCL LEN_AVAILD        FIXED BIN(31) INIT(10);                         02360000
  DCL LEN_EOSERD        FIXED BIN(31) INIT(10);                         02370000
  DCL LEN_CPRODTYP      FIXED BIN(31) INIT(04);                         02380000
  DCL LEN_CMDLNUMBR     FIXED BIN(31) INIT(03);                         02390000
  DCL LEN_CEACMTRY      FIXED BIN(31) INIT(04);                         02400000
  DCL LEN_CAVAILD       FIXED BIN(31) INIT(10);                         02410000
  DCL LEN_CEOSD         FIXED BIN(31) INIT(10);                         02420000
  DCL LEN_CLASTCD       FIXED BIN(31) INIT(10);                         02430000
  DCL LEN_LPRODTYP      FIXED BIN(31) INIT(04);                         02440000
  DCL LEN_LMDLNUMBR     FIXED BIN(31) INIT(03);                         02450000
  DCL LEN_LLANGID       FIXED BIN(31) INIT(02);                         02460000
  DCL LEN_LLASTCD       FIXED BIN(31) INIT(10);                         02470000
  DCL END_OF_SERVICE_TEMP  CHAR(10);                                    02480000
  DCL EACM_COUNTRY_TEMP    CHAR(04);                                    02481000
                                                                        02490000
  DCL XMLDOCUMENT BASED(PTR_MQDATA) CHAR(MQ_MSG_LENGTH);                02500000
  DCL MQ_CCSID    BASED(PTR_CCSID)  FIXED BIN(31);                      02510000
  DCL IC_CNTRY(300) BASED(COUNTRY_PTR) CHAR(4);                         02520000
  DCL 1 PARSER_INPUT_AREA BASED(PARSER_INPUT_AREA_PTR),                 02540000
        %INCLUDE (RCBBE6S);;                                            02550000
  DCL 1 PARSER_RETURN_AREA BASED(PARSER_RETURN_AREA_PTR),               02570000
        %INCLUDE (RCBBE4S);;                                            02580000
                                                                        02590000
  DCL 1 PARM_INT_AREA BASED(PTR_INT_AREA),      /*   INTERFACE AREA   */02600000
        %INCLUDE (RCBZ01S);;                                            02610000
                                                                        02620000
  DCL 1 ERROR_CODE_DET BASED (PTR_ERROR_RETURN),/* ERROR RETURN AREA  */02630000
          5 PTR_ERROR                    PTR,                           02640000
          5 ERR_TYPE                     CHAR(8),                       02650000
          5 CALL_ID                      CHAR(4);                       02660000
                                                                        02670000
  DCL 1 DATE_AREA,                              /*      DATE AREA     */02680000
        %INCLUDE (RCBZ03S);;                                            02690000
                                                                        02709000
 /*********************************************************************/02710000
 /*                  S T A R T   P R O C E S S I N G                  */02720000
 /*********************************************************************/02730000
  CALL RCBXC5M_INIT_PROGRAM;                                            02740000
                                                                        02750000
  CNT_AVAIL_ELEMENT1 = SEO_UPD_UCOUNT_DET.CNT_AVAIL_ELEMENT_SEO;        02760000
  CNT_LANG_ELEMENT1  = SEO_UPD_UCOUNT_DET.CNT_LANG_ELEMENT_SEO;         02770000
                                                                        02780000
  CALL PLISAXC( EVENTHANDLER,                                           02790000
                ADDR(TOKEN),                                            02800000
                ADDRDATA(XMLDOCUMENT),                                  02810000
                MQ_MSG_LENGTH,                                          02840000
                MQ_CCSID);                                              02850000
                                                                        02860000
  CALL RCBXC5M_TYPE_VALIDATION;                                         02870000
                                                                        02871000
  IF(VALID_FLAG) THEN                                                   02872000
  DO;                                                                   02873000
  EXEC SQL                                                              02880000
  SELECT MACHINE_CATEGORY,                                              02881000
      CE_PRODUCT_KEY,                                                   02883000
      PROD_SUP_COD,                                                     02884000
      INSTALL,                                                          02885000
      RETAIN_FLAG                                                       02886000
  INTO                                                                  02887000
      :SEO_UP.MACHINE_CATEGORY,                                         02888000
      :SEO_UP.CE_PRODUCT_KEY,                                           02889000
      :SEO_UP.PROD_SUP_COD,                                             02889100
      :SEO_UP.INSTALL,                                                  02889200
      :SEO_UP.RETAIN_FLAG                                               02889300
  FROM  RCBT0693_TYPE_MOD_WW_LVL                                        02889400
  WHERE PRODUCT_TYPE       = :SEO_UP.PARENT_PRODTYPE                    02889500
  AND   MODEL_NUMBER       = :SEO_UP.PARENT_MODEL                       02889600
         ;                                                              02889700
  SELECT(SQLCA.SQLCODE);                                                02890900
   WHEN(0)                                                              02891000
    DO;                                                                 02891100
                                                                        02891200
    PARENT_MODEL_FLAG_693 = TRUE;                                       02891500
                                                                        02891600
    SEO_UP1.MACHINE_CATEGORY = ' ';                                     02891700
    ELE_CONVERT    = 0;                                                 02892400
    PTR_SEO        = ADDR(SEO_UP.MACHINE_CATEGORY);                     02892500
    PTR_SEO_1      = ADDR(SEO_UP1.MACHINE_CATEGORY);                    02892700
    ELE_CONVERT    = MEMCONVERT (PTR_SEO_1,                             02892900
                                1,                                      02893000
                                1208,                                   02893100
                                PTR_SEO,                                02893200
                                1,                                      02893300
                                500);                                   02893400
                                                                        02893600
    SEO_UP1.CE_PRODUCT_KEY = ' ';                                       02893700
    ELE_CONVERT    = 0;                                                 02893800
    PTR_SEO        = ADDR(SEO_UP.CE_PRODUCT_KEY);                       02893900
    PTR_SEO_1      = ADDR(SEO_UP1.CE_PRODUCT_KEY);                      02894000
    ELE_CONVERT    = MEMCONVERT (PTR_SEO_1,                             02894100
                                1,                                      02894200
                                1208,                                   02894300
                                PTR_SEO,                                02894400
                                1,                                      02894500
                                500);                                   02894600
                                                                        02894700
    SEO_UP1.PROD_SUP_COD = ' ';                                         02894800
    ELE_CONVERT    = 0;                                                 02894900
    PTR_SEO        = ADDR(SEO_UP.PROD_SUP_COD);                         02895000
    PTR_SEO_1      = ADDR(SEO_UP1.PROD_SUP_COD);                        02895100
    ELE_CONVERT    = MEMCONVERT (PTR_SEO_1,                             02895200
                                3,                                      02895300
                                1208,                                   02895400
                                PTR_SEO,                                02895500
                                3,                                      02895600
                                500);                                   02895700
                                                                        02895800
    SEO_UP1.INSTALL = ' ';                                              02895900
    ELE_CONVERT    = 0;                                                 02896000
    PTR_SEO        = ADDR(SEO_UP.INSTALL);                              02896100
    PTR_SEO_1      = ADDR(SEO_UP1.INSTALL);                             02896200
    ELE_CONVERT    = MEMCONVERT (PTR_SEO_1,                             02896400
                                3,                                      02896500
                                1208,                                   02896600
                                PTR_SEO,                                02896700
                                3,                                      02896800
                                500);                                   02896900
                                                                        02897000
    SEO_UP1.RETAIN_FLAG = ' ';                                          02897100
    ELE_CONVERT    = 0;                                                 02897200
    PTR_SEO        = ADDR(SEO_UP.RETAIN_FLAG);                          02897300
    PTR_SEO_1      = ADDR(SEO_UP1.RETAIN_FLAG);                         02897400
    ELE_CONVERT    = MEMCONVERT (PTR_SEO_1,                             02897500
                                1,                                      02897600
                                1208,                                   02897700
                                PTR_SEO,                                02897800
                                1,                                      02897900
                                500);                                   02898000
   END;                                                                 02898300
                                                                        02898400
   WHEN(100)                                                            02898500
        DO;                                                             02898600
         CALL RCBXC5M_MSG('0327');                                      02899100
         PARENT_MODEL_FLAG_693 = FALSE;                                 02899200
        END;                                                            02899300
                                                                        02899400
   OTHERWISE                                                            02899500
    DO;                                                                 02899600
      ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                           02899700
      ERROR_CODE_DET.ERR_TYPE  ='DB2';                                  02899800
      ERROR_CODE_DET.CALL_ID   ='#006';                                 02899900
      SIGNAL ERROR;                                                     02900000
    END;                                                                02900100
  END;                                                                  02900200
  END;         /* SELECT */                                             02900300
                                                                        02900400
                                                                        02900500
  IF(PARENT_MODEL_FLAG_693) THEN                                        02900600
  DO;                                                                   02900700
                                                                        02900800
  /******** EBCDIC BLANK IS CHANGED WITH UNICODE SPACE X'20' **********/02930000
                                                                        02940000
  SEO_UP1.INSTALL             = RCBXC5M_TSN(SEO_UP1.INSTALL,            02950000
                                         LEN_INSTALL);                  02960000
  SEO_UP1.PRODUCT_TYPE        = RCBXC5M_TSN(SEO_UP1.PRODUCT_TYPE,       02970000
                                         LEN_PRODTYP);                  02980000
  SEO_UP1.MODEL_NUMBER        = RCBXC5M_TSN(SEO_UP1.MODEL_NUMBER,       02990000
                                         LEN_MDLNUMBR);                 03000000
  SEO_UP1.PROD_REVENUE_DIV    = RCBXC5M_TSN(SEO_UP1.PROD_REVENUE_DIV,   03010000
                                         LEN_PRODREV);                  03020000
  SEO_UP1.MACHINE_CATEGORY    = RCBXC5M_TSN(SEO_UP1.MACHINE_CATEGORY,   03030000
                                         LEN_MACHCAT);                  03040000
  SEO_UP1.VENDOR_NAME         = RCBXC5M_TSN(SEO_UP1.VENDOR_NAME,        03050000
                                     LEN_VENDNAM);                      03060000
  SEO_UP1.CE_PRODUCT_KEY      = RCBXC5M_TSN(SEO_UP1.CE_PRODUCT_KEY,     03070000
                                         LEN_CEPRODK);                  03080000
  SEO_UP1.PROD_SUP_COD        = RCBXC5M_TSN(SEO_UP1.PROD_SUP_COD,       03090000
                                         LEN_PRODSUP);                  03100000
  SEO_UP1.RETAIN_FLAG         = RCBXC5M_TSN(SEO_UP1.RETAIN_FLAG,        03110000
                                         LEN_RETAIN);                   03120000
  SEO_UP1.LAST_CHANGE_DATE    = RCBXC5M_TSN(SEO_UP1.LAST_CHANGE_DATE,   03130000
                                         LEN_LASTCD);                   03140000
  SEO_UP1.AVAILABILITY_DATE   = RCBXC5M_TSN(SEO_UP1.AVAILABILITY_DATE   03150000
                                        ,LEN_AVAILD);                   03160000
  SEO_UP1.END_OF_SERVICE_DATE =                                         03170000
                  RCBXC5M_TSN(SEO_UP1.END_OF_SERVICE_DATE,LEN_EOSERD);  03180000
                                                                        03190000
  IF (VALID_FLAG) THEN                                                  03210000
  DO;                                                                   03220000
    CALL RCBXC5M_WW_VALIDATION;                                         03230000
    IF (WW_ELEMENT_FLAG) THEN                                           03252000
    DO;                                                                 03260000
      RCB693S_PTR  = ADDR(SEO_UP);                                      03270000
      RCB693S_PTR1 = ADDR(SEO_UP1);                                     03300000
      CALL RCBF89M (RCB693S_PTR,RCB693S_PTR1,PTR_RET_AREA_BB,           03310000
                    PTR_INT_AREA);                                      03320000
                                                                        03340000
      SELECT (PARM_RET_AREA_BB.RETURN_CODE);                            03350000
       WHEN (0)                                                         03360000
       DO;                                                              03370000
         PARSER_RETURN_AREA.T693_DETAILS.T693_INSERTS =                 03380000
                  PARSER_RETURN_AREA.T693_DETAILS.T693_INSERTS + 1;     03390000
         CHECK_INS_T693 = TRUE;            /* SET FLAG TO TRUE */       03400000
       END;                                                             03410000
       WHEN (4)                                                         03420000
       DO;                                                              03430000
         PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES =                 03440000
                  PARSER_RETURN_AREA.T693_DETAILS.T693_UPDATES + 1;     03450000
         CHECK_INS_T693 = TRUE;            /* SET FLAG TO TRUE */       03460000
       END;                                                             03470000
       OTHERWISE                                                        03480000
       DO;                                                              03490000
         ERROR_CODE_DET.PTR_ERROR = ADDR(PARM_RET_AREA_BB.RETURN_SQL);  03500000
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               03510000
         ERROR_CODE_DET.CALL_ID   ='#001';                              03520000
         SIGNAL ERROR;                                                  03530000
       END;            /* OTHERWISE */                                  03540000
      END;             /* SELECT    */                                  03550000
    END;               /* IF WW_ELEMENT_FLAG */                         03560000
                                                                        03561000
  IF (CHECK_INS_T693) THEN                                              03570000
  DO;                                                                   03580000
    IF((WW_ELEMENT_FLAG) & (CNT_AVAIL_ELEMENT_SEO ¬=0))                 03590000
    THEN DO;                                                            03600000
                                                                        03610000
     IF (SEO_UPD_UCOUNT_DET.CNT_CTRY_REQ_SEO ¬= 0) THEN                 03620000
     DO;                                                                03630000
                                                                        03640000
       DO I = 1 TO CNT_AVAIL_ELEMENT_SEO BY 1;                          03650000
                                                                        03660000
         IF ((COUNTRY_LIST(I).EACM_COUNTRY_FC ¬= ''    )  &             03670000
             (COUNTRY_LIST(I).EACM_COUNTRY_FC >= '1000')  &             03680000
             (COUNTRY_LIST(I).EACM_COUNTRY_FC <= '9999')) THEN          03690000
         DO;                                                            03700000
           CALL RCBXC5M_CTRY_VALIDATION;                                03710000
                                                                        03720000
           IF(CTRY_ELEMENT_FLAG) THEN                                   03730000
           DO;                                                          03740000
           EACM_COUNTRY_TEMP = COUNTRY_LIST(I).EACM_COUNTRY_FC;         03740100
            EXEC SQL                                                    03741000
             SELECT                                                     03742000
               END_OF_SERVICE_DATE                                      03743000
             INTO                                                       03748000
               :END_OF_SERVICE_TEMP                                     03749000
             FROM  RCBT0694_TYPE_MOD_CTRY_LVL                           03749500
             WHERE PRODUCT_TYPE       =:SEO_UP.PARENT_PRODTYPE          03749600
              AND  MODEL_NUMBER       =:SEO_UP.PARENT_MODEL             03749700
              AND  EACM_COUNTRY_FC    =:EACM_COUNTRY_TEMP;              03749800
                                                                        03749900
             SELECT(SQLCA.SQLCODE);                                     03750000
              WHEN(0)                                                   03750100
               DO;                                                      03750200
               COUNTRY_LIST(I).END_OF_SERVICE_DATE=END_OF_SERVICE_TEMP; 03750400
               ELE_CONVERT        = 0;                                  03790000
               PTR_SEO_ESDA       =                                     03800000
                            ADDR(COUNTRY_LIST1(I).END_OF_SERVICE_DATE); 03810000
               PTR_SEO_ESDB       =                                     03820000
                            ADDR(COUNTRY_LIST(I).END_OF_SERVICE_DATE);  03830000
               ELE_CONVERT        = MEMCONVERT (PTR_SEO_ESDA,           03840000
                                                10,                     03850000
                                                1208,                   03860000
                                                PTR_SEO_ESDB,           03870000
                                                10,                     03880000
                                                500);                   03890000
              END;                                                      03900000
              WHEN(100)                                                 03900100
              DO;                                                       03900200
               COUNTRY_LIST(I).END_OF_SERVICE_DATE='';                  03900400
               ELE_CONVERT        = 0;                                  03900500
               PTR_SEO_ESDA       =                                     03900600
                            ADDR(COUNTRY_LIST1(I).END_OF_SERVICE_DATE); 03900700
               PTR_SEO_ESDB       =                                     03900800
                            ADDR(COUNTRY_LIST(I).END_OF_SERVICE_DATE);  03900900
               ELE_CONVERT        = MEMCONVERT (PTR_SEO_ESDA,           03901000
                                                10,                     03901100
                                                1208,                   03901200
                                                PTR_SEO_ESDB,           03901300
                                                10,                     03901400
                                                500);                   03901500
              END;                                                      03901700
                                                                        03901800
             OTHERWISE                                                  03901900
              DO;                                                       03902000
               ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                  03903000
               ERROR_CODE_DET.ERR_TYPE  ='DB2';                         03904000
               ERROR_CODE_DET.CALL_ID   ='#007';                        03905000
               SIGNAL ERROR;                                            03906000
              END;                                                      03907000
            END;       /* SELECT */                                     03908000
                                                                        03910000
             CALL RCBXC5M_DATE_VALIDATION;                              03920000
                                                                        03930000
             IF(VALID_CTRY) THEN                                        03940000
             DO;                                                        03950000
               COUNTRY_LIST_TEMP = '';                                  03960000
               COUNTRY_LIST_TEMP = STRING(COUNTRY_LIST(I));             03970000
                                                                        03980000
  /******** EBCDIC BLANK IS CHANGED WITH UNICODE SPACE X'20' **********/03990000
               COUNTRY_LIST1(I).PRODUCT_TYPE = RCBXC5M_TSN(             04000000
                        COUNTRY_LIST1(I).PRODUCT_TYPE,LEN_CPRODTYP);    04010000
               COUNTRY_LIST1(I).MODEL_NUMBER = RCBXC5M_TSN(             04020000
                        COUNTRY_LIST1(I).MODEL_NUMBER,LEN_CMDLNUMBR);   04030000
               COUNTRY_LIST1(I).EACM_COUNTRY_FC = RCBXC5M_TSN(          04040000
                        COUNTRY_LIST1(I).EACM_COUNTRY_FC,LEN_CEACMTRY); 04050000
               COUNTRY_LIST1(I).AVAILABILITY_DATE = RCBXC5M_TSN(        04060000
                        COUNTRY_LIST1(I).AVAILABILITY_DATE,LEN_CAVAILD);04070000
               COUNTRY_LIST1(I).END_OF_SERVICE_DATE = RCBXC5M_TSN(      04080000
                        COUNTRY_LIST1(I).END_OF_SERVICE_DATE,LEN_CEOSD);04090000
               COUNTRY_LIST1(I).LAST_CHANGE_DATE = RCBXC5M_TSN(         04100000
                        COUNTRY_LIST1(I).LAST_CHANGE_DATE,LEN_CLASTCD); 04110000
                                                                        04120000
               COUNTRY_LIST_TEMP1 = '';                                 04130000
               COUNTRY_LIST_TEMP1= STRING(COUNTRY_LIST1(I));            04140000
               RCB694S_PTR1 = ADDR(COUNTRY_LIST_TEMP1);                 04141000
                                                                        04142000
                                                                        04143000
               RCB694S_PTR = ADDR(COUNTRY_LIST_TEMP);                   04144000
                                                                        04170000
               CALL RCBF90M (RCB694S_PTR,RCB694S_PTR1,PTR_RET_AREA_BB,  04220000
                             PTR_INT_AREA);                             04230000
                                                                        04250000
               SELECT (PARM_RET_AREA_BB.RETURN_CODE);                   04260000
                WHEN (0)                                                04270000
                  PARSER_RETURN_AREA.T694_DETAILS.T694_INSERTS =        04280000
                       PARSER_RETURN_AREA.T694_DETAILS.T694_INSERTS + 1;04290000
                WHEN (4)                                                04300000
                  PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES =        04310000
                       PARSER_RETURN_AREA.T694_DETAILS.T694_UPDATES + 1;04320000
                                                                        04330000
                OTHERWISE                                               04340000
                DO;                                                     04350000
                  ERROR_CODE_DET.PTR_ERROR =                            04360000
                                      ADDR(PARM_RET_AREA_BB.RETURN_SQL);04370000
                  ERROR_CODE_DET.ERR_TYPE  ='DB2';                      04380000
                  ERROR_CODE_DET.CALL_ID   ='#002';                     04390000
                  SIGNAL ERROR;                                         04400000
                END;               /* OTHERWISE */                      04410000
               END;                /* SELECT    */                      04420000
             END;                  /* IF VALID COUNTRY     */           04430000
           END;                    /* IF CTRY_ELEMENT_FLAG */           04440000
         END;                      /* COUNTRY_LIST(I).EACM_COUNTRY_FC*/ 04450000
         ELSE DO;                                                       04460000
                VALID_CTRY = FALSE;                                     04470000
                CALL RCBXC5M_MSG('0296');                               04480000
         END;                                                           04490000
       END;               /* DO */                                      04500000
     END;                 /* IF  SEO_UPD_UCOUNT_DET.CNT_CTRY_REQ_SEO */ 04510000
     ELSE                                                               04520000
     DO;                                                                04530000
       CALL RCBXC5M_MSG('0297');                                        04540000
       CTRY_ELEMENT_FLAG = FALSE;                                       04550000
       DO L = 1 TO CNT_AVAIL_ELEMENT_SEO BY 1;                          04560000
          SEO_UPD_DETAILS.LIST_OF_CTRY_NOT_REQ_SEO(L) =                 04570000
                               COUNTRY_LIST(I).EACM_COUNTRY_FC;         04580000
          I = I - 1;                                                    04590000
       END;                                                             04600000
     END;                                                               04610000
    END;                /* IF WW_ELEMENT_FLAG & CNT_AVAIL_ELEMENT_SEO */04620000
                                                                        04630000
    IF (SEO_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ_SEO ¬= 0) THEN        04640000
    DO;                                                                 04650000
      DO L = 1 TO K BY 1;                                               04660000
         SEO_UPD_DETAILS.LIST_OF_CTRY_NOT_REQ_SEO(L) =                  04670000
                                               SKIP_CTRY_ARRAY(K);      04671000
         K = K - 1;                                                     04680000
      END;                                                              04690000
    END;                                                                04700000
                                                                        04710000
    IF (SEO_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ_SEO ¬= 0) &           04720000
       (CNT_AVAIL_ELEMENT_SEO ¬= 0)                         &           04730000
       (SEO_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ_SEO =                 04740000
                                          CNT_AVAIL_ELEMENT_SEO)        04741000
    THEN                                                                04750000
        CALL RCBXC5M_MSG('0300');                                       04760000
                                                                        04770000
  IF WW_ELEMENT_FLAG THEN                                               04780000
  DO;                                                                   04790000
    DO J = 1 TO SEO_UPD_UCOUNT_DET.CNT_LANG_ELEMENT_SEO;                04800000
                                                                        04810000
      CALL RCBXC5M_LANG_VALIDATION;                                     04820000
                                                                        04830000
      IF (LANG_ELEMENT_FLAG) THEN                                       04840000
      DO;                                                               04850000
                                                                        04860000
  /******** EBCDIC BLANK IS CHANGED WITH UNICODE SPACE X'20' **********/04900000
        LANG_LIST(J).PRODUCT_TYPE =                                     04910000
         RCBXC5M_TSN(LANG_LIST(J).PRODUCT_TYPE,LEN_LPRODTYP);           04920000
        LANG_LIST(J).MODEL_NUMBER =                                     04930000
         RCBXC5M_TSN(LANG_LIST(J).MODEL_NUMBER,LEN_LMDLNUMBR);          04940000
        LANG_LIST(J).LANG_ID =                                          04950000
         RCBXC5M_TSN(LANG_LIST(J).LANG_ID,LEN_LLANGID);                 04960000
        LANG_LIST(J).LAST_CHANGE_DATE =                                 04970000
               RCBXC5M_TSN(LANG_LIST(J).LAST_CHANGE_DATE,               04980000
                                         LEN_LLASTCD);                  04990000
        RCB696S_PTR1 = ADDR(LANG_LIST(J));                              05010000
                                                                        05020000
        RCB696S_PTR  = ADDR(LANGUAGE_LIST(J));                          05030000
                                                                        05040000
                                                                        05051000
        CALL RCBF92M (RCB696S_PTR,RCB696S_PTR1,PTR_RET_AREA_BB,         05060000
                      PTR_INT_AREA);                                    05070000
                                                                        05090000
        SELECT (PARM_RET_AREA_BB.RETURN_CODE);                          05100000
         WHEN (0)                                                       05110000
           PARSER_RETURN_AREA.T696_DETAILS.T696_INSERTS =               05120000
                       PARSER_RETURN_AREA.T696_DETAILS.T696_INSERTS + 1;05130000
         WHEN (4)                                                       05140000
           PARSER_RETURN_AREA.T696_DETAILS.T696_UPDATES =               05150000
                       PARSER_RETURN_AREA.T696_DETAILS.T696_UPDATES + 1;05160000
         OTHERWISE                                                      05170000
         DO;                                                            05180000
           ERROR_CODE_DET.PTR_ERROR = ADDR(PARM_RET_AREA_BB.RETURN_SQL);05190000
           ERROR_CODE_DET.ERR_TYPE  ='DB2';                             05200000
           ERROR_CODE_DET.CALL_ID   ='#003';                            05210000
           SIGNAL ERROR;                                                05220000
         END;                                                           05230000
        END;                 /* SELECT */                               05240000
      END;                   /* IF LANG_ELEMENT_FLAG */                 05250000
    END;                     /* DO     */                               05260000
  END;                       /* IF WW_ELEMENT_FLAG   */                 05270000
 END;                        /* IF     */                               05280000
 END;                        /* IF CHECK_INS_T693    */                 05281000
                                                                        05290000
    CALL RCBXC5M_END_PROGRAM;                                           05300000
                                                                        05310000
  END;                       /* IF PARENT_MODEL_FLAG_693*/              05320000
                                                                        05330000
1/********************************************************************/ 05340000
 /*                                                                  */ 05350000
 /* MODULE NAME      : RCBXC5M_END_PROGRAM                           */ 05360000
 /*                                                                  */ 05370000
 /* DESCRIPTION      : CLOSING RCBXC5M PROGRAM                       */ 05380000
 /*                                                                  */ 05390000
 /********************************************************************/ 05400000
 RCBXC5M_END_PROGRAM: PROC;                                             05410000
                                                                        05420000
 PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'N';                       05430000
                                                                        05440000
 IF (SEO_UPD_DETAILS.NO_MSG_SKIP_CTRY_NOT_REQ_SEO ¬= '1') THEN          05450000
 DO;                                                                    05460000
    IF ((T693_DETAILS.T693_INSERTS = 0) &                               05470000
        (T693_DETAILS.T693_UPDATES = 0) &                               05480000
        (T694_DETAILS.T694_INSERTS = 0) &                               05490000
        (T694_DETAILS.T694_UPDATES = 0) &                               05500000
        (T696_DETAILS.T696_INSERTS = 0) &                               05510000
        (T696_DETAILS.T696_UPDATES = 0)) THEN                           05520000
        DO;                                                             05530000
          PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'Y';              05540000
          CALL RCBXC5M_MSG('0306');                                     05550000
       END;                                                             05560000
 END;                                                                   05570000
 FREE COUNTRY_LIST;                                                     05580000
 FREE LANGUAGE_LIST;                                                    05590000
 FREE SKIP_CTRY_ARRAY;                                                  05600000
 FREE LANG_LIST;                                                        05610000
 FREE COUNTRY_LIST1;                                                    05620000
                                                                        05630000
 END RCBXC5M_END_PROGRAM;                                               05640000
1/********************************************************************/ 05650000
 /*                                                                  */ 05660000
 /* MODULE NAME      : RCBXC5M_TYPE_VALIDATION                       */ 05670000
 /*                                                                  */ 05680000
 /* DESCRIPTION      : VALIDATION OF DATA                            */ 05690000
 /*                                                                  */ 05700000
 /********************************************************************/ 05710000
 RCBXC5M_TYPE_VALIDATION: PROC;                                         05720000
                                                                        05730000
  PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'N';                      05740000
  VALID_FLAG = TRUE;                                                    05750000
                                                                        05760000
  IF ((SEO_UP.PRODUCT_TYPE    =' ')                                     05770000
   |  (SEO_UP.MODEL_NUMBER    =' ')                                     05771000
   |  (SEO_UP.PARENT_PRODTYPE =' ')                                     05771100
   |  (SEO_UP.PARENT_MODEL    =' ')) THEN                               05772000
  DO;                                                                   05780000
     VALID_FLAG = FALSE;                                                05790000
     PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'Y';                   05800000
     CALL RCBXC5M_MSG('0292');                                          05810000
  END;                                                                  05820000
                                                                        05830000
  IF (VALID_FLAG) THEN                                                  05840000
  DO;                                                                   05840100
                                                                        05845000
    IF ((VERIFY(SEO_UP.PRODUCT_TYPE,ALPHANUM)¬= 0) |                    05860000
       (VERIFY(SEO_UP.MODEL_NUMBER,ALPHANUM)¬= 0) |                     05861000
       (VERIFY(SEO_UP.PARENT_PRODTYPE,ALPHANUM)¬= 0) |                  05863000
       (VERIFY(SEO_UP.PARENT_MODEL,ALPHANUM)¬= 0)) THEN                 05870000
    DO;                                                                 05880400
        VALID_FLAG = FALSE;                                             05890000
        PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'Y';                05900000
        CALL RCBXC5M_MSG('0293');                                       05910000
    END;                                                                05920000
                                                                        05920100
    END;                                                                05920300
                                                                        05920400
                                                                        05931000
  END RCBXC5M_TYPE_VALIDATION;                                          05940000
1/********************************************************************/ 05950000
 /*                                                                  */ 05960000
 /* MODULE NAME      : RCBXC5M_WW_VALIDATION                         */ 05970000
 /*                                                                  */ 05980000
 /* DESCRIPTION      : VALIDATION OF WW DATA                         */ 05990000
 /*                                                                  */ 06000000
 /********************************************************************/ 06010000
 RCBXC5M_WW_VALIDATION: PROC;                                           06020000
                                                                        06030000
 PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION  = 'N';                      06040000
 T693_INSERT_FLAG = FALSE;                                              06050000
 T693_UPDATE_FLAG = FALSE;                                              06060000
 CHECK_INS_T693 = FALSE;    /* SET FLAG TO FALSE  */                    06070000
                                                                        06080000
 CALL RCBXC5M_SELECT_T693;                                              06090000
                                                                        06100000
  IF (T693_INSERT_FLAG) THEN                                            06110000
  DO;                                                                   06120000
    IF SEO_UP.PROD_REVENUE_DIV   ¬= '' THEN                             06130000
    DO;                                                                 06190000
      WW_ELEMENT_FLAG = TRUE;                                           06200000
    END;                                                                06210000
    ELSE                                                                06220000
    DO;                                                                 06230000
      CALL RCBXC5M_MSG('0294');                                         06240000
      WW_ELEMENT_FLAG = FALSE;                                          06250000
                                                                        06260000
      IF CNT_AVAIL_ELEMENT_SEO > 0 THEN                                 06270000
      DO;                                                               06280000
        CTRY_ELEMENT_FLAG = FALSE;                                      06300000
        SEO_UPD_DETAILS.NO_REJ_CTRY_WW_DATA_NOT_REG_SEO =               06320000
                                           CNT_AVAIL_ELEMENT_SEO;       06330000
      END;                                                              06340000
      IF CNT_LANG_ELEMENT1 > 0 THEN                                     06350000
      DO;                                                               06360000
        LANG_ELEMENT_FLAG = FALSE;                                      06380000
        SEO_UPD_DETAILS.NO_REJ_LANG_WW_DATA_NOT_REG_SEO =               06390000
                                               CNT_LANG_ELEMENT1;       06400000
      END;                                                              06410000
    END;                                                                06420000
  END;                                                                  06430000
                                                                        06700000
  IF (T693_UPDATE_FLAG) THEN                                            06701000
  DO;                                                                   06702000
    IF SEO_UP.PROD_REVENUE_DIV   ¬= '' THEN                             06703000
        WW_ELEMENT_FLAG = TRUE;                                         06709000
    ELSE                                                                06709200
        WW_ELEMENT_FLAG = FALSE;                                        06710100
  END;                                                                  06710600
                                                                        06710800
 END RCBXC5M_WW_VALIDATION;                                             06711000
1/********************************************************************/ 06720000
 /*                                                                  */ 06730000
 /* MODULE NAME      : RCBXC5M_LANG_VALIDATION                       */ 06740000
 /*                                                                  */ 06750000
 /* DESCRIPTION      : VALIDATION OF LANGUAGE LIST DATA              */ 06760000
 /*                                                                  */ 06770000
 /********************************************************************/ 06780000
 RCBXC5M_LANG_VALIDATION: PROC;                                         06790000
                                                                        06800000
  T696_INSERT_FLAG = FALSE;                                             06810000
  T696_UPDATE_FLAG = FALSE;                                             06820000
                                                                        06830000
  IF (LANGUAGE_LIST(J).LANG_ID = '1') THEN                              06840000
   DO;                                                                  06850000
     LANG_ELEMENT_FLAG = TRUE;                                          06930000
   END;                                                                 06950000
                                                                        06951000
  ELSE                                                                  06960000
   DO;                                                                  06970000
    CALL RCBXC5M_SELECT_T696;                                           06980000
    IF(T696_UPDATE_FLAG) THEN                                           06990000
      LANG_ELEMENT_FLAG = FALSE;                                        07000000
                                                                        07001000
    ELSE                                                                07010000
     DO;                                                                07020000
      CALL RCBXC5M_MSG('0295');                                         07030000
      DCL PROD_DESC_TEMP  CHAR(23) INIT('MKTGNAME NOT IN ENGLISH');     07031000
      DCL PROD_DESC_TEMP1 CHAR(23);                                     07032000
      LANG_LIST(J).PROD_DESC = ' ';                                     07050000
                                                                        07060000
      ELE_CONVERT             = 0;                                      07070000
      PTR_SEO_ESDA            = ADDR(PROD_DESC_TEMP);                   07081000
      PTR_SEO_ESDB            = ADDR(PROD_DESC_TEMP1);                  07091000
      ELE_CONVERT             = MEMCONVERT (PTR_SEO_ESDB,               07100000
                                            23,                         07101000
                                            1208,                       07102000
                                            PTR_SEO_ESDA,               07103000
                                            23,                         07104000
                                            500);                       07105000
                                                                        07105100
      LANGUAGE_LIST(J).PROD_DESC = PROD_DESC_TEMP;                      07105200
      LANG_LIST(J).PROD_DESC     = PROD_DESC_TEMP1;                     07105300
                                                                        07107000
      LANGUAGE_LIST(J).LANG_ID   = ' ';                                 07107100
      LANG_LIST(J).LANG_ID       = (1)'20'X;                            07107200
      LANGUAGE_LIST(J).LANG_ID   = '1';                                 07108000
                                                                        07108100
      ELE_CONVERT                = 0;                                   07109000
      PTR_SEO_ESDA               = ADDR(LANG_LIST(J).LANG_ID);          07109100
      PTR_SEO_ESDB               = ADDR(LANGUAGE_LIST(J).LANG_ID);      07109200
      ELE_CONVERT                = MEMCONVERT (PTR_SEO_ESDA,            07109300
                                               1,                       07109400
                                               1208,                    07109500
                                               PTR_SEO_ESDB,            07109600
                                               1,                       07109700
                                               500);                    07109800
      LANG_ELEMENT_FLAG = TRUE;                                         07110000
     END;                                                               07120000
    END;                                                                07130000
                                                                        07131000
 END RCBXC5M_LANG_VALIDATION;                                           07140000
1/********************************************************************/ 07150000
 /*                                                                  */ 07160000
 /* MODULE NAME      : RCBXC5M_CTRY_VALIDATION                       */ 07170000
 /*                                                                  */ 07180000
 /* DESCRIPTION      : VALIDATION OF CTRY DEVIATED DATA              */ 07190000
 /*                                                                  */ 07200000
 /********************************************************************/ 07210000
 RCBXC5M_CTRY_VALIDATION: PROC;                                         07220000
                                                                        07230000
 DCL CTRY_EXIST    BIT(1) INIT('0');                                    07240000
                                                                        07250000
 DO T = 1 TO SEO_UPD_UCOUNT_DET.CNT_CTRY_REQ_SEO BY 1;                  07260000
    IF (COUNTRY_LIST(I).EACM_COUNTRY_FC = IC_CNTRY(T))                  07270000
    THEN                                                                07280000
           CTRY_EXIST = TRUE;                                           07290000
 END;                                                                   07300000
                                                                        07310000
 IF (CTRY_EXIST) THEN                                                   07320000
  CTRY_ELEMENT_FLAG = TRUE;                                             07330000
                                                                        07340000
 ELSE                                                                   07350000
 DO;                                                                    07360000
   CTRY_ELEMENT_FLAG = FALSE;                                           07370000
   K = K + 1;                                                           07380000
   SKIP_CTRY_ARRAY(K) = COUNTRY_LIST(I).EACM_COUNTRY_FC;                07390000
   CALL RCBXC5M_MSG('0299');                                            07400000
                                                                        07410000
     IF(SEO_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ_SEO =                 07440000
                                          CNT_AVAIL_ELEMENT_SEO)        07440100
     THEN                                                               07441000
        SEO_UPD_DETAILS.NO_MSG_SKIP_CTRY_NOT_REQ_SEO  = 1;              07450000
                                    /* NONE OF THE CTRY ARE REQUESTED*/ 07460000
 END;                                                                   07480000
                                                                        07490000
 END RCBXC5M_CTRY_VALIDATION;                                           07500000
1/********************************************************************/ 07510000
 /*                                                                  */ 07520000
 /* MODULE NAME      : RCBXC5M_DATE_VALIDATION                       */ 07530000
 /*                                                                  */ 07540000
 /* DESCRIPTION      : CALLS THE DATE VALIDATION ROUTINE             */ 07550000
 /*                                                                  */ 07560000
 /********************************************************************/ 07570000
 RCBXC5M_DATE_VALIDATION: PROC;                                         07580000
                                                                        07590000
 DCL AWRK_DATE CHAR(10);                                                07600000
 DCL EWRK_DATE CHAR(10);                                                07610000
                                                                        07620000
 AWRK_DATE = COUNTRY_LIST.AVAILABILITY_DATE(I);                         07630000
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      07640000
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      07650000
 DATE_AREA.WD_FUNCTION    = 'V';                                        07660000
 DATE_AREA.WD_PERIOD_TYPE = 'D';                                        07670000
 DATE_AREA.WD_PERIOD      = 0;                                          07680000
 DATE_AREA.WD_IN_DATE     = AWRK_DATE;                                  07690000
 PTR_DATE_AREA            = ADDR(DATE_AREA);                            07700000
                                                                        07710000
 CALL RCB004M (PTR_DATE_AREA);                                          07720000
                                                                        07730000
 IF DATE_AREA.WD_STATUS   ¬= ' ' THEN                                   07740000
 DO;                                                                    07750000
   VALID_CTRY = FALSE;                                                  07760000
   CALL RCBXC5M_MSG('0296');                                            07770000
 END;                                                                   07780000
 ELSE DO;                                                               07790000
   COUNTRY_LIST.AVAILABILITY_DATE(I) = WD_IN_DATE;                      07800000
   VALID_CTRY = TRUE;                                                   07810000
 END;                                                                   07820000
                                                                        07830000
                                                                        08080000
 END RCBXC5M_DATE_VALIDATION;                                           08090000
1/********************************************************************/ 08100000
 /*                                                                  */ 08110000
 /* MODULE NAME      : RCBXC5M_MSG                                   */ 08120000
 /*                                                                  */ 08130000
 /* DESCRIPTION      : CALLS THE MESSAGE ROUTINE AFTER FILLING       */ 08140000
 /*                    THE INPUT VARIABLES                           */ 08150000
 /*                                                                  */ 08160000
 /********************************************************************/ 08170000
 RCBXC5M_MSG: PROC (A_MSG_NR);                                          08180000
                                                                        08190000
 DCL A_MSG_NR          CHAR(04);                                        08200000
 PARM_INT_AREA.MSG_VAR_CODES = ' ';             /*RESET COMMON FIELDS*/ 08210000
                                                                        08220000
 SELECT (A_MSG_NR);                                                     08230000
 /* 0292: MANDATORY FIELDS CANNOT BE BLANK MESSAGE REJECTED */          08240000
    WHEN ('0292')                                                       08250000
    DO;                                                                 08260000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            08270000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        08280000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            08290000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     08300000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            08310000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = SEO_UP.PRODUCT_TYPE;             08320000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            08330000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = SEO_UP.MODEL_NUMBER;             08340000
      PARM_INT_AREA.MSG_VAR_CODE_9   = 'PPT';                           08340100
      PARM_INT_AREA.MSG_VAR_VALUE_9  = SEO_UP.PARENT_PRODTYPE;          08340200
      PARM_INT_AREA.MSG_VAR_CODE_10  = 'PMN';                           08341000
      PARM_INT_AREA.MSG_VAR_VALUE_10 = SEO_UP.PARENT_MODEL;             08342000
    END;                                                                08350000
                                                                        08360000
 /* 0293: FIELDS MUST BE FILLED WITH ALPHANUMERIC ONLY  */              08370000
    WHEN ('0293')                                                       08380000
    DO;                                                                 08390000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            08400000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        08410000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            08420000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     08430000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            08440000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = SEO_UP.PRODUCT_TYPE;             08450000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            08461000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = SEO_UP.MODEL_NUMBER;             08462000
      PARM_INT_AREA.MSG_VAR_CODE_9   = 'PMN';                           08463000
      PARM_INT_AREA.MSG_VAR_VALUE_9  = SEO_UP.PARENT_MODEL;             08470000
      PARM_INT_AREA.MSG_VAR_CODE_10  = 'PPT';                           08471000
      PARM_INT_AREA.MSG_VAR_VALUE_10 = SEO_UP.PARENT_PRODTYPE;          08472000
    END;                                                                08480000
                                                                        08490000
 /* 0294: T693 REGISTRATION FAILURE */                                  08500000
    WHEN ('0294')                                                       08510000
    DO;                                                                 08520000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            08530000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        08540000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            08550000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     08560000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            08570000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = SEO_UP.PRODUCT_TYPE;             08580000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            08590000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = SEO_UP.MODEL_NUMBER;             08600000
      PARM_INT_AREA.MSG_VAR_CODE_9   = 'DI';                            08650000
      PARM_INT_AREA.MSG_VAR_VALUE_9  = SEO_UP.PROD_REVENUE_DIV;         08660000
                                                                        08690000
    END;                                                                08700000
                                                                        08710000
 /* 0295: PRODUCT DESCRIPTION NOT AVAILABLE IN ENGLISH */               08720000
    WHEN ('0295')                                                       08730000
    DO;                                                                 08740000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            08750000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        08760000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            08770000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     08780000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'ND';                            08790000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = LANGUAGE_LIST(J).LANG_ID;        08800000
    END;                                                                08810000
                                                                        08820000
 /* 0296: COUNTRY DATA FAILED VALIDATION */                             08830000
    WHEN ('0296')                                                       08840000
    DO;                                                                 08850000
      SEO_UPD_DETAILS.NO_REJ_CTRY_SPEC_DATA_VIOL_SEO =                  08860000
                   SEO_UPD_DETAILS.NO_REJ_CTRY_SPEC_DATA_VIOL_SEO + 1;  08870000
                                                                        08880000
      PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                             08890000
      PARM_INT_AREA.MESSAGE_NUMBER  = A_MSG_NR;                         08900000
      PARM_INT_AREA.MSG_VAR_CODE_6  = 'EI';                             08910000
      PARM_INT_AREA.MSG_VAR_VALUE_6 = SEOENTITYID;                      08920000
      PARM_INT_AREA.MSG_VAR_CODE_7  = 'C5';                             08930000
      PARM_INT_AREA.MSG_VAR_VALUE_7 = COUNTRY_LIST(I).EACM_COUNTRY_FC;  08940000
      PARM_INT_AREA.MSG_VAR_CODE_8  = 'D1';                             08950000
      PARM_INT_AREA.MSG_VAR_VALUE_8 = COUNTRY_LIST.AVAILABILITY_DATE(I);08960000
      PARM_INT_AREA.MSG_VAR_CODE_9  = 'D2';                             08970000
      PARM_INT_AREA.MSG_VAR_VALUE_9 =                                   08980000
                                    COUNTRY_LIST.END_OF_SERVICE_DATE(I);08990000
    END;                                                                09000000
                                                                        09010000
 /* 0297: EMPTY COUNTRY MAPPING ARRAY */                                09020000
    WHEN ('0297')                                                       09030000
    DO;                                                                 09040000
      SEO_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ_SEO =                   09050000
                                           CNT_AVAIL_ELEMENT_SEO;       09051000
                                                                        09060000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            09070000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        09080000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            09090000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     09100000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            09110000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = SEO_UP.PRODUCT_TYPE;             09120000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            09130000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = SEO_UP.MODEL_NUMBER;             09140000
    END;                                                                09150000
                                                                        09160000
 /* 0299: COUNTRY DATA SKIPPED AS IT IS NOT REQUESTED FOR PROCESSING */ 09170000
    WHEN ('0299')                                                       09280000
    DO;                                                                 09290000
      SEO_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ_SEO =                   09300000
                   SEO_UPD_DETAILS.NO_CTRY_SKIP_CTRY_NOT_REQ_SEO + 1;   09310000
                                                                        09320000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            09330000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        09340000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            09350000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     09360000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'C5';                            09370000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = COUNTRY_LIST(I).EACM_COUNTRY_FC; 09380000
    END;                                                                09400000
                                                                        09410000
 /* 0300: ALL CTRY DATA SKIPPED AS NONE REQUESTED FOR PROCESSING */     09420000
    WHEN ('0300')                                                       09430000
    DO;                                                                 09440000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            09450000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        09460000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            09470000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     09480000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            09490000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = SEO_UP.PRODUCT_TYPE;             09500000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            09510000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = SEO_UP.MODEL_NUMBER;             09520000
    END;                                                                09530000
                                                                        09540000
 /* 0306: MESSAGE HAS BEEN REJECTED */                                  09550000
    WHEN ('0306')                                                       09560000
    DO;                                                                 09570000
      PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                            09580000
      PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                        09590000
      PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                            09600000
      PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                     09610000
      PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                            09620000
      PARM_INT_AREA.MSG_VAR_VALUE_7  = SEO_UP.PRODUCT_TYPE;             09630000
      PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                            09640000
      PARM_INT_AREA.MSG_VAR_VALUE_8  = SEO_UP.MODEL_NUMBER;             09650000
    END;                                                                09660000
                                                                        09670000
    /* 0327: NO PARENT MODEL UPDATE FOUND FOR THE SEO UPDATE */         09690000
      WHEN ('0327')                                                     09700000
      DO;                                                               09710000
        PARM_INT_AREA.MESSAGE_TYPE     = 'BU';                          09720000
        PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                      09730000
        PARM_INT_AREA.MSG_VAR_CODE_6   = 'EI';                          09740000
        PARM_INT_AREA.MSG_VAR_VALUE_6  = SEOENTITYID;                   09750000
        PARM_INT_AREA.MSG_VAR_CODE_7   = 'PT';                          09760000
        PARM_INT_AREA.MSG_VAR_VALUE_7  = SEO_UP.PRODUCT_TYPE;           09770000
        PARM_INT_AREA.MSG_VAR_CODE_8   = 'MN';                          09780000
        PARM_INT_AREA.MSG_VAR_VALUE_8  = SEO_UP.MODEL_NUMBER;           09790000
        PARM_INT_AREA.MSG_VAR_CODE_9   = 'PPT';                         09791000
        PARM_INT_AREA.MSG_VAR_VALUE_9  = SEO_UP.PARENT_PRODTYPE;        09792000
        PARM_INT_AREA.MSG_VAR_CODE_10  = 'PMN';                         09793000
        PARM_INT_AREA.MSG_VAR_VALUE_10 = SEO_UP.PARENT_MODEL;           09794000
        PARSER_RETURN_AREA.MSG_REJ_DATA_VIOLATION = 'Y';                09795000
      END;                                                              09800000
                                                                        09801000
    OTHERWISE;                                                          10010000
 END;                                                                   10020000
 CALL RCB0M1M(PTR_INT_AREA);                                            10030000
                                                                        10031000
 END RCBXC5M_MSG;                                                       10040000
1/********************************************************************/ 10050000
 /*                                                                  */ 10060000
 /* MODULE NAME      : RCBXC5M_SELECT_T693                           */ 10070000
 /*                                                                  */ 10080000
 /* DESCRIPTION      : CHECK FOR TYPE, MODEL IN RCBT0693 TABLE       */ 10090000
 /********************************************************************/ 10100000
  RCBXC5M_SELECT_T693: PROC;                                            10110000
                                                                        10120000
  DCL WRK_MACHTYPE CHAR(04);                                            10130000
  DCL WRK_MODEL CHAR(03);                                               10140000
  WRK_MACHTYPE = SEO_UP.PRODUCT_TYPE;                                   10150000
  WRK_MODEL = SEO_UP.MODEL_NUMBER;                                      10160000
                                                                        10170000
  EXEC SQL                                                              10180000
  SELECT PRODUCT_TYPE,MODEL_NUMBER                                      10190000
  INTO :TB_RCBV693.PRODUCT_TYPE , :TB_RCBV693.MODEL_NUMBER              10200000
  FROM RCBV0693_TYPE_MOD_WW_LVL                                         10210000
  WHERE PRODUCT_TYPE = :WRK_MACHTYPE  AND                               10220000
        MODEL_NUMBER = :WRK_MODEL ;                                     10230000
                                                                        10240000
  SELECT(SQLCA.SQLCODE);                                                10250000
   WHEN(0)                                                              10260000
        T693_UPDATE_FLAG = TRUE;                                        10270000
   WHEN(100)                                                            10280000
        T693_INSERT_FLAG = TRUE;                                        10290000
   OTHERWISE                                                            10300000
   DO;                                                                  10310000
        ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                         10340000
        ERROR_CODE_DET.ERR_TYPE  ='DB2';                                10360000
        ERROR_CODE_DET.CALL_ID   ='#004';                               10370000
        SIGNAL ERROR;                                                   10380000
   END;                                                                 10390000
  END;                                                                  10400000
                                                                        10410000
  END RCBXC5M_SELECT_T693;                                              10420000
1/********************************************************************/ 10430000
 /*                                                                  */ 10440000
 /* MODULE NAME      : RCBXC5M_SELECT_T696                           */ 10450000
 /*                                                                  */ 10460000
 /* DESCRIPTION      : CHECK FOR TYPE, MODEL IN RCBT0696 TABLE       */ 10470000
 /********************************************************************/ 10480000
  RCBXC5M_SELECT_T696: PROC;                                            10490000
                                                                        10500000
  DCL WRK_MACHTYPE CHAR(04);                                            10510000
  DCL WRK_MODEL CHAR(03);                                               10520000
  WRK_MACHTYPE = SEO_UP.PRODUCT_TYPE;                                   10530000
  WRK_MODEL    = SEO_UP.MODEL_NUMBER;                                   10540000
                                                                        10550000
  EXEC SQL                                                              10560000
  /* SELECT * INTO :TB_RCBV696 */                /* SOC CEDS00000812 */ 10570015
  SELECT 1 INTO :DUMMY                           /* EOC CEDS00000812 */ 10571015
  FROM RCBV0696_TYPE_MOD_DESC                                           10580000
  WHERE PRODUCT_TYPE = :WRK_MACHTYPE  AND                               10590000
        MODEL_NUMBER = :WRK_MODEL;                                      10600000
                                                                        10610000
  SELECT(SQLCA.SQLCODE);                                                10620000
    WHEN(0)                                                             10630000
    DO;                                          /* SOC CEDS00000812 */ 10631016
      IF DUMMY = 1 THEN                          /* EOC CEDS00000812 */ 10631116
         T696_UPDATE_FLAG = TRUE;                                       10640000
        ELSE                                     /* SOC CEDS00000812 */ 10641116
         T696_INSERT_FLAG = TRUE;                                       10641216
    END;                                         /* EOC CEDS00000812 */ 10642016
    WHEN(100)                                                           10650000
         T696_INSERT_FLAG = TRUE;                                       10660000
    OTHERWISE                                                           10670000
    DO;                                                                 10680000
        ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                         10710000
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               10730000
         ERROR_CODE_DET.CALL_ID   ='#005';                              10740000
         SIGNAL ERROR;                                                  10750000
    END;                                                                10760000
  END;                                                                  10770000
                                                                        10780000
  END RCBXC5M_SELECT_T696;                                              10790000
 /********************************************************************/ 10810000
 /*                                                                  */ 10820000
 /* MODULE NAME      : RCBXC5M_TRANSLATE                             */ 10830000
 /*                                                                  */ 10840000
 /* DESCRIPTION      : HANDLING OF '@' PADDINGS WHILE INSERTING      */ 10850000
 /*                    UNICODE DATA INTO TABLES                      */ 10860000
 /********************************************************************/ 10870000
  RCBXC5M_TSN: PROC (SEOVAR,LENGTHA) RETURNS (CHAR(120) VARYING);       10880000
                                                                        10890000
     DCL INDEX2  FIXED BIN(31);                                         10900000
     DCL INDEX3  FIXED BIN(31);                                         10910000
     DCL LENGTHA FIXED BIN(31);                                         10920000
     DCL SEOVAR  CHAR(120) VARYING;                                     10930000
     DCL SEOVAR1 CHAR(120) VARYING;                                     10940000
     DCL TRANSLATE BUILTIN;                                             10950000
                                                                        10960000
     SEOVAR1  = ' ';                                                    10970000
     SEOVAR = SUBSTR(SEOVAR,1,LENGTHA);                                 10980000
     INDEX2 = 0;                                                        10990000
     INDEX3 = 0;                                                        11000000
     INDEX2 = INDEX(SEOVAR,' ');                                        11010000
     DO UNTIL (INDEX3 <= LENGTHA & INDEX2 ¬= 0);                        11020000
       INDEX3 = INDEX(SEOVAR,' ',INDEX2);                               11030000
       SEOVAR1 = TRANSLATE(SEOVAR,'20'X,' ');                           11040000
       INDEX3 = INDEX3 + 1;                                             11050000
       INDEX2 = INDEX2 + 1;                                             11060000
     END;                                                               11070000
    RETURN(SEOVAR1);                                                    11080000
                                                                        11090000
  END RCBXC5M_TSN;                                                      11100000
                                                                        11110000
1/********************************************************************/ 11120000
 /*                                                                  */ 11130000
 /* MODULE NAME      : RCBXC5M_INIT_PROGRAM                          */ 11140000
 /*                                                                  */ 11150000
 /* DESCRIPTION      : PROGRAM INITIALISATIONS                       */ 11160000
 /********************************************************************/ 11170000
 RCBXC5M_INIT_PROGRAM: PROC;                                            11180000
                                              /* INITIALISE POINTERS */ 11190000
 PARSER_RETURN_AREA = '';                                               11200000
 PARM_RET_AREA_BB   = '';                                               11210000
 PTR_RET_AREA_BB    = ADDR(PARM_RET_AREA_BB);                           11220000
                                                                        11230000
 PARM_INT_AREA.ID_MOD_LEVEL   = 1;                                      11240000
 PARM_INT_AREA.ID_MOD_PATH(1) = 'RCBXC5M';                              11280000
                                                                        11300000
 PARM_INT_AREA.MSG_REQUEST = 'P';                                       11310000
 CALL RCB0T1M(PTR_INT_AREA);                                            11320000
                                                                        11330000
 END RCBXC5M_INIT_PROGRAM;                                              11340000
                                                                        11350000
 END RCBXC5M;                                 /* END OF MAIN PROGRAM */ 11360000
 /********************************************************************/ 11370000
 /*  USED TEMPORARY FIELDS DECLARATION                               */ 11380000
 /********************************************************************/ 11390000
  DCL CHARS CHAR(32000) BASED;                                          11400000
  DCL ST_OF_ELEMENT CHAR(20) VAR;                                       11410000
  DCL ED_OF_ELEMENT CHAR(20) VAR;                                       11420000
  DCL I FIXED BIN(31) INIT(0);          /* AVAILABILITY_LIST COUNT  */  11430000
  DCL J FIXED BIN(31) INIT(0);          /* LANGUAGE_LIST COUNT      */  11440000
  DCL T FIXED BIN(31) INIT(0);          /* INT_CRTY ARRAY COUNT     */  11450000
  DCL K FIXED BIN(31) INIT(0);                                          11460000
  DCL L FIXED BIN(31) INIT(0);                                          11470000
  DCL SEOENTITYID  CHAR(8);                                             11480000
  DCL DTSOFMSG     CHAR(10);                                            11490000
  DCL SEOENTITYID1 CHAR(8);                                             11510000
  DCL SEODTSOFMSG  CHAR(10);                                            11520000
  DCL ELE_CONVERT    FIXED BIN(31) INIT(0);                             11530000
  DCL TEMP_LENGTH    FIXED BIN(31) INIT(0);                             11540000
  DCL 1 SEO_UP,                                                         11560000
        3  PRODUCT_TYPE        CHAR(4),                                 11570000
        3  MODEL_NUMBER        CHAR(3),                                 11580000
        3  PROD_REVENUE_DIV    CHAR(2),                                 11590000
        3  MACHINE_CATEGORY    CHAR(1),                                 11600000
        3  VENDOR_NAME         CHAR(120) VARYING INIT('IBM'),           11611000
        3  CE_PRODUCT_KEY      CHAR(1),                                 11620000
        3  PROD_SUP_COD        CHAR(3),                                 11630000
        3  RETAIN_FLAG         CHAR(1),                                 11640000
        3  INSTALL             CHAR(3),                                 11650000
        3  LAST_CHANGE_DATE    CHAR(10),                                11660000
        3  AVAILABILITY_DATE   CHAR(10) INIT(''),                       11670000
        3  END_OF_SERVICE_DATE CHAR(10) INIT(''),                       11680000
        3  PARENT_PRODTYPE     CHAR(04),                                11681000
        3  PARENT_MODEL        CHAR(03);                                11682000
  DCL 1 SEO_UP1 LIKE SEO_UP;                                            11690000
  DCL SKIP_CTRY_ARRAY(*) CTL CHAR(4);                                   11700000
    DCL 1 COUNTRY_LIST(*) CTL,                                          11710000
        3 PRODUCT_TYPE         CHAR(4),                                 11720000
        3 MODEL_NUMBER         CHAR(3),                                 11730000
        3 EACM_COUNTRY_FC      CHAR(4),                                 11740000
        3 AVAILABILITY_DATE    CHAR(10),                                11750000
        3 END_OF_SERVICE_DATE  CHAR(10),                                11760000
        3 LAST_CHANGE_DATE     CHAR(10);                                11770000
  DCL 1 COUNTRY_LIST1(*) CTL LIKE COUNTRY_LIST;                         11780000
  DCL 1 LANGUAGE_LIST(*) CTL,                                           11790000
        3 PRODUCT_TYPE         CHAR(4),                                 11800000
        3 MODEL_NUMBER         CHAR(3),                                 11810000
        3 LANG_ID              CHAR(2),                                 11820000
        3 PROD_DESC            CHAR(120) VARYING,                       11840000
        3 LAST_CHANGE_DATE     CHAR(10);                                11850000
  DCL 1 LANG_LIST(*) CTL LIKE LANGUAGE_LIST;                            11860000
  DCL COUNTRY_LIST_TEMP        CHAR(41);                                11890000
  DCL COUNTRY_LIST_TEMP1       CHAR(41);                                11920000
  DCL RCB693S_PTR       PTR;                                            11940000
  DCL RCB694S_PTR       PTR;                                            11950000
  DCL RCB696S_PTR       PTR;                                            11960000
  DCL RCB693S_PTR1      PTR;                                            11970000
  DCL RCB694S_PTR1      PTR;                                            11980000
  DCL RCB696S_PTR1      PTR;                                            11990000
  DCL PTR_SEO_ESDA      PTR;                                            12000000
  DCL PTR_SEO_ESDB      PTR;                                            12010000
  DCL PTR_RET_AREA_BB   PTR;                                            12020000
  DCL 1 PARM_RET_AREA_BB,                                               12030000
        %INCLUDE (RCBZ02S);;                                            12040000
  DCL ALPHANUM      CHAR(36)                                            12050000
      INIT('ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789');/* ALPHANUM VALUES */12060000
  DCL ALPHABET      CHAR(26)                                            12070000
      INIT('ABCDEFGHIJKLMNOPQRSTUVWXYZ');         /*ALPHABETIC VALUES */12080000
  /********************************************************************/12090000
  /*  BIT SWITCHES                                                    */12100000
  /********************************************************************/12110000
  DCL SEO_UPDATE_FLAG              BIT(1) INIT('0'B);                   12120000
  DCL SEO_UPDATE_MMLIST            BIT(1) INIT('0'B);                   12130009
  DCL LANG_LIST_FLAG               BIT(1) INIT('0'B);                   12140000
  DCL LANG_ELEM_FLAG               BIT(1) INIT('0'B);                   12150000
  DCL AVAILABILITY_LIST_FLAG       BIT(1) INIT('0'B);                   12160000
  DCL AVAILABILITY_ELEMENT_FLAG    BIT(1) INIT('0'B);                   12170000
  DCL T693_INSERT_FLAG             BIT(1) INIT('0'B);                   12180000
  DCL T693_UPDATE_FLAG             BIT(1) INIT('0'B);                   12190000
  DCL T696_INSERT_FLAG             BIT(1) INIT('0'B);                   12200000
  DCL T696_UPDATE_FLAG             BIT(1) INIT('0'B);                   12210000
  DCL WW_ELEMENT_FLAG              BIT(1) INIT('0'B);                   12220000
  DCL PARENT_MODEL_FLAG_693        BIT(1) INIT('0'B);                   12221000
  DCL LANG_ELEMENT_FLAG            BIT(1) INIT('0'B);                   12230000
  DCL CTRY_ELEMENT_FLAG            BIT(1) INIT('0'B);                   12240000
  DCL VALID_FLAG                   BIT(1) INIT('0'B);                   12260000
  DCL VALID_CTRY                   BIT(1) INIT('0'B);                   12270000
  DCL CHECK_INS_T693               BIT(1) INIT('0'B);                   12280000
  DCL CNT_AVAIL_ELEMENT1           FIXED  BIN(31);                      12290000
  DCL CNT_LANG_ELEMENT1            FIXED  BIN(31);                      12300000
  DCL 1 SWITCHES,                                                       12310000
      3 TRUE                       BIT(1) INIT ('1'B),                  12320000
      3 FALSE                      BIT(1) INIT ('0'B);                  12330000
                                                                        12330100
1/********************************************************************/ 12340000
 /* EXTERNAL ENTRIES DECLARATION                                     */ 12350000
 /********************************************************************/ 12360000
 DCL RCB0T1M   ENTRY EXTERNAL;         /* RETRIEVE SYSTEM DATE       */ 12370000
 DCL RCB0M1M   ENTRY EXTERNAL;         /* COMMON MESSAGE ROUTINE     */ 12380000
 DCL RCB004M   ENTRY EXTERNAL;         /* DATE VALIDATION ROUTINE    */ 12390000
 DCL RCBF89M   ENTRY EXTERNAL;         /* T693 INSERT/UPDATE         */ 12400000
 DCL RCBF90M   ENTRY EXTERNAL;         /* T694 INSERT/UPDATE         */ 12410000
 DCL RCBF92M   ENTRY EXTERNAL;         /* T696 INSERT/UPDATE         */ 12420000
1/********************************************************************/ 12430000
 /* MODULE NAME      : START_OF_DOCUMENT                             */ 12440000
 /*                                                                  */ 12450000
 /********************************************************************/ 12460000
  START_OF_DOCUMENT:                                                    12470000
    PROC( USERTOKEN )                                                   12480000
    RETURNS( BYVALUE FIXED BIN(31) )                                    12490000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                12500000
                                          /* ALLOCATE DYNAMIC ARRAYS */ 12510000
    ALLOCATE LANGUAGE_LIST(CNT_LANG_ELEMENT1);                          12520000
    ALLOCATE COUNTRY_LIST(CNT_AVAIL_ELEMENT1);                          12530000
    ALLOCATE SKIP_CTRY_ARRAY(CNT_AVAIL_ELEMENT1);                       12540000
    ALLOCATE LANG_LIST(CNT_LANG_ELEMENT1);                              12550000
    ALLOCATE COUNTRY_LIST1(CNT_AVAIL_ELEMENT1);                         12560000
                                                                        12570000
    SEO_UP      = '';                                                   12580000
    SEO_UP1     = (175)'20'X;                                           12590000
                                                                        12600000
    LANGUAGE_LIST(*) = '';                                              12630000
    COUNTRY_LIST(*)  = '';                                              12640000
    LANG_LIST(*) = '';                                                  12650000
    COUNTRY_LIST1(*)  = '';                                             12660000
                                                                        12670000
    SEO_UPD_DETAILS = '';                                               12680000
                                                                        12690000
     I  = 0;                                                            12700000
     J  = 0;                                                            12710000
     T  = 0;                                                            12720000
     K  = 0;                                                            12730000
     L  = 0;                                                            12740000
                                                                        12750000
    DCL USERTOKEN      POINTER;                                         12760000
    DCL XMLTOKEN       POINTER;                                         12770000
    DCL TOKENLENGTH    FIXED BIN(31);                                   12780000
                                                                        12790000
    RETURN(0);                                                          12800000
  END;                                                                  12810000
                                                                        12820000
1/********************************************************************/ 12830000
 /* MODULE NAME      : VERSION_INFORMATION                           */ 12840000
 /*                                                                  */ 12850000
 /********************************************************************/ 12860000
  VERSION_INFORMATION:                                                  12870000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            12880000
    RETURNS( BYVALUE FIXED BIN(31) )                                    12890000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                12900000
                                                                        12910000
    DCL USERTOKEN      POINTER;                                         12920000
    DCL XMLTOKEN       POINTER;                                         12930000
    DCL TOKENLENGTH    FIXED BIN(31);                                   12940000
                                                                        12950000
    RETURN(0);                                                          12960000
  END;                                                                  12970000
                                                                        12980000
1/********************************************************************/ 12990000
 /* MODULE NAME      : ENCODING_DECLARATION                          */ 13000000
 /*                                                                  */ 13010000
 /********************************************************************/ 13020000
  ENCODING_DECLARATION:                                                 13030000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            13040000
    RETURNS( BYVALUE FIXED BIN(31) )                                    13050000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                13060000
                                                                        13070000
    DCL USERTOKEN      POINTER;                                         13080000
    DCL XMLTOKEN       POINTER;                                         13090000
    DCL TOKENLENGTH    FIXED BIN(31);                                   13100000
    RETURN(0);                                                          13110000
  END;                                                                  13120000
                                                                        13130000
1/********************************************************************/ 13140000
 /* MODULE NAME      : STANDALONE_DECLARATION                        */ 13150000
 /*                                                                  */ 13160000
 /********************************************************************/ 13170000
  STANDALONE_DECLARATION:                                               13180000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            13190000
    RETURNS( BYVALUE FIXED BIN(31))                                     13200000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                13210000
                                                                        13220000
    DCL USERTOKEN      POINTER;                                         13230000
    DCL XMLTOKEN       POINTER;                                         13240000
    DCL TOKENLENGTH    FIXED BIN(31);                                   13250000
                                                                        13260000
    RETURN(0);                                                          13270000
  END;                                                                  13280000
                                                                        13290000
1/********************************************************************/ 13300000
 /* MODULE NAME      : DOCUMENT_TYPE_DECLARATION                     */ 13310000
 /*                                                                  */ 13320000
 /********************************************************************/ 13330000
  DOCUMENT_TYPE_DECLARATION:                                            13340000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            13350000
    RETURNS( BYVALUE FIXED BIN(31) )                                    13360000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                13370000
                                                                        13380000
    DCL USERTOKEN      POINTER;                                         13390000
    DCL XMLTOKEN       POINTER;                                         13400000
    DCL TOKENLENGTH    FIXED BIN(31);                                   13410000
                                                                        13420000
    RETURN(0);                                                          13430000
  END;                                                                  13440000
                                                                        13450000
1/********************************************************************/ 13460000
 /* MODULE NAME      : NAMESPACE_DECLARE                             */ 13470000
 /*                                                                  */ 13480000
 /********************************************************************/ 13490000
  NAMESPACE_DECLARE:                                                    13500000
    PROC( USERTOKEN, NSPREFIX, NSPREFIXLENGTH,                          13510000
                     NSURI, NSURILENGTH )                               13520000
    RETURNS( BYVALUE FIXED BIN(31) )                                    13530000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                13540000
                                                                        13550000
    DCL USERTOKEN      POINTER;                                         13560000
    DCL NSPREFIX       POINTER;                                         13570000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   13580000
    DCL NSURI          POINTER;                                         13590000
    DCL NSURILENGTH    FIXED BIN(31);                                   13600000
                                                                        13610000
    RETURN(0);                                                          13620000
  END;                                                                  13630000
                                                                        13640000
1/********************************************************************/ 13650000
 /* MODULE NAME      : END_OF_DOCUMENT                               */ 13660000
 /*                                                                  */ 13670000
 /********************************************************************/ 13680000
  END_OF_DOCUMENT:                                                      13690000
    PROC( USERTOKEN )                                                   13700000
    RETURNS( BYVALUE FIXED BIN(31) )                                    13710000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                13720000
                                                                        13730000
    DCL USERTOKEN      POINTER;                                         13740000
                                                                        13750000
    RETURN(0);                                                          13760000
  END;                                                                  13770000
                                                                        13780000
1/********************************************************************/ 13790000
 /* MODULE NAME      : START_OF_ELEMENT                              */ 13800000
 /*                                                                  */ 13810000
 /********************************************************************/ 13820000
  START_OF_ELEMENT:                                                     13830000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             13840000
          NSPREFIX, NSPREFIXLENGTH,                                     13850000
          NSURI, NSURILENGTH )                                          13860000
    RETURNS( BYVALUE FIXED BIN(31) )                                    13870000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                13880000
                                                                        13890000
    DCL USERTOKEN      POINTER;                                         13900000
    DCL XMLTOKEN       POINTER;                                         13910000
    DCL TOKENLENGTH    FIXED BIN(31);                                   13920000
    DCL NSPREFIX       POINTER;                                         13930000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   13940000
    DCL NSURI          POINTER;                                         13950000
    DCL NSURILENGTH    FIXED BIN(31);                                   13960000
    DCL ST_ELEMENT_PTR               POINTER;                           13980000
    DCL TEMP_ST_ELEMENT              CHAR(50) VARYING;                  13990000
    DCL ST_ELEMENT_PTR_1             POINTER;                           14000000
    DCL TEMP_ST_ELEMENT_1            CHAR(50) VARYING;                  14010000
                                                                        14030000
    TEMP_ST_ELEMENT            = '';                                    14060000
    TEMP_ST_ELEMENT_1          = '';                                    14070000
    /***************** CONVERTING TO EBCDIC ********************/       14080000
                                                                        14090000
    TEMP_ST_ELEMENT_1          = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );14100000
    ST_ELEMENT_PTR_1           = ADDR(TEMP_ST_ELEMENT_1);               14110000
    ST_ELEMENT_PTR             = ADDR(TEMP_ST_ELEMENT);                 14120000
    TEMP_LENGTH                = TOKENLENGTH + 2;                       14130000
                                                                        14140000
    ELE_CONVERT   = MEMCONVERT (ST_ELEMENT_PTR,TEMP_LENGTH,500,         14150000
                               ST_ELEMENT_PTR_1,TEMP_LENGTH,1208);      14160000
    ST_OF_ELEMENT = SUBSTR(TEMP_ST_ELEMENT,1,TOKENLENGTH);              14170000
    IF ST_OF_ELEMENT='MMLIST' THEN                                      14180009
    SEO_UPDATE_MMLIST = TRUE;                                           14181009
    IF ST_OF_ELEMENT='SEO_UPDATE' THEN                                  14190000
    SEO_UPDATE_FLAG = TRUE;                                             14200000
    IF ST_OF_ELEMENT='LANGUAGELIST' THEN                                14250000
    LANG_LIST_FLAG = TRUE;                                              14260000
    IF ST_OF_ELEMENT='LANGUAGEELEMENT' THEN                             14280000
    DO;                                                                 14290000
      J = J + 1;                                                        14300000
      LANG_ELEM_FLAG = TRUE;                                            14310000
    END;                                                                14320000
                                                                        14330000
    IF ST_OF_ELEMENT='AVAILABILITYLIST' THEN                            14340000
    AVAILABILITY_LIST_FLAG = TRUE;                                      14350000
                                                                        14360000
    IF ST_OF_ELEMENT='AVAILABILITYELEMENT' THEN                         14370000
    DO;                                                                 14380000
                                                                        14384000
      I = I + 1;                                                        14390000
      AVAILABILITY_ELEMENT_FLAG = TRUE;                                 14400000
    END;                                                                14410000
                                                                        14420000
    RETURN(0);                                                          14430000
  END;                                                                  14440000
                                                                        14450000
1/********************************************************************/ 14460000
 /* MODULE NAME      : ATTRIBUTE_NAME                                */ 14470000
 /*                                                                  */ 14480000
 /********************************************************************/ 14490000
  ATTRIBUTE_NAME:                                                       14500000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             14510000
          NSPREFIX, NSPREFIXLENGTH,                                     14520000
          NSURI, NSURILENGTH )                                          14530000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14540000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14550000
                                                                        14560000
    DCL USERTOKEN      POINTER;                                         14570000
    DCL XMLTOKEN       POINTER;                                         14580000
    DCL TOKENLENGTH    FIXED BIN(31);                                   14590000
    DCL NSPREFIX       POINTER;                                         14600000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   14610000
    DCL NSURI          POINTER;                                         14620000
    DCL NSURILENGTH    FIXED BIN(31);                                   14630000
                                                                        14640000
    RETURN(0);                                                          14650000
  END;                                                                  14660000
                                                                        14670000
1/********************************************************************/ 14680000
 /* MODULE NAME      : END_OF_ELEMENT                                */ 14690000
 /*                                                                  */ 14700000
 /********************************************************************/ 14710000
  END_OF_ELEMENT:                                                       14720000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             14730000
          NSPREFIX, NSPREFIXLENGTH,                                     14740000
          NSURI, NSURILENGTH )                                          14750000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14760000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14770000
                                                                        14780000
    DCL USERTOKEN      POINTER;                                         14790000
    DCL XMLTOKEN       POINTER;                                         14800000
    DCL TOKENLENGTH    FIXED BIN(31);                                   14810000
    DCL NSPREFIX       POINTER;                                         14820000
    DCL NSPREFIXLENGTH FIXED BIN(31);                                   14830000
    DCL NSURI          POINTER;                                         14840000
    DCL NSURILENGTH    FIXED BIN(31);                                   14850000
                                                                        14860000
    DCL ED_ELEMENT_PTR               POINTER;                           14870000
    DCL TEMP_ED_ELEMENT              CHAR(50) VARYING;                  14880000
    DCL ED_ELEMENT_PTR_1             POINTER;                           14890000
    DCL TEMP_ED_ELEMENT_1            CHAR(50) VARYING;                  14900000
                                                                        14910000
   TEMP_ED_ELEMENT            = '';                                     14950000
   TEMP_ED_ELEMENT_1          = '';                                     14960000
  /***************** CONVERTING TO EBCDIC ********************/         14970000
                                                                        14980000
   TEMP_ED_ELEMENT_1          = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH ); 14990000
   ED_ELEMENT_PTR_1           = ADDR(TEMP_ED_ELEMENT_1);                15000000
   ED_ELEMENT_PTR             = ADDR(TEMP_ED_ELEMENT);                  15010000
   TEMP_LENGTH                = TOKENLENGTH + 2;                        15020000
                                                                        15030000
   ELE_CONVERT   = MEMCONVERT (ED_ELEMENT_PTR,TEMP_LENGTH,500,          15040000
                              ED_ELEMENT_PTR_1,TEMP_LENGTH,1208);       15050000
   ED_OF_ELEMENT = SUBSTR(TEMP_ED_ELEMENT,1,TOKENLENGTH);               15060000
   IF ED_OF_ELEMENT='SEO_UPDATE' THEN                                   15080000
   SEO_UPDATE_FLAG = FALSE;                                             15090000
                                                                        15100000
   IF ED_OF_ELEMENT='LANGUAGELIST' THEN                                 15160000
   LANG_LIST_FLAG    = FALSE;                                           15170000
   IF ED_OF_ELEMENT='LANGUAGEELEMENT' THEN                              15180000
   LANG_ELEM_FLAG = FALSE;                                              15190000
                                                                        15200000
   IF ED_OF_ELEMENT='AVAILABILITYLIST' THEN                             15210000
   AVAILABILITY_LIST_FLAG = FALSE;                                      15220000
   IF ED_OF_ELEMENT='AVAILABILITYELEMENT' THEN                          15230000
   AVAILABILITY_ELEMENT_FLAG = FALSE;                                   15240000
                                                                        15250000
   IF ED_OF_ELEMENT='MMLIST' THEN                                       15251009
   SEO_UPDATE_MMLIST = FALSE;                                           15252009
                                                                        15253009
    RETURN(0);                                                          15260000
  END;                                                                  15270000
                                                                        15280000
1/********************************************************************/ 15290000
 /* MODULE NAME      : CONTENT_CHARACTERS                            */ 15300000
 /*                                                                  */ 15310000
 /********************************************************************/ 15320000
  CONTENT_CHARACTERS:                                                   15330000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH, FLAGS )                     15340000
    RETURNS( BYVALUE FIXED BIN(31) )                                    15350000
    OPTIONS( NODESCRIPTOR, BYVALUE LINKAGE(OPTLINK) );                  15360000
                                                                        15370000
    DCL USERTOKEN      POINTER;                                         15380000
    DCL XMLTOKEN       POINTER;                                         15390000
    DCL TOKENLENGTH    FIXED BIN(31);                                   15400000
    DCL FLAGS          BIT(8) ALIGNED;                                  15410000
    DCL PTR_SEO        POINTER;                                         15420000
    DCL PTR_SEO_1      POINTER;                                         15430000
                                                                        15440000
  IF (SEO_UPDATE_FLAG) & (ST_OF_ELEMENT = 'SEOID') THEN                 15470000
  DO;                                                                   15480000
      SEO_UP.PRODUCT_TYPE = ' ';                                        15540000
      SEO_UP1.PRODUCT_TYPE = SUBSTR(XMLTOKEN->CHARS,1,4);               15550000
                                                                        15560000
      PTR_SEO               = ADDR(SEO_UP.PRODUCT_TYPE);                15570000
      PTR_SEO_1             = ADDR(SEO_UP1.PRODUCT_TYPE);               15580000
      ELE_CONVER            = MEMCONVERT (PTR_SEO,                      15590000
                                          TOKENLENGTH,                  15600000
                                          500,                          15610000
                                          PTR_SEO_1,                    15620000
                                          TOKENLENGTH,                  15630000
                                          1208);                        15640000
                                                                        15650000
      SEO_UP.MODEL_NUMBER = ' ';                                        15880000
      SEO_UP1.MODEL_NUMBER = SUBSTR(XMLTOKEN->CHARS,5,7);               15890000
      ELE_CONVERT             = 0;                                      15900000
                                                                        15910000
      PTR_SEO                 = ADDR(SEO_UP.MODEL_NUMBER);              15920000
      PTR_SEO_1               = ADDR(SEO_UP1.MODEL_NUMBER);             15930000
      ELE_CONVERT             = MEMCONVERT (PTR_SEO,                    15940000
                                            TOKENLENGTH,                15950000
                                            500,                        15960000
                                            PTR_SEO_1,                  15970000
                                            TOKENLENGTH,                15980000
                                            1208);                      15990000
                                                                        16000000
  END;                                                                  16010000
                                                                        16020000
  IF (SEO_UPDATE_FLAG) & (ST_OF_ELEMENT = 'ENTITYID') THEN              16050000
  DO;                                                                   16060000
      SEOENTITYID           = ' ';                                      16090000
      SEOENTITYID1          = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    16100000
                                                                        16110000
      ELE_CONVERT             = 0;                                      16120000
      PTR_SEO                 = ADDR(SEOENTITYID);                      16130000
      PTR_SEO_1               = ADDR(SEOENTITYID1);                     16140000
      ELE_CONVERT             = MEMCONVERT (PTR_SEO,                    16150000
                                            TOKENLENGTH,                16160000
                                            500,                        16170000
                                            PTR_SEO_1,                  16180000
                                            TOKENLENGTH,                16190000
                                            1208);                      16200000
  END;                                                                  16220000
                                                                        16230000
  IF (SEO_UPDATE_FLAG) & (ST_OF_ELEMENT = 'DTSOFMSG') THEN DO;          16240000
         DTSOFMSG              = ' ';                                   16270000
         SEODTSOFMSG           = SUBSTR(XMLTOKEN->CHARS,1,10);          16280000
                                                                        16290000
         ELE_CONVERT             = 0;                                   16300000
         TEMP_LENGTH             = 10;                                  16310000
         PTR_SEO                 = ADDR(DTSOFMSG);                      16320000
         PTR_SEO_1               = ADDR(SEODTSOFMSG);                   16330000
         ELE_CONVERT             = MEMCONVERT (PTR_SEO,                 16340000
                                               TEMP_LENGTH,             16350000
                                               500,                     16360000
                                               PTR_SEO_1,               16370000
                                               TEMP_LENGTH,             16380000
                                               1208);                   16390000
  END;                                                                  16410000
                                                                        16420000
  IF (SEO_UPDATE_FLAG) & (ST_OF_ELEMENT = 'DIVISION') THEN DO;          16430000
     SEO_UP.PROD_REVENUE_DIV = ' ';                                     16460000
     SEO_UP1.PROD_REVENUE_DIV = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);  16470000
                                                                        16480000
      ELE_CONVERT             = 0;                                      16490000
      PTR_SEO                 = ADDR(SEO_UP.PROD_REVENUE_DIV);          16500000
      PTR_SEO_1               = ADDR(SEO_UP1.PROD_REVENUE_DIV);         16510000
      ELE_CONVERT             = MEMCONVERT (PTR_SEO,                    16520000
                                            TOKENLENGTH,                16530000
                                            500,                        16540000
                                            PTR_SEO_1,                  16550000
                                            TOKENLENGTH,                16560000
                                            1208);                      16570000
                                                                        16571000
      SEO_UP.VENDOR_NAME    =  '';                                      16572000
      DCL VENDOR_NAME_TEMP  CHAR(6) INIT('IBM');                        16575000
      DCL VENDOR_NAME_TEMP1 CHAR(6);                                    16576000
                                                                        16577000
  IF (SEO_UP.PROD_REVENUE_DIV = '4S'|                                   16580000
      SEO_UP.PROD_REVENUE_DIV = '13'|                                   16580100
      SEO_UP.PROD_REVENUE_DIV = 'Y1'|                                   16580200
      SEO_UP.PROD_REVENUE_DIV = 'Z3') THEN DO;                          16580300
      VENDOR_NAME_TEMP        = 'LENOVO';                               16581200
      END;                                                              16581400
                                                                        16581500
      SEO_UP1.VENDOR_NAME = (120)'20'X;                                 16581800
      VENDOR_NAME_TEMP1   = (120)'20'X;                                 16581900
                                                                        16582700
      ELE_CONVERT             = 0;                                      16582800
      PTR_SEO                 = ADDR(VENDOR_NAME_TEMP);                 16583000
      PTR_SEO_1               = ADDR(VENDOR_NAME_TEMP1);                16584000
      ELE_CONVERT             = MEMCONVERT (PTR_SEO_1,                  16589200
                                            6,                          16589300
                                            1208,                       16589400
                                            PTR_SEO,                    16589500
                                            6,                          16589600
                                            500);                       16589800
                                                                        16590200
      SEO_UP.VENDOR_NAME  =  VENDOR_NAME_TEMP;                          16590300
      SEO_UP1.VENDOR_NAME =  VENDOR_NAME_TEMP1;                         16590400
  END;                                                                  16591000
                                                                        16600000
  IF (SEO_UPDATE_FLAG) & (ST_OF_ELEMENT = 'PARENTMODEL') THEN DO;       17511000
     SEO_UP.PARENT_MODEL = ' ';                                         17512000
     SEO_UP1.PARENT_MODEL = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);      17513000
                                                                        17514000
      ELE_CONVERT             = 0;                                      17515000
      PTR_SEO                 = ADDR(SEO_UP.PARENT_MODEL);              17516000
      PTR_SEO_1               = ADDR(SEO_UP1.PARENT_MODEL);             17517000
      ELE_CONVERT             = MEMCONVERT (PTR_SEO,                    17518000
                                            TOKENLENGTH,                17519000
                                            500,                        17519100
                                            PTR_SEO_1,                  17519200
                                            TOKENLENGTH,                17519300
                                            1208);                      17519400
  END;                                                                  17521100
                                                                        17521200
  IF (SEO_UPDATE_FLAG) & (ST_OF_ELEMENT = 'PARENTMACHTYPE') THEN DO;    17521300
     SEO_UP.PARENT_PRODTYPE = ' ';                                      17521500
     SEO_UP1.PARENT_PRODTYPE = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);   17521600
                                                                        17521700
      ELE_CONVERT             = 0;                                      17521800
      PTR_SEO                 = ADDR(SEO_UP.PARENT_PRODTYPE);           17521900
      PTR_SEO_1               = ADDR(SEO_UP1.PARENT_PRODTYPE);          17522000
      ELE_CONVERT             = MEMCONVERT (PTR_SEO,                    17522100
                                            TOKENLENGTH,                17522200
                                            500,                        17522300
                                            PTR_SEO_1,                  17522400
                                            TOKENLENGTH,                17522500
                                            1208);                      17522600
  END;                                                                  17522700
                                                                        17522800
  IF (SEO_UPDATE_FLAG) & (LANG_LIST_FLAG) & (LANG_ELEM_FLAG)            17523000
  THEN DO;                                                              17524000
                                                                        17525000
     LANGUAGE_LIST(J).PRODUCT_TYPE = SEO_UP.PRODUCT_TYPE;               17530000
     LANGUAGE_LIST(J).MODEL_NUMBER = SEO_UP.MODEL_NUMBER;               17540000
     LANG_LIST(J).PRODUCT_TYPE     = SEO_UP1.PRODUCT_TYPE;              17560000
     LANG_LIST(J).MODEL_NUMBER     = SEO_UP1.MODEL_NUMBER;              17570000
                                                                        17590000
  END;                                                                  17600000
                                                                        17610000
  IF SEO_UPDATE_MMLIST = FALSE THEN DO;                                 17611009
  IF (SEO_UPDATE_FLAG) & (LANG_LIST_FLAG) & (LANG_ELEM_FLAG) &          17620000
     (ST_OF_ELEMENT = 'NLSID') THEN DO;                                 17630000
       LANGUAGE_LIST(J).LANG_ID  = ' ';                                 17670000
       LANG_LIST(J).LANG_ID = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    17680000
                                                                        17690000
       ELE_CONVERT             = 0;                                     17700000
       PTR_SEO                 = ADDR(LANGUAGE_LIST(J).LANG_ID);        17710000
       PTR_SEO_1               = ADDR(LANG_LIST(J).LANG_ID);            17720000
       ELE_CONVERT             = MEMCONVERT (PTR_SEO,                   17730000
                                             TOKENLENGTH,               17740000
                                             500,                       17750000
                                             PTR_SEO_1,                 17760000
                                             TOKENLENGTH,               17770000
                                             1208);                     17780000
  END;                                                                  17800000
                                                                        17810000
  IF (SEO_UPDATE_FLAG) & (LANG_LIST_FLAG) & (LANG_ELEM_FLAG) &          17811000
     (ST_OF_ELEMENT = 'MKTGNAME') THEN DO;                              17816000
                                                                        17816100
     IF (LANGUAGE_LIST(J).LANG_ID = '1') THEN DO;                       17817800
     LANGUAGE_LIST(J).PROD_DESC = ' ';                                  17817908
     LANG_LIST(J).PROD_DESC = (120)'20'X;                               17818000
     LANG_LIST(J).PROD_DESC = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    17818100
                                                                        17819000
     TEMP_LENGTH             = TOKENLENGTH + 2;                         17819200
     ELE_CONVERT             = 0;                                       17819300
     PTR_SEO                 = ADDR(LANGUAGE_LIST(J).PROD_DESC);        17819700
     PTR_SEO_1               = ADDR(LANG_LIST(J).PROD_DESC);            17819800
     ELE_CONVERT             = MEMCONVERT (PTR_SEO,                     17819900
                                           TEMP_LENGTH,                 17820000
                                           500,                         17820100
                                           PTR_SEO_1,                   17820200
                                           TEMP_LENGTH,                 17820300
                                           1208);                       17820400
                                                                        17821100
                                                                        17821403
     IF (TOKENLENGTH <= 30) THEN DO;                                    17821506
     LANGUAGE_LIST(J).PROD_DESC = SUBSTR(LANGUAGE_LIST(J).PROD_DESC,1,  17821603
                                                             30);       17821703
     LANG_LIST(J).PROD_DESC  = (120)'20'X;                              17821800
     ELE_CONVERT             = 0;                                       17821900
     PTR_SEO                 = ADDR(LANGUAGE_LIST(J).PROD_DESC);        17822000
     PTR_SEO_1               = ADDR(LANG_LIST(J).PROD_DESC);            17822100
     ELE_CONVERT             = MEMCONVERT (PTR_SEO_1,                   17822200
                                           122,                         17822300
                                           1208,                        17822400
                                           PTR_SEO,                     17822500
                                           TOKENLENGTH+2,               17822600
                                           500);                        17822700
     END;                                                               17822800
     ELSE DO;                                                           17822900
     LANGUAGE_LIST(J).PROD_DESC = SUBSTR(LANGUAGE_LIST(J).PROD_DESC,    17823000
                                             TOKENLENGTH-29,30);        17823206
     LANG_LIST(J).PROD_DESC  = (120)'20'X;                              17823600
     ELE_CONVERT             = 0;                                       17823700
     PTR_SEO                 = ADDR(LANGUAGE_LIST(J).PROD_DESC);        17823800
     PTR_SEO_1               = ADDR(LANG_LIST(J).PROD_DESC);            17823900
     ELE_CONVERT             = MEMCONVERT (PTR_SEO_1,                   17824000
                                           122,                         17824100
                                           1208,                        17824200
                                           PTR_SEO,                     17824300
                                           32,                          17824400
                                           500);                        17824500
     END;                                                               17825000
     END;                                                               17825400
  END;                                                                  17826000
  END;                                                                  17827009
                                                                        18090000
  IF (SEO_UPDATE_FLAG) & (AVAILABILITY_LIST_FLAG)                       18100000
                         & (AVAILABILITY_ELEMENT_FLAG)                  18110000
  THEN DO;                                                              18120000
     COUNTRY_LIST1(I).PRODUCT_TYPE = SEO_UP1.PRODUCT_TYPE;              18127000
     COUNTRY_LIST(I).PRODUCT_TYPE  = SEO_UP.PRODUCT_TYPE;               18130000
     COUNTRY_LIST(I).MODEL_NUMBER  = SEO_UP.MODEL_NUMBER;               18140000
     COUNTRY_LIST1(I).MODEL_NUMBER = SEO_UP1.MODEL_NUMBER;              18170000
  END;                                                                  18190000
                                                                        18200000
  IF (SEO_UPDATE_FLAG) & (AVAILABILITY_LIST_FLAG) &                     18210000
     (AVAILABILITY_ELEMENT_FLAG) & (ST_OF_ELEMENT = 'COUNTRY_FC')       18220000
      THEN DO;                                                          18230000
     COUNTRY_LIST(I).EACM_COUNTRY_FC = ' ';                             18280000
     COUNTRY_LIST1(I).EACM_COUNTRY_FC =                                 18290000
                                  SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);18300000
                                                                        18310000
     ELE_CONVERT             = 0;                                       18320000
     PTR_SEO                 = ADDR(COUNTRY_LIST(I).EACM_COUNTRY_FC);   18330000
     PTR_SEO_1               = ADDR(COUNTRY_LIST1(I).EACM_COUNTRY_FC);  18340000
     ELE_CONVERT             = MEMCONVERT (PTR_SEO,                     18350000
                                           TOKENLENGTH,                 18360000
                                           500,                         18370000
                                           PTR_SEO_1,                   18380000
                                           TOKENLENGTH,                 18390000
                                           1208);                       18400000
  END;                                                                  18420000
                                                                        18430000
                                                                        18437000
  IF (SEO_UPDATE_FLAG) & (AVAILABILITY_LIST_FLAG) &                     18440000
     (AVAILABILITY_ELEMENT_FLAG) &                                      18450000
     (ST_OF_ELEMENT = 'PLANNEDAVAILABILITY')THEN DO;                    18460000
     COUNTRY_LIST(I).AVAILABILITY_DATE = ' ';                           18510000
     COUNTRY_LIST1(I).AVAILABILITY_DATE =                               18520000
                              SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH);    18530000
                                                                        18540000
     ELE_CONVERT             = 0;                                       18550000
     PTR_SEO                 = ADDR(COUNTRY_LIST(I).AVAILABILITY_DATE); 18560000
     PTR_SEO_1               = ADDR(COUNTRY_LIST1(I).AVAILABILITY_DATE);18570000
     ELE_CONVERT             = MEMCONVERT (PTR_SEO,                     18580000
                                           TOKENLENGTH,                 18590000
                                           500,                         18600000
                                           PTR_SEO_1,                   18610000
                                           TOKENLENGTH,                 18620000
                                           1208);                       18630000
  END;                                                                  18650000
                                                                        18910300
    RETURN(0);                                                          18920000
  END;                                                                  18930000
                                                                        18940000
1/********************************************************************/ 18950000
 /* MODULE NAME      : ATTRIBUTE_CHARACTERS                          */ 18960000
 /*                                                                  */ 18970000
 /********************************************************************/ 18980000
  ATTRIBUTE_CHARACTERS:                                                 18990000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            19000000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19010000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                19020000
                                                                        19030000
    DCL USERTOKEN      POINTER;                                         19040000
    DCL XMLTOKEN       POINTER;                                         19050000
    DCL TOKENLENGTH    FIXED BIN(31);                                   19060000
                                                                        19070000
    RETURN(0);                                                          19080000
  END;                                                                  19090000
                                                                        19100000
1/********************************************************************/ 19110000
 /* MODULE NAME      : START_OF_CDATA                                */ 19120000
 /*                                                                  */ 19130000
 /********************************************************************/ 19140000
  START_OF_CDATA:                                                       19150000
    PROC( USERTOKEN )                                                   19160000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19170000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                19180000
                                                                        19190000
    DCL USERTOKEN      POINTER;                                         19200000
                                                                        19210000
    RETURN(0);                                                          19220000
  END;                                                                  19230000
                                                                        19240000
1/********************************************************************/ 19250000
 /* MODULE NAME      : END_OF_CDATA                                  */ 19260000
 /*                                                                  */ 19270000
 /********************************************************************/ 19280000
  END_OF_CDATA:                                                         19290000
    PROC( USERTOKEN )                                                   19300000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19310000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                19320000
                                                                        19330000
    DCL USERTOKEN      POINTER;                                         19340000
                                                                        19350000
    RETURN(0);                                                          19360000
  END;                                                                  19370000
                                                                        19380000
1/********************************************************************/ 19390000
 /* MODULE NAME      : PROCESSING_INSTRUCTION                        */ 19400000
 /*                                                                  */ 19410000
 /********************************************************************/ 19420000
  PROCESSING_INSTRUCTION:                                               19430000
    PROC( USERTOKEN,                                                    19440000
          PITARGET, PITARGETLENGTH,                                     19450000
          PIDATA, PIDATALENGTH )                                        19460000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19470000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                19480000
                                                                        19490000
    DCL USERTOKEN      POINTER;                                         19500000
    DCL PITARGET       POINTER;                                         19510000
    DCL PITARGETLENGTH FIXED BIN(31);                                   19520000
    DCL PIDATA         POINTER;                                         19530000
    DCL PIDATALENGTH   FIXED BIN(31);                                   19540000
                                                                        19550000
    RETURN(0);                                                          19560000
  END;                                                                  19570000
                                                                        19580000
1/********************************************************************/ 19590000
 /* MODULE NAME      : COMMENT                                       */ 19600000
 /*                                                                  */ 19610000
 /********************************************************************/ 19620000
  COMMENT:                                                              19630000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            19640000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19650000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                19660000
                                                                        19670000
    DCL USERTOKEN      POINTER;                                         19680000
    DCL XMLTOKEN       POINTER;                                         19690000
    DCL TOKENLENGTH    FIXED BIN(31);                                   19700000
                                                                        19710000
    RETURN(0);                                                          19720000
  END;                                                                  19730000
                                                                        19740000
1/********************************************************************/ 19750000
 /* MODULE NAME      : UNRESOLVED_REFERENCE                          */ 19760000
 /*                                                                  */ 19770000
 /********************************************************************/ 19780000
  UNRESOLVED_REFERENCE:                                                 19790000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            19800000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19810000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                19820000
                                                                        19830000
    DCL USERTOKEN      POINTER;                                         19840000
    DCL XMLTOKEN       POINTER;                                         19850000
    DCL TOKENLENGTH    FIXED BIN(31);                                   19860000
                                                                        19870000
    RETURN(0);                                                          19880000
  END;                                                                  19890000
                                                                        19900000
1/********************************************************************/ 19910000
 /* MODULE NAME      : EXCEPTION                                     */ 19920000
 /*                                                                  */ 19930000
 /********************************************************************/ 19940000
  EXCEPTION:                                                            19950000
    PROC( USERTOKEN, CURRENTOFFSET, RETURN_CODE, REASON_CODE )          19960000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19970000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                19980000
                                                                        19990000
    DCL USERTOKEN      POINTER;                                         20000000
    DCL CURRENTOFFSET  FIXED BIN(31);                                   20010000
    DCL RETURN_CODE    FIXED BIN(31);                                   20020000
    DCL REASON_CODE    FIXED BIN(31);                                   20030000
                                                                        20040000
    RETURN(0);                                                          20050000
  END;                                                                  20060000
                                                                        20070000
1/********************************************************************/ 20080000
 /* MODULE NAME      : END_OF_INPUT                                  */ 20090000
 /*                                                                  */ 20100000
 /********************************************************************/ 20110000
  END_OF_INPUT:                                                         20120000
    PROC( USERTOKEN, ADDR_XML, LENGTH_XML )                             20130000
    RETURNS( BYVALUE FIXED BIN(31) )                                    20140000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                20150000
                                                                        20160000
    DCL USERTOKEN      POINTER;                                         20170000
    DCL ADDR_XML       BYADDR POINTER;                                  20180000
    DCL LENGTH_XML     BYADDR FIXED BIN(31);                            20190000
                                                                        20200000
    RETURN(1);                                                          20210000
  END;                                                                  20220000
 END;                                                                   20230000
                                                                        20240000