 /* RCBXC1M - XML PARSER: RECONCILE MESSAGE TRANSACTION AND EXTRACT  */ 00010000
 /*                       XML MESSAGE HEADER                         */ 00020000
 /********************************************************************/ 00030000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00040000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00050000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00060000
 /********************************************************************/ 00070000
 /*                                                                  */ 00080000
 /* MODULE NAME      : RCBXC1M                                       */ 00090000
 /*                                                                  */ 00100000
 /* PROGRAM NAME     : RCBXC1P                                       */ 00110000
 /*                                                                  */ 00120000
 /* LANGUAGE         : PLISQL                                        */ 00130000
 /*                                                                  */ 00140000
 /* TYPE             : BATCH                                         */ 00150000
 /*                                                                  */ 00160000
 /* DESCRIPTION      : PARSE THE XML DOCUMENT AND INSERT RECORD      */ 00170000
 /*                    IN THE INTERMEDIATE TABLE FOR EVERY TRANSA    */ 00180000
 /*                    -CTION RELATED TO CEDS AND PROCESS THE DATA   */ 00190000
 /*                    RELATED TO RECONCILE_MSGS TRANSACTION         */ 00200000
 /*                                                                  */ 00210000
 /* INPUT            : XML DOCUMENT                                  */ 00220000
 /*                                                                  */ 00230000
 /* OUTPUT           : -DB2 : RCBT0769_OIMS_MSG_LOG                  */ 00240000
 /*                    -FILE: RCB0M10 MESSAGE FILE                   */ 00250000
 /*                                                                  */ 00260000
 /* EXTERNAL MODULES : RCB0M1M  COMMON MESSAGE ROUTINE               */ 00270000
 /*                                                                  */ 00280000
 /* MESSAGES         : 0281 / 0282 / 0283 / 0284 / 0285 / 0286       */ 00290000
 /*                    0287 / 0288 / 0289 / 0290 / 0291 / 0320       */ 00300000
 /*                                                                  */ 00310000
 /* DEPENDENCIES     : NONE                                          */ 00320000
 /*                                                                  */ 00330000
 /*  MAINTENANCE LOG :                                               */ 00340000
 /*  ---------------                                                 */ 00350000
 /*                                                                  */ 00360000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00370000
 /*  --------------------------------------------------------------  */ 00380000
 /*  2011-08-10 | RB01315      | OIMS EACM REQUIREMENT               */ 00390000
 /*  2012-04-12 | CEDS00000578 | ADDITION OF QMANAGER CCSID AS INPUT */ 00400000
 /*             |              | TO 'C' PARSER AND INCLUDED          */ 00410000
 /*             |              | ADDITIONAL DETAILS IN USER MESSAGE  */ 00420000
 /*             |              | FOR XML MSG WITH FORMAT ERROR       */ 00430000
 /*  2012-09-12 | CEDS00000587 | CHANGE IN HANDLING OF RECONCILE     */ 00440000
 /*             |              | XML                                 */ 00450000
 /*  2012-09-27 | CEDS00000597 | INCLUDED MESSAGE TYPE FOR IS0285    */ 00460000
 /*             |              | IN ERROR MESSAGE                    */ 00470000
 /*  2012-10-11 | CEDS00000600 | MESSAGE 0286 ENABLED                */ 00480000
 /*  2012-10-11 | CEDS00000612 | RULE CHANGE FOR RECONCILE OF        */ 00490000
 /*             |              | GENERALAREA MESSAGE                 */ 00500000
 /*  2012-12-17 | CEDS00000617 | MACHTYPE XML TAG HIERACHY CORRECTION*/ 00510000
 /*  2013-08-19 | RC01335      | DESIGN CHANGE FOR TRIGGERED MESSAGES*/ 00511000
 /*             |              | - PCR CEDSP-0390                    */ 00512000
 /*  2014-04-25 | CEDS00000679 | TREC 1826:TO PROCESS NON- ENGLISH   */ 00513000
 /*             |              |  CHARACTERS SENT FROM OIMS          */ 00514000
 /*  2014-08-12 | RC01345      | PCEDSP-0492 - HANDLING OF RECONCILE */ 00515000
 /*             |              | PROCESS ( MESSAGE -0290) IN REFRESH */ 00516000
 /*             |              | MODE                                */ 00517000
 /*  2014-09-01 | CEDS00000692 | HANDLING VARCHAR FOR VENDOR NAME AND*/ 00518000
 /*             |              | PRODUCT DESCRIPTION                 */ 00519000
 /*  2014-09-01 | RB01342      | CEDS 3.3 A23 RELEASE - SEO_UPDATE   */ 00520000
 /*             |              | XML(MELODY)                         */ 00521000
 /*  2016-01-07 | CEDS00000780 | TREC T10-2176: TO PREVENT ABEND FOR */ 00521102
 /*             |              | NON ENGLISH CHARACTERS              */ 00521202
 /********************************************************************/ 00522000
 RCBXC1M: PACKAGE EXPORTS(RCBXC1M);                                     00523000
                                                                        00524000
    DCL SYSPRINT FILE STREAM OUTPUT;                                    00525000
                                                                        00526000
    DEFINE ALIAS EVENT                                                  00527000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31) )                00528000
        RETURNS( BYVALUE FIXED BIN(31) )                                00529000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00530000
                                                                        00540000
    DEFINE ALIAS EVENT_WITH_FLAG                                        00550000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00560000
                       BIT(8) ALIGNED )                                 00570000
        RETURNS( BYVALUE FIXED BIN(31) )                                00580000
        OPTIONS( NODESCRIPTOR BYVALUE LINKAGE(OPTLINK) );               00590000
                                                                        00600000
    DEFINE ALIAS EVENT_WITH_NAMESPACE                                   00610000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00620000
                       POINTER, FIXED BIN(31),                          00630000
                       POINTER, FIXED BIN(31) )                         00640000
        RETURNS( BYVALUE FIXED BIN(31) )                                00650000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00660000
                                                                        00670000
    DEFINE ALIAS EVENT_WITHOUT_DATA                                     00680000
        LIMITED ENTRY( POINTER )                                        00690000
        RETURNS( BYVALUE FIXED BIN(31) )                                00700000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00710000
                                                                        00720000
    DEFINE ALIAS EVENT_PI                                               00730000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00740000
                       POINTER, FIXED BIN(31) )                         00750000
        RETURNS( BYVALUE FIXED BIN(31) )                                00760000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00770000
                                                                        00780000
    DEFINE ALIAS EVENT_NAMESPACE_DCL                                    00790000
        LIMITED ENTRY( POINTER, POINTER, FIXED BIN(31),                 00800000
                       POINTER, FIXED BIN(31) )                         00810000
        RETURNS( BYVALUE FIXED BIN(31) )                                00820000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00830000
                                                                        00840000
    DEFINE ALIAS EVENT_EXCEPTION                                        00850000
        LIMITED ENTRY( POINTER, FIXED BIN(31),                          00860000
                       FIXED BIN(31),                                   00870000
                       FIXED BIN(31) )                                  00880000
        RETURNS( BYVALUE FIXED BIN(31) )                                00890000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00900000
                                                                        00910000
    DEFINE ALIAS EVENT_END_OF_INPUT                                     00920000
        LIMITED ENTRY( POINTER,                                         00930000
                       POINTER BYADDR,                                  00940000
                       FIXED BIN(31) BYADDR )                           00950000
        RETURNS( BYVALUE FIXED BIN(31) )                                00960000
        OPTIONS( BYVALUE LINKAGE(OPTLINK) );                            00970000
                                                                        00980000
  RCBXC1M: PROC (PTR_C1M_PARSER_INPUT,                                  00990000
                 PTR_XMLDOC,                                            01000000
                 PARSER_RETURN_AREA_PTR,                                01010000
                 PTR_ERROR_RETURN,                                      01020000
                                                  /* SOC CEDS00000578 */01030000
          /*     PTR_INT_AREA); */                                      01040000
                 PTR_INT_AREA,                                          01050000
                 PTR_CCSID)                                             01060000
                                                  /* EOC CEDS00000578 */01070000
           OPTIONS (REENTRANT)                                          01080000
           REORDER;                                                     01090000
                                                                        01100000
    DCL                                                                 01110000
      1 EVENTHANDLER STATIC                                             01120000
                                                                        01130000
        ,2 E01 TYPE EVENT_WITHOUT_DATA                                  01140000
               INIT( START_OF_DOCUMENT )                                01150000
                                                                        01160000
        ,2 E02 TYPE EVENT                                               01170000
               INIT( VERSION_INFORMATION )                              01180000
                                                                        01190000
        ,2 E03 TYPE EVENT                                               01200000
               INIT( ENCODING_DECLARATION )                             01210000
                                                                        01220000
        ,2 E04 TYPE EVENT                                               01230000
               INIT( STANDALONE_DECLARATION )                           01240000
                                                                        01250000
        ,2 E05 TYPE EVENT                                               01260000
               INIT( DOCUMENT_TYPE_DECLARATION )                        01270000
                                                                        01280000
        ,2 E06 TYPE EVENT_WITHOUT_DATA                                  01290000
               INIT( END_OF_DOCUMENT )                                  01300000
                                                                        01310000
        ,2 E07 TYPE EVENT_WITH_NAMESPACE                                01320000
               INIT( START_OF_ELEMENT )                                 01330000
                                                                        01340000
        ,2 E08 TYPE EVENT_WITH_NAMESPACE                                01350000
               INIT( ATTRIBUTE_NAME )                                   01360000
                                                                        01370000
        ,2 E09 TYPE EVENT                                               01380000
               INIT( ATTRIBUTE_CHARACTERS )                             01390000
                                                                        01400000
        ,2 E10 TYPE EVENT_WITH_NAMESPACE                                01410000
               INIT( END_OF_ELEMENT )                                   01420000
                                                                        01430000
        ,2 E11 TYPE EVENT_WITHOUT_DATA                                  01440000
               INIT( START_OF_CDATA )                                   01450000
                                                                        01460000
        ,2 E12 TYPE EVENT_WITHOUT_DATA                                  01470000
               INIT( END_OF_CDATA )                                     01480000
                                                                        01490000
        ,2 E13 TYPE EVENT_WITH_FLAG                                     01500000
               INIT( CONTENT_CHARACTERS )                               01510000
                                                                        01520000
        ,2 E14 TYPE EVENT_PI                                            01530000
               INIT( PROCESSING_INSTRUCTION )                           01540000
                                                                        01550000
        ,2 E15 TYPE EVENT                                               01560000
               INIT( COMMENT )                                          01570000
                                                                        01580000
        ,2 E16 TYPE EVENT_NAMESPACE_DCL                                 01590000
               INIT( NAMESPACE_DECLARE )                                01600000
                                                                        01610000
        ,2 E17 TYPE EVENT_END_OF_INPUT                                  01620000
               INIT( END_OF_INPUT )                                     01630000
                                                                        01640000
        ,2 E18 TYPE EVENT                                               01650000
               INIT( UNRESOLVED_REFERENCE )                             01660000
                                                                        01670000
        ,2 E19 TYPE EVENT_EXCEPTION                                     01680000
               INIT( EXCEPTION )                                        01690000
        ;                                                               01700000
                                                                        01710000
    DCL PTR_XMLDOC                  PTR;                                01720000
    DCL MQ_MESSAGE_PTR              PTR;                                01730000
    DCL PTR_C1M_PARSER_INPUT        PTR;                                01740000
    DCL MQLENGTH_PTR                PTR;                                01750000
    DCL PARSER_RETURN_AREA_PTR      PTR;                                01760000
    DCL PTR_RCB769                  PTR;                                01770000
    DCL RCBZ02S_PTR                 PTR;     /* PTR RETURN INFO      */ 01780000
    DCL PTR_INT_AREA                PTR;     /* PTR INTERFACE AREA   */ 01790000
    DCL PTR_ERROR_RETURN            PTR;     /* PTR ERROR RETURN AREA*/ 01800000
    DCL PTR_CCSID                   PTR;             /* CEDS00000578 */ 01810000
                                                                        01820000
    DCL 1 PARM_INT_AREA             BASED(PTR_INT_AREA),                01830000
          %INCLUDE RCBZ01S;;                                            01840000
                                                                        01850000
    DCL 1 ERROR_CODE_DET            BASED(PTR_ERROR_RETURN),            01860000
          5 PTR_ERROR               PTR,                                01870000
          5 ERR_TYPE                CHAR(8),                            01880000
          5 CALL_ID                 CHAR(4);                            01890000
                                                                        01900000
    DCL 1 PARSER_C1M_DATA_AREA      BASED(PTR_C1M_PARSER_INPUT),        01910000
          5  MQ_TYPE_OF_MODE        CHAR(10),                           01920000
          5  MQ_LENGTH              FIXED BIN(31);                      01930000
                                                                        01940000
    DCL MQ_MESSAGE CHAR(MQ_LENGTH)  BASED(PTR_XMLDOC);                  01950000
    DCL MQ_CCSID   FIXED BIN(31)    BASED(PTR_CCSID); /* CEDS00000578 */01960000
    DCL COUNT_OF_ALL                FIXED BIN(31);                      01970000
    DCL COUNT_XML                   FIXED BIN(31);    /* CEDS00000587 */01980000
    DCL COUNT_DTS                   FIXED BIN(31);         /* RC01335 */01990000
    DCL COUNT_WARELEMENT            FIXED BIN(31);                      02000000
    DCL MQ_STRING                   FIXED DEC(7,0);                     02010000
    DCL SQLCODE_BIN                 FIXED BIN(31);                      02020000
    DCL SQLCODE_PTR                 PTR;                                02030000
    DCL DECIMAL_VAL                 FIXED DEC(7,0);                     02040000
    DCL SQLCODE_PIC                 PIC '9999999' BASED(SQLCODE_PTR);   02050000
                                                                        02060000
    DCL (ADDR, CHARACTER, SUBSTR, ADDRDATA, LENGTH, STRING) BUILTIN;    02070000
    DCL INDEX BUILTIN;                            /* CEDS00000679 */    02080000
                                                                        02090000
    DCL 1 TB_RCB769S,                                                   02100000
          %INCLUDE (RCB769S);;                                          02110000
                                                                        02120000
    DCL 1 PARSER_RETURN_AREA BASED(PARSER_RETURN_AREA_PTR),             02130000
          %INCLUDE (RCBBE5S);;                                          02140000
                                                                        02150000
    DCL TOKEN                       CHAR(8);                            02160000
    DCL INT_ENTITYTYPE              CHAR(50) INIT('');                  02170000
    DCL INT_DTSOFMSG                CHAR(26) INIT('');                  02180000
    DCL INT_ENTITYID                CHAR(08) INIT('');                  02190000
                                                       /* SOC RC01335 */02200000
    DCL WRK_ENTITY_TYPE             CHAR(50) INIT('');                  02210000
    DCL WRK_ENTITY_ID               CHAR(08) INIT('');                  02220000
    DCL WRK_DTSOFMSG                CHAR(26) INIT(''); /* EOC RC01335 */02230000
    DCL WRK_COUNT_TABLE             FIXED BIN(31) INIT(0);              02240000
    DCL WRK_COUNT_TABLE1            FIXED BIN(31) INIT(0); /* RC01335 */02250000
    DCL COUNT_ARRAY                 FIXED BIN(31) INIT(0);              02260000
    DCL TB_MSG_CREATE_DATE          CHAR(26) INIT ('');                 02270000
    DCL TB_MSG_ENTITY_ID            CHAR(08) INIT ('');                 02280000
                                                  /* SOC CEDS00000679 */02290000
    DCL LEN_TIMESTP                 FIXED BIN(31) INIT(0);              02300000
    DCL LEN_MSGEID                  FIXED BIN(31) INIT(0);              02310000
    DCL LEN_MSGTYPE                 FIXED BIN(31) INIT(0);              02311000
    DCL LEN_MSGMODE                 FIXED BIN(31) INIT(0);              02312000
                                                  /* SOC CEDS00000692 */02313000
    DCL LEN_MSGDETAIL               FIXED BIN(31) INIT(254);            02314000
                                                  /* EOC CEDS00000692 */02315000
                                                  /* EOC CEDS00000679 */02316000
                                                                        02317000
    DCL 1 WRK_VAR,                                                      02318000
          5 WRK_MSG_TYPE            CHAR(50) VAR INIT (''),             02319000
          5 WRK_FROMMSGDTS          CHAR(26) INIT (''),                 02320000
          5 WRK_TOMSGDTS            CHAR(26) INIT (''),                 02330000
                                                  /* SOC CEDS00000587 */02340000
          5 TB_DTSOFMSG             CHAR(26) INIT (''),                 02350000
          5 WRK_XML_DTS             CHAR(26) INIT (''),                 02360000
          5 WRK_XML_EID             CHAR(26) INIT (''),                 02370000
                                                  /* EOC CEDS00000587 */02380000
          5 WRK_TYPE_OF_MODE        CHAR(07) INIT ('');                 02390000
                                                  /* SOC CEDS00000578 */02400000
    DCL IDX1 FIXED BIN(31) INIT(0);                                     02410000
    DCL IDX2 FIXED BIN(31) INIT(0);                                     02420000
    DCL IDX3 FIXED BIN(31) INIT(0);                                     02430000
    DCL IDX4 FIXED BIN(31) INIT(0);                                     02440000
                                                                        02450000
    DCL MSG_1 CHAR(2000)   INIT ('');                                   02460000
    DCL MSG_TYPE CHAR(25)  INIT ('');                                   02470000
    DCL MSG_DATE CHAR(25)  INIT ('');                                   02480000
                                                  /* EOC CEDS00000578 */02490000
    DCL RCB0M1M ENTRY EXTERNAL;                                         02500000
    EXEC SQL                                                            02510000
       INCLUDE SQLCA;                                                   02520000
                                                  /* SOC CEDS00000679 */02530000
  EXEC SQL BEGIN DECLARE SECTION;                                       02540000
  DCL T769_MSG_CREATE_DATE         CHAR(26);                            02550000
    EXEC SQL DECLARE :T769_MSG_CREATE_DATE VARIABLE CCSID 1208;         02551000
  DCL T769_MSG_ENTITY_ID         CHAR(8);                               02552000
    EXEC SQL DECLARE :T769_MSG_ENTITY_ID    VARIABLE CCSID 1208;        02553000
  DCL T769_MESSAGE_TYPE        CHAR(50) VAR;                            02554000
    EXEC SQL DECLARE :T769_MESSAGE_TYPE VARIABLE CCSID 1208;            02555000
  DCL T769_TYPE_OF_MODE        CHAR(7);                                 02556000
    EXEC SQL DECLARE :T769_TYPE_OF_MODE VARIABLE CCSID 1208;            02557000
  DCL T769_MSG_DETAILS             CHAR(254);                           02558000
    EXEC SQL DECLARE :T769_MSG_DETAILS VARIABLE CCSID 1208;             02559000
  EXEC SQL END DECLARE SECTION;                   /* EOC CEDS00000679 */02560000
                                                                        02561000
     EXEC SQL                                                           02562000
       DECLARE CURS_RCBV0769_DELTA CURSOR FOR                           02563000
       SELECT MSG_CREATE_DATE,                                          02564000
              MSG_ENTITY_ID                                             02565000
       FROM   RCBT0769_OIMS_MSG_LOG                                     02566000
       WHERE  TYPE_OF_MODE        =  :WRK_TYPE_OF_MODE                  02567000
         AND  MESSAGE_TYPE        =  :WRK_MSG_TYPE                      02568000
         AND  MSG_CREATE_DATE     >= :WRK_FROMMSGDTS                    02569000
         AND  MSG_CREATE_DATE     <= :WRK_TOMSGDTS                      02570000
                                                       /* SOC RC01335 */02580000
 /*      AND  MSG_CREATE_DATE     ¬= :INT_DTSOFMSG */ /* CEDS00000600 */02590000
         AND  RECONCILED_FLAG_OK  =  'N'               /* EOC RC01335 */02600000
       ORDER BY MSG_CREATE_DATE                                         02610000
       FOR FETCH ONLY                                                   02620000
       ;                                                                02630000
                                                       /* SOC RC01345 */02640000
                                                       /* SOC RC01335 */02650000
    /* EXEC SQL                                                         02660000
       DECLARE CURS_RCBV0769_REFRESH CURSOR FOR                         02670000
       SELECT MSG_CREATE_DATE,                                          02680000
              MSG_ENTITY_ID                                             02690000
       FROM   RCBT0769_OIMS_MSG_LOG                                     02691000
       WHERE  RECONCILED_FLAG_OK  =  'N'                                02692000
         AND  MESSAGE_TYPE        =  :WRK_MSG_TYPE                      02693000
         AND  TYPE_OF_MODE        =  'REFRESH'                          02694000
       ORDER BY MSG_CREATE_DATE                                         02695000
       FOR FETCH ONLY                                                   02696000
       ;*/                                             /* EOC RC01335 */02697000
                                                       /* EOC RC01345 */02698000
                                                                        02699000
    CALL RCBXC1M_INIT_PROCESSING;                                       02700000
                                                                        02710000
                                 /* CALL THE PLISAXC FOR PARSING XML */ 02720000
    CALL PLISAXC( EVENTHANDLER,                                         02730000
                  ADDR(TOKEN),                                          02740000
                  ADDRDATA(MQ_MESSAGE),                                 02750000
                                                 /* SOC CEDS00000578 */ 02760000
              /*  MQ_LENGTH); */                                        02770000
                  MQ_LENGTH,                                            02780000
                  MQ_CCSID);                                            02790000
                                                 /* EOC CEDS00000578 */ 02800000
                                       /* IF THE XML HAS ANY ERRORS  */ 02810000
    IF XML_EXCEPTION_F = 'Y' THEN                                       02820000
      DO;                                                               02830000
                                                 /* SOC CEDS00000578 */ 02840000
        MSG_1    = SUBSTR(MQ_MESSAGE,1,2000);                           02850000
        IDX1     = INDEX(MSG_1,'ads/') + 4;                             02860000
        IDX2     = INDEX(MSG_1,'_UPDATE">');                            02870000
        IDX3     = IDX2 - IDX1;                                         02880000
        IDX4     = INDEX(MSG_1,'<DTSOFMSG>') + 10;                      02890000
        MSG_TYPE = SUBSTR(MSG_1,IDX1,IDX3);                             02900000
        MSG_DATE = SUBSTR(MSG_1,IDX4,25);                               02910000
                                                 /* EOC CEDS00000578 */ 02920000
        PARSER_RETURN_AREA.XML_MSG_FORMAT = 'Y';                        02930000
        PARSER_RETURN_AREA.XML_EXCEPTION.RETURN_CODE =                  02940000
                           XML_EXCEPTION_1.RETURN_CODE;                 02950000
        PARSER_RETURN_AREA.XML_EXCEPTION.REASON_CODE =                  02960000
                           XML_EXCEPTION_1.REASON_CODE;                 02970000
        PARSER_RETURN_AREA.XML_EXCEPTION.CURRENTOFFSET =                02980000
                           XML_EXCEPTION_1.CURRENTOFFSET;               02990000
        CALL RCBXC1M_MSG('0281');                                       03000000
      END;                                                              03010000
    ELSE                                                                03020000
      PARSER_RETURN_AREA.XML_MSG_FORMAT = 'N';                          03030000
                                      /* IF THE PARSER HAS NO ERRORS */ 03040000
    IF PARSER_RETURN_AREA.XML_MSG_FORMAT = 'N' THEN                     03050000
      DO;                                                               03060000
        IF F_MSG_ELEMENT = TRUE THEN DO;                                03070000
          CALL INSERT_KEY_T769;                                         03080000
          F_MSG_ELEMENT = FALSE;                                        03090000
      END;                                                              03100000
                                                                        03110000
    IF F_VERIFY_COUNT = TRUE THEN DO;                                   03120000
      IF COUNT_MODEL > 0 THEN                                           03130000
        DO;                                                             03140000
          F_MODEL_ARRAY_INT = TRUE;                                     03150000
          F_GENAR_ARRAY_INT = FALSE;                                    03160000
          F_ROFER_ARRAY_INT = FALSE;                                    03170000
          F_SEO_ARRAY_INT   = FALSE;                       /* RB01342 */03180000
          WRK_MSG_TYPE  = 'MODEL_UPDATE';                               03190000
          COUNT_OF_ALL  = COUNT_MODEL;                                  03200000
          CALL VERIFY_COUNT;                                            03210000
        END;                                                            03220000
      IF COUNT_SEO > 0 THEN                            /* SOC RB01342 */03230000
        DO;                                                             03240000
          F_MODEL_ARRAY_INT = FALSE;                                    03250000
          F_SEO_ARRAY_INT   = TRUE;                                     03260000
          F_GENAR_ARRAY_INT = FALSE;                                    03270000
          F_ROFER_ARRAY_INT = FALSE;                                    03280000
          WRK_MSG_TYPE  = 'SEO_UPDATE';                                 03281000
          COUNT_OF_ALL  = COUNT_SEO;                                    03282000
          CALL VERIFY_COUNT;                                            03283000
        END;                                           /* EOC RB01342 */03284000
      IF COUNT_GENAR > 0 THEN                                           03285000
        DO;                                                             03286000
          F_MODEL_ARRAY_INT = FALSE;                                    03287000
          F_GENAR_ARRAY_INT = TRUE;                                     03288000
          F_ROFER_ARRAY_INT = FALSE;                                    03289000
          F_SEO_ARRAY_INT   = FALSE;                      /* RB01342 */ 03290000
          WRK_MSG_TYPE  = 'GENERALAREA_UPDATE';                         03300000
          COUNT_OF_ALL  = COUNT_GENAR;                                  03310000
          CALL VERIFY_COUNT;                                            03320000
        END;                                                            03330000
      IF COUNT_ROFER > 0 THEN                                           03340000
        DO;                                                             03350000
          F_MODEL_ARRAY_INT = FALSE;                                    03360000
          F_GENAR_ARRAY_INT = FALSE;                                    03370000
          F_ROFER_ARRAY_INT = TRUE;                                     03380000
          F_SEO_ARRAY_INT   = FALSE;                      /* RB01342 */ 03390000
          WRK_MSG_TYPE  = 'REFOFER_UPDATE';                             03400000
          COUNT_OF_ALL  = COUNT_ROFER;                                  03410000
          CALL VERIFY_COUNT;                                            03420000
        END;                                                            03430000
      F_VERIFY_COUNT = FALSE;                                           03440000
    END;                                                                03450000
                                                                        03460000
    PARSER_RETURN_AREA.XML_MSG_TYPE = XML_KEY.XML_MSG_TYPE;             03470000
                                                                        03480000
    IF XML_KEY.XML_MSG_TYPE = 'MODEL_UPDATE' THEN                       03490000
      DO;                                                               03500000
        PARSER_RETURN_AREA.XML_MSG_STATUS                         =     03510000
               XML_CONTENT.MODEL_UPD.STATUS;                            03520000
        PARSER_RETURN_AREA.XML_MSG_DATE                           =     03530000
               XML_CONTENT.MODEL_UPD.DTSOFMSG;                          03540000
        PARSER_RETURN_AREA.MODEL_UPD_UCOUNT_DET.CNT_LANG_ELEMENT  =     03550000
               XML_UNBOUND_COUNT.MODEL_UPD_UCOUNT.CNT_LANG_ELEMENT;     03560000
        PARSER_RETURN_AREA.CNT_AVAIL_ELEMENT                      =     03570000
               XML_UNBOUND_COUNT.CNT_AVAIL_ELEMENT;                     03580000
      END;                                                              03590000
                                                                        03600000
                                                       /* SOC RB01342 */03610000
    IF XML_KEY.XML_MSG_TYPE = 'SEO_UPDATE' THEN                         03620000
      DO;                                                               03630000
        PARSER_RETURN_AREA.XML_MSG_STATUS                         =     03640000
               XML_CONTENT.SEO_UPD.STATUS;                              03650000
        PARSER_RETURN_AREA.XML_MSG_DATE                           =     03651000
               XML_CONTENT.SEO_UPD.DTSOFMSG;                            03652000
        PARSER_RETURN_AREA.SEO_UPD_UCOUNT_DET.CNT_LANG_ELEMENT_SEO=     03653000
               XML_UNBOUND_COUNT.SEO_UPD_UCOUNT.CNT_LANG_ELEMENT_SEO;   03654000
        PARSER_RETURN_AREA.CNT_AVAIL_ELEMENT_SEO                  =     03655000
               XML_UNBOUND_COUNT.CNT_AVAIL_ELEMENT_SEO;                 03656000
      END;                                                              03657000
                                                       /* EOC RB01342 */03658000
    IF XML_KEY.XML_MSG_TYPE = 'REFOFER_UPDATE' THEN                     03659000
      DO;                                                               03660000
        PARSER_RETURN_AREA.XML_MSG_STATUS           =                   03670000
                  XML_CONTENT.REFOFER_UPD.STATUS;                       03680000
        PARSER_RETURN_AREA.XML_MSG_DATE             =                   03690000
                  XML_CONTENT.REFOFER_UPD.DTSOFMSG;                     03700000
        PARSER_RETURN_AREA.REFOFER_UPD_UCOUNT_DET   =                   03710000
                  XML_UNBOUND_COUNT.REFOFER_UPD_UCOUNT;                 03720000
      END;                                                              03730000
    IF XML_KEY.XML_MSG_TYPE = 'GENERALAREA_UPDATE' THEN                 03740000
      DO;                                                               03750000
        PARSER_RETURN_AREA.XML_MSG_DATE        =                        03760000
                  XML_CONTENT.GENAREA_UPD.DTSOFMSG;                     03770000
        PARSER_RETURN_AREA.GENAREA_UPD_UCOUNT_DET =                     03780000
                  XML_UNBOUND_COUNT.GENAREA_UPD_UCOUNT;                 03790000
      END;                                                              03800000
   END;                                                                 03810000
 /********************************************************************/ 03820000
 /*                                                                  */ 03830000
 /* MODULE NAME      : RCBXC1M_INIT_PROCESSING                       */ 03840000
 /*                                                                  */ 03850000
 /* DESCRIPTION      : INITIAL PROCESSING IN THE PROGRAM             */ 03860000
 /*                                                                  */ 03870000
 /********************************************************************/ 03880000
  RCBXC1M_INIT_PROCESSING: PROC;                                        03890000
                                                                        03900000
   PTR_RCB769                        = ADDR(TB_RCB769S);                03910000
   XML_TYPE_OF_MODE                  =  MQ_TYPE_OF_MODE ;               03920000
   XML_EXCEPTION_F                   = 'N' ;                            03930000
   PARSER_RETURN_AREA.XML_MSG_FORMAT = 'N';                             03940000
   PARM_INT_AREA.ID_MOD_LEVEL        = 1;                               03950000
   PARM_INT_AREA.ID_MOD_PATH(1)      = 'RCBXC1M';                       03960000
   PARM_INT_AREA.MSG_REQUEST         = 'P';                             03970000
                                                       /* SOC RC01345 */03980000
   /*SWITCH_END_OF_CURS_REF          = FALSE;*/            /* RC01335 */03981000
                                                       /* EOC RC01345 */03982000
                                                                        03983000
  END RCBXC1M_INIT_PROCESSING;                                          03984000
 /********************************************************************/ 03985000
 /*                                                                  */ 03986000
 /* MODULE NAME      : INSERT_KEY_T769                               */ 03987000
 /*                                                                  */ 03988000
 /* DESCRIPTION      : INSERT A RECORD IN TABLE T769 FOR EVERY       */ 03989000
 /*                    TRANSACTION RELATED TO CEDS                   */ 03990000
 /*                                                                  */ 04000000
 /********************************************************************/ 04010000
  INSERT_KEY_T769: PROC;                                                04020000
                                                                        04030000
                                                  /* SOC CEDS00000679 */04040000
  /*TB_RCB769S.MSG_CREATE_DATE  = MSG_INSERT.MSG_CREATE_DATE;           04050000
  TB_RCB769S.MSG_ENTITY_ID    = MSG_INSERT.MSG_ENTITY_ID;               04060000
  TB_RCB769S.MESSAGE_TYPE     = MSG_INSERT.MSG_TYPE;                    04070000
  TB_RCB769S.TYPE_OF_MODE     = XML_TYPE_OF_MODE;                       04080000
  TB_RCB769S.MSG_DETAILS      = MSG_INSERT.MSG_DETAILS;*/               04090000
    DCL PTR_MSG_CREATE_DATE              POINTER;                       04100000
    DCL PTR_MSG_ENTITY_ID                POINTER;                       04110000
    DCL PTR_MSG_TYPE                     POINTER;                       04120000
    DCL PTR_XML_TYPE_OF_MODE             POINTER;                       04130000
    DCL PTR_MSG_DETAILS                  POINTER;                       04140000
    DCL PTR_MSG_CREATE_DATE1             POINTER;                       04150000
    DCL PTR_MSG_ENTITY_ID1               POINTER;                       04160000
    DCL PTR_MSG_TYPE1                    POINTER;                       04170000
    DCL PTR_XML_TYPE_OF_MODE1            POINTER;                       04171000
    DCL PTR_MSG_DETAILS1                 POINTER;                       04172000
    DCL ELE_CONVERT                  FIXED BIN(31) INIT(0);             04173000
    DCL TEMP_LENGTH                  FIXED BIN(31) INIT(0);             04174000
   /***************** CONVERTING TO EBCDIC ********************/        04175000
                                                                        04176000
   MSG_INSERT_1             = ' ';                                      04177000
                                                                        04178000
   PTR_MSG_CREATE_DATE      = ADDR(MSG_INSERT.MSG_CREATE_DATE);         04179000
   PTR_MSG_ENTITY_ID        = ADDR(MSG_INSERT.MSG_ENTITY_ID);           04180000
   PTR_MSG_TYPE             = ADDR(MSG_INSERT.MSG_TYPE);                04181000
   PTR_XML_TYPE_OF_MODE     = ADDR(XML_TYPE_OF_MODE);                   04182000
   PTR_MSG_DETAILS          = ADDR(MSG_INSERT.MSG_DETAILS);             04183000
   PTR_MSG_CREATE_DATE1     = ADDR(MSG_INSERT_1.MSG_CREATE_DATE);       04184000
   PTR_MSG_ENTITY_ID1       = ADDR(MSG_INSERT_1.MSG_ENTITY_ID);         04185000
   PTR_MSG_TYPE1            = ADDR(MSG_INSERT_1.MSG_TYPE);              04186000
   PTR_XML_TYPE_OF_MODE1    = ADDR(MSG_INSERT_1.MSG_TYPE_OF_MODE);      04187000
   PTR_MSG_DETAILS1         = ADDR(MSG_INSERT_1.MSG_DETAILS);           04188000
                                                                        04189000
   /***************** CONVERTING MSG_CREATE_DATE **************/        04190000
   TEMP_LENGTH     = 26;                                                04190100
   LEN_TIMESTP     = 26;                                                04190200
                                                                        04190300
   ELE_CONVERT =    MEMCONVERT (PTR_MSG_CREATE_DATE1,TEMP_LENGTH,1208,  04190400
                    PTR_MSG_CREATE_DATE,TEMP_LENGTH,500);               04190500
   ELE_CONVERT = 0;                                                     04190600
   /***************** CONVERTING MSG_ENTITY_ID   **************/        04190700
   TEMP_LENGTH = 8;                                                     04190800
   LEN_MSGEID    = 8;                                                   04190900
   ELE_CONVERT     = MEMCONVERT (PTR_MSG_ENTITY_ID1,TEMP_LENGTH,1208,   04191000
                              PTR_MSG_ENTITY_ID,TEMP_LENGTH,500);       04192000
   ELE_CONVERT = 0;                                                     04193000
   /***************** CONVERTING MSG_TYPE        **************/        04194000
   TEMP_LENGTH    = LENGTH(MSG_INSERT.MSG_TYPE) + 2;                    04195000
   LEN_MSGTYPE    = LENGTH(MSG_INSERT.MSG_TYPE);                        04196000
   ELE_CONVERT    = MEMCONVERT (PTR_MSG_TYPE1,TEMP_LENGTH,1208,         04197000
                              PTR_MSG_TYPE,TEMP_LENGTH,500);            04198000
   MSG_INSERT_1.MSG_TYPE = SUBSTR(MSG_INSERT_1.MSG_TYPE,1,              04199000
                                                TEMP_LENGTH - 2);       04199100
   /***************** CONVERTING TYPE_OF_MODE    **************/        04199200
   TEMP_LENGTH    = LENGTH(XML_TYPE_OF_MODE);                           04199300
   LEN_MSGMODE    = TEMP_LENGTH;                                        04199400
   ELE_CONVERT    = 0;                                                  04199500
   ELE_CONVERT    = MEMCONVERT(PTR_XML_TYPE_OF_MODE1,TEMP_LENGTH,1208,  04199600
                         PTR_XML_TYPE_OF_MODE,TEMP_LENGTH,500);         04199700
   /***************** CONVERTING MSG_DETAILS      **************/       04199800
   ELE_CONVERT = 0;                                                     04199900
   TEMP_LENGTH    = LENGTH(MSG_INSERT.MSG_DETAILS) + 2;                 04200000
   LEN_MSGDETAIL  = LENGTH(MSG_INSERT.MSG_DETAILS);                     04201000
   ELE_CONVERT    = MEMCONVERT (PTR_MSG_DETAILS1,TEMP_LENGTH,1208,      04202000
                              PTR_MSG_DETAILS,TEMP_LENGTH,500);         04203000
   MSG_INSERT_1.MSG_DETAILS = SUBSTR(MSG_INSERT_1.MSG_DETAILS,1,        04204000
                                                TEMP_LENGTH-2);         04205000
   TEMP_LENGTH = 0;                                                     04206000
   ELE_CONVERT = 0;                                                     04207000
                                                                        04208000
   T769_MSG_CREATE_DATE         = MSG_INSERT_1.MSG_CREATE_DATE;         04209000
   T769_MSG_ENTITY_ID           = MSG_INSERT_1.MSG_ENTITY_ID;           04209100
   T769_MESSAGE_TYPE            = MSG_INSERT_1.MSG_TYPE;                04209200
   T769_TYPE_OF_MODE            = MSG_INSERT_1.MSG_TYPE_OF_MODE;        04209300
   T769_MSG_DETAILS             = MSG_INSERT_1.MSG_DETAILS;             04209400
                                                                        04209500
  /******** EBCDIC BLANK IS CHANGED WITH UNICODE SPACE X'20' **********/04209600
   T769_MSG_CREATE_DATE         = RCBXC1M_TSN(T769_MSG_CREATE_DATE,     04209700
                                              LEN_TIMESTP);             04209800
   T769_MSG_ENTITY_ID           = RCBXC1M_TSN(T769_MSG_ENTITY_ID,       04209900
                                              LEN_MSGEID);              04210000
   T769_MESSAGE_TYPE            = RCBXC1M_TSN(T769_MESSAGE_TYPE,        04211000
                                              LEN_MSGTYPE);             04212000
   T769_TYPE_OF_MODE            = RCBXC1M_TSN(T769_TYPE_OF_MODE,        04213000
                                              LEN_MSGMODE);             04214000
   T769_MSG_DETAILS             = RCBXC1M_TSN(T769_MSG_DETAILS,         04215000
                                              LEN_MSGDETAIL);           04216000
                                                /* EOC CEDS00000679 */  04217000
                                                                        04218000
  EXEC SQL                                                              04219000
    INSERT INTO RCBT0769_OIMS_MSG_LOG                                   04220000
           (MSG_CREATE_DATE                                             04230000
           ,MSG_ENTITY_ID                                               04240000
           ,MESSAGE_TYPE                                                04250000
           ,TYPE_OF_MODE                                                04260000
           ,MSG_DETAILS  )                                              04270000
                                                 /* SOC CEDS00000679 */ 04280000
  /*VALUES ( TIMESTAMP(:TB_RCB769S.MSG_CREATE_DATE)                     04290000
           , :TB_RCB769S.MSG_ENTITY_ID                                  04300000
           , :TB_RCB769S.MESSAGE_TYPE                                   04310000
           , :TB_RCB769S.TYPE_OF_MODE                                   04320000
           , :TB_RCB769S.MSG_DETAILS                                    04330000
           )                                                            04340000
     ; */                                                               04350000
     VALUES ( TIMESTAMP(:T769_MSG_CREATE_DATE),                         04360000
              :T769_MSG_ENTITY_ID,                                      04370000
              :T769_MESSAGE_TYPE,                                       04380000
              :T769_TYPE_OF_MODE,                                       04381000
              :T769_MSG_DETAILS)                                        04382000
     ;                                           /* EOC CEDS00000679 */ 04383000
                                                                        04384000
    SELECT (SQLCA.SQLCODE);                                             04385000
      WHEN (0);                                                         04386000
      WHEN (-803)                 /* IF THERE IS ANY DUPLICATE VALUE  */04387000
        DO;                                                             04388000
          PARSER_RETURN_AREA.XML_MSG_REJECT   = 'Y';                    04389000
                                                  /* SOC CEDS00000617 */04390000
     /*   ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA.SQLCODE); */            04400000
          ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                       04410000
                                                  /* EOC CEDS00000617 */04420000
          ERROR_CODE_DET.ERR_TYPE  ='DB2';                              04430000
          ERROR_CODE_DET.CALL_ID   ='#001';                             04440000
          CALL RCBXC1M_MSG('0282');                                     04450000
        END;                                                            04460000
      OTHERWISE                                                         04470000
        DO;                                                             04480000
                                                  /* SOC CEDS00000617 */04490000
     /*   ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA.SQLCODE); */            04500000
          ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                       04510000
                                                  /* EOC CEDS00000617 */04520000
          ERROR_CODE_DET.ERR_TYPE  ='DB2';                              04530000
          ERROR_CODE_DET.CALL_ID   ='#002';                             04540000
          PARSER_RETURN_AREA.XML_MSG_REJECT   = 'Y';                    04550000
          CALL RCBXC1M_MSG('0283');                                     04560000
          SIGNAL ERROR;                                                 04570000
        END;                                                            04580000
    END;                                                                04590000
                                                                        04600000
  END INSERT_KEY_T769;                                                  04610000
 /********************************************************************/ 04620000
 /*                                                                  */ 04630000
 /* MODULE NAME      : VERIFY_COUNT                                  */ 04640000
 /*                                                                  */ 04650000
 /* DESCRIPTION      : FETCH THE COUNT IN THE TABLE T769 FOR THE     */ 04660000
 /*                    GIVEN TIME PERIOD                             */ 04670000
 /*                                                                  */ 04680000
 /********************************************************************/ 04690000
 VERIFY_COUNT: PROC;                                                    04700000
                                                                        04710000
 WRK_FROMMSGDTS   = RECONCILE_MSGS.FROMMSGDTS;                          04720000
 WRK_TOMSGDTS     = RECONCILE_MSGS.TOMSGDTS;                            04730000
 WRK_TYPE_OF_MODE = XML_TYPE_OF_MODE;                                   04740000
                                                                        04750000
 EXEC  SQL                                                              04760000
    SELECT  COUNT(*)                                                    04770000
      INTO  :WRK_COUNT_TABLE                                            04780000
      FROM  RCBT0769_OIMS_MSG_LOG                                       04790000
    WHERE  TYPE_OF_MODE        =  :WRK_TYPE_OF_MODE                     04800000
      AND  MESSAGE_TYPE        =  :WRK_MSG_TYPE                         04810000
      AND  MSG_CREATE_DATE     >= :WRK_FROMMSGDTS                       04820000
      AND  MSG_CREATE_DATE     <= :WRK_TOMSGDTS                         04830000
    ;                                                                   04840000
                                                                        04850000
    SELECT (SQLCA.SQLCODE);                                             04860000
    WHEN (0)                                                            04870000
      DO;                                                               04880000
        IF (COUNT_OF_ALL ¬= WRK_COUNT_TABLE) &         /* SOC RC01335 */04890000
            ¬F_GENAR_ARRAY_INT                                          04900000
        THEN                                                            04910000
        CALL VERIFY_COUNT_OTHER;                                        04920000
                                                       /* EOC RC01335 */04930000
        CALL EQUATE_COUNT_TABLE;                                        04940000
      END;                                                              04950000
 /* WHEN (100)                                      */ /* SOC RC01335 */04960000
 /*   DO;                                                             */04970000
 /*    CALL EQUATE_COUNT_TABLE;                                       */04980000
 /*   END;                                                            */04990000
    WHEN (100);                                        /* EOC RC01335 */05000000
    OTHERWISE                                                           05010000
      DO;                                                               05020000
                                                  /* SOC CEDS00000617 */05030000
     /* ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA.SQLCODE); */              05040000
        ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                         05050000
                                                  /* EOC CEDS00000617 */05060000
        ERROR_CODE_DET.ERR_TYPE  ='DB2';                                05070000
        ERROR_CODE_DET.CALL_ID   ='#003';                               05080000
        PARSER_RETURN_AREA.XML_MSG_REJECT = 'Y';                        05090000
        CALL RCBXC1M_MSG('0284');                                       05100000
        SIGNAL ERROR;                                                   05110000
      END;                                                              05120000
    END;                                                                05130000
 END VERIFY_COUNT;                                                      05140000
 /********************************************************************/ 05150000
 /*                                                   /* SOC RC01335 */ 05160000
 /* MODULE NAME      : VERIFY_COUNT_OTHER                            */ 05170000
 /*                                                                  */ 05180000
 /* DESCRIPTION      : EQUATE THE COUNT IN THE TABLE WITH THE        */ 05190000
 /*                    COUNT IN THE XML DOCUMENT FOR DTSOFMSG WHICH  */ 05200000
 /*                    DOES NOT FALL BETWEEN FROMDTS / TODTSOFMSG    */ 05210000
 /*                    AND EQUAL TO DTSOFMSG FROM T769               */ 05220000
 /********************************************************************/ 05230000
 VERIFY_COUNT_OTHER: PROC;                                              05240000
                                                                        05250000
 COUNT_DTS   = 1;                                                       05260000
                                                                        05270000
 DO WHILE (COUNT_OF_ALL >= COUNT_DTS);                                  05280000
                                                                        05290000
   IF F_MODEL_ARRAY_INT THEN                                            05300000
   DO;                                                                  05310000
     WRK_ENTITY_TYPE = MODEL_ARRAY(COUNT_DTS).ENTITYTYPE;               05320000
     WRK_ENTITY_ID   = MODEL_ARRAY(COUNT_DTS).ENTITYID;                 05330000
     WRK_DTSOFMSG    = MODEL_ARRAY(COUNT_DTS).DTSOFMSG;                 05340000
   END;                                                                 05350000
                                                                        05360000
                                                       /* SOC RB01342 */05370000
   IF F_SEO_ARRAY_INT THEN                                              05380000
   DO;                                                                  05390000
     WRK_ENTITY_TYPE = SEO_ARRAY(COUNT_DTS).ENTITYTYPE;                 05400000
     WRK_ENTITY_ID   = SEO_ARRAY(COUNT_DTS).ENTITYID;                   05410000
     WRK_DTSOFMSG    = SEO_ARRAY(COUNT_DTS).DTSOFMSG;                   05420000
   END;                                                                 05430000
                                                       /* EOC RB01342 */05440000
   IF F_ROFER_ARRAY_INT THEN                                            05450000
   DO;                                                                  05460000
     WRK_ENTITY_TYPE = ROFER_ARRAY(COUNT_DTS).ENTITYTYPE ;              05470000
     WRK_ENTITY_ID   = ROFER_ARRAY(COUNT_DTS).ENTITYID;                 05480000
     WRK_DTSOFMSG    = ROFER_ARRAY(COUNT_DTS).DTSOFMSG;                 05490000
   END;                                                                 05500000
                                                                        05510000
  EXEC  SQL                                                             05520000
    SELECT  COUNT(*)                                                    05530000
      INTO  :WRK_COUNT_TABLE1                                           05540000
      FROM  RCBT0769_OIMS_MSG_LOG                                       05550000
    WHERE  TYPE_OF_MODE              =   :WRK_TYPE_OF_MODE              05560000
      AND  (SUBSTR(MESSAGE_TYPE,1,5) =   :WRK_ENTITY_TYPE               05570000
      OR    SUBSTR(MESSAGE_TYPE,1,7) =   :WRK_ENTITY_TYPE)              05580000
      AND  MSG_ENTITY_ID             =   :WRK_ENTITY_ID                 05590000
      AND  MSG_CREATE_DATE           =   :WRK_DTSOFMSG                  05600000
      AND  MSG_CREATE_DATE           ¬=  :WRK_FROMMSGDTS                05610000
      AND  MSG_CREATE_DATE           ¬=  :WRK_TOMSGDTS                  05620000
      AND  MSG_CREATE_DATE  NOT BETWEEN :WRK_FROMMSGDTS                 05630000
                                AND :WRK_TOMSGDTS                       05640000
    ;                                                                   05650000
                                                                        05660000
    SELECT (SQLCA.SQLCODE);                                             05670000
    WHEN (0)                                                            05680000
      DO;                                                               05690000
        WRK_COUNT_TABLE = WRK_COUNT_TABLE + WRK_COUNT_TABLE1;           05700000
      END;                                                              05710000
    WHEN (100);                                                         05720000
    OTHERWISE                                                           05730000
      DO;                                                               05740000
        ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                         05750000
        ERROR_CODE_DET.ERR_TYPE  ='DB2';                                05760000
        ERROR_CODE_DET.CALL_ID   ='#007';                               05770000
        PARSER_RETURN_AREA.XML_MSG_REJECT = 'Y';                        05780000
        CALL RCBXC1M_MSG('0284');                                       05790000
        SIGNAL ERROR;                                                   05800000
      END;                                                              05810000
    END;                                                                05820000
   COUNT_DTS = COUNT_DTS + 1;                                           05830000
 END;                                                                   05840000
                                                                        05850000
 END VERIFY_COUNT_OTHER;                              /* EOC RC01335 */ 05860000
                                                 /* SOC  CEDS00000679 */05870000
 /********************************************************************/ 05880000
 /*                                                                  */ 05890000
 /* MODULE NAME      : RCBXC1M_TRANSLATE                             */ 05900000
 /*                                                                  */ 05910000
 /* DESCRIPTION      : HANDLING OF '@' PADDINGS WHILE INSERTING      */ 05920000
 /*                    UNICODE DATA INTO TABLES                      */ 05930000
 /********************************************************************/ 05940000
  RCBXC1M_TSN: PROC (RECONVAR,LENGTHA) RETURNS (CHAR(254) VARYING);     05950000
                                                                        05960000
     DCL INDEX2 FIXED BIN(31);                                          05970000
     DCL INDEX3 FIXED BIN(31);                                          05980000
     DCL LENGTHA FIXED BIN(31);                                         05990000
     DCL RECONVAR CHAR(254) VARYING;                                    06000000
     DCL RECONVAR1 CHAR(254) VARYING;                                   06010000
     DCL TRANSLATE BUILTIN;                                             06020000
                                                                        06030000
     INDEX2 = 0;                                                        06031000
     RECONVAR1  = ' ';                                                  06032000
     RECONVAR = SUBSTR(RECONVAR,1,LENGTHA);                             06033000
     INDEX3 = 0;                                                        06034000
     INDEX2 = INDEX(RECONVAR,' ');                                      06035000
     DO UNTIL (INDEX3 <= LENGTHA & INDEX2 ¬= 0)                         06036000
      INDEX3 = INDEX(RECONVAR,' ',INDEX2);                              06037000
      RECONVAR1 = TRANSLATE(RECONVAR,'20'X,' ');                        06038000
      INDEX3 = INDEX3 + 1;                                              06039000
      INDEX2 = INDEX2 + 1;                                              06040000
    END;                                                                06041000
    RETURN(RECONVAR1);                                                  06041100
                                                                        06041200
  END RCBXC1M_TSN;                                                      06041300
                                                 /* EOC  CEDS00000679 */06041400
 /********************************************************************/ 06041500
 /*                                                                  */ 06041600
 /* MODULE NAME      : EQUATE_COUNT_TABLE                            */ 06041700
 /*                                                                  */ 06041800
 /* DESCRIPTION      : EQUATE THE COUNT IN THE TABLE WITH THE        */ 06041900
 /*                    COUNT IN THE XML DOCUMENT                     */ 06042000
 /*                                                                  */ 06043000
 /********************************************************************/ 06044000
 EQUATE_COUNT_TABLE: PROC;                                              06045000
                                                 /* SOC CEDS00000587 */ 06046000
 COUNT_XML   = 1;                                                       06047000
 COUNT_ARRAY = 1;                                                       06048000
                                                 /* EOC CEDS00000587 */ 06049000
 IF WRK_COUNT_TABLE ¬= COUNT_OF_ALL    THEN                             06050000
   DO;                                                                  06060000
     CALL RCBXC1M_MSG('0285');                                          06070000
                                                 /* SOC CEDS00000587 */ 06080000
   /*CALL OPEN_RCBV0769_DELTA;                                          06090000
     CALL CLOSE_RCBV0769_DELTA; */                                      06100000
                                                 /* EOC CEDS00000587 */ 06110000
   END;                                                                 06120000
 ELSE                                            /* SOC CEDS00000600 */ 06130000
      CALL RCBXC1M_MSG('0286');                  /* EOC CEDS00000600 */ 06140000
                                                 /* SOC CEDS00000587 */ 06150000
 IF ¬ F_GENAR_ARRAY_INT THEN                     /* SOC CEDS00000612 */ 06160000
 DO;                                             /* EOC CEDS00000612 */ 06170000
 IF ((WRK_COUNT_TABLE = 0) & (WRK_COUNT_TABLE ¬= COUNT_OF_ALL)) THEN    06180000
 DO;                                                                    06190000
   DO WHILE(COUNT_OF_ALL >= COUNT_ARRAY);                               06200000
     CALL GET_ARRAY_VALUES;                                             06210000
     CALL RCBXC1M_MSG('0291');                                          06220000
     COUNT_ARRAY = COUNT_ARRAY + 1;                                     06230000
   END;                                                                 06240000
 END;                                                                   06250000
                                                /* SOC CEDS00000600  */ 06260000
                                                /* SOC CEDS00000612  */ 06270000
 /*                                                                     06280000
 IF WRK_COUNT_TABLE > COUNT_OF_ALL THEN                                 06290000
 DO;                                                                    06300000
    CALL OPEN_RCBV0769_DELTA;                                           06310000
    CALL CLOSE_RCBV0769_DELTA;                                          06320000
    CALL RCBXC1M_MSG('0290');                                           06330000
 END;                                           /* EOC CEDS00000600  */ 06340000
 END;                                                                   06350000
                                                                        06360000
 IF F_GENAR_ARRAY_INT THEN                                              06370000
  DO;                                                                   06380000
 /*                                              /* EOC CEDS00000612  */06390000
 IF WRK_COUNT_TABLE = COUNT_OF_ALL    THEN                              06400000
   DO;                                                                  06410000
     WRK_XML_DTS = XML_CONTENT.RECONCILE_MSGS.SETUPDTS; /*CEDS00000612*/06420000
     CALL UPDATE_RCBV0769;                                              06430000
     /*                                                                 06440000
     CALL RCBXC1M_MSG('0286');                                          06450000
   END; */                                                              06460000
   END;                                                                 06470000
  END;                                                                  06480000
                                                                        06490000
   IF (COUNT_OF_ALL ¬= 0) & (WRK_COUNT_TABLE ¬= 0) THEN                 06500000
   DO;                                                                  06510000
     DO WHILE (COUNT_OF_ALL >= COUNT_XML);                              06520000
                                                                        06530000
        IF F_MODEL_ARRAY_INT THEN                                       06540000
         DO;                                                            06550000
           WRK_XML_DTS = MODEL_ARRAY(COUNT_XML).DTSOFMSG;               06560000
           WRK_XML_EID = MODEL_ARRAY(COUNT_XML).ENTITYID;               06570000
         END;                                                           06580000
                                                      /* SOC RB01342 */ 06590000
        IF F_SEO_ARRAY_INT THEN                                         06600000
         DO;                                                            06610000
           WRK_XML_DTS = SEO_ARRAY(COUNT_XML).DTSOFMSG;                 06620000
           WRK_XML_EID = SEO_ARRAY(COUNT_XML).ENTITYID;                 06630000
         END;                                                           06640000
                                                      /* EOC RB01342 */ 06650000
                                                 /* SOC CEDS00000612 */ 06660000
      /*IF F_GENAR_ARRAY_INT THEN                                       06670000
         DO;                                                            06680000
           WRK_XML_DTS = GENAR_ARRAY(COUNT_XML).DTSOFMSG;               06690000
           WRK_XML_EID = GENAR_ARRAY(COUNT_XML).ENTITYID;               06700000
         END; */                                 /* EOC CEDS00000612 */ 06710000
        IF F_ROFER_ARRAY_INT THEN                                       06720000
         DO;                                                            06730000
           WRK_XML_DTS = ROFER_ARRAY(COUNT_XML).DTSOFMSG;               06740000
           WRK_XML_EID = ROFER_ARRAY(COUNT_XML).ENTITYID;               06750000
         END;                                                           06760000
                                                 /* SOC CEDS00000612 */ 06770000
                                                      /* SOC RB01342 */ 06780000
 /*  IF F_ROFER_ARRAY_INT | F_MODEL_ARRAY_INT THEN                   */ 06790000
     IF F_ROFER_ARRAY_INT | F_MODEL_ARRAY_INT | F_SEO_ARRAY_INT THEN    06800000
                                                      /* EOC RB01342 */ 06810000
      DO;                                        /* EOC CEDS00000612 */ 06820000
        EXEC SQL                                                        06830000
          SELECT MSG_CREATE_DATE INTO :TB_DTSOFMSG                      06840000
          FROM RCBV0769_OIMS_MSG_LOG                                    06850000
          WHERE  TYPE_OF_MODE        =  :WRK_TYPE_OF_MODE               06860000
          AND    MESSAGE_TYPE        =  :WRK_MSG_TYPE                   06870000
                                                      /* SOC RC01335 */ 06880000
 /*       AND    MSG_CREATE_DATE     >= :WRK_FROMMSGDTS              */ 06890000
 /*       AND    MSG_CREATE_DATE     <= :WRK_TOMSGDTS                */ 06900000
          AND    MSG_ENTITY_ID        = :WRK_XML_EID  /* EOC RC01335 */ 06910000
          AND    MSG_CREATE_DATE      = :WRK_XML_DTS                    06920000
        ;                                                               06930000
                                                                        06940000
        SELECT(SQLCA.SQLCODE);                                          06950000
         WHEN(0)                                                        06960000
         DO;                                                            06970000
           CALL UPDATE_RCBV0769;                                        06980000
         END;                                                           06990000
         WHEN(100)                                                      07000000
         DO;                                                            07010000
           INT_ENTITYTYPE = WRK_MSG_TYPE;                               07020000
           INT_ENTITYID   = WRK_XML_EID;                                07030000
           INT_DTSOFMSG   = WRK_XML_DTS;                                07040000
           CALL RCBXC1M_MSG('0291');                                    07050000
                                                      /* SOC RC01335 */ 07060000
 /*        CALL OPEN_RCBV0769_DELTA;                                 */ 07070000
 /*        CALL CLOSE_RCBV0769_DELTA;                                */ 07080000
 /*        F_NOT_IN_TAB    = TRUE;                */ /* CEDS00000612 */ 07090000
                                                      /* EOC RC01335 */ 07100000
         END;                                                           07110000
         OTHERWISE                                                      07120000
         DO;                                                            07130000
                                                  /* SOC CEDS00000617 */07140000
        /* ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA.SQLCODE); */           07150000
           ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                      07160000
                                                  /* EOC CEDS00000617 */07170000
           ERROR_CODE_DET.ERR_TYPE  ='DB2';                             07180000
           ERROR_CODE_DET.CALL_ID   ='#004';                            07190000
           PARSER_RETURN_AREA.XML_MSG_REJECT = 'Y';                     07200000
           SIGNAL ERROR;                                                07210000
         END;                                                           07220000
      END;                                                              07230000
      END;                                            /* CEDS00000612 */07240000
      COUNT_XML = COUNT_XML + 1;                                        07250000
     END;                                                               07260000
   END;                                           /* EOC CEDS00000587 */07270000
                                                       /* SOC RC01335 */07280000
   /* TO FIND MESSAGES WHOSE COUNT DOES NOT MATCH IN T769 & RECON MSG */07290000
                                                       /* SOC RB01342 */07300000
   /*IF F_ROFER_ARRAY_INT | F_MODEL_ARRAY_INT THEN                    */07310000
     IF F_ROFER_ARRAY_INT | F_MODEL_ARRAY_INT | F_SEO_ARRAY_INT THEN    07320000
                                                       /* EOC RB01342 */07330000
     DO;                                                                07340000
                                                       /* SOC RC01345 */07350000
    /* IF WRK_TYPE_OF_MODE = 'REFRESH'                                  07360000
       THEN                                                             07370000
       DO;                                                              07380000
         CALL OPEN_RCBV0769_REFRESH;                                    07390000
         CALL FETCH_CUR_RCBV0769_REFRESH;                               07400000
                                                                        07410000
         DO WHILE(¬SWITCH_END_OF_CURS_REF);                             07420000
           CALL FETCH_CUR_RCBV0769_REFRESH;                             07430000
         END;                                                           07440000
                                                                        07450000
         CALL CLOSE_RCBV0769_REFRESH;                                   07460000
       END;                                                             07470000
       ELSE */                                        /* EOC RC01345 */ 07480000
         IF WRK_TYPE_OF_MODE = 'DELTA'                                  07490000
         THEN                                                           07500000
         DO;                                                            07510000
           CALL OPEN_RCBV0769_DELTA;                                    07520000
           CALL CLOSE_RCBV0769_DELTA;                                   07530000
         END;                                                           07540000
     END;                                                               07550000
                                                      /* EOC RC01335 */ 07560000
 END EQUATE_COUNT_TABLE;                                                07570000
 /* CODE COMMENTED AS PART OF PCEDSP-0492 - START COMMENT RC01345    */ 07571000
 /********************************************************************/ 07572000
 /*                                                   /* SOC RC01335 */ 07573000
 /* MODULE NAME      : OPEN_RCBV0769_REFRESH                         */ 07574000
 /*                                                                  */ 07575000
 /* DESCRIPTION      : OPEN THE CURSOR WHEN THE COUNT IN TABLE DOES  */ 07576000
 /*                    NOT MATCH WITH THE COUNT IN THE XML FOR       */ 07577000
 /*                    REFRESH                                       */ 07578000
 /*                                                                  */ 07579000
 /********************************************************************/ 07580000
 /* OPEN_RCBV0769_REFRESH: PROC;                                        07590000
                                                                        07600000
  EXEC SQL                                                              07610000
    OPEN CURS_RCBV0769_REFRESH;                                         07620000
                                                                        07630000
  SELECT(SQLCODE);                                                      07640000
    WHEN (0);                                                           07650000
    OTHERWISE                                                           07660000
    DO;                                                                 07660100
      ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                           07660200
      ERROR_CODE_DET.ERR_TYPE  ='DB2';                                  07660300
      ERROR_CODE_DET.CALL_ID   ='#008';                                 07660400
      SIGNAL ERROR;                                                     07660500
    END;                                                                07660600
  END;                                                                  07660700
                                                                        07660800
 END OPEN_RCBV0769_REFRESH; */                                          07660900
 /********************************************************************/ 07661000
 /*                                                                  */ 07662000
 /* MODULE NAME      : FETCH_CUR_RCBV0769_REFRESH                    */ 07662100
 /*                                                                  */ 07662200
 /* DESCRIPTION      : FETCH THE CURSOR FOR CURS_RCBV0769_REFRESH    */ 07662300
 /*                                                                  */ 07662400
 /********************************************************************/ 07662500
 /*  FETCH_CUR_RCBV0769_REFRESH: PROC;                                  07662600
                                                                        07662700
   EXEC SQL                                                             07662800
     FETCH CURS_RCBV0769_REFRESH                                        07662900
       INTO  :TB_MSG_CREATE_DATE,                                       07663000
             :TB_MSG_ENTITY_ID                                          07663100
   ;                                                                    07663200
                                                                        07663300
   SELECT (SQLCODE);                                                    07663400
     WHEN(0)                                                            07663500
       DO;                                                              07663600
         CALL RCBXC1M_MSG('0290');                                      07663700
       END;                                                             07663800
     WHEN(100)                                                          07663900
       SWITCH_END_OF_CURS_REF = TRUE;                                   07664000
     OTHERWISE                                                          07664100
      DO;                                                               07664200
         ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                        07664300
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               07664400
         ERROR_CODE_DET.CALL_ID   ='#009';                              07664500
         SIGNAL ERROR;                                                  07664600
      END;                                                              07664700
   END;                                                                 07664800
                                                                        07664900
 END FETCH_CUR_RCBV0769_REFRESH;*/                                      07665000
 /********************************************************************/ 07666000
 /*                                                                  */ 07666100
 /* MODULE NAME      : CLOSE_RCBV0769_REFRESH                        */ 07666200
 /*                                                                  */ 07666300
 /* DESCRIPTION      : CLOSE CURSOR CURS_RCBV0769_REFRESH            */ 07666400
 /*                                                                  */ 07666500
 /********************************************************************/ 07666600
 /* CLOSE_RCBV0769_REFRESH: PROC;                                       07666700
                                                                        07666800
  EXEC SQL                                                              07666900
    CLOSE CURS_RCBV0769_REFRESH;                                        07667000
                                                                        07667100
  SELECT (SQLCA.SQLCODE);                                               07667200
    WHEN (0);                                                           07667300
    OTHERWISE                                                           07667400
      DO;                                                               07667500
         ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                        07667600
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               07667700
         ERROR_CODE_DET.CALL_ID   ='#010';                              07667800
         SIGNAL ERROR;                                                  07667900
      END;                                                              07668000
  END;                                                                  07668100
                                                                        07668200
 END CLOSE_RCBV0769_REFRESH; */                       /* EOC RC01335 */ 07668300
 /* CODE COMMENTED AS PART OF PCEDSP-0492 - END COMMENT RC01345      */ 07668400
 /********************************************************************/ 07668500
 /*                                                                  */ 07668600
 /* MODULE NAME      : OPEN_RCBV0769_DELTA                           */ 07668700
 /*                                                                  */ 07668800
 /* DESCRIPTION      : OPEN THE CURSOR WHEN THE COUNT IN TABLE DOES  */ 07668900
 /*                    NOT MATCH WITH THE COUNT IN THE XML           */ 07669000
 /*                                                                  */ 07669100
 /********************************************************************/ 07669200
 OPEN_RCBV0769_DELTA: PROC;                                             07669300
                                                                        07669400
 CALL GET_ARRAY_VALUES;                             /* CEDS00000600  */ 07669500
                                                                        07669600
   EXEC SQL                                                             07669700
     OPEN CURS_RCBV0769_DELTA;                                          07669800
                                                                        07669900
   SELECT (SQLCA.SQLCODE);                                              07670000
     WHEN (0)                                                           07680000
       DO;                                                              07690000
         CALL PROCESS_CURSOR;                                           07700000
       END;                                                             07710000
     OTHERWISE                                                          07720000
       DO;                                                              07730000
                                                  /* SOC CEDS00000617 */07740000
      /* ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA.SQLCODE); */             07750000
         ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                        07760000
                                                  /* EOC CEDS00000617 */07770000
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               07780000
         ERROR_CODE_DET.CALL_ID   ='#004';                              07790000
         PARSER_RETURN_AREA.XML_MSG_REJECT = 'Y';                       07800000
         CALL RCBXC1M_MSG('0287');                                      07810000
         SIGNAL ERROR;                                                  07820000
       END;                                                             07830000
   END;                                                                 07840000
 END OPEN_RCBV0769_DELTA;                                               07850000
 /********************************************************************/ 07860000
 /*                                                                  */ 07870000
 /* MODULE NAME      : CLOSE_RCBV0769_DELTA                          */ 07880000
 /*                                                                  */ 07890000
 /* DESCRIPTION      : CLOSE THE CURSOR WHEN THE FETCH IS COMPLETE   */ 07900000
 /*                                                                  */ 07910000
 /********************************************************************/ 07920000
 CLOSE_RCBV0769_DELTA: PROC;                                            07930000
                                                                        07940000
   EXEC SQL                                                             07950000
     CLOSE CURS_RCBV0769_DELTA;                                         07960000
                                                                        07970000
   SELECT (SQLCA.SQLCODE);                                              07980000
     WHEN (0);                                                          07990000
     OTHERWISE                                                          08000000
       DO;                                                              08010000
                                                  /* SOC CEDS00000617 */08020000
      /* ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA.SQLCODE); */             08030000
         ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA);                        08040000
                                                  /* EOC CEDS00000617 */08050000
         ERROR_CODE_DET.ERR_TYPE  ='DB2';                               08060000
         ERROR_CODE_DET.CALL_ID   ='#005';                              08070000
         PARSER_RETURN_AREA.XML_MSG_REJECT = 'Y';                       08080000
         CALL RCBXC1M_MSG('0288');                                      08090000
         SIGNAL ERROR;                                                  08100000
       END;                                                             08110000
   END;                                                                 08120000
 END CLOSE_RCBV0769_DELTA;                                              08130000
 /********************************************************************/ 08140000
 /*                                                                  */ 08150000
 /* MODULE NAME      : UPDATE_RCBV0769                               */ 08160000
 /*                                                                  */ 08170000
 /* DESCRIPTION      : UPDATE THE TABLE T769 IF THE COUNT FROM TABLE */ 08180000
 /*                    MATCHES WITH COUNT IN THE XML.                */ 08190000
 /*                                                                  */ 08200000
 /********************************************************************/ 08210000
 UPDATE_RCBV0769: PROC;                                                 08220000
                                                                        08230000
                                                                        08240000
   EXEC SQL                                                             08250000
     UPDATE RCBT0769_OIMS_MSG_LOG                                       08260000
     SET RECONCILED_FLAG_OK     = 'Y'                                   08270000
     WHERE  TYPE_OF_MODE        =  :WRK_TYPE_OF_MODE                    08280000
                                                 /* SOC CEDS00000612 */ 08290000
   /*AND    MESSAGE_TYPE        =  :WRK_MSG_TYPE  */                    08300000
     AND (((MESSAGE_TYPE        =  'MODEL_UPDATE'                       08310000
     OR     MESSAGE_TYPE        =  'SEO_UPDATE'           /* RB01342 */ 08320000
     OR     MESSAGE_TYPE        =  'REFOFER_UPDATE')                    08330000
                                                 /* EOC CEDS00000612 */ 08340000
                                                      /* SOC RC01335 */ 08350000
 /*  AND    MSG_CREATE_DATE     >= :WRK_FROMMSGDTS                   */ 08360000
 /*  AND    MSG_CREATE_DATE     <= :WRK_TOMSGDTS                     */ 08370000
     AND    MSG_ENTITY_ID        = :WRK_XML_EID       /* EOC RC01335 */ 08380000
                                                 /* SOC CEDS00000612 */ 08390000
   /*AND    MSG_CREATE_DATE      = :WRK_XML_DTS*/    /* CEDS00000587 */ 08400000
     AND    MSG_CREATE_DATE      = :WRK_XML_DTS )    /* CEDS00000587 */ 08410000
     OR    (MESSAGE_TYPE         = 'GENERALAREA_UPDATE'                 08420000
     AND    MSG_CREATE_DATE     >= :WRK_FROMMSGDTS                      08430000
     AND    MSG_CREATE_DATE     <= :WRK_TOMSGDTS))                      08440000
                                                 /* EOC CEDS00000612 */ 08450000
     ;                                                                  08460000
                                                                        08470000
   SELECT (SQLCA.SQLCODE);                                              08480000
   WHEN (0);                                                            08490000
   OTHERWISE                                                            08500000
     DO;                                                                08510000
                                                  /* SOC CEDS00000617 */08520000
    /* ERROR_CODE_DET.PTR_ERROR = ADDR(SQLCA.SQLCODE); */               08530000
       ERROR_CODE_DET.PTR_ERROR          = ADDR(SQLCA);                 08540000
                                                  /* EOC CEDS00000617 */08550000
       ERROR_CODE_DET.ERR_TYPE           ='DB2';                        08560000
       ERROR_CODE_DET.CALL_ID            ='#006';                       08570000
       PARSER_RETURN_AREA.XML_MSG_REJECT = 'Y';                         08580000
       CALL RCBXC1M_MSG('0289');                                        08590000
       SIGNAL ERROR;                                                    08600000
     END;                                                               08610000
   END;                                                                 08620000
 END UPDATE_RCBV0769;                                                   08630000
 /********************************************************************/ 08640000
 /*                                                                  */ 08650000
 /* MODULE NAME      : PROCESS_CURSOR                                */ 08660000
 /*                                                                  */ 08670000
 /* DESCRIPTION      : FETCH THE CURSOR FOR VERIFYING THE TABLE      */ 08680000
 /*                    VALUES WITH VALUES IN THE ARRAY               */ 08690000
 /*                                                                  */ 08700000
 /********************************************************************/ 08710000
 PROCESS_CURSOR: PROC;                                                  08720000
                                                                        08730000
 /* COUNT_ARRAY = 1;                                   */ /* RC01335 */ 08740000
 DO WHILE (SQLCA.SQLCODE = 0);                                          08750000
                                                                        08760000
 /* CALL GET_ARRAY_VALUES;                             */ /* RC01335 */ 08770000
                                                                        08780000
   EXEC SQL                                                             08790000
     FETCH CURS_RCBV0769_DELTA                                          08800000
     INTO :TB_MSG_CREATE_DATE,                                          08810000
          :TB_MSG_ENTITY_ID                                             08820000
     ;                                                                  08830000
                                                                        08840000
   IF (SQLCA.SQLCODE ¬= 100) THEN                                       08850000
 /*  DO;                                           */ /* SOC RC01335 */ 08860000
 /*    SELECT;                                                       */ 08870000
 /*    WHEN (TB_MSG_CREATE_DATE < INT_DTSOFMSG)    */ /* EOC RC01335 */ 08880000
         DO;                                                            08890000
                                                      /* SOC RC01335 */ 08900000
 /*        IF ¬ F_NOT_IN_TAB THEN                  *//* CEDS00000612 */ 08910000
                                                      /* EOC RC01335 */ 08920000
           CALL RCBXC1M_MSG('0290');                                    08930000
         END;                                                           08940000
 /*    WHEN (TB_MSG_CREATE_DATE > INT_DTSOFMSG)    */ /* SOC RC01335 */ 08950000
 /*      DO;                                       */ /* EOC RC01335 */ 08960000
                                                 /* SOC CEDS00000600  */08970000
         /*IF COUNT_ARRAY >= COUNT_OF_ALL THEN                          08980000
             DO;                    */           /* EOC CEDS00000600  */08990000
                                                                        09000000
                                                      /* SOC RC01335 */ 09010000
 /*        IF ¬ F_NOT_IN_TAB THEN                 */ /* CEDS00000612 */ 09020000
 /*            CALL RCBXC1M_MSG('0290');          */  /* EOC RC01335 */ 09030000
          /* END;  */                            /* SOC CEDS00000600  */09040000
          /*                                                            09050000
           DO WHILE ((TB_MSG_CREATE_DATE > INT_DTSOFMSG) &              09060000
                    (COUNT_ARRAY <= COUNT_OF_ALL));                     09070000
           CALL RCBXC1M_MSG('0291');                                    09080000
           COUNT_ARRAY = COUNT_ARRAY + 1;                               09090000
               CALL GET_ARRAY_VALUES;                                   09100000
           END; */                               /* EOC CEDS00000600  */09110000
 /*        COUNT_ARRAY = COUNT_ARRAY + 1;          */ /* SOC RC01335 */ 09120000
 /*      END;                                                        */ 09130000
 /*    OTHERWISE                                                     */ 09140000
 /*      DO;                                                         */ 09150000
 /*        COUNT_ARRAY = COUNT_ARRAY + 1;                            */ 09160000
 /*      END;                                                        */ 09170000
 /*    END;                                                          */ 09180000
 /*  END;                                          */ /* EOC RC01335 */ 09190000
 END;                                                                   09200000
 END PROCESS_CURSOR;                                                    09210000
 /********************************************************************/ 09220000
 /*                                                                  */ 09230000
 /* MODULE NAME      : GET_ARRAY_VALUES                              */ 09240000
 /*                                                                  */ 09250000
 /* DESCRIPTION      : GET THE VALUES FROM THE ARRAY FOR RESPECTIVE  */ 09260000
 /*                    TRANSACTIONS RELATED TO CEDS.                 */ 09270000
 /*                                                                  */ 09280000
 /********************************************************************/ 09290000
 GET_ARRAY_VALUES: PROC;                                                09300000
                                                                        09310000
   IF F_MODEL_ARRAY_INT = TRUE THEN                                     09320000
     DO;                                                                09330000
       INT_ENTITYTYPE = MODEL_ARRAY(COUNT_ARRAY).ENTITYTYPE;            09340000
       INT_ENTITYID = MODEL_ARRAY(COUNT_ARRAY).ENTITYID;                09350000
       INT_DTSOFMSG = MODEL_ARRAY(COUNT_ARRAY).DTSOFMSG;                09360000
     END;                                                               09370000
   IF F_SEO_ARRAY_INT = TRUE THEN                     /* SOC RB01342 */ 09380000
     DO;                                                                09390000
       INT_ENTITYTYPE = SEO_ARRAY(COUNT_ARRAY).ENTITYTYPE;              09400000
       INT_ENTITYID = SEO_ARRAY(COUNT_ARRAY).ENTITYID;                  09410000
       INT_DTSOFMSG = SEO_ARRAY(COUNT_ARRAY).DTSOFMSG;                  09420000
     END;                                             /* EOC RB01342 */ 09430000
   IF F_GENAR_ARRAY_INT = TRUE THEN                                     09440000
     DO;                                                                09450000
       INT_ENTITYTYPE = GENAR_ARRAY(COUNT_ARRAY).ENTITYTYPE;            09460000
       INT_ENTITYID = GENAR_ARRAY(COUNT_ARRAY).ENTITYID;                09470000
       INT_DTSOFMSG = GENAR_ARRAY(COUNT_ARRAY).DTSOFMSG;                09480000
     END;                                                               09490000
   IF F_ROFER_ARRAY_INT = TRUE THEN                                     09500000
     DO;                                                                09510000
       INT_ENTITYTYPE = ROFER_ARRAY(COUNT_ARRAY).ENTITYTYPE;            09520000
       INT_ENTITYID = ROFER_ARRAY(COUNT_ARRAY).ENTITYID;                09530000
       INT_DTSOFMSG = ROFER_ARRAY(COUNT_ARRAY).DTSOFMSG;                09540000
     END;                                                               09550000
                                                                        09560000
 END GET_ARRAY_VALUES;                                                  09570000
1/********************************************************************/ 09580000
 /*                                                                  */ 09590000
 /* MODULE NAME      : RCBXC1M_MSG                                   */ 09600000
 /*                                                                  */ 09610000
 /* DESCRIPTION      : CALLS THE MESSAGE ROUTINE AFTER FILLING       */ 09620000
 /*                    THE INPUT VARIABLES                           */ 09630000
 /*                                                                  */ 09640000
 /********************************************************************/ 09650000
 RCBXC1M_MSG: PROC (A_MSG_NR);                                          09660000
                                                                        09670000
 DCL A_MSG_NR  CHAR(04);                                                09680000
                                               /* RESET COMMON FIELDS */09690000
 PARM_INT_AREA.MSG_VAR_CODES = ' ';                                     09700000
                                                                        09710000
 SELECT (A_MSG_NR);                                                     09720000
    /* 0281: XML FORMAT ERROR */                                        09730000
   WHEN ('0281')                                                        09740000
     DO;                                                                09750000
       DECIMAL_VAL                    = XML_EXCEPTION_1.RETURN_CODE;    09760000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           09770000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       09780000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'RX';                           09790000
       DECIMAL_VAL                    = XML_EXCEPTION_1.RETURN_CODE;    09800000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    09810000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'RS';                           09820000
       DECIMAL_VAL                    = XML_EXCEPTION_1.REASON_CODE;    09830000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = DECIMAL_VAL;                    09840000
       PARM_INT_AREA.MSG_VAR_CODE_8   = 'CO';                           09850000
       DECIMAL_VAL                    = XML_EXCEPTION_1.CURRENTOFFSET;  09860000
       PARM_INT_AREA.MSG_VAR_VALUE_8  = DECIMAL_VAL;                    09870000
                                                 /* SOC CEDS00000578 */ 09880000
  /*    ADDITIONAL DETAILS INCLUDED FOR XML MSG WITH FORMAT ERROR    */ 09890000
       PARM_INT_AREA.MSG_VAR_CODE_9   = 'TY';                           09900000
       PARM_INT_AREA.MSG_VAR_VALUE_9  = MSG_TYPE;                       09910000
       PARM_INT_AREA.MSG_VAR_CODE_10  = 'DT';                           09920000
       PARM_INT_AREA.MSG_VAR_VALUE_10 = MSG_DATE;                       09930000
                                                 /* EOC CEDS00000578 */ 09940000
     END;                                                               09950000
    /* 0282: DB2 ERROR FOR DUPLICATE RECORD INSERTION INTO TABLE */     09960000
   WHEN ('0282')                                                        09970000
     DO;                                                                09980000
       DECIMAL_VAL                    = SQLCA.SQLCODE;                  09990000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10000000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10010000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                           10020000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10030000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'ID';                           10040000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = ERROR_CODE_DET.CALL_ID;         10050000
                                                  /* SOC CEDS00000617 */10060000
       PARM_INT_AREA.MSG_VAR_CODE_8   = 'TP';                           10070000
       PARM_INT_AREA.MSG_VAR_VALUE_8  = MSG_INSERT.MSG_CREATE_DATE;     10080000
       PARM_INT_AREA.MSG_VAR_CODE_9   = 'TY';                           10090000
       PARM_INT_AREA.MSG_VAR_VALUE_9  = MSG_INSERT.MSG_TYPE;            10100000
                                                  /* EOC CEDS00000617 */10110000
     END;                                                               10120000
    /* 0283: DB2 ERROR IN INSERTING RECORD INTO TABLE T769 */           10130000
   WHEN ('0283')                                                        10140000
     DO;                                                                10150000
       DECIMAL_VAL                    = SQLCA.SQLCODE;                  10160000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10170000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10180000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                           10190000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10200000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'ID';                           10210000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = ERROR_CODE_DET.CALL_ID;         10220000
     END;                                                               10230000
    /* 0284: DB2 ERROR IN SELECTING THE COUNT FROM TABLE T769 */        10240000
   WHEN ('0284')                                                        10250000
     DO;                                                                10260000
       DECIMAL_VAL                    = SQLCA.SQLCODE;                  10270000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10280000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10290000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                           10300000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10310000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'ID';                           10320000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = ERROR_CODE_DET.CALL_ID;         10330000
     END;                                                               10340000
    /* 0285: COUNT MISMATCH FOR SPECIFIC MSG IN T769/RECON CNT */       10350000
   WHEN ('0285')                                                        10360000
     DO;                                                                10370000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10380000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10390000
       DECIMAL_VAL                    = WRK_COUNT_TABLE;                10400000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'CQ';                           10410000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10420000
       DECIMAL_VAL                    = COUNT_OF_ALL;                   10430000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'CQ';                           10440000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = DECIMAL_VAL;                    10450000
                                                  /* SOC CEDS00000597 */10460000
       PARM_INT_AREA.MSG_VAR_CODE_8   = 'ET';                           10470000
       PARM_INT_AREA.MSG_VAR_VALUE_8  = WRK_MSG_TYPE;                   10480000
                                                  /* EOC CEDS00000597 */10490000
     END;                                                               10500000
    /* 0286: COUNT MATCHING FOR SPECIFIC MSG IN T769/RECON CNT */       10510000
    /* THE NUMBER OF MESSAGES RECEIVED IN TIME PERIOD SPECIFIED*/       10520000
    /* IS SAME AS THE NUMBER OF MESSAGES IN RECONCILE MESSAGE  */       10530000
    /* MESSAGE RECONCILATION WILL HAPPEN ONLY AFTER VALIDATING */       10540000
    /* DTSOFMSG FOR THAT SPECIFIC MESSAGE                      */       10550000
   WHEN ('0286')                                                        10560000
     DO;                                                                10570000
       DECIMAL_VAL                    = WRK_COUNT_TABLE;                10580000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10590000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10600000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'CQ';                           10610000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10620000
                                                  /* SOC CEDS00000600 */10630000
       PARM_INT_AREA.MSG_VAR_CODE_8   = 'ET';                           10640000
       PARM_INT_AREA.MSG_VAR_VALUE_8  = WRK_MSG_TYPE;                   10650000
                                                  /* EOC CEDS00000600 */10660000
     END;                                                               10670000
    /* 0287: DB2 ERROR IN OPENING THE CURSOR CURS_RCBV0769_DELTA */     10680000
   WHEN ('0287')                                                        10690000
     DO;                                                                10700000
       DECIMAL_VAL                    = SQLCA.SQLCODE;                  10710000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10720000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10730000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                           10740000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10750000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'ID';                           10760000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = ERROR_CODE_DET.CALL_ID;         10770000
     END;                                                               10780000
    /* 0288: DB2 ERROR IN CLOSING THE CURSOR CURS_RCBV0769_DELTA */     10790000
   WHEN ('0288')                                                        10800000
     DO;                                                                10810000
       DECIMAL_VAL                    = SQLCA.SQLCODE;                  10820000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10830000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10840000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                           10850000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10860000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'ID';                           10870000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = ERROR_CODE_DET.CALL_ID;         10880000
     END;                                                               10890000
    /* 0289: DB2 ERROR IN FETCHING THE CURSOR CURS_RCBV0769_DELTA */    10900000
   WHEN ('0289')                                                        10910000
     DO;                                                                10920000
       DECIMAL_VAL                    = SQLCA.SQLCODE;                  10930000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           10940000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       10950000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                           10960000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = DECIMAL_VAL;                    10970000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'ID';                           10980000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = ERROR_CODE_DET.CALL_ID;         10990000
     END;                                                               11000000
    /* 0290: RECORD NOT PRESENT IN XML FILE */                          11010000
   WHEN ('0290')                                                        11020000
     DO;                                                                11030000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           11040000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       11050000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'TP';                           11060000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = TB_MSG_CREATE_DATE;             11070000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'EI';                           11080000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = TB_MSG_ENTITY_ID;               11090000
       PARM_INT_AREA.MSG_VAR_CODE_8   = 'ET';                           11100000
                                                  /* SOC CEDS00000587 */11110000
    /* PARM_INT_AREA.MSG_VAR_VALUE_8  = INT_ENTITYTYPE;*/               11120000
       PARM_INT_AREA.MSG_VAR_VALUE_8  = WRK_MSG_TYPE;                   11130000
                                                  /* EOC CEDS00000587 */11140000
     END;                                                               11150000
    /* 0291: RECORD NOT PRESENT IN TABLE T769 */                        11160000
   WHEN ('0291')                                                        11170000
     DO;                                                                11180000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           11190000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       11200000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'TP';                           11210000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = INT_DTSOFMSG;                   11220000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'EI';                           11230000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = INT_ENTITYID;                   11240000
       PARM_INT_AREA.MSG_VAR_CODE_8   = 'ET';                           11250000
       PARM_INT_AREA.MSG_VAR_VALUE_8  = INT_ENTITYTYPE;                 11260000
   END;                                                                 11270000
                                                /* SOC CEDS00000587 */  11280000
    /* 0320: INVALID PERIODIC MESSAGES */                               11290000
   WHEN ('0320')                                                        11300000
     DO;                                                                11310000
       PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                           11320000
       PARM_INT_AREA.MESSAGE_NUMBER   = A_MSG_NR;                       11330000
       PARM_INT_AREA.MSG_VAR_CODE_6   = 'TP';                           11340000
       PARM_INT_AREA.MSG_VAR_VALUE_6  = INT_DTSOFMSG;                   11350000
       PARM_INT_AREA.MSG_VAR_CODE_7   = 'ET';                           11360000
       PARM_INT_AREA.MSG_VAR_VALUE_7  = INT_ENTITYTYPE;                 11370000
       PARM_INT_AREA.MSG_VAR_CODE_8   = 'EI';                           11380000
       PARM_INT_AREA.MSG_VAR_VALUE_8  = INT_ENTITYID;                   11390000
   END;                                                                 11400000
                                                  /* EOC CEDS00000587 */11410000
   OTHERWISE;                                                           11420000
 END;                                                                   11430000
                                                                        11440000
 CALL RCB0M1M(PTR_INT_AREA);                                            11450000
                                                                        11460000
 END RCBXC1M_MSG;                                                       11470000
                                                  /* SOC CEDS00000587 */11480000
  IF INV_PERIODIC THEN                                                  11490000
  DO;                                                                   11500000
                                                                        11510000
    DO WHILE(INV_PER_GEN ¬= 0);                                         11520000
       INT_ENTITYTYPE     =  GENAR_ARRAY(INV_PER_GEN).ENTITYTYPE;       11530000
       INT_ENTITYID       =  GENAR_ARRAY(INV_PER_GEN).ENTITYID;         11540000
       INT_DTSOFMSG       =  GENAR_ARRAY(INV_PER_GEN).DTSOFMSG;         11550000
       CALL RCBXC1M_MSG('0320');                                        11560000
       INV_PER_GEN        = INV_PER_GEN - 1;                            11570000
    END;                                                                11580000
  END;                                           /* EOC CEDS00000587 */ 11590000
                                                                        11600000
 END RCBXC1M;                                /* END OF MAIN PROGRAM  */ 11610000
 /********************************************************************/ 11620000
 /*  BIT SWITCHES                                                    */ 11630000
 /********************************************************************/ 11640000
 DCL (ADDR, SUBSTR) BUILTIN;                                            11650000
 DCL (NULL,INDEX,TRANSLATE BUILTIN);                 /* CEDS00000679 */ 11660000
 DCL TRUE                            BIT(1) INIT('1'B);                 11670000
 DCL FALSE                           BIT(1) INIT('0'B);                 11680000
 DCL F_MSG_ELEMENT                   BIT(1) INIT('0'B);                 11690000
 DCL F_MODEL_ARRAY                   BIT(1) INIT('0'B);                 11700000
 DCL F_SEO_ARRAY                     BIT(1) INIT('0'B);   /* RB01342 */ 11710000
 DCL F_GENAR_ARRAY                   BIT(1) INIT('0'B);                 11720000
 DCL F_ROFER_ARRAY                   BIT(1) INIT('0'B);                 11730000
 DCL F_VERIFY_COUNT                  BIT(1) INIT('0'B);                 11740000
 DCL F_CHK_MSG_TYPE                  BIT(1) INIT('0'B);                 11750000
                                                  /* SOC CEDS00000587 */11760000
 DCL F_MODEL_ARRAY_INT               BIT(1) INIT('0'B);                 11770000
 DCL F_SEO_ARRAY_INT                 BIT(1) INIT('0'B);   /* RB01342 */ 11780000
 DCL F_GENAR_ARRAY_INT               BIT(1) INIT('0'B);                 11790000
 DCL F_ROFER_ARRAY_INT               BIT(1) INIT('0'B);                 11800000
 DCL F_CHK_MSG_ID                    BIT(1) INIT('0'B);                 11810000
 DCL F_CHK_MSG_DTS                   BIT(1) INIT('0'B);                 11820000
 /*                                                                     11830000
 DCL F_TYP_DELTA                     BIT(1) INIT('0'B);                 11840000
 DCL F_TYP_REFRESH                   BIT(1) INIT('0'B); */              11850000
 DCL INV_PERIODIC                    BIT(1) INIT('0'B);                 11860000
                                                  /* EOC CEDS00000587 */11870000
                                                       /* SOC RC01345 */11880000
 /*DCL SWITCH_END_OF_CURS_REF        BIT(1) INIT('0'B);*/  /* RC01335 */11890000
                                                       /* EOC RC01345 */11900000
                                                 /* SOC  CEDS00000679 */11910000
 DCL REF_PRODUCTID                   CHAR(7) INIT(' ');                 11920000
 DCL REF_PRODUCTID_1                 CHAR(7) INIT(' ');                 11930000
                                                 /* EOC  CEDS00000679 */11940000
                                                                        11950000
 DCL 1 XML_ELEMENT_FLAG,                                                11960000
     3 MODEL_UPDATE_FLAGS,                                              11970000
       5 F_MODEL_UPDATE              BIT (1) INIT('0'B),                11980000
       5 F_DTSOFMSG                  BIT (1) INIT('0'B),                11990000
       5 F_STATUS                    BIT (1) INIT('0'B),                12000000
       5 F_MODELENTITYTYPE           BIT (1) INIT('0'B),                12010000
       5 F_MODELENTITYID             BIT (1) INIT('0'B),                12020000
                                                 /* SOC CEDS00000617  */12030000
       5 F_REPLMODELLIST             BIT (1) INIT('0'B),                12040000
                                                 /* SOC CEDS00000617  */12050000
       5 F_MACHTYPE                  BIT (1) INIT('0'B),                12060000
       5 F_MODEL                     BIT (1) INIT('0'B),                12070000
       5 F_LANGUAGELIST              BIT (1) INIT('0'B),                12080000
       5 F_AVAILABILITYLIST          BIT (1) INIT('0'B),                12090000
                                                      /* SOC RB01342 */ 12100000
     3 SEO_UPDATE_FLAGS,                                                12110000
       5 F_SEO_UPDATE                BIT (1) INIT('0'B),                12120000
       5 F_DTSOFMSG                  BIT (1) INIT('0'B),                12130000
       5 F_STATUS                    BIT (1) INIT('0'B),                12140000
       5 F_SEOENTITYTYPE             BIT (1) INIT('0'B),                12150000
       5 F_SEOENTITYID               BIT (1) INIT('0'B),                12160000
       5 F_SEOID                     BIT (1) INIT('0'B),                12170000
       5 F_LANGUAGELIST              BIT (1) INIT('0'B),                12180000
       5 F_AVAILABILITYLIST          BIT (1) INIT('0'B),                12190000
                                                       /* EOC RB01342 */12200000
     3 REFOFER_UPDATE_FLAGS,                                            12210000
       5 F_REFOFER_UPDATE            BIT (1) INIT('0'B),                12220000
       5 F_DTSOFMSG                  BIT (1) INIT('0'B),                12230000
       5 F_STATUS                    BIT (1) INIT('0'B),                12240000
       5 F_ENTITYTYPE                BIT (1) INIT('0'B),                12250000
       5 F_ENTITYID                  BIT (1) INIT('0'B),                12260000
       5 F_PRODUCTID                 BIT (1) INIT('0'B),                12270000
       5 F_LANGUAGELIST              BIT (1) INIT('0'B),                12280000
     3 GENERALAREA_UPDATE_FLAGS,                                        12290000
       5 F_GENERALAREA_UPDATE        BIT (1) INIT('0'B),                12300000
       5 F_DTSOFMSG                  BIT (1) INIT('0'B),                12310000
       5 F_GENAREANAME_FC            BIT (1) INIT('0'B),                12320000
       5 F_GENAREAELEMENT            BIT (1) INIT('0'B),                12330000
     3 RECONCILE_MSGS_FLAGS,                                            12340000
       5 F_RECONCILE_MSGS            BIT (1) INIT('0'B),                12350000
       5 F_DTSOFMSG                  BIT (1) INIT('0'B),                12360000
       5 F_FROMMSGDTS                BIT (1) INIT('0'B),                12370000
       5 F_TOMSGDTS                  BIT (1) INIT('0'B),                12380000
       5 F_MSGLIST                   BIT (1) INIT('0'B),                12390000
       5 F_MSGELEMENT                BIT (1) INIT('0'B),                12400000
       5 MSGELEMENT,                                                    12410000
         7 F_SETUPENTITYTYPE         BIT (1) INIT('0'B),                12420000
         7 F_SETUPENTITYID           BIT (1) INIT('0'B),                12430000
         7 F_SETUPDTS                BIT (1) INIT('0'B),/*CEDS00000587*/12440000
         7 F_MSGTYPE                 BIT (1) INIT('0'B),                12450000
         7 F_MSGCOUNT                BIT (1) INIT('0'B),                12460000
         7 F_ENTITYLIST              BIT (1) INIT('0'B),                12470000
         7 F_ENTITYELEMENT           BIT (1) INIT('0'B),                12480000
         7 ENTITYELEMENT,                                               12490000
           9 F_ENTITYTYPE            BIT (1) INIT('0'B),                12500000
           9 F_ENTITYID              BIT (1) INIT('0'B),                12510000
           9 F_ENTITYDTSOFMSG        BIT (1) INIT('0'B);                12520000
                                                      /* SOC RC01335 */ 12530000
                                                 /* SOC CEDS00000612 */ 12540000
 /* DCL 1 F_NOT_IN_TAB                  BIT (1) INIT('0'B);          */ 12550000
                                                 /* EOC CEDS00000612 */ 12560000
                                                      /* EOC RC01335 */ 12570000
                                                                        12580000
 /********************************************************************/ 12590000
 /*  USED TEMPORARY FIELDS DECLARATION                               */ 12600000
 /********************************************************************/ 12610000
 DCL 1 MODEL_ARRAY(30000),                                              12620000
     9 ENTITYTYPE                    CHAR(50),                          12630000
     9 ENTITYID                      CHAR(08),                          12640000
     9 DTSOFMSG                      CHAR(26);                          12650000
                                                                        12660000
                                                      /* SOC RB01342 */ 12670000
 DCL 1 SEO_ARRAY(30000),                                                12680000
     9 ENTITYTYPE                    CHAR(50),                          12690000
     9 ENTITYID                      CHAR(08),                          12700000
     9 DTSOFMSG                      CHAR(26);                          12710000
                                                      /* EOC RB01342 */ 12720000
 DCL 1 GENAR_ARRAY(30000),                                              12730000
     9 ENTITYTYPE                    CHAR(50),                          12740000
     9 ENTITYID                      CHAR(08),                          12750000
     9 DTSOFMSG                      CHAR(26);                          12760000
                                                                        12770000
 DCL 1 ROFER_ARRAY(30000),                                              12780000
     9 ENTITYTYPE                    CHAR(50),                          12790000
     9 ENTITYID                      CHAR(08),                          12800000
     9 DTSOFMSG                      CHAR(26);                          12810000
                                                                        12820000
 DCL 1 MSG_INSERT,                                                      12830000
       5 MSG_CREATE_DATE             CHAR(26) INIT(''),                 12840000
       5 MSG_ENTITY_ID               CHAR(08) INIT(''),                 12850000
       5 MSG_TYPE                    CHAR(50) VAR INIT(''),             12860000
       5 MSG_TYPE_OF_MODE            CHAR(07) INIT(''),                 12870000
                                                /* SOC CEDS00000679 */  12880000
    /* 5 MSG_DETAILS                 CHAR(254) VAR  INIT('');*/         12890000
       5 MSG_DETAILS                 CHAR(254) INIT('');                12890100
                                                /* EOC CEDS00000679 */  12890200
                                                                        12890300
 DCL 1 MSG_INSERT_1 LIKE MSG_INSERT;                /* CEDS00000679 */  12890400
 DCL 1 XML_CONTENT,                                                     12890500
      3 MODEL_UPD,                                                      12890600
       5 STATUS                      CHAR(04) INIT(''),                 12890700
       5 DTSOFMSG                    CHAR(26) INIT(''),                 12890800
       5 MODELENTITYTYPE             CHAR(50) VAR INIT(''),             12890900
       5 MODELENTITYID               CHAR(08) INIT(''),                 12891000
       5 MACHTYPE                    CHAR(04) INIT(''),                 12892000
       5 MODEL                       CHAR(03) INIT(''),                 12893000
                                                       /* SOC RB01342 */12894000
         3 SEO_UPD,                                                     12895000
          5 STATUS                   CHAR(04) INIT(''),                 12896000
          5 DTSOFMSG                 CHAR(26) INIT(''),                 12897000
          5 SEOENTITYTYPE            CHAR(50) VAR INIT(''),             12898000
          5 SEOENTITYID              CHAR(08) INIT(''),                 12899000
          5 SEOID                    CHAR(07) INIT(''),                 12900000
                                                       /* EOC RB01342 */12910000
         3 REFOFER_UPD,                                                 12920000
          5 STATUS                   CHAR(04) INIT(''),                 12930000
          5 DTSOFMSG                 CHAR(26) INIT(''),                 12940000
          5 ENTITYTYPE               CHAR(50) VAR INIT(''),             12950000
          5 ENTITYID                 CHAR(08) INIT(''),                 12960000
          5 PRODUCTID                CHAR(07) INIT(''),                 12970000
         3 GENAREA_UPD,                                                 12980000
          5 DTSOFMSG                 CHAR(26) INIT(''),                 12990000
          5 GENAREANAME_FC           CHAR(04) VAR INIT(''),             13000000
         3 RECONCILE_MSGS,                                              13010000
          5 DTSOFMSG                 CHAR(26) INIT(''),                 13020000
          5 FROMMSGDTS               CHAR(26) INIT(''),                 13030000
          5 TOMSGDTS                 CHAR(26) INIT(''),                 13040000
          5 MSGELEMENT,                                                 13050000
           7 SETUPENTITYTYPE         CHAR(50) VAR INIT(''),             13060000
           7 SETUPENTITYID           CHAR(50) VAR INIT(''),             13070000
                                                  /* SOC CEDS00000587 */13080000
           7 SETUPDTS                CHAR(50) VAR INIT(''),             13090000
                                                  /* EOC CEDS00000587 */13100000
           7 MSGTYPE                 CHAR(50) VAR INIT(''),             13110000
           7 MSGCOUNT                FIXED BIN(31) INIT('0'),           13120000
           7 ENTITYELEMENT,                                             13130000
             9 ENTITYTYPE            CHAR(50) VAR,                      13140000
             9 ENTITYID              CHAR(08),                          13150000
             9 ENTITYDTSOFMSG        CHAR(26);                          13160000
                                                                        13170000
    DCL 1 XML_UNBOUND_COUNT,                                            13180000
         3 MODEL_UPD_UCOUNT,                                            13190000
          5 CNT_LANG_ELEMENT         FIXED BIN(31) INIT(0),             13200000
          5 CNT_AVAIL_ELEMENT        FIXED BIN(31) INIT(0),             13210000
                                                       /* SOC RB01342 */13220000
         3 SEO_UPD_UCOUNT,                                              13230000
          5 CNT_LANG_ELEMENT_SEO     FIXED BIN(31) INIT(0),             13240000
          5 CNT_AVAIL_ELEMENT_SEO    FIXED BIN(31) INIT(0),             13250000
                                                       /* EOC RB01342 */13260000
         3 REFOFER_UPD_UCOUNT,                                          13270000
          5 CNT_LANG_ELEMENT         FIXED BIN(31) INIT(0),             13280000
         3 GENAREA_UPD_UCOUNT,                                          13290000
          5 CNT_GEN_ELEMENT          FIXED BIN(31) INIT(0);             13300000
    DCL COUNT_MSG_DETAILS            FIXED BIN(31);                     13310000
    DCL 1 COUNT_MSG_TYPES,                                              13320000
          3 COUNT_MODEL              FIXED BIN(31) INIT(0),             13330000
          3 COUNT_SEO                FIXED BIN(31) INIT(0),/* RB01342 */13340000
          3 COUNT_GENAR              FIXED BIN(31) INIT(0),             13350000
                                                  /* SOC CEDS00000587 */13360000
          3 INV_PER_GEN              FIXED BIN(31) INIT(0),             13370000
                                                  /* EOC CEDS00000587 */13380000
          3 COUNT_ROFER              FIXED BIN(31) INIT(0);             13390000
                                                 /* SOC CEDS00000612 */ 13400000
    DCL 1 GENAR_MSG_COUNT(32767)     FIXED BIN(31) INIT(0);             13410000
    DCL 1 M                          FIXED BIN(31) INIT(0);             13420000
                                                 /* EOC CEDS00000612 */ 13430000
                                                                        13440000
    DCL 1 XML_EXCEPTION,                                                13450000
         3 RETURN_CODE               FIXED BIN(31),                     13460000
         3 REASON_CODE               FIXED BIN(31),                     13470000
         3 CURRENTOFFSET             FIXED BIN(31);                     13480000
                                                                        13490000
    DCL 1 XML_EXCEPTION_1,                                              13500000
         3 RETURN_CODE               FIXED BIN(31),                     13510000
         3 REASON_CODE               FIXED BIN(31),                     13520000
         3 CURRENTOFFSET             FIXED BIN(31);                     13530000
                                                                        13540000
    DCL 1 XML_KEY,                                                      13550000
         3 XML_MSG_TYPE              CHAR(25),                          13560000
         3 XML_MSG_STATUS            CHAR(4),                           13570000
         3 XML_MSG_DATE              CHAR(26);                          13580000
                                                                        13590000
    DCL MQ_TYPE                      CHAR(7) INIT ('');                 13600000
    DCL PRODUCTID_TEMP               CHAR(7);                           13610000
    DCL XML_EXCEPTION_F              CHAR(1) INIT ('N');                13620000
    DCL ST_OF_ELEMENT                CHAR(50) VAR;                      13630000
    DCL ED_OF_ELEMENT                CHAR(50) VAR;                      13640000
    DCL XML_TYPE_OF_MODE             CHAR(07) INIT ('');                13650000
                                                                        13660000
    DCL CHARS                        CHAR(32000) BASED;                 13670000
    DCL XML_CONTENT_CHARS            CHAR(500) VAR;                     13680000
    DCL MESSAGE_CHAR                 CHAR(254);                         13690000
                                                                        13700000
1/********************************************************************/ 13710000
 /* MODULE NAME      : START_OF_DOCUMENT                             */ 13720000
 /********************************************************************/ 13730000
  START_OF_DOCUMENT:                                                    13740000
    PROC( USERTOKEN )                                                   13750000
    RETURNS( BYVALUE FIXED BIN(31) )                                    13760000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                13770000
                                                                        13780000
    DCL USERTOKEN                    POINTER;                           13790000
    DCL XMLTOKEN                     POINTER;                           13800000
    DCL TOKENLENGTH                  FIXED BIN(31);                     13810000
    DCL CURRENTOFFSET                FIXED BIN(31);                     13820000
    DCL RETURN_CODE                  FIXED BIN(31);                     13830000
    DCL REASON_CODE                  FIXED BIN(31);                     13840000
                                                                        13850000
    XML_MSG_STATUS                   = '0000';                          13860000
    XML_MSG_DATE                     = '0001-01-01-00.00.00.000000';    13870000
    XML_KEY.XML_MSG_TYPE             = '';                              13880000
                                                                        13890000
    F_MODEL_ARRAY                    = FALSE;                           13900000
    F_SEO_ARRAY                      = FALSE;             /* RB01342 */ 13910000
    F_GENAR_ARRAY                    = FALSE;                           13920000
    F_ROFER_ARRAY                    = FALSE;                           13930000
                                                                        13940000
    MSG_INSERT.MSG_CREATE_DATE       = '';                              13950000
    MSG_INSERT.MSG_ENTITY_ID         = '';                              13960000
    MSG_INSERT.MSG_TYPE              = '';                              13970000
    MSG_INSERT.MSG_TYPE_OF_MODE      = '';                              13980000
    MSG_INSERT.MSG_DETAILS           = '';                              13990000
    MSG_INSERT_1                      = '';        /* CEDS00000679 */   14000000
    XML_EXCEPTION.RETURN_CODE        = RETURN_CODE;                     14010000
    XML_EXCEPTION.REASON_CODE        = REASON_CODE;                     14020000
    XML_EXCEPTION.CURRENTOFFSET      = CURRENTOFFSET;                   14030000
                                                                        14040000
    MODEL_UPD_UCOUNT.CNT_LANG_ELEMENT     = 0;                          14050000
    MODEL_UPD_UCOUNT.CNT_AVAIL_ELEMENT    = 0;                          14060000
    SEO_UPD_UCOUNT.CNT_LANG_ELEMENT_SEO   = 0;        /* SOC RB01342 */ 14070000
    SEO_UPD_UCOUNT.CNT_AVAIL_ELEMENT_SEO  = 0;        /* EOC RB01342 */ 14071000
    REFOFER_UPD_UCOUNT.CNT_LANG_ELEMENT   = 0;                          14072000
    GENAREA_UPD_UCOUNT.CNT_GEN_ELEMENT    = 0;                          14073000
    COUNT_MSG_DETAILS                     = 1;                          14074000
    RETURN(0);                                                          14075000
  END;                                                                  14076000
                                                                        14077000
1/********************************************************************/ 14078000
 /* MODULE NAME      : VERSION_INFORMATION                           */ 14079000
 /********************************************************************/ 14080000
  VERSION_INFORMATION:                                                  14090000
                                                                        14100000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            14110000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14120000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14130000
                                                                        14140000
    DCL USERTOKEN                    POINTER;                           14150000
    DCL XMLTOKEN                     POINTER;                           14160000
    DCL TOKENLENGTH                  FIXED BIN(31);                     14170000
                                                                        14180000
    RETURN(0);                                                          14190000
  END;                                                                  14200000
1/********************************************************************/ 14210000
 /* MODULE NAME      : ENCODING_DECLARATION                          */ 14220000
 /********************************************************************/ 14230000
  ENCODING_DECLARATION:                                                 14240000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            14250000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14260000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14270000
                                                                        14280000
    DCL USERTOKEN                    POINTER;                           14290000
    DCL XMLTOKEN                     POINTER;                           14300000
    DCL TOKENLENGTH                  FIXED BIN(31);                     14310000
    RETURN(0);                                                          14320000
  END;                                                                  14330000
1/********************************************************************/ 14340000
 /* MODULE NAME      : STANDALONE_DECLARATION                        */ 14350000
 /********************************************************************/ 14360000
  STANDALONE_DECLARATION:                                               14370000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            14380000
    RETURNS( BYVALUE FIXED BIN(31))                                     14390000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14400000
                                                                        14410000
    DCL USERTOKEN                    POINTER;                           14420000
    DCL XMLTOKEN                     POINTER;                           14430000
    DCL TOKENLENGTH                  FIXED BIN(31);                     14440000
                                                                        14450000
    RETURN(0);                                                          14460000
  END;                                                                  14470000
1/********************************************************************/ 14480000
 /* MODULE NAME      : DOCUMENT_TYPE_DECLARATION                     */ 14490000
 /********************************************************************/ 14500000
  DOCUMENT_TYPE_DECLARATION:                                            14510000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            14520000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14530000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14540000
                                                                        14550000
    DCL USERTOKEN                    POINTER;                           14560000
    DCL XMLTOKEN                     POINTER;                           14570000
    DCL TOKENLENGTH                  FIXED BIN(31);                     14580000
                                                                        14590000
    RETURN(0);                                                          14600000
  END;                                                                  14610000
1/********************************************************************/ 14620000
 /* MODULE NAME      : NAMESPACE_DECLARE                             */ 14630000
 /********************************************************************/ 14640000
  NAMESPACE_DECLARE:                                                    14650000
    PROC( USERTOKEN, NSPREFIX, NSPREFIXLENGTH,                          14660000
                     NSURI, NSURILENGTH )                               14670000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14680000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14690000
                                                                        14700000
    DCL USERTOKEN                    POINTER;                           14710000
    DCL NSPREFIX                     POINTER;                           14720000
    DCL NSPREFIXLENGTH               FIXED BIN(31);                     14730000
    DCL NSURI                        POINTER;                           14740000
    DCL NSURILENGTH                  FIXED BIN(31);                     14750000
                                                                        14760000
    RETURN(0);                                                          14770000
  END;                                                                  14780000
1/********************************************************************/ 14790000
 /* MODULE NAME      : END_OF_DOCUMENT                               */ 14800000
 /********************************************************************/ 14810000
  END_OF_DOCUMENT:                                                      14820000
    PROC( USERTOKEN )                                                   14830000
    RETURNS( BYVALUE FIXED BIN(31) )                                    14840000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                14850000
                                                                        14860000
    DCL USERTOKEN                    POINTER;                           14870000
    DCL CURRENTOFFSET                FIXED BIN(31);                     14880000
    DCL RETURN_CODE                  FIXED BIN(31);                     14890000
    DCL REASON_CODE                  FIXED BIN(31);                     14900000
                                                                        14910000
    XML_EXCEPTION.RETURN_CODE        = RETURN_CODE;                     14920000
    XML_EXCEPTION.REASON_CODE        = REASON_CODE;                     14930000
    XML_EXCEPTION.CURRENTOFFSET      = CURRENTOFFSET;                   14940000
                                                                        14950000
                                                                        14960000
    RETURN(0);                                                          14970000
  END;                                                                  14980000
1/********************************************************************/ 14990000
 /* MODULE NAME      : START_OF_ELEMENT                              */ 15000000
 /********************************************************************/ 15010000
  START_OF_ELEMENT:                                                     15020000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             15030000
          NSPREFIX, NSPREFIXLENGTH,                                     15040000
          NSURI, NSURILENGTH )                                          15050000
    RETURNS( BYVALUE FIXED BIN(31) )                                    15060000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                15070000
                                                                        15080000
    DCL USERTOKEN                    POINTER;                           15090000
    DCL XMLTOKEN                     POINTER;                           15100000
    DCL TOKENLENGTH                  FIXED BIN(31);                     15110000
    DCL NSPREFIX                     POINTER;                           15120000
    DCL NSPREFIXLENGTH               FIXED BIN(31);                     15130000
    DCL NSURI                        POINTER;                           15140000
    DCL NSURILENGTH                  FIXED BIN(31);                     15150000
                                                                        15160000
                                                /* SOC CEDS00000679 */  15170000
    DCL ST_ELEMENT_PTR               POINTER;                           15180000
    DCL TEMP_ST_ELEMENT              CHAR(50) VARYING;                  15190000
    DCL ST_ELEMENT_PTR_1             POINTER;                           15200000
    DCL TEMP_ST_ELEMENT_1            CHAR(50) VARYING;                  15210000
    DCL TEMP_CONVERT                 FIXED BIN(31) INIT(0);             15220000
    DCL TEMP_LENGTH                  FIXED BIN(31) INIT(0);             15230000
                                                /* EOC CEDS00000679 */  15240000
                                                                        15260000
    ST_OF_ELEMENT              = '';                                    15270000
    ED_OF_ELEMENT              = '';                                    15280000
                                                /* SOC CEDS00000679 */  15290000
  /*ST_OF_ELEMENT              = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );15300000
  */                                                                    15310000
    TEMP_ST_ELEMENT            = '';                                    15320000
    TEMP_ST_ELEMENT_1          = '';                                    15330000
    /***************** CONVERTING TO EBCDIC ********************/       15340000
                                                                        15350000
    TEMP_ST_ELEMENT_1          = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );15360000
    ST_ELEMENT_PTR_1           = ADDR(TEMP_ST_ELEMENT_1);               15370000
    ST_ELEMENT_PTR             = ADDR(TEMP_ST_ELEMENT);                 15371000
    TEMP_LENGTH                = TOKENLENGTH + 2;                       15372000
                                                                        15373000
    TEMP_CONVERT  = MEMCONVERT (ST_ELEMENT_PTR,TEMP_LENGTH,500,         15376000
                               ST_ELEMENT_PTR_1,TEMP_LENGTH,1208);      15377000
    ST_OF_ELEMENT = SUBSTR(TEMP_ST_ELEMENT,1,TOKENLENGTH);              15378000
                                                /* EOC CEDS00000679 */  15379100
                                                                        15379200
    IF ST_OF_ELEMENT = 'MODEL_UPDATE'       |                           15379300
       ST_OF_ELEMENT = 'SEO_UPDATE'         |             /* RB01342 */ 15379400
       ST_OF_ELEMENT = 'REFOFER_UPDATE'     |                           15379500
       ST_OF_ELEMENT = 'GENERALAREA_UPDATE' |                           15379600
       ST_OF_ELEMENT = 'RECONCILE_MSGS'       THEN                      15379700
       XML_MSG_TYPE  = ST_OF_ELEMENT;                                   15379800
                /* IDENTIFY THE MSG TYPE AND SET THE RESPECTIVE FLAG */ 15379900
    IF ST_OF_ELEMENT    = 'MODEL_UPDATE' THEN                           15380000
       F_MODEL_UPDATE   = TRUE;                                         15410000
                                                                        15430000
    IF ST_OF_ELEMENT    = 'SEO_UPDATE' THEN           /* SOC RB01342 */ 15440000
       F_SEO_UPDATE   = TRUE;                         /* EOC RB01342 */ 15450000
                                                                        15460000
    IF ST_OF_ELEMENT    = 'REFOFER_UPDATE' THEN                         15470000
       F_REFOFER_UPDATE = TRUE;                                         15480000
                                                                        15500000
                                                                        15501001
    IF ST_OF_ELEMENT    = 'GENERALAREA_UPDATE' THEN                     15510000
       F_GENERALAREA_UPDATE = TRUE;                                     15520000
                                                                        15530000
    IF ST_OF_ELEMENT    = 'RECONCILE_MSGS' THEN                         15540000
       F_RECONCILE_MSGS = TRUE;                                         15550000
                                                                        15560000
     /* SET THE CORRESPONDING START OF ELEMENT FLAG FOR MODEL UPDATE */ 15570000
    IF F_MODEL_UPDATE   = TRUE THEN                                     15580000
      DO;                                                               15590000
        IF ST_OF_ELEMENT = 'DTSOFMSG' THEN                              15600000
           MODEL_UPDATE_FLAGS.F_DTSOFMSG = TRUE;                        15610000
                                                                        15620000
        IF ST_OF_ELEMENT = 'STATUS' THEN                                15630000
            MODEL_UPDATE_FLAGS.F_STATUS   = TRUE;                       15640000
                                                                        15650000
        IF ST_OF_ELEMENT  = 'MODELENTITYTYPE' THEN                      15660000
           MODEL_UPDATE_FLAGS.F_MODELENTITYTYPE = TRUE;                 15670000
                                                                        15680000
        IF ST_OF_ELEMENT = 'MODELENTITYID' THEN                         15690000
           MODEL_UPDATE_FLAGS.F_MODELENTITYID = TRUE;                   15700000
                                                                        15710000
                                                 /* SOC CEDS00000617  */15720000
        IF ST_OF_ELEMENT = 'REPLMODELLIST' THEN                         15730000
           MODEL_UPDATE_FLAGS.F_REPLMODELLIST = TRUE;                   15740000
                                                 /* EOC CEDS00000617  */15750000
                                                                        15760000
        IF ST_OF_ELEMENT = 'MACHTYPE' THEN                              15770000
          DO;                                                           15780000
            MODEL_UPDATE_FLAGS.F_MACHTYPE = TRUE;                       15790000
          END;                                                          15800000
                                                                        15820000
        IF ST_OF_ELEMENT = 'MODEL' THEN                                 15830000
           MODEL_UPDATE_FLAGS.F_MODEL = TRUE;                           15840000
                                                                        15850000
        IF ST_OF_ELEMENT = 'LANGUAGELIST' THEN                          15860000
           MODEL_UPDATE_FLAGS.F_LANGUAGELIST = TRUE;                    15870000
                                                                        15880000
        IF ST_OF_ELEMENT = 'AVAILABILITYLIST' THEN                      15890000
           MODEL_UPDATE_FLAGS.F_AVAILABILITYLIST = TRUE;                15900000
                                                                        15910000
                        /* GET THE UNBOUNDED COUNTS FOR MODEL UPDATE */ 15920000
        IF MODEL_UPDATE_FLAGS.F_LANGUAGELIST = TRUE &                   15930000
           ST_OF_ELEMENT = 'LANGUAGEELEMENT' THEN                       15940000
           MODEL_UPD_UCOUNT.CNT_LANG_ELEMENT =                          15950000
           MODEL_UPD_UCOUNT.CNT_LANG_ELEMENT + 1;                       15960000
                                                                        15970000
        IF MODEL_UPDATE_FLAGS.F_AVAILABILITYLIST = TRUE &               15980000
           ST_OF_ELEMENT = 'AVAILABILITYELEMENT' THEN                   15990000
           MODEL_UPD_UCOUNT.CNT_AVAIL_ELEMENT =                         16000000
           MODEL_UPD_UCOUNT.CNT_AVAIL_ELEMENT + 1;                      16010000
      END;                                                              16020000
                                                    /* SOC RB01342 */   16030000
     /* SET THE CORRESPONDING START OF ELEMENT FLAG FOR SEO UPDATE */   16031000
    IF F_SEO_UPDATE   = TRUE THEN                                       16033000
      DO;                                                               16034000
        IF ST_OF_ELEMENT = 'DTSOFMSG' THEN                              16035000
           SEO_UPDATE_FLAGS.F_DTSOFMSG = TRUE;                          16036000
                                                                        16037000
        IF ST_OF_ELEMENT = 'STATUS' THEN                                16038000
           SEO_UPDATE_FLAGS.F_STATUS   = TRUE;                          16039000
                                                                        16039100
        IF ST_OF_ELEMENT  = 'ENTITYTYPE' THEN                           16039200
           SEO_UPDATE_FLAGS.F_SEOENTITYTYPE = TRUE;                     16039300
                                                                        16039400
        IF ST_OF_ELEMENT = 'ENTITYID' THEN                              16039500
           SEO_UPDATE_FLAGS.F_SEOENTITYID = TRUE;                       16039600
                                                                        16039700
        IF ST_OF_ELEMENT = 'SEOID' THEN                                 16039800
           SEO_UPDATE_FLAGS.F_SEOID = TRUE;                             16039900
                                                                        16040000
        IF ST_OF_ELEMENT = 'LANGUAGELIST' THEN                          16040100
           SEO_UPDATE_FLAGS.F_LANGUAGELIST = TRUE;                      16040200
                                                                        16040300
        IF ST_OF_ELEMENT = 'AVAILABILITYLIST' THEN                      16040400
           SEO_UPDATE_FLAGS.F_AVAILABILITYLIST = TRUE;                  16040500
                                                                        16040600
                        /* GET THE UNBOUNDED COUNTS FOR SEO UPDATE */   16040700
        IF SEO_UPDATE_FLAGS.F_LANGUAGELIST = TRUE &                     16040800
           ST_OF_ELEMENT = 'LANGUAGEELEMENT' THEN                       16040900
           SEO_UPD_UCOUNT.CNT_LANG_ELEMENT_SEO =                        16041000
           SEO_UPD_UCOUNT.CNT_LANG_ELEMENT_SEO + 1;                     16041100
                                                                        16041200
        IF SEO_UPDATE_FLAGS.F_AVAILABILITYLIST = TRUE &                 16041300
           ST_OF_ELEMENT = 'AVAILABILITYELEMENT' THEN                   16041400
           SEO_UPD_UCOUNT.CNT_AVAIL_ELEMENT_SEO =                       16041500
           SEO_UPD_UCOUNT.CNT_AVAIL_ELEMENT_SEO + 1;                    16041600
      END;                                            /* EOC RB01342 */ 16041700
                                                                        16041800
   /* SET THE CORRESPONDING START OF ELEMENT FLAG FOR REFOFER UPDATE */ 16041900
   IF F_REFOFER_UPDATE = TRUE THEN                                      16043000
     DO;                                                                16044000
       IF ST_OF_ELEMENT = 'DTSOFMSG' THEN                               16045000
          REFOFER_UPDATE_FLAGS.F_DTSOFMSG = TRUE;                       16046000
                                                                        16047000
       IF ST_OF_ELEMENT = 'STATUS' THEN                                 16048000
          REFOFER_UPDATE_FLAGS.F_STATUS = TRUE;                         16049000
                                                                        16050000
       IF ST_OF_ELEMENT = 'ENTITYTYPE' THEN                             16060000
          REFOFER_UPDATE_FLAGS.F_ENTITYTYPE = TRUE;                     16070000
                                                                        16080000
       IF ST_OF_ELEMENT = 'ENTITYID' THEN                               16090000
          REFOFER_UPDATE_FLAGS.F_ENTITYID = TRUE;                       16100000
                                                                        16110000
       IF ST_OF_ELEMENT = 'PRODUCTID' THEN                              16120000
          REFOFER_UPDATE_FLAGS.F_PRODUCTID = TRUE;                      16130000
                                                                        16140000
       IF ST_OF_ELEMENT = 'LANGUAGELIST' THEN                           16150000
          REFOFER_UPDATE_FLAGS.F_LANGUAGELIST = TRUE;                   16160000
                                                                        16170000
                      /* GET THE UNBOUNDED COUNTS FOR REFOFER UPDATE */ 16180000
       IF REFOFER_UPDATE_FLAGS.F_LANGUAGELIST = TRUE &                  16190000
          ST_OF_ELEMENT = 'LANGUAGEELEMENT' THEN                        16200000
           REFOFER_UPD_UCOUNT.CNT_LANG_ELEMENT =                        16210000
                 REFOFER_UPD_UCOUNT.CNT_LANG_ELEMENT + 1;               16220000
     END;                                                               16230000
                                                                        16240000
      /* SET THE CORRESPONDING START OF ELEMENT FLAG FOR GENERALAREA */ 16250000
   IF F_GENERALAREA_UPDATE = TRUE THEN                                  16270000
     DO;                                                                16280000
       IF ST_OF_ELEMENT = 'DTSOFMSG' THEN                               16290000
          GENERALAREA_UPDATE_FLAGS.F_DTSOFMSG = TRUE;                   16300000
                                                                        16310000
       IF ST_OF_ELEMENT = 'GENAREANAME_FC' THEN                         16320000
          GENERALAREA_UPDATE_FLAGS.F_GENAREANAME_FC = TRUE;             16330000
                                                                        16340000
               /* GET THE UNBOUNDED COUNTS FOR GENAREA UPDATE */        16350000
       IF ST_OF_ELEMENT = 'GENAREAELEMENT' THEN                         16360000
          GENAREA_UPD_UCOUNT.CNT_GEN_ELEMENT =                          16370000
          GENAREA_UPD_UCOUNT.CNT_GEN_ELEMENT + 1;                       16380000
     END;                                                               16390000
                                                                        16400000
                                                                        16410000
     /* SET THE CORRESPONDING START OF ELEMENT FLAG FOR RECONCILE MSG*/ 16420000
  IF F_RECONCILE_MSGS = TRUE THEN                                       16430000
    DO;                                                                 16440000
      IF ST_OF_ELEMENT = 'DTSOFMSG' &                                   16450000
         RECONCILE_MSGS_FLAGS.F_MSGLIST = FALSE THEN                    16460000
         RECONCILE_MSGS_FLAGS.F_DTSOFMSG = TRUE;                        16470000
                                                                        16480000
      IF ST_OF_ELEMENT = 'FROMMSGDTS' THEN                              16490000
         RECONCILE_MSGS_FLAGS.F_FROMMSGDTS = TRUE;                      16500000
                                                                        16510000
      IF ST_OF_ELEMENT = 'TOMSGDTS' THEN                                16520000
         RECONCILE_MSGS_FLAGS.F_TOMSGDTS = TRUE;                        16530000
                                                                        16540000
      IF ST_OF_ELEMENT = 'MSGLIST' THEN                                 16550000
        DO;                                                             16560000
          RECONCILE_MSGS_FLAGS.F_MSGLIST = TRUE;                        16570000
          COUNT_MODEL = 0;                                              16580000
          COUNT_SEO   = 0;                                 /* RB01342 */16590000
          COUNT_GENAR = 0;                                              16600000
          COUNT_ROFER = 0;                                              16610000
          COUNT_MSG_TYPES = 0;                        /* CEDS00000587 */16620000
        END;                                                            16630000
                                                                        16640000
      IF RECONCILE_MSGS_FLAGS.F_MSGLIST = TRUE THEN                     16650000
        DO;                                                             16660000
          IF ST_OF_ELEMENT = 'MSGELEMENT' THEN                          16670000
            DO;                                                         16680000
              RECONCILE_MSGS_FLAGS.F_MSGELEMENT = TRUE;                 16690000
              F_CHK_MSG_TYPE                    = FALSE;                16700000
                                                  /* SOC CEDS00000587 */16710000
          /*  F_TYP_REFRESH                     = FALSE;                16720000
              F_TYP_DELTA                       = FALSE;*/              16730000
              F_CHK_MSG_ID                      = FALSE;                16740000
              F_CHK_MSG_DTS                     = FALSE;                16750000
                                                  /* EOC CEDS00000587 */16760000
              F_MODEL_ARRAY                     = FALSE;                16770000
              F_SEO_ARRAY                       = FALSE;   /* RB01342 */16780000
              F_GENAR_ARRAY                     = FALSE;                16790000
              F_ROFER_ARRAY                     = FALSE;                16800000
              MQ_TYPE                           = 'DELTA';              16810000
            END;                                                        16820000
                                                                        16830000
          IF RECONCILE_MSGS_FLAGS.F_MSGELEMENT = TRUE THEN              16840000
            DO;                                                         16850000
              IF ST_OF_ELEMENT = 'SETUPENTITYTYPE' THEN                 16860000
                DO;                                                     16870000
                  RECONCILE_MSGS_FLAGS.F_SETUPENTITYTYPE = TRUE;        16880000
                END;                                                    16890000
                                                                        16900000
              IF ST_OF_ELEMENT = 'SETUPENTITYID' THEN                   16920000
              RECONCILE_MSGS_FLAGS.F_SETUPENTITYID = TRUE;              16930000
                                                  /* SOC CEDS00000587 */16940000
              IF ST_OF_ELEMENT = 'SETUPDTS' THEN                        16950000
                 RECONCILE_MSGS_FLAGS.F_SETUPDTS = TRUE;                16960000
                                                  /* EOC CEDS00000587 */16970000
              IF ST_OF_ELEMENT = 'MSGTYPE' THEN                         16980000
                DO;                                                     16990000
                  RECONCILE_MSGS_FLAGS.F_MSGTYPE = TRUE;                17000000
               /* MSG_DETAILS    = ''; */             /* CEDS00000679 */17010000
                END;                                                    17020000
                                                                        17030000
              IF ST_OF_ELEMENT = 'MSGCOUNT' THEN                        17040000
              RECONCILE_MSGS_FLAGS.F_MSGCOUNT = TRUE;                   17050000
                                                                        17060000
              IF ST_OF_ELEMENT = 'ENTITYLIST' THEN                      17070000
              RECONCILE_MSGS_FLAGS.F_ENTITYLIST = TRUE;                 17080000
                                                                        17090000
              IF RECONCILE_MSGS_FLAGS.F_ENTITYLIST = TRUE THEN          17100000
                DO;                                                     17110000
                  IF ST_OF_ELEMENT = 'ENTITYELEMENT' THEN               17120000
                    DO;                                                 17130000
                      RECONCILE_MSGS_FLAGS.F_ENTITYELEMENT = TRUE;      17140000
                      RECONCILE_MSGS.ENTITYTYPE     = '';               17150000
                      RECONCILE_MSGS.ENTITYID       = '';               17160000
                      RECONCILE_MSGS.ENTITYDTSOFMSG = '';               17170000
                    END;                                                17180000
                  IF RECONCILE_MSGS_FLAGS.F_ENTITYELEMENT = TRUE THEN   17190000
                    DO;                                                 17200000
                      IF ST_OF_ELEMENT = 'ENTITYTYPE' THEN              17210000
                      RECONCILE_MSGS_FLAGS.F_ENTITYTYPE = TRUE;         17220000
                                                                        17230000
                      IF ST_OF_ELEMENT = 'ENTITYID' THEN                17240000
                      RECONCILE_MSGS_FLAGS.F_ENTITYID = TRUE;           17250000
                                                                        17260000
                      IF ST_OF_ELEMENT = 'DTSOFMSG' THEN                17270000
                      RECONCILE_MSGS_FLAGS.F_ENTITYDTSOFMSG = TRUE;     17280000
                    END;                                                17290000
                END;                                                    17300000
            END;                                                        17310000
        END;                                                            17320000
    END;                                                                17340000
                                                                        17350000
    RETURN(0);                                                          17360000
  END;                                                                  17370000
1/********************************************************************/ 17380000
 /* MODULE NAME      : ATTRIBUTE_NAME                                */ 17390000
 /********************************************************************/ 17400000
  ATTRIBUTE_NAME:                                                       17410000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                             17420000
          NSPREFIX, NSPREFIXLENGTH,                                     17430000
          NSURI, NSURILENGTH )                                          17440000
    RETURNS( BYVALUE FIXED BIN(31) )                                    17450000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                17460000
                                                                        17470000
    DCL USERTOKEN                    POINTER;                           17480000
    DCL XMLTOKEN                     POINTER;                           17490000
    DCL TOKENLENGTH                  FIXED BIN(31);                     17500000
    DCL NSPREFIX                     POINTER;                           17510000
    DCL NSPREFIXLENGTH               FIXED BIN(31);                     17520000
    DCL NSURI                        POINTER;                           17530000
    DCL NSURILENGTH                  FIXED BIN(31);                     17540000
                                                                        17550000
    RETURN(0);                                                          17560000
  END;                                                                  17570000
1/********************************************************************/ 17580000
 /* MODULE NAME      : END_OF_ELEMENT                                */ 17590000
 /********************************************************************/ 17600000
  END_OF_ELEMENT:                                                       17610000
   PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH,                              17620000
         NSPREFIX, NSPREFIXLENGTH,                                      17630000
         NSURI, NSURILENGTH )                                           17640000
   RETURNS( BYVALUE FIXED BIN(31) )                                     17650000
   OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                 17660000
                                                                        17670000
   DCL USERTOKEN                    POINTER;                            17680000
   DCL XMLTOKEN                     POINTER;                            17690000
   DCL TOKENLENGTH                  FIXED BIN(31);                      17700000
   DCL NSPREFIX                     POINTER;                            17710000
   DCL NSPREFIXLENGTH               FIXED BIN(31);                      17720000
   DCL NSURI                        POINTER;                            17730000
   DCL NSURILENGTH                  FIXED BIN(31);                      17740000
                                                /* SOC CEDS00000679 */  17750000
   DCL ED_ELEMENT_PTR               POINTER;                            17760000
   DCL TEMP_ED_ELEMENT              CHAR(50) VARYING;                   17770000
   DCL ED_ELEMENT_PTR_1             POINTER;                            17771000
   DCL TEMP_ED_ELEMENT_1            CHAR(50) VARYING;                   17772000
   DCL TEMP_CONVERT                 FIXED BIN(31) INIT(0);              17773000
   DCL TEMP_LENGTH                  FIXED BIN(31) INIT(0);              17774000
                                                /* EOC CEDS00000679 */  17775000
                                                                        17776000
   ST_OF_ELEMENT = '';                                                  17777000
   ED_OF_ELEMENT = '';                                                  17778000
                                                /* SOC CEDS00000679 */  17779000
  /* ED_OF_ELEMENT = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH ); */         17780000
   TEMP_ED_ELEMENT            = '';                                     17790000
   TEMP_ED_ELEMENT_1          = '';                                     17800000
  /***************** CONVERTING TO EBCDIC ********************/         17810000
                                                                        17820000
   TEMP_ED_ELEMENT_1          = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH ); 17821000
   ED_ELEMENT_PTR_1           = ADDR(TEMP_ED_ELEMENT_1);                17822000
   ED_ELEMENT_PTR             = ADDR(TEMP_ED_ELEMENT);                  17823000
   TEMP_LENGTH                = TOKENLENGTH + 2;                        17824000
                                                                        17825000
   TEMP_CONVERT  = MEMCONVERT (ED_ELEMENT_PTR,TEMP_LENGTH,500,          17827000
                              ED_ELEMENT_PTR_1,TEMP_LENGTH,1208);       17828000
   ED_OF_ELEMENT = SUBSTR(TEMP_ED_ELEMENT,1,TOKENLENGTH);               17829000
                                                /* EOC CEDS00000679 */  17829100
                                                                        17829200
                /* IDENTIFY THE MSG TYPE AND SET THE RESPECTIVE FLAG */ 17829300
   IF ED_OF_ELEMENT = 'MODEL_UPDATE' THEN DO;                           17829400
      F_MODEL_UPDATE = FALSE;                                           17829500
      F_MSG_ELEMENT  = TRUE;                                            17829600
   END;                                                                 17829700
                                                                        17829800
   IF ED_OF_ELEMENT = 'SEO_UPDATE' THEN               /* SOC RB01342 */ 17829900
     DO;                                                                17830000
       F_SEO_UPDATE = FALSE;                                            17840000
       F_MSG_ELEMENT  = TRUE;                                           17850000
     END;                                             /* EOC RB01342 */ 17860000
                                                                        17870000
   IF ED_OF_ELEMENT = 'REFOFER_UPDATE' THEN                             17880000
     DO;                                                                17890000
       F_REFOFER_UPDATE = FALSE;                                        17900000
       F_MSG_ELEMENT    = TRUE;                                         17910000
     END;                                                               17920000
                                                                        17930000
   IF ED_OF_ELEMENT = 'GENERALAREA_UPDATE' THEN                         17940000
     DO;                                                                17950000
       F_GENERALAREA_UPDATE = FALSE;                                    17960000
       F_MSG_ELEMENT        = TRUE;                                     17970000
     END;                                                               17980000
                                                                        17990000
   IF ED_OF_ELEMENT = 'RECONCILE_MSGS' THEN                             18000000
     DO;                                                                18010000
       F_RECONCILE_MSGS = FALSE;                                        18020000
       F_MSG_ELEMENT    = TRUE;                                         18030000
     END;                                                               18040000
                                                                        18050000
   /* RESET THE CORRESPONDING START OF ELEMENT FLAG FOR MODEL UPDATE */ 18060000
   IF F_MODEL_UPDATE = TRUE THEN                                        18070000
     DO;                                                                18080000
       IF ED_OF_ELEMENT = 'DTSOFMSG' THEN                               18090000
          MODEL_UPDATE_FLAGS.F_DTSOFMSG = FALSE;                        18100000
                                                                        18110000
       IF ED_OF_ELEMENT = 'STATUS' THEN                                 18120000
          MODEL_UPDATE_FLAGS.F_STATUS = FALSE;                          18130000
                                                                        18150000
       IF ED_OF_ELEMENT = 'MODELENTITYTYPE' THEN                        18160000
          MODEL_UPDATE_FLAGS.F_MODELENTITYTYPE = FALSE;                 18170000
                                                                        18180000
       IF ED_OF_ELEMENT = 'MODELENTITYID' THEN                          18190000
          MODEL_UPDATE_FLAGS.F_MODELENTITYID = FALSE;                   18200000
                                                                        18210000
                                                 /* SOC CEDS00000617  */18220000
       IF ED_OF_ELEMENT = 'REPLMODELLIST' THEN                          18230000
          MODEL_UPDATE_FLAGS.F_REPLMODELLIST = FALSE;                   18240000
                                                 /* EOC CEDS00000617  */18250000
                                                                        18260000
       IF ED_OF_ELEMENT = 'MACHTYPE' THEN                               18270000
          MODEL_UPDATE_FLAGS.F_MACHTYPE = FALSE;                        18280000
                                                                        18290000
       IF ED_OF_ELEMENT = 'MODEL' THEN                                  18300000
          MODEL_UPDATE_FLAGS.F_MODEL = FALSE;                           18310000
                                                                        18320000
       IF ED_OF_ELEMENT = 'LANGUAGELIST' THEN                           18330000
          MODEL_UPDATE_FLAGS.F_LANGUAGELIST = FALSE;                    18340000
                                                                        18350000
       IF ED_OF_ELEMENT = 'AVAILABILITYLIST' THEN                       18360000
          MODEL_UPDATE_FLAGS.F_AVAILABILITYLIST = FALSE;                18370000
                                                                        18380000
     END;                                                               18390000
                                                       /* SOC RB01342 */18400000
   IF F_SEO_UPDATE = TRUE THEN                                          18410000
     DO;                                                                18411000
       IF ED_OF_ELEMENT = 'DTSOFMSG' THEN                               18412000
          SEO_UPDATE_FLAGS.F_DTSOFMSG = FALSE;                          18413000
                                                                        18414000
       IF ED_OF_ELEMENT = 'STATUS' THEN                                 18415000
          SEO_UPDATE_FLAGS.F_STATUS = FALSE;                            18416000
                                                                        18417000
       IF ED_OF_ELEMENT = 'ENTITYTYPE' THEN                             18418000
          SEO_UPDATE_FLAGS.F_SEOENTITYTYPE = FALSE;                     18419000
                                                                        18419100
       IF ED_OF_ELEMENT = 'ENTITYID' THEN                               18419200
          SEO_UPDATE_FLAGS.F_SEOENTITYID = FALSE;                       18419300
                                                                        18419400
       IF ED_OF_ELEMENT = 'SEOID' THEN                                  18419500
          SEO_UPDATE_FLAGS.F_SEOID = FALSE;                             18419600
                                                                        18419700
       IF ED_OF_ELEMENT = 'LANGUAGELIST' THEN                           18419800
          SEO_UPDATE_FLAGS.F_LANGUAGELIST = FALSE;                      18419900
                                                                        18420000
       IF ED_OF_ELEMENT = 'AVAILABILITYLIST' THEN                       18420100
          SEO_UPDATE_FLAGS.F_AVAILABILITYLIST = FALSE;                  18420200
                                                                        18420300
     END;                                                               18420400
                                                      /* EOC RB01342 */ 18420500
 /* RESET THE CORRESPONDING START OF ELEMENT FLAG FOR REFOFER UPDATE */ 18420600
  IF F_REFOFER_UPDATE = TRUE THEN                                       18420700
    DO;                                                                 18420800
      IF ED_OF_ELEMENT = 'DTSOFMSG' THEN                                18420900
         REFOFER_UPDATE_FLAGS.F_DTSOFMSG = FALSE;                       18421000
                                                                        18422000
      IF ED_OF_ELEMENT = 'STATUS' THEN                                  18423000
         REFOFER_UPDATE_FLAGS.F_STATUS = FALSE;                         18424000
                                                                        18425000
      IF ED_OF_ELEMENT = 'ENTITYTYPE' THEN                              18426000
         REFOFER_UPDATE_FLAGS.F_ENTITYTYPE = FALSE;                     18427000
                                                                        18428000
      IF ED_OF_ELEMENT = 'ENTITYID' THEN                                18429000
         REFOFER_UPDATE_FLAGS.F_ENTITYID = FALSE;                       18430000
                                                                        18440000
      IF ED_OF_ELEMENT = 'PRODUCTID' THEN                               18450000
         REFOFER_UPDATE_FLAGS.F_PRODUCTID = FALSE;                      18460000
                                                                        18470000
      IF ED_OF_ELEMENT = 'LANGUAGELIST' THEN                            18480000
         REFOFER_UPDATE_FLAGS.F_LANGUAGELIST = FALSE;                   18490000
    END;                                                                18510000
                                                                        18520000
    /* RESET THE CORRESPONDING START OF ELEMENT FLAG FOR GENERALAREA */ 18530000
  IF F_GENERALAREA_UPDATE = TRUE THEN                                   18540000
    DO;                                                                 18550000
      IF ED_OF_ELEMENT = 'DTSOFMSG' THEN                                18560000
         GENERALAREA_UPDATE_FLAGS.F_DTSOFMSG = FALSE;                   18570000
                                                                        18580000
      IF ED_OF_ELEMENT = 'GENAREANAME_FC' THEN                          18590000
         GENERALAREA_UPDATE_FLAGS.F_GENAREANAME_FC = FALSE;             18600000
    END;                                                                18610000
                                                                        18620000
                                                                        18630000
   /* RESET THE CORRESPONDING START OF ELEMENT FLAG FOR RECONCILE MSG*/ 18640000
   IF F_RECONCILE_MSGS = TRUE THEN                                      18650000
     DO;                                                                18660000
       IF ED_OF_ELEMENT = 'DTSOFMSG' &                                  18670000
          RECONCILE_MSGS_FLAGS.F_MSGLIST = FALSE THEN                   18680000
          RECONCILE_MSGS_FLAGS.F_DTSOFMSG = FALSE;                      18690000
                                                                        18700000
       IF ED_OF_ELEMENT = 'FROMMSGDTS' THEN                             18710000
          RECONCILE_MSGS_FLAGS.F_FROMMSGDTS = FALSE;                    18720000
                                                                        18730000
       IF ED_OF_ELEMENT = 'TOMSGDTS' THEN                               18740000
          RECONCILE_MSGS_FLAGS.F_TOMSGDTS = FALSE;                      18750000
                                                                        18760000
       IF ED_OF_ELEMENT = 'MSGLIST' THEN                                18770000
         DO;                                                            18780000
           RECONCILE_MSGS_FLAGS.F_MSGLIST = FALSE;                      18790000
           F_VERIFY_COUNT = TRUE;                                       18800000
         END;                                                           18810000
                                                                        18820000
       IF RECONCILE_MSGS_FLAGS.F_MSGLIST = TRUE THEN                    18830000
         DO;                                                            18840000
           IF ED_OF_ELEMENT = 'MSGELEMENT' THEN                         18850000
              RECONCILE_MSGS_FLAGS.F_MSGELEMENT = FALSE;                18860000
                                                                        18870000
           IF RECONCILE_MSGS_FLAGS.F_MSGELEMENT = TRUE THEN             18880000
             DO;                                                        18890000
               IF ED_OF_ELEMENT = 'SETUPENTITYTYPE' THEN                18900000
                 DO;                                                    18910000
                   RECONCILE_MSGS_FLAGS.F_SETUPENTITYTYPE = FALSE;      18920000
                 END;                                                   18930000
                                                                        18940000
               IF ED_OF_ELEMENT = 'SETUPENTITYID' THEN                  18950000
                  RECONCILE_MSGS_FLAGS.F_SETUPENTITYID = FALSE;         18960000
                                                  /* SOC CEDS00000587 */18970000
               IF ED_OF_ELEMENT = 'SETUPDTS' THEN                       18980000
                  RECONCILE_MSGS_FLAGS.F_SETUPDTS = FALSE;              18990000
                                                  /* EOC CEDS00000587 */19000000
                                                                        19010000
               IF ED_OF_ELEMENT = 'MSGTYPE' THEN                        19020000
                  RECONCILE_MSGS_FLAGS.F_MSGTYPE = FALSE;               19030000
                                                                        19040000
               IF ED_OF_ELEMENT = 'MSGCOUNT' THEN                       19050000
                  RECONCILE_MSGS_FLAGS.F_MSGCOUNT = FALSE;              19060000
                                                                        19070000
               IF ED_OF_ELEMENT = 'ENTITYLIST' THEN                     19080000
                  RECONCILE_MSGS_FLAGS.F_ENTITYLIST = FALSE;            19090000
                                                                        19100000
              IF RECONCILE_MSGS_FLAGS.F_ENTITYLIST = TRUE THEN          19110000
                DO;                                                     19120000
                  IF ED_OF_ELEMENT = 'ENTITYELEMENT' THEN               19130000
                     RECONCILE_MSGS_FLAGS.F_ENTITYELEMENT = FALSE;      19140000
                                                                        19150000
                  IF RECONCILE_MSGS_FLAGS.F_ENTITYELEMENT = TRUE THEN   19160000
                    DO;                                                 19170000
                      IF ED_OF_ELEMENT = 'ENTITYTYPE' THEN              19180000
                         RECONCILE_MSGS_FLAGS.F_ENTITYTYPE = FALSE;     19190000
                                                                        19200000
                      IF ED_OF_ELEMENT = 'ENTITYID' THEN                19210000
                         RECONCILE_MSGS_FLAGS.F_ENTITYID = FALSE;       19220000
                                                                        19230000
                      IF ED_OF_ELEMENT = 'DTSOFMSG' THEN                19240000
                         RECONCILE_MSGS_FLAGS.F_ENTITYDTSOFMSG = FALSE; 19250000
                    END;                                                19260000
                END;                                                    19270000
             END;                                                       19280000
         END;                                                           19290000
     END;                                                               19300000
                                                                        19310000
     RETURN(0);                                                         19320000
  END;                                                                  19330000
1/********************************************************************/ 19340000
 /* MODULE NAME      : CONTENT_CHARACTERS                            */ 19350000
 /********************************************************************/ 19360000
  CONTENT_CHARACTERS:                                                   19370000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH, FLAGS )                     19380000
    RETURNS( BYVALUE FIXED BIN(31) )                                    19390000
    OPTIONS( NODESCRIPTOR, BYVALUE LINKAGE(OPTLINK) );                  19400000
                                                                        19410000
    DCL USERTOKEN                    POINTER;                           19420000
    DCL XMLTOKEN                     POINTER;                           19430000
    DCL TOKENLENGTH                  FIXED BIN(31);                     19440000
    DCL FLAGS                        BIT(8) ALIGNED;                    19450000
                                                /* SOC CEDS00000679 */  19460000
    DCL XML_CONTENT_PTR              POINTER;                           19470000
    DCL REF_PRODUCTID_PTR            POINTER;                           19480000
    DCL REF_PRODUCTID1_PTR           POINTER;                           19490000
    DCL TEMP_XML_CONTENT             CHAR(500) VARYING;                 19500000
    DCL XML_CONTENT_PTR_1            POINTER;                           19510000
    DCL TEMP_XML_CONTENT_1           CHAR(500) VARYING;                 19520000
    DCL TEMP_CONVERT                 FIXED BIN(31) INIT(0);             19530000
    DCL TEMP_LENGTH                  FIXED BIN(31) INIT(0);             19540000
                                                /* EOC CEDS00000679 */  19550000
                                                                        19560000
                                                                        19580000
                                                /* SOC CEDS00000679 */  19581000
   /* XML_CONTENT_CHARS = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );*/     19582000
    XML_CONTENT_CHARS          = '';                                    19583000
    TEMP_XML_CONTENT           = '';                                    19584000
    TEMP_XML_CONTENT_1         = '';                                    19585000
   /***************** CONVERTING TO EBCDIC ********************/        19586000
                                                                        19587000
   TEMP_XML_CONTENT_1         = SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH ); 19588000
   XML_CONTENT_PTR_1          = ADDR(TEMP_XML_CONTENT_1);               19589000
   XML_CONTENT_PTR            = ADDR(TEMP_XML_CONTENT);                 19590000
   IF TOKENLENGTH > 500 THEN                     /* SOC CEDS00000692 */ 19592000
   DO;                                                                  19593000
   TOKENLENGTH = 500;                                                   19594000
   TEMP_LENGTH = 500;                                                   19595000
   END;                                                                 19596000
   ELSE                                          /* EOC CEDS00000692 */ 19597000
   TEMP_LENGTH                = TOKENLENGTH + 2;                        19598000
                                                                        19599000
                                                 /* SOC CEDS00000780 */ 19599102
   /*TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,       19599601
                              XML_CONTENT_PTR_1,TEMP_LENGTH,1208);      19599700
   XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);*/        19599801
                                                 /* EOC CEDS00000780 */ 19599902
                                                /* EOC CEDS00000679 */  19600100
    IF F_MODEL_UPDATE = TRUE THEN                                       19600200
      DO;                                                               19600300
        MSG_INSERT.MSG_TYPE      = 'MODEL_UPDATE';                      19600400
        IF MODEL_UPDATE_FLAGS.F_DTSOFMSG = TRUE THEN                    19600500
          DO;                                                           19600600
                                                  /* SOC CEDS00000780 */19600702
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,19600801
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);19600901
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 19601001
                                                  /* EOC CEDS00000780 */19601102
            XML_CONTENT.MODEL_UPD.DTSOFMSG = XML_CONTENT_CHARS;         19601200
            MSG_INSERT.MSG_CREATE_DATE     = XML_CONTENT_CHARS;         19601300
          END;                                                          19601400
                                                                        19602000
        IF MODEL_UPDATE_FLAGS.F_STATUS = TRUE THEN                      19603000
         DO;                                     /* SOC CEDS00000780 */ 19603102
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 19603201
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);19603301
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  19603401
                                                 /* EOC CEDS00000780 */ 19603502
           XML_CONTENT.MODEL_UPD.STATUS = XML_CONTENT_CHARS;            19604000
         END;                                        /* CEDS00000780 */ 19605002
                                                                        19606000
        IF MODEL_UPDATE_FLAGS.F_MODELENTITYTYPE = TRUE THEN             19607000
          DO;                                                           19608000
            IF F_REPLMODELLIST = FALSE THEN         /* CEDS00000617 */  19609000
            DO;                                  /* SOC CEDS00000780 */ 19609102
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,19609201
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);19609301
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 19609401
                                                 /* EOC CEDS00000780 */ 19609503
            XML_CONTENT.MODEL_UPD.MODELENTITYTYPE = XML_CONTENT_CHARS;  19610000
            END;                                 /* CEDS00000780 */     19611003
          END;                                                          19620000
                                                                        19630000
        IF MODEL_UPDATE_FLAGS.F_MODELENTITYID = TRUE THEN               19640000
          DO;                                                           19650000
            IF F_REPLMODELLIST = FALSE THEN DO;     /* CEDS00000617 */  19660000
                                                  /* SOC CEDS00000780 */19660102
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,19661001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);19662001
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 19663001
                                                  /* EOC CEDS00000780 */19664002
            XML_CONTENT.MODEL_UPD.MODELENTITYID = XML_CONTENT_CHARS;    19670000
            MSG_INSERT.MSG_ENTITY_ID       = XML_CONTENT_CHARS;         19680000
            END;                                    /* CEDS00000617 */  19690000
          END;                                                          19700000
                                                                        19710000
        IF MODEL_UPDATE_FLAGS.F_MACHTYPE = TRUE THEN                    19720000
          DO;                                                           19730000
            IF F_REPLMODELLIST = FALSE THEN DO;     /* CEDS00000617 */  19740000
                                                  /* SOC CEDS00000780 */19741002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,19742001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);19743001
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 19744001
                                                  /* EOC CEDS00000780 */19745002
            XML_CONTENT.MODEL_UPD.MACHTYPE = XML_CONTENT_CHARS;         19750000
            MESSAGE_CHAR  = '<MACHTYPE>' ||                             19760000
                             SUBSTR(XML_CONTENT_CHARS,1,TOKENLENGTH ) ||19770000
                             '</MACHTYPE>,';                            19780000
            MSG_INSERT.MSG_DETAILS = MESSAGE_CHAR;                      19790000
            COUNT_MSG_DETAILS = TOKENLENGTH + 22 + 1;                   19800000
            END;                                    /* CEDS00000617 */  19810000
          END;                                                          19820000
                                                                        19830000
        IF MODEL_UPDATE_FLAGS.F_MODEL = TRUE THEN                       19850000
          DO;                                                           19860000
            IF F_REPLMODELLIST = FALSE THEN DO;     /* CEDS00000617 */  19870000
                                                  /* SOC CEDS00000780 */19871002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,19872001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);19873001
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 19874001
                                                  /* EOC CEDS00000780 */19875002
            XML_CONTENT.MODEL_UPD.MODEL = XML_CONTENT_CHARS;            19880000
            SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 7  ) = '<MODEL>';   19890000
            COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + 7 ;                 19900000
            SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, TOKENLENGTH) =      19910000
                             SUBSTR(XML_CONTENT_CHARS,1,TOKENLENGTH);   19920000
            COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + TOKENLENGTH;        19930000
            SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 8) =                19940000
                                 '</MODEL>';                            19950000
            MSG_INSERT.MSG_DETAILS = MESSAGE_CHAR;                      19960000
            END;                                   /* CEDS00000617 */   19970000
          END;                                                          19980000
      END;                                                              19990000
                                                                        20000000
                                                      /* SOC RB01342 */ 20020000
    IF F_SEO_UPDATE = TRUE THEN                                         20030000
      DO;                                                               20040000
        MSG_INSERT.MSG_TYPE      = ' ';                                 20050000
        MSG_INSERT.MSG_TYPE      = XML_MSG_TYPE;                        20060000
        IF SEO_UPDATE_FLAGS.F_DTSOFMSG = TRUE THEN                      20070000
          DO;                                                           20080000
                                                  /* SOC CEDS00000780 */20081002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20082001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20083001
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 20084001
                                                  /* EOC CEDS00000780 */20085002
            XML_CONTENT.SEO_UPD.DTSOFMSG   = XML_CONTENT_CHARS;         20090000
            MSG_INSERT.MSG_CREATE_DATE     = XML_CONTENT_CHARS;         20100000
          END;                                                          20110000
                                                                        20120000
        IF SEO_UPDATE_FLAGS.F_STATUS = TRUE THEN                        20130000
          DO;                                     /* SOC CEDS00000780 */20130102
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 20130201
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20130301
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  20130401
                                                  /* EOC CEDS00000780 */20130502
           XML_CONTENT.SEO_UPD.STATUS = XML_CONTENT_CHARS;              20131000
          END;                                                          20131101
                                                                        20132000
        IF SEO_UPDATE_FLAGS.F_SEOENTITYTYPE = TRUE THEN                 20133000
          DO;                                     /* SOC CEDS00000780 */20133102
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20133201
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20133301
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 20133401
                                                  /* EOC CEDS00000780 */20133502
            XML_CONTENT.SEO_UPD.SEOENTITYTYPE = XML_CONTENT_CHARS;      20134000
          END;                                        /* CEDS00000780 */20134102
            IF XML_CONTENT.SEO_UPD.SEOENTITYTYPE ¬= 'FEATURE' THEN      20135000
        DO;                                                             20136000
        IF SEO_UPDATE_FLAGS.F_SEOENTITYID = TRUE THEN                   20137000
          DO;                                                           20138000
                                                  /* SOC CEDS00000780 */20138102
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20138201
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20138301
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 20138401
                                                  /* EOC CEDS00000780 */20138502
            XML_CONTENT.SEO_UPD.SEOENTITYID = XML_CONTENT_CHARS;        20139000
            MSG_INSERT.MSG_ENTITY_ID        = XML_CONTENT_CHARS;        20140000
          END;                                                          20140100
        END;                                                            20140200
                                                                        20140300
        IF SEO_UPDATE_FLAGS.F_SEOID = TRUE THEN                         20140400
          DO;                                                           20140500
                                                  /* SOC CEDS00000780 */20140602
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20140701
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20140801
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 20140901
                                                  /* EOC CEDS00000780 */20141002
            XML_CONTENT.SEO_UPD.SEOID = XML_CONTENT_CHARS;              20141100
            MESSAGE_CHAR  = '<SEOID>' ||                                20141200
                             SUBSTR(XML_CONTENT_CHARS,1,TOKENLENGTH ) ||20141300
                             '</SEOID>';                                20141400
            MSG_INSERT.MSG_DETAILS = MESSAGE_CHAR;                      20141500
            COUNT_MSG_DETAILS = TOKENLENGTH + 15 + 1;                   20141600
          END;                                                          20141700
      END;                                                              20141800
                                                      /* EOC RB01342 */ 20141900
   IF F_REFOFER_UPDATE = TRUE THEN                                      20142000
     DO;                                                                20142100
       MSG_INSERT.MSG_TYPE      = 'REFOFER_UPDATE';                     20142200
       IF REFOFER_UPDATE_FLAGS.F_DTSOFMSG = TRUE THEN                   20142300
         DO;                                                            20142400
                                                  /* SOC CEDS00000780 */20142502
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20142601
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20142701
            XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH); 20142801
                                                  /* EOC CEDS00000780 */20142902
           XML_CONTENT.REFOFER_UPD.DTSOFMSG = XML_CONTENT_CHARS;        20143000
           MSG_INSERT.MSG_CREATE_DATE     = XML_CONTENT_CHARS;          20143100
         END;                                                           20144000
                                                                        20145000
       IF REFOFER_UPDATE_FLAGS.F_STATUS = TRUE THEN                     20146000
         DO;                                      /* SOC CEDS00000780 */20146102
          TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,  20146201
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20146301
          XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);   20146401
                                                  /* EOC CEDS00000780 */20146502
          XML_CONTENT.REFOFER_UPD.STATUS = XML_CONTENT_CHARS;           20147000
         END;                                         /* CEDS00000780 */20147102
                                                                        20148000
       IF REFOFER_UPDATE_FLAGS.F_ENTITYTYPE = TRUE THEN                 20149000
         DO;                                      /* SOC CEDS00000780 */20149102
          TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,  20149201
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20149301
          XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);   20149401
                                                  /* EOC CEDS00000780 */20149502
          XML_CONTENT.REFOFER_UPD.ENTITYTYPE = XML_CONTENT_CHARS;       20150000
         END;                                         /* CEDS00000780 */20151002
                                                                        20160000
       IF REFOFER_UPDATE_FLAGS.F_ENTITYID = TRUE THEN                   20170000
         DO;                                                            20180000
                                                  /* SOC CEDS00000780 */20181002
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 20182001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20183001
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  20184001
                                                  /* EOC CEDS00000780 */20185002
           XML_CONTENT.REFOFER_UPD.ENTITYID = XML_CONTENT_CHARS;        20190000
           MSG_INSERT.MSG_ENTITY_ID      =   XML_CONTENT_CHARS;         20200000
         END;                                                           20210000
                                                                        20220000
       IF REFOFER_UPDATE_FLAGS.F_PRODUCTID = TRUE THEN                  20230000
         DO;                                                            20240000
                                                /* SOC CEDS00000679 */  20250000
        REF_PRODUCTID_1      =   SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH );20260000
        REF_PRODUCTID        =  '  ';                                   20270000
        REF_PRODUCTID_PTR    = ADDR(REF_PRODUCTID);                     20280000
        REF_PRODUCTID1_PTR   = ADDR(REF_PRODUCTID_1);                   20290000
        TEMP_LENGTH          = 7;                                       20300000
                                                                        20310000
        TEMP_CONVERT  = MEMCONVERT (REF_PRODUCTID_PTR,TEMP_LENGTH,500,  20330000
                              REF_PRODUCTID1_PTR,TEMP_LENGTH,1208);     20340000
                                                /* EOC CEDS00000679 */  20350000
           MSG_INSERT.MSG_DETAILS           = '<PRODUCTID>' ||          20360000
                                                /* SOC CEDS00000679 */  20370000
                          /* SUBSTR(XMLTOKEN->CHARS,1,TOKENLENGTH ) ||*/20380000
                                              REF_PRODUCTID||           20381000
                                                /* EOC CEDS00000679 */  20382000
                               '</PRODUCTID>';                          20383000
         END;                                                           20385000
     END;                                                               20386000
                                                                        20387000
                                                                        20388000
     IF F_GENERALAREA_UPDATE = TRUE THEN                                20389000
       DO;                                                              20390000
         MSG_INSERT.MSG_TYPE      = 'GENERALAREA_UPDATE';               20400000
         IF GENERALAREA_UPDATE_FLAGS.F_DTSOFMSG = TRUE THEN             20410000
           DO;                                                          20420000
                                                  /* SOC CEDS00000780 */20421002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20422001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20423001
             XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);20424001
                                                  /* EOC CEDS00000780 */20425002
             XML_CONTENT.GENAREA_UPD.DTSOFMSG = XML_CONTENT_CHARS;      20430000
             MSG_INSERT.MSG_CREATE_DATE     = XML_CONTENT_CHARS;        20440000
           END;                                                         20460000
                                                                        20470000
         IF GENERALAREA_UPDATE_FLAGS.F_GENAREANAME_FC = TRUE THEN       20480000
           DO;                                                          20490000
                                                  /* SOC CEDS00000780 */20491002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20492001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20493001
             XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);20494001
                                                  /* EOC CEDS00000780 */20495002
             XML_CONTENT.GENAREA_UPD.GENAREANAME_FC = XML_CONTENT_CHARS;20500000
             IF COUNT_MSG_DETAILS = 1 THEN                              20510000
               DO;                                                      20520000
                 SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 16 ) =         20530000
                                                     '<GENAREANAME_FC>';20540000
                 COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + 16;            20550000
                 SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, TOKENLENGTH) = 20560000
                                SUBSTR(XML_CONTENT_CHARS,1,TOKENLENGTH);20570000
                 COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + TOKENLENGTH;   20580000
                 SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 17) =          20590000
                                                    '</GENAREANAME_FC>';20600000
                 COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + 17;            20610000
                 MSG_INSERT.MSG_DETAILS = MESSAGE_CHAR;                 20620000
               END;                                                     20630000
           END;                                                         20640000
       END;                                                             20650000
                                                                        20660000
     IF F_RECONCILE_MSGS = TRUE THEN                                    20670000
       DO;                                                              20680000
         MSG_INSERT.MSG_TYPE      = 'RECONCILE_MSGS';                   20690000
         IF RECONCILE_MSGS_FLAGS.F_DTSOFMSG = TRUE THEN                 20700000
           DO;                                                          20710000
                                                  /* SOC CEDS00000780 */20711002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20712001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20713001
             XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);20714001
                                                  /* EOC CEDS00000780 */20715002
             XML_CONTENT.RECONCILE_MSGS.DTSOFMSG = XML_CONTENT_CHARS;   20720000
             MSG_INSERT.MSG_CREATE_DATE     = XML_CONTENT_CHARS;        20730000
           END;                                                         20740000
                                                                        20750000
         IF RECONCILE_MSGS_FLAGS.F_FROMMSGDTS = TRUE THEN               20760000
           DO;                                                          20770000
                                                  /* SOC CEDS00000780 */20771002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,20772001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20773001
             XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);20774001
                                                  /* EOC CEDS00000780 */20775002
            XML_CONTENT.RECONCILE_MSGS.FROMMSGDTS = XML_CONTENT_CHARS;  20780000
        MESSAGE_CHAR  = '<FROMMSGDTS>' ||                               20790000
                            SUBSTR(XML_CONTENT_CHARS,1,TOKENLENGTH ) || 20800000
                              '</FROMMSGDTS>,';                         20810000
        MSG_INSERT.MSG_DETAILS = MESSAGE_CHAR;                          20820000
        COUNT_MSG_DETAILS = TOKENLENGTH + 26 + 1;                       20830000
       END;                                                             20840000
                                                                        20850000
      IF RECONCILE_MSGS_FLAGS.F_TOMSGDTS = TRUE THEN                    20870000
       DO;                                                              20880000
                                                  /* SOC CEDS00000780 */20881002
        TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,    20882001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);20883001
        XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);     20884001
                                                  /* EOC CEDS00000780 */20885002
        XML_CONTENT.RECONCILE_MSGS.TOMSGDTS = XML_CONTENT_CHARS;        20890000
        SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 10 ) = '<TOMSGDTS>';    20900000
        COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + 10;                     20910000
        SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, TOKENLENGTH) =          20920000
                             SUBSTR(XML_CONTENT_CHARS,1,TOKENLENGTH);   20930000
        COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + TOKENLENGTH;            20940000
        SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 12) =                   20950000
                              '</TOMSGDTS>,';                           20960000
        COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + 13;                     20970000
        MSG_INSERT.MSG_DETAILS = MESSAGE_CHAR;                          20980000
       END;                                                             20990000
                                                                        21000000
      IF RECONCILE_MSGS_FLAGS.F_MSGLIST = TRUE &                        21010000
         RECONCILE_MSGS_FLAGS.F_MSGELEMENT = TRUE THEN                  21020000
       DO;                                                              21030000
        IF RECONCILE_MSGS_FLAGS.F_SETUPENTITYTYPE = TRUE THEN           21040000
         DO;                                                            21050000
                                                  /* SOC CEDS00000780 */21051002
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 21052001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);21053001
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  21054001
                                                  /* EOC CEDS00000780 */21055002
           XML_CONTENT.RECONCILE_MSGS.SETUPENTITYTYPE =                 21060000
                                                XML_CONTENT_CHARS;      21070000
                                                                        21080000
           IF XML_CONTENT.RECONCILE_MSGS.SETUPENTITYTYPE ¬= ''          21090000
             THEN DO;                                                   21100000
               F_CHK_MSG_TYPE = TRUE;                                   21110000
             END;                                                       21120000
         END;                                                           21130000
                                                                        21140000
        IF RECONCILE_MSGS_FLAGS.F_SETUPENTITYID = TRUE THEN             21150000
         DO;                                                            21160000
                                                  /* SOC CEDS00000780 */21161002
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 21162001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);21163001
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  21164001
                                                  /* EOC CEDS00000780 */21165002
           XML_CONTENT.RECONCILE_MSGS.SETUPENTITYID =                   21170000
                                                XML_CONTENT_CHARS;      21180000
           IF XML_CONTENT.RECONCILE_MSGS.SETUPENTITYID = ''             21190000
             THEN DO;                                                   21200000
               IF F_CHK_MSG_TYPE = FALSE THEN                           21210000
                 DO;                                                    21220000
                                                  /* SOC CEDS00000587 */21230000
                   F_CHK_MSG_ID = FALSE;                                21240000
                /* F_TYP_DELTA  = TRUE;                                 21250000
                   MQ_TYPE = 'DELTA'; */          /* EOC CEDS00000587 */21260000
                 END;                                                   21270000
             END;                                                       21280000
           ELSE                                                         21290000
             DO;                                                        21300000
               IF F_CHK_MSG_TYPE = TRUE THEN                            21310000
                 DO;                                                    21320000
                                                  /* SOC CEDS00000587 */21330000
                   F_CHK_MSG_ID = TRUE;                                 21340000
                 /*F_TYP_REFRESH = TRUE;                                21350000
                   MQ_TYPE = 'REFRESH'; */        /* EOC CEDS00000587 */21360000
                 END;                                                   21370000
             END;                                                       21380000
         END;                                     /* SOC CEDS00000587 */21390000
                                                                        21400000
        IF RECONCILE_MSGS_FLAGS.F_SETUPDTS = TRUE THEN                  21410000
         DO;                                                            21420000
                                                  /* SOC CEDS00000780 */21421002
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 21422001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);21423001
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  21424001
                                                  /* EOC CEDS00000780 */21425002
           XML_CONTENT.RECONCILE_MSGS.SETUPDTS =                        21430000
                                            XML_CONTENT_CHARS;          21440000
           IF F_CHK_MSG_TYPE & F_CHK_MSG_ID THEN                        21450000
           DO;                                                          21460000
            IF XML_CONTENT.RECONCILE_MSGS.SETUPDTS ¬= '' THEN           21470000
              F_CHK_MSG_DTS = TRUE;                                     21480000
           END;                                                         21490000
                                                  /* EOC CEDS00000587 */21500000
         END;                                                           21510000
                                                                        21520000
        IF RECONCILE_MSGS_FLAGS.F_MSGTYPE = TRUE THEN                   21530000
         DO;                                                            21540000
           XML_CONTENT.RECONCILE_MSGS.MSGTYPE = '';                     21540101
                                                  /* SOC CEDS00000780 */21541002
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 21542001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);21543001
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  21544001
                                                  /* EOC CEDS00000780 */21545002
           XML_CONTENT.RECONCILE_MSGS.MSGTYPE = XML_CONTENT_CHARS;      21560000
           IF XML_CONTENT.RECONCILE_MSGS.MSGTYPE = 'MODEL_UPDATE'       21570000
           THEN DO;                                                     21580000
           /*IF MQ_TYPE = XML_TYPE_OF_MODE THEN */    /* CEDS00000587 */21590000
               F_MODEL_ARRAY = TRUE;                                    21600000
           END;                                                         21610000
                                                       /* SOC RB01342 */21620000
           IF XML_CONTENT.RECONCILE_MSGS.MSGTYPE = 'SEO_UPDATE'         21630000
           THEN DO;                                                     21640000
               F_SEO_ARRAY = TRUE;                                      21650000
           END;                                        /* EOC RB01342 */21651000
                                                                        21652000
           IF XML_CONTENT.RECONCILE_MSGS.MSGTYPE = 'GENERALAREA_UPDATE' 21653000
           THEN DO;                                                     21654000
           /*IF MQ_TYPE = XML_TYPE_OF_MODE THEN */ /*SOC CEDS00000587 */21655000
             IF (F_CHK_MSG_TYPE & F_CHK_MSG_ID & F_CHK_MSG_DTS) THEN    21656000
             DO;                                   /*EOC CEDS00000587 */21657000
                F_GENAR_ARRAY = TRUE;                                   21658000
                INV_PERIODIC  = FALSE;             /*SOC CEDS00000587 */21659000
            /*  COUNT_GENAR   = COUNT_GENAR + 1; */   /* CEDS00000612 */21660000
                GENAR_ARRAY(COUNT_GENAR).ENTITYTYPE =                   21670000
                             XML_CONTENT.RECONCILE_MSGS.SETUPENTITYTYPE;21680000
                GENAR_ARRAY(COUNT_GENAR).ENTITYID   =                   21690000
                             XML_CONTENT.RECONCILE_MSGS.SETUPENTITYID;  21700000
                GENAR_ARRAY(COUNT_GENAR).DTSOFMSG   =                   21710000
                             XML_CONTENT.RECONCILE_MSGS.SETUPDTS;       21720000
                                                  /* EOC CEDS00000587 */21730000
           END;                                                         21740000
             ELSE                                 /* SOC CEDS00000587 */21750000
             DO;                                                        21760000
                F_GENAR_ARRAY = FALSE;                                  21770000
                INV_PERIODIC  = TRUE;                                   21780000
                INV_PER_GEN   = INV_PER_GEN + 1;                        21790000
                GENAR_ARRAY(INV_PER_GEN).ENTITYTYPE =                   21800000
                             XML_CONTENT.RECONCILE_MSGS.SETUPENTITYTYPE;21810000
                GENAR_ARRAY(INV_PER_GEN).ENTITYID   =                   21820000
                             XML_CONTENT.RECONCILE_MSGS.SETUPENTITYID;  21830000
                GENAR_ARRAY(INV_PER_GEN).DTSOFMSG =                     21840000
                                    XML_CONTENT.RECONCILE_MSGS.SETUPDTS;21850000
             END;                                                       21860000
           END;                                   /* EOC CEDS00000587 */21870000
                                                                        21880000
           IF XML_CONTENT.RECONCILE_MSGS.MSGTYPE =                      21890000
                                                 'REFOFER_UPDATE'       21900000
           THEN DO;                                                     21910000
           /*IF MQ_TYPE = XML_TYPE_OF_MODE THEN */    /* CEDS00000587 */21920000
               F_ROFER_ARRAY = TRUE;                                    21930000
           END;                                                         21940000
         END;                                                           21950000
                                                                        21960000
        IF RECONCILE_MSGS_FLAGS.F_MSGCOUNT = TRUE THEN                  21970000
         DO;                                                            21980000
                                                  /* SOC CEDS00000780 */21981002
           TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500, 21982001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);21983001
           XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);  21984001
                                                  /* EOC CEDS00000780 */21985002
           XML_CONTENT.RECONCILE_MSGS.MSGCOUNT = XML_CONTENT_CHARS;     21990000
                                                 /* SOC CEDS00000612 */ 22000000
           IF F_GENAR_ARRAY = TRUE THEN                                 22010000
           DO;                                                          22020000
              M = M + 1;                                                22030000
              GENAR_MSG_COUNT(M) = XML_CONTENT.RECONCILE_MSGS.MSGCOUNT; 22040000
              GENAR_MSG_COUNT(M) = GENAR_MSG_COUNT(M) +                 22050000
                                   GENAR_MSG_COUNT(M - 1);              22060000
              COUNT_GENAR        = GENAR_MSG_COUNT(M);                  22070000
           END;                                                         22080000
                                                 /* EOC CEDS00000612 */ 22090000
           IF XML_TYPE_OF_MODE = 'DELTA' THEN                           22100000
            DO;                                                         22110000
            SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 10 ) = '<MSGCOUNT>';22120000
            COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + 10;                 22130000
            SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, TOKENLENGTH) =      22140000
                             SUBSTR(XML_CONTENT_CHARS,1,TOKENLENGTH);   22150000
            COUNT_MSG_DETAILS = COUNT_MSG_DETAILS + TOKENLENGTH;        22160000
            SUBSTR(MESSAGE_CHAR, COUNT_MSG_DETAILS, 11) =               22170000
                                 '</MSGCOUNT>';                         22180000
            MSG_INSERT.MSG_DETAILS = MESSAGE_CHAR;                      22190000
            END;                                                        22200000
         END;                                                           22210000
                                                                        22220000
        IF RECONCILE_MSGS_FLAGS.F_ENTITYLIST = TRUE &                   22230000
           RECONCILE_MSGS_FLAGS.F_ENTITYELEMENT = TRUE THEN             22240000
         DO;                                                            22250000
          IF RECONCILE_MSGS_FLAGS.F_ENTITYTYPE = TRUE THEN              22260000
           DO;                                                          22270000
                                                  /* SOC CEDS00000780 */22271002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,22272001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);22273001
             XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);22274001
                                                  /* EOC CEDS00000780 */22275002
             XML_CONTENT.MSGELEMENT.ENTITYTYPE = XML_CONTENT_CHARS;     22280000
                                                                        22290000
             IF F_MODEL_ARRAY = TRUE THEN                               22300000
              DO;                                                       22310000
                COUNT_MODEL   = COUNT_MODEL + 1;                        22320000
                MODEL_ARRAY(COUNT_MODEL).ENTITYTYPE = XML_CONTENT_CHARS;22330000
              END;                                                      22340000
             IF F_SEO_ARRAY = TRUE THEN                /* SOC RB01342 */22350000
              DO;                                                       22360000
                COUNT_SEO   = COUNT_SEO + 1;                            22370000
                SEO_ARRAY(COUNT_SEO).ENTITYTYPE = XML_CONTENT_CHARS;    22380000
              END;                                     /* EOC RB01342 */22390000
          /* IF F_GENAR_ARRAY = TRUE THEN  */     /* SOC CEDS00000587 */22400000
          /*  DO;                                                       22410000
                COUNT_GENAR   = COUNT_GENAR + 1;                        22420000
                GENAR_ARRAY(COUNT_GENAR).ENTITYTYPE = XML_CONTENT_CHARS;22430000
              END;   */                           /* EOC CEDS00000587 */22440000
             IF F_ROFER_ARRAY = TRUE THEN                               22450000
              DO;                                                       22460000
                COUNT_ROFER = COUNT_ROFER + 1;                          22470000
                ROFER_ARRAY(COUNT_ROFER).ENTITYTYPE                     22480000
                                           = XML_CONTENT_CHARS;         22490000
              END;                                                      22500000
           END;                                                         22510000
                                                                        22520000
          IF RECONCILE_MSGS_FLAGS.F_ENTITYID = TRUE THEN                22530000
           DO;                                                          22540000
                                                  /* SOC CEDS00000780 */22540102
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,22541001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);22542001
             XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);22543001
                                                  /* EOC CEDS00000780 */22544002
             XML_CONTENT.MSGELEMENT.ENTITYID = XML_CONTENT_CHARS;       22550000
             IF F_MODEL_ARRAY = TRUE THEN                               22560000
              DO;                                                       22570000
                MODEL_ARRAY(COUNT_MODEL).ENTITYID   = XML_CONTENT_CHARS;22580000
              END;                                                      22590000
             IF F_SEO_ARRAY = TRUE THEN                /* SOC RB01342 */22600000
              DO;                                                       22610000
                SEO_ARRAY(COUNT_SEO).ENTITYID   = XML_CONTENT_CHARS;    22620000
              END;                                     /* EOC RB01342 */22630000
          /* IF F_GENAR_ARRAY = TRUE THEN  */     /* SOC CEDS00000587 */22640000
          /*  DO;                                                       22650000
                GENAR_ARRAY(COUNT_GENAR).ENTITYTYPE = XML_CONTENT_CHARS;22660000
              END; */                             /* EOC CEDS00000587 */22670000
             IF F_ROFER_ARRAY = TRUE THEN                               22680000
              DO;                                                       22690000
                ROFER_ARRAY(COUNT_ROFER).ENTITYID                       22700000
                                          = XML_CONTENT_CHARS;          22710000
              END;                                                      22720000
           END;                                                         22730000
                                                                        22740000
          IF RECONCILE_MSGS_FLAGS.F_ENTITYDTSOFMSG = TRUE THEN          22760000
           DO;                                                          22770000
                                                  /* SOC CEDS00000780 */22771002
            TEMP_CONVERT  = MEMCONVERT (XML_CONTENT_PTR,TEMP_LENGTH,500,22772001
                                    XML_CONTENT_PTR_1,TEMP_LENGTH,1208);22773001
             XML_CONTENT_CHARS = SUBSTR(TEMP_XML_CONTENT,1,TOKENLENGTH);22774001
                                                  /* EOC CEDS00000780 */22775002
             XML_CONTENT.ENTITYDTSOFMSG = XML_CONTENT_CHARS;            22780000
             IF F_MODEL_ARRAY = TRUE THEN                               22790000
              DO;                                                       22800000
               MODEL_ARRAY(COUNT_MODEL).DTSOFMSG                        22810000
                                                 = XML_CONTENT_CHARS;   22820000
              END;                                                      22830000
             IF F_SEO_ARRAY = TRUE THEN               /* SOC RB01342 */ 22840000
              DO;                                                       22850000
               SEO_ARRAY(COUNT_SEO).DTSOFMSG = XML_CONTENT_CHARS;       22860000
              END;                                    /* EOC RB01342 */ 22870000
           /*IF F_GENAR_ARRAY = TRUE THEN   */   /* SOC CEDS00000587 */ 22880000
           /* DO;                                                       22890000
               GENAR_ARRAY(COUNT_GENAR).DTSOFMSG                        22900000
                                                 = XML_CONTENT_CHARS;   22910000
              END; */                            /* EOC CEDS00000587 */ 22920000
             IF F_ROFER_ARRAY = TRUE THEN                               22930000
              DO;                                                       22940000
               ROFER_ARRAY(COUNT_ROFER).DTSOFMSG                        22950000
                                                 = XML_CONTENT_CHARS;   22960000
              END;                                                      22970000
           END;                                                         22980000
         END;                                                           22990000
       END;                                                             23000000
     END;                                                               23020000
    RETURN(0);                                                          23030000
  END;                                                                  23040000
1/********************************************************************/ 23050000
 /* MODULE NAME      : ATTRIBUTE_NAME                                */ 23060000
 /********************************************************************/ 23070000
  ATTRIBUTE_CHARACTERS:                                                 23080000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            23090000
    RETURNS( BYVALUE FIXED BIN(31) )                                    23100000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                23110000
                                                                        23120000
    DCL USERTOKEN                    POINTER;                           23130000
    DCL XMLTOKEN                     POINTER;                           23140000
    DCL TOKENLENGTH                  FIXED BIN(31);                     23150000
                                                                        23160000
    RETURN(0);                                                          23170000
  END;                                                                  23180000
1/********************************************************************/ 23190000
 /* MODULE NAME      : START_OF_CDATA                                */ 23200000
 /********************************************************************/ 23210000
  START_OF_CDATA:                                                       23220000
    PROC( USERTOKEN )                                                   23230000
    RETURNS( BYVALUE FIXED BIN(31) )                                    23240000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                23250000
                                                                        23260000
    DCL USERTOKEN      POINTER;                                         23270000
                                                                        23280000
    RETURN(0);                                                          23290000
  END;                                                                  23300000
1/********************************************************************/ 23310000
 /* MODULE NAME      : END_OF_CDATA                                  */ 23320000
 /********************************************************************/ 23330000
  END_OF_CDATA:                                                         23340000
    PROC( USERTOKEN )                                                   23350000
    RETURNS( BYVALUE FIXED BIN(31) )                                    23360000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                23370000
                                                                        23380000
    DCL USERTOKEN      POINTER;                                         23390000
                                                                        23400000
    RETURN(0);                                                          23410000
  END;                                                                  23420000
1/********************************************************************/ 23430000
 /* MODULE NAME      : PROCESSING_INSTRUCTION                        */ 23440000
 /********************************************************************/ 23450000
  PROCESSING_INSTRUCTION:                                               23460000
    PROC( USERTOKEN,                                                    23470000
          PITARGET, PITARGETLENGTH,                                     23480000
          PIDATA, PIDATALENGTH )                                        23490000
    RETURNS( BYVALUE FIXED BIN(31) )                                    23500000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                23510000
                                                                        23520000
    DCL USERTOKEN      POINTER;                                         23530000
    DCL PITARGET       POINTER;                                         23540000
    DCL PITARGETLENGTH FIXED BIN(31);                                   23550000
    DCL PIDATA         POINTER;                                         23560000
    DCL PIDATALENGTH   FIXED BIN(31);                                   23570000
                                                                        23580000
    RETURN(0);                                                          23590000
  END;                                                                  23600000
1/********************************************************************/ 23610000
 /* MODULE NAME      : COMMENT                                       */ 23620000
 /********************************************************************/ 23630000
  COMMENT:                                                              23640000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            23650000
    RETURNS( BYVALUE FIXED BIN(31) )                                    23660000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                23670000
                                                                        23680000
    DCL USERTOKEN      POINTER;                                         23690000
    DCL XMLTOKEN       POINTER;                                         23700000
    DCL TOKENLENGTH    FIXED BIN(31);                                   23710000
                                                                        23720000
    RETURN(0);                                                          23730000
  END;                                                                  23740000
1/********************************************************************/ 23750000
 /* MODULE NAME      : UNRESOLVED_REFERENCE                          */ 23760000
 /********************************************************************/ 23770000
  UNRESOLVED_REFERENCE:                                                 23780000
    PROC( USERTOKEN, XMLTOKEN, TOKENLENGTH )                            23790000
    RETURNS( BYVALUE FIXED BIN(31) )                                    23800000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                23810000
                                                                        23820000
    DCL USERTOKEN      POINTER;                                         23830000
    DCL XMLTOKEN       POINTER;                                         23840000
    DCL TOKENLENGTH    FIXED BIN(31);                                   23850000
                                                                        23860000
    RETURN(0);                                                          23870000
  END;                                                                  23880000
1/********************************************************************/ 23890000
 /* MODULE NAME      : EXCEPTION                                     */ 23900000
 /********************************************************************/ 23910000
  EXCEPTION:                                                            23920000
    PROC( USERTOKEN, CURRENTOFFSET, RETURN_CODE, REASON_CODE )          23930000
    RETURNS( BYVALUE FIXED BIN(31) )                                    23940000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                23950000
                                                                        23960000
    DCL USERTOKEN      POINTER;                                         23970000
    DCL CURRENTOFFSET  FIXED BIN(31);                                   23980000
    DCL RETURN_CODE    FIXED BIN(31);                                   23990000
    DCL REASON_CODE    FIXED BIN(31);                                   24000000
                                                                        24010000
    XML_EXCEPTION.RETURN_CODE        = RETURN_CODE;                     24020000
    XML_EXCEPTION.REASON_CODE        = REASON_CODE;                     24030000
    XML_EXCEPTION.CURRENTOFFSET      = CURRENTOFFSET;                   24040000
                                                                        24050000
    IF RETURN_CODE ¬= 0 THEN                                            24060000
    DO;                                                                 24070000
      XML_EXCEPTION_1.RETURN_CODE    = XML_EXCEPTION.RETURN_CODE;       24080000
      XML_EXCEPTION_1.REASON_CODE    = XML_EXCEPTION.REASON_CODE;       24090000
      XML_EXCEPTION_1.CURRENTOFFSET  = XML_EXCEPTION.CURRENTOFFSET;     24100000
                                                                        24110000
      XML_EXCEPTION_F = 'Y';                                            24120000
    END;                                                                24130000
                                                                        24140000
    RETURN(0);                                                          24150000
  END;                                                                  24160000
1/********************************************************************/ 24170000
 /* MODULE NAME      : EXCEPTION                                     */ 24180000
 /********************************************************************/ 24190000
  END_OF_INPUT:                                                         24200000
    PROC( USERTOKEN, ADDR_XML, LENGTH_XML )                             24210000
    RETURNS( BYVALUE FIXED BIN(31) )                                    24220000
    OPTIONS( BYVALUE LINKAGE(OPTLINK) );                                24230000
                                                                        24240000
    DCL USERTOKEN      POINTER;                                         24250000
    DCL ADDR_XML       BYADDR POINTER;                                  24260000
    DCL LENGTH_XML     BYADDR FIXED BIN(31);                            24270000
    RETURN(1);                                                          24280000
  END;                                                                  24290000
                                                                        24300000
 END;                                              /* END OF PACKAGE  */24310000