     /*** ROL411M  BINARY SEARCH ON INTERNAL TABLE    TB_T350        */ 00019213
 ROL411M:  PROC;                                      /* PCEDSP-0454 */ 00020013
0              @LCIH2K: ENTRY;     DCL @SCHFIRST BIT(1)                 00030000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00040000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00050000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00060000
               EDIT    ('ROL411M  VERSION 1998.08.10' ,                 00070000
               ' 15H13.50      WITH VERSION-ENTRY    ',  /*PCEDSP-0454*/00080013
               ' @LCIH2K',' ')     (SKIP,A,A,A,SKIP,A);                 00090000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00100000
               END;     /* END OF VERSION-GROUP      */  /*PCEDSP-0454*/00110013
 DCL KLASS CHAR (30) INIT ('IBM INTERNAL USE ONLY');                    00120000
 /*       I  B  M      I N T E R N A L   U S E   O N L Y              */00130000
 /*             COPYRIGHT  IBM  DEUTSCHLAND  GMBH   1985/1986         */00140000
     /***                                                             */00150000
     /***                                                             */00160000
     /*** CALLED BY:   RCBDC1U                                        */00170000
     /***                                                             */00180000
     /*** ARGUMENTS:   NONE                                           */00190000
     /***                                                             */00200000
     /*** CALLS:       NONE                                           */00210000
     /***                                                             */00220000
     /*** INPUT:       TB_T350: TAB WITH CUST# & OU-CD FR. DB2 TAB350 */00230013
     /***              XKDNR  : CONTAINS CUST' TO BE SEEKED FOR       */00240013
     /***                                                             */00250000
     /*** OUTPUT:      I0      : TABLE POSITION WHERE OU-CODE WAS     */00260013
     /***                        FOUND                                */00270013
     /***                                                             */00280000
     /*** INCLUDES:            :                                      */00290000
     /***                                                             */00300000
     /*** PROGRAMMER:  W. BECHTEL                                     */00310000
     /*** DATE:        10.08.98                                       */00320000
     /*** CHANGE:                                                     */00330013
     /*** BY:                                                         */00340013
     /*** REASON:                                                     */00350013
     /***                                                             */00360000
     /***                                                             */00370000
     /***   FUNCTION                                                  */00380013
     /***                                                             */00390000
     /***    THIS PGM EXECUTES A BINARY SEARCH IN AN INTERNAL TABLE   */00400013
     /***    WITH SEARCH ARGUMENT CUSTOMER NUMBER. THIS TABLE CONTAINS*/00410013
     /***    ONLY CUSTOMER NUMBER AND OU-CODE FROM                    */00420013
     /***    DB2 TAB. 0350 (FILE).                                    */00430013
     /***                                                             */00440000
 /* MAINTENANCE LOG  :                                                */00451013
 /* ---------------                                                   */00452013
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                          */00454013
 /*  --------------------------------------------------------------   */00455013
 /*  2016-12-06 | PCEDSP-0454  | REPLACE NON-ENGLISH TEXT IN CEDS     */00457013
 /*             |              | CODE                                 */00458013
 /*********************************************************************/00459013
1/*-------------------------------------------------------------------*/00460000
0 DEFAULT RANGE (*) STATIC;                                             00470000
-/*-------------------------------------------------------------------*/00480000
 /*                                                                   */00490000
 /*         D E C L A R A T I O N S                /* SOC PCEDSP-0454 */00500013
 /*                                                                   */00510000
 /*-------------------------------------------------------------------*/00520000
-/*-------------------------------------------------------------------*/00530000
 /***   PLIXOPTION   -   O N L Y  FOR   M A I N   PROGRAM           ***/00540013
 /*-------------------------------------------------------------------*/00550000
-/*-------------------------------------------------------------------*/00560000
 /***   BIT                                                         ***/00570000
 /*-------------------------------------------------------------------*/00580000
   DCL  FOUNDKEY       BIT(1);                    /*OU CODE FOUND?    */00590013
   DCL  I0             BIN FIXED(31) EXTERNAL;    /*POS IN TABLE      */00600013
   DCL  J1             BIN FIXED(31);             /*UPPER LIMIT TABLE */00610013
   DCL  K1             BIN FIXED(31);             /*LOWER LIMIT TABLE */00620013
                                                   /* EOC PCEDSP-0454 */00621013
-/*-------------------------------------------------------------------*/00630000
 /***   ENTRIES                                                     ***/00640000
 /*-------------------------------------------------------------------*/00650000
-/*-------------------------------------------------------------------*/00660000
 /***   BUILTIN                                                     ***/00670000
 /*-------------------------------------------------------------------*/00680000
-/*-------------------------------------------------------------------*/00690000
 /***   POINTER                                                     ***/00700000
 /*-------------------------------------------------------------------*/00710000
0/*-------------------------------------------------------------------*/00720000
 /***   FILES                                                       ***/00730000
 /*-------------------------------------------------------------------*/00740000
0/*-------INPUT-------------------------------------------------------*/00750000
0/*-------OUTPUT------------------------------------------------------*/00760000
   DCL  SYSPRINT       FILE EXTERNAL PRINT;                             00770000
-/*-------------------------------------------------------------------*/00780000
 /***   ARBEITS - VARIABLE                         /* SOC PCEDSP-0454 */00790013
 /*-------------------------------------------------------------------*/00800000
   DCL  TBENDE         BIN FIXED (31) EXTERNAL;    /*TABLE END        */00810013
   DCL  XKDNR          CHAR(08) EXTERNAL;          /*CUSTNO 2 BE SEEK */00820013
                                                   /* EOC PCEDSP-0454 */00821013
-/*-------------------------------------------------------------------*/00830000
 /***   INCLUDES                                                    ***/00840000
 /*-------------------------------------------------------------------*/00850000
                                                       /* PCEDSP-0454 */00860013
   DCL 1 TB_T350(*) CTL EXTERNAL,        /* CUST-NR. & OU-CODE TAB.   */00870013
         2 KDNR   CHAR(08),                                             00880000
         2 OU_CD  CHAR(04),            /* LAST 4 DIGIT */               00890000
         2 OU_CD1 CHAR(03);            /* FIRST 3 DIGIT */              00900000
                                                                        00910000
1/*-------------------------------------------------------------------*/00920000
 /***      H E A D E R L I N E S                       /* PCEDSP-0454 */00930013
 /*-------------------------------------------------------------------*/00940000
-/*-------------------------------------------------------------------*/00950000
 /***      PRINT-LINES                                 /* PCEDSP-0454 */00960013
 /*-------------------------------------------------------------------*/00970000
-/*-------------------------------------------------------------------*/00980000
 /***    ON ENDFILE                                                 ***/00990000
 /*-------------------------------------------------------------------*/01000000
-/*-------------------------------------------------------------------*/01010000
 /***    O P E N    FILES                                           ***/01020000
 /*-------------------------------------------------------------------*/01030000
                                                                        01040000
1/*-------------------------------------------------------------------*/01050000
 /*                                                                   */01060000
 /*      P R O G R A M      -    S T A R T             /* PCEDSP-0454 */01070013
 /*                                                                   */01080014
 /*-------------------------------------------------------------------*/01090000
                                                   /* SOC PCEDSP-0454 */01100014
   FOUNDKEY = '0'B;                                                     01110000
   J1 = TBENDE + 1B;                              /*DEF UPPER LIMIT   */01120013
   K1 = 1B;                                       /*DEF LOWER LIMIT   */01130013
                                                                        01140000
   DO WHILE(¬FOUNDKEY);                                                 01150013
                                          /* DETERMIN POS IN TABLE    */01160013
      I0 = (J1 + K1) / 10B;              /* (UPPER + LOWER LIMIT) / 2 */01170013
                                                   /* EOC PCEDSP-0454 */01171014
      IF I0 = K1                                                        01180000
         THEN FOUNDKEY = '1'B;                                          01190000
         ELSE IF TB_T350.KDNR(I0) > XKDNR                               01200000
                 THEN J1 = I0;                                          01210000
                 ELSE IF TB_T350.KDNR(I0) < XKDNR                       01220000
                         THEN K1 = I0;                                  01230000
                         ELSE FOUNDKEY = '1'B;                          01240000
   END;                                                                 01250000
1/*-------------------------------------------------------------------*/01260000
 /***    C L O S E   FILES                                            */01270000
 /*-------------------------------------------------------------------*/01280000
                                                                        01290000
-END ROL411M;                                                           01300000