 /********************************************************************/ 00019114
 /* PROGRAM          : ROLBFLM                                       */ 00020000
 /*                                                                  */ 00030000
 /* LANGUAGE         : PLISQL                                        */ 00040000
 /*                                                                  */ 00050000
 /* TYPE             : BATCH                                         */ 00060000
 /*                                                                  */ 00070000
 /* DESCRIPTION      : BUILT TO UPDATE COUNTRY CODE ON FOLLOWING     */ 00080000
 /*                    FILES FROM 756 TO 755 FOR ISREAL              */ 00090000
 /*                                                                  */ 00100000
 /*                    PROCESS ID US04                               */ 00110000
 /*                    PECULIAR TO IR.                               */ 00120000
 /*                                                                  */ 00130000
 /* INPUT              ROLBF1I, ROLBF2I, ROLBF3I, ROLBF4I, ROLBF5I,  */ 00140000
 /*                    ROLBF6I                                       */ 00150000
 /*                                                                  */ 00160000
 /*                                                                  */ 00170000
 /* OUTPUT             ROLBF1O, ROLBF2O, ROLBF3O, ROLBF4O, ROLBF5O,  */ 00180000
 /*                    ROLBF6O                                       */ 00190000
 /*                                                                  */ 00200000
 /*                                                                  */ 00210000
 /*                                                                  */ 00220000
 /* EXTERNAL MODULES : NONE                                          */ 00230000
 /*                                                                  */ 00240000
 /* MESSAGES         :                                               */ 00250000
 /*                                                                  */ 00260000
 /* DEPENDENCIES     : NONE                                          */ 00270000
 /*                                                                  */ 00280000
 /* FREQUENCY        : USER DEPENDENT                                */ 00290000
 /*                                                                  */ 00300000
 /* MAINTENANCE LOG  :                                               */ 00310000
 /* ---------------                                                  */ 00320000
 /*                                                                  */ 00330000
 /*  DATE     | WORK-ITEMNO. | DESCRIPTION                           */ 00340000
 /*           |              |                                       */ 00350000
 /* 2004-04-15| RS MIGRATION | CHANGE COUNTRY NUMBER FROM 756 TO 755 */ 00360000
 /*           |              | FOR ISREAL IN TABLE LIKE FILES        */ 00370000
 /* 2007-11-19| CHG0R34P     | INCREASE LENGTH OF SERIAL NUMBER      */ 00371002
 /* --------------------------------------------------------------   */ 00380000
 /********************************************************************/ 00390000
 ROLBFLM:PROC OPTIONS(MAIN) REORDER;                                    00400000
    DCL (ADDR,                                                          00410000
         NULL,                                                          00420000
         ONCODE,                                                        00430000
         PLIDUMP,                                                       00440000
         PLIRETC,                                                       00450000
         UNSPEC,                                                        00460000
         SUBSTR) BUILTIN;                                               00470000
                                                                        00480000
                                                   /*SOC CHGR34P*/      00490002
                                                                        00500000
    DCL ROLBF1I FILE RECORD INPUT ENV(RECSIZE(089));                    00510001
    DCL ROLBF2I FILE RECORD INPUT ENV(RECSIZE(116));                    00520001
    DCL ROLBF3I FILE RECORD INPUT ENV(RECSIZE(116));                    00530001
    DCL ROLBF4I FILE RECORD INPUT ENV(RECSIZE(126));                    00540001
    DCL ROLBF5I FILE RECORD INPUT ENV(RECSIZE(164));                    00550001
    DCL ROLBF6I FILE RECORD INPUT ENV(RECSIZE(151));                    00560001
                                                                        00570000
    DCL ROLBF1O FILE RECORD OUTPUT ENV(RECSIZE(089));                   00580001
    DCL ROLBF2O FILE RECORD OUTPUT ENV(RECSIZE(116));                   00590001
    DCL ROLBF3O FILE RECORD OUTPUT ENV(RECSIZE(116));                   00600001
    DCL ROLBF4O FILE RECORD OUTPUT ENV(RECSIZE(126));                   00610001
    DCL ROLBF5O FILE RECORD OUTPUT ENV(RECSIZE(164));                   00620001
    DCL ROLBF6O FILE RECORD OUTPUT ENV(RECSIZE(151));                   00630001
    DCL SYSPRINT FILE PRINT;                                            00640000
                                                                        00650002
                                                                        00660000
                                                                        00670000
                                                                        00680000
    DCL 1 ROLBF1_REC       CHAR(89) INIT('');                           00690001
    DCL 1 ROLBF2_REC       CHAR(116) INIT('');                          00700001
    DCL 1 ROLBF3_REC       CHAR(116) INIT('');                          00710001
    DCL 1 ROLBF4_REC       CHAR(126) INIT('');                          00720001
    DCL 1 ROLBF5_REC       CHAR(164) INIT('');                          00730001
    DCL 1 ROLBF6_REC       CHAR(151) INIT('');                          00740001
                                                /*EOC CHGR34P*/         00750002
                                                                        00760000
    DCL 1 ROLBF1_SW_PR       BASED(ADDR(ROLBF1_REC)),                   00770000
          %INCLUDE (RCBBAAS1);,                                         00780000
        3 TB_RCBV060,                                                   00790000
          %INCLUDE (RCB060S);,                                          00800000
        3 TB_RCBV060_IND,                                               00810000
          %INCLUDE (RCB060SI);;                                         00820000
    DCL 1 ROLBF2_OU_SW       BASED(ADDR(ROLBF2_REC)),                   00830000
          %INCLUDE (RCBBAAS1);,                                         00840000
        3 TB_RCBV180,                                                   00850000
          %INCLUDE (RCB180S);,                                          00860000
        3 TB_RCBV180_IND,                                               00870000
          %INCLUDE (RCB180SI);;                                         00880000
    DCL 1 ROLBF3_ISC         BASED(ADDR(ROLBF3_REC)),                   00890000
          %INCLUDE (RCBBAAS1);,                                         00900000
        3 TB_RCBV180,                                                   00910000
          %INCLUDE (RCB180S);,                                          00920000
        3 TB_RCBV180_IND,                                               00930000
          %INCLUDE (RCB180SI);;                                         00940000
    DCL 1 ROLBF4_SW_CUST     BASED(ADDR(ROLBF4_REC)),                   00950000
          %INCLUDE (RCBBAAS1);,                                         00960000
        3 TB_RCBV200,                                                   00970000
          %INCLUDE (RCB200S);,                                          00980000
        3 TB_RCBV200_IND,                                               00990000
          %INCLUDE (RCB200SI);;                                         01000000
    DCL 1 ROLBF5_SW_IN_ORD   BASED(ADDR(ROLBF5_REC)),                   01010000
          %INCLUDE (RCBBAAS1);,                                         01020000
        3 TB_RCBV270,                                                   01030000
          %INCLUDE (RCB270S);,                                          01040000
        3 TB_RCBV270_IND,                                               01050000
          %INCLUDE (RCB270SI);;                                         01060000
    DCL 1 ROLBF6_SW_ON_HW    BASED(ADDR(ROLBF6_REC)),                   01070000
          %INCLUDE (RCBBAAS1);,                                         01080000
        3 TB_RCBV320,                                                   01090000
          %INCLUDE (RCB320S);,                                          01100000
        3 TB_RCBV320_IND,                                               01110000
          %INCLUDE (RCB320SI);;                                         01120000
                                                                        01130000
    DCL EOF_ROLBF1           BIT (1)         INIT ('0'B);               01140000
    DCL EOF_ROLBF2           BIT (1)         INIT ('0'B);               01150000
    DCL EOF_ROLBF3           BIT (1)         INIT ('0'B);               01160000
    DCL EOF_ROLBF4           BIT (1)         INIT ('0'B);               01170000
    DCL EOF_ROLBF5           BIT (1)         INIT ('0'B);               01180000
    DCL EOF_ROLBF6           BIT (1)         INIT ('0'B);               01190000
                                                                        01200000
                                                                        01210000
    DCL TRUE                 BIT (1)         INIT ('1'B);               01220000
    DCL FALSE                BIT (1)         INIT ('0'B);               01230000
                                                                        01240000
    DCL ROLBF1I_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01250000
    DCL ROLBF2I_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01260000
    DCL ROLBF3I_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01270000
    DCL ROLBF4I_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01280000
    DCL ROLBF5I_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01290000
    DCL ROLBF6I_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01300000
    DCL ROLBF1O_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01310000
    DCL ROLBF2O_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01320000
    DCL ROLBF3O_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01330000
    DCL ROLBF4O_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01340000
    DCL ROLBF5O_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01350000
    DCL ROLBF6O_COUNT        FIXED DEC (15,0)     INIT ('0'B);          01360000
                                                                        01370000
    ON ERROR                                                            01380000
    BEGIN;                                                              01390000
      ON ERROR SYSTEM;                                                  01400000
      CALL PLIDUMP;                                                     01410000
    END;                                                                01420000
                                                                        01430000
    DCL WRK_RCBBFA1          CHAR(7);                                   01440000
    DCL K                    PIC'9';                                    01450000
    DCL X                    CHAR(1) BASED(ADDR(K));                    01460000
    EXEC SQL                                                            01470000
      INCLUDE SQLCA;                                                    01480000
                                                                        01490000
    DCL 1 TB_RCBV500,                                                   01500000
        %INCLUDE (RCB500S);;                                            01510000
    DCL 1 TB_RCBV500_I,                                                 01520000
        %INCLUDE (RCB500SI);;                                           01530000
    DCL 1 RCB000SI,                                                     01540004
        %INCLUDE RCB000SI;;                                             01550000
    DCL 1 TB_RCB024    BASED (ADDR(TB_RCBV500)),                        01560000
        %INCLUDE (RCBP24S);;                                            01570000
                                                                        01580000
 /********************************************************************/ 01590000
 /*           ON CONDITIONS                                          */ 01600000
 /********************************************************************/ 01610000
                                                                        01620000
    ON ENDFILE(ROLBF1I) EOF_ROLBF1 = '1'B;                              01630000
    ON ENDFILE(ROLBF2I) EOF_ROLBF2 = '1'B;                              01640000
    ON ENDFILE(ROLBF3I) EOF_ROLBF3 = '1'B;                              01650000
    ON ENDFILE(ROLBF4I) EOF_ROLBF4 = '1'B;                              01660000
    ON ENDFILE(ROLBF5I) EOF_ROLBF5 = '1'B;                              01670000
    ON ENDFILE(ROLBF6I) EOF_ROLBF6 = '1'B;                              01680000
                                                                        01690000
                                                                        01700000
 /********************************************************************/ 01710000
 /*           START PROCESSING                                       */ 01720000
 /********************************************************************/ 01730000
                                                                        01740000
    PUT SKIP LIST('START PROCESSING');                                  01741023
    CALL ROLBFLM_INIT_PROCESS;                                          01750000
    CALL ROLBFLM_CHG_CTRY_NUM;                                          01760000
    CALL ROLBFLM_FINAL_PROCESS;                                         01770000
                                                                        01780000
 ROLBFLM_INIT_PROCESS:PROC;                                             01790000
                                                                        01800000
  PUT SKIP LIST('BEFORE OPEN FILES');                                   01801022
                                                                        01810000
   OPEN  FILE(ROLBF1I),                                                 01820000
         FILE(ROLBF2I),                                                 01830000
         FILE(ROLBF3I),                                                 01840000
         FILE(ROLBF4I),                                                 01850000
         FILE(ROLBF5I),                                                 01860000
         FILE(ROLBF6I),                                                 01870000
                                                                        01880000
         FILE(ROLBF1O),                                                 01890000
         FILE(ROLBF2O),                                                 01900000
         FILE(ROLBF3O),                                                 01910000
         FILE(ROLBF4O),                                                 01920000
         FILE(ROLBF5O),                                                 01930000
         FILE(ROLBF6O);                                                 01940000
                                                                        01950000
  PUT SKIP LIST('AFTER  OPEN FILES');                                   01951022
                                                                        01960000
    READ  FILE(ROLBF1I) INTO  (ROLBF1_REC);                             01970000
    ROLBF1I_COUNT = ROLBF1I_COUNT + 1;                                  01980000
    WRITE FILE(ROLBF1O) FROM  (ROLBF1_REC);                             01990000
    ROLBF1O_COUNT = ROLBF1O_COUNT + 1;                                  02000000
    READ  FILE(ROLBF1I) INTO  (ROLBF1_REC);                             02010000
                                                                        02020000
  PUT SKIP LIST('AFTER  READ1');                                        02021022
    READ  FILE(ROLBF2I) INTO  (ROLBF2_REC);                             02030000
    ROLBF2I_COUNT = ROLBF2I_COUNT + 1;                                  02040000
    WRITE FILE(ROLBF2O) FROM  (ROLBF2_REC);                             02050000
    ROLBF2O_COUNT = ROLBF2O_COUNT + 1;                                  02060000
    READ  FILE(ROLBF2I) INTO  (ROLBF2_REC);                             02070000
                                                                        02080000
    READ  FILE(ROLBF3I) INTO  (ROLBF3_REC);                             02090000
    ROLBF3I_COUNT = ROLBF3I_COUNT + 1;                                  02100000
    WRITE FILE(ROLBF3O) FROM  (ROLBF3_REC);                             02110000
    ROLBF3O_COUNT = ROLBF3O_COUNT + 1;                                  02120000
    READ  FILE(ROLBF3I) INTO  (ROLBF3_REC);                             02130000
                                                                        02140000
    READ  FILE(ROLBF4I) INTO  (ROLBF4_REC);                             02150000
    ROLBF4I_COUNT = ROLBF4I_COUNT + 1;                                  02160000
    WRITE FILE(ROLBF4O) FROM  (ROLBF4_REC);                             02170000
    ROLBF4O_COUNT = ROLBF4O_COUNT + 1;                                  02180000
    READ  FILE(ROLBF4I) INTO  (ROLBF4_REC);                             02190000
                                                                        02200000
    READ  FILE(ROLBF5I) INTO  (ROLBF5_REC);                             02210000
    ROLBF5I_COUNT = ROLBF5I_COUNT + 1;                                  02220000
    WRITE FILE(ROLBF5O) FROM  (ROLBF5_REC);                             02230000
    ROLBF5O_COUNT = ROLBF5O_COUNT + 1;                                  02240000
    READ  FILE(ROLBF5I) INTO  (ROLBF5_REC);                             02250000
                                                                        02260000
    READ  FILE(ROLBF6I) INTO  (ROLBF6_REC);                             02270000
    ROLBF6I_COUNT = ROLBF6I_COUNT + 1;                                  02280000
    WRITE FILE(ROLBF6O) FROM  (ROLBF6_REC);                             02290000
    ROLBF6O_COUNT = ROLBF6O_COUNT + 1;                                  02300000
    READ  FILE(ROLBF6I) INTO  (ROLBF6_REC);                             02310000
                                                                        02320000
                                                                        02330000
 END ROLBFLM_INIT_PROCESS;                                              02340000
                                                                        02350000
 ROLBFLM_CHG_CTRY_NUM:PROC;                                             02360000
                                                                        02370000
 /****************************************************************/     02380000
 /*   CHANGE THE COUNTRY NUMBER FROM 756 TO 755 FOR US04 TABLE   */     02390000
 /*   LIKE FILES RCBBFA1, RCBBFA2, RCBBFA3, RCBBFA4, RCBBFA5,    */     02400000
 /*   RCBBFA6                                                    */     02410000
 /****************************************************************/     02420000
                                                                        02430000
    DO WHILE (ROLBF1_SW_PR.REC_TYPE ¬= '99');                           02440000
        ROLBF1I_COUNT = ROLBF1I_COUNT + 1;                              02450000
        ROLBF1_SW_PR.CTRYNO         = '755';                            02460000
        ROLBF1_SW_PR.COUNTRY_NUMBER = '755';                            02470000
                                                                        02480000
        WRITE FILE(ROLBF1O) FROM  (ROLBF1_REC);                         02490000
        ROLBF1O_COUNT = ROLBF1O_COUNT + 1;                              02500000
                                                                        02510000
        READ  FILE(ROLBF1I) INTO  (ROLBF1_REC);                         02520000
    END;                                                                02530000
    ROLBF1I_COUNT = ROLBF1I_COUNT + 1;                                  02540000
    WRITE FILE(ROLBF1O) FROM  (ROLBF1_REC);                             02550000
    ROLBF1O_COUNT = ROLBF1O_COUNT + 1;                                  02560000
                                                                        02570000
    DO WHILE (ROLBF2_OU_SW.REC_TYPE ¬= '99');                           02580000
        ROLBF2I_COUNT = ROLBF2I_COUNT + 1;                              02590000
        ROLBF2_OU_SW.CTRYNO         = '755';                            02600000
        ROLBF2_OU_SW.COUNTRY_NUMBER = '755';                            02610000
                                                                        02620000
        WRITE FILE(ROLBF2O) FROM  (ROLBF2_REC);                         02630000
        ROLBF2O_COUNT = ROLBF2O_COUNT + 1;                              02640000
                                                                        02650000
        READ  FILE(ROLBF2I) INTO  (ROLBF2_REC);                         02660000
    END;                                                                02670000
    ROLBF2I_COUNT = ROLBF2I_COUNT + 1;                                  02680000
    WRITE FILE(ROLBF2O) FROM  (ROLBF2_REC);                             02690000
    ROLBF2O_COUNT = ROLBF2O_COUNT + 1;                                  02700000
                                                                        02710000
    DO WHILE (ROLBF3_ISC.REC_TYPE ¬= '99');                             02720000
        ROLBF3I_COUNT = ROLBF3I_COUNT + 1;                              02730000
        ROLBF3_ISC.CTRYNO         = '755';                              02740000
        ROLBF3_ISC.COUNTRY_NUMBER = '755';                              02750000
                                                                        02760000
        WRITE FILE(ROLBF3O) FROM  (ROLBF3_REC);                         02770000
        ROLBF3O_COUNT = ROLBF3O_COUNT + 1;                              02780000
                                                                        02790000
        READ  FILE(ROLBF3I) INTO  (ROLBF3_REC);                         02800000
    END;                                                                02810000
    ROLBF3I_COUNT = ROLBF3I_COUNT + 1;                                  02820000
    WRITE FILE(ROLBF3O) FROM  (ROLBF3_REC);                             02830000
    ROLBF3O_COUNT = ROLBF3O_COUNT + 1;                                  02840000
                                                                        02850000
    DO WHILE (ROLBF4_SW_CUST.REC_TYPE ¬= '99');                         02860000
        ROLBF4I_COUNT = ROLBF4I_COUNT + 1;                              02870000
        ROLBF4_SW_CUST.CTRYNO         = '755';                          02880000
        ROLBF4_SW_CUST.COUNTRY_NUMBER = '755';                          02890000
                                                                        02900000
        WRITE FILE(ROLBF4O) FROM  (ROLBF4_REC);                         02910000
        ROLBF4O_COUNT = ROLBF4O_COUNT + 1;                              02920000
                                                                        02930000
        READ  FILE(ROLBF4I) INTO  (ROLBF4_REC);                         02940000
    END;                                                                02950000
    ROLBF4I_COUNT = ROLBF4I_COUNT + 1;                                  02960000
    WRITE FILE(ROLBF4O) FROM  (ROLBF4_REC);                             02970000
    ROLBF4O_COUNT = ROLBF4O_COUNT + 1;                                  02980000
                                                                        02990000
    DO WHILE (ROLBF5_SW_IN_ORD.REC_TYPE ¬= '99');                       03000000
        ROLBF5I_COUNT = ROLBF5I_COUNT + 1;                              03010000
        ROLBF5_SW_IN_ORD.CTRYNO         = '755';                        03020000
        ROLBF5_SW_IN_ORD.COUNTRY_NUMBER = '755';                        03030000
                                                                        03040000
        WRITE FILE(ROLBF5O) FROM  (ROLBF5_REC);                         03050000
        ROLBF5O_COUNT = ROLBF5O_COUNT + 1;                              03060000
                                                                        03070000
        READ  FILE(ROLBF5I) INTO  (ROLBF5_REC);                         03080000
    END;                                                                03090000
    ROLBF5I_COUNT = ROLBF5I_COUNT + 1;                                  03100000
    WRITE FILE(ROLBF5O) FROM  (ROLBF5_REC);                             03110000
    ROLBF5O_COUNT = ROLBF5O_COUNT + 1;                                  03120000
                                                                        03130000
    DO WHILE (ROLBF6_SW_ON_HW.REC_TYPE ¬= '99');                        03140000
        ROLBF6I_COUNT = ROLBF6I_COUNT + 1;                              03150000
        ROLBF6_SW_ON_HW.CTRYNO         = '755';                         03160000
        ROLBF6_SW_ON_HW.COUNTRY_NUMBER = '755';                         03170000
                                                                        03180000
        WRITE FILE(ROLBF6O) FROM  (ROLBF6_REC);                         03190000
        ROLBF6O_COUNT = ROLBF6O_COUNT + 1;                              03200000
                                                                        03210000
        READ  FILE(ROLBF6I) INTO  (ROLBF6_REC);                         03220000
    END;                                                                03230000
    ROLBF6I_COUNT = ROLBF6I_COUNT + 1;                                  03240000
    WRITE FILE(ROLBF6O) FROM  (ROLBF6_REC);                             03250000
    ROLBF6O_COUNT = ROLBF6O_COUNT + 1;                                  03260000
                                                                        03270000
                                                                        03280000
 END ROLBFLM_CHG_CTRY_NUM;                                              03290000
                                                                        03300000
 ROLBFLM_FINAL_PROCESS:PROC;                                            03310000
                                                                        03320000
   CLOSE  FILE(ROLBF1I),                                                03330000
          FILE(ROLBF2I),                                                03340000
          FILE(ROLBF3I),                                                03350000
          FILE(ROLBF4I),                                                03360000
          FILE(ROLBF5I),                                                03370000
          FILE(ROLBF6I),                                                03380000
                                                                        03390000
          FILE(ROLBF1O),                                                03400000
          FILE(ROLBF2O),                                                03410000
          FILE(ROLBF3O),                                                03420000
          FILE(ROLBF4O),                                                03430000
          FILE(ROLBF5O),                                                03440000
          FILE(ROLBF6O);                                                03450000
    WRK_RCBBFA1 = 'RCBBFA'||'5';                                        03460000
    CALL INSERT_RCB024;                                                 03470000
                                                                        03480000
 DO K = 1 TO 5;                                                         03490000
    WRK_RCBBFA1 = 'RCBBRA'||X;                                          03500000
    CALL INSERT_RCB024;                                                 03510000
 END;                                                                   03520000
    PUT SKIP LIST ('RCBBFAF1 READ COUNT = '|| ROLBF1I_COUNT);           03530000
    PUT SKIP LIST ('RCBBFAF2 READ COUNT = '|| ROLBF2I_COUNT);           03540000
    PUT SKIP LIST ('RCBBFAF3 READ COUNT = '|| ROLBF3I_COUNT);           03550000
    PUT SKIP LIST ('RCBBFAF4 READ COUNT = '|| ROLBF4I_COUNT);           03560000
    PUT SKIP LIST ('RCBBFAF5 READ COUNT = '|| ROLBF5I_COUNT);           03570000
    PUT SKIP LIST ('RCBBFAF6 READ COUNT = '|| ROLBF6I_COUNT);           03580000
                                                                        03590000
    PUT SKIP LIST ('RCBBFAF1 WRITE COUNT = '|| ROLBF1O_COUNT);          03600000
    PUT SKIP LIST ('RCBBFAF2 WRITE COUNT = '|| ROLBF2O_COUNT);          03610000
    PUT SKIP LIST ('RCBBFAF3 WRITE COUNT = '|| ROLBF3O_COUNT);          03620000
    PUT SKIP LIST ('RCBBFAF4 WRITE COUNT = '|| ROLBF4O_COUNT);          03630000
    PUT SKIP LIST ('RCBBFAF5 WRITE COUNT = '|| ROLBF5O_COUNT);          03640000
    PUT SKIP LIST ('RCBBFAF6 WRITE COUNT = '|| ROLBF6O_COUNT);          03650000
                                                                        03660000
                                                                        03670000
                                                                        03680000
    PUT SKIP LIST ('***********************************************');  03690000
    PUT SKIP LIST ('           END OF MODULE ROLBFLM               ');  03700000
    PUT SKIP LIST ('***********************************************');  03710000
 END ROLBFLM_FINAL_PROCESS;                                             03720000
                                                                        03730000
 INSERT_RCB024: PROC;                                                   03740000
 /************************************/                                 03750000
 /* RETRIEVE RCB024 FOR 756          */                                 03760000
 /************************************/                                 03770000
 /* INSERT FROM 756 TO 755           */                                 03780000
 /************************************/                                 03790000
   TB_RCBV500            = '';     /* INIT TABLESTRUCTURE            */ 03800000
   TB_RCBV500_I          = '';                                          03810000
   TB_RCB024.NUMBER      = 'RCB024';                                    03820000
   TB_RCB024.PROC_ID     = 'US04' ;                                     03830000
   TB_RCB024.CTRYNO      = '756';                                       03840000
   TB_RCB024.FILE_NAME   = WRK_RCBBFA1;                                 03850000
   TB_RCB024.SEQ_NUMBER  = '01';                                        03860015
   TB_RCB024.FILLER1     = '    ';                                      03870015
 /*RCB000SI.INDNULL_3    = '';                                          03871016
   RCB000SI.INDNULL_4    = '';                                          03872015
                                    INPUT FILE TIMESTAMP + HASH TOTAL*/ 03880016
   /*  PUT SKIP LIST('NO NULL INTIATED'); */                            03881024
 EXEC SQL                                                               03890000
        SELECT *                                                        03900000
        INTO   :TB_RCBV500:TB_RCBV500_I.INDNULL                         03910000
        FROM   RCBV0500_PARM                                            03920000
        WHERE  PARAMETER_NUMBER   = :TB_RCBV500.PARAMETER_NUMBER        03930000
        AND  PARAMETER_KEY      = :TB_RCBV500.PARAMETER_KEY;            03940000
    /*    PUT SKIP LIST('SQLCODE',SQLCA.SQLCODE); */                    03941024
   SELECT(SQLCA.SQLCODE);                                               03950000
     WHEN (0)                                                           03960000
     DO;                                                                03970000
         TB_RCB024.CTRYNO      = '755';                                 03980000
         EXEC SQL                                                       03990000
            UPDATE RCBV0500_PARM                                        04000000
            SET    DESCRIPTION  = :TB_RCBV500.DESCRIPTION               04010000
                                  :RCB000SI.INDNULL_3,                  04020000
             PARAMETER_VALUE    = :TB_RCBV500.PARAMETER_VALUE           04030000
                                  :RCB000SI.INDNULL_4                   04040000
             WHERE PARAMETER_NUMBER   = :TB_RCBV500.PARAMETER_NUMBER    04050000
             AND  PARAMETER_KEY        = :TB_RCBV500.PARAMETER_KEY;     04060000
    /*    PUT SKIP LIST('UPDATE SQLCODE',SQLCA.SQLCODE); */             04061024
         SELECT(SQLCA.SQLCODE);                                         04080000
           WHEN (0);                                                    04090000
           WHEN (100)              /* WHEN NOT FOUND THEN INSERT  */    04100000
           DO;                                                          04110000
             EXEC SQL                                                   04120000
               INSERT INTO RCBV0500_PARM                                04130000
               (PARAMETER_NUMBER,                                       04140000
                PARAMETER_KEY,                                          04150000
                DESCRIPTION,                                            04160000
                PARAMETER_VALUE)                                        04170000
                VALUES (:TB_RCBV500:TB_RCBV500_I.INDNULL);              04180000
     /*   PUT SKIP LIST('SQLCODE INSERT',SQLCA.SQLCODE); */             04181024
               SELECT(SQLCA.SQLCODE);                                   04190000
                 WHEN (0);                                              04200000
                 OTHERWISE                                              04210000
                 DO;                                                    04220000
                    PUT SKIP LIST                                       04230000
                    ('ERROR WHILE INSERTING RCB024; SQL CODE :',        04240000
                     SQLCA.SQLCODE );                                   04250000
               /*     PUT SKIP DATA(TB_RCBV500); */                     04251024
                     SIGNAL ERROR;                                      04260000
                 END;                                                   04270000
               END;                                                     04280000
           END;                                                         04290000
           OTHERWISE                                                    04300000
           DO;                                                          04310000
             PUT SKIP LIST ('ERROR WHILE UPDATING RCB024; SQL CODE :',  04320000
             SQLCA.SQLCODE );                                           04330000
           /*         PUT SKIP DATA(TB_RCBV500); */                     04331024
                     SIGNAL ERROR;                                      04340000
           END;                                                         04350000
         END;                                                           04360000
     END;                                                               04370000
     OTHERWISE                                                          04380000
     DO;                                                                04390000
             PUT SKIP LIST ('ERROR WHILE RETREIVING RCB024; SQL CODE :',04400000
             SQLCA.SQLCODE );                                           04410000
       /*             PUT SKIP DATA(TB_RCBV500); */                     04411024
             SIGNAL ERROR;                                              04420000
     END;                                                               04430000
   END;                                                                 04440000
 END INSERT_RCB024;                                                     04450000
                                                                        04460000
 END ROLBFLM;                                                           04470000