 /* ROLBCAM - SOF HW PO: EXTRACT                                     */ 00010099
 /********************************************************************/ 00020000
 /*                                                                  */ 00030000
 /********************************************************************/ 00040000
 /* 5695-153 (C) COPYRIGHT IBM EMEA WORLD TRADE CORPORATION 1991     */ 00050000
 /* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                      */ 00060000
 /* REFER TO COPYRIGHT INSTRUCTIONS: FORM G120-2083                  */ 00070000
 /********************************************************************/ 00080000
 /*                                                                  */ 00090000
 /* MODULE NAME      : ROLBCAM                                       */ 00100099
 /*                                                                  */ 00110000
 /* PROGRAM NAME     : ROLBCAP(THIS PGM IS LOCAL CLONE OF RCBBCAM)   */ 00120099
 /*                                                                  */ 00130000
 /* LANGUAGE         : PLISQL                                        */ 00140000
 /*                                                                  */ 00150000
 /* TYPE             : BMP                                           */ 00160000
 /*                                                                  */ 00170000
 /* DESCRIPTION      : RETRIEVE HW PRODUCT INFORMATION FROM          */ 00180000
 /*                    SOF.                                          */ 00190000
 /*                    CREATE TABLE-LIKE FILES.                      */ 00200000
 /*                                                                  */ 00210000
 /* INPUT            : - DB2   : RCBT0070_HW_PO            RB01140   */ 00220000
 /*                              RCBT0400_PO_MOD1                    */ 00230000
 /*                              RCBT0500_PARM                       */ 00240000
 /*                    - IMS   : VSDDI0  MACHINE INVENTORY           */ 00250000
 /*                              VSDDO0  MACHINE ORDER               */ 00260000
 /*                              VSDDR0  MACHINE REMOVAL             */ 00270000
 /*                              VSDDF0  MACHINE FEATURE             */ 00280000
 /*                              VSDDC0  MACHINE CAPACITY            */ 00290000
 /*                    - FILES : RCBBC2I PARAMETER FILE    RC01318   */ 00300000
 /*                                                                  */ 00301000
 /* OUTPUT           : - FILES : RCBBCA0 HW PRODUCT    (GSAM)        */ 00310000
 /*                              RCBBCA1 MES ORDER     (GSAM)        */ 00320000
 /*                              RCBBCA2 HW STATUS     (GSAM)        */ 00330000
 /*                              RCBBCA3 OU/HW         (GSAM)        */ 00340000
 /*                              RCBBCA4 HW/CUSTOMER   (GSAM)        */ 00350000
 /*                              RCBBCA5 SUPPLY CONTR. (GSAM)        */ 00360000
 /*                              RCBBCA6 MES ORDER/HW  (GSAM)        */ 00370000
 /*                              RCBBCA7 HW PO / ORDER (GSAM)        */ 00380000
 /*                              RCBBCA8 HW PO REAL.   (GSAM)        */ 00390000
 /*                              RCBBCA9 FEATURES      (GSAM)        */ 00400000
 /*                              RCBBCAA MES ORDER/HW PO IN          */ 00410000
 /*                                      ORDER         (GSAM)        */ 00420000
 /*                              RCBBCAB HW MOD. INFO  (GSAM)        */ 00430000
 /*                              RCB0M10 MESSAGES ISSUED             */ 00440000
 /*                                                                  */ 00450000
 /* SEC TRANSACTIONS :        ----                                   */ 00460000
 /*                                                                  */ 00470000
 /*                                                                  */ 00480000
 /* EXTERNAL MODULES :        - PLITDLI   CALL TO IMS                */ 00490000
 /*                           - RCB0E1M   COMMON ERROR ROUTINE       */ 00500000
 /*                           - RCB0M1M   COMMON MESSAGE ROUTINE     */ 00510000
 /*                           - RCB0T1M   RETRIEVE SYSTEM DATE       */ 00520000
 /*                           - RCB000M   CHECK SCHEDULED DATE (1)   */ 00530000
 /*                           - RCB002M   DETERMINE MES NAME CODE    */ 00540000
 /*                           - RCB004M   CHECK/CONVERT DATE         */ 00550000
 /*                           - RCB007M   CHECK FEATURE CODES        */ 00560000
 /*                           - RCB008M   CONVERT FEATURE CODE       */ 00570000
 /*                           - RCB018M   COMPUTE HASH TOTAL         */ 00580000
 /*                           - RCB019M   RETRIEVE COUNTRY NUMBERS   */ 00590000
 /*                           - RCB020M   RETRIEVE RUN DATE          */ 00600000
 /*                           - RCB023M   RETRIEVE SLC'S             */ 00610000
 /*                           - RCBIAGM   REFERENCE HW_PO    (T0070) */ 00620000
 /*                           - RCBI50M   REFERENCE PARAMETER        */ 00630000
 /*                           - RCBF50M   INSERT PARAMETER           */ 00640000
 /*                           - RCBG50M   UPDATE PARAMETER           */ 00650000
 /*                           - RCBBC1U   USER EXIT (CUF DI INFO)    */ 00660000
 /*                           - RCBBC2U   USER EXIT (CUF DO INFO)    */ 00670000
 /*                                                                  */ 00680000
 /* MESSAGES         :        0001/0002/0003/0004/0005/0008/0012/    */ 00690000
 /*                           0162/0173/0322/0323/0324/9998/9999/I050*/ 00700000
 /*                                                                  */ 00710000
 /* SCREENS          :        ----                                   */ 00720000
 /*                                                                  */ 00730000
 /* DEPENDENCIES     :        HAS TO BE NORMAL COMPLETED BEFORE      */ 00740000
 /*                           RUNNING RCBBCCM/.../RCBBCOM            */ 00750000
 /*                                                                  */ 00760000
 /* FREQUENCY        :        USER DEPENDENT (ON REQUEST)            */ 00770000
 /*                                                                  */ 00780000
 /*  MAINTENANCE LOG :                                               */ 00790000
 /*  ---------------                                                 */ 00800000
 /*                                                                  */ 00810000
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00820000
 /*  --------------------------------------------------------------  */ 00830000
 /*  1992-04-01 | ----         | CEDS INITIAL DEVELOPMENT            */ 00840000
 /*  1992-07-31 | CED0001      | HASH TOTALS                         */ 00850000
 /*  1993-03-22 | RC1032       | MCO AND TABLE CHANGES               */ 00860000
 /*  1993-03-22 | RC1035       | COUNTRY USE FIELDS                  */ 00870000
 /*  1993-06-09 | PTM 290      | SEE PTM DESCRIPTION                 */ 00880000
 /*  1993-06-16 | PTM 299      | SEE PTM DESCRIPTION                 */ 00890000
 /*  1993-11-30 | CED0014      | CHANGE FETCH INTO CALL SEE PTM 374  */ 00900000
 /*  1994-04-18 | PTM 496      | SEE PTM DESCRIPTION                 */ 00910000
 /*  1994-08-31 | PTM 53*      | IND NUMBER CHANGE                   */ 00920000
 /*  1994-11-15 | RC01116      | STORE TYPE OF WARRANTY              */ 00930000
 /*  1995-05-11 | PTM 696      | USE WED + INVALID TPWAR             */ 00940000
 /*  1995-08-28 | RA01141      | DISPLAY OFFENDING KEY        (DG)   */ 00950000
 /*  1995-08-28 | RB01140      | TABLE CHANGES                (DG)   */ 00960000
 /*  1996-05-11 | PTM 987      | SOF RECONCILIATION FOR SPAIN        */ 00970000
 /*  1997-04-11 | PTM1036      | CORRECTED PROLOG                    */ 00980000
 /*  1997-10-02 | RC01190      | CEDS SUPPORT SLC WARRANTY IN SOF    */ 00990000
 /*  1997-10-30 | PTM1107      | FILL CHECKPOINT PARAMETERS FOR      */ 01000000
 /*             |              | CORRECT REPOSITIONING               */ 01010000
 /*  1997-11-13 | PTM1131      | ALSO RETRIEVE SLC IF TYPE_OF_MAINT  */ 01020000
 /*             |              |   IS LEASE/RENTAL                   */ 01030000
 /*  1999-07-28 | RC01219      | DORO                                */ 01040000
 /*  2001-11-06 | RA01229      | SERVICE LEVEL INTERIM               */ 01050000
 /*  2004-06-30 | RB01242      | INCREASE LENGTH OF SERIAL NUMBER    */ 01060000
 /*  2007-08-08 | RB01281      | CHANGES FOR FLEXIBLE WARRANTY       */ 01060100
 /*             |              | MACHINES                            */ 01061000
 /*  2007-09-12 | CEDS00000345 | F_SPLT_DATE IS NOT ALLOWED TO       */ 01061100
 /*             |              | EXCEED WARRANTY_EXP_DATE            */ 01061200
 /*  2007-09-14 | CEDS00000347 | IF A VALID SLC IS AVAILABLE IN T690 */ 01061300
 /*             |              | FOR FW MACHINES IT WILL BE PICKED   */ 01061400
 /*             |              | O.W WILL BE PICKED FROM T400        */ 01061500
 /*  2007-10-07 | CEDS00000352 | PERFORMANCE ISSUE OVER CEDS 3.3 QF  */ 01061600
 /*             |              | AK                                  */ 01061700
 /*  2008-04-18 | CEDS00000377 | NULL VALUES FOR SLC FROM RCBT0690   */ 01061800
 /*             |              | HANDLED                             */ 01061900
 /*  2008-08-22 | CEDS00000373 | QUANTITY FEATURE IS RESTRICTED TO   */ 01062000
 /*             |              | A VALUE OF 999                      */ 01063000
 /*  2008-09-17 | CEDS00000445 | PERFORMANCE FIX OVER CEDS 3.3 QF    */ 01064000
 /*             |              | FLEXIBLE WARRANTY RECTIFIED         */ 01065000
 /*  2008-11-11 | RB01298      | ALIGNMENT/CHANGES DUE TO HARDBUNDLE */ 01065100
 /*             |              | IMPACT                              */ 01065200
 /*  2012-02-08 | CEDS00000575 |  F_SPLT_DATE, F_TYPE_OF WARRANTY    */ 01065300
 /*             |              |  SERVICE_LVL_CODE_2 ARE MADE BLANK  */ 01065400
 /*             |              |  WHEN F_SPLT_DATE > WED             */ 01065500
 /*  2012-05-14 | RC01318      | SUPPORT AN ADDITIONAL SOURCE FOR    */ 01065600
 /*             |              | INVENTORY TO SUPPORT THE RSS        */ 01065700
 /*  2012-09-13 | CEDS00000592 | TREC T080845:CHANGING DC TO DO      */ 01065800
 /*             |              | FIELDS FOR IS0012 MESSAGE           */ 01065900
 /*  2012-09-14 | RB01320      | A17 - LONG SERIAL NO. CHANGES       */ 01066000
 /*  2012-10-12 | RC01323      | APPLY RSS FILTER TO SUPPORT RSS PRO-*/ 01066200
 /*             |              | DUCT WHEN RUNMODE IS S2             */ 01066300
 /*  2013-03-12 | RC01329      | REPLACING ORIGIN_NUMERIC CHECK WITH */ 01066400
 /*             |              | SERIAL_ALPHANUMERIC CHECK FOR AN ON_*/ 01066500
 /*             |              | ORDER_MACHINE WHICH COMES FROM SOF. */ 01066600
 /*             |              | WTASS.                              */ 01066700
 /*  2013-04-29 | CEDS00000633 | CORRECT SEQUENCE_KEY VALUE PASSED   */ 01066800
 /*             |              | INCASE OF ERROR MESSAGE #001        */ 01066900
 /*  2014-01-06 | RC01337      | PCR PCEDSP 0061 - MAPPING CPU TYPE  */ 01067000
 /*             |              | WITH SYSTEM TYPE WHEN RUNMODE IS S1 */ 01067100
 /*             |              | (FOR IBASE SOURCE)                  */ 01067200
 /* 2016-10-24  | PCEDSP-0692  | (L) LOCAL WORKAROUND FOR PCR691     */ 01067399
 /*             |              | (USE TOM = "I" FOR BRAZIL)          */ 01067499
 /********************************************************************/ 01068000
1ROLBCAM: PROC (PTR_PCB_IO               /* IO PCB                   */ 01080099
               ,PTR_RBDGDI0              /* MACHINE INVENTORY DB     */ 01090000
               ,PTR_RBDGDO0              /* MACHINE ORDER DB         */ 01100000
               ,PTR_RBDGDR0              /* MACHINE REMOVAL DB       */ 01110000
               ,PTR_RBDGDF0              /* MACHINE FEATURE DB       */ 01120000
               ,PTR_RBDGDC0              /* MACHINE CAPACITY DB      */ 01130000
               ,PTR_RCBBCA0              /* HW PRODUCTS              */ 01140000
               ,PTR_RCBBCA1              /* MES ORDERS               */ 01150000
               ,PTR_RCBBCA2              /* HW STATUS                */ 01160000
               ,PTR_RCBBCA3              /* OU/HW RELATIONS          */ 01170000
               ,PTR_RCBBCA4              /* HW/CUSTOMER RELATIONS    */ 01180000
               ,PTR_RCBBCA5              /* SUPPLY CONTRACTS         */ 01190000
               ,PTR_RCBBCA6              /* MES ORDER/HW RELATIONS   */ 01200000
               ,PTR_RCBBCA7              /* HW PO / ORDER RELATIONS  */ 01210000
               ,PTR_RCBBCA8              /* HW PO REALIZATIONS       */ 01220000
               ,PTR_RCBBCA9              /* FEATURES                 */ 01230000
               ,PTR_RCBBCAA              /* MES/HW PO'S IN ORDERS    */ 01240000
               ,PTR_RCBBCAB)             /* HW MODIFIABLE INFO       */ 01250000
          OPTIONS (MAIN)                                                01260000
          REORDER;                                                      01270000
1/********************************************************************/ 01280000
 /*  PARAMETERS                                                      */ 01290000
 /********************************************************************/ 01300000
0DCL PTR_PCB_IO              PTR;                                       01310000
 DCL PTR_RBDGDI0             PTR;                                       01320000
 DCL PTR_RBDGDO0             PTR;                                       01330000
 DCL PTR_RBDGDR0             PTR;                                       01340000
 DCL PTR_RBDGDF0             PTR;                                       01350000
 DCL PTR_RBDGDC0             PTR;                                       01360000
 DCL PTR_RCBBCA0             PTR;                                       01370000
 DCL PTR_RCBBCA1             PTR;                                       01380000
 DCL PTR_RCBBCA2             PTR;                                       01390000
 DCL PTR_RCBBCA3             PTR;                                       01400000
 DCL PTR_RCBBCA4             PTR;                                       01410000
 DCL PTR_RCBBCA5             PTR;                                       01420000
 DCL PTR_RCBBCA6             PTR;                                       01430000
 DCL PTR_RCBBCA7             PTR;                                       01440000
 DCL PTR_RCBBCA8             PTR;                                       01450000
 DCL PTR_RCBBCA9             PTR;                                       01460000
 DCL PTR_RCBBCAA             PTR;                                       01470000
 DCL PTR_RCBBCAB             PTR;                                       01480000
1/********************************************************************/ 01490000
 /* FILE DECLARATIONS (NON GSAM)                                     */ 01500000
 /********************************************************************/ 01510000
0DCL RCBBCAD  FILE RECORD INPUT;   /* TABLE 690 RECORDS- CEDS00000352*/ 01511000
0DCL RCBBC2I  FILE RECORD INPUT;   /* RC01318 */                        01512000
0DCL RCB0M10  FILE RECORD OUTPUT;                                       01520000
1/********************************************************************/ 01530000
 /* EXTERNAL ENTRIES                                                 */ 01540000
 /********************************************************************/ 01550000
0DCL PLIXOPT   VAR    EXTERNAL  CHAR (256)                              01560000
               INIT ('NOSTAE,ISA(32K),REPORT,HEAP(16K,ANYWHERE)');      01570000
 DCL PLITDLI   ENTRY  EXTERNAL;          /* CALL TO IMS              */ 01580000
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01590000
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGE ROUTINE   */ 01600000
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* SYSTEM DATE              */ 01610000
 DCL RCB000M   ENTRY  EXTERNAL;          /* CHECK SCHEDULED DATE (1) */ 01620000
 DCL RCB002M   ENTRY (CHAR(01),PTR) EXTERNAL                            01630000
               RETURNS (CHAR(01));       /* DETERMINE MES NAME CODE  */ 01640000
 DCL RCB004M   ENTRY  EXTERNAL;          /* CHECK/CONVERT DATE       */ 01650000
 DCL RCB007M   ENTRY  EXTERNAL;          /* CHECK FEATURE CODES      */ 01660000
 DCL RCB008M   ENTRY (CHAR(06),PTR) EXTERNAL                            01670000
               RETURNS (CHAR(06));       /* CONVERT FEATURE CODE     */ 01680000
 DCL RCB018M   ENTRY  EXTERNAL;          /* COMPUTE HASH TOTAL       */ 01690000
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01700000
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01710000
 DCL RCB023M   ENTRY  EXTERNAL;          /* RETRIEVE SLC'S   *RC01190*/ 01720000
                                         /* PTM 290                  */ 01730000
 DCL RCBIAGM   ENTRY  EXTERNAL;          /* REFERENCE HW_PO          */ 01740000
 DCL RCBI50M   ENTRY  EXTERNAL;          /* REFERENCE PARAMETER      */ 01750000
 DCL RCBF50M   ENTRY  EXTERNAL;          /* INSERT PARAMETER         */ 01760000
 DCL RCBG50M   ENTRY  EXTERNAL;          /* UPDATE PARAMETER         */ 01770000
 DCL RCBBC1U   ENTRY  EXTERNAL;          /* USER EXIT (CUF DI INFO)  */ 01780000
 DCL RCBBC2U   ENTRY  EXTERNAL;          /* USER EXIT (CUF DO INFO)  */ 01790000
0/********************************************************************/ 01800000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01810000
 /********************************************************************/ 01820000
0DCL PTR_INT_AREA        PTR;                                           01830000
 DCL PTR_RETURN_AREA     PTR;                                           01840000
 DCL PTR_DATE_AREA       PTR;                                           01850000
 DCL PTR_FEAT_AREA       PTR;                                           01860000
 DCL PTR_COUNTRY_AREA    PTR;                                           01870000
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 01880000
                                       /* PTM 290                    */ 01890000
                                                                        01900000
 DCL 1 PARM_INT_AREA,                          /* INTERFACE AREA     */ 01910000
       %INCLUDE (RCBZ01S);;                                             01920000
 DCL 1 RETURN_AREA,                            /* RETURN AREA        */ 01930000
       %INCLUDE (RCBZ02S);;                                             01940000
 DCL 1 DATE_AREA,                              /* DATE AREA          */ 01950000
       %INCLUDE (RCBZ03S);;                                             01960000
 DCL 1 FEAT_AREA,                              /* FEATURE CHECK AREA */ 01970000
       %INCLUDE (RCBZ07S);;                                             01980000
 DCL 1 RUN_DATE_AREA,                          /* RUN DATE AREA      */ 01990000
       %INCLUDE (RCBZ28S);;                    /* PTM 290            */ 02000000
                                                      /* SOC *RC01190*/ 02010000
 DCL 1 RCBZ32S_STRUCTURE,              /* INTERFACE AREA TO RCB023M  */ 02020000
       %INCLUDE (RCBZ32S);;                                             02030000
                                                      /* EOC *RC01190*/ 02040000
0/********************************************************************/ 02050000
 /* IMS CONSTANTS                                                    */ 02060000
 /********************************************************************/ 02070000
0DCL 1 IMS_CONSTANTS,                                                   02080000
       %INCLUDE (RCBZ04S);;                                             02090000
0/********************************************************************/ 02100000
 /*  IMS CHECKPOINT/RESTART/ROLLBACK FIELDS                          */ 02110000
 /********************************************************************/ 02120000
0DCL PTR_CHKP_LEN_IO      PTR;                                          02130000
 DCL PTR_CHKP_LEN_AREA    PTR;                                          02140000
 DCL PTR_CHKP_AREA        PTR;                                          02150000
 DCL PTR_CHKP_ID          PTR;                                          02160000
 DCL PTR_CHKP_XRST        PTR;                                          02170000
0DCL CHKP_CNT_STEPS       FIXED BIN (31);                               02180000
 DCL CHKP_LEN_IO          FIXED BIN (31);                               02190000
 DCL CHKP_LEN_AREA        FIXED BIN (31);                               02200000
0DCL 1 CHKP_ID,                                                         02210000
       %INCLUDE (RCBZ11S);;                                             02220000
0DCL 1 CHKP_XRST,                                                       02230000
       %INCLUDE (RCBZ12S);;                                             02240000
0DCL 1 CHKP_AREA,                                                       02250000
       %INCLUDE (RCBZ14S);,                                             02260000
       2 COUNTRY_AREA,                                                  02270000
       %INCLUDE (RCBZ26S);,                                             02280000
       2 RCB030,                                                        02290000
       %INCLUDE (RCBP30S);,                                             02300000
       2 KEY_VALUES,                                                    02310000
       %INCLUDE (RCBBCASC);;                                            02320000
0/********************************************************************/ 02330000
 /* IMS PCB STRUCTURES                                               */ 02340000
 /********************************************************************/ 02350000
0DCL 1 PCB_IO         BASED (PTR_PCB_IO),                               02360000
       %INCLUDE (RCBZ16S);;                                             02370000
0DCL 1 PCB_RBDGDI0    BASED (PTR_RBDGDI0),                              02380000
       %INCLUDE (RCBZ10S);;                                             02390000
0DCL 1 PCB_RBDGDO0    BASED (PTR_RBDGDO0),                              02400000
       %INCLUDE (RCBZ10S);;                                             02410000
0DCL 1 PCB_RBDGDR0    BASED (PTR_RBDGDR0),                              02420000
       %INCLUDE (RCBZ10S);;                                             02430000
0DCL 1 PCB_RBDGDF0    BASED (PTR_RBDGDF0),                              02440000
       %INCLUDE (RCBZ10S);;                                             02450000
0DCL 1 PCB_RBDGDC0    BASED (PTR_RBDGDC0),                              02460000
       %INCLUDE (RCBZ10S);;                                             02470000
0DCL 1 PCB_RCBBCA0    BASED (PTR_RCBBCA0),                              02480000
       %INCLUDE (RCBZ10S);;                                             02490000
0DCL 1 PCB_RCBBCA1    BASED (PTR_RCBBCA1),                              02500000
       %INCLUDE (RCBZ10S);;                                             02510000
0DCL 1 PCB_RCBBCA2    BASED (PTR_RCBBCA2),                              02520000
       %INCLUDE (RCBZ10S);;                                             02530000
0DCL 1 PCB_RCBBCA3    BASED (PTR_RCBBCA3),                              02540000
       %INCLUDE (RCBZ10S);;                                             02550000
0DCL 1 PCB_RCBBCA4    BASED (PTR_RCBBCA4),                              02560000
       %INCLUDE (RCBZ10S);;                                             02570000
0DCL 1 PCB_RCBBCA5    BASED (PTR_RCBBCA5),                              02580000
       %INCLUDE (RCBZ10S);;                                             02590000
0DCL 1 PCB_RCBBCA6    BASED (PTR_RCBBCA6),                              02600000
       %INCLUDE (RCBZ10S);;                                             02610000
0DCL 1 PCB_RCBBCA7    BASED (PTR_RCBBCA7),                              02620000
       %INCLUDE (RCBZ10S);;                                             02630000
0DCL 1 PCB_RCBBCA8    BASED (PTR_RCBBCA8),                              02640000
       %INCLUDE (RCBZ10S);;                                             02650000
0DCL 1 PCB_RCBBCA9    BASED (PTR_RCBBCA9),                              02660000
       %INCLUDE (RCBZ10S);;                                             02670000
0DCL 1 PCB_RCBBCAA    BASED (PTR_RCBBCAA),                              02680000
       %INCLUDE (RCBZ10S);;                                             02690000
0DCL 1 PCB_RCBBCAB    BASED (PTR_RCBBCAB),                              02700000
       %INCLUDE (RCBZ10S);;                                             02710000
0/********************************************************************/ 02720000
 /* IMS SSA STRUCTURES                                               */ 02730000
 /********************************************************************/ 02740000
0DCL 1 SSA_RRDDI1,                                                      02750000
       3 SEG_NAME        CHAR(08)      INIT('SDDI0   '),                02760000
       3 BRKT_OPEN       CHAR(01)      INIT('(')       ,                02770000
       3 SEG_KEY1        CHAR(08)      INIT('GRKDI   '),                02780000
       3 REL_OP1         CHAR(02)      INIT('>=')      ,                02790000
       3 KEY_VAL1,                                                      02800000
         5 CTRYNO1       CHAR(04)      INIT('    ')    ,                02810000
         5 AASID1        CHAR(02)      INIT('DI')      ,                02820000
         5 CMAXA1        CHAR(04)      INIT('    ')    ,                02830000
         5 RMAXA1        CHAR(07)      INIT('       ') ,                02840000
       3 REL_AND         CHAR(01)      INIT('&')       ,                02850000
       3 SEG_KEY2        CHAR(08)      INIT('GRKDI   '),                02860000
       3 REL_OP2         CHAR(02)      INIT('<=')      ,                02870000
       3 KEY_VAL2,                                                      02880000
         5 CTRYNO2       CHAR(04)      INIT('    ')    ,                02890000
         5 AASID2        CHAR(02)      INIT('DI')      ,                02900000
         5 CMAXA2        CHAR(04)      INIT('    ')    ,                02910000
         5 RMAXA2        CHAR(07)      INIT('       ') ,                02920000
       3 BRKT_CLOSE      CHAR(01)      INIT(')')       ;                02930000
 DCL 1 SSA_RRDDI1_2,                                                    02940000
      2 DIID1    CHAR(19)  INIT('SDDI0   (GRKDI    ='),                 02950000
      2 DI_KEY   CHAR(17)  INIT(''),                                    02960000
      2 DIID3    CHAR(1)   INIT(')') ;                                  02970000
 DCL 1 SSA_RRDDO1,                                                      02980000
       3 SEG_NAME        CHAR(08)      INIT('SDDO0   '),                02990000
       3 BRKT_OPEN       CHAR(01)      INIT('(')       ,                03000000
       3 SEG_KEY1        CHAR(08)      INIT('GRKDO   '),                03010000
       3 REL_OP1         CHAR(02)      INIT('>=')      ,                03020000
       3 KEY_VAL1,                                                      03030000
         5 CTRYNO1       CHAR(04)      INIT('    ')    ,                03040000
         5 AASID1        CHAR(02)      INIT('DO')      ,                03050000
         5 RORXA1        CHAR(06)      INIT('      ')  ,                03060000
       3 REL_AND         CHAR(01)      INIT('&')       ,                03070000
       3 SEG_KEY2        CHAR(08)      INIT('GRKDO   '),                03080000
       3 REL_OP2         CHAR(02)      INIT('< ')      ,                03090000
       3 KEY_VAL2,                                                      03100000
         5 CTRYNO2       CHAR(04)      INIT('    ')    ,                03110000
         5 AASID2        CHAR(02)      INIT('DO')      ,                03120000
         5 RORXA2        CHAR(06)      INIT('FEFEFEFEFEFE'X)  ,         03130000
       3 BRKT_CLOSE      CHAR(01)      INIT(')')       ;                03140000
       /* FOR EACH COUNTRY IN VSDDO0 EXISTS A DUMMY RECORD              03150000
          END_OF_COUNTRY RECORD) WITH AN EOC-MARK (HEX 'FE') */         03160000
 DCL 1 SSA_RRDDO1_2,                                                    03170000
      2 DOID1    CHAR(19)  INIT('SDDO0   (GRKDO    ='),                 03180000
      2 DO_KEY   CHAR(12)  INIT(''),                                    03190000
      2 DOID3    CHAR(1)   INIT(')') ;                                  03200000
 DCL 1 SSA_RRDDR1,                                                      03210000
       3 SEG_NAME        CHAR(08)      INIT('SDDR0   '),                03220000
       3 BRKT_OPEN       CHAR(01)      INIT('(')       ,                03230000
       3 SEG_KEY         CHAR(08)      INIT('GRKDR   '),                03240000
       3 REL_OP          CHAR(02)      INIT(' =')      ,                03250000
       3 KEY_VAL,                                                       03260000
         5 CTRYNO        CHAR(04)      INIT('    ')    ,                03270000
         5 AASID         CHAR(02)      INIT('DR')      ,                03280000
         5 RORXA         CHAR(06)      INIT('      ')  ,                03290000
       3 BRKT_CLOSE      CHAR(01)      INIT(')')       ;                03300000
 DCL 1 SSA_RRDDF1,                                                      03310000
       3 SEG_NAME        CHAR(08)      INIT('SDDF0   '),                03320000
       3 BRKT_OPEN       CHAR(01)      INIT('(')       ,                03330000
       3 SEG_KEY1        CHAR(08)      INIT('GRKDF   '),                03340000
       3 REL_OP1         CHAR(02)      INIT('> ')      ,                03350000
       3 KEY_VAL1,                                                      03360000
         5 CTRYNO1       CHAR(04)      INIT('    ')    ,                03370000
         5 AASID1        CHAR(02)      INIT('DF')      ,                03380000
         5 CMAXA1        CHAR(04)      INIT('    ')    ,                03390000
         5 RMAXA1        CHAR(07)      INIT('       ') ,                03400000
         5 REST1         CHAR(08)      INIT('        '),                03410000
       3 REL_AND         CHAR(01)      INIT('&')       ,                03420000
       3 SEG_KEY2        CHAR(08)      INIT('GRKDF   '),                03430000
       3 REL_OP2         CHAR(02)      INIT('<=')      ,                03440000
       3 KEY_VAL2,                                                      03450000
         5 CTRYNO2       CHAR(04)      INIT('    ')    ,                03460000
         5 AASID2        CHAR(02)      INIT('DF')      ,                03470000
         5 CMAXA2        CHAR(04)      INIT('    ')    ,                03480000
         5 RMAXA2        CHAR(07)      INIT('       ') ,                03490000
         5 REST2         CHAR(08)      INIT('99999999'),                03500000
       3 BRKT_CLOSE      CHAR(01)      INIT(')')       ;                03510000
 DCL 1 SSA_RRDDC1,                                                      03520000
       3 SEG_NAME        CHAR(08)      INIT('SDDC0   '),                03530000
       3 BRKT_OPEN       CHAR(01)      INIT('(')       ,                03540000
       3 SEG_KEY         CHAR(08)      INIT('GRKDC   '),                03550000
       3 REL_OP          CHAR(02)      INIT(' =')      ,                03560000
       3 KEY_VAL,                                                       03570000
         5 CTRYNO        CHAR(04)      INIT('    ')    ,                03580000
         5 AASID         CHAR(02)      INIT('DC')      ,                03590000
         5 RORXA         CHAR(06)      INIT('      ')  ,                03600000
         5 CSTXA         CHAR(01)      INIT(' ')       ,                03610000
       3 BRKT_CLOSE      CHAR(01)      INIT(')')       ;                03620000
1/********************************************************************/ 03630000
 /* DB2 TABLE STRUCTURES                                             */ 03640000
 /********************************************************************/ 03650000
                                       /* START RB01141              */ 03660000
 DCL PTR_RCBV070    PTR;               /* PTR HW_PO                  */ 03670000
 DCL PTR_RCBV070I   PTR;               /* PTR NULL-IND. HW_PO        */ 03680000
 DCL 1 TB_RCBV070,                     /* HW_PO ROW                  */ 03690000
       %INCLUDE (RCB070S);;                                             03700000
 DCL 1 TB_RCBV070_I,                   /* NULL-IND. HW_PO            */ 03710000
       %INCLUDE (RCB070SI);;                                            03720000
                                       /* END   RB01141              */ 03730000
                                       /* SOC   RB01320              */ 03731000
 DCL 1 TB_RCBV125,                     /* REAL AND DUMMY SERIAL MAPP-*/ 03732000
       %INCLUDE (RCB125S);;            /* ING TABLE                  */ 03733000
 DCL 1 TB_RCBV125_I,                   /* NULL-IND.                  */ 03734000
       %INCLUDE (RCB125SI);;           /*                            */ 03735000
                                       /* EOC   RB01320              */ 03736000
                                                                        03740000
 DCL PTR_RCBV500    PTR;               /* PTR PARAMETER ROW          */ 03750000
 DCL PTR_RCBV500I   PTR;               /* PTR NULL-IND. PARAMETER    */ 03760000
 DCL 1 TB_RCBV500,                     /* PARAMETER ROW              */ 03770000
       %INCLUDE (RCB500S);;                                             03780000
 DCL 1 TB_RCBV500_I,                   /* NULL-IND. PARAMETER        */ 03790000
       %INCLUDE (RCB500SI);;                                            03800000
                                                 /* SOC CEDS00000352 */ 03800100
 /* DCL 1 TB_RCBV690,                                 /* SOC RB01281 */ 03801000
 /*    %INCLUDE (RCB690S);;                                             03802000
 /* DCL 1 TB_RCBV690_I,                                                 03803000
 /*     %INCLUDE (RCB690SI);;                         /* EOC RB01281 */ 03804000
 DCL 1 FILE_RCBBCAD,                           /* SORTED UNLOAD FILE */ 03804100
      %INCLUDE (RCBBCAS);;                                              03804200
                                                 /* EOC CEDS00000352 */ 03805000
0/********************************************************************/ 03810000
 /* IMS DB STRUCTURES                                                */ 03820000
 /********************************************************************/ 03830000
0DCL 1 DB_MACH_INV,                                                     03840000
       %INCLUDE (RCBBCAS1);,                                            03850000
       %INCLUDE (RRDDI1);                                               03860000
0DCL 1 DB_MACH_INV_COPY,                                                03870000
       %INCLUDE (RCBBCAS1);,                                            03880000
       %INCLUDE (RRDDI1);                                               03890000
0DCL 1 DB_MACH_ORD,                                                     03900000
       %INCLUDE (RCBBCAS1);,                                            03910000
       %INCLUDE (RRDDO1);                                               03920000
0DCL 1 DB_MACH_ORD_COPY,                                                03930000
       %INCLUDE (RCBBCAS1);,                                            03940000
       %INCLUDE (RRDDO1);                                               03950000
0DCL 1 DB_MACH_REM,                                                     03960000
       %INCLUDE (RCBBCAS1);,                                            03970000
       %INCLUDE (RRDDR1);                                               03980000
0DCL 1 DB_MACH_FEAT,                                                    03990000
       %INCLUDE (RCBBCAS1);,                                            04000000
       %INCLUDE (RRDDF1);                                               04010000
0DCL 1 DB_MACH_CAP,                                                     04020000
       %INCLUDE (RCBBCAS1);,                                            04030000
       %INCLUDE (RRDDC1);                                               04040000
0/********************************************************************/ 04041000
 /*  RECORD STRUCTURES FOR NON-GSAM INPUT FILES                      */ 04042000
 /********************************************************************/ 04043000
0DCL 1 RCBBC2I_REC     CHAR(20);                          /* RC01318 */ 04044000
0/********************************************************************/ 04050000
 /*  RECORD STRUCTURES FOR GSAM OUTPUT FILES                         */ 04060000
 /********************************************************************/ 04070000
0DCL 1 RCBBCA0_REC      CHAR(75);                     /* SOC RB01242 */ 04080000
 DCL 1 RCBBCA1_REC      CHAR(46);                                       04090000
 DCL 1 RCBBCA2_REC      CHAR(105);                                      04100000
 DCL 1 RCBBCA3_REC      CHAR(108);                       /* RB01140 */  04110000
 DCL 1 RCBBCA4_REC      CHAR(136);                                      04120000
                                                      /* SOC RB01298 */ 04121000
 /*DCL 1 RCBBCA5_REC    CHAR(140);  /* RB01281 */ /* PTM 496 *RC01190*/ 04130000
 DCL 1 RCBBCA5_REC      CHAR(145);  /*ADDED SLC2 FOR HB  EOC RB01298 */ 04131000
 DCL 1 RCBBCA6_REC      CHAR(145);                                      04140000
 DCL 1 RCBBCA7_REC      CHAR(214);                        /* RB01140 */ 04150000
 DCL 1 RCBBCA8_REC      CHAR(104);                                      04160000
 DCL 1 RCBBCA9_REC      CHAR(111);                                      04170000
 DCL 1 RCBBCAA_REC      CHAR(113);                                      04180000
 DCL 1 RCBBCAB_REC      CHAR(136);                    /* EOC RB01242 */ 04190000
0DCL 1 RCBBCA0_HEADER   BASED(ADDR(RCBBCA0_REC)),                       04200000
       %INCLUDE (RCBBAASH);;                                            04210000
 DCL 1 RCBBCA1_HEADER   BASED(ADDR(RCBBCA1_REC)),                       04220000
       %INCLUDE (RCBBAASH);;                                            04230000
 DCL 1 RCBBCA2_HEADER   BASED(ADDR(RCBBCA2_REC)),                       04240000
       %INCLUDE (RCBBAASH);;                                            04250000
 DCL 1 RCBBCA3_HEADER   BASED(ADDR(RCBBCA3_REC)),                       04260000
       %INCLUDE (RCBBAASH);;                                            04270000
 DCL 1 RCBBCA4_HEADER   BASED(ADDR(RCBBCA4_REC)),                       04280000
       %INCLUDE (RCBBAASH);;                                            04290000
 DCL 1 RCBBCA5_HEADER   BASED(ADDR(RCBBCA5_REC)),                       04300000
       %INCLUDE (RCBBAASH);;                                            04310000
 DCL 1 RCBBCA6_HEADER   BASED(ADDR(RCBBCA6_REC)),                       04320000
       %INCLUDE (RCBBAASH);;                                            04330000
 DCL 1 RCBBCA7_HEADER   BASED(ADDR(RCBBCA7_REC)),                       04340000
       %INCLUDE (RCBBAASH);;                                            04350000
 DCL 1 RCBBCA8_HEADER   BASED(ADDR(RCBBCA8_REC)),                       04360000
       %INCLUDE (RCBBAASH);;                                            04370000
 DCL 1 RCBBCA9_HEADER   BASED(ADDR(RCBBCA9_REC)),                       04380000
       %INCLUDE (RCBBAASH);;                                            04390000
 DCL 1 RCBBCAA_HEADER   BASED(ADDR(RCBBCAA_REC)),                       04400000
       %INCLUDE (RCBBAASH);;                                            04410000
 DCL 1 RCBBCAB_HEADER   BASED(ADDR(RCBBCAB_REC)),                       04420000
       %INCLUDE (RCBBAASH);;                                            04430000
0DCL 1 RCBBCA0_TRAILER  BASED(ADDR(RCBBCA0_REC)),                       04440000
       %INCLUDE (RCBBAAST);;                                            04450000
 DCL 1 RCBBCA1_TRAILER  BASED(ADDR(RCBBCA1_REC)),                       04460000
       %INCLUDE (RCBBAAST);;                                            04470000
 DCL 1 RCBBCA2_TRAILER  BASED(ADDR(RCBBCA2_REC)),                       04480000
       %INCLUDE (RCBBAAST);;                                            04490000
 DCL 1 RCBBCA3_TRAILER  BASED(ADDR(RCBBCA3_REC)),                       04500000
       %INCLUDE (RCBBAAST);;                                            04510000
 DCL 1 RCBBCA4_TRAILER  BASED(ADDR(RCBBCA4_REC)),                       04520000
       %INCLUDE (RCBBAAST);;                                            04530000
 DCL 1 RCBBCA5_TRAILER  BASED(ADDR(RCBBCA5_REC)),                       04540000
       %INCLUDE (RCBBAAST);;                                            04550000
 DCL 1 RCBBCA6_TRAILER  BASED(ADDR(RCBBCA6_REC)),                       04560000
       %INCLUDE (RCBBAAST);;                                            04570000
 DCL 1 RCBBCA7_TRAILER  BASED(ADDR(RCBBCA7_REC)),                       04580000
       %INCLUDE (RCBBAAST);;                                            04590000
 DCL 1 RCBBCA8_TRAILER  BASED(ADDR(RCBBCA8_REC)),                       04600000
       %INCLUDE (RCBBAAST);;                                            04610000
 DCL 1 RCBBCA9_TRAILER  BASED(ADDR(RCBBCA9_REC)),                       04620000
       %INCLUDE (RCBBAAST);;                                            04630000
 DCL 1 RCBBCAA_TRAILER  BASED(ADDR(RCBBCAA_REC)),                       04640000
       %INCLUDE (RCBBAAST);;                                            04650000
 DCL 1 RCBBCAB_TRAILER  BASED(ADDR(RCBBCAB_REC)),                       04660000
       %INCLUDE (RCBBAAST);;                                            04670000
0DCL 1 RCBBCA0_HW_PRODUCT BASED(ADDR(RCBBCA0_REC)),                     04680000
       %INCLUDE (RCBBAAS1);,                                            04690000
       3 TB_RCBV050,                                                    04700000
         %INCLUDE (RCB050S);,                                           04710000
       3 TB_RCBV050_IND,                                                04720000
         %INCLUDE (RCB050SI);;                                          04730000
0DCL 1 RCBBCA1_MES_ORDER  BASED(ADDR(RCBBCA1_REC)),                     04740000
       %INCLUDE (RCBBAAS1);,                                            04750000
       3 TB_RCBV100,                                                    04760000
         %INCLUDE (RCB100S);,                                           04770000
       3 TB_RCBV100_IND,                                                04780000
         %INCLUDE (RCB100SI);;                                          04790000
0DCL 1 RCBBCA2_HW_STATUS  BASED(ADDR(RCBBCA2_REC)),                     04800000
       %INCLUDE (RCBBAAS1);,                                            04810000
       3 TB_RCBV110,                                                    04820000
         %INCLUDE (RCB110S);,                                           04830000
       3 TB_RCBV110_IND,                                                04840000
         %INCLUDE (RCB110SI);;                                          04850000
0DCL 1 RCBBCA3_OU_HW      BASED(ADDR(RCBBCA3_REC)),                     04860000
       %INCLUDE (RCBBAAS1);,                                            04870000
       3 TB_RCBV170,                                                    04880000
         %INCLUDE (RCB170S);,                                           04890000
       3 TB_RCBV170_IND,                                                04900000
         %INCLUDE (RCB170SI);;                                          04910000
0DCL 1 RCBBCA4_HW_CUST    BASED(ADDR(RCBBCA4_REC)),                     04920000
       %INCLUDE (RCBBAAS1);,                                            04930000
       3 TB_RCBV190,                                                    04940000
         %INCLUDE (RCB190S);,                                           04950000
       3 TB_RCBV190_IND,                                                04960000
         %INCLUDE (RCB190SI);;                                          04970000
0DCL 1 RCBBCA5_SUPPLY     BASED(ADDR(RCBBCA5_REC)),                     04980000
       %INCLUDE (RCBBAAS1);,                                            04990000
       3 TB_RCBV220,                                                    05000000
         %INCLUDE (RCB220S);,                                           05010000
       3 TB_RCBV220_IND,                                                05020000
         %INCLUDE (RCB220SI);;                                          05030000
0DCL 1 RCBBCA6_MES_HW     BASED(ADDR(RCBBCA6_REC)),                     05040000
       %INCLUDE (RCBBAAS1);,                                            05050000
       3 TB_RCBV250,                                                    05060000
         %INCLUDE (RCB250S);,                                           05070000
       3 TB_RCBV250_IND,                                                05080000
         %INCLUDE (RCB250SI);;                                          05090000
0DCL 1 RCBBCA7_HW_PO      BASED(ADDR(RCBBCA7_REC)),                     05100000
       %INCLUDE (RCBBAAS1);,                                            05110000
       3 TB_RCBV260,                                                    05120000
         %INCLUDE (RCB260S);,                                           05130000
       3 TB_RCBV260_IND,                                                05140000
         %INCLUDE (RCB260SI);;                                          05150000
0DCL 1 RCBBCA8_HW_REAL    BASED(ADDR(RCBBCA8_REC)),                     05160000
       %INCLUDE (RCBBAAS1);,                                            05170000
       3 TB_RCBV300,                                                    05180000
         %INCLUDE (RCB300S);,                                           05190000
       3 TB_RCBV300_IND,                                                05200000
         %INCLUDE (RCB300SI);;                                          05210000
0DCL 1 RCBBCA9_FEATURE    BASED(ADDR(RCBBCA9_REC)),                     05220000
       %INCLUDE (RCBBAAS1);,                                            05230000
       3 TB_RCBV310,                                                    05240000
         %INCLUDE (RCB310S);,                                           05250000
       3 TB_RCBV310_IND,                                                05260000
         %INCLUDE (RCB310SI);;                                          05270000
0DCL 1 RCBBCAA_MES_HW_PO  BASED(ADDR(RCBBCAA_REC)),                     05280000
       %INCLUDE (RCBBAAS1);,                                            05290000
       3 TB_RCBV330,                                                    05300000
         %INCLUDE (RCB330S);,                                           05310000
       3 TB_RCBV330_IND,                                                05320000
         %INCLUDE (RCB330SI);;                                          05330000
0DCL 1 RCBBCAB_HW_MOD     BASED(ADDR(RCBBCAB_REC)),                     05340000
       %INCLUDE (RCBBAAS1);,                                            05350000
       3 TB_RCBV380,                                                    05360000
         %INCLUDE (RCB380S);,                                           05370000
       3 TB_RCBV380_IND,                                                05380000
         %INCLUDE (RCB380SI);;                                          05390000
1/********************************************************************/ 05400000
 /*  PROGRAM CONTROL PARAMETERS                                      */ 05410000
 /********************************************************************/ 05420000
0DCL 1 PARM_COUNTRY     BASED(PTR_RCBV500),        /* COUNTRYNUMBER  */ 05430000
       %INCLUDE (RCBP00S);;                                             05440000
0DCL 1 PARM_RECON_DATE  BASED(PTR_RCBV500),        /* RECON DATE     */ 05450000
       %INCLUDE (RCBP01S);;                                             05460000
0DCL 1 PARM_STORE_FEAT  BASED(PTR_RCBV500),        /* STORE FEATURES */ 05470000
       %INCLUDE (RCBP08S);;                                             05480000
0DCL 1 PARM_CHKP        BASED(PTR_RCBV500),        /* CHECKPOINT LIM */ 05490000
       %INCLUDE (RCBP12S);;                                             05500000
0DCL 1 PARM_HASH        BASED(PTR_RCBV500),        /* HASH TOTALS    */ 05510000
       %INCLUDE (RCBP24S);;                                             05520000
0DCL 1 PARM_PROCESSED   BASED(PTR_RCBV500),        /* LAST PROCESSED */ 05530000
       %INCLUDE (RCBP30S);;                                             05540000
                                                   /* SOC RB01281    */ 05540100
0DCL 1 PARM_FX_WARR BASED(PTR_RCBV500),            /* FLEX WARRANTY  */ 05541000
       %INCLUDE (RCBP63S);;                        /*EOC RB01281     */ 05543000
 DCL 1 PARM_FX_WARR_64P BASED(PTR_RCBV500),            /*SOC RB01298 */ 05544000
       %INCLUDE (RCBP64S);;                    /*FOR COUNTRY SPECIFIC*/ 05545000
                                                       /*EOC RB01298 */ 05545100
 /********************************************************************/ 05546000
 /*  COUNTS                                                          */ 05560000
 /********************************************************************/ 05570000
 DCL CNT_PIC9              PIC'(9)9';                                   05580000
 DCL CNT_PIC15             PIC'(15)9';                                  05590000
 DCL REC_COUNT           FIXED BIN(31)   INIT(0);    /* CEDS00000352 */ 05591000
 DCL FEATURE_OVERFLOW_CNT  FIXED BIN(31)   INIT(0);  /* CEDS00000373 */ 05592000
1/********************************************************************/ 05600000
 /*  BIT SWITCHES                                                    */ 05610000
 /********************************************************************/ 05620000
0DCL TRUE                    BIT (1)         INIT ('1'B);               05630000
 DCL FALSE                   BIT (1)         INIT ('0'B);               05640000
 DCL SWITCH_F_TOW            BIT (1)         INIT ('0'B); /* RB01281 */ 05641000
 DCL SWITCH_F_SLC            BIT (1)         INIT ('0'B); /* RB01281 */ 05642000
                                                 /* SOC CEDS00000352 */ 05643000
 DCL SWITCH_EMPTY_T690       BIT(1)          INIT ('0'B);               05644000
 DCL EOF_RCBBCAD             BIT(1)          INIT ('0'B);               05645000
                                                 /* EOC CEDS00000352 */ 05646000
                                                 /* SOC RC01318      */ 05646100
 DCL EOF_RCBBC2I             BIT(1)          INIT ('0'B);               05647000
                                                 /* EOC RC01318      */ 05647400
                                                                        05648000
 DCL (SWITCH_RSTRT,                                                     05650000
      SWITCH_CUF_EXIT_DI,                                               05660000
      SWITCH_CUF_EXIT_DO ) BIT (1);                                     05670000
0/********************************************************************/ 05680000
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 05690000
 /********************************************************************/ 05700000
0DCL WRK_MOD_NAME         CHAR (08) INIT ('ROLBCAM ');                  05710099
 DCL WRK_PGM_NAME         CHAR (08) INIT ('ROLBCAP ');                  05720099
 DCL WRK_SYSTEM_TYPE      CHAR (01) INIT ('I');                         05730000
 DCL WRK_ORIG_ORD_DATE    CHAR (10);                                    05740000
 DCL WRK_CUST_ARR_DATE    CHAR (10);                                    05750000
 DCL WRK_ACT_INST_DATE    CHAR (10);                                    05760000
 DCL WRK_RENT_STOP_DATE   CHAR (10);                                    05770000
 DCL WRK_WAR_EXP_DATE     CHAR (10);                                    05780000
 DCL WRK_ORDER_DATE       CHAR (10);                                    05790000
 DCL WRK_SAVE_WED         CHAR (10);                                    05800000
 DCL WRK_SCHED_REM_DATE   CHAR (10);                                    05810000
 DCL WRK_SCHED_COMPL_DATE CHAR (10);                                    05820000
 DCL WRK_NAME_CODE        CHAR (01);                                    05830000
 DCL WRK_PREV_TYPE        CHAR (04) INIT ('');                          05840000
 DCL WRK_PREV_FEAT        CHAR (06) INIT ('');                          05850000
 DCL WRK_FUNC             CHAR (04);                                    05860000
 DCL WRK_FILE_NAME        CHAR (07);                                    05870000
 DCL WRK_HASH_TOTAL       FIXED DEC(15,0);                              05880000
 DCL WRK_LENGTH_RCB024    FIXED BIN (15);                               05890000
 DCL WRK_RBDGDI0          CHAR (07) INIT ('RBDGDI0');                   05900000
 DCL WRK_RBDGDO0          CHAR (07) INIT ('RBDGDO0');                   05910000
 DCL WRK_RBDGDR0          CHAR (07) INIT ('RBDGDR0');                   05920000
 DCL WRK_RBDGDF0          CHAR (07) INIT ('RBDGDF0');                   05930000
 DCL WRK_RBDGDC0          CHAR (07) INIT ('RBDGDC0');                   05940000
 DCL WRK_RCBBCA0          CHAR (07) INIT ('RCBBCA0');                   05950000
 DCL WRK_RCBBCA1          CHAR (07) INIT ('RCBBCA1');                   05960000
 DCL WRK_RCBBCA2          CHAR (07) INIT ('RCBBCA2');                   05970000
 DCL WRK_RCBBCA3          CHAR (07) INIT ('RCBBCA3');                   05980000
 DCL WRK_RCBBCA4          CHAR (07) INIT ('RCBBCA4');                   05990000
 DCL WRK_RCBBCA5          CHAR (07) INIT ('RCBBCA5');                   06000000
 DCL WRK_RCBBCA6          CHAR (07) INIT ('RCBBCA6');                   06010000
 DCL WRK_RCBBCA7          CHAR (07) INIT ('RCBBCA7');                   06020000
 DCL WRK_RCBBCA8          CHAR (07) INIT ('RCBBCA8');                   06030000
 DCL WRK_RCBBCA9          CHAR (07) INIT ('RCBBCA9');                   06040000
 DCL WRK_RCBBCAA          CHAR (07) INIT ('RCBBCAA');                   06050000
 DCL WRK_RCBBCAB          CHAR (07) INIT ('RCBBCAB');                   06060000
                                                      /* SOC RC01318 */ 06061000
 DCL WRK_VSDDI0           CHAR (06) INIT ('VSDDI0');                    06061100
 DCL WRK_VSDDF0           CHAR (06) INIT ('VSDDF0');                    06061200
 DCL WRK_VSDDO0           CHAR (06) INIT ('VSDDO0');                    06061300
 DCL WRK_VSDDR0           CHAR (06) INIT ('VSDDR0');                    06061400
 DCL WRK_VSDDC0           CHAR (06) INIT ('VSDDC0');                    06061500
                                                                        06061600
 DCL WRK_RCBBC2I          CHAR(20) INIT('') VAR;                        06061700
 DCL WRK_RUNMODE          CHAR(02) INIT('');                            06061800
 DCL WRK_FILENAM          CHAR(02) INIT('');                            06061900
 DCL WRK_VSAMNAM          CHAR(02) INIT('');                            06062000
 DCL WRK_LEN_RCBBC2I      FIXED BIN INIT(0);                            06062100
 DCL WRK_COMMA_POS        FIXED BIN INIT(0);                            06062200
 DCL WRK_COMMA_NEXT_POS   FIXED BIN INIT(0);                            06062300
 DCL WRK_LEN_FILENAM      FIXED BIN INIT(0);                            06062400
 DCL WRK_LEN_VSAMNAM      FIXED BIN INIT(0);                            06062500
                                                      /* EOC RC01318 */ 06063000
                                                      /* SOC RC01329 */ 06070100
 /*DCL WRK_NUMERIC          CHAR(10) INIT('1234567890');*/              06070200
 DCL WRK_ALPHANUMERIC     CHAR(36)                                      06070300
                 INIT('ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890');          06070400
                                                      /* EOC RC01329 */ 06070600
 DCL WRK_T125_FOUND       CHAR(01) INIT('N');               /*RB01320*/ 06071000
 DCL WS_DUMMY_ORIGIN        CHAR(02) INIT(' ');             /*RB01320*/ 06072000
 DCL WS_DUMMY_SEQUENCE_NUM  CHAR(07) INIT(' ');             /*RB01320*/ 06073000
 DCL WRK_HW_REQUEST_CEDS  CHAR(01);                                     06080000
 DCL WRK_HASH_FIELD       CHAR(04);                                     06090000
 DCL WRK_WC_VALUE         CHAR(01);                                     06100000
 DCL WRK_OU_CODE          CHAR(07);                                     06110000
 DCL WRK_OU_CODE_EXIT     CHAR(07);                                     06120000
 DCL WRK_WRITE_N_REC      FIXED BIN(15);                  /* RC01190 */ 06130000
 DCL WRK_COUNT            FIXED BIN(15);                  /* RC01190 */ 06140000
 DCL WRK_F_TOW            CHAR(01)  INIT('');             /* RB01281 */ 06140100
 DCL WRK_F_SPLT_DATE      CHAR (10);                      /* RB01281 */ 06140200
 DCL WRK_63_F_TOW         CHAR(01)  INIT('');             /* RB01298 */ 06140300
 DCL 1 WRK_TYPE,                                                        06150000
       %INCLUDE (ROLZ99S);;                      /* PCR 692  */         06160099
 DCL 1 WRK_SOURCE_IND,                                                  06170000
       %INCLUDE (RCBZ29S);;                                             06180000
 DCL I,J,K               FIXED BIN(31)   INIT(0);/* SOC CEDS00000352 */ 06181000
 DCL 1 T690_ARRAY(REC_COUNT) CTL,                                       06182000
        2 A_COUNTRY    CHAR(3),                                         06183000
        2 A_TYPE       CHAR(4),                                         06184000
        2 A_MODEL      CHAR(3),                                         06185000
        2 A_B_W_MNTHS  DEC FIXED(3,0),                                  06186000
        2 A_SLC_NULLIND CHAR(1),                     /* CEDS00000377 */ 06186100
        2 A_SLC        CHAR(3),                                         06187000
        2 A_EFF_DATE   CHAR(10),                                        06188000
        2 A_END_DATE   CHAR(10),                                        06189000
        2 A_SLC2_NULLIND CHAR(1),                     /* SOC RB01298 */ 06189100
        2 A_SLC2         CHAR(3),             /* SLC FOR HB MACHINES */ 06189200
        2 A_RULE         CHAR(2);     /*TO IDENTIFY HB OR FW MACHINES*/ 06189300
                                                      /* EOC RB01298 */ 06189400
                                                      /* SOC RC01323 */ 06189500
 DCL 1 TB_T400RSS(*) CTL                 /* TABLE FOR FILTERING     */  06189600
     , 3 PRODMOD              CHAR(7);   /* RSS PRODUCTS            */  06189700
 DCL COUNT_RSS_TYPE_MODEL        FIXED BIN (31) INIT(0);                06189800
 DCL COUNT_SKIP_NON_RSS_DI       FIXED BIN (31) INIT(0);                06189900
 DCL COUNT_SKIP_NON_RSS_DO       FIXED BIN (31) INIT(0);                06190000
 DCL TOTAL_COUNT_SKIP_NON_RSS_DI FIXED BIN (31) INIT(0);                06190100
 DCL TOTAL_COUNT_SKIP_NON_RSS_DO FIXED BIN (31) INIT(0);                06190200
 DCL SWITCH_END_OF_CURS_RCBV400  BIT(1)         INIT('0'B);             06190300
 DCL SWITCH_NO_RSS_PROD          BIT(1)         INIT('0'B);             06190400
 DCL TYPE_TAB                    CHAR (4)       INIT('');               06190500
 DCL MODEL                       CHAR (3)       INIT('');               06190600
                                                                        06190700
                                                      /* EOC RC01323 */ 06190900
 /********************************************************************/ 06191000
 /* ON ENDFILE                                                       */ 06191100
 /********************************************************************/ 06191200
 ON ENDFILE (RCBBCAD)                                                   06191300
   BEGIN;                                                               06191400
     EOF_RCBBCAD = TRUE;                                                06191500
   END;                                          /* EOC CEDS00000352 */ 06191600
                                                 /* SOC RC01318 */      06191700
 ON ENDFILE (RCBBC2I)                                                   06191800
   BEGIN;                                                               06191900
     EOF_RCBBC2I = TRUE;                                                06192000
   END;                                          /* EOC RC01318 */      06192100
1/********************************************************************/ 06193000
 /*  BUILTIN FUNCTIONS                                               */ 06200000
 /********************************************************************/ 06210000
0DCL (ADDR,                                                             06220000
      NULL,                                                             06230000
      CSTG,                                                             06240000
      STG,                                                              06250000
      DIM,                                                              06260000
      DATE,                                                             06270000
      TIME,                                                             06280000
      HIGH,                                                             06290000
      LOW,                                                              06300000
      LENGTH,                                                           06310000
      VERIFY,                                                           06320000
      STRING,                                                           06330000
      SUBSTR)           BUILTIN;                                        06340000
1/********************************************************************/ 06350000
 /* DB2/SQL SQLCA                                                    */ 06360000
 /********************************************************************/ 06370000
0 EXEC SQL                                                              06380000
    INCLUDE SQLCA                                                       06390000
    ;                                                                   06400000
1/********************************************************************/ 06410000
 /* ON ERROR CONDITIONS                                              */ 06420000
 /********************************************************************/ 06430000
0%INCLUDE (RCB0E0M);                                                    06440000
   END;                                                                 06450000
1/********************************************************************/ 06460000
 /*                 S T A R T   P R O C E S S I N G                  */ 06470000
 /********************************************************************/ 06480000
0CALL ROLBCAM_R090_INIT_PROGRAM;                                        06490099
                                                                        06500000
 CALL ROLBCAM_R080_INIT_COUNTRY;                                        06510099
                                                                        06520000
 DO WHILE (¬CHKP_AREA.SWITCH_END_COUNTRIES);                            06530000
                                                                        06540000
   IF CHKP_AREA.AASID = 'DI'                                            06550000
   THEN                                                                 06560000
     DO;                                                                06570000
       CALL ROLBCAM_R070_INIT_DI;                                       06580099
       CALL ROLBCAM_R072_PROCESS_DI;                                    06590099
     END;                                                               06600000
                                                                        06610000
   CALL ROLBCAM_R071_INIT_DO;                                           06620099
   CALL ROLBCAM_R073_PROCESS_DO;                                        06630099
                                                                        06640000
   CALL ROLBCAM_R089_TERM_COUNTRY;                                      06650099
                                                                        06660000
   CALL ROLBCAM_R080_INIT_COUNTRY;                                      06670099
                                                                        06680000
 END;                                                                   06690000
                                                                        06700000
 CALL ROLBCAM_R099_TERM_PROGRAM;                                        06710099
                                                                        06720000
1/********************************************************************/ 06730000
 /*                                                                  */ 06740000
 /* MODULE NAME      : READ_REMOVAL                                  */ 06750000
 /*                                                                  */ 06760000
 /* DESCRIPTION      : READ REMOVAL FROM DB RBDGDR0 (VSDDR0)         */ 06770000
 /*                                                                  */ 06780000
 /********************************************************************/ 06790000
0ROLBCAM_R030_READ_REMOVAL: PROC;                                       06800099
                                                                        06810000
 CALL PLITDLI(FOUR,GU,PTR_RBDGDR0,DB_MACH_REM,SSA_RRDDR1);              06820000
 SELECT (PCB_RBDGDR0.ST_CODE);                                          06830000
 WHEN ('  ')                                                            06840000
   CHKP_AREA.CNT_CTRY.READ_DR = CHKP_AREA.CNT_CTRY.READ_DR + 1;         06850000
 OTHERWISE                                                              06860000
   CALL ROLBCAM_ERROR(PTR_RBDGDR0,'IMS_DB','#001');                     06870099
 END;                                                                   06880000
                                                                        06890000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   06900000
                                                                        06910000
 /* CHECK/CONVERT CURRENT SCHEDULE DATE TO SCHEDULED REMOVAL       */   06920000
 CALL RCB000M(DB_MACH_REM.DVLXB,                  /* MODULO CHECK  */   06930000
              DB_MACH_REM.DVKXA,                                        06940000
              DB_MACH_REM.DVLXB,                                        06950000
              PTR_INT_AREA);                                            06960000
                                                                        06970000
 CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_REM.DVLXB,                        06980099
                         WRK_SCHED_REM_DATE,                            06990000
                         WRK_RBDGDR0,                                   07000000
                         'DVLXB',                                       07010000
                         DB_MACH_REM.GCYAA||'/'||DB_MACH_REM.RORXA);    07020000
                                                                        07030000
 END ROLBCAM_R030_READ_REMOVAL;                                         07040099
1/********************************************************************/ 07050000
 /*                                                                  */ 07060000
 /* MODULE NAME      : READ_FEATURE                                  */ 07070000
 /*                                                                  */ 07080000
 /* DESCRIPTION      : READ FEATURE FROM DB RBDGDF0 (VSDDF0)         */ 07090000
 /*                                                                  */ 07100000
 /********************************************************************/ 07110000
0ROLBCAM_R031_READ_FEATURE: PROC;                                       07120099
                                                                        07130000
 CALL PLITDLI(FOUR,WRK_FUNC,PTR_RBDGDF0,DB_MACH_FEAT,SSA_RRDDF1);       07140000
 SELECT (PCB_RBDGDF0.ST_CODE);                                          07150000
 WHEN ('  ')                                                            07160000
   CHKP_AREA.CNT_CTRY.READ_DF = CHKP_AREA.CNT_CTRY.READ_DF + 1;         07170000
 WHEN ('GE','GB')                                                       07180000
   CHKP_AREA.SWITCH_END_DF = TRUE;                                      07190000
 OTHERWISE                                                              07200000
   CALL ROLBCAM_ERROR(PTR_RBDGDF0,'IMS_DB','#002');                     07210099
 END;                                                                   07220000
                                                                        07230000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   07240000
                                                                        07250000
 END ROLBCAM_R031_READ_FEATURE;                                         07260099
1/********************************************************************/ 07270000
 /*                                                                  */ 07280000
 /* MODULE NAME      : SKIP_FEATURE                                  */ 07290000
 /*                                                                  */ 07300000
 /* DESCRIPTION      : SKIP FEATURE FROM DB RBDGDF0 (VSDDF0)         */ 07310000
 /*                                                                  */ 07320000
 /********************************************************************/ 07330000
0ROLBCAM_R032_SKIP_FEATURE: PROC;                                       07340099
                                                                        07350000
 CHKP_AREA.CNT_CTRY.FEATURES    = 0;                                    07360000
 FEATURE_OVERFLOW_CNT = 0;                           /* CEDS00000373 */ 07361000
 WRK_PREV_FEAT   = STRING(DB_MACH_FEAT.YFTXA);                          07370000
 DO WHILE ((WRK_PREV_FEAT = STRING(DB_MACH_FEAT.YFTXA) |                07380000
           (SUBSTR(WRK_PREV_FEAT,6,1) = ' ' &                           07390000
            SUBSTR(WRK_PREV_FEAT,1,4) = DB_MACH_FEAT.CFTXA)) &          07400000
           ¬CHKP_AREA.SWITCH_END_DF);                                   07410000
                                                                        07420000
   IF DB_MACH_FEAT.CFTAB ¬= 'C'            /* FEATURE NOT CRIPPLED */   07430000
   THEN                                                                 07430100
     DO;                                         /* SOC CEDS00000373 */ 07431000
       IF CHKP_AREA.CNT_CTRY.FEATURES < 999                             07432000
       THEN                                      /* EOC CEDS00000373 */ 07433000
         CHKP_AREA.CNT_CTRY.FEATURES = CHKP_AREA.CNT_CTRY.FEATURES + 1; 07450000
       ELSE                                      /* SOC CEDS00000373 */ 07451000
         FEATURE_OVERFLOW_CNT = FEATURE_OVERFLOW_CNT + 1;               07452000
     END;                                        /* EOC CEDS00000373 */ 07453000
   ELSE                                                                 07460000
     CHKP_AREA.CNT_CTRY.SKIP_DF = CHKP_AREA.CNT_CTRY.SKIP_DF + 1;       07470000
                                                                        07480000
   CALL ROLBCAM_R031_READ_FEATURE;                                      07490099
 END;                                                                   07500000
                                                                        07510000
 END ROLBCAM_R032_SKIP_FEATURE;                                         07520099
1/********************************************************************/ 07530000
 /*                                                                  */ 07540000
 /* MODULE NAME      : WRITE_FEAT                                    */ 07550000
 /*                                                                  */ 07560000
 /* DESCRIPTION      : WRITE FEATURE DATA RECORD RCBBCA9             */ 07570000
 /*                                                                  */ 07580000
 /********************************************************************/ 07590000
0ROLBCAM_R033_WRITE_FEAT: PROC;                                         07600099
                                                                        07610000
 RCBBCA9_REC                        = '';                               07620000
 RCBBCA9_FEATURE.INDNULL(*)         = 0;                                07630000
 RCBBCA9_FEATURE.REC_TYPE           = '02';                             07640000
 RCBBCA9_FEATURE.CTRYNO             = CHKP_AREA.COUNTRY;                07650000
 RCBBCA9_FEATURE.PGR_TYPE           = CHKP_AREA.PGR_RUN_TYPE;           07660000
 RCBBCA9_FEATURE.RUN_DATE           = CHKP_AREA.CURR_DATE;              07670000
                                                                        07680000
 RCBBCA9_FEATURE.PRODUCT_TYPE       = DB_MACH_INV.CMAXA;                07690000
                                                        /*SOC RB01320 */07691000
 IF WRK_T125_FOUND = 'Y'                                                07692000
 THEN                                                                   07693000
 DO;                                                                    07694000
 RCBBCA9_FEATURE.ORIGIN          =                                      07695000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     07696000
 RCBBCA9_FEATURE.SEQUENCE_NUMBER =                                      07697000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    07698000
 END;                                                                   07699000
 ELSE                                                                   07699100
 DO;                                                     /*EOC RB01320*/07699200
 RCBBCA9_FEATURE.ORIGIN             = SUBSTR(DB_MACH_INV.RMAXA,1,2);    07700000
 RCBBCA9_FEATURE.SEQUENCE_NUMBER    = '00'||                            07710000
                                      SUBSTR(DB_MACH_INV.RMAXA,3,5);    07720000
 END;                                                        /*RB01320*/07721000
 RCBBCA9_FEATURE.FEATURE_RPQ_CODE   = RCB008M(WRK_PREV_FEAT,            07730000
                                              PTR_INT_AREA);            07740000
 RCBBCA9_FEATURE.COUNTRY_NUMBER     = CHKP_AREA.COUNTRY;                07750000
 RCBBCA9_FEATURE.QUANTITY_FEATURE   = CHKP_AREA.CNT_CTRY.FEATURES;      07760000
 RCBBCA9_FEATURE.EFFECTIVE_DATE     = ' ';                              07770000
 RCBBCA9_FEATURE.END_DATE           = ' ';                              07780000
                                                                        07790000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA9,RCBBCA9_REC);                      07800000
 IF PCB_RCBBCA9.ST_CODE ¬= '  '                                         07810000
 THEN                                                                   07820000
   CALL ROLBCAM_ERROR(PTR_RCBBCA9,'IMS_DB','#003');                     07830099
                                                                        07840000
 CHKP_AREA.CNT_CTRY.RCBBCA9 = CHKP_AREA.CNT_CTRY.RCBBCA9 + 1;           07850000
                                                                        07860000
 WRK_HASH_FIELD = SUBSTR(RCBBCA9_FEATURE.SEQUENCE_NUMBER,3,4);          07870000
                                                                        07880000
 CALL RCB018M(WRK_HASH_FIELD,                                           07890000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA9,                         07900000
              PTR_INT_AREA);                                            07910000
                                                                        07920000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   07930000
                                                                        07940000
 END ROLBCAM_R033_WRITE_FEAT;                                           07950099
1/********************************************************************/ 07960000
 /*                                                                  */ 07970000
 /* MODULE NAME      : READ_CAPACITY                                 */ 07980000
 /*                                                                  */ 07990000
 /* DESCRIPTION      : READ CAPACITY FROM DB RBDGDC0 (VSDDC0)        */ 08000000
 /*                                                                  */ 08010000
 /********************************************************************/ 08020000
0ROLBCAM_R034_READ_CAPACITY: PROC;                                      08030099
                                                                        08040000
   CALL PLITDLI(FOUR,GU,PTR_RBDGDC0,DB_MACH_CAP,SSA_RRDDC1);            08050000
   SELECT (PCB_RBDGDC0.ST_CODE);                                        08060000
   WHEN ('  ')                                                          08070000
     CHKP_AREA.CNT_CTRY.READ_DC = CHKP_AREA.CNT_CTRY.READ_DC + 1;       08080000
   WHEN ('GB','GE')                                                     08090000
     CHKP_AREA.SWITCH_END_DC = TRUE;                                    08100000
   OTHERWISE                                                            08110000
     CALL ROLBCAM_ERROR(PTR_RBDGDC0,'IMS_DB','#004');                   08120099
   END;                                                                 08130000
                                                                        08140000
   CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                 08150000
                                                                        08160000
   IF ¬CHKP_AREA.SWITCH_END_DC                                          08170000
   THEN                                                                 08180000
     DO;                                                                08190000
       /* CHECK/CONVERT CURRENT SCHEDULE DATE TO SCHEDULED COMPLETION*/ 08200000
       CALL RCB000M(DB_MACH_CAP.DVLXB,              /* MODULO CHECK  */ 08210000
                    DB_MACH_CAP.DVKXA,                                  08220000
                    DB_MACH_CAP.DVLXB,                                  08230000
                    PTR_INT_AREA);                                      08240000
                                                                        08250000
       WRK_SCHED_COMPL_DATE = ' ';                                      08260000
       CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_CAP.DVLXB,                  08270099
                               WRK_SCHED_COMPL_DATE,                    08280000
                               WRK_RBDGDC0,                             08290000
                               'DVLXB',                                 08300000
                               DB_MACH_CAP.GCYAA                        08310000
                               ||'/'||DB_MACH_CAP.RORXA                 08320000
                               ||'/'||DB_MACH_CAP.CSTXA);               08330000
                                                                        08340000
       /* CHECK ORDER DATE */                                           08350000
       WRK_ORDER_DATE = ' ';                                            08360000
       CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_CAP.DVCXH,                  08370099
                               WRK_ORDER_DATE,                          08380000
                               WRK_RBDGDC0,                             08390000
                               'DVCXH',                                 08400000
                               DB_MACH_CAP.GCYAA                        08410000
                               ||'/'||DB_MACH_CAP.RORXA                 08420000
                               ||'/'||DB_MACH_CAP.CSTXA);               08430000
                                                                        08440000
       /* CHECK CUSTOMER REQUESTED ARRIVAL DATE */                      08450000
       WRK_CUST_ARR_DATE = ' ';                                         08460000
       CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_CAP.DVKXA,                  08470099
                               WRK_CUST_ARR_DATE,                       08480000
                               WRK_RBDGDC0,                             08490000
                               'DVKXA',                                 08500000
                               DB_MACH_CAP.GCYAA                        08510000
                               ||'/'||DB_MACH_CAP.RORXA                 08520000
                               ||'/'||DB_MACH_CAP.CSTXA);               08530000
     END;                                                               08540000
                                                                        08550000
 END ROLBCAM_R034_READ_CAPACITY;                                        08560099
1/********************************************************************/ 08570000
 /*                                                                  */ 08580000
 /* MODULE NAME      : WRITE_MES                                     */ 08590000
 /*                                                                  */ 08600000
 /* DESCRIPTION      : WRITE MES ORDER RECORD RCBBCA1                */ 08610000
 /*                                                                  */ 08620000
 /********************************************************************/ 08630000
0ROLBCAM_R035_WRITE_MES: PROC;                                          08640099
                                                                        08650000
 RCBBCA1_REC                          = '';                             08660000
 RCBBCA1_MES_ORDER.INDNULL(*)         = 0;                              08670000
 RCBBCA1_MES_ORDER.REC_TYPE           = '02';                           08680000
 RCBBCA1_MES_ORDER.CTRYNO             = CHKP_AREA.COUNTRY;              08690000
 RCBBCA1_MES_ORDER.PGR_TYPE           = CHKP_AREA.PGR_RUN_TYPE;         08700000
 RCBBCA1_MES_ORDER.RUN_DATE           = CHKP_AREA.CURR_DATE;            08710000
                                                                        08720000
 RCBBCA1_MES_ORDER.MES_ORDER_NUMBER   = DB_MACH_CAP.RORXA;              08730000
 RCBBCA1_MES_ORDER.COUNTRY_NUMBER     = CHKP_AREA.COUNTRY;              08740000
                                                                        08750000
 /* CONVERT NAME CODE */                                                08760000
 WRK_NAME_CODE               = RCB002M(DB_MACH_CAP.CSTXA,               08770000
                                       PTR_INT_AREA);                   08780000
 RCBBCA1_MES_ORDER.NAME_CODE = WRK_NAME_CODE;                           08790000
                                                                        08800000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA1,RCBBCA1_REC);                      08810000
 IF PCB_RCBBCA1.ST_CODE ¬= '  '                                         08820000
 THEN                                                                   08830000
   CALL ROLBCAM_ERROR(PTR_RCBBCA1,'IMS_DB','#005');                     08840099
                                                                        08850000
 CHKP_AREA.CNT_CTRY.RCBBCA1 = CHKP_AREA.CNT_CTRY.RCBBCA1 + 1;           08860000
                                                                        08870000
 WRK_HASH_FIELD = SUBSTR(RCBBCA1_MES_ORDER.MES_ORDER_NUMBER,1,4);       08880000
                                                                        08890000
 CALL RCB018M(WRK_HASH_FIELD,                                           08900000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA1,                         08910000
              PTR_INT_AREA);                                            08920000
                                                                        08930000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   08940000
                                                                        08950000
 END ROLBCAM_R035_WRITE_MES;                                            08960099
1/********************************************************************/ 08970000
 /*                                                                  */ 08980000
 /* MODULE NAME      : WRITE_MES_PO                                  */ 08990000
 /*                                                                  */ 09000000
 /* DESCRIPTION      : WRITE MES/PO DATA RECORD RCBBCAA              */ 09010000
 /*                                                                  */ 09020000
 /********************************************************************/ 09030000
0ROLBCAM_R036_WRITE_MES_PO: PROC;                                       09040099
                                                                        09050000
 RCBBCAA_REC                          = '';                             09060000
 RCBBCAA_MES_HW_PO.INDNULL(*)         = 0;                              09070000
 RCBBCAA_MES_HW_PO.REC_TYPE           = '02';                           09080000
 RCBBCAA_MES_HW_PO.CTRYNO             = CHKP_AREA.COUNTRY;              09090000
 RCBBCAA_MES_HW_PO.PGR_TYPE           = CHKP_AREA.PGR_RUN_TYPE;         09100000
 RCBBCAA_MES_HW_PO.RUN_DATE           = CHKP_AREA.CURR_DATE;            09110000
                                                                        09120000
 RCBBCAA_MES_HW_PO.MES_ORDER_NUMBER   = DB_MACH_CAP.RORXA;              09130000
 RCBBCAA_MES_HW_PO.NAME_CODE          = WRK_NAME_CODE;                  09140000
 RCBBCAA_MES_HW_PO.ORDER_REF_NUMBER   = DB_MACH_ORD.RORXA;              09150000
 RCBBCAA_MES_HW_PO.FUTURE_TYPE        = DB_MACH_CAP.CMAXM;              09160000
 RCBBCAA_MES_HW_PO.FUTURE_MODEL       = DB_MACH_CAP.CMMXC;              09170000
 RCBBCAA_MES_HW_PO.COUNTRY_NUMBER     = CHKP_AREA.COUNTRY;              09180000
 RCBBCAA_MES_HW_PO.CUST_REQ_ARRIVDATE = WRK_CUST_ARR_DATE;              09190000
 RCBBCAA_MES_HW_PO.SCHED_COMPL_DATE   = WRK_SCHED_COMPL_DATE;           09200000
 RCBBCAA_MES_HW_PO.ORDER_DATE         = WRK_ORDER_DATE;                 09210000
 RCBBCAA_MES_HW_PO.END_DATE           = ' ';                            09220000
                                              /***********************/ 09230000
                                              /*  NULL INDICATORS    */ 09240000
                                              /***********************/ 09250000
 IF RCBBCAA_MES_HW_PO.FUTURE_TYPE     = ''                              09260000
 THEN                                                                   09270000
   RCBBCAA_MES_HW_PO.INDNULL(4)       = -1;                             09280000
                                                                        09290000
 IF RCBBCAA_MES_HW_PO.FUTURE_MODEL       = ''                           09300000
 THEN                                                                   09310000
   RCBBCAA_MES_HW_PO.INDNULL(5)       = -1;                             09320000
                                                                        09330000
 IF RCBBCAA_MES_HW_PO.CUST_REQ_ARRIVDATE = ''                           09340000
 THEN                                                                   09350000
   RCBBCAA_MES_HW_PO.INDNULL(7)       = -1;                             09360000
                                                                        09370000
 IF RCBBCAA_MES_HW_PO.SCHED_COMPL_DATE   = ''                           09380000
 THEN                                                                   09390000
   RCBBCAA_MES_HW_PO.INDNULL(8)       = -1;       /* PTM 536 */         09400000
                                                                        09410000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCAA,RCBBCAA_REC);                      09420000
 IF PCB_RCBBCAA.ST_CODE ¬= '  '                                         09430000
 THEN                                                                   09440000
   CALL ROLBCAM_ERROR(PTR_RCBBCAA,'IMS_DB','#006');                     09450099
                                                                        09460000
 CHKP_AREA.CNT_CTRY.RCBBCAA = CHKP_AREA.CNT_CTRY.RCBBCAA + 1;           09470000
                                                                        09480000
 WRK_HASH_FIELD = SUBSTR(RCBBCAA_MES_HW_PO.MES_ORDER_NUMBER,1,4);       09490000
                                                                        09500000
 CALL RCB018M(WRK_HASH_FIELD,                                           09510000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCAA,                         09520000
              PTR_INT_AREA);                                            09530000
                                                                        09540000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   09550000
                                                                        09560000
 END ROLBCAM_R036_WRITE_MES_PO;                                         09570099
1/********************************************************************/ 09580000
 /*                                                                  */ 09590000
 /* MODULE NAME      : WRITE_MES_HW                                  */ 09600000
 /*                                                                  */ 09610000
 /* DESCRIPTION      : WRITE MES/HW DATA RECORD RCBBCA6              */ 09620000
 /*                                                                  */ 09630000
 /********************************************************************/ 09640000
0ROLBCAM_R037_WRITE_MES_HW: PROC;                                       09650099
                                                                        09660000
 RCBBCA6_REC                       = '';                                09670000
 RCBBCA6_MES_HW.INDNULL(*)         = 0;                                 09680000
 RCBBCA6_MES_HW.REC_TYPE           = '02';                              09690000
 RCBBCA6_MES_HW.CTRYNO             = CHKP_AREA.COUNTRY;                 09700000
 RCBBCA6_MES_HW.PGR_TYPE           = CHKP_AREA.PGR_RUN_TYPE;            09710000
 RCBBCA6_MES_HW.RUN_DATE           = CHKP_AREA.CURR_DATE;               09720000
                                                                        09730000
 RCBBCA6_MES_HW.MES_ORDER_NUMBER   = DB_MACH_CAP.RORXA;                 09740000
 RCBBCA6_MES_HW.NAME_CODE          = WRK_NAME_CODE;                     09750000
 RCBBCA6_MES_HW.PRODUCT_TYPE       = DB_MACH_INV.CMAXA;                 09760000
                                                        /*SOC RB01320 */09761000
 IF WRK_T125_FOUND = 'Y'                                                09762000
 THEN                                                                   09763000
 DO;                                                                    09764000
 RCBBCA6_MES_HW.ORIGIN           =                                      09765000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     09766000
 RCBBCA6_MES_HW.SEQUENCE_NUMBER  =                                      09767000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    09768000
 END;                                                                   09769000
 ELSE                                                                   09769100
 DO;                                                     /*EOC RB01320*/09769200
 RCBBCA6_MES_HW.ORIGIN             = SUBSTR(DB_MACH_INV.RMAXA,1,2);     09770000
 RCBBCA6_MES_HW.SEQUENCE_NUMBER    = '00'||                             09780000
                                    SUBSTR(DB_MACH_INV.RMAXA,3,5);      09790000
 END;                                                        /*RB01320*/09791000
 RCBBCA6_MES_HW.COUNTRY_NUMBER     = CHKP_AREA.COUNTRY;                 09800000
 RCBBCA6_MES_HW.FUTURE_TYPE        = DB_MACH_CAP.CMAXM;                 09810000
 RCBBCA6_MES_HW.FUTURE_MODEL       = DB_MACH_CAP.CMMXC;                 09820000
 RCBBCA6_MES_HW.CUST_REQ_ARRIVDATE = WRK_CUST_ARR_DATE;                 09830000
 RCBBCA6_MES_HW.SCHED_COMPL_DATE   = WRK_SCHED_COMPL_DATE;              09840000
 RCBBCA6_MES_HW.ORDER_DATE         = WRK_ORDER_DATE;                    09850000
 RCBBCA6_MES_HW.END_DATE           = ' ';                               09860000
                                              /***********************/ 09870000
                                              /*  NULL INDICATORS    */ 09880000
                                              /***********************/ 09890000
 IF RCBBCA6_MES_HW.FUTURE_TYPE        = ''                              09900000
 THEN                                                                   09910000
   RCBBCA6_MES_HW.INDNULL(7)          = -1;                             09920000
                                                                        09930000
 IF RCBBCA6_MES_HW.FUTURE_MODEL       = ''                              09940000
 THEN                                                                   09950000
   RCBBCA6_MES_HW.INDNULL(8)          = -1;                             09960000
                                                                        09970000
 IF RCBBCA6_MES_HW.CUST_REQ_ARRIVDATE = ''                              09980000
 THEN                                                                   09990000
   RCBBCA6_MES_HW.INDNULL(9)          = -1;                             10000000
                                                                        10010000
 IF RCBBCA6_MES_HW.SCHED_COMPL_DATE   = ''                              10020000
 THEN                                                                   10030000
   RCBBCA6_MES_HW.INDNULL(10)         = -1;                             10040000
                                                                        10050000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA6,RCBBCA6_REC);                      10060000
 IF PCB_RCBBCA6.ST_CODE ¬= '  '                                         10070000
 THEN                                                                   10080000
   CALL ROLBCAM_ERROR(PTR_RCBBCA6,'IMS_DB','#007');                     10090099
                                                                        10100000
 CHKP_AREA.CNT_CTRY.RCBBCA6 = CHKP_AREA.CNT_CTRY.RCBBCA6 + 1;           10110000
                                                                        10120000
 WRK_HASH_FIELD = SUBSTR(RCBBCA6_MES_HW.MES_ORDER_NUMBER,1,4);          10130000
                                                                        10140000
 CALL RCB018M(WRK_HASH_FIELD,                                           10150000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA6,                         10160000
              PTR_INT_AREA);                                            10170000
                                                                        10180000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   10190000
                                                                        10200000
 END ROLBCAM_R037_WRITE_MES_HW;                                         10210099
1/********************************************************************/ 10220000
 /*                                                                  */ 10230000
 /* MODULE NAME      : PROCESS_REMOVAL_DO                            */ 10240000
 /*                                                                  */ 10250000
 /* DESCRIPTION      : PROCESS REMOVAL RECORD FROM RBDGDR0           */ 10260000
 /*                                                                  */ 10270000
 /********************************************************************/ 10280000
0ROLBCAM_R040_PROCESS_REMOVAL_DO: PROC;                                 10290099
                                                                        10300000
                                              /* READ REMOVAL RECORD */ 10310000
 SSA_RRDDR1.CTRYNO = DB_MACH_ORD.GCYAA;                                 10320000
 SSA_RRDDR1.RORXA  = DB_MACH_ORD.RORXK;                                 10330000
 CALL ROLBCAM_R030_READ_REMOVAL;                                        10340099
 CHKP_AREA.CNT_CTRY.PROC_DR = CHKP_AREA.CNT_CTRY.PROC_DR + 1;           10350000
                                                                        10360000
 END ROLBCAM_R040_PROCESS_REMOVAL_DO;                                   10370099
1/********************************************************************/ 10380000
 /*                                                                  */ 10390000
 /* MODULE NAME      : WRITE_HW_IN_ORD_DO                            */ 10400000
 /*                                                                  */ 10410000
 /* DESCRIPTION      : WRITE HW IN ORDER RECORD RCBBCA4 FROM DO      */ 10420000
 /*                                                                  */ 10430000
 /********************************************************************/ 10440000
0ROLBCAM_R041_WRITE_HW_IN_ORD_DO: PROC;                                 10450099
                                                                        10460000
 DCL WRK_TYPE_OF_WAR    CHAR (01);                                      10470000
 DCL WRK_TYPE_OF_MAINT  CHAR (01);                                      10480000
 DCL 1 WRK_TYPE,                                                        10490000
       %INCLUDE (ROLZ99S);;                       /* PCR 692  */        10500099
                                                                        10510000
 RCBBCA7_REC                       = '';                                10520000
 RCBBCA7_HW_PO.INDNULL(*)          = 0;                                 10530000
 RCBBCA7_HW_PO.REC_TYPE            = '02';                              10540000
 RCBBCA7_HW_PO.CTRYNO              = CHKP_AREA.COUNTRY;                 10550000
 RCBBCA7_HW_PO.PGR_TYPE            = CHKP_AREA.PGR_RUN_TYPE;            10560000
 RCBBCA7_HW_PO.RUN_DATE            = CHKP_AREA.CURR_DATE;               10570000
                                                                        10580000
 RCBBCA7_HW_PO.ORDER_REF_NUMBER    = DB_MACH_ORD.RORXA;                 10590000
 RCBBCA7_HW_PO.PRODUCT_TYPE        = DB_MACH_ORD.CMAXA;                 10600000
 RCBBCA7_HW_PO.MODEL_NUMBER        = DB_MACH_ORD.CMMXA;                 10610000
                                                      /* SOC RC01329 */ 10611000
 /*IF VERIFY(SUBSTR(DB_MACH_ORD.RMAXA,1,2),WRK_NUMERIC) = 0 */          10612000
0IF VERIFY(DB_MACH_ORD.RMAXA,WRK_ALPHANUMERIC) = 0                      10620000
                                                      /* EOC RC01329 */ 10621000
 THEN                                                                   10630000
   DO;                                                                  10640000
                                                        /*SOC RB01320 */10641000
     IF WRK_T125_FOUND = 'Y'                                            10642000
     THEN                                                               10643000
     DO;                                                                10644000
     RCBBCA7_HW_PO.ORIGIN            =                                  10645000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     10646000
     RCBBCA7_HW_PO.SEQUENCE_NUMBER   =                                  10647000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    10648000
     END;                                                               10649000
     ELSE                                                               10649100
     DO;                                                 /*EOC RB01320*/10649200
     RCBBCA7_HW_PO.ORIGIN          = SUBSTR(DB_MACH_ORD.RMAXA,1,2);     10650000
     RCBBCA7_HW_PO.SEQUENCE_NUMBER = '00'||                             10660000
                                     SUBSTR(DB_MACH_ORD.RMAXA,3,5);     10670000
     END;                                                  /*RB01320*/  10671000
   END;                                                                 10680000
 RCBBCA7_HW_PO.CUSTOMER_USER    = '00'||DB_MACH_ORD.RCUAC;              10690000
 IF DB_MACH_ORD.RCUXA ¬= ' '                                            10700000
 THEN                                                                   10710000
   RCBBCA7_HW_PO.CUSTOMER_OWNER = '00'||DB_MACH_ORD.RCUXA;              10720000
 ELSE                                                                   10730000
   RCBBCA7_HW_PO.CUSTOMER_OWNER = ' ';                                  10740000
 RCBBCA7_HW_PO.CUST_REQ_ARRIVDATE  = WRK_CUST_ARR_DATE;                 10750000
 RCBBCA7_HW_PO.DP_SYSTEM_NUMBER    = DB_MACH_ORD.RSYXA;                 10760000
 RCBBCA7_HW_PO.MARKET_RESP_CODE    = DB_MACH_ORD.CMKDA;                 10770000
 RCBBCA7_HW_PO.COUNTRY_NUMBER      = SUBSTR(DB_MACH_ORD.GCYAA,2,3);     10780000
 RCBBCA7_HW_PO.OU_CODE             = WRK_OU_CODE;                       10790000
 RCBBCA7_HW_PO.INSTALLING_OU       = STRING(DB_MACH_ORD.RLCXI);         10800000
 RCBBCA7_HW_PO.SELLING_OU          = STRING(DB_MACH_ORD.RLCXS);         10810000
 RCBBCA7_HW_PO.SCHED_COMPL_DATE    = WRK_SCHED_COMPL_DATE;              10820000
 RCBBCA7_HW_PO.SCHED_REMOVAL_DATE  = WRK_SCHED_REM_DATE;                10830000
                                                                        10840000
 /* CHECK/CONVERT TYPE OF MAINTENANCE/TYPE OF WARRANTY */               10850000
                                                                        10860000
 WRK_TYPE_OF_WAR   = DB_MACH_ORD.CMCXB;                                 10870000
 WRK_TYPE_OF_MAINT = DB_MACH_ORD.CMCXA;                                 10880000
                                                                        10890000
                                                   /* SOC OF PTM0987 */ 10900000
                                                                        10910000
 /*    THIS CHANGE IS A REQUIREMENT FOR SPAIN ONLY.                  */ 10920000
 /*    SPAIN USES THE TYPE OF WARRANTY = '0' TO INDICATE A SECOND    */ 10930000
 /*    HAND BOX. THIS CHECK IS DONE SO THAT THE TYPE OF MAINTENANCE  */ 10940000
 /*    IS NOT RESET TO '1', WHICH IN THIS SITUATION WOULD BE         */ 10950000
 /*    INCORRECT. WITH TYPE OF WARRANTY SET TO ' ', THE TYPE OF      */ 10960000
 /*    MAINTENANCE IS PASSED THROUGH CORRECTLY.                      */ 10970000
                                                                        10980000
 IF WRK_TYPE_OF_WAR               = '0' &                               10990000
    SUBSTR(DB_MACH_ORD.GCYAA,2,3) = '838'   /* SPAIN */                 11000000
 THEN                                                                   11010000
   WRK_TYPE_OF_WAR   = ' ' ;                                            11020000
                                                                        11030000
                                                   /* EOC OF PTM0987 */ 11040000
 IF WRK_TYPE_OF_WAR ¬= ' '                                              11050000
 THEN                                                                   11060000
   DO;                                                                  11070000
     IF VERIFY(WRK_TYPE_OF_WAR,WRK_TYPE.TPMNT_WAR) = 0                  11080000
     THEN                                                               11090000
       DO;                                                              11100000
         WRK_TYPE_OF_MAINT   = '';                                      11110000
         RCBBCA7_HW_PO.TYPE_OF_WARRANTY = WRK_TYPE_OF_WAR;/* RC01116 */ 11120000
       END;                                                             11130000
     ELSE                                                               11140000
       DO;                                                              11150000
         IF SUBSTR(DB_MACH_ORD.RCUAC,1,2) = '99'                        11160000
         THEN                                                           11170000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST6;                      11180000
         ELSE                                                           11190000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST3_DEF;                  11200000
       END;                                                             11210000
   END;                                                                 11220000
                                                                        11230000
 IF WRK_TYPE_OF_WAR    = ' ' |                                          11240000
    WRK_TYPE_OF_MAINT ¬= ' '                                            11250000
 THEN                                                                   11260000
   DO;                                                                  11270000
     IF WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_PURCH_MA                     11280000
     THEN                                                               11290000
       WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_CALL_NOMA;                    11300000
                                                                        11310000
     IF VERIFY (WRK_TYPE_OF_MAINT,WRK_TYPE.TPMNT_NO_WAR) ¬= 0           11320000
     THEN                                                               11330000
       DO;                                                              11340000
         IF SUBSTR(DB_MACH_ORD.RCUAC,1,2) = '99'                        11350000
         THEN                                                           11360000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST6;                      11370000
         ELSE                                                           11380000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST3_DEF;                  11390000
       END;                                                             11400000
                                                                        11410000
     RCBBCA7_HW_PO.TYPE_OF_MAINT = WRK_TYPE_OF_MAINT;                   11420000
   END;                                                                 11430000
                                                                        11440000
 RCBBCA7_HW_PO.TYPE_OF_AGREEMENT   = DB_MACH_ORD.CAGXA;                 11450000
 RCBBCA7_HW_PO.ORDER_DATE          = WRK_ORIG_ORD_DATE;                 11460000
 RCBBCA7_HW_PO.END_DATE            = ' ';                               11470000
                                              /***********************/ 11480000
                                              /*  NULL INDICATORS    */ 11490000
                                              /***********************/ 11500000
 IF RCBBCA7_HW_PO.ORIGIN              = ''                              11510000
 THEN                                                                   11520000
   RCBBCA7_HW_PO.INDNULL(4)           = -1;                             11530000
                                                                        11540000
 IF RCBBCA7_HW_PO.SEQUENCE_NUMBER     = ''                              11550000
 THEN                                                                   11560000
   RCBBCA7_HW_PO.INDNULL(5)           = -1;                             11570000
                                                                        11580000
 IF RCBBCA7_HW_PO.CUSTOMER_OWNER      = ' '                             11590000
 THEN                                                                   11600000
   RCBBCA7_HW_PO.INDNULL(7)           = -1;                             11610000
                                                                        11620000
 IF RCBBCA7_HW_PO.CUST_REQ_ARRIVDATE  = ''                              11630000
 THEN                                                                   11640000
   RCBBCA7_HW_PO.INDNULL(8)           = -1;                             11650000
                                                                        11660000
 IF RCBBCA7_HW_PO.DP_SYSTEM_NUMBER    = ''                              11670000
 THEN                                                                   11680000
   RCBBCA7_HW_PO.INDNULL(9)           = -1;                             11690000
                                                                        11700000
 IF RCBBCA7_HW_PO.MARKET_RESP_CODE    = ''                              11710000
 THEN                                                                   11720000
   RCBBCA7_HW_PO.INDNULL(10)          = -1;                             11730000
                                                                        11740000
 IF RCBBCA7_HW_PO.INSTALLING_OU       = ''                              11750000
 THEN                                                                   11760000
   RCBBCA7_HW_PO.INDNULL(13)          = -1;                             11770000
                                                                        11780000
 IF RCBBCA7_HW_PO.SELLING_OU          = ''                              11790000
 THEN                                                                   11800000
   RCBBCA7_HW_PO.INDNULL(14)          = -1;                             11810000
                /* PTM 536: RENUMBER INDICATORS */                      11820000
 IF RCBBCA7_HW_PO.SCHED_COMPL_DATE    = ''                              11830000
 THEN                                                                   11840000
   RCBBCA7_HW_PO.INDNULL(15)          = -1;                             11850000
                                                                        11860000
 IF RCBBCA7_HW_PO.SCHED_REMOVAL_DATE  = ''                              11870000
 THEN                                                                   11880000
   RCBBCA7_HW_PO.INDNULL(16)          = -1;                             11890000
                                                                        11900000
 IF RCBBCA7_HW_PO.TYPE_OF_MAINT       = ''                              11910000
 THEN                                                                   11920000
   RCBBCA7_HW_PO.INDNULL(17)          = -1;                             11930000
                                                                        11940000
 IF RCBBCA7_HW_PO.TYPE_OF_WARRANTY    = ''                              11950000
 THEN                                                                   11960000
   RCBBCA7_HW_PO.INDNULL(18)          = -1;                             11970000
                                                                        11980000
 IF RCBBCA7_HW_PO.TYPE_OF_AGREEMENT   = ''                              11990000
 THEN                                                                   12000000
   RCBBCA7_HW_PO.INDNULL(19)          = -1;                             12010000
                      /* END PTM 536 */                                 12020000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA7,RCBBCA7_REC);                      12030000
 IF PCB_RCBBCA7.ST_CODE ¬= '  '                                         12040000
 THEN                                                                   12050000
   CALL ROLBCAM_ERROR(PTR_RCBBCA7,'IMS_DB','#008');                     12060099
                                                                        12070000
 CHKP_AREA.CNT_CTRY.RCBBCA7 = CHKP_AREA.CNT_CTRY.RCBBCA7 + 1;           12080000
                                                                        12090000
 WRK_HASH_FIELD = SUBSTR(RCBBCA7_HW_PO.ORDER_REF_NUMBER,1,4);           12100000
                                                                        12110000
 CALL RCB018M(WRK_HASH_FIELD,                                           12120000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA7,                         12130000
              PTR_INT_AREA);                                            12140000
                                                                        12150000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   12160000
                                                                        12170000
 END ROLBCAM_R041_WRITE_HW_IN_ORD_DO;                                   12180099
1/********************************************************************/ 12190000
 /*                                                                  */ 12200000
 /* MODULE NAME      : WRITE_HW_DO                                   */ 12210000
 /*                                                                  */ 12220000
 /* DESCRIPTION      : WRITE HW DATA RECORD RCBBCA0 FROM DO          */ 12230000
 /*                                                                  */ 12240000
 /********************************************************************/ 12250000
0ROLBCAM_R042_WRITE_HW_DO: PROC;                                        12260099
                                                                        12270000
 RCBBCA0_REC                        = '';                               12280000
 RCBBCA0_HW_PRODUCT.INDNULL(*)      = 0;                                12290000
 RCBBCA0_HW_PRODUCT.REC_TYPE        = '02';                             12300000
 RCBBCA0_HW_PRODUCT.CTRYNO          = CHKP_AREA.COUNTRY;                12310000
 RCBBCA0_HW_PRODUCT.PGR_TYPE        = CHKP_AREA.PGR_RUN_TYPE;           12320000
 RCBBCA0_HW_PRODUCT.RUN_DATE        = CHKP_AREA.CURR_DATE;              12330000
                                                                        12340000
 RCBBCA0_HW_PRODUCT.PRODUCT_TYPE    = DB_MACH_ORD.CMAXA;                12350000
                                                        /*SOC RB01320 */12351000
 IF WRK_T125_FOUND = 'Y'                                                12352000
 THEN                                                                   12353000
 DO;                                                                    12354000
 RCBBCA0_HW_PRODUCT.ORIGIN          =                                   12355000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     12356000
 RCBBCA0_HW_PRODUCT.SEQUENCE_NUMBER =                                   12357000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    12358000
 END;                                                                   12359000
 ELSE                                                                   12359100
 DO;                                                     /*EOC RB01320*/12359200
 RCBBCA0_HW_PRODUCT.ORIGIN          = SUBSTR(DB_MACH_ORD.RMAXA,1,2);    12360000
 RCBBCA0_HW_PRODUCT.SEQUENCE_NUMBER = '00'||                            12370000
                                      SUBSTR(DB_MACH_ORD.RMAXA,3,5);    12380000
 END;                                                        /*RB01320*/12381000
 RCBBCA0_HW_PRODUCT.COUNTRY_NUMBER   = CHKP_AREA.COUNTRY;               12390000
                                                                        12400000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA0,RCBBCA0_REC);                      12410000
 IF PCB_RCBBCA0.ST_CODE ¬= '  '                                         12420000
 THEN                                                                   12430000
   CALL ROLBCAM_ERROR(PTR_RCBBCA0,'IMS_DB','#009');                     12440099
                                                                        12450000
 CHKP_AREA.CNT_CTRY.RCBBCA0 = CHKP_AREA.CNT_CTRY.RCBBCA0 + 1;           12460000
                                                                        12470000
 WRK_HASH_FIELD = SUBSTR(RCBBCA0_HW_PRODUCT.SEQUENCE_NUMBER,3,4);       12480000
                                                                        12490000
 CALL RCB018M(WRK_HASH_FIELD,                                           12500000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA0,                         12510000
              PTR_INT_AREA);                                            12520000
                                                                        12530000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   12540000
                                                                        12550000
 END ROLBCAM_R042_WRITE_HW_DO;                                          12560099
1/********************************************************************/ 12570000
 /*                                                                  */ 12580000
 /* MODULE NAME      : WRITE_REAL_DO                                 */ 12590000
 /*                                                                  */ 12600000
 /* DESCRIPTION      : WRITE HW REALIZATION RECORD RCBBCA8 FROM DO   */ 12610000
 /*                                                                  */ 12620000
 /********************************************************************/ 12630000
0ROLBCAM_R043_WRITE_REAL_DO: PROC;                                      12640099
                                                                        12650000
 RCBBCA8_HW_REAL.INDNULL(*)      = 0;                                   12660000
 RCBBCA8_HW_REAL.REC_TYPE        = '02';                                12670000
 RCBBCA8_HW_REAL.CTRYNO          = CHKP_AREA.COUNTRY;                   12680000
 RCBBCA8_HW_REAL.PGR_TYPE        = CHKP_AREA.PGR_RUN_TYPE;              12690000
 RCBBCA8_HW_REAL.RUN_DATE        = CHKP_AREA.CURR_DATE;                 12700000
                                                                        12710000
 RCBBCA8_HW_REAL.PRODUCT_TYPE    = DB_MACH_ORD.CMAXA;                   12720000
                                                        /*SOC RB01320 */12721000
 IF WRK_T125_FOUND = 'Y'                                                12722000
 THEN                                                                   12723000
 DO;                                                                    12724000
 RCBBCA8_HW_REAL.ORIGIN          =                                      12725000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     12726000
 RCBBCA8_HW_REAL.SEQUENCE_NUMBER =                                      12727000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    12728000
 END;                                                                   12729000
 ELSE                                                                   12729100
 DO;                                                     /*EOC RB01320*/12729200
 RCBBCA8_HW_REAL.ORIGIN          = SUBSTR(DB_MACH_ORD.RMAXA,1,2);       12730000
 RCBBCA8_HW_REAL.SEQUENCE_NUMBER = '00'||SUBSTR(DB_MACH_ORD.RMAXA,3,5); 12740000
 END;                                                        /*RB01320*/12741000
 RCBBCA8_HW_REAL.COUNTRY_NUMBER  = CHKP_AREA.COUNTRY;                   12750000
 RCBBCA8_HW_REAL.MODEL_NUMBER    = DB_MACH_ORD.CMMXA;                   12760000
 RCBBCA8_HW_REAL.EFFECTIVE_DATE  = ' ';                                 12770000
 RCBBCA8_HW_REAL.END_DATE        = ' ';                                 12780000
                                                                        12790000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA8,RCBBCA8_REC);                      12800000
 IF PCB_RCBBCA8.ST_CODE ¬= '  '                                         12810000
 THEN                                                                   12820000
   CALL ROLBCAM_ERROR(PTR_RCBBCA8,'IMS_DB','#010');                     12830099
                                                                        12840000
 CHKP_AREA.CNT_CTRY.RCBBCA8 = CHKP_AREA.CNT_CTRY.RCBBCA8 + 1;           12850000
                                                                        12860000
 WRK_HASH_FIELD = SUBSTR(RCBBCA8_HW_REAL.SEQUENCE_NUMBER,3,4);          12870000
                                                                        12880000
 CALL RCB018M(WRK_HASH_FIELD,                                           12890000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA8,                         12900000
              PTR_INT_AREA);                                            12910000
                                                                        12920000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   12930000
                                                                        12940000
 END ROLBCAM_R043_WRITE_REAL_DO;                                        12950099
1/********************************************************************/ 12960000
 /*                                                                  */ 12970000
 /* MODULE NAME      : PROCESS_CAPACITY_DO                           */ 12980000
 /*                                                                  */ 12990000
 /* DESCRIPTION      : PROCESS CAPACITY RECORD FROM RBDGDC0          */ 13000000
 /*                                                                  */ 13010000
 /********************************************************************/ 13020000
0ROLBCAM_R044_PROCESS_CAP_DO: PROC;                                     13030099
                                                                        13040000
                                /* READ FIRST CAPACITY CHANGE RECORD */ 13050000
 SSA_RRDDC1.CTRYNO = DB_MACH_ORD.GCYAA;            /* COUNTRY NUMBER */ 13060000
 SSA_RRDDC1.RORXA  = DB_MACH_ORD.RORXD;            /* ORDER REF. NBR.*/ 13070000
 SSA_RRDDC1.CSTXA  = DB_MACH_ORD.CSTXD;            /* OEI STATUS     */ 13080000
 CHKP_AREA.SWITCH_END_DC = FALSE;                                       13090000
 CALL ROLBCAM_R034_READ_CAPACITY;                                       13100099
                                                                        13110000
                              /* PROCESS ALL CAPACITY CHANGE RECORDS */ 13120000
 DO WHILE (¬CHKP_AREA.SWITCH_END_DC);                                   13130000
                                                                        13140000
   CALL ROLBCAM_R035_WRITE_MES;                                         13150099
   CALL ROLBCAM_R036_WRITE_MES_PO;                                      13160099
   CHKP_AREA.CNT_CTRY.PROC_DC = CHKP_AREA.CNT_CTRY.PROC_DC + 1;         13170000
                                                                        13180000
   IF DB_MACH_CAP.RORXD ¬= ' ' & DB_MACH_CAP.CSTXD ¬= ' '               13190000
   THEN                                                                 13200000
     DO;                                                                13210000
       SSA_RRDDC1.RORXA  = DB_MACH_CAP.RORXD;                           13220000
       SSA_RRDDC1.CSTXA  = DB_MACH_CAP.CSTXD;                           13230000
       CALL ROLBCAM_R034_READ_CAPACITY;                                 13240099
     END;                                                               13250000
   ELSE                                                                 13260000
     CHKP_AREA.SWITCH_END_DC = TRUE;                                    13270000
                                                                        13280000
 END;                                                                   13290000
                                                                        13300000
 END ROLBCAM_R044_PROCESS_CAP_DO;                                       13310099
1/********************************************************************/ 13320000
 /*                                                                  */ 13330000
 /* MODULE NAME      : ROLBCAM_PROCESS_REMOVAL_DI                    */ 13340099
 /*                                                                  */ 13350000
 /* DESCRIPTION      : PROCESS REMOVAL RECORD FROM RBDGDR0           */ 13360000
 /*                                                                  */ 13370000
 /********************************************************************/ 13380000
0ROLBCAM_R050_PROCESS_REMOVAL_DI: PROC;                                 13390099
                                                                        13400000
                                              /* READ REMOVAL RECORD */ 13410000
 SSA_RRDDR1.CTRYNO = DB_MACH_INV.GCYAA;                                 13420000
 SSA_RRDDR1.RORXA  = DB_MACH_INV.RORXH;                                 13430000
 CALL ROLBCAM_R030_READ_REMOVAL;                                        13440099
                                                                        13450000
 CHKP_AREA.CNT_CTRY.PROC_DR = CHKP_AREA.CNT_CTRY.PROC_DR + 1;           13460000
                                                                        13470000
 END ROLBCAM_R050_PROCESS_REMOVAL_DI;                                   13480099
1/********************************************************************/ 13490000
 /*                                                                  */ 13500000
 /* MODULE NAME      : WRITE_HW_DI                                   */ 13510000
 /*                                                                  */ 13520000
 /* DESCRIPTION      : WRITE HW DATA RECORD RCBBCA0 FROM DI          */ 13530000
 /*                                                                  */ 13540000
 /********************************************************************/ 13550000
0ROLBCAM_R051_WRITE_HW_DI: PROC;                                        13560099
                                                                        13570000
 RCBBCA0_REC                         = '';                              13580000
 RCBBCA0_HW_PRODUCT.INDNULL(*)       = 0;                               13590000
 RCBBCA0_HW_PRODUCT.REC_TYPE         = '02';                            13600000
 RCBBCA0_HW_PRODUCT.CTRYNO           = CHKP_AREA.COUNTRY;               13610000
 RCBBCA0_HW_PRODUCT.PGR_TYPE         = CHKP_AREA.PGR_RUN_TYPE;          13620000
 RCBBCA0_HW_PRODUCT.RUN_DATE         = CHKP_AREA.CURR_DATE;             13630000
                                                                        13640000
 RCBBCA0_HW_PRODUCT.PRODUCT_TYPE     = DB_MACH_INV.CMAXA;               13650000
                                                        /*SOC RB01320 */13651000
 IF WRK_T125_FOUND = 'Y'                                                13652000
 THEN                                                                   13653000
 DO;                                                                    13654000
 RCBBCA0_HW_PRODUCT.ORIGIN           =                                  13655000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     13656000
 RCBBCA0_HW_PRODUCT.SEQUENCE_NUMBER  =                                  13657000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    13658000
 END;                                                                   13659000
 ELSE                                                                   13659100
 DO;                                                     /*EOC RB01320*/13659200
 RCBBCA0_HW_PRODUCT.ORIGIN           = SUBSTR(DB_MACH_INV.RMAXA,1,2);   13660000
 RCBBCA0_HW_PRODUCT.SEQUENCE_NUMBER  = '00'||                           13670000
                                       SUBSTR(DB_MACH_INV.RMAXA,3,5);   13680000
 END;                                                        /*RB01320*/13681000
 RCBBCA0_HW_PRODUCT.COUNTRY_NUMBER   = CHKP_AREA.COUNTRY;               13690000
                                                                        13700000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA0,RCBBCA0_REC);                      13710000
 IF PCB_RCBBCA0.ST_CODE ¬= '  '                                         13720000
 THEN                                                                   13730000
   CALL ROLBCAM_ERROR(PTR_RCBBCA0,'IMS_DB','#011');                     13740099
                                                                        13750000
 CHKP_AREA.CNT_CTRY.RCBBCA0 = CHKP_AREA.CNT_CTRY.RCBBCA0 + 1;           13760000
                                                                        13770000
 WRK_HASH_FIELD = SUBSTR(RCBBCA0_HW_PRODUCT.SEQUENCE_NUMBER,3,4);       13780000
                                                                        13790000
 CALL RCB018M(WRK_HASH_FIELD,                                           13800000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA0,                         13810000
              PTR_INT_AREA);                                            13820000
                                                                        13830000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   13840000
                                                                        13850000
 END ROLBCAM_R051_WRITE_HW_DI;                                          13860099
1/********************************************************************/ 13870000
 /*                                                                  */ 13880000
 /* MODULE NAME      : WRITE_HW_MOD                                  */ 13890000
 /*                                                                  */ 13900000
 /* DESCRIPTION      : WRITE HW MOD INFO DATA RECORD RCBBCAB         */ 13910000
 /*                                                                  */ 13920000
 /********************************************************************/ 13930000
0ROLBCAM_R052_WRITE_HW_MOD: PROC;                                       13940099
                                                                        13950000
 RCBBCAB_REC                      = '';                                 13960000
 RCBBCAB_HW_MOD.INDNULL(*)        = 0;                                  13970000
 RCBBCAB_HW_MOD.REC_TYPE          = '02';                               13980000
 RCBBCAB_HW_MOD.CTRYNO            = CHKP_AREA.COUNTRY;                  13990000
 RCBBCAB_HW_MOD.PGR_TYPE          = CHKP_AREA.PGR_RUN_TYPE;             14000000
 RCBBCAB_HW_MOD.RUN_DATE          = CHKP_AREA.CURR_DATE;                14010000
                                                                        14020000
 RCBBCAB_HW_MOD.PRODUCT_TYPE      = DB_MACH_INV.CMAXA;                  14030000
                                                        /*SOC RB01320 */14031000
 IF WRK_T125_FOUND = 'Y'                                                14032000
 THEN                                                                   14033000
 DO;                                                                    14034000
 RCBBCAB_HW_MOD.ORIGIN            =                                     14035000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     14036000
 RCBBCAB_HW_MOD.SEQUENCE_NUMBER   =                                     14037000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    14038000
 END;                                                                   14039000
 ELSE                                                                   14039100
 DO;                                                     /*EOC RB01320*/14039200
 RCBBCAB_HW_MOD.ORIGIN            = SUBSTR(DB_MACH_INV.RMAXA,1,2);      14040000
 RCBBCAB_HW_MOD.SEQUENCE_NUMBER   = '00'||                              14050000
                                    SUBSTR(DB_MACH_INV.RMAXA,3,5);      14060000
 END;                                                        /*RB01320*/14061000
 RCBBCAB_HW_MOD.COUNTRY_NUMBER    = CHKP_AREA.COUNTRY;                  14070000
 RCBBCAB_HW_MOD.TYPE_OF_AGREEMENT = DB_MACH_INV.CAGXA;                  14080000
 RCBBCAB_HW_MOD.MARKET_RESP_CODE  = DB_MACH_INV.CMKDA;                  14090000
 RCBBCAB_HW_MOD.DP_SYSTEM_NUMBER  = DB_MACH_INV.RSYXA;                  14100000
 IF WRK_RUNMODE = 'S1' THEN                            /* SOC RC01337 */14101000
 RCBBCAB_HW_MOD.CPU_TYPE          = DB_MACH_INV.CSYXA;                  14102000
 ELSE                                                  /* EOC RC01337 */14103000
 RCBBCAB_HW_MOD.CPU_TYPE          = DB_MACH_INV.CPDXA;                  14110000
 RCBBCAB_HW_MOD.INSTALLING_OU     = STRING(DB_MACH_INV.RLCXI);          14120000
 RCBBCAB_HW_MOD.SELLING_OU        = '';                                 14130000
 RCBBCAB_HW_MOD.EFFECTIVE_DATE    = ' ';                                14140000
 RCBBCAB_HW_MOD.END_DATE          = ' ';                                14150000
                                              /***********************/ 14160000
                                              /*  NULL INDICATORS    */ 14170000
                                              /***********************/ 14180000
 IF RCBBCAB_HW_MOD.TYPE_OF_AGREEMENT  = ' '                             14190000
 THEN                                                                   14200000
   RCBBCAB_HW_MOD.INDNULL(5)      = -1;                                 14210000
                                                                        14220000
 IF RCBBCAB_HW_MOD.MARKET_RESP_CODE   = ' '                             14230000
 THEN                                                                   14240000
   RCBBCAB_HW_MOD.INDNULL(6)      = -1;                                 14250000
                                                                        14260000
 IF RCBBCAB_HW_MOD.DP_SYSTEM_NUMBER   = ' '                             14270000
 THEN                                                                   14280000
   RCBBCAB_HW_MOD.INDNULL(7)      = -1;                                 14290000
                                        /* PTM 536 */                   14300000
 IF RCBBCAB_HW_MOD.INSTALLING_OU      = ' '                             14310000
 THEN                                                                   14320000
   RCBBCAB_HW_MOD.INDNULL(8)      = -1;                                 14330000
                                                                        14340000
 IF RCBBCAB_HW_MOD.SELLING_OU         = ' '                             14350000
 THEN                                                                   14360000
   RCBBCAB_HW_MOD.INDNULL(9)     = -1;                                  14370000
                                                                        14380000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCAB,RCBBCAB_REC);                      14390000
 IF PCB_RCBBCAB.ST_CODE ¬= '  '                                         14400000
 THEN                                                                   14410000
   CALL ROLBCAM_ERROR(PTR_RCBBCAB,'IMS_DB','#012');                     14420099
                                                                        14430000
 CHKP_AREA.CNT_CTRY.RCBBCAB = CHKP_AREA.CNT_CTRY.RCBBCAB + 1;           14440000
                                                                        14450000
 WRK_HASH_FIELD = SUBSTR(RCBBCAB_HW_MOD.SEQUENCE_NUMBER,3,4);           14460000
                                                                        14470000
 CALL RCB018M(WRK_HASH_FIELD,                                           14480000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCAB,                         14490000
              PTR_INT_AREA);                                            14500000
                                                                        14510000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   14520000
                                                                        14530000
 END ROLBCAM_R052_WRITE_HW_MOD;                                         14540099
1/********************************************************************/ 14550000
 /*                                                                  */ 14560000
 /* MODULE NAME      : WRITE_HW_STATUS                               */ 14570000
 /*                                                                  */ 14580000
 /* DESCRIPTION      : WRITE HW STATUS DATA RECORD RCBBCA0           */ 14590000
 /*                                                                  */ 14600000
 /********************************************************************/ 14610000
0ROLBCAM_R053_WRITE_HW_STATUS: PROC;                                    14620099
                                                                        14630000
 RCBBCA2_REC                       = '';                                14640000
 RCBBCA2_HW_STATUS.INDNULL(*)      = 0;                                 14650000
 RCBBCA2_HW_STATUS.REC_TYPE        = '02';                              14660000
 RCBBCA2_HW_STATUS.CTRYNO          = CHKP_AREA.COUNTRY;                 14670000
 RCBBCA2_HW_STATUS.PGR_TYPE        = CHKP_AREA.PGR_RUN_TYPE;            14680000
 RCBBCA2_HW_STATUS.RUN_DATE        = CHKP_AREA.CURR_DATE;               14690000
                                                                        14700000
 RCBBCA2_HW_STATUS.PRODUCT_TYPE    = DB_MACH_INV.CMAXA;                 14710000
                                                        /*SOC RB01320 */14711000
 IF WRK_T125_FOUND = 'Y'                                                14712000
 THEN                                                                   14713000
 DO;                                                                    14714000
 RCBBCA2_HW_STATUS.ORIGIN          =                                    14715000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     14716000
 RCBBCA2_HW_STATUS.SEQUENCE_NUMBER =                                    14717000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    14718000
 END;                                                                   14719000
 ELSE                                                                   14719100
 DO;                                                     /*EOC RB01320*/14719200
 RCBBCA2_HW_STATUS.ORIGIN          = SUBSTR(DB_MACH_INV.RMAXA,1,2);     14720000
 RCBBCA2_HW_STATUS.SEQUENCE_NUMBER = '00'||                             14730000
                                      SUBSTR(DB_MACH_INV.RMAXA,3,5);    14740000
 END;                                                        /*RB01320*/14741000
 RCBBCA2_HW_STATUS.COUNTRY_NUMBER  = CHKP_AREA.COUNTRY;                 14750000
 RCBBCA2_HW_STATUS.STATUS          = DB_MACH_INV.CSTXA;                 14760000
 RCBBCA2_HW_STATUS.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;           14770000
 RCBBCA2_HW_STATUS.EFFECTIVE_DATE  = ' ';                               14780000
 RCBBCA2_HW_STATUS.END_DATE        = ' ';                               14790000
                                                                        14800000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA2,RCBBCA2_REC);                      14810000
 IF PCB_RCBBCA2.ST_CODE ¬= '  '                                         14820000
 THEN                                                                   14830000
   CALL ROLBCAM_ERROR(PTR_RCBBCA2,'IMS_DB','#013');                     14840099
                                                                        14850000
 CHKP_AREA.CNT_CTRY.RCBBCA2 = CHKP_AREA.CNT_CTRY.RCBBCA2 + 1;           14860000
                                                                        14870000
 WRK_HASH_FIELD = SUBSTR(RCBBCA2_HW_STATUS.SEQUENCE_NUMBER,3,4);        14880000
                                                                        14890000
 CALL RCB018M(WRK_HASH_FIELD,                                           14900000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA2,                         14910000
              PTR_INT_AREA);                                            14920000
                                                                        14930000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   14940000
                                                                        14950000
 END ROLBCAM_R053_WRITE_HW_STATUS;                                      14960099
1/********************************************************************/ 14970000
 /*                                                                  */ 14980000
 /* MODULE NAME      : WRITE_OU_HW                                   */ 14990000
 /*                                                                  */ 15000000
 /* DESCRIPTION      : WRITE OU/HW RELATION RECORD RCBBCA3           */ 15010000
 /*                                                                  */ 15020000
 /********************************************************************/ 15030000
0ROLBCAM_R054_WRITE_OU_HW: PROC;                                        15040099
                                                                        15050000
 RCBBCA3_REC                     = '';                                  15060000
 RCBBCA3_OU_HW.INDNULL(*)        = 0;                                   15070000
 RCBBCA3_OU_HW.REC_TYPE          = '02';                                15080000
 RCBBCA3_OU_HW.CTRYNO            = CHKP_AREA.COUNTRY;                   15090000
 RCBBCA3_OU_HW.PGR_TYPE          = CHKP_AREA.PGR_RUN_TYPE;              15100000
 RCBBCA3_OU_HW.RUN_DATE          = CHKP_AREA.CURR_DATE;                 15110000
                                                                        15120000
 RCBBCA3_OU_HW.COUNTRY_NUMBER    = SUBSTR(DB_MACH_INV.GCYAA,2,3);       15130000
 RCBBCA3_OU_HW.OU_CODE           = WRK_OU_CODE;                         15140000
 RCBBCA3_OU_HW.PRODUCT_TYPE      = DB_MACH_INV.CMAXA;                   15150000
                                                        /*SOC RB01320 */15151000
 IF WRK_T125_FOUND = 'Y'                                                15152000
 THEN                                                                   15153000
 DO;                                                                    15154000
 RCBBCA3_OU_HW.ORIGIN            =                                      15155000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     15156000
 RCBBCA3_OU_HW.SEQUENCE_NUMBER   =                                      15157000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    15158000
 END;                                                                   15159000
 ELSE                                                                   15159100
 DO;                                                     /*EOC RB01320*/15159200
 RCBBCA3_OU_HW.ORIGIN            = SUBSTR(DB_MACH_INV.RMAXA,1,2);       15160000
 RCBBCA3_OU_HW.SEQUENCE_NUMBER   = '00'||                               15170000
                                   SUBSTR(DB_MACH_INV.RMAXA,3,5);       15180000
 END;                                                        /*RB01320*/15181000
 RCBBCA3_OU_HW.EFFECTIVE_DATE    = ' ';                                 15190000
 RCBBCA3_OU_HW.END_DATE          = ' ';                                 15200000
                                                                        15210000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA3,RCBBCA3_REC);                      15220000
 IF PCB_RCBBCA3.ST_CODE ¬= '  '                                         15230000
 THEN                                                                   15240000
   CALL ROLBCAM_ERROR(PTR_RCBBCA3,'IMS_DB','#014');                     15250099
                                                                        15260000
 CHKP_AREA.CNT_CTRY.RCBBCA3 = CHKP_AREA.CNT_CTRY.RCBBCA3 + 1;           15270000
                                                                        15280000
 WRK_HASH_FIELD = SUBSTR(RCBBCA3_OU_HW.SEQUENCE_NUMBER,3,4);            15290000
                                                                        15300000
 CALL RCB018M(WRK_HASH_FIELD,                                           15310000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA3,                         15320000
              PTR_INT_AREA);                                            15330000
                                                                        15340000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   15350000
                                                                        15360000
 END ROLBCAM_R054_WRITE_OU_HW;                                          15370099
1/********************************************************************/ 15380000
 /*                                                                  */ 15390000
 /* MODULE NAME      : WRITE_HW_CUST                                 */ 15400000
 /*                                                                  */ 15410000
 /* DESCRIPTION      : WRITE HW/CUSTOMER DATA RECORD RCBBCA4         */ 15420000
 /*                                                                  */ 15430000
 /********************************************************************/ 15440000
0ROLBCAM_R055_WRITE_HW_CUST: PROC;                                      15450099
                                                                        15460000
                                                            /* USER */  15470000
 RCBBCA4_REC                        = '';                               15480000
 RCBBCA4_HW_CUST.INDNULL(*)         = 0;                                15490000
 RCBBCA4_HW_CUST.REC_TYPE           = '02';                             15500000
 RCBBCA4_HW_CUST.CTRYNO             = CHKP_AREA.COUNTRY;                15510000
 RCBBCA4_HW_CUST.PGR_TYPE           = CHKP_AREA.PGR_RUN_TYPE;           15520000
 RCBBCA4_HW_CUST.RUN_DATE           = CHKP_AREA.CURR_DATE;              15530000
                                                                        15540000
 RCBBCA4_HW_CUST.COUNTRY_NUMBER     = SUBSTR(DB_MACH_INV.GCYAA,2,3);    15550000
 RCBBCA4_HW_CUST.PRODUCT_TYPE       = DB_MACH_INV.CMAXA;                15560000
                                                        /*SOC RB01320 */15561000
 IF WRK_T125_FOUND = 'Y'                                                15562000
 THEN                                                                   15563000
 DO;                                                                    15564000
 RCBBCA4_HW_CUST.ORIGIN          =                                      15565000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     15566000
 RCBBCA4_HW_CUST.SEQUENCE_NUMBER =                                      15567000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    15568000
 END;                                                                   15569000
 ELSE                                                                   15569100
 DO;                                                     /*EOC RB01320*/15569200
 RCBBCA4_HW_CUST.ORIGIN             = SUBSTR(DB_MACH_INV.RMAXA,1,2);    15570000
 RCBBCA4_HW_CUST.SEQUENCE_NUMBER    = '00'||                            15580000
                                       SUBSTR(DB_MACH_INV.RMAXA,3,5);   15590000
 END;                                                        /*RB01320*/15591000
 RCBBCA4_HW_CUST.CUSTOMER_NUMBER    = '00'||DB_MACH_INV.RCUAC;          15600000
 RCBBCA4_HW_CUST.TYPE_OF_RELATION   = 'U';                              15610000
 RCBBCA4_HW_CUST.MARKETING_INSTDAT  = WRK_ACT_INST_DATE;                15620000
 RCBBCA4_HW_CUST.SCHED_REMOVAL_DATE = WRK_SCHED_REM_DATE;               15630000
 RCBBCA4_HW_CUST.EFFECTIVE_DATE     = ' ';                              15640000
 RCBBCA4_HW_CUST.END_DATE           = ' ';                              15650000
                                             /**********************/   15660000
                                             /* NULL INDICATORS    */   15670000
                                             /**********************/   15680000
 IF RCBBCA4_HW_CUST.MARKETING_INSTDAT  = ''                             15690000
 THEN                                                                   15700000
   RCBBCA4_HW_CUST.INDNULL(7)          = -1;                            15710000
                                                                        15720000
 IF RCBBCA4_HW_CUST.SCHED_REMOVAL_DATE = ''                             15730000
 THEN                                                                   15740000
     RCBBCA4_HW_CUST.INDNULL(8)        = -1;                            15750000
                                                                        15760000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA4,RCBBCA4_REC);                      15770000
 IF PCB_RCBBCA4.ST_CODE ¬= '  '                                         15780000
 THEN                                                                   15790000
   CALL ROLBCAM_ERROR(PTR_RCBBCA4,'IMS_DB','#015');                     15800099
                                                                        15810000
 CHKP_AREA.CNT_CTRY.RCBBCA4 = CHKP_AREA.CNT_CTRY.RCBBCA4 + 1;           15820000
                                                                        15830000
 WRK_HASH_FIELD = SUBSTR(RCBBCA4_HW_CUST.SEQUENCE_NUMBER,3,4);          15840000
                                                                        15850000
 CALL RCB018M(WRK_HASH_FIELD,                                           15860000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA4,                         15870000
              PTR_INT_AREA);                                            15880000
                                                                        15890000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   15900000
                                                                        15910000
                                                           /* OWNER */  15920000
 IF (DB_MACH_INV.RCUXA ¬= ' ' &                                         15930000
     DB_MACH_INV.RCUXA ¬= DB_MACH_INV.RCUAC)                            15940000
 THEN                                                                   15950000
   DO;                                                                  15960000
     RCBBCA4_HW_CUST.INDNULL(*)         = 0;                            15970000
     RCBBCA4_HW_CUST.CUSTOMER_NUMBER    = '00'||DB_MACH_INV.RCUXA;      15980000
     RCBBCA4_HW_CUST.TYPE_OF_RELATION   = 'O';                          15990000
     RCBBCA4_HW_CUST.MARKETING_INSTDAT  = ' ';                          16000000
     RCBBCA4_HW_CUST.SCHED_REMOVAL_DATE = ' ';                          16010000
     RCBBCA4_HW_CUST.EFFECTIVE_DATE     = ' ';                          16020000
     RCBBCA4_HW_CUST.END_DATE           = ' ';                          16030000
                                             /**********************/   16040000
                                             /* NULL INDICATORS    */   16050000
                                             /**********************/   16060000
     RCBBCA4_HW_CUST.INDNULL(7)  = -1;  /* MARKETING INSTALL. DATE */   16070000
     RCBBCA4_HW_CUST.INDNULL(8)  = -1;  /* SCHED REMOVAL DATE      */   16080000
                                                                        16090000
     CALL PLITDLI(THREE,ISRT,PTR_RCBBCA4,RCBBCA4_REC);                  16100000
     IF PCB_RCBBCA4.ST_CODE ¬= '  '                                     16110000
     THEN                                                               16120000
       CALL ROLBCAM_ERROR(PTR_RCBBCA4,'IMS_DB','#016');                 16130099
                                                                        16140000
     CHKP_AREA.CNT_CTRY.RCBBCA4 = CHKP_AREA.CNT_CTRY.RCBBCA4 + 1;       16150000
                                                                        16160000
     WRK_HASH_FIELD = SUBSTR(RCBBCA4_HW_CUST.SEQUENCE_NUMBER,3,4);      16170000
                                                                        16180000
     CALL RCB018M(WRK_HASH_FIELD,                                       16190000
                  CHKP_AREA.CNT_HASH_TOTAL.RCBBCA4,                     16200000
                  PTR_INT_AREA);                                        16210000
                                                                        16220000
     CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                               16230000
   END;                                                                 16240000
                                                                        16250000
 END ROLBCAM_R055_WRITE_HW_CUST;                                        16260099
1/********************************************************************/ 16270000
 /*                                                                  */ 16280000
 /* MODULE NAME      : WRITE_SUPPLY_CTR                              */ 16290000
 /*                                                                  */ 16300000
 /* DESCRIPTION      : WRITE SUPPLY CONTRACT RECORD RCBBCA5          */ 16310000
 /*                                                                  */ 16320000
 /********************************************************************/ 16330000
0ROLBCAM_R056_WRITE_SUPPLY_CTR: PROC;                                   16340099
                                                                        16350000
 DCL WRK_TYPE_OF_WAR    CHAR (01);                                      16360000
 DCL WRK_TYPE_OF_MAINT  CHAR (01);                                      16370000
 DCL WRK_SKIP_SUPPLY    BIT  (01);                                      16380000
 DCL WRK_INVALID_TPWAR  BIT  (01);                                      16390000
                                                                        16400000
 WRK_SAVE_WED                   = '';                                   16410000
 WRK_SKIP_SUPPLY                = FALSE;                                16420000
 WRK_INVALID_TPWAR              = FALSE;                                16430000
                                                                        16440000
 RCBBCA5_REC                    = '';                                   16450000
 RCBBCA5_SUPPLY.INDNULL(*)      = 0;                                    16460000
 RCBBCA5_SUPPLY.REC_TYPE        = '02';                                 16470000
 RCBBCA5_SUPPLY.CTRYNO          = CHKP_AREA.COUNTRY;                    16480000
 RCBBCA5_SUPPLY.PGR_TYPE        = CHKP_AREA.PGR_RUN_TYPE;               16490000
 RCBBCA5_SUPPLY.RUN_DATE        = CHKP_AREA.CURR_DATE;                  16500000
                                                                        16510000
 RCBBCA5_SUPPLY.PRODUCT_TYPE    = DB_MACH_INV.CMAXA;                    16520000
                                                        /*SOC RB01320 */16521000
 IF WRK_T125_FOUND = 'Y'                                                16522000
 THEN                                                                   16523000
 DO;                                                                    16524000
 RCBBCA5_SUPPLY.ORIGIN          =                                       16525000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     16526000
 RCBBCA5_SUPPLY.SEQUENCE_NUMBER =                                       16527000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    16528000
 END;                                                                   16529000
 ELSE                                                                   16529100
 DO;                                                     /*EOC RB01320*/16529200
 RCBBCA5_SUPPLY.ORIGIN          = SUBSTR(DB_MACH_INV.RMAXA,1,2);        16530000
 RCBBCA5_SUPPLY.SEQUENCE_NUMBER = '00'||SUBSTR(DB_MACH_INV.RMAXA,3,5);  16540000
 END;                                                        /*RB01320*/16541000
 RCBBCA5_SUPPLY.COUNTRY_NUMBER  = CHKP_AREA.COUNTRY;                    16550000
 RCBBCA5_SUPPLY.SOURCE_INDICATOR = ' ';                   /* PTM 496 */ 16560000
 RCBBCA5_SUPPLY.SERVICE_LVL_CODE_2 = ' ';             /* SOC RB01298 */ 16561000
 RCBBCA5_SUPPLY.INDNULL(15)        = -1;              /* EOC RB01298 */ 16562000
                                                                        16570000
 /* CHECK/CONVERT TYPE OF WARRANTY/TYPE OF MAINTENANCE               */ 16580000
                                                                        16590000
 WRK_TYPE_OF_WAR   = DB_MACH_INV.CMCXB;                                 16600000
 WRK_TYPE_OF_MAINT = DB_MACH_INV.CMCXA;                                 16610000
                                                                        16620000
  IF WRK_TYPE_OF_MAINT    = 'I' &              /* SOC OF PCR692 */      16621099
     CHKP_AREA.COUNTRY  = '631'                                         16622099
  THEN DO;                                                              16623099
    WRK_TYPE_OF_WAR   = 'I' ;                                           16624099
    WRK_TYPE_OF_MAINT = ' ';                                            16625099
  END;                                         /* EOC OF PCR692 */      16626099
                                                   /* SOC OF PTM0987 */ 16630000
                                                                        16640000
 /*    THIS CHANGE IS A REQUIREMENT FOR SPAIN ONLY.                  */ 16650000
 /*    SPAIN USES THE TYPE OF WARRANTY = '0' TO INDICATE A SECOND    */ 16660000
 /*    HAND BOX. THIS CHECK IS DONE SO THAT THE TYPE OF MAINTENANCE  */ 16670000
 /*    IS NOT RESET TO '1', WHICH IN THIS SITUATION WOULD BE         */ 16680000
 /*    INCORRECT. WITH TYPE OF WARRANTY SET TO ' ', THE TYPE OF      */ 16690000
 /*    MAINTENANCE IS PASSED THROUGH CORRECTLY.                      */ 16700000
                                                                        16710000
 IF WRK_TYPE_OF_WAR    = '0' &                                          16720000
    CHKP_AREA.COUNTRY  = '838'   /* SPAIN */                            16730000
 THEN                                                                   16740000
   WRK_TYPE_OF_WAR   = ' ' ;                                            16750000
                                                                        16760000
                                                   /* EOC OF PTM0987 */ 16770000
 IF WRK_TYPE_OF_WAR ¬= ' '                                              16780000
 THEN                                     /* TYPE OF WARRANTY        */ 16790000
   DO;                                                                  16800000
     IF VERIFY(WRK_TYPE_OF_WAR,WRK_TYPE.TPMNT_WAR) = 0                  16810000
     THEN                               /* VALID TYPE OF WARRANTY    */ 16820000
       DO;                                                              16830000
                                                                        16840000
         RCBBCA5_SUPPLY.TYPE_OF_WARRANTY = WRK_TYPE_OF_WAR;/* RC01116*/ 16850000
                                                                        16860000
         RCBBCA5_SUPPLY.INDNULL(5)    = -1;  /* TYPE OF MAINTENANCE */  16870000
                                                                        16880000
       END;                     /* VALID TPWAR                       */ 16890000
     ELSE                     /* INVALID TPWAR SO DEFAULT TO TPMNT */   16900000
       DO;                                                              16910000
         WRK_INVALID_TPWAR = TRUE;                                      16920000
                                                                        16930000
         IF SUBSTR(DB_MACH_INV.RCUAC,1,2) = '99'                        16940000
         THEN                                /* INTERNAL CUSTOMER  */   16950000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST6_DEF;                  16960000
         ELSE                                /* EXTERNAL CUSTOMER  */   16970000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST3_DEF;                  16980000
       END;                                                             16990000
   END;                                                                 17000000
                                                                        17010000
 IF  WRK_TYPE_OF_WAR = ' ' |           /* TYPE OF MAINTENANCE OR     */ 17020000
     WRK_INVALID_TPWAR                 /* INVALID TYPE OF WARRANTY   */ 17030000
 THEN                                                                   17040000
   DO;                                                                  17050000
     SELECT;                                                            17060000
       WHEN (VERIFY(WRK_TYPE_OF_MAINT,WRK_TYPE.TPMNT_INT_MA) = 0)       17070000
         DO;                                                            17080000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST6_DEF;                  17090000
         END;                                                           17100000
       WHEN (VERIFY(WRK_TYPE_OF_MAINT,WRK_TYPE.TPMNT_ST2) = 0)          17110000
         DO;                                                            17120000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST3_DEF;                  17130000
         END;                                                           17140000
       WHEN (VERIFY(WRK_TYPE_OF_MAINT,WRK_TYPE.TPMNT_PLD_MA) = 0)       17150000
         DO;                                                            17160000
           WRK_TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST1_DEF;                  17170000
         END;                                                           17180000
       OTHERWISE;                                                       17190000
     END;                                                               17200000
                                                                        17210000
     IF VERIFY(WRK_TYPE_OF_MAINT,WRK_TYPE.TPMNT_NO_WAR) = 0             17220000
     THEN                                               /* VALID     */ 17230000
       RCBBCA5_SUPPLY.TYPE_OF_MAINT = WRK_TYPE_OF_MAINT;                17240000
     ELSE                                               /* INVALID   */ 17250000
       IF SUBSTR(DB_MACH_INV.RCUAC,1,2) = '99'                          17260000
       THEN                                    /* INTERNAL CUSTOMER  */ 17270000
         RCBBCA5_SUPPLY.TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST6_DEF;         17280000
       ELSE                                    /* EXTERNAL CUSTOMER  */ 17290000
         RCBBCA5_SUPPLY.TYPE_OF_MAINT = WRK_TYPE.TPMNT_ST3_DEF;         17300000
                                                                        17310000
                                                      /* SOC PTM1131 */ 17320000
     IF ((VERIFY(RCBBCA5_SUPPLY.TYPE_OF_MAINT,                          17330000
                                   WRK_TYPE.TPMNT_ST1) = 0)|            17340000
        (VERIFY(RCBBCA5_SUPPLY.TYPE_OF_MAINT,                           17350000
                                   WRK_TYPE.TPMNT_ST6) = 0))            17360000
        & (OUTAREA.SERVICE_LVL_CODE_1 ¬= HIGH(3))                       17370000
        & (OUTAREA.SERVICE_LVL_CODE_1 ¬= '')                            17380000
     THEN                                                               17390000
       DO;                                                              17400000
         RCBBCA5_SUPPLY.SERVICE_LVL_CODE =                              17410000
                     RCBZ32S_STRUCTURE.OUTAREA.SERVICE_LVL_CODE_1;      17420000
       END;                                                             17430000
                                                                        17440000
     ELSE                                                               17450000
       DO;                                                              17460000
         IF (VERIFY(RCBBCA5_SUPPLY.TYPE_OF_MAINT,                       17470000
                                       WRK_TYPE.TPMNT_ST3) = 0)         17480000
            & (OUTAREA.SERVICE_LVL_CODE_C ¬= HIGH(3))                   17490000
            & (OUTAREA.SERVICE_LVL_CODE_C ¬= '')                        17500000
         THEN                                                           17510000
           DO;                                                          17520000
             RCBBCA5_SUPPLY.SERVICE_LVL_CODE =                          17530000
                         RCBZ32S_STRUCTURE.OUTAREA.SERVICE_LVL_CODE_C;  17540000
           END;                                                         17550000
         ELSE DO;                                                       17560000
           RCBBCA5_SUPPLY.SERVICE_LVL_CODE = '';      /* SOC RC01190 */ 17570000
           RCBBCA5_SUPPLY.INDNULL(7)     = -1;        /* EOC RC01190 */ 17580000
         END;                                         /* EOC PTM1131 */ 17590000
       END;                                           /* EOC PTM1131 */ 17600000
                                       /* DETERMINE EFFECTIVE DATE */   17610000
     IF RCBBCA5_SUPPLY.TYPE_OF_MAINT ¬= '0' &                           17620000
        RCBBCA5_SUPPLY.TYPE_OF_MAINT ¬= WRK_TYPE.TPMNT_RENT             17630000
     THEN                                                               17640000
       IF WRK_RENT_STOP_DATE ¬= ' ' &                                   17650000
          WRK_RENT_STOP_DATE > CHKP_AREA.CURR_DATE                      17660000
       THEN                                                             17670000
         DO;                                                            17680000
           DATE_AREA.WD_IN_FORMAT   = 'ISO';                            17690000
           DATE_AREA.WD_OUT_FORMAT  = 'ISO';                            17700000
           DATE_AREA.WD_FUNCTION    = 'C';                              17710000
           DATE_AREA.WD_PERIOD_TYPE = 'D';                              17720000
           DATE_AREA.WD_PERIOD      = 1;                                17730000
           DATE_AREA.WD_IN_DATE     = WRK_RENT_STOP_DATE;               17740000
                                                                        17750000
           CALL RCB004M (PTR_DATE_AREA);                                17760000
           IF DATE_AREA.WD_STATUS ¬= ' '                                17770000
           THEN                                                         17780000
             CALL ROLBCAM_ERROR(NULL,'OTHER','#017');                   17790099
           ELSE                                                         17800000
             RCBBCA5_SUPPLY.EFFECTIVE_DATE =                            17810000
                      SUBSTR(DATE_AREA.WD_OUT_DATE,1,10);               17820000
         END;                                                           17830000
                                              /***********************/ 17840000
                                              /*      INDICATORS     */ 17850000
                                              /***********************/ 17860000
     RCBBCA5_SUPPLY.INDNULL(6)     = -1;      /* TYPE OF WARRANTY    */ 17870000
                                                      /* SOC RB01281 */ 17871000
     RCBBCA5_SUPPLY.INDNULL(13) = -1;                /* FLEXIBLE TOW */ 17872000
     RCBBCA5_SUPPLY.INDNULL(14) = -1;         /* FLEXIBLE SPILT DATE */ 17873000
                                                      /* EOC RB01281 */ 17874000
   END;                                                                 17880000
                                                                        17890000
 IF WRK_WAR_EXP_DATE ¬= ' '                                             17900000
 THEN DO;                                                               17910000
   IF WRK_WAR_EXP_DATE < WRK_ACT_INST_DATE                              17920000
   THEN                                                                 17930000
     DO;                                                                17940000
       RCBBCA5_SUPPLY.WARRANTY_EXP_DATE = WRK_ACT_INST_DATE;            17950000
     END;                                                               17960000
   ELSE                                                                 17970000
     DO;                                                                17980000
       RCBBCA5_SUPPLY.WARRANTY_EXP_DATE = WRK_WAR_EXP_DATE;             17990000
     END;                                                               18000000
 END;                                                                   18010000
 ELSE                                                                   18020000
   DO;                       /* CALCULATE WED USING MODULE RCB023M */   18030000
                             /* IF WARRANTY APPLIES                */   18040000
                                                 /* RC01116 */          18050000
     IF WRK_TYPE_OF_WAR = ' ' |        /* TYPE OF MAINTENANCE OR    */  18060000
        WRK_INVALID_TPWAR              /* INVALID TYPE OF WARRANTY  */  18070000
     THEN;                                                              18080000
     ELSE DO;                                                           18090000
                                                      /* SOC RC01190*/  18100000
       RCBBCA5_SUPPLY.WARRANTY_EXP_DATE =                               18110000
                                  RCBZ32S_STRUCTURE.INOUT.END_DATE;     18120000
                                                      /* EOC RC01190*/  18130000
     END;                                                               18140000
   END;                                                                 18150000
                                                                        18160000
 WRK_SAVE_WED            =  RCBBCA5_SUPPLY.WARRANTY_EXP_DATE;           18170000
 IF RCBBCA5_SUPPLY.WARRANTY_EXP_DATE = ''                               18180000
 THEN                                                                   18190000
   RCBBCA5_SUPPLY.INDNULL(8)     = 99;  /* WARRANTY EXP DATE *RC01190*/ 18200000
                                                                        18210000
                        /* IF  WARRANTY APPLIES                     */  18220000
                                                                        18230000
 WRK_WRITE_N_REC                 = 1;    /* WRITE 1 RECORD * RC01190 */ 18240000
                                                                        18250000
 IF RCBBCA5_SUPPLY.TYPE_OF_WARRANTY ¬= ''                               18260000
 THEN DO;                                                               18270000
   IF RCBBCA5_SUPPLY.WARRANTY_EXP_DATE < CHKP_AREA.CURR_DATE            18280000
   THEN                                                                 18290000
     DO;                                                                18300000
       WRK_SKIP_SUPPLY = TRUE;               /* INCORRECT SITUATION */  18310000
     END;                                                               18320000
   ELSE                                                                 18330000
     DO;                                                                18340000
       IF SWITCH_EMPTY_T690 = FALSE THEN             /* CEDS00000352 */ 18340100
        DO;                                          /* CEDS00000352 */ 18340200
       SWITCH_F_TOW = FALSE;                          /* SOC RB01281 */ 18341000
       SWITCH_F_SLC = FALSE;                                            18342000
       CALL ROLBCAM_RX11_RETRIEVE_FLEX_WARR;                            18343099
       IF SWITCH_F_TOW = TRUE            /* FLEXIBLE WARRANTY MACHINE*/ 18344000
       THEN                                                             18345000
         DO;                                                            18346000
           RCBBCA5_SUPPLY.F_TYPE_OF_WARRANTY = WRK_F_TOW;               18347000
           RCBBCA5_SUPPLY.INDNULL(13) = 99;                             18347100
           WRK_F_SPLT_DATE = ROLBCAM_CALC_DATE(                         18348099
                WRK_ACT_INST_DATE,'M',T690_ARRAY.A_B_W_MNTHS(I));       18349000
                                                 /* CEDS00000352 */     18349100
                                                        /*SOC RB01298*/ 18349200
        /* RCBBCA5_SUPPLY.F_SPLT_DATE = ROLBCAM_CALC_DATE(              18349399
                WRK_F_SPLT_DATE,'D',-1); */                             18349400
           RCBBCA5_SUPPLY.F_SPLT_DATE = WRK_F_SPLT_DATE /*EOC RB01298*/ 18349500
           RCBBCA5_SUPPLY.INDNULL(14) = 99;                             18349600
           IF (RCBBCA5_SUPPLY.F_SPLT_DATE <=     /* SOC CEDS00000345 */ 18349700
                                   RCBBCA5_SUPPLY.WARRANTY_EXP_DATE)    18349800
           THEN                                                         18349900
             DO;                                                        18350000
              RCBBCA5_SUPPLY.INDNULL(13) = 0;                           18350200
              RCBBCA5_SUPPLY.INDNULL(14) = 0;                           18350300
             END;                                                       18350400
           IF (T690_ARRAY.A_SLC(I) ¬= ''             /* CEDS00000352 */ 18351800
           & T690_ARRAY.A_SLC_NULLIND(I) ¬= 'FF'X  /* CEDS00000377 */   18351900
           & RCBBCA5_SUPPLY.F_SPLT_DATE <=                              18352000
               RCBBCA5_SUPPLY.WARRANTY_EXP_DATE)/* EOC CEDS00000345*/   18352100
           THEN                                                         18352200
             DO;                                                        18352300
               RCBBCA5_SUPPLY.SERVICE_LVL_CODE =                        18352400
                             T690_ARRAY.A_SLC(I);     /* CEDS00000352*/ 18352500
               RCBBCA5_SUPPLY.INDNULL(7) = 0;         /* CEDS00000347*/ 18352600
               SWITCH_F_SLC = TRUE;                                     18352700
               RCBBCA5_SUPPLY.SERVICE_LVL_CODE_2 =    /* SOC RB01298 */ 18352900
                    RCBBCA5_SUPPLY.SERVICE_LVL_CODE;  /* SLC IS MOVED   18353000
                                             TO SLC2 FOR A FW MACHINE*/ 18353100
               RCBBCA5_SUPPLY.INDNULL(15) = 0;        /* EOC RB01298 */ 18353500
             END;                                                       18353600
         END;                                                           18353700
       ELSE                       /* NOT A FLEXIBLE WARRANTY MACHINE */ 18353800
           DO;                                                          18353900
             RCBBCA5_SUPPLY.INDNULL(13) = 99;        /* FLEXIBLE TOW */ 18354000
             RCBBCA5_SUPPLY.INDNULL(14) = 99; /* FLEXIBLE SPILT DATE */ 18354100
             RCBBCA5_SUPPLY.INDNULL(15) = 99;             /* RB01298 */ 18354200
           END;                                                         18354300
       END;                                      /* SOC CEDS00000352 */ 18354400
       ELSE                                                             18354500
       DO;                                                              18354600
          RCBBCA5_SUPPLY.INDNULL(13) = 99;        /* FLEXIBLE TOW */    18354700
          RCBBCA5_SUPPLY.INDNULL(14) = 99; /* FLEXIBLE SPILT DATE */    18354800
          RCBBCA5_SUPPLY.INDNULL(15) = 99;                /* RB01298 */ 18354900
       END;                                                             18355000
     END;                                        /* EOC CEDS00000352 */ 18355100
                                                                        18355200
     IF(RCBBCA5_SUPPLY.F_SPLT_DATE >              /* SOC CEDS00000575 */18355300
               RCBBCA5_SUPPLY.WARRANTY_EXP_DATE) THEN                   18355400
     DO;                                                                18355500
          RCBBCA5_SUPPLY.F_SPLT_DATE        = '';                       18355700
          RCBBCA5_SUPPLY.F_TYPE_OF_WARRANTY = '';                       18355800
          RCBBCA5_SUPPLY.INDNULL(13)        = -1;                       18356000
          RCBBCA5_SUPPLY.INDNULL(14)        = -1;                       18356100
     END;                                         /* EOC CEDS00000575 */18356500
                                                                        18356600
       IF SWITCH_F_SLC = FALSE                                          18356700
       THEN                                                             18356800
         DO;                                           /* EOC RB01281*/ 18357000
           IF (OUTAREA.SERVICE_LVL_CODE_1 ¬= HIGH(3))/* SOC *RC01190 */ 18360000
              & (OUTAREA.SERVICE_LVL_CODE_1 ¬= '')                      18370000
           THEN                                                         18380000
             DO;                                                        18390000
               RCBBCA5_SUPPLY.SERVICE_LVL_CODE =                        18400000
                     RCBZ32S_STRUCTURE.OUTAREA.SERVICE_LVL_CODE_1;      18410000
             END;                                                       18420000
           ELSE                                                         18430000
             DO;                                                        18440000
               RCBBCA5_SUPPLY.SERVICE_LVL_CODE = '';                    18450000
               RCBBCA5_SUPPLY.INDNULL(7)       = -1;                    18460000
             END;                                                       18470000
         END;                                             /* RB01281 */ 18471000
                                                                        18480000
       RCBBCA5_SUPPLY.END_DATE = RCBZ32S_STRUCTURE.OUTAREA.END_DATE_1;  18490000
                                                                        18500000
       IF RCBZ32S_STRUCTURE.OUTAREA.SERVICE_LVL_CODE_2 ¬= HIGH(3)       18510000
       THEN                                     /* SPLIT WARRANTY */    18520000
         DO;                                                            18530000
           IF CHKP_AREA.CURR_DATE < OUTAREA.START_DATE_2                18540000
           THEN WRK_WRITE_N_REC = 2;                                    18550000
           ELSE                            /* INVALID SPLIT DATE  */    18560000
             DO;                                                        18570000
               RCBBCA5_SUPPLY.END_DATE         =                        18580000
                         RCBZ32S_STRUCTURE.INOUT.END_DATE;              18590000
               RCBBCA5_SUPPLY.SERVICE_LVL_CODE =                        18600000
                         RCBZ32S_STRUCTURE.OUTAREA.SERVICE_LVL_CODE_2;  18610000
             END;                                                       18620000
                                                                        18630000
         END;                                                           18640000
                                                     /* EOC *RC01190 */ 18650000
     END;                                                               18660000
                                                                        18661000
                                                                        18680000
 IF ¬WRK_SKIP_SUPPLY                                                    18690000
 THEN                                                                   18700000
   DO;                                                                  18710000
     DO WRK_COUNT = 1 TO WRK_WRITE_N_REC;                   /*RC01190*/ 18720000
       CALL PLITDLI(THREE,ISRT,PTR_RCBBCA5,RCBBCA5_REC);                18730000
       IF PCB_RCBBCA5.ST_CODE ¬= '  '                                   18740000
       THEN                                                             18750000
         CALL ROLBCAM_ERROR(PTR_RCBBCA5,'IMS_DB','#018');               18760099
                                                                        18770000
       CHKP_AREA.CNT_CTRY.RCBBCA5 = CHKP_AREA.CNT_CTRY.RCBBCA5 + 1;     18780000
                                                                        18790000
       WRK_HASH_FIELD = SUBSTR(RCBBCA5_SUPPLY.SEQUENCE_NUMBER,3,4);     18800000
                                                                        18810000
       CALL RCB018M(WRK_HASH_FIELD,                                     18820000
                    CHKP_AREA.CNT_HASH_TOTAL.RCBBCA5,                   18830000
                    PTR_INT_AREA);                                      18840000
                                                                        18850000
       CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                             18860000
                                                      /* SOC *RC01190*/ 18870000
       IF WRK_WRITE_N_REC = 2                                           18880000
       THEN                                                             18890000
         DO;                                                            18900000
           RCBBCA5_SUPPLY.END_DATE         =                            18910000
                          RCBZ32S_STRUCTURE.INOUT.END_DATE;             18920000
           RCBBCA5_SUPPLY.EFFECTIVE_DATE   =                            18930000
                          RCBZ32S_STRUCTURE.OUTAREA.START_DATE_2;       18940000
           RCBBCA5_SUPPLY.SERVICE_LVL_CODE =                            18950000
                          RCBZ32S_STRUCTURE.OUTAREA.SERVICE_LVL_CODE_2; 18960000
         END;                                                           18970000
       END;                                                             18980000
                                                      /* EOC *RC01190*/ 18990000
    END;                                                                19000000
                                                                        19010000
 END ROLBCAM_R056_WRITE_SUPPLY_CTR;                                     19020099
1/********************************************************************/ 19030000
 /*      CREATE A DUMMY RCBT0220 RECORD (2)                          */ 19040000
 /*                                                                  */ 19050000
 /*         (1)           (2)                                        */ 19060000
 /*      |------| |----------------->                                */ 19070000
 /*           WED WED + 1           OPEN                             */ 19080000
 /*                                                                  */ 19090000
 /*                                                                  */ 19100000
 /*      RECORD (1) HAS BEEN CREATED ABOVE AND INDICATES WARRANTY.   */ 19110000
 /*      AFTER THIS PERIOD A DUMMY RECORD MUST BECOME ACTIVE.        */ 19120000
 /*                                                                  */ 19130000
 /*      TO INDICATE TO THE COMPARE MODULE THAT THIS IS A DUMMY FROM */ 19140000
 /*      AAS TYPE_OF_WAR WILL BE FILLED WITH LOW VALUE               */ 19150000
 /*                                                                  */ 19160000
 /********************************************************************/ 19170000
0ROLBCAM_R057_WR_DUM_SUP_CTR : PROC;                                    19180099
                                                                        19190000
0DATE_AREA                = '';                                         19200000
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      19210000
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      19220000
 DATE_AREA.WD_FUNCTION    = 'C';                                        19230000
 DATE_AREA.WD_PERIOD_TYPE = 'D';                                        19240000
 DATE_AREA.WD_PERIOD      =  +1;                                        19250000
 DATE_AREA.WD_IN_DATE     = WRK_SAVE_WED;                               19260000
                                                                        19270000
 CALL RCB004M (PTR_DATE_AREA);                                          19280000
 IF DATE_AREA.WD_STATUS ¬= ' '                                          19290000
 THEN                                                                   19300000
   DO;                                                                  19310000
     PARM_INT_AREA.MSG_VAR_CODES   = '';                                19320000
     PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                              19330000
     PARM_INT_AREA.MESSAGE_NUMBER  = '0012';                            19340000
     PARM_INT_AREA.MSG_VAR_CODE_6  = 'DT';                              19350000
     PARM_INT_AREA.MSG_VAR_VALUE_6 = WRK_SAVE_WED;                      19360000
     PARM_INT_AREA.MSG_VAR_CODE_7  = 'DN';                              19370000
     PARM_INT_AREA.MSG_VAR_VALUE_7 = 'WED + 1';                         19380000
     PARM_INT_AREA.MSG_VAR_CODE_8  = 'RC';                              19390000
     PARM_INT_AREA.MSG_VAR_VALUE_8 = DATE_AREA.WD_STATUS;               19400000
     CALL RCB0M1M (PTR_INT_AREA);                                       19410000
     CALL ROLBCAM_ERROR (NULL,'OTHER','#019');                          19420099
   END;                                                                 19430000
                                                                        19440000
 RCBBCA5_REC                      = '';                                 19450000
 RCBBCA5_SUPPLY.INDNULL(*)        = 0;                                  19460000
 RCBBCA5_SUPPLY.REC_TYPE          = '02';                               19470000
 RCBBCA5_SUPPLY.CTRYNO            = CHKP_AREA.COUNTRY;                  19480000
 RCBBCA5_SUPPLY.PGR_TYPE          = CHKP_AREA.PGR_RUN_TYPE;             19490000
 RCBBCA5_SUPPLY.RUN_DATE          = CHKP_AREA.CURR_DATE;                19500000
                                                                        19510000
 RCBBCA5_SUPPLY.PRODUCT_TYPE      = DB_MACH_INV.CMAXA;                  19520000
                                                        /*SOC RB01320 */19521000
 IF WRK_T125_FOUND = 'Y'                                                19522000
 THEN                                                                   19523000
 DO;                                                                    19524000
 RCBBCA5_SUPPLY.ORIGIN          =                                       19525000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     19526000
 RCBBCA5_SUPPLY.SEQUENCE_NUMBER =                                       19527000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    19528000
 END;                                                                   19529000
 ELSE                                                                   19529100
 DO;                                                     /*EOC RB01320*/19529200
 RCBBCA5_SUPPLY.ORIGIN            = SUBSTR(DB_MACH_INV.RMAXA,1,2);      19530000
 RCBBCA5_SUPPLY.SEQUENCE_NUMBER   = '00'||SUBSTR(DB_MACH_INV.RMAXA,3,5);19540000
 END;                                                        /*RB01320*/19541000
 RCBBCA5_SUPPLY.COUNTRY_NUMBER    = CHKP_AREA.COUNTRY;                  19550000
 RCBBCA5_SUPPLY.TYPE_OF_WARRANTY  = LOW(1);                             19560000
 RCBBCA5_SUPPLY.WARRANTY_EXP_DATE = WRK_SAVE_WED;                       19570000
 RCBBCA5_SUPPLY.EFFECTIVE_DATE    = SUBSTR(DATE_AREA.WD_OUT_DATE,1,10); 19580000
                                              /***********************/ 19590000
                                              /*  NULL INDICATOR     */ 19600000
                                              /***********************/ 19610000
 RCBBCA5_SUPPLY.INDNULL(5)        = -1;       /* TYPE OF MAINTENANCE */ 19620000
                                                      /* SOC RB01281 */ 19621000
 RCBBCA5_SUPPLY.INDNULL(13)       = -1;              /* FLEXIBLE TOW */ 19622000
 RCBBCA5_SUPPLY.INDNULL(14)       = -1;       /* FLEXIBLE SPLIT DATE */ 19623000
                                                      /* EOC RB01281 */ 19624000
 RCBBCA5_SUPPLY.INDNULL(15)       = -1;                   /* RB01298 */ 19625000
                                                   /* HARDBUNDLE SLC */ 19626000
 IF (OUTAREA.SERVICE_LVL_CODE_C ¬= HIGH(3)) &                           19630000
    (OUTAREA.SERVICE_LVL_CODE_C ¬= '')                                  19640000
 THEN                                                                   19650000
   DO;                                                                  19660000
     RCBBCA5_SUPPLY.SERVICE_LVL_CODE =                                  19670000
                 RCBZ32S_STRUCTURE.OUTAREA.SERVICE_LVL_CODE_C;          19680000
     RCBBCA5_SUPPLY.INDNULL(7)    = 0;   /* SLC         *RC01190*/      19690000
   END;                                                                 19700000
 ELSE                                                                   19710000
     RCBBCA5_SUPPLY.INDNULL(7)    = -1;  /* SLC         *RC01190*/      19720000
                                                                        19730000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA5,RCBBCA5_REC);                      19740000
 IF PCB_RCBBCA5.ST_CODE ¬= '  '                                         19750000
 THEN                                                                   19760000
   CALL ROLBCAM_ERROR(PTR_RCBBCA5,'IMS_DB','#020');                     19770099
                                                                        19780000
 CHKP_AREA.CNT_CTRY.RCBBCA5 = CHKP_AREA.CNT_CTRY.RCBBCA5 + 1;           19790000
                                                                        19800000
 WRK_HASH_FIELD = SUBSTR(RCBBCA5_SUPPLY.SEQUENCE_NUMBER,3,4);           19810000
                                                                        19820000
 CALL RCB018M(WRK_HASH_FIELD,                                           19830000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA5,                         19840000
              PTR_INT_AREA);                                            19850000
                                                                        19860000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   19870000
                                                                        19880000
0END ROLBCAM_R057_WR_DUM_SUP_CTR;                                       19890099
1/********************************************************************/ 19900000
 /*                                                                  */ 19910000
 /* MODULE NAME      : WRITE_REAL_DI                                 */ 19920000
 /*                                                                  */ 19930000
 /* DESCRIPTION      : WRITE HW REALIZATION RECORD RCBBCA8 FROM DI   */ 19940000
 /*                                                                  */ 19950000
 /********************************************************************/ 19960000
0ROLBCAM_R058_WRITE_REAL_DI: PROC;                                      19970099
                                                                        19980000
 RCBBCA8_REC                     = '';                                  19990000
 RCBBCA8_HW_REAL.INDNULL(*)      = 0;                                   20000000
 RCBBCA8_HW_REAL.REC_TYPE        = '02';                                20010000
 RCBBCA8_HW_REAL.CTRYNO          = CHKP_AREA.COUNTRY;                   20020000
 RCBBCA8_HW_REAL.PGR_TYPE        = CHKP_AREA.PGR_RUN_TYPE;              20030000
 RCBBCA8_HW_REAL.RUN_DATE        = CHKP_AREA.CURR_DATE;                 20040000
                                                                        20050000
 RCBBCA8_HW_REAL.PRODUCT_TYPE    = DB_MACH_INV.CMAXA;                   20060000
                                                        /*SOC RB01320 */20061000
 IF WRK_T125_FOUND = 'Y'                                                20062000
 THEN                                                                   20063000
 DO;                                                                    20064000
 RCBBCA8_HW_REAL.ORIGIN          =                                      20065000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,1,2);     20066000
 RCBBCA8_HW_REAL.SEQUENCE_NUMBER =                                      20067000
                         SUBSTR(TB_RCBV125.REAL_SERIAL_NUMBER,3,28);    20068000
 END;                                                                   20069000
 ELSE                                                                   20069100
 DO;                                                     /*EOC RB01320*/20069200
 RCBBCA8_HW_REAL.ORIGIN          = SUBSTR(DB_MACH_INV.RMAXA,1,2);       20070000
 RCBBCA8_HW_REAL.SEQUENCE_NUMBER = '00'||SUBSTR(DB_MACH_INV.RMAXA,3,5); 20080000
 END;                                                        /*RB01320*/20081000
 RCBBCA8_HW_REAL.MODEL_NUMBER    = DB_MACH_INV.CMMXA;                   20090000
 RCBBCA8_HW_REAL.COUNTRY_NUMBER  = CHKP_AREA.COUNTRY;                   20100000
 RCBBCA8_HW_REAL.EFFECTIVE_DATE  = ' ';                                 20110000
 RCBBCA8_HW_REAL.END_DATE        = ' ';                                 20120000
                                                                        20130000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA8,RCBBCA8_REC);                      20140000
 IF PCB_RCBBCA8.ST_CODE ¬= '  '                                         20150000
 THEN                                                                   20160000
   CALL ROLBCAM_ERROR(PTR_RCBBCA8,'IMS_DB','#021');                     20170099
                                                                        20180000
 CHKP_AREA.CNT_CTRY.RCBBCA8 = CHKP_AREA.CNT_CTRY.RCBBCA8 + 1;           20190000
                                                                        20200000
 WRK_HASH_FIELD = SUBSTR(RCBBCA8_HW_REAL.SEQUENCE_NUMBER,3,4);          20210000
                                                                        20220000
 CALL RCB018M(WRK_HASH_FIELD,                                           20230000
              CHKP_AREA.CNT_HASH_TOTAL.RCBBCA8,                         20240000
              PTR_INT_AREA);                                            20250000
                                                                        20260000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   20270000
                                                                        20280000
 END ROLBCAM_R058_WRITE_REAL_DI;                                        20290099
1/********************************************************************/ 20300000
 /*                                                                  */ 20310000
 /* MODULE NAME      : PROCESS_FEATURES                              */ 20320000
 /*                                                                  */ 20330000
 /* DESCRIPTION      : PROCESS FEATURE RECORDS FROM RBDGDF0          */ 20340000
 /*                                                                  */ 20350000
 /********************************************************************/ 20360000
0ROLBCAM_R059_PROCESS_FEATURES: PROC;                                   20370099
                                                                        20380000
 /* READ FIRST FEATURE RECORD */                                        20390000
 CHKP_AREA.SWITCH_END_DF = FALSE;                                       20400000
 SSA_RRDDF1.CTRYNO1 = DB_MACH_INV.GCYAA;         /* COUNTRY NUMBER */   20410000
 SSA_RRDDF1.CMAXA1  = DB_MACH_INV.CMAXA;         /* MACHINE TYPE   */   20420000
 SSA_RRDDF1.RMAXA1  = DB_MACH_INV.RMAXA;         /* SERIAL NUMBER  */   20430000
 SSA_RRDDF1.CTRYNO2 = DB_MACH_INV.GCYAA;         /* COUNTRY NUMBER */   20440000
 SSA_RRDDF1.CMAXA2  = DB_MACH_INV.CMAXA;         /* MACHINE TYPE   */   20450000
 SSA_RRDDF1.RMAXA2  = DB_MACH_INV.RMAXA;         /* SERIAL NUMBER  */   20460000
 WRK_FUNC = GU;                                                         20470000
 CALL ROLBCAM_R031_READ_FEATURE;                                        20480099
                                                                        20490000
 /* PROCESS FEATURE RECORDS */                                          20500000
 WRK_FUNC = GN;                                                         20510000
 DO WHILE (¬CHKP_AREA.SWITCH_END_DF);                                   20520000
                                                                        20530000
   /* CHECK FEATURE/RPQ CODE */                                         20540000
   FEAT_AREA.FEATURE_RPQ_IN = STRING(DB_MACH_FEAT.YFTXA);               20550000
   FEAT_AREA.COUNTRY_IN     = SUBSTR(DB_MACH_FEAT.GCYAA,2,3);           20560000
   CALL RCB007M(PTR_FEAT_AREA,PTR_INT_AREA);                            20570000
                                                                        20580000
   /* READ ALL RECORDS OF SAME FEATURE/RPQ */                           20590000
   CALL ROLBCAM_R032_SKIP_FEATURE;                                      20600099
                                                                        20610000
   IF CHKP_AREA.CNT_CTRY.FEATURES > 0 & FEAT_AREA.SWITCH_FEAT_VALID     20620000
   THEN                                                                 20630000
     DO;                                                                20640000
       CALL ROLBCAM_R033_WRITE_FEAT;                                    20650099
       CHKP_AREA.CNT_CTRY.PROC_DF =                                     20660000
            CHKP_AREA.CNT_CTRY.PROC_DF + CHKP_AREA.CNT_CTRY.FEATURES;   20670000
     END;                                                               20680000
   ELSE                                                                 20690000
     CHKP_AREA.CNT_CTRY.SKIP_DF =                                       20700000
                                                /* SOC CEDS00000373 */  20701000
       /* CHKP_AREA.CNT_CTRY.SKIP_DF + CHKP_AREA.CNT_CTRY.FEATURES; */  20702000
          CHKP_AREA.CNT_CTRY.SKIP_DF + CHKP_AREA.CNT_CTRY.FEATURES      20703000
                            + FEATURE_OVERFLOW_CNT;                     20704000
                                                /* EOC CEDS00000373 */  20705000
 END;                                                                   20730000
                                                                        20740000
 END ROLBCAM_R059_PROCESS_FEATURES;                                     20750099
1/********************************************************************/ 20760000
 /*                                                                  */ 20770000
 /* MODULE NAME      : ROLBCAM_R064_HANDLE_RCB023M                   */ 20780099
 /*                                                                  */ 20790000
 /* DESCRIPTION      : DETERMINE WARRANTY CONDITIONS VIA PROGRAM     */ 20800000
 /*                    RCB023M                                       */ 20810000
 /*                                                          *RC01190*/ 20820000
 /********************************************************************/ 20830000
 ROLBCAM_R064_HANDLE_RCB023M: PROC;                                     20840099
                                                                        20850000
 RCBZ32S_STRUCTURE                        = '';                         20860000
 RCBZ32S_STRUCTURE.INAREA.COUNTRY_NUMBER  = CHKP_AREA.COUNTRY;          20870000
 RCBZ32S_STRUCTURE.INAREA.PRODUCT_TYPE    = DB_MACH_INV.CMAXA;          20880000
 RCBZ32S_STRUCTURE.INAREA.MODEL           = DB_MACH_INV.CMMXA;          20890000
 RCBZ32S_STRUCTURE.INAREA.EFFECTIVE_DATE  = WRK_ACT_INST_DATE;          20900000
 RCBZ32S_STRUCTURE.INOUT.TYPE_OF_WARRANTY = DB_MACH_INV.CMCXB;          20910000
 SELECT;                                                                20920000
   WHEN(WRK_ACT_INST_DATE ¬= '' &                                       20930000
        WRK_WAR_EXP_DATE  ¬= '' &                                       20940000
        WRK_ACT_INST_DATE > WRK_WAR_EXP_DATE)                           20950000
     DO;                                                                20960000
       RCBZ32S_STRUCTURE.INOUT.END_DATE = WRK_ACT_INST_DATE;            20970000
     END;                                                               20980000
   WHEN(WRK_ACT_INST_DATE ¬= '' &                                       20990000
        WRK_WAR_EXP_DATE  ¬= '' &                                       21000000
        WRK_ACT_INST_DATE < WRK_WAR_EXP_DATE)                           21010000
     DO;                                                                21020000
       RCBZ32S_STRUCTURE.INOUT.END_DATE = WRK_WAR_EXP_DATE;             21030000
     END;                                                               21040000
   WHEN(WRK_ACT_INST_DATE ¬= '')                                        21050000
     DO;                                                                21060000
       RCBZ32S_STRUCTURE.INOUT.END_DATE = WRK_ACT_INST_DATE;            21070000
     END;                                                               21080000
   WHEN(WRK_WAR_EXP_DATE ¬= '')                                         21090000
     DO;                                                                21100000
       RCBZ32S_STRUCTURE.INOUT.END_DATE = WRK_WAR_EXP_DATE;             21110000
     END;                                                               21120000
   OTHERWISE RCBZ32S_STRUCTURE.INOUT.END_DATE = '';                     21130000
 END;                                                                   21140000
                                                                        21150000
 CALL RCB023M (ADDR(RCBZ32S_STRUCTURE),PTR_INT_AREA);                   21160000
                                                                        21170000
 END ROLBCAM_R064_HANDLE_RCB023M;                                       21180099
1/********************************************************************/ 21190000
 /*                                                                  */ 21200000
 /* MODULE NAME      : PROCESS_CAPACITY_DI                           */ 21210000
 /*                                                                  */ 21220000
 /* DESCRIPTION      : PROCESS CAPACITY RECORD FROM RBDGDC0          */ 21230000
 /*                                                                  */ 21240000
 /********************************************************************/ 21250000
0ROLBCAM_R05A_PROCESS_CAP_DI: PROC;                                     21260099
                                                                        21270000
                                /* READ FIRST CAPACITY CHANGE RECORD */ 21280000
 SSA_RRDDC1.CTRYNO = DB_MACH_INV.GCYAA;            /* COUNTRY NUMBER */ 21290000
 SSA_RRDDC1.RORXA  = DB_MACH_INV.RORXD;            /* ORDER REF. NBR.*/ 21300000
 SSA_RRDDC1.CSTXA  = DB_MACH_INV.CSTXD;            /* OEI STATUS     */ 21310000
 CHKP_AREA.SWITCH_END_DC = FALSE;                                       21320000
 CALL ROLBCAM_R034_READ_CAPACITY;                                       21330099
                                                                        21340000
 /* PROCESS ALL CAPACITY CHANGE RECORDS */                              21350000
 DO WHILE (¬CHKP_AREA.SWITCH_END_DC);                                   21360000
                                                                        21370000
   CALL ROLBCAM_R035_WRITE_MES;                                         21380099
   CALL ROLBCAM_R037_WRITE_MES_HW;                                      21390099
   CHKP_AREA.CNT_CTRY.PROC_DC = CHKP_AREA.CNT_CTRY.PROC_DC + 1;         21400000
                                                                        21410000
   IF DB_MACH_CAP.RORXD ¬= ' ' & DB_MACH_CAP.CSTXD ¬= ' '               21420000
   THEN                                                                 21430000
     DO;                                                                21440000
       SSA_RRDDC1.RORXA = DB_MACH_CAP.RORXD;                            21450000
       SSA_RRDDC1.CSTXA = DB_MACH_CAP.CSTXD;                            21460000
       CALL ROLBCAM_R034_READ_CAPACITY;                                 21470099
     END;                                                               21480000
   ELSE                                                                 21490000
     CHKP_AREA.SWITCH_END_DC = TRUE;                                    21500000
                                                                        21510000
 END;                                                                   21520000
                                                                        21530000
 END ROLBCAM_R05A_PROCESS_CAP_DI;                                       21540099
1/********************************************************************/ 21550000
 /*                                                                  */ 21560000
 /* MODULE NAME      : PROCESS_DI_RECORD                             */ 21570000
 /*                                                                  */ 21580000
 /* DESCRIPTION      : PROCESS HW PRODUCT RECORD FROM RBDGDI0        */ 21590000
 /*                                                                  */ 21600000
 /********************************************************************/ 21610000
0ROLBCAM_R060_PROCESS_DI_RECORD: PROC;                                  21620099
                                                                        21630000
                                      /*******************************/ 21640000
                                      /*    CHECK DATES              */ 21650000
                                      /*******************************/ 21660000
 WRK_WAR_EXP_DATE = ' ';                                                21670000
 IF DB_MACH_INV.DVWAC ¬= 0             /* WARRANTY EXPIRY DATE     */   21680000
 THEN                                                                   21690000
   CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_INV.DVWAC,                      21700099
                           WRK_WAR_EXP_DATE,                            21710000
                           WRK_RBDGDI0,                                 21720000
                           'DVWAC',                                     21730000
                           DB_MACH_INV.GCYAA||'/'||DB_MACH_INV.CMAXA    21740000
                           ||'/'||DB_MACH_INV.RMAXA);                   21750000
                                                                        21760000
 WRK_RENT_STOP_DATE = ' ';                                              21770000
 IF DB_MACH_INV.DVOXT ¬= 0             /* RENTAL STOP DATE         */   21780000
 THEN                                                                   21790000
   CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_INV.DVOXT,                      21800099
                           WRK_RENT_STOP_DATE,                          21810000
                           WRK_RBDGDI0,                                 21820000
                           'DVOXT',                                     21830000
                           DB_MACH_INV.GCYAA||'/'||DB_MACH_INV.CMAXA    21840000
                           ||'/'||DB_MACH_INV.RMAXA);                   21850000
                                                                        21860000
 WRK_ACT_INST_DATE = ' ';                                               21870000
 IF DB_MACH_INV.DVNXC ¬= 0             /* ACTUAL INSTALLATION DATE */   21880000
 THEN                                                                   21890000
   CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_INV.DVNXC,                      21900099
                           WRK_ACT_INST_DATE,                           21910000
                           WRK_RBDGDI0,                                 21920000
                           'DVNXC',                                     21930000
                           DB_MACH_INV.GCYAA||'/'||DB_MACH_INV.CMAXA    21940000
                           ||'/'||DB_MACH_INV.RMAXA);                   21950000
                                                                        21960000
                                       /* RETRIEVE MACHINE REMOVAL */   21970000
 DB_MACH_REM = '';                                                      21980000
 WRK_SCHED_REM_DATE = ' ';                                              21990000
 IF DB_MACH_INV.RORXH ¬= ' '           /* REMOVAL ORDER LINKED     */   22000000
 THEN                                                                   22010000
   CALL ROLBCAM_R050_PROCESS_REMOVAL_DI;                                22020099
                                                                        22030000
                    /* CONSTRUCT RECORDS DI/DR-ONLY RELATED TABLES */   22040000
 CALL ROLBCAM_R051_WRITE_HW_DI;        /* HW PRODUCT               */   22050099
 CALL ROLBCAM_R052_WRITE_HW_MOD;       /* HW MODIFIABLE INFORMATION*/   22060099
 CALL ROLBCAM_R053_WRITE_HW_STATUS;    /* HW STATUS                */   22070099
 CALL ROLBCAM_R054_WRITE_OU_HW;        /* OU/HW PRODUCT RELATION   */   22080099
 CALL ROLBCAM_R055_WRITE_HW_CUST;      /* HW/CUSTOMER RELATIONS    */   22090099
                                                      /* SOC *RC01190*/ 22100000
 CALL ROLBCAM_R064_HANDLE_RCB023M;     /* GET WARRANTY CONDITIONS  */   22110099
                                                      /* EOC *RC01190*/ 22120000
 CALL ROLBCAM_R056_WRITE_SUPPLY_CTR;   /* SUPPLY CONTRACT          */   22130099
                                                                        22140000
 IF RCBBCA5_SUPPLY.TYPE_OF_WARRANTY ¬= '' /* IF WARRANTY THEN      */   22150000
 THEN                                     /* CONSTRUCT AND WRITE A */   22160000
   CALL ROLBCAM_R057_WR_DUM_SUP_CTR;      /* DUMMY SUPPLY CONTRACT */   22170099
                                                                        22180000
 CALL ROLBCAM_R058_WRITE_REAL_DI;      /* HW PO REALIZATION        */   22190099
                                                                        22200000
                                  /*              RETRIEVE FEATURES */  22210000
 IF DB_MACH_INV.CIDGU &                /* FEATURE LINKED INDICATOR */   22220000
    CHKP_AREA.SWITCH_STORE_FEAT        /* COUNTRY STORES FEATURES  */   22230000
 THEN                                                                   22240000
   CALL ROLBCAM_R059_PROCESS_FEATURES;                                  22250099
                                                                        22260000
                                  /*     RETRIEVE CAPACITY CHANGES */   22270000
 IF DB_MACH_INV.RORXD ¬= ' ' &         /* CAPACITY CHANGE LINKED   */   22280000
    DB_MACH_INV.CSTXD ¬= ' '           /* VIA ORDERNBR. & STATUS   */   22290000
 THEN                                                                   22300000
   CALL ROLBCAM_R05A_PROCESS_CAP_DI;                                    22310099
                                                                        22320000
 END ROLBCAM_R060_PROCESS_DI_RECORD;                                    22330099
1/********************************************************************/ 22340000
 /*                                                                  */ 22350000
 /* MODULE NAME      : PROCESS_DO_RECORD                             */ 22360000
 /*                                                                  */ 22370000
 /* DESCRIPTION      : PROCESS HW PRODUCT RECORD FROM RBDGDO0        */ 22380000
 /*                                                                  */ 22390000
 /********************************************************************/ 22400000
0ROLBCAM_R061_PROCESS_DO_RECORD: PROC;                                  22410099
                                                                        22420000
                                     /********************************/ 22430000
                                      /* CHECK/CONVERT CURRENT DATES */ 22440000
                                     /********************************/ 22450000
   CALL RCB000M(DB_MACH_ORD.DVLXB,                  /* MODULO CHECK  */ 22460000
                DB_MACH_ORD.DVKXA,                                      22470000
                DB_MACH_ORD.DVLXB,                                      22480000
                PTR_INT_AREA);                                          22490000
                                      /* SCHEDULED COMPLETION DATE   */ 22500000
   WRK_SCHED_COMPL_DATE = ' ';                                          22510000
                                                                        22511000
   CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_ORD.DVLXB,                      22520099
                           WRK_SCHED_COMPL_DATE,                        22530000
                           WRK_RBDGDO0,                                 22540000
                           'DVLXB',                                     22550000
                                                 /* SOC CEDS00000592 */ 22551000
  /*                       DB_MACH_CAP.GCYAA||'/'||DB_MACH_CAP.RORXA);*/22552000
                           DB_MACH_ORD.GCYAA||'/'||DB_MACH_ORD.RORXA);  22553000
                                                 /* EOC CEDS00000592 */ 22554000
                                                                        22570000
                                         /* ORIGINAL ORDER DATE      */ 22580000
   WRK_ORIG_ORD_DATE = ' ';                                             22590000
   CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_ORD.DVCXH,                      22600099
                           WRK_ORIG_ORD_DATE,                           22610000
                           WRK_RBDGDO0,                                 22620000
                           'DVCXH',                                     22630000
                           DB_MACH_ORD.GCYAA||'/'||DB_MACH_ORD.RORXA);  22640000
                                                                        22650000
                                       /* CUSTOMER REQ. ARRIVAL DATE */ 22660000
   WRK_CUST_ARR_DATE= ' ';                                              22670000
   CALL ROLBCAM_RX04_CHECK_DATE(DB_MACH_ORD.DVKXA,                      22680099
                           WRK_CUST_ARR_DATE,                           22690000
                           WRK_RBDGDO0,                                 22700000
                           'DVKXA',                                     22710000
                           DB_MACH_ORD.GCYAA||'/'||DB_MACH_ORD.RORXA);  22720000
                                                                        22730000
                                         /* RETRIEVE MACHINE REMOVAL */ 22740000
   DB_MACH_REM = '';                                                    22750000
   WRK_SCHED_REM_DATE = ' ';                                            22760000
   IF DB_MACH_ORD.RORXK ¬= ' '           /* REMOVAL ORDER LINKED     */ 22770000
   THEN                                                                 22780000
     CALL ROLBCAM_R040_PROCESS_REMOVAL_DO;                              22790099
                                                                        22800000
                      /* CONSTRUCT RECORDS DO/DR-ONLY RELATED TABLES */ 22810000
   CALL ROLBCAM_R041_WRITE_HW_IN_ORD_DO;      /* HW PO IN ORDER      */ 22820099
                                                                        22830000
                               /* HW PRODUCT AND REALIZATION RECORD */  22840000
                               /*      ONLY IF PRODUCT SERIALIZED   */  22850000
                                                      /* SOC RC01329 */ 22851000
   /*IF VERIFY(SUBSTR(DB_MACH_ORD.RMAXA,1,2),WRK_NUMERIC) = 0 */        22852000
   IF VERIFY(DB_MACH_ORD.RMAXA,WRK_ALPHANUMERIC) = 0                    22860000
                                                      /* EOC RC01329 */ 22861000
   THEN                                                                 22870000
     DO;                                                                22880000
       CALL ROLBCAM_R042_WRITE_HW_DO;         /* HW PRODUCT          */ 22890099
       CALL ROLBCAM_R043_WRITE_REAL_DO;       /* HW PO REALIZATION   */ 22900099
     END;                                                               22910000
                                                                        22920000
                                   /*      RETRIEVE CAPACITY CHANGES */ 22930000
   IF DB_MACH_ORD.RORXD ¬= ' ' &         /* CAPACITY CHANGE LINKED   */ 22940000
      DB_MACH_ORD.CSTXD ¬= ' '           /* VIA ORDERNBR. & STATUS   */ 22950000
   THEN                                                                 22960000
     CALL ROLBCAM_R044_PROCESS_CAP_DO;                                  22970099
                                                                        22980000
 END ROLBCAM_R061_PROCESS_DO_RECORD;                                    22990099
1/****************************************************************** */ 23000000
 /*                                                                  */ 23010000
 /* MODULE NAME      : CUF_EXIT_DI                                   */ 23020000
 /*                                                                  */ 23030000
 /* DESCRIPTION      : CALL TO USER EXIT FOR CUF PROCESSING          */ 23040000
 /*                                                                  */ 23050000
 /****************************************************************** */ 23060000
0ROLBCAM_R062_CUF_EXIT_DI : PROC;                                       23070099
 WRK_OU_CODE           = STRING(DB_MACH_INV.RLCXC);                     23080000
 IF CHKP_AREA.SWITCH_CUF_DI = TRUE                                      23090000
 THEN                                                                   23100000
   DO;                                                                  23110000
     DB_MACH_INV_COPY      = DB_MACH_INV;                               23120000
     WRK_OU_CODE_EXIT      = '';                                        23130000
     CALL RCBBC1U (ADDR(SWITCH_CUF_EXIT_DI),                            23140000
                   ADDR(DB_MACH_INV_COPY),                              23150000
                   ADDR(WRK_OU_CODE),                                   23160000
                   ADDR(WRK_OU_CODE_EXIT),                              23170000
                   PTR_INT_AREA);                                       23180000
     IF WRK_OU_CODE_EXIT ¬= ''                                          23190000
     THEN                                                               23200000
       WRK_OU_CODE = WRK_OU_CODE_EXIT;                                  23210000
     CHKP_AREA.SWITCH_CUF_DI   = SWITCH_CUF_EXIT_DI;                    23220000
   END;                                                                 23230000
 END ROLBCAM_R062_CUF_EXIT_DI;                                          23240099
1/****************************************************************** */ 23250000
 /*                                                                  */ 23260000
 /* MODULE NAME      : CUF_EXIT_DO                                   */ 23270000
 /*                                                                  */ 23280000
 /* DESCRIPTION      : CALL TO USER EXIT FOR CUF PROCESSING          */ 23290000
 /*                                                                  */ 23300000
 /****************************************************************** */ 23310000
0ROLBCAM_R063_CUF_EXIT_DO : PROC;                                       23320099
 WRK_OU_CODE           = STRING(DB_MACH_ORD.RLCXC);                     23330000
 IF CHKP_AREA.SWITCH_CUF_DO = TRUE                                      23340000
 THEN                                                                   23350000
   DO;                                                                  23360000
     DB_MACH_ORD_COPY      = DB_MACH_ORD;                               23370000
     WRK_OU_CODE_EXIT      = '';                                        23380000
     CALL RCBBC2U (ADDR(SWITCH_CUF_EXIT_DO),                            23390000
                   ADDR(DB_MACH_ORD_COPY),                              23400000
                   ADDR(WRK_OU_CODE),                                   23410000
                   ADDR(WRK_OU_CODE_EXIT),                              23420000
                   PTR_INT_AREA);                                       23430000
     IF WRK_OU_CODE_EXIT ¬= ''                                          23440000
     THEN                                                               23450000
       WRK_OU_CODE = WRK_OU_CODE_EXIT;                                  23460000
     CHKP_AREA.SWITCH_CUF_DO  = SWITCH_CUF_EXIT_DO;                     23470000
   END;                                                                 23480000
 END ROLBCAM_R063_CUF_EXIT_DO;                                          23490099
                                                      /* SOC RC01323 */ 23490100
1/****************************************************************** */ 23490200
 /*                                                                  */ 23490300
 /* MODULE NAME      : ROLBCAM_R065_RSSPRODUCT_WANTED                */ 23490499
 /*                                                                  */ 23490500
 /* DESCRIPTION      : FIND OUT WHETHER THE PRODUCT IN THE RECORD    */ 23490600
 /*                    IS A PRODUCT THAT MEETS THE RSS (TRURO)       */ 23490700
 /*                    SELECTION CRITERIA                            */ 23490800
 /****************************************************************** */ 23490900
  ROLBCAM_R065_RSSPRODUCT_WANTED: PROC (XTYPEMOD) RETURNS (BIT(1));     23491099
                                                                        23491100
 DCL   XTYPEMOD       CHAR (7);                                         23491600
 DCL   (J1,K1,I0)     FIXED BIN(31) INIT(0);                            23491700
 DCL   FOUNDKEY       BIT  (1);                                         23491800
                                                                        23491900
                  /* BINARY SEARCH FOR PROD/MODEL IN TB_T400RSS      */ 23492000
  FOUNDKEY = '0'B;                                                      23492100
  J1 = COUNT_RSS_TYPE_MODEL + 1B;                /*SET MAXIMUM       */ 23492200
  K1 = 1B;                                       /*SET MINIMUM       */ 23492300
                                                                        23492400
  DO WHILE(¬FOUNDKEY);                                                  23492500
                                         /* DETERMINE MIDDLE OF ARRAY*/ 23492600
     I0 = (J1 + K1) / 10B;               /* (MAX  + MIN    )     / 2 */ 23492700
     IF I0 = K1                                                         23492800
        THEN FOUNDKEY = '1'B;                                           23492900
        ELSE IF TB_T400RSS.PRODMOD(I0) > XTYPEMOD                       23493000
                THEN J1 = I0;                                           23493100
                ELSE IF TB_T400RSS.PRODMOD(I0) < XTYPEMOD               23493200
                        THEN K1 = I0;                                   23493300
                        ELSE FOUNDKEY = '1'B;                           23493400
  END;                                                                  23493500
 RETURN(TB_T400RSS.PRODMOD(I0)= XTYPEMOD);      /* IF FOUND IN TABLE*/  23493600
                                                 /* RETURN "YES"     */ 23493700
                                                                        23493800
  END ROLBCAM_R065_RSSPRODUCT_WANTED;                                   23493999
                                                      /* EOC RC01323 */ 23494000
1/********************************************************SOC RB01320*/ 23494100
 /*                                                                  */ 23494200
 /* MODULE NAME      : ROLBCAM_R065_READ_T125                        */ 23494399
 /*                                                                  */ 23494400
 /* DESCRIPTION      : CHECK IF LONG SERIAL IS PRESENT IN T125.      */ 23495000
 /*                                                                  */ 23496000
 /****************************************************************** */ 23497000
0ROLBCAM_R065_READ_T125 : PROC (WS_COUNTRY_NUMBER,                      23498099
                                WS_PRODUCT_TYPE  );                     23499000
                                                                        23499100
 DCL WS_COUNTRY_NUMBER  CHAR(03);                                       23499200
 DCL WS_PRODUCT_TYPE    CHAR(04);                                       23499300
                                                                        23499400
 WS_DUMMY_ORIGIN          = ' ';                                        23499500
 WS_DUMMY_SEQUENCE_NUM    = ' ';                                        23499600
 WRK_T125_FOUND = 'N';                                                  23499700
 TB_RCBV125   = '';                                                     23499800
 TB_RCBV125_I = '';                                                     23499900
                                                                        23500000
  /* CHECK IF TOS NEEDS TO BE CHECKED FROM INVENTORY OR ORDER FILE */   23500100
                                                                        23500200
  IF CHKP_AREA.AASID = 'DI'                                             23500300
  THEN                                                                  23500400
    DO;                                                                 23500500
     WS_DUMMY_ORIGIN        = SUBSTR(DB_MACH_INV.RMAXA,1,2);            23500600
     WS_DUMMY_SEQUENCE_NUM  = '00'||SUBSTR(DB_MACH_INV.RMAXA,3,5);      23500700
    END;                                                                23500800
  ELSE                                                                  23500900
    DO;                                                                 23501000
     WS_DUMMY_ORIGIN        = SUBSTR(DB_MACH_ORD.RMAXA,1,2);            23501100
     WS_DUMMY_SEQUENCE_NUM  = '00'||SUBSTR(DB_MACH_ORD.RMAXA,3,5);      23501200
    END;                                                                23501300
                                                                        23501400
 EXEC SQL                                                               23501800
  SELECT  T125.COUNTRY_NUMBER                                           23501900
         ,T125.PRODUCT_TYPE                                             23502000
         ,T125.REAL_SERIAL_NUMBER                                       23502100
         ,T125.DUMMY_ORIGIN                                             23502200
         ,T125.DUMMY_SEQUENCE_NUM                                       23502300
         ,T125.LAST_CHANGE_DATE                                         23502400
      INTO :TB_RCBV125                                                  23502500
           :TB_RCBV125_I.INDNULL                                        23502600
      FROM  RCBV0125_DMMY_REAL   T125                                   23502700
     WHERE COUNTRY_NUMBER     = :WS_COUNTRY_NUMBER                      23502800
       AND PRODUCT_TYPE       = :WS_PRODUCT_TYPE                        23502900
       AND DUMMY_ORIGIN       = :WS_DUMMY_ORIGIN                        23503000
       AND DUMMY_SEQUENCE_NUM = :WS_DUMMY_SEQUENCE_NUM                  23503100
    WITH UR;                                                            23503200
                                                                        23503300
                                                                        23503500
 SELECT (SQLCA.SQLCODE);                                                23503600
 WHEN (0)                                                               23503700
  DO;                                                                   23503800
    WRK_T125_FOUND = 'Y';                                               23503900
  END;                                                                  23504000
 WHEN (+100)                                                            23504100
    WRK_T125_FOUND = 'N';                                               23504200
 OTHERWISE                                                              23504300
   CALL ROLBCAM_ERROR (ADDR (SQLCA),                                    23504499
                      'DB2','#092');                                    23504500
 END;                                                                   23504600
                                                                        23504700
 END ROLBCAM_R065_READ_T125;                            /*EOC RB01320*/ 23505199
1/********************************************************************/ 23506000
 /*                                                                  */ 23510000
 /* MODULE NAME  : INIT_DI                                           */ 23520000
 /*                                                                  */ 23530000
 /* DESCRIPTION  : INITIALISE FOR THE RETRIEVAL OF DI INFORMATION    */ 23540000
 /*                                                                  */ 23550000
 /********************************************************************/ 23560000
0ROLBCAM_R070_INIT_DI : PROC;                                           23570099
                                                                        23580000
 IF ¬SWITCH_RSTRT                                                       23590000
 THEN                                                                   23600000
   DO;                                                                  23610000
     CHKP_AREA.AASID                 = 'DI';                            23620000
     CHKP_AREA.SWITCH_END_DI         = FALSE;                           23630000
   END;                                                                 23640000
 ELSE                                                                   23650000
   SWITCH_RSTRT = FALSE;                                                23660000
                                                                        23670000
 END ROLBCAM_R070_INIT_DI;                                              23680099
1/********************************************************************/ 23690000
 /*                                                                  */ 23700000
 /* MODULE NAME  : INIT_DO                                           */ 23710000
 /*                                                                  */ 23720000
 /* DESCRIPTION  : INITIALISE FOR THE RETRIEVAL OF DO INFORMATION    */ 23730000
 /*                                                                  */ 23740000
 /********************************************************************/ 23750000
0ROLBCAM_R071_INIT_DO : PROC;                                           23760099
                                                                        23770000
 IF ¬SWITCH_RSTRT                                                       23780000
 THEN                                                                   23790000
   DO;                                                                  23800000
     CHKP_AREA.AASID                 = 'DO';                            23810000
     CHKP_AREA.SWITCH_END_DO         = FALSE;                           23820000
   END;                                                                 23830000
 ELSE                                                                   23840000
   SWITCH_RSTRT = FALSE;                                                23850000
                                                                        23860000
 END ROLBCAM_R071_INIT_DO;                                              23870099
1/********************************************************************/ 23880000
 /*                                                                  */ 23890000
 /* MODULE NAME      : PROCESS_DI                                    */ 23900000
 /*                                                                  */ 23910000
 /* DESCRIPTION      : RETRIEVE DI INFORMATION                       */ 23920000
 /*                                                                  */ 23930000
 /********************************************************************/ 23940000
0ROLBCAM_R072_PROCESS_DI: PROC;                                         23950099
                                                                        23960000
 DO WHILE (¬CHKP_AREA.SWITCH_END_DI) ;                                  23970000
                                                                        23980000
   CALL PLITDLI(FOUR,'GN  ',PTR_RBDGDI0,DB_MACH_INV,SSA_RRDDI1);        23990000
   SELECT (PCB_RBDGDI0.ST_CODE);                                        24000000
   WHEN ('  ')                                                          24010000
     DO;                                                                24020000
                                                  /* SOC CEDS00000633 */24020100
       PARM_INT_AREA.SEQUENCE_KEY = CHKP_AREA.COUNTRY                   24021000
                                  || DB_MACH_INV.CMAXA                  24022000
                                  || DB_MACH_INV.RMAXA;                 24023000
                                                  /* EOC CEDS00000633 */24024000
       IF SUBSTR(DB_MACH_INV.CMAXA,1,2) ¬= '56' & /* HW PROD ONLY  */   24030000
          SUBSTR(DB_MACH_INV.CMAXA,1,2) ¬= '57'   /*(SKIP SW PROD) */   24040000
       THEN                                                             24050000
         DO;                                                            24060000
           IF DB_MACH_INV.CSTXA = '3' |           /* INSTALLED     */   24070000
              DB_MACH_INV.CSTXA = '4'             /* INVENTORY ONLY*/   24080000
           THEN                                                         24090000
             DO;                                                        24100000
               IF WRK_PREV_TYPE ¬= DB_MACH_INV.CMAXA  /* NEW TYPE  */   24110000
               THEN                                                     24120000
                 DO;                                                    24130000
                   WRK_PREV_TYPE = DB_MACH_INV.CMAXA;                   24140000
                   CALL ROLBCAM_RX03_CHECK_REQUESTED                    24150099
                     ( CHKP_AREA.COUNTRY,         /* CHECK IF TYPE  */  24160000
                       DB_MACH_INV.CMAXA,         /* IS REQUESTED BY*/  24170000
                       CHKP_AREA.CURR_DATE);      /* CEDS           */  24180000
                 END;                                                   24190000
                                                                        24200000
               IF WRK_HW_REQUEST_CEDS ¬= '0'      /* RB01140        */  24210000
                                                      /* SOC RC01323 */ 24211000
                  &                                                     24212000
                 (                                                      24213000
                  WRK_RUNMODE = 'CA'   |                                24214000
                  WRK_RUNMODE = 'S1'   |                                24215000
                  (                                                     24216000
                   ¬SWITCH_NO_RSS_PROD      &                           24216100
                   DB_MACH_INV.CMMXA ¬= ' ' &                           24217000
                   ROLBCAM_R065_RSSPRODUCT_WANTED(DB_MACH_INV.CMAXA ||  24218099
                                                  DB_MACH_INV.CMMXA)    24219000
                  )                                                     24219100
                 )                                                      24219200
                                                      /* EOC RC01323 */ 24219300
               THEN                                                     24220000
                 DO;                                                    24230000
                   CALL ROLBCAM_R062_CUF_EXIT_DI;                       24240099
                                                  /* SOC RB01320 */     24241000
                   CALL ROLBCAM_R065_READ_T125                          24242099
                          (CHKP_AREA.COUNTRY,                           24243000
                           DB_MACH_INV.CMAXA);                          24244000
                                                  /* EOC RB01320 */     24245000
                   CALL ROLBCAM_R060_PROCESS_DI_RECORD;                 24250099
                   CHKP_AREA.CNT_CTRY.PROC_DI =                         24260000
                             CHKP_AREA.CNT_CTRY.PROC_DI + 1;            24270000
                 END;                                                   24280000
               ELSE                                                     24290000
                 DO;                                   /*   RC01323  */ 24291000
                 CHKP_AREA.CNT_CTRY.SKIP_DI =                           24300000
                           CHKP_AREA.CNT_CTRY.SKIP_DI + 1;              24310000
                                                      /* SOC RC01323 */ 24311000
                  IF WRK_RUNMODE = 'S2' THEN                            24312000
                   COUNT_SKIP_NON_RSS_DI = COUNT_SKIP_NON_RSS_DI + 1;   24313000
                                                                        24314000
                 END;                                                   24315000
                                                      /* EOC RC01323 */ 24316000
             END;                                                       24320000
           ELSE                                                         24330000
             DO;                                                        24340000
               CHKP_AREA.CNT_CTRY.SKIP_DI =                             24350000
                                  CHKP_AREA.CNT_CTRY.SKIP_DI + 1;       24360000
             END;                                                       24370000
                                                                        24380000
           CHKP_AREA.CNT_CTRY.READ_DI = CHKP_AREA.CNT_CTRY.READ_DI + 1; 24390000
         END;                                                           24400000
       ELSE                                                             24410000
         CHKP_AREA.CNT_CTRY.SW_DI = CHKP_AREA.CNT_CTRY.SW_DI + 1;       24420000
                                                                        24430000
         CHKP_AREA.MACHTYPE         = DB_MACH_INV.CMAXA;  /* PTM1107 */ 24440000
         CHKP_AREA.SERIAL           = DB_MACH_INV.RMAXA;  /* PTM1107 */ 24450000
                                                  /* SOC CEDS00000633 */24451000
  /*     PARM_INT_AREA.SEQUENCE_KEY = CHKP_AREA.COUNTRY *//* RC01141 */ 24460000
  /*                               || DB_MACH_INV.CMAXA                 24470000
                                   || DB_MACH_INV.RMAXA;*/              24480000
                                                  /* EOC CEDS00000633 */24481000
     END;                                                               24490000
   WHEN ('GE','GB')                                                     24500000
     CHKP_AREA.SWITCH_END_DI = TRUE;                                    24510000
   OTHERWISE                                                            24520000
     CALL ROLBCAM_ERROR(PTR_RBDGDI0,'IMS_DB','#022');                   24530099
   END;                                                                 24540000
                                                                        24550000
   CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                 24560000
                                                                        24570000
   IF ((CHKP_AREA.CHKP_LIMIT ¬= 0) &                                    24580000
       (CHKP_CNT_STEPS > CHKP_AREA.CHKP_LIMIT))                         24590000
   THEN                                                                 24600000
     DO;                                                                24610000
       CALL ROLBCAM_RX01_CHECKPOINT;                                    24620099
       CALL ROLBCAM_RX02_REPOSITION;                                    24630099
     END;                                                               24640000
                                                                        24650000
 END;                                                                   24660000
                                                                        24670000
 END ROLBCAM_R072_PROCESS_DI;                                           24680099
1/********************************************************************/ 24690000
 /*                                                                  */ 24700000
 /* MODULE NAME      : PROCESS_DO                                    */ 24710000
 /*                                                                  */ 24720000
 /* DESCRIPTION      : RETRIEVE DO INFORMATION                       */ 24730000
 /*                                                                  */ 24740000
 /********************************************************************/ 24750000
0ROLBCAM_R073_PROCESS_DO: PROC;                                         24760099
                                                                        24770000
 WRK_FUNC = 'GN  ';                                                     24780000
 DO WHILE (¬CHKP_AREA.SWITCH_END_DO) ;                                  24790000
                                                                        24800000
   CALL PLITDLI(FOUR,WRK_FUNC,PTR_RBDGDO0,DB_MACH_ORD,SSA_RRDDO1);      24810000
   SELECT (PCB_RBDGDO0.ST_CODE);                                        24820000
   WHEN ('  ')                                                          24830000
     DO;                                                                24840000
                                                  /* SOC CEDS00000633 */24840100
       PARM_INT_AREA.SEQUENCE_KEY = CHKP_AREA.COUNTRY                   24841000
                                 || DB_MACH_ORD.RORXA;                  24842000
                                                  /* EOC CEDS00000633 */24843000
       IF SUBSTR(DB_MACH_ORD.CMAXA,1,2) ¬= '56' &  /* HW PROD ONLY   */ 24850000
          SUBSTR(DB_MACH_ORD.CMAXA,1,2) ¬= '57'    /* (SKIP SW PROD) */ 24860000
       THEN                                                             24870000
         DO;                                                            24880000
           IF DB_MACH_ORD.RCUAC ¬= '991200' &                           24890000
              DB_MACH_ORD.RCUAC ¬= '991300' &                           24900000
              ¬DB_MACH_ORD.CIEFV &                  /* NO SW IND. SET*/ 24910000
              ¬DB_MACH_ORD.CIEAU &                  /* NO VPOS ORDER */ 24920000
              ¬DB_MACH_ORD.CIFBA                    /* NO PARTS      */ 24930000
           THEN                                                         24940000
             DO;                                                        24950000
               CALL ROLBCAM_RX03_CHECK_REQUESTED                        24960099
                 ( CHKP_AREA.COUNTRY,              /* CHECK IF TYPE  */ 24970000
                   DB_MACH_ORD.CMAXA,              /* IS REQUESTED BY*/ 24980000
                   CHKP_AREA.CURR_DATE);           /* CEDS           */ 24990000
                                                                        25000000
               IF WRK_HW_REQUEST_CEDS ¬= '0'       /* RB01140        */ 25010000
                                                      /* SOC RC01323 */ 25011000
                  &                                                     25012000
                 (                                                      25013000
                  WRK_RUNMODE = 'CA'   |                                25014000
                  WRK_RUNMODE = 'S1'   |                                25015000
                  (                                                     25016000
                   ¬SWITCH_NO_RSS_PROD      &                           25016100
                   DB_MACH_ORD.CMMXA ¬= ' ' &                           25017000
                   ROLBCAM_R065_RSSPRODUCT_WANTED(DB_MACH_ORD.CMAXA ||  25018099
                                                  DB_MACH_ORD.CMMXA)    25019000
                  )                                                     25019100
                                                                        25019200
                                                                        25019300
                 )                                                      25019400
                                                      /* EOC RC01323 */ 25019500
               THEN                                                     25020000
                 DO;                                                    25030000
                   CALL ROLBCAM_R063_CUF_EXIT_DO;                       25040099
                                                   /* SOC RB01320    */ 25041000
                   CALL ROLBCAM_R065_READ_T125                          25042099
                         (CHKP_AREA.COUNTRY,                            25043000
                          DB_MACH_INV.CMAXA);                           25044000
                                                   /* EOC RB01320    */ 25045000
                   CALL ROLBCAM_R061_PROCESS_DO_RECORD;                 25050099
                   CHKP_AREA.CNT_CTRY.PROC_DO =                         25060000
                                 CHKP_AREA.CNT_CTRY.PROC_DO + 1;        25070000
                 END;                                                   25080000
               ELSE                                                     25090000
                 DO;                                                    25100000
                   CHKP_AREA.CNT_CTRY.SKIP_DO =                         25110000
                             CHKP_AREA.CNT_CTRY.SKIP_DO + 1;            25120000
                                                      /* SOC RC01323 */ 25121000
                  IF WRK_RUNMODE = 'S2' THEN                            25122000
                   COUNT_SKIP_NON_RSS_DO = COUNT_SKIP_NON_RSS_DO + 1;   25123000
                                                                        25124000
                                                      /* EOC RC01323 */ 25125000
                 END;                                                   25130000
             END;                                                       25140000
           ELSE                                                         25150000
             CHKP_AREA.CNT_CTRY.SKIP_DO =                               25160000
                       CHKP_AREA.CNT_CTRY.SKIP_DO + 1;                  25170000
         END;                                                           25180000
       ELSE                                                             25190000
         DO;                                                            25200000
           CHKP_AREA.CNT_CTRY.SW_DO = CHKP_AREA.CNT_CTRY.SW_DO + 1;     25210000
         END;                                                           25220000
                                                                        25230000
       CHKP_AREA.CNT_CTRY.READ_DO = CHKP_AREA.CNT_CTRY.READ_DO + 1;     25240000
       CHKP_AREA.ORDER_NUMBER     = DB_MACH_ORD.RORXA;                  25250000
                                                                        25260000
                                                  /* SOC CEDS00000633 */25261000
   /*  PARM_INT_AREA.SEQUENCE_KEY = CHKP_AREA.COUNTRY */  /* RC01141 */ 25270000
   /*                            || DB_MACH_ORD.RORXA;*/                25280000
                                                  /* EOC CEDS00000633 */25281000
     END;                                                               25290000
   WHEN ('GE','GB')                                                     25300000
     CHKP_AREA.SWITCH_END_DO = TRUE;                                    25310000
   OTHERWISE                                                            25320000
     CALL ROLBCAM_ERROR(PTR_RBDGDO0,'IMS_DB','#023');                   25330099
   END;                                                                 25340000
                                                                        25350000
   CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                 25360000
                                                                        25370000
   IF ((CHKP_AREA.CHKP_LIMIT ¬= 0) &                                    25380000
       (CHKP_CNT_STEPS > CHKP_AREA.CHKP_LIMIT))                         25390000
   THEN                                                                 25400000
     DO;                                                                25410000
       CALL ROLBCAM_RX01_CHECKPOINT;                                    25420099
       CALL ROLBCAM_RX02_REPOSITION;                                    25430099
     END;                                                               25440000
                                                                        25450000
 END;                                                                   25460000
                                                                        25470000
 END ROLBCAM_R073_PROCESS_DO;                                           25480099
1/********************************************************************/ 25490000
 /*                                                                  */ 25500000
 /* MODULE NAME  : INIT_COUNTRY                                      */ 25510000
 /*                                                                  */ 25520000
 /* DESCRIPTION  : INITIALISE FOR A NEW COUNTRY WHILE RETRIEVING     */ 25530000
 /*                                                                  */ 25540000
 /********************************************************************/ 25550000
0ROLBCAM_R080_INIT_COUNTRY : PROC;                                      25560099
                                                                        25570000
 IF ¬SWITCH_RSTRT                                                       25580000
 THEN                                                                   25590000
   DO;                                                                  25600000
     CHKP_AREA.NBR_ARRAY = CHKP_AREA.NBR_ARRAY + 1;                     25610000
     IF CHKP_AREA.NBR_ARRAY > CHKP_AREA.COUNT_CTRY                      25620000
     THEN                                                               25630000
        CHKP_AREA.SWITCH_END_COUNTRIES = TRUE;                          25640000
     ELSE                                                               25650000
       DO;                                                              25660000
         CHKP_AREA.AASID                   = 'DI';                      25670000
                                                                        25680000
         CHKP_AREA.COUNTRY =                                            25690000
           CHKP_AREA.CTRY_ARRAY.CTRYNO(CHKP_AREA.NBR_ARRAY);            25700000
         PARM_INT_AREA.COUNTRY_NUMBER = CHKP_AREA.COUNTRY;              25710000
         CHKP_AREA.PGR_RUN_TYPE =                                       25720000
           CHKP_AREA.CTRY_ARRAY.PGR_TYPE(CHKP_AREA.NBR_ARRAY);          25730000
                         /* RETRIEVE COUNTRY DEPENDENT PARAMETERS */    25740000
         CALL ROLBCAM_R081_RETRIEVE_RCB001;                             25750099
         CALL ROLBCAM_R082_RETRIEVE_RCB008;                             25760099
         CALL ROLBCAM_R083_RETRIEVE_RCB012;                             25770099
         CALL ROLBCAM_R084_RETRIEVE_RCB030;                             25780099
         CALL ROLBCAM_R085_CHECK_RCB030;                                25790099
         CALL ROLBCAM_RX13_GET_F_TOW_RCB064;        /* SOC RB01298*/    25791099
                               /*RETRIEVE F_TOW FOR CTRY SPECIFIC */    25792000
                                                    /* EOC RB01298*/    25793000
                                                      /* SOC RC01323 */ 25794000
  /*       SELECT RSS PROD FROM T400 WHEN SOURCE IS S2               */ 25795000
         IF WRK_RUNMODE = 'S2' THEN                                     25796000
         CALL ROLBCAM_R0851_RSSPROD_SEL;                                25797099
                                                      /* EOC RC01323 */ 25798000
                                                                        25800000
                                /* INITIALISATION CTRY COUNTERS   */    25810000
         CHKP_AREA.CNT_CTRY       = '';                                 25820000
         CHKP_AREA.CNT_HASH_TOTAL = '';                                 25830000
                                                                        25840000
                                      /* FILL CHKP_AREA           */    25850000
         CHKP_AREA.MACHTYPE = LOW(4);                                   25860000
         CHKP_AREA.SERIAL   = LOW(7);                                   25870000
                                                                        25880000
                                      /* INITIALISE SSA'S         */    25890000
         SSA_RRDDI1.CTRYNO1  =  ' ' || CHKP_AREA.COUNTRY;               25900000
         SSA_RRDDI1.CMAXA1 = LOW(4);                                    25910000
         SSA_RRDDI1.RMAXA1 = LOW(7);                                    25920000
         SSA_RRDDI1.CTRYNO2  =  ' ' || CHKP_AREA.COUNTRY;               25930000
         SSA_RRDDI1.CMAXA2 = HIGH(4);                                   25940000
         SSA_RRDDI1.RMAXA2 = HIGH(7);                                   25950000
                                                                        25960000
         SSA_RRDDO1.CTRYNO1  =  ' ' || CHKP_AREA.COUNTRY;               25970000
         SSA_RRDDO1.RORXA1   = LOW(6);                                  25980000
         SSA_RRDDO1.CTRYNO2  =  ' ' || CHKP_AREA.COUNTRY;               25990000
       END;                                                             26000000
   END;                                                                 26010000
                                                                        26020000
 END ROLBCAM_R080_INIT_COUNTRY;                                         26030099
1/********************************************************************/ 26040000
 /*                                                                  */ 26050000
 /* MODULE NAME      : RETRIEVE_RCB001                               */ 26060000
 /*                                                                  */ 26070000
 /* DESCRIPTION      : RETRIEVE RCB001                               */ 26080000
 /*                                                                  */ 26090000
 /* COMMENT          : ADAPTED DURING IMPLEMENTATION OF PTM 290      */ 26100000
 /*                                                                  */ 26110000
 /********************************************************************/ 26120000
 ROLBCAM_R081_RETRIEVE_RCB001 : PROC;                                   26130099
                                                                        26140000
                                                /* RETRIEVE RUN DATE */ 26150000
 RUN_DATE_AREA.PROC_ID   =  CHKP_AREA.COUNTRY_AREA.PROC_ID;             26160000
 RUN_DATE_AREA.CTRYNO    =  CHKP_AREA.COUNTRY;                          26170000
 RUN_DATE_AREA.PGR_TYPE  =  CHKP_AREA.PGR_RUN_TYPE;                     26180000
                                                                        26190000
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       26200000
               PTR_INT_AREA);                                           26210000
                                                                        26220000
 IF RUN_DATE_AREA.RUN_DATE = ''   /* NO RUN DATE RCB001 FOUND */        26230000
 THEN                                                                   26240000
   DO;                                                                  26250000
     CHKP_AREA.CURR_DATE = PARM_INT_AREA.SYSTEM_DATE;                   26260000
   END;                                                                 26270000
 ELSE                                                                   26280000
   DO;                                                                  26290000
     CHKP_AREA.CURR_DATE = RUN_DATE_AREA.RUN_DATE;                      26300000
   END;                                                                 26310000
                                                                        26320000
 PARM_INT_AREA.RUN_DATE         = CHKP_AREA.CURR_DATE;                  26330000
                                                                        26340000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   26350000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 26360000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               26370000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 26380000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = CHKP_AREA.CURR_DATE;                  26390000
 CALL RCB0M1M(PTR_INT_AREA);                                            26400000
                                                                        26410000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   26420000
                                                                        26430000
 END ROLBCAM_R081_RETRIEVE_RCB001;                                      26440099
1/********************************************************************/ 26450000
 /*                                                                  */ 26460000
 /* MODULE NAME      : RETRIEVE_RCB008                               */ 26470000
 /*                                                                  */ 26480000
 /* DESCRIPTION      : RETRIEVE FEATURE-STORE PARAMETER FROM         */ 26490000
 /*                    RCBT0500_PARM USING RCBI50M                   */ 26500000
 /*                                                                  */ 26510000
 /********************************************************************/ 26520000
0ROLBCAM_R082_RETRIEVE_RCB008: PROC;                                    26530099
                                                                        26540000
 TB_RCBV500 = '';                                                       26550000
 TB_RCBV500.PARAMETER_NUMBER = 'RCB008';                                26560000
 TB_RCBV500.PARAMETER_KEY    = CHKP_AREA.COUNTRY;                       26570000
0CALL RCBI50M ('U',                                       /* RC01219 */ 26580000
               PTR_RCBV500,                                             26590000
               PTR_RCBV500I,                                            26600000
               PTR_RETURN_AREA,                                         26610000
               PTR_INT_AREA);                                           26620000
                                                                        26630000
 SELECT (RETURN_AREA.RETURN_CODE);                                      26640000
 WHEN (0)                                                               26650000
   IF PARM_STORE_FEAT.FEATURE_STORE_IND = '1'                           26660000
   THEN                                                                 26670000
     CHKP_AREA.SWITCH_STORE_FEAT = TRUE;                                26680000
   ELSE                                                                 26690000
     CHKP_AREA.SWITCH_STORE_FEAT = FALSE;                               26700000
 WHEN (4)                                                               26710000
   DO;                                                                  26720000
     CHKP_AREA.SWITCH_STORE_FEAT    = TRUE;                             26730000
                                                                        26740000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             26750000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0001';           /* PTM 299 */   26760000
     PARM_INT_AREA.MSG_VAR_CODES    = ' ';                              26770000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'PN';                             26780000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCB008';                         26790000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'PK';                             26800000
     PARM_INT_AREA.MSG_VAR_VALUE_7  = TB_RCBV500.PARAMETER_KEY;         26810000
     CALL RCB0M1M (PTR_INT_AREA);                                       26820000
   END;                                                                 26830000
 OTHERWISE                                                              26840000
   CALL ROLBCAM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                     26850099
                      'DB2','#024');                                    26860000
 END;                                                                   26870000
                                                                        26880000
 END ROLBCAM_R082_RETRIEVE_RCB008;                                      26890099
1/********************************************************************/ 26900000
 /*                                                                  */ 26910000
 /* MODULE NAME      : RETRIEVE_RCB012                               */ 26920000
 /*                                                                  */ 26930000
 /* DESCRIPTION      : RETRIEVE CHECKPOINT LIMIT PARAMETER FROM      */ 26940000
 /*                    RCBT0500_PARM USING RCBI50M                   */ 26950000
 /*                                                                  */ 26960000
 /********************************************************************/ 26970000
0ROLBCAM_R083_RETRIEVE_RCB012: PROC;                                    26980099
                                                                        26990000
 TB_RCBV500 = '';                                                       27000000
 TB_RCBV500.PARAMETER_NUMBER = 'RCB012';                                27010000
 TB_RCBV500.PARAMETER_KEY    = CHKP_AREA.COUNTRY ||                     27020000
                               CHKP_AREA.PGR_RUN_TYPE ||                27030000
                               WRK_PGM_NAME;                            27040000
0CALL RCBI50M ('U',                                       /* RC01219 */ 27050000
               PTR_RCBV500,                                             27060000
               PTR_RCBV500I,                                            27070000
               PTR_RETURN_AREA,                                         27080000
               PTR_INT_AREA);                                           27090000
                                                                        27100000
 SELECT (RETURN_AREA.RETURN_CODE);                                      27110000
 WHEN (0)                                                               27120000
   CHKP_AREA.CHKP_LIMIT     = PARM_CHKP.CHKP_LIMIT;                     27130000
 WHEN (4)                                                               27140000
   DO;                                                                  27150000
     CHKP_AREA.CHKP_LIMIT           = 0;                                27160000
                                                                        27170000
     PARM_INT_AREA.MSG_VAR_CODES    = '';                               27180000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             27190000
     PARM_INT_AREA.MESSAGE_NUMBER   = '0008';                           27200000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'NO';                             27210000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = CHKP_AREA.CHKP_LIMIT;             27220000
     CALL RCB0M1M(PTR_INT_AREA);                                        27230000
   END;                                                                 27240000
 OTHERWISE                                                              27250000
   CALL ROLBCAM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                     27260099
                      'DB2','#025');                                    27270000
 END;                                                                   27280000
                                                                        27290000
 END ROLBCAM_R083_RETRIEVE_RCB012;                                      27300099
1/********************************************************************/ 27310000
 /*                                                                  */ 27320000
 /* MODULE NAME      : ROLBCAM_RETRIEVE_RCB030                       */ 27330099
 /*                                                                  */ 27340000
 /* DESCRIPTION      : RETRIEVE RCB030                               */ 27350000
 /*                                                                  */ 27360000
 /********************************************************************/ 27370000
 ROLBCAM_R084_RETRIEVE_RCB030 : PROC;                                   27380099
                                                                        27390000
 TB_RCBV500 = '';                                                       27400000
 TB_RCBV500.PARAMETER_NUMBER = 'RCB030';                                27410000
 TB_RCBV500.PARAMETER_KEY    = CHKP_AREA.COUNTRY;                       27420000
0CALL RCBI50M ('R',                                       /* RC01219 */ 27430000
               PTR_RCBV500,                                             27440000
               PTR_RCBV500I,                                            27450000
               PTR_RETURN_AREA,                                         27460000
               PTR_INT_AREA);                                           27470000
                                                                        27480000
 SELECT (RETURN_AREA.RETURN_CODE);                                      27490000
 WHEN (0)                                                               27500000
   DO;                                                                  27510000
     CHKP_AREA.RCB030         = PARM_PROCESSED;                         27520000
     CHKP_AREA.NEW_PROCESSED  = PARM_PROCESSED.LAST_PROCESSED;          27530000
   END;                                                                 27540000
 WHEN (4)                                            /* PTM 299 */      27550000
   DO;                                                                  27560000
     PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                             27570000
     PARM_INT_AREA.MESSAGE_NUMBER   = 'I050';                           27580000
     PARM_INT_AREA.MSG_VAR_CODES    = ' ';                              27590000
     PARM_INT_AREA.MSG_VAR_CODE_6   = 'PN';                             27600000
     PARM_INT_AREA.MSG_VAR_VALUE_6  = 'RCB030';                         27610000
     PARM_INT_AREA.MSG_VAR_CODE_7   = 'PK';                             27620000
     PARM_INT_AREA.MSG_VAR_VALUE_7  = TB_RCBV500.PARAMETER_KEY;         27630000
     CALL RCB0M1M (PTR_INT_AREA);                                       27640000
     CALL ROLBCAM_ERROR(NULL,'OTHER','#026');                           27650099
   END;                                                                 27660000
 OTHERWISE                                                              27670000
   CALL ROLBCAM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                     27680099
                      'DB2','#027');                                    27690000
 END;                                                                   27700000
                                                                        27710000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   27720000
                                                                        27730000
 END ROLBCAM_R084_RETRIEVE_RCB030;                                      27740099
1/********************************************************************/ 27750000
 /*                                                                  */ 27760000
 /* MODULE NAME      : CHECK_RCB030                                  */ 27770000
 /*                                                                  */ 27780000
 /* DESCRIPTION      : CHECK RUNDATE WITH RCB030                     */ 27790000
 /*                                                                  */ 27800000
 /********************************************************************/ 27810000
 ROLBCAM_R085_CHECK_RCB030 : PROC;                                      27820099
                                                                        27830000
 IF CHKP_AREA.CURR_DATE < CHKP_AREA.RCB030.LAST_PROCESSED               27840000
 THEN                                                                   27850000
   DO;                                                                  27860000
     PARM_INT_AREA.MSG_VAR_CODES   = '';                                27870000
     PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                              27880000
     PARM_INT_AREA.MESSAGE_NUMBER  = '0162';                            27890000
     PARM_INT_AREA.MSG_VAR_CODE_6  = 'DT';                              27900000
     PARM_INT_AREA.MSG_VAR_VALUE_6 = CHKP_AREA.CURR_DATE;               27910000
     PARM_INT_AREA.MSG_VAR_CODE_7  = 'DT';                              27920000
     PARM_INT_AREA.MSG_VAR_VALUE_7 = CHKP_AREA.RCB030.LAST_PROCESSED;   27930000
     CALL RCB0M1M (PTR_INT_AREA);                                       27940000
                                                                        27950000
     CALL ROLBCAM_ERROR(NULL,'OTHER','#028');                           27960099
   END;                                                                 27970000
                                                                        27980000
 IF CHKP_AREA.CURR_DATE > CHKP_AREA.NEW_PROCESSED                       27990000
 THEN                                                                   28000000
   CHKP_AREA.NEW_PROCESSED  = CHKP_AREA.CURR_DATE;                      28010000
                                                                        28020000
 END ROLBCAM_R085_CHECK_RCB030;                                         28030099
                                                      /* SOC RC01323 */ 28031000
1/********************************************************************/ 28032000
 /*                                                                  */ 28033000
 /* MODULE NAME      : ROLBCAM_R0851_RSSPROD_SEL                     */ 28034099
 /*                                                                  */ 28035000
 /* DESCRIPTION      : SELECT RSS PRODUCT FROM T400 WHEN SOURCE IS S2*/ 28036000
 /*                                                                  */ 28037000
 /* COMMENT          : ADAPTED DURING IMPLEMENTATION OF PCR 227      */ 28038000
 /*                                                                  */ 28039000
 /********************************************************************/ 28039100
  ROLBCAM_R0851_RSSPROD_SEL: PROC;                                      28039299
                                                                        28039300
  DCL RSS_COUNT          FIXED BIN (31) INIT(0);                        28039400
  DCL RSS_DIVISION       CHAR (2) INIT('71');                           28039500
  DCL TEMP_COUNTRY       CHAR (3) INIT(' ');                            28039600
  DCL WRK_TYPENULL       FIXED BIN (15) INIT(0);                        28039800
  DCL WRK_MODELNULL      FIXED BIN (15) INIT(0);                        28039900
                                                                        28040200
  TEMP_COUNTRY = CHKP_AREA.COUNTRY;                                     28040300
  COUNT_SKIP_NON_RSS_DI = 0;                                            28040400
  COUNT_SKIP_NON_RSS_DO = 0;                                            28040500
  EXEC SQL                                                              28040600
       SELECT COUNT(*)                                                  28040700
       INTO :RSS_COUNT                                                  28040800
       FROM RCBV0400_PO_MOD1                                            28040900
       WHERE COUNTRY_NUMBER  = :TEMP_COUNTRY                            28041000
         AND PROD_REVENUE_DIV    = :RSS_DIVISION                        28041100
         AND NOT (MODEL_NUMBER = '' OR MODEL_NUMBER IS NULL);           28041200
                                                                        28041300
  SELECT (SQLCODE);                                                     28041400
  WHEN (0);                                                             28041500
  OTHERWISE                                                             28041600
    DO;                                                                 28041700
      CALL ROLBCAM_ERROR (ADDR (SQLCA),                                 28041899
                          'DB2',                                        28041900
                          '#093');                                      28042000
    END;                                                                28042100
  END;                                                                  28042200
                                                                        28042300
  IF RSS_COUNT ¬= 0 THEN                                                28042400
   DO;                                                                  28042500
    SWITCH_NO_RSS_PROD = FALSE;                                         28042600
    ALLOCATE TB_T400RSS(RSS_COUNT);                                     28042700
    TB_T400RSS(*)  = '';                                                28042800
    COUNT_RSS_TYPE_MODEL = 1;                                           28042900
                                                                        28043000
    EXEC SQL                                                            28043100
      DECLARE CURS_RCBV400 CURSOR FOR                                   28043200
        SELECT PRODUCT_TYPE,MODEL_NUMBER                                28043300
        FROM   RCBV0400_PO_MOD1                                         28043400
        WHERE COUNTRY_NUMBER  = :TEMP_COUNTRY                           28043500
          AND PROD_REVENUE_DIV    = :RSS_DIVISION                       28043600
          AND NOT (MODEL_NUMBER = '' OR MODEL_NUMBER IS NULL)           28043700
        ORDER BY 1,2                                                    28043800
        FOR FETCH ONLY;                                                 28043900
                                                                        28044000
    EXEC SQL                                                            28044100
     OPEN  CURS_RCBV400;                                                28044200
     SELECT (SQLCODE);                                                  28044300
     WHEN (0)                                                           28044400
       DO;                                                              28044500
         SWITCH_END_OF_CURS_RCBV400 = FALSE;                            28044600
       END;                                                             28044700
     OTHERWISE                                                          28044800
       DO;                                                              28044900
         CALL ROLBCAM_ERROR (ADDR (SQLCA),                              28045099
                             'DB2',                                     28045100
                             '#094');                                   28045200
       END;                                                             28045300
     END;                                                               28045400
                                                                        28045500
    CALL ROLBCAM_R0852_FETCH_RSS400;                                    28045699
                                                                        28045700
    DO WHILE (SWITCH_END_OF_CURS_RCBV400 = FALSE);                      28045800
       IF COUNT_RSS_TYPE_MODEL >  RSS_COUNT                             28046000
       THEN DO;                                                         28046100
            PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                      28046200
            PARM_INT_AREA.MESSAGE_NUMBER   = '0324';                    28046300
            PARM_INT_AREA.MSG_VAR_CODE_6   = 'C7';                      28046400
            PARM_INT_AREA.MSG_VAR_VALUE_6  = COUNT_RSS_TYPE_MODEL;      28046500
            PARM_INT_AREA.MSG_VAR_CODE_7   = 'C8';                      28046600
            PARM_INT_AREA.MSG_VAR_VALUE_7  = RSS_COUNT;                 28046700
            CALL RCB0M1M(PTR_INT_AREA);                                 28046800
            CALL ROLBCAM_ERROR(NULL,'OTHER','#097');                    28047099
          END;                                                          28047100
                                                                        28047200
       TB_T400RSS.PRODMOD(COUNT_RSS_TYPE_MODEL) = TYPE_TAB||MODEL;      28047300
       CALL ROLBCAM_R0852_FETCH_RSS400;                                 28047599
       COUNT_RSS_TYPE_MODEL = COUNT_RSS_TYPE_MODEL + 1;                 28047600
    END;                                                                28047700
                                                                        28047800
    EXEC SQL                                                            28047900
     CLOSE CURS_RCBV400;                                                28048000
                                                                        28048100
     SELECT (SQLCODE);                                                  28048200
     WHEN (0);                                                          28048300
     OTHERWISE                                                          28048400
       DO;                                                              28048500
         CALL ROLBCAM_ERROR (ADDR (SQLCA),                              28048699
                             'DB2',                                     28048700
                             '#096');                                   28048800
       END;                                                             28048900
     END;                                                               28049000
   END;                                                                 28049100
  ELSE                                                                  28049200
   DO;                                                                  28049300
    SWITCH_NO_RSS_PROD = TRUE;                                          28049400
    PARM_INT_AREA.MSG_VAR_CODES    = '';                                28049500
    PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                              28049600
    PARM_INT_AREA.MESSAGE_NUMBER   = '0322';                            28049700
    PARM_INT_AREA.MSG_VAR_CODE_6   = 'CY';                              28049800
    PARM_INT_AREA.MSG_VAR_VALUE_6  = CHKP_AREA.COUNTRY;                 28049900
    CALL RCB0M1M(PTR_INT_AREA);                                         28050000
   END;                                                                 28050200
  END ROLBCAM_R0851_RSSPROD_SEL;                                        28050399
1/********************************************************************/ 28050400
 /*                                                                  */ 28050500
 /* MODULE NAME      : ROLBCAM_R0852_FETCH_RSS400                    */ 28050699
 /*                                                                  */ 28050700
 /* DESCRIPTION      : FETCH T400 DETAILS FOR GIVEN MODEL AND PROD   */ 28050800
 /*                    TYPE                                          */ 28050900
 /********************************************************************/ 28051000
 ROLBCAM_R0852_FETCH_RSS400: PROC;                                      28051199
                                                                        28051200
   EXEC SQL                                                             28051300
     FETCH CURS_RCBV400                                                 28051400
     INTO :TYPE_TAB :WRK_TYPENULL, :MODEL :WRK_MODELNULL                28051500
     ;                                                                  28051600
   SELECT (SQLCODE);                                                    28051700
   WHEN (0);                                                            28051800
   WHEN (100)                                                           28051900
     DO;                                                                28052000
       SWITCH_END_OF_CURS_RCBV400 = TRUE;                               28052100
     END;                                                               28052200
   OTHERWISE                                                            28052300
     DO;                                                                28052400
       CALL ROLBCAM_ERROR (ADDR (SQLCA),                                28052599
                           'DB2',                                       28052600
                           '#095');                                     28052700
     END;                                                               28052800
   END;                                                                 28052900
  END ROLBCAM_R0852_FETCH_RSS400;                                       28053099
                                                      /* EOC RC01323 */ 28053100
1/********************************************************************/ 28053200
 /*                                                                  */ 28054000
 /* MODULE NAME      : UPDATE_RCB030                                 */ 28060000
 /*                                                                  */ 28070000
 /* DESCRIPTION      : UPDATE RCB030                                 */ 28080000
 /*                                                                  */ 28090000
 /********************************************************************/ 28100000
 ROLBCAM_R086_UPDATE_RCB030 : PROC;                                     28110099
                                                                        28120000
 TB_RCBV500   = '';                                                     28130000
 TB_RCBV500_I = '';                                                     28140000
 PARM_PROCESSED                = CHKP_AREA.RCB030;                      28150000
 PARM_PROCESSED.LAST_PROCESSED = CHKP_AREA.NEW_PROCESSED;               28160000
                                                                        28170000
 CALL RCBG50M (PTR_RCBV500,                                             28180000
               PTR_RCBV500I,                                            28190000
               PTR_RETURN_AREA,                                         28200000
               PTR_INT_AREA);                                           28210000
                                                                        28220000
 SELECT (RETURN_AREA.RETURN_CODE);                                      28230000
 WHEN (0);                                                              28240000
 OTHERWISE                                                              28250000
   CALL ROLBCAM_ERROR(ADDR(RETURN_AREA.RETURN_SQL),                     28260099
                      'DB2','#029');                                    28270000
 END;                                                                   28280000
                                                                        28290000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   28300000
                                                                        28310000
 END ROLBCAM_R086_UPDATE_RCB030;                                        28320099
1/********************************************************************/ 28330000
 /*                                                                  */ 28340000
 /* MODULE NAME      : UPD_RCB024                                    */ 28350000
 /*                                                                  */ 28360000
 /* DESCRIPTION      : SAVE HASH TOTAL INFORMATION ON PARAMETER.     */ 28370000
 /*                    IF THE PARAMETER DOES NOT YET EXIST, IT WILL  */ 28380000
 /*                    BE INSERTED.                                  */ 28390000
 /*                                                                  */ 28400000
 /********************************************************************/ 28410000
0ROLBCAM_R087_UPD_RCB024 : PROC;                                        28420099
                                     /* UPDATE PARAMETER RCB024    */   28430000
 TB_RCBV500                  = '';                                      28440000
 TB_RCBV500_I                = '';                                      28450000
 PARM_HASH.NUMBER            = 'RCB024';                                28460000
 PARM_HASH.PROC_ID           = CHKP_AREA.COUNTRY_AREA.PROC_ID;          28470000
 PARM_HASH.CTRYNO            = CHKP_AREA.COUNTRY;                       28480000
 PARM_HASH.FILE_NAME         = WRK_FILE_NAME;                           28490000
 PARM_HASH.SEQ_NUMBER        = '01';                                    28500000
 PARM_HASH.LENGTH_PARM       = WRK_LENGTH_RCB024;                       28510000
 PARM_HASH.TIME_STAMP        = CHKP_AREA.DATETIME;                      28520000
 PARM_HASH.HASH_TOTAL        = WRK_HASH_TOTAL;                          28530000
                                                                        28540000
 CALL RCBG50M (ADDR(TB_RCBV500),                                        28550000
               ADDR(TB_RCBV500_I),                                      28560000
               PTR_RETURN_AREA,                                         28570000
               PTR_INT_AREA);                                           28580000
 SELECT(RETURN_AREA.RETURN_CODE);                                       28590000
 WHEN (0);                                                              28600000
 WHEN (4)                          /* WHEN NOT FOUND THEN INSERT  */    28610000
   DO;                                                                  28620000
     CALL RCBF50M (ADDR(TB_RCBV500),                                    28630000
                   ADDR(TB_RCBV500_I),                                  28640000
                   PTR_RETURN_AREA,                                     28650000
                   PTR_INT_AREA);                                       28660000
     SELECT(RETURN_AREA.RETURN_CODE);                                   28670000
     WHEN (0);                                                          28680000
     OTHERWISE                                                          28690000
       DO;                                                              28700000
         CALL ROLBCAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),             28710099
                             'DB2',                                     28720000
                             '#030');                                   28730000
       END;                                                             28740000
     END;                                                               28750000
   END;                                                                 28760000
 OTHERWISE                                                              28770000
   DO;                                                                  28780000
     CALL ROLBCAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),                 28790099
                         'DB2',                                         28800000
                         '#031');                                       28810000
   END;                                                                 28820000
 END;                                                                   28830000
 END ROLBCAM_R087_UPD_RCB024;                                           28840099
1/********************************************************************/ 28850000
 /*                                                                  */ 28860000
 /* MODULE NAME      : UPDATE_RCBV0070                               */ 28870000
 /*                                                                  */ 28880000
 /* DESCRIPTION      : UPDATE TABLE RCBV0070.                        */ 28890000
 /*                    HW_REQUEST_CEDS SET TO '1' FOR A COUNTRY WITH */ 28900000
 /*                    HW_REQUEST_CEDS = '2'                         */ 28910000
 /*                                                                  */ 28920000
 /* NOTE             : HOST_VAR IS DECLARED BECAUSE DB2 CANNOT       */ 28930000
 /*                    PROCESS HOST VARIABLES MORE THAN TWO LEVELS   */ 28940000
 /*                    DEEP.                                         */ 28950000
 /*                                                                  */ 28960000
 /********************************************************************/ 28970000
0ROLBCAM_R088_UPDATE_RCBV0070 : PROC ;                   /* RB00140*/   28980099
                                                                        28990000
 DCL 1 HOST_VAR,                                                        29000000
       3 COUNTRY        CHAR (03),                                      29010000
       3 CURR_DATE      CHAR (10),                                      29020000
       3 MACHTYPE_LOW   CHAR (04),                                      29030000
       3 MACHTYPE_HIGH  CHAR (04);                                      29040000
                                                                        29050000
 HOST_VAR.COUNTRY        = CHKP_AREA.COUNTRY;                           29060000
 HOST_VAR.CURR_DATE      = CHKP_AREA.CURR_DATE;                         29070000
 HOST_VAR.MACHTYPE_LOW   = LOW(4);                                      29080000
 HOST_VAR.MACHTYPE_HIGH  = HIGH(4);                                     29090000
                                                                        29100000
 EXEC SQL                                                               29110000
   UPDATE RCBV0070_HW_PO                                                29120000
   SET    HW_REQUEST_CEDS      = '1'                                    29130000
   WHERE  COUNTRY_NUMBER       = :HOST_VAR.COUNTRY                      29140000
     AND  PRODUCT_TYPE         BETWEEN :HOST_VAR.MACHTYPE_LOW           29150000
                               AND     :HOST_VAR.MACHTYPE_HIGH          29160000
     AND  MODEL_NUMBER         = ' '                                    29170000
     AND :HOST_VAR.CURR_DATE   BETWEEN EFFECTIVE_DATE                   29180000
                               AND     END_DATE                         29190000
     AND  HW_REQUEST_CEDS      = '2'                                    29200000
     ;                                                                  29210000
                                                                        29220000
 SELECT (SQLCA.SQLCODE);                                                29230000
 WHEN (0);                                                              29240000
 WHEN (+100);                                                           29250000
 OTHERWISE                                                              29260000
   CALL ROLBCAM_ERROR (ADDR (SQLCA),                                    29270099
                      'DB2','#032');                                    29280000
 END;                                                                   29290000
 END ROLBCAM_R088_UPDATE_RCBV0070;                                      29300099
1/********************************************************************/ 29310000
 /*                                                                  */ 29320000
 /* MODULE NAME      : TERM_COUNTRY                                  */ 29330000
 /*                                                                  */ 29340000
 /* DESCRIPTION      : TERMINATE FOR THE CURRENT COUNTRY             */ 29350000
 /*                                                                  */ 29360000
 /* COMMENT          : ADAPTED DURING THE IMPLEMENTATION OF PTM 290  */ 29370000
 /*                                                                  */ 29380000
 /********************************************************************/ 29390000
0ROLBCAM_R089_TERM_COUNTRY: PROC;                                       29400099
                       /**********************************************/ 29410000
                       /* FILL COMPLETION DATE FOR ALL RECONCILED    */ 29420000
                       /* TYPES FOR THE COUNTRY WHICH HAS BEEN       */ 29430000
                       /* PROCESSED                                  */ 29440000
                       /**********************************************/ 29450000
 CALL ROLBCAM_R088_UPDATE_RCBV0070;                     /* RB01140   */ 29460099
                       /**********************************************/ 29470000
                       /* ADAPT THE COUNTERS ('DI COUNTS')           */ 29480000
                       /**********************************************/ 29490000
 CHKP_AREA.CNT.READ_DI = CHKP_AREA.CNT.READ_DI +                        29500000
                         CHKP_AREA.CNT_CTRY.READ_DI;                    29510000
 CHKP_AREA.CNT.PROC_DI = CHKP_AREA.CNT.PROC_DI +                        29520000
                         CHKP_AREA.CNT_CTRY.PROC_DI;                    29530000
 CHKP_AREA.CNT.SKIP_DI = CHKP_AREA.CNT.SKIP_DI +                        29540000
                         CHKP_AREA.CNT_CTRY.SKIP_DI;                    29550000
 CHKP_AREA.CNT.SW_DI   = CHKP_AREA.CNT.SW_DI +                          29560000
                         CHKP_AREA.CNT_CTRY.SW_DI;                      29570000
 CHKP_AREA.CNT.READ_DF = CHKP_AREA.CNT.READ_DF +                        29580000
                         CHKP_AREA.CNT_CTRY.READ_DF;                    29590000
 CHKP_AREA.CNT.PROC_DF = CHKP_AREA.CNT.PROC_DF +                        29600000
                         CHKP_AREA.CNT_CTRY.PROC_DF;                    29610000
 CHKP_AREA.CNT.SKIP_DF = CHKP_AREA.CNT.SKIP_DF +                        29620000
                         CHKP_AREA.CNT_CTRY.SKIP_DF;                    29630000
                                                      /* SOC RC01323 */ 29631000
 TOTAL_COUNT_SKIP_NON_RSS_DI = TOTAL_COUNT_SKIP_NON_RSS_DI +            29632000
                                COUNT_SKIP_NON_RSS_DI;                  29633000
                                                      /* EOC RC01323 */ 29634000
                       /**********************************************/ 29640000
                       /* ADAPT THE COUNTERS ('DO COUNTS')           */ 29650000
                       /**********************************************/ 29660000
 CHKP_AREA.CNT.READ_DO = CHKP_AREA.CNT.READ_DO +                        29670000
                         CHKP_AREA.CNT_CTRY.READ_DO;                    29680000
 CHKP_AREA.CNT.PROC_DO = CHKP_AREA.CNT.PROC_DO +                        29690000
                         CHKP_AREA.CNT_CTRY.PROC_DO;                    29700000
 CHKP_AREA.CNT.SKIP_DO = CHKP_AREA.CNT.SKIP_DO +                        29710000
                         CHKP_AREA.CNT_CTRY.SKIP_DO;                    29720000
 CHKP_AREA.CNT.SW_DO   = CHKP_AREA.CNT.SW_DO +                          29730000
                         CHKP_AREA.CNT_CTRY.SW_DO;                      29740000
                                                      /* SOC RC01323 */ 29741000
 TOTAL_COUNT_SKIP_NON_RSS_DO = TOTAL_COUNT_SKIP_NON_RSS_DO +            29742000
                                COUNT_SKIP_NON_RSS_DO;                  29743000
                                                      /* EOC RC01323 */ 29744000
                       /**********************************************/ 29750000
                       /* ADAPT THE COUNTERS ('DR COUNTS')           */ 29760000
                       /**********************************************/ 29770000
 CHKP_AREA.CNT.READ_DR = CHKP_AREA.CNT.READ_DR +                        29780000
                         CHKP_AREA.CNT_CTRY.READ_DR;                    29790000
 CHKP_AREA.CNT.PROC_DR = CHKP_AREA.CNT.PROC_DR +                        29800000
                         CHKP_AREA.CNT_CTRY.PROC_DR;                    29810000
 CHKP_AREA.CNT.READ_DC = CHKP_AREA.CNT.READ_DC +                        29820000
                         CHKP_AREA.CNT_CTRY.READ_DC;                    29830000
 CHKP_AREA.CNT.PROC_DC = CHKP_AREA.CNT.PROC_DC +                        29840000
                         CHKP_AREA.CNT_CTRY.PROC_DC;                    29850000
                       /**********************************************/ 29860000
                       /* ADAPT THE COUNTERS ('FILE COUNTS')         */ 29870000
                       /**********************************************/ 29880000
 CHKP_AREA.CNT.RCBBCA0 = CHKP_AREA.CNT.RCBBCA0 +                        29890000
                         CHKP_AREA.CNT_CTRY.RCBBCA0;                    29900000
 CHKP_AREA.CNT.RCBBCA1 = CHKP_AREA.CNT.RCBBCA1 +                        29910000
                         CHKP_AREA.CNT_CTRY.RCBBCA1;                    29920000
 CHKP_AREA.CNT.RCBBCA2 = CHKP_AREA.CNT.RCBBCA2 +                        29930000
                         CHKP_AREA.CNT_CTRY.RCBBCA2;                    29940000
 CHKP_AREA.CNT.RCBBCA3 = CHKP_AREA.CNT.RCBBCA3 +                        29950000
                         CHKP_AREA.CNT_CTRY.RCBBCA3;                    29960000
 CHKP_AREA.CNT.RCBBCA4 = CHKP_AREA.CNT.RCBBCA4 +                        29970000
                         CHKP_AREA.CNT_CTRY.RCBBCA4;                    29980000
 CHKP_AREA.CNT.RCBBCA5 = CHKP_AREA.CNT.RCBBCA5 +                        29990000
                         CHKP_AREA.CNT_CTRY.RCBBCA5;                    30000000
 CHKP_AREA.CNT.RCBBCA6 = CHKP_AREA.CNT.RCBBCA6 +                        30010000
                         CHKP_AREA.CNT_CTRY.RCBBCA6;                    30020000
 CHKP_AREA.CNT.RCBBCA7 = CHKP_AREA.CNT.RCBBCA7 +                        30030000
                         CHKP_AREA.CNT_CTRY.RCBBCA7;                    30040000
 CHKP_AREA.CNT.RCBBCA8 = CHKP_AREA.CNT.RCBBCA8 +                        30050000
                         CHKP_AREA.CNT_CTRY.RCBBCA8;                    30060000
 CHKP_AREA.CNT.RCBBCA9 = CHKP_AREA.CNT.RCBBCA9 +                        30070000
                         CHKP_AREA.CNT_CTRY.RCBBCA9;                    30080000
 CHKP_AREA.CNT.RCBBCAA = CHKP_AREA.CNT.RCBBCAA +                        30090000
                         CHKP_AREA.CNT_CTRY.RCBBCAA;                    30100000
 CHKP_AREA.CNT.RCBBCAB = CHKP_AREA.CNT.RCBBCAB +                        30110000
                         CHKP_AREA.CNT_CTRY.RCBBCAB;                    30120000
                       /**********************************************/ 30130000
                       /* WRITE READ + PROCESSED + SKIPPED MESSAGES  */ 30140000
                       /* FOR THE DIFFERENT DATABASES                */ 30150000
                       /**********************************************/ 30160000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30170000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 30180000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';                               30190000
                                                                        30200000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30210000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 30220000
                                                  /* SOC RC01318 */     30221000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDI0'; */                        30230000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDI0;                           30231000
                                                  /* EOC RC01318 */     30232000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.READ_DI;           30240000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 30250000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             30260000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.PROC_DI;           30270000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 30280000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             30290000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.SKIP_DI;           30300000
 PARM_INT_AREA.MSG_VAR_CODE_11  = 'C5';                                 30310000
 PARM_INT_AREA.MSG_VAR_VALUE_11 = CNT_PIC9;                             30320000
 CALL RCB0M1M(PTR_INT_AREA);                                            30330000
                                                                        30340000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30350000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 30360000
                                                  /* SOC RC01318 */     30361000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDI0 SW';*/                      30370000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDI0 || ' SW';                  30371000
                                                  /* EOC RC01318 */     30372000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.SW_DI;             30380000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 30390000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             30400000
 CALL RCB0M1M(PTR_INT_AREA);                                            30410000
                                                                        30420000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.READ_DF;           30430000
                                                  /* SOC RC01318 */     30431000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDF0';*/                         30440000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDF0;                           30440100
                                                  /* EOC RC01318 */     30441000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 30450000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             30460000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.PROC_DF;           30470000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 30480000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             30490000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.SKIP_DF;           30500000
 PARM_INT_AREA.MSG_VAR_CODE_11  = 'C5';                                 30510000
 PARM_INT_AREA.MSG_VAR_VALUE_11 = CNT_PIC9;                             30520000
 CALL RCB0M1M(PTR_INT_AREA);                                            30530000
                                                                        30540000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30550000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 30560000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.READ_DO;           30570000
                                                  /* SOC RC01318 */     30571000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDO0'; */                        30580000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDO0;                           30580100
                                                  /* EOC RC01318 */     30581000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 30590000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             30600000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.PROC_DO;           30610000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 30620000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             30630000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.SKIP_DO;           30640000
 PARM_INT_AREA.MSG_VAR_CODE_11  = 'C5';                                 30650000
 PARM_INT_AREA.MSG_VAR_VALUE_11 = CNT_PIC9;                             30660000
 CALL RCB0M1M(PTR_INT_AREA);                                            30670000
                                                                        30680000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30690000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 30700000
                                                  /* SOC RC01318 */     30701000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDO0 SW'; */                     30710000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDO0 || ' SW';                  30710100
                                                  /* EOC RC01318 */     30711000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.SW_DO;             30720000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 30730000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             30740000
 CALL RCB0M1M(PTR_INT_AREA);                                            30750000
                                                                        30760000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30770000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 30780000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.READ_DR;           30790000
                                                  /* SOC RC01318 */     30791000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDR0'; */                        30800000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDR0;                           30800100
                                                  /* EOC RC01318 */     30801000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 30810000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             30820000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.PROC_DR;           30830000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 30840000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             30850000
 CALL RCB0M1M(PTR_INT_AREA);                                            30860000
                                                                        30870000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   30880000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 30890000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.READ_DC;           30900000
                                                  /* SOC RC01318 */     30901000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDC0'; */                        30910000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDC0;                           30910100
                                                  /* EOC RC01318 */     30911000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 30920000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             30930000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.PROC_DC;           30940000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 30950000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             30960000
 CALL RCB0M1M(PTR_INT_AREA);                                            30970000
                                                                        30980000
                       /**********************************************/ 30990000
                       /* WRITE RECORD TOTAL MESSAGES (MSG 004)      */ 31000000
                       /**********************************************/ 31010000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 31020000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                               31030000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   31040000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                 31050000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                                 31060000
                                                                        31070000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA0 || ' : HW PRODUCT';       31080000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA0;           31090000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31100000
 CALL RCB0M1M(PTR_INT_AREA);                                            31110000
                                                                        31120000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA1 || ' : MES ORDER';        31130000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA1;           31140000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31150000
 CALL RCB0M1M(PTR_INT_AREA);                                            31160000
                                                                        31170000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA2 || ' : HW STATUS';        31180000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA2;           31190000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31200000
 CALL RCB0M1M(PTR_INT_AREA);                                            31210000
                                                                        31220000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA3 || ' : OU/HW';            31230000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA3;           31240000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31250000
 CALL RCB0M1M(PTR_INT_AREA);                                            31260000
                                                                        31270000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA4 || ' : HW/CUSTOMER';      31280000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA4;           31290000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31300000
 CALL RCB0M1M(PTR_INT_AREA);                                            31310000
                                                                        31320000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA5 || ' : SUPPLY CONTRACT';  31330000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA5;           31340000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31350000
 CALL RCB0M1M(PTR_INT_AREA);                                            31360000
                                                                        31370000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA6 || ' : MES/HW';           31380000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA6;           31390000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31400000
 CALL RCB0M1M(PTR_INT_AREA);                                            31410000
                                                                        31420000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA7 || ' : HW PO/ORDER';      31430000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA7;           31440000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31450000
 CALL RCB0M1M(PTR_INT_AREA);                                            31460000
                                                                        31470000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA8 || ' : HW PO REAL.';      31480000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA8;           31490000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31500000
 CALL RCB0M1M(PTR_INT_AREA);                                            31510000
                                                                        31520000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA9 || ' : FEATURES';         31530000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCA9;           31540000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31550000
 CALL RCB0M1M(PTR_INT_AREA);                                            31560000
                                                                        31570000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCAA || ' :MES/HW PO IN ORD';  31580000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCAA;           31590000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31600000
 CALL RCB0M1M(PTR_INT_AREA);                                            31610000
                                                                        31620000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCAB || ' : HW MOD. INFO';     31630000
 CNT_PIC9                       = CHKP_AREA.CNT_CTRY.RCBBCAB;           31640000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             31650000
 CALL RCB0M1M(PTR_INT_AREA);                                            31660000
                       /**********************************************/ 31670000
                       /* WRITE HASH TOTALS                          */ 31680000
                       /**********************************************/ 31690000
                                                  /* SOC RC01318 */     31691000
 /*WRK_FILE_NAME               = 'RCBBCA0';  */                         31700000
 WRK_FILE_NAME               = WRK_RCBBCA0;                             31701000
                                                  /* EOC RC01318 */     31702000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA0;        31710000
 CALL ROLBCAM_R087_UPD_RCB024;                                          31720099
                                                                        31730000
                                                  /* SOC RC01318 */     31731000
 /*WRK_FILE_NAME               = 'RCBBCA1';  */                         31740000
 WRK_FILE_NAME               = WRK_RCBBCA1;                             31740100
                                                  /* EOC RC01318 */     31741000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA1;        31750000
 CALL ROLBCAM_R087_UPD_RCB024;                                          31760099
                                                                        31770000
                                                  /* SOC RC01318 */     31771000
 /*WRK_FILE_NAME               = 'RCBBCA2';  */                         31780000
 WRK_FILE_NAME               = WRK_RCBBCA2;                             31781000
                                                  /* EOC RC01318 */     31782000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA2;        31790000
 CALL ROLBCAM_R087_UPD_RCB024;                                          31800099
                                                                        31810000
                                                  /* SOC RC01318 */     31811000
 /*WRK_FILE_NAME               = 'RCBBCA3';  */                         31820000
 WRK_FILE_NAME               = WRK_RCBBCA3;                             31820100
                                                  /* EOC RC01318 */     31821000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA3;        31830000
 CALL ROLBCAM_R087_UPD_RCB024;                                          31840099
                                                                        31850000
                                                  /* SOC RC01318 */     31851000
 /*WRK_FILE_NAME               = 'RCBBCA4';  */                         31860000
 WRK_FILE_NAME               = WRK_RCBBCA4;                             31861000
                                                  /* EOC RC01318 */     31862000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA4;        31870000
 CALL ROLBCAM_R087_UPD_RCB024;                                          31880099
                                                                        31890000
                                                  /* SOC RC01318 */     31891000
 /*WRK_FILE_NAME               = 'RCBBCA5';  */                         31900000
 WRK_FILE_NAME               = WRK_RCBBCA5;                             31900100
                                                  /* EOC RC01318 */     31901000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA5;        31910000
 CALL ROLBCAM_R087_UPD_RCB024;                                          31920099
                                                                        31930000
                                                  /* SOC RC01318 */     31931000
 /*WRK_FILE_NAME               = 'RCBBCA6';  */                         31940000
 WRK_FILE_NAME               = WRK_RCBBCA6;                             31941000
                                                  /* EOC RC01318 */     31942000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA6;        31950000
 CALL ROLBCAM_R087_UPD_RCB024;                                          31960099
                                                                        31970000
                                                  /* SOC RC01318 */     31971000
 /*WRK_FILE_NAME               = 'RCBBCA7';  */                         31980000
 WRK_FILE_NAME               = WRK_RCBBCA7;                             31981000
                                                  /* EOC RC01318 */     31982000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA7;        31990000
 CALL ROLBCAM_R087_UPD_RCB024;                                          32000099
                                                                        32010000
                                                  /* SOC RC01318 */     32011000
 /*WRK_FILE_NAME               = 'RCBBCA8';  */                         32020000
 WRK_FILE_NAME               = WRK_RCBBCA8;                             32021000
                                                  /* EOC RC01318 */     32022000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA8;        32030000
 CALL ROLBCAM_R087_UPD_RCB024;                                          32040099
                                                                        32050000
                                                  /* SOC RC01318 */     32051000
 /*WRK_FILE_NAME               = 'RCBBCA9';  */                         32060000
 WRK_FILE_NAME               = WRK_RCBBCA9;                             32061000
                                                  /* EOC RC01318 */     32062000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA9;        32070000
 CALL ROLBCAM_R087_UPD_RCB024;                                          32080099
                                                                        32090000
                                                  /* SOC RC01318 */     32091000
 /*WRK_FILE_NAME               = 'RCBBCAA';  */                         32100000
 WRK_FILE_NAME               = WRK_RCBBCAA;                             32101000
                                                  /* EOC RC01318 */     32102000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCAA;        32110000
 CALL ROLBCAM_R087_UPD_RCB024;                                          32120099
                                                                        32130000
                                                  /* SOC RC01318 */     32131000
 /*WRK_FILE_NAME               = 'RCBBCAB';  */                         32140000
 WRK_FILE_NAME               = WRK_RCBBCAB;                             32140100
                                                  /* EOC RC01318 */     32141000
 WRK_HASH_TOTAL              = CHKP_AREA.CNT_HASH_TOTAL.RCBBCAB;        32150000
 CALL ROLBCAM_R087_UPD_RCB024;                                          32160099
                       /**********************************************/ 32170000
                       /* WRITE HASH MESSAGES   (MSG 0173)           */ 32180000
                       /**********************************************/ 32190000
  PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                32200000
  PARM_INT_AREA.MESSAGE_NUMBER   = '0173';                              32210000
  PARM_INT_AREA.MSG_VAR_CODES    = '';                                  32220000
  PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                32230000
  PARM_INT_AREA.MSG_VAR_CODE_7   = 'TP';                                32240000
  PARM_INT_AREA.MSG_VAR_VALUE_7  = CHKP_AREA.DATETIME;                  32250000
  PARM_INT_AREA.MSG_VAR_CODE_8   = 'HT';                                32260000
                                                                        32270000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA0;                         32280000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA0;    32290000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32300000
  CALL RCB0M1M(PTR_INT_AREA);                                           32310000
                                                                        32320000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA1;                         32330000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA1;    32340000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32350000
  CALL RCB0M1M(PTR_INT_AREA);                                           32360000
                                                                        32370000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA2;                         32380000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA2;    32390000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32400000
  CALL RCB0M1M(PTR_INT_AREA);                                           32410000
                                                                        32420000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA3;                         32430000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA3;    32440000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32450000
  CALL RCB0M1M(PTR_INT_AREA);                                           32460000
                                                                        32470000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA4;                         32480000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA4;    32490000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32500000
  CALL RCB0M1M(PTR_INT_AREA);                                           32510000
                                                                        32520000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA5;                         32530000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA5;    32540000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32550000
  CALL RCB0M1M(PTR_INT_AREA);                                           32560000
                                                                        32570000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA6;                         32580000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA6;    32590000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32600000
  CALL RCB0M1M(PTR_INT_AREA);                                           32610000
                                                                        32620000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA7;                         32630000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA7;    32640000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32650000
  CALL RCB0M1M(PTR_INT_AREA);                                           32660000
                                                                        32670000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA8;                         32680000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA8;    32690000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32700000
  CALL RCB0M1M(PTR_INT_AREA);                                           32710000
                                                                        32720000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA9;                         32730000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCA9;    32740000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32750000
  CALL RCB0M1M(PTR_INT_AREA);                                           32760000
                                                                        32770000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCAA;                         32780000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCAA;    32790000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32800000
  CALL RCB0M1M(PTR_INT_AREA);                                           32810000
                                                                        32820000
  PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCAB;                         32830000
  CNT_PIC15                      = CHKP_AREA.CNT_HASH_TOTAL.RCBBCAB;    32840000
  PARM_INT_AREA.MSG_VAR_VALUE_8  = CNT_PIC15;                           32850000
  CALL RCB0M1M(PTR_INT_AREA);                                           32860000
                                                                        32870000
                                                      /* SOC RC01323 */ 32871000
                       /**********************************************/ 32880000
                       /* WRITE NON RSS SKIPPED MESSAGE              */ 32880100
                       /**********************************************/ 32880200
 IF WRK_RUNMODE = 'S2'THEN                                              32880300
 DO;                                                                    32880400
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     32880500
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0323';                   32880600
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       32880700
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'DB';                     32880800
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = WRK_VSDDI0;               32880900
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C5';                     32881000
 CNT_PIC9                                   = COUNT_SKIP_NON_RSS_DI;    32881100
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = CNT_PIC9;                 32881200
 CALL RCB0M1M (PTR_INT_AREA);                                           32881300
                                                                        32881400
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       32881500
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'DB';                     32881600
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = WRK_VSDDO0;               32881700
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C5';                     32881800
 CNT_PIC9                                   = COUNT_SKIP_NON_RSS_DO;    32881900
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = CNT_PIC9;                 32882000
 CALL RCB0M1M (PTR_INT_AREA);                                           32882100
 END;                                                                   32882200
                                                     /* EOC RC01323 */  32882300
                          /****************************************/    32883000
  CALL ROLBCAM_R086_UPDATE_RCB030;                                      32890099
                                                                        32900000
                          /****************************************/    32910000
  CALL ROLBCAM_RX01_CHECKPOINT;                                         32920099
                                                                        32930000
 END ROLBCAM_R089_TERM_COUNTRY;                                         32940099
1/********************************************************************/ 32950000
 /*                                                                  */ 32960000
 /* MODULE NAME      : INIT_PROGRAM                                  */ 32970000
 /*                                                                  */ 32980000
 /* DESCRIPTION      : INITIALISE PROGRAM VARIABLES. OPEN FILES      */ 32990000
 /*                                                                  */ 33000000
 /********************************************************************/ 33010000
0ROLBCAM_R090_INIT_PROGRAM: PROC;                                       33020099
                                                                        33030000
                                              /* INITIALISE POINTERS */ 33040000
 PTR_INT_AREA       = ADDR(PARM_INT_AREA);                              33050000
 PTR_COUNTRY_AREA   = ADDR(COUNTRY_AREA);                               33060000
 PTR_RETURN_AREA    = ADDR(RETURN_AREA);                                33070000
 PTR_DATE_AREA      = ADDR(DATE_AREA);                                  33080000
 PTR_FEAT_AREA      = ADDR(FEAT_AREA);                                  33090000
 PTR_RUN_DATE_AREA  = ADDR(RUN_DATE_AREA);           /* PTM 290     */  33100000
 PTR_RCBV070        = ADDR(TB_RCBV070);              /* RB01140     */  33110000
 PTR_RCBV070I       = ADDR(TB_RCBV070_I);            /* RB01140     */  33120000
 PTR_RCBV500        = ADDR(TB_RCBV500);                                 33130000
 PTR_RCBV500I       = ADDR(TB_RCBV500_I);                               33140000
                                                                        33150000
                 /* INITIALISE INTERFACE AREA AND OPEN MESSAGE FILE */  33160000
 PARM_INT_AREA.MSG_AREA        = '';                                    33170000
 PARM_INT_AREA.ERR_AREA        = '';                                    33180000
 PARM_INT_AREA.MSG_REQUEST     = 'O';                                   33190000
 PARM_INT_AREA.MSG_TARGET      = 'F';                                   33200000
 PARM_INT_AREA.ID_SOURCE_APPL  = 'RCB';                                 33210000
 PARM_INT_AREA.ID_SOURCE_PROG  = WRK_PGM_NAME;                          33220000
 PARM_INT_AREA.ID_MOD_PATH (1) = WRK_MOD_NAME;                          33230000
 PARM_INT_AREA.ID_MOD_LEVEL    = 1;                                     33240000
 PARM_INT_AREA.SYSTEM_TYPE     = WRK_SYSTEM_TYPE;                       33250000
 PARM_INT_AREA.PTR_PCB_IO      = NULL;                                  33260000
 PARM_INT_AREA.PTR_PCB_ALT     = NULL;                                  33270000
 CALL RCB0M1M(PTR_INT_AREA);                                            33280000
                                                                        33290000
                                  /* MISCELLANEOUS INITIALISATIONS */   33300000
 DB_MACH_INV  = '';                                                     33310000
 DB_MACH_ORD  = '';                                                     33320000
 DB_MACH_CAP  = '';                                                     33330000
 DB_MACH_REM  = '';                                                     33340000
 DB_MACH_FEAT = '';                                                     33350000
 WRK_LENGTH_RCB024      = CSTG (PARM_HASH.TIME_STAMP) +                 33360000
                          CSTG (PARM_HASH.HASH_TOTAL);                  33370000
                                                                        33380000
                /* RETRIEVE SYSTEM DATE AND STORE IN PARM_INT_AREA */   33390000
 CALL RCB0T1M (PTR_INT_AREA);                                           33400000
                                                                        33410000
                                                                        33420000
                        /* INITIALISE CHECKPOINT/RESTART VARIABLES */   33430000
 PTR_CHKP_LEN_IO     = ADDR(CHKP_LEN_IO);                               33440000
 PTR_CHKP_LEN_AREA   = ADDR(CHKP_LEN_AREA);                             33450000
 PTR_CHKP_AREA       = ADDR(CHKP_AREA);                                 33460000
 PTR_CHKP_ID         = ADDR(CHKP_ID);                                   33470000
 PTR_CHKP_XRST       = ADDR(CHKP_XRST);                                 33480000
 CHKP_ID.NAME        = SUBSTR(WRK_PGM_NAME,4,3);                        33490000
 CHKP_LEN_IO         = STG(CHKP_XRST);                                  33500000
 CHKP_LEN_AREA       = STG(CHKP_AREA);                                  33510000
 CHKP_AREA           = '';                                              33520000
 CHKP_XRST           = '';                                              33530000
 CHKP_CNT_STEPS      = 0;                                               33540000
 SWITCH_RSTRT        = FALSE;                                           33550000
                                                                        33560000
 CALL ROLBCAM_R094_READ_PARMS;                         /* RC01318 */    33561099
                                                                        33562000
                        /********************************************/  33570000
                        /* DETERMINE CHECKPOINT TO RESTART PROGRAM  */  33580000
                        /********************************************/  33590000
                                                                        33600000
 CALL PLITDLI(SIX,XRST,PTR_PCB_IO,PTR_CHKP_LEN_IO,PTR_CHKP_XRST,        33610000
              PTR_CHKP_LEN_AREA,PTR_CHKP_AREA);                         33620000
                                                                        33630000
 SELECT (PCB_IO.ST_CODE);                                               33640000
 WHEN ('  ');                                                           33650000
 OTHERWISE                                                              33660000
   CALL ROLBCAM_ERROR(PTR_PCB_IO,'IMS-IO','#033');                      33670099
 END;                                                                   33680000
                                                                        33690000
 IF CHKP_XRST.NAME = ' '                                                33700000
 THEN                                                                   33710000
                       /*********************************************/  33720000
                       /*   NORMAL START                            */  33730000
                       /*********************************************/  33740000
   DO;                                                                  33750000
     CHKP_AREA.CNT_NUM = 0;                                             33760000
                                                                        33770000
     CALL ROLBCAM_R091_OPEN_FILES;                                      33781099
     CALL ROLBCAM_R092_INIT_NORMAL;                                     33790099
     CALL ROLBCAM_R093_WRITE_HEADERS;                                   33800099
                                                                        33810000
     CALL ROLBCAM_RX01_CHECKPOINT;                                      33820099
                                                                        33830000
   END;                                                                 33840000
 ELSE                                                                   33850000
                       /*********************************************/  33860000
                       /*  RESTART                                  */  33870000
                       /*********************************************/  33880000
   DO;                                                                  33890000
     CHKP_AREA.CNT_NUM = CHKP_XRST.NUMBER;                              33900000
     IF CHKP_AREA.CNT_NUM > 1                                           33910000
     THEN                                                               33920000
       SWITCH_RSTRT = TRUE;                                             33930000
     ELSE                                                               33940000
       CALL ROLBCAM_R092_INIT_NORMAL;                                   33950099
   END;                                                                 33960000
                                                                        33970000
                       /*  INITIALISE SSA'S                         */  33980000
                                                                        33990000
 SSA_RRDDI1.CTRYNO1  =  ' ' || CHKP_AREA.COUNTRY;                       34000000
 SSA_RRDDI1.CMAXA1   = CHKP_AREA.MACHTYPE;                              34010000
 SSA_RRDDI1.RMAXA1   = CHKP_AREA.SERIAL;                                34020000
 SSA_RRDDI1.CTRYNO2  =  ' ' || CHKP_AREA.COUNTRY;                       34030000
 SSA_RRDDI1.CMAXA2   = HIGH(4);                                         34040000
 SSA_RRDDI1.RMAXA2   = HIGH(7);                                         34050000
                                                                        34060000
 SSA_RRDDO1.CTRYNO1  =  ' ' || CHKP_AREA.COUNTRY;                       34070000
 SSA_RRDDO1.RORXA1   = CHKP_AREA.ORDER_NUMBER;                          34080000
 SSA_RRDDO1.CTRYNO2  =  ' ' || CHKP_AREA.COUNTRY;                       34090000
                                                                        34100000
 /*******************************************************************/  34101000
 /* RETRIEVE FLEXIBLE TYPE OF WARRANTY FROM GEO LEVEL PARAM RCB063  */  34102000
 /*******************************************************************/  34103000
 CALL ROLBCAM_RX12_GET_F_TOW_RCB063;                      /* RB01281 */ 34104099
 CALL ROLBCAM_RX13_GET_F_REC_RCBT690;                /* CEDS00000352 */ 34105099
 END ROLBCAM_R090_INIT_PROGRAM;                                         34110099
1/********************************************************************/ 34120000
 /*                                                                  */ 34130000
 /* MODULE NAME      : OPEN_FILES                                    */ 34140000
 /*                                                                  */ 34150000
 /* DESCRIPTION      : OPEN GSAM OUTPUT FILES                        */ 34160000
 /*                                                                  */ 34170000
 /********************************************************************/ 34180000
0ROLBCAM_R091_OPEN_FILES: PROC;                                         34190099
                                                                        34200000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA0);                                   34210000
 IF PCB_RCBBCA0.ST_CODE ¬= '  '                                         34220000
 THEN                                                                   34230000
   CALL ROLBCAM_ERROR(PTR_RCBBCA0,'IMS_DB','#034');                     34240099
                                                                        34250000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA1);                                   34260000
 IF PCB_RCBBCA1.ST_CODE ¬= '  '                                         34270000
 THEN                                                                   34280000
   CALL ROLBCAM_ERROR(PTR_RCBBCA1,'IMS_DB','#035');                     34290099
                                                                        34300000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA2);                                   34310000
 IF PCB_RCBBCA2.ST_CODE ¬= '  '                                         34320000
 THEN                                                                   34330000
   CALL ROLBCAM_ERROR(PTR_RCBBCA2,'IMS_DB','#036');                     34340099
                                                                        34350000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA3);                                   34360000
 IF PCB_RCBBCA3.ST_CODE ¬= '  '                                         34370000
 THEN                                                                   34380000
   CALL ROLBCAM_ERROR(PTR_RCBBCA3,'IMS_DB','#037');                     34390099
                                                                        34400000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA4);                                   34410000
 IF PCB_RCBBCA4.ST_CODE ¬= '  '                                         34420000
 THEN                                                                   34430000
   CALL ROLBCAM_ERROR(PTR_RCBBCA4,'IMS_DB','#038');                     34440099
                                                                        34450000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA5);                                   34460000
 IF PCB_RCBBCA5.ST_CODE ¬= '  '                                         34470000
 THEN                                                                   34480000
   CALL ROLBCAM_ERROR(PTR_RCBBCA5,'IMS_DB','#039');                     34490099
                                                                        34500000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA6);                                   34510000
 IF PCB_RCBBCA6.ST_CODE ¬= '  '                                         34520000
 THEN                                                                   34530000
   CALL ROLBCAM_ERROR(PTR_RCBBCA6,'IMS_DB','#040');                     34540099
                                                                        34550000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA7);                                   34560000
 IF PCB_RCBBCA7.ST_CODE ¬= '  '                                         34570000
 THEN                                                                   34580000
   CALL ROLBCAM_ERROR(PTR_RCBBCA7,'IMS_DB','#041');                     34590099
                                                                        34600000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA8);                                   34610000
 IF PCB_RCBBCA8.ST_CODE ¬= '  '                                         34620000
 THEN                                                                   34630000
   CALL ROLBCAM_ERROR(PTR_RCBBCA8,'IMS_DB','#042');                     34640099
                                                                        34650000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCA9);                                   34660000
 IF PCB_RCBBCA9.ST_CODE ¬= '  '                                         34670000
 THEN                                                                   34680000
   CALL ROLBCAM_ERROR(PTR_RCBBCA9,'IMS_DB','#043');                     34690099
                                                                        34700000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCAA);                                   34710000
 IF PCB_RCBBCAA.ST_CODE ¬= '  '                                         34720000
 THEN                                                                   34730000
   CALL ROLBCAM_ERROR(PTR_RCBBCAA,'IMS_DB','#044');                     34740099
                                                                        34750000
 CALL PLITDLI (TWO,OPEN,PTR_RCBBCAB);                                   34760000
 IF PCB_RCBBCAB.ST_CODE ¬= '  '                                         34770000
 THEN                                                                   34780000
   CALL ROLBCAM_ERROR(PTR_RCBBCAB,'IMS_DB','#045');                     34790099
                                                                        34800000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   34810000
                                                                        34820000
 END ROLBCAM_R091_OPEN_FILES;                                           34830099
1/********************************************************************/ 34840000
 /*                                                                  */ 34850000
 /* MODULE NAME      : INIT_NORMAL                                   */ 34860000
 /*                                                                  */ 34870000
 /* DESCRIPTION      : INITIALISE VARIABLES (NORMAL START OR DUMMY   */ 34880000
 /*                    CHECKPOINT ONLY).                             */ 34890000
 /*                                                                  */ 34900000
 /********************************************************************/ 34910000
0ROLBCAM_R092_INIT_NORMAL : PROC;                                       34920099
                                                                        34930000
 CALL RCB019M (PTR_COUNTRY_AREA,         /* RETRIEVE ALL COUNTRIES */   34940000
               PTR_INT_AREA);                                           34950000
                                                                        34960000
 IF COUNTRY_AREA.COUNT_CTRY = 0                                         34970000
 THEN                                                                   34980000
   DO;                                                                  34990000
     PARM_INT_AREA.COUNTRY_NUMBER    = '';                              35000000
     PARM_INT_AREA.MSG_VAR_CODES     = '';                              35010000
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS';                            35020000
     PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                          35030000
     CALL RCB0M1M (PTR_INT_AREA);                                       35040000
     CALL ROLBCAM_ERROR (NULL, 'OTHER', '#046');                        35050099
   END;                                                                 35060000
                                                                        35070000
 CHKP_AREA.COUNTRY_AREA = COUNTRY_AREA, BY NAME;                        35080000
                                                                        35090000
 CHKP_AREA.SWITCH_CUF_DI           = TRUE;                              35100000
 CHKP_AREA.SWITCH_CUF_DO           = TRUE;                              35110000
 CHKP_AREA.SWITCH_END_COUNTRIES    = FALSE;                             35120000
 CHKP_AREA.NBR_ARRAY               = 0;                                 35130000
 CHKP_AREA.COUNTRY                 = '';                                35140000
 CHKP_AREA.PGR_RUN_TYPE            = '';                                35150000
                                                                        35160000
 END ROLBCAM_R092_INIT_NORMAL;                                          35170099
1/********************************************************************/ 35180000
 /*                                                                  */ 35190000
 /* MODULE NAME      : WRITE_HEADERS                                 */ 35200000
 /*                                                                  */ 35210000
 /* DESCRIPTION      : WRITE HEADER RECORDS TO OUTPUT FILES          */ 35220000
 /*                                                                  */ 35230000
 /********************************************************************/ 35240000
0ROLBCAM_R093_WRITE_HEADERS: PROC;                                      35250099
                                                                        35260000
                      /* TIMESTAMP FOR HEADER RECORDS OUTPUT FILES */   35270000
 CHKP_AREA.DATETIME = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();       35280000
                                                                        35290000
 RCBBCA0_REC                     = ' ';                                 35300000
 RCBBCA0_HEADER.REC_TYPE         = '01';                                35310000
 RCBBCA0_HEADER.FILE_ID          = WRK_RCBBCA0;                         35320000
 RCBBCA0_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              35330000
 RCBBCA0_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  35340000
                                                                        35350000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA0,RCBBCA0_REC);                      35360000
 IF PCB_RCBBCA0.ST_CODE ¬= '  '                                         35370000
 THEN                                                                   35380000
   CALL ROLBCAM_ERROR(PTR_RCBBCA0,'IMS_DB','#047');                     35390099
                                                                        35400000
 RCBBCA1_REC                     = ' ';                                 35410000
 RCBBCA1_HEADER.REC_TYPE         = '01';                                35420000
 RCBBCA1_HEADER.FILE_ID          = WRK_RCBBCA1;                         35430000
 RCBBCA1_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              35440000
 RCBBCA1_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  35450000
                                                                        35460000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA1,RCBBCA1_REC);                      35470000
 IF PCB_RCBBCA1.ST_CODE ¬= '  '                                         35480000
 THEN                                                                   35490000
   CALL ROLBCAM_ERROR(PTR_RCBBCA1,'IMS_DB','#048');                     35500099
                                                                        35510000
 RCBBCA2_REC                     = ' ';                                 35520000
 RCBBCA2_HEADER.REC_TYPE         = '01';                                35530000
 RCBBCA2_HEADER.FILE_ID          = WRK_RCBBCA2;                         35540000
 RCBBCA2_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              35550000
 RCBBCA2_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  35560000
                                                                        35570000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA2,RCBBCA2_REC);                      35580000
 IF PCB_RCBBCA2.ST_CODE ¬= '  '                                         35590000
 THEN                                                                   35600000
   CALL ROLBCAM_ERROR(PTR_RCBBCA2,'IMS_DB','#049');                     35610099
                                                                        35620000
 RCBBCA3_REC                     = ' ';                                 35630000
 RCBBCA3_HEADER.REC_TYPE         = '01';                                35640000
 RCBBCA3_HEADER.FILE_ID          = WRK_RCBBCA3;                         35650000
 RCBBCA3_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              35660000
 RCBBCA3_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  35670000
                                                                        35680000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA3,RCBBCA3_REC);                      35690000
 IF PCB_RCBBCA3.ST_CODE ¬= '  '                                         35700000
 THEN                                                                   35710000
   CALL ROLBCAM_ERROR(PTR_RCBBCA3,'IMS_DB','#050');                     35720099
                                                                        35730000
 RCBBCA4_REC                     = ' ';                                 35740000
 RCBBCA4_HEADER.REC_TYPE         = '01';                                35750000
 RCBBCA4_HEADER.FILE_ID          = WRK_RCBBCA4;                         35760000
 RCBBCA4_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              35770000
 RCBBCA4_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  35780000
                                                                        35790000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA4,RCBBCA4_REC);                      35800000
 IF PCB_RCBBCA4.ST_CODE ¬= '  '                                         35810000
 THEN                                                                   35820000
   CALL ROLBCAM_ERROR(PTR_RCBBCA4,'IMS_DB','#051');                     35830099
                                                                        35840000
 RCBBCA5_REC                     = ' ';                                 35850000
 RCBBCA5_HEADER.REC_TYPE         = '01';                                35860000
 RCBBCA5_HEADER.FILE_ID          = WRK_RCBBCA5;                         35870000
 RCBBCA5_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              35880000
 RCBBCA5_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  35890000
                                                                        35900000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA5,RCBBCA5_REC);                      35910000
 IF PCB_RCBBCA5.ST_CODE ¬= '  '                                         35920000
 THEN                                                                   35930000
   CALL ROLBCAM_ERROR(PTR_RCBBCA5,'IMS_DB','#052');                     35940099
                                                                        35950000
 RCBBCA6_REC                     = ' ';                                 35960000
 RCBBCA6_HEADER.REC_TYPE         = '01';                                35970000
 RCBBCA6_HEADER.FILE_ID          = WRK_RCBBCA6;                         35980000
 RCBBCA6_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              35990000
 RCBBCA6_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  36000000
                                                                        36010000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA6,RCBBCA6_REC);                      36020000
 IF PCB_RCBBCA6.ST_CODE ¬= '  '                                         36030000
 THEN                                                                   36040000
   CALL ROLBCAM_ERROR(PTR_RCBBCA6,'IMS_DB','#053');                     36050099
                                                                        36060000
 RCBBCA7_REC                     = ' ';                                 36070000
 RCBBCA7_HEADER.REC_TYPE         = '01';                                36080000
 RCBBCA7_HEADER.FILE_ID          = WRK_RCBBCA7;                         36090000
 RCBBCA7_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              36100000
 RCBBCA7_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  36110000
                                                                        36120000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA7,RCBBCA7_REC);                      36130000
 IF PCB_RCBBCA7.ST_CODE ¬= '  '                                         36140000
 THEN                                                                   36150000
   CALL ROLBCAM_ERROR(PTR_RCBBCA7,'IMS_DB','#054');                     36160099
                                                                        36170000
 RCBBCA8_REC                     = ' ';                                 36180000
 RCBBCA8_HEADER.REC_TYPE         = '01';                                36190000
 RCBBCA8_HEADER.FILE_ID          = WRK_RCBBCA8;                         36200000
 RCBBCA8_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              36210000
 RCBBCA8_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  36220000
                                                                        36230000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA8,RCBBCA8_REC);                      36240000
 IF PCB_RCBBCA8.ST_CODE ¬= '  '                                         36250000
 THEN                                                                   36260000
   CALL ROLBCAM_ERROR(PTR_RCBBCA8,'IMS_DB','#055');                     36270099
                                                                        36280000
 RCBBCA9_REC                     = ' ';                                 36290000
 RCBBCA9_HEADER.REC_TYPE         = '01';                                36300000
 RCBBCA9_HEADER.FILE_ID          = WRK_RCBBCA9;                         36310000
 RCBBCA9_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              36320000
 RCBBCA9_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  36330000
                                                                        36340000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA9,RCBBCA9_REC);                      36350000
 IF PCB_RCBBCA9.ST_CODE ¬= '  '                                         36360000
 THEN                                                                   36370000
   CALL ROLBCAM_ERROR(PTR_RCBBCA9,'IMS_DB','#056');                     36380099
                                                                        36390000
 RCBBCAA_REC                     = ' ';                                 36400000
 RCBBCAA_HEADER.REC_TYPE         = '01';                                36410000
 RCBBCAA_HEADER.FILE_ID          = WRK_RCBBCAA;                         36420000
 RCBBCAA_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              36430000
 RCBBCAA_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  36440000
                                                                        36450000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCAA,RCBBCAA_REC);                      36460000
 IF PCB_RCBBCAA.ST_CODE ¬= '  '                                         36470000
 THEN                                                                   36480000
   CALL ROLBCAM_ERROR(PTR_RCBBCAA,'IMS_DB','#057');                     36490099
                                                                        36500000
 RCBBCAB_REC                     = ' ';                                 36510000
 RCBBCAB_HEADER.REC_TYPE         = '01';                                36520000
 RCBBCAB_HEADER.FILE_ID          = WRK_RCBBCAB;                         36530000
 RCBBCAB_HEADER.SOURCE_INDICATOR = WRK_SOURCE_IND.SRC_SOF;              36540000
 RCBBCAB_HEADER.TIMESTAMP        = CHKP_AREA.DATETIME;                  36550000
                                                                        36560000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCAB,RCBBCAB_REC);                      36570000
 IF PCB_RCBBCAB.ST_CODE ¬= '  '                                         36580000
 THEN                                                                   36590000
   CALL ROLBCAM_ERROR(PTR_RCBBCAB,'IMS_DB','#058');                     36600099
                                                                        36610000
 CHKP_CNT_STEPS = CHKP_CNT_STEPS + 1;                                   36620000
                                                                        36630000
 END ROLBCAM_R093_WRITE_HEADERS;                                        36640099
1/********************************************************************/ 36641000
 /*                                                                  */ 36642000
 /* MODULE NAME      : READ_PARMS                                    */ 36643000
 /*                                                                  */ 36644000
 /* DESCRIPTION      : OPEN THE PARAMETER FILE - RCBBC2I             */ 36645000
 /*                    READ THE PARAMETER FROM RCBBC2I FILE          */ 36645100
 /*                    VALIDATE THE DATA RECEIVED                    */ 36646000
 /*                    OVER-WRITE THE FILENAMES ACCORDINGLY          */ 36646100
 /*                                                                  */ 36647000
 /********************************************************************/ 36648000
0ROLBCAM_R094_READ_PARMS: PROC;                       /* SOC RC01318 */ 36649099
                                                                        36649100
 OPEN FILE(RCBBC2I);                                                    36649200
                                                                        36649300
 READ FILE (RCBBC2I) INTO (RCBBC2I_REC);                                36649500
                                                                        36649700
 IF ¬EOF_RCBBC2I                                                        36650100
 THEN                                                                   36650200
   DO;                                                                  36650300
    WRK_RCBBC2I = TRIM(RCBBC2I_REC);                                    36651900
    WRK_LEN_RCBBC2I = LENGTH(WRK_RCBBC2I);                              36652000
                                                                        36652100
    IF WRK_LEN_RCBBC2I ¬= 0 THEN                                        36652200
    DO;                                                                 36652300
      WRK_COMMA_POS = INDEX(WRK_RCBBC2I,',');                           36652400
      WRK_COMMA_NEXT_POS = INDEX(WRK_RCBBC2I,',',WRK_COMMA_POS+1);      36652500
                                                                        36652800
      IF WRK_COMMA_POS ¬= 1 THEN                                        36652900
           WRK_RUNMODE = SUBSTR(WRK_RCBBC2I,1,WRK_COMMA_POS-1)          36653000
      ELSE WRK_RUNMODE = ' ';                                           36653100
                                                                        36653200
      IF WRK_COMMA_NEXT_POS ¬= 2 THEN                                   36653300
      DO;                                                               36653400
        WRK_LEN_FILENAM =  WRK_COMMA_NEXT_POS - (WRK_COMMA_POS-1);      36653500
        WRK_FILENAM =                                                   36653600
          SUBSTR(WRK_RCBBC2I,WRK_COMMA_POS+1,WRK_LEN_FILENAM);          36653700
      END;                                                              36654000
      ELSE WRK_FILENAM = ' ';                                           36654100
                                                                        36654200
      IF WRK_LEN_RCBBC2I ¬= 2 THEN                                      36654300
      DO;                                                               36654400
        WRK_LEN_VSAMNAM =  WRK_LEN_RCBBC2I - WRK_COMMA_NEXT_POS;        36654500
        WRK_VSAMNAM =                                                   36654600
          SUBSTR(WRK_RCBBC2I,WRK_COMMA_NEXT_POS+1,WRK_LEN_VSAMNAM);     36654700
      END;                                                              36654800
      ELSE WRK_VSAMNAM = ' ';                                           36654900
    END;                                                                36655000
                                                                        36655500
    SELECT (WRK_RUNMODE);                                               36655600
    WHEN ('  ')                                                         36655700
      DO;                                                               36655800
        IF (WRK_FILENAM = '  ' | WRK_FILENAM = 'CA')                    36655900
         & (WRK_VSAMNAM = '  ' | WRK_VSAMNAM = 'SD')                    36656000
           THEN                                                         36656100
           DO;                                                          36656200
             WRK_VSDDI0  = 'VSDDI0';                                    36656300
             WRK_VSDDF0  = 'VSDDF0';                                    36656400
             WRK_VSDDO0  = 'VSDDO0';                                    36656500
             WRK_VSDDR0  = 'VSDDR0';                                    36656600
             WRK_VSDDC0  = 'VSDDC0';                                    36656700
           END;                                                         36656800
      END;                                                              36658100
    WHEN ('CA')                                                         36658200
      DO;                                                               36658300
        IF WRK_FILENAM = 'CA' &                                         36658400
           WRK_VSAMNAM = 'SD' THEN                                      36658500
           DO;                                                          36658700
             WRK_VSDDI0  = 'VSDDI0';                                    36658800
             WRK_VSDDF0  = 'VSDDF0';                                    36658900
             WRK_VSDDO0  = 'VSDDO0';                                    36659000
             WRK_VSDDR0  = 'VSDDR0';                                    36659100
             WRK_VSDDC0  = 'VSDDC0';                                    36659200
           END;                                                         36659300
      END;                                                              36660600
    WHEN ('S1')                                                         36660700
      DO;                                                               36660800
        IF WRK_FILENAM = 'S1' &                                         36660900
           WRK_VSAMNAM = 'S1' THEN                                      36661000
           DO;                                                          36661100
             WRK_RCBBCA0 = 'RCBBS16';                                   36661200
             WRK_RCBBCA1 = 'RCBBS17';                                   36661300
             WRK_RCBBCA2 = 'RCBBS18';                                   36661400
             WRK_RCBBCA3 = 'RCBBS19';                                   36661500
             WRK_RCBBCA4 = 'RCBBS1A';                                   36661600
             WRK_RCBBCA5 = 'RCBBS1B';                                   36661700
             WRK_RCBBCA6 = 'RCBBS1C';                                   36661800
             WRK_RCBBCA7 = 'RCBBS1D';                                   36661900
             WRK_RCBBCA8 = 'RCBBS1E';                                   36662000
             WRK_RCBBCA9 = 'RCBBS1F';                                   36662100
             WRK_RCBBCAA = 'RCBBS1G';                                   36662200
             WRK_RCBBCAB = 'RCBBS1H';                                   36662300
             WRK_VSDDI0  = 'VS1DI0';                                    36662400
             WRK_VSDDF0  = 'VS1DF0';                                    36662500
             WRK_VSDDO0  = 'VS1DO0';                                    36662600
             WRK_VSDDR0  = 'VS1DR0';                                    36662700
             WRK_VSDDC0  = 'VS1DC0';                                    36662800
           END;                                                         36662900
      END;                                                              36664200
    WHEN ('S2')                                                         36664300
      DO;                                                               36664400
        IF WRK_FILENAM = 'S2' &                                         36664500
           WRK_VSAMNAM = 'S2' THEN                                      36664600
           DO;                                                          36664700
             WRK_RCBBCA0 = 'RCBBS26';                                   36664800
             WRK_RCBBCA1 = 'RCBBS27';                                   36664900
             WRK_RCBBCA2 = 'RCBBS28';                                   36665000
             WRK_RCBBCA3 = 'RCBBS29';                                   36665100
             WRK_RCBBCA4 = 'RCBBS2A';                                   36665200
             WRK_RCBBCA5 = 'RCBBS2B';                                   36665300
             WRK_RCBBCA6 = 'RCBBS2C';                                   36665400
             WRK_RCBBCA7 = 'RCBBS2D';                                   36665500
             WRK_RCBBCA8 = 'RCBBS2E';                                   36665600
             WRK_RCBBCA9 = 'RCBBS2F';                                   36665700
             WRK_RCBBCAA = 'RCBBS2G';                                   36665800
             WRK_RCBBCAB = 'RCBBS2H';                                   36665900
             WRK_VSDDI0  = 'VS2DI0';                                    36666000
             WRK_VSDDF0  = 'VS2DF0';                                    36666100
             WRK_VSDDO0  = 'VS2DO0';                                    36666200
             WRK_VSDDR0  = 'VS2DR0';                                    36666300
             WRK_VSDDC0  = 'VS2DC0';                                    36666400
           END;                                                         36666500
      END;                                                              36667800
    OTHERWISE                                                           36667900
      CALL ROLBCAM_ERROR(NULL,'OTHER','#092');                          36668099
    END;                                                                36668100
                                                                        36668200
   END;                                                                 36668300
                                                                        36668400
 CLOSE FILE(RCBBC2I);                                                   36668500
                                                                        36668600
 END ROLBCAM_R094_READ_PARMS;                         /* EOC RC01318 */ 36668799
1/********************************************************************/ 36668800
 /*                                                                  */ 36669000
 /* MODULE NAME      : WRITE_TRAILERS                                */ 36670000
 /*                                                                  */ 36680000
 /* DESCRIPTION      : WRITE TRAILER RECORDS TO OUTPUT FILES AND     */ 36690000
 /*                    CLOSE FILES.                                  */ 36700000
 /*                                                                  */ 36710000
 /********************************************************************/ 36720000
0ROLBCAM_R098_WRITE_TRAILERS: PROC;                                     36730099
                                                                        36740000
 RCBBCA0_REC              = ' ';                                        36750000
 RCBBCA0_TRAILER.REC_TYPE = '99';                                       36760000
 RCBBCA0_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA0;                      36770000
                                                                        36780000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA0,RCBBCA0_REC);                      36790000
 IF PCB_RCBBCA0.ST_CODE ¬= '  '                                         36800000
 THEN                                                                   36810000
   CALL ROLBCAM_ERROR(PTR_RCBBCA0,'IMS_DB','#059');                     36820099
                                                                        36830000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA0);                                   36840000
 IF PCB_RCBBCA0.ST_CODE ¬= '  '                                         36850000
 THEN                                                                   36860000
   CALL ROLBCAM_ERROR(PTR_RCBBCA0,'IMS_DB','#060');                     36870099
                                                                        36880000
 RCBBCA1_REC              = '  ';                                       36890000
 RCBBCA1_TRAILER.REC_TYPE = '99';                                       36900000
 RCBBCA1_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA1;                      36910000
                                                                        36920000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA1,RCBBCA1_REC);                      36930000
 IF PCB_RCBBCA1.ST_CODE ¬= '  '                                         36940000
 THEN                                                                   36950000
   CALL ROLBCAM_ERROR(PTR_RCBBCA1,'IMS_DB','#061');                     36960099
                                                                        36970000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA1);                                   36980000
 IF PCB_RCBBCA1.ST_CODE ¬= '  '                                         36990000
 THEN                                                                   37000000
   CALL ROLBCAM_ERROR(PTR_RCBBCA1,'IMS_DB','#062');                     37010099
                                                                        37020000
 RCBBCA2_REC              = '  ';                                       37030000
 RCBBCA2_TRAILER.REC_TYPE = '99';                                       37040000
 RCBBCA2_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA2;                      37050000
                                                                        37060000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA2,RCBBCA2_REC);                      37070000
 IF PCB_RCBBCA2.ST_CODE ¬= '  '                                         37080000
 THEN                                                                   37090000
   CALL ROLBCAM_ERROR(PTR_RCBBCA2,'IMS_DB','#063');                     37100099
                                                                        37110000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA2);                                   37120000
 IF PCB_RCBBCA2.ST_CODE ¬= '  '                                         37130000
 THEN                                                                   37140000
   CALL ROLBCAM_ERROR(PTR_RCBBCA2,'IMS_DB','#064');                     37150099
                                                                        37160000
 RCBBCA3_REC              = '  ';                                       37170000
 RCBBCA3_TRAILER.REC_TYPE = '99';                                       37180000
 RCBBCA3_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA3;                      37190000
                                                                        37200000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA3,RCBBCA3_REC);                      37210000
 IF PCB_RCBBCA3.ST_CODE ¬= '  '                                         37220000
 THEN                                                                   37230000
   CALL ROLBCAM_ERROR(PTR_RCBBCA3,'IMS_DB','#065');                     37240099
                                                                        37250000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA3);                                   37260000
 IF PCB_RCBBCA3.ST_CODE ¬= '  '                                         37270000
 THEN                                                                   37280000
   CALL ROLBCAM_ERROR(PTR_RCBBCA3,'IMS_DB','#066');                     37290099
                                                                        37300000
 RCBBCA4_REC              = '  ';                                       37310000
 RCBBCA4_TRAILER.REC_TYPE = '99';                                       37320000
 RCBBCA4_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA4;                      37330000
                                                                        37340000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA4,RCBBCA4_REC);                      37350000
 IF PCB_RCBBCA4.ST_CODE ¬= '  '                                         37360000
 THEN                                                                   37370000
   CALL ROLBCAM_ERROR(PTR_RCBBCA4,'IMS_DB','#067');                     37380099
                                                                        37390000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA4);                                   37400000
 IF PCB_RCBBCA4.ST_CODE ¬= '  '                                         37410000
 THEN                                                                   37420000
   CALL ROLBCAM_ERROR(PTR_RCBBCA4,'IMS_DB','#068');                     37430099
                                                                        37440000
 RCBBCA5_REC              = '  ';                                       37450000
 RCBBCA5_TRAILER.REC_TYPE = '99';                                       37460000
 RCBBCA5_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA5;                      37470000
                                                                        37480000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA5,RCBBCA5_REC);                      37490000
 IF PCB_RCBBCA5.ST_CODE ¬= '  '                                         37500000
 THEN                                                                   37510000
   CALL ROLBCAM_ERROR(PTR_RCBBCA5,'IMS_DB','#069');                     37520099
                                                                        37530000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA5);                                   37540000
 IF PCB_RCBBCA5.ST_CODE ¬= '  '                                         37550000
 THEN                                                                   37560000
   CALL ROLBCAM_ERROR(PTR_RCBBCA5,'IMS_DB','#070');                     37570099
                                                                        37580000
 RCBBCA6_REC              = '  ';                                       37590000
 RCBBCA6_TRAILER.REC_TYPE = '99';                                       37600000
 RCBBCA6_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA6;                      37610000
                                                                        37620000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA6,RCBBCA6_REC);                      37630000
 IF PCB_RCBBCA6.ST_CODE ¬= '  '                                         37640000
 THEN                                                                   37650000
   CALL ROLBCAM_ERROR(PTR_RCBBCA6,'IMS_DB','#071');                     37660099
                                                                        37670000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA6);                                   37680000
 IF PCB_RCBBCA6.ST_CODE ¬= '  '                                         37690000
 THEN                                                                   37700000
   CALL ROLBCAM_ERROR(PTR_RCBBCA6,'IMS_DB','#072');                     37710099
                                                                        37720000
 RCBBCA7_REC              = '  ';                                       37730000
 RCBBCA7_TRAILER.REC_TYPE = '99';                                       37740000
 RCBBCA7_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA7;                      37750000
                                                                        37760000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA7,RCBBCA7_REC);                      37770000
 IF PCB_RCBBCA7.ST_CODE ¬= '  '                                         37780000
 THEN                                                                   37790000
   CALL ROLBCAM_ERROR(PTR_RCBBCA7,'IMS_DB','#073');                     37800099
                                                                        37810000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA7);                                   37820000
 IF PCB_RCBBCA7.ST_CODE ¬= '  '                                         37830000
 THEN                                                                   37840000
   CALL ROLBCAM_ERROR(PTR_RCBBCA7,'IMS_DB','#074');                     37850099
                                                                        37860000
 RCBBCA8_REC              = '  ';                                       37870000
 RCBBCA8_TRAILER.REC_TYPE = '99';                                       37880000
 RCBBCA8_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA8;                      37890000
                                                                        37900000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA8,RCBBCA8_REC);                      37910000
 IF PCB_RCBBCA8.ST_CODE ¬= '  '                                         37920000
 THEN                                                                   37930000
   CALL ROLBCAM_ERROR(PTR_RCBBCA8,'IMS_DB','#075');                     37940099
                                                                        37950000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA8);                                   37960000
 IF PCB_RCBBCA8.ST_CODE ¬= '  '                                         37970000
 THEN                                                                   37980000
   CALL ROLBCAM_ERROR(PTR_RCBBCA8,'IMS_DB','#076');                     37990099
                                                                        38000000
 RCBBCA9_REC              = '  ';                                       38010000
 RCBBCA9_TRAILER.REC_TYPE = '99';                                       38020000
 RCBBCA9_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCA9;                      38030000
                                                                        38040000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCA9,RCBBCA9_REC);                      38050000
 IF PCB_RCBBCA9.ST_CODE ¬= '  '                                         38060000
 THEN                                                                   38070000
   CALL ROLBCAM_ERROR(PTR_RCBBCA9,'IMS_DB','#077');                     38080099
                                                                        38090000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCA9);                                   38100000
 IF PCB_RCBBCA9.ST_CODE ¬= '  '                                         38110000
 THEN                                                                   38120000
   CALL ROLBCAM_ERROR(PTR_RCBBCA9,'IMS_DB','#078');                     38130099
                                                                        38140000
 RCBBCAA_REC              = '  ';                                       38150000
 RCBBCAA_TRAILER.REC_TYPE = '99';                                       38160000
 RCBBCAA_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCAA;                      38170000
                                                                        38180000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCAA,RCBBCAA_REC);                      38190000
 IF PCB_RCBBCAA.ST_CODE ¬= '  '                                         38200000
 THEN                                                                   38210000
   CALL ROLBCAM_ERROR(PTR_RCBBCAA,'IMS_DB','#079');                     38220099
                                                                        38230000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCAA);                                   38240000
 IF PCB_RCBBCAA.ST_CODE ¬= '  '                                         38250000
 THEN                                                                   38260000
   CALL ROLBCAM_ERROR(PTR_RCBBCAA,'IMS_DB','#080');                     38270099
                                                                        38280000
 RCBBCAB_REC              = '  ';                                       38290000
 RCBBCAB_TRAILER.REC_TYPE = '99';                                       38300000
 RCBBCAB_TRAILER.CNT_RECS = CHKP_AREA.CNT.RCBBCAB;                      38310000
                                                                        38320000
 CALL PLITDLI(THREE,ISRT,PTR_RCBBCAB,RCBBCAB_REC);                      38330000
 IF PCB_RCBBCAB.ST_CODE ¬= '  '                                         38340000
 THEN                                                                   38350000
   CALL ROLBCAM_ERROR(PTR_RCBBCAB,'IMS_DB','#081');                     38360099
                                                                        38370000
 CALL PLITDLI (TWO,CLSE,PTR_RCBBCAB);                                   38380000
 IF PCB_RCBBCAB.ST_CODE ¬= '  '                                         38390000
 THEN                                                                   38400000
   CALL ROLBCAM_ERROR(PTR_RCBBCAB,'IMS_DB','#082');                     38410099
                                                                        38420000
 END ROLBCAM_R098_WRITE_TRAILERS;                                       38430099
1/********************************************************************/ 38440000
 /*                                                                  */ 38450000
 /* MODULE NAME      : TERM_PROGRAM                                  */ 38460000
 /*                                                                  */ 38470000
 /* DESCRIPTION      : TERMINATE PROGRAM                             */ 38480000
 /*                                                                  */ 38490000
 /********************************************************************/ 38500000
0ROLBCAM_R099_TERM_PROGRAM: PROC;                                       38510099
                                                                        38520000
 PARM_INT_AREA.COUNTRY_NUMBER   = '';                                   38530000
                       /**********************************************/ 38540000
                       /* WRITE READ + PROCESSED + SKIPPED MESSAGES  */ 38550000
                       /* FOR THE DIFFERENT DATABASES                */ 38560000
                       /**********************************************/ 38570000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   38580000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 38590000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0003';                               38600000
                                                                        38610000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   38620000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 38630000
                                                      /* SOC RC01318 */ 38631000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDI0'; */                        38640000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDI0;                           38641000
                                                      /* EOC RC01318 */ 38642000
 CNT_PIC9                       = CHKP_AREA.CNT.READ_DI;                38650000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 38660000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             38670000
 CNT_PIC9                       = CHKP_AREA.CNT.PROC_DI;                38680000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 38690000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             38700000
 CNT_PIC9                       = CHKP_AREA.CNT.SKIP_DI;                38710000
 PARM_INT_AREA.MSG_VAR_CODE_11  = 'C5';                                 38720000
 PARM_INT_AREA.MSG_VAR_VALUE_11 = CNT_PIC9;                             38730000
 CALL RCB0M1M(PTR_INT_AREA);                                            38740000
                                                                        38750000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   38760000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 38770000
                                                      /* SOC RC01318 */ 38771000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDI0 SW';  */                    38780000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDI0 || ' SW';                  38781000
                                                      /* EOC RC01318 */ 38782000
 CNT_PIC9                       = CHKP_AREA.CNT.SW_DI;                  38790000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 38800000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             38810000
 CALL RCB0M1M(PTR_INT_AREA);                                            38820000
                                                                        38830000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   38840000
 CNT_PIC9                       = CHKP_AREA.CNT.READ_DF;                38850000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 38860000
                                                      /* SOC RC01318 */ 38861000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDF0';  */                       38870000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDF0;                           38870100
                                                      /* EOC RC01318 */ 38871000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 38880000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             38890000
 CNT_PIC9                       = CHKP_AREA.CNT.PROC_DF;                38900000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 38910000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             38920000
 CNT_PIC9                       = CHKP_AREA.CNT.SKIP_DF;                38930000
 PARM_INT_AREA.MSG_VAR_CODE_11  = 'C5';                                 38940000
 PARM_INT_AREA.MSG_VAR_VALUE_11 = CNT_PIC9;                             38950000
 CALL RCB0M1M(PTR_INT_AREA);                                            38960000
                                                                        38970000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   38980000
 CNT_PIC9                       = CHKP_AREA.CNT.READ_DO;                38990000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 39000000
                                                      /* SOC RC01318 */ 39001000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDO0';  */                       39010000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDO0;                           39010100
                                                      /* EOC RC01318 */ 39011000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 39020000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39030000
 CNT_PIC9                       = CHKP_AREA.CNT.PROC_DO;                39040000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 39050000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             39060000
 CNT_PIC9                       = CHKP_AREA.CNT.SKIP_DO;                39070000
 PARM_INT_AREA.MSG_VAR_CODE_11  = 'C5';                                 39080000
 PARM_INT_AREA.MSG_VAR_VALUE_11 = CNT_PIC9;                             39090000
 CALL RCB0M1M(PTR_INT_AREA);                                            39100000
                                                                        39110000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   39120000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 39130000
                                                      /* SOC RC01318 */ 39131000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDO0 SW';  */                    39140000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDO0 || ' SW';                  39140100
                                                      /* EOC RC01318 */ 39141000
 CNT_PIC9                       = CHKP_AREA.CNT.SW_DO;                  39150000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 39160000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39170000
 CALL RCB0M1M(PTR_INT_AREA);                                            39180000
                                                                        39190000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   39200000
 CNT_PIC9                       = CHKP_AREA.CNT.READ_DR;                39210000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 39220000
                                                      /* SOC RC01318 */ 39221000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDR0';  */                       39230000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDR0;                           39230100
                                                      /* EOC RC01318 */ 39231000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 39240000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39250000
 CNT_PIC9                       = CHKP_AREA.CNT.PROC_DR;                39260000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 39270000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             39280000
 CALL RCB0M1M(PTR_INT_AREA);                                            39290000
                                                                        39300000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   39310000
 CNT_PIC9                       = CHKP_AREA.CNT.READ_DC;                39320000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DB';                                 39330000
                                                      /* SOC RC01318 */ 39331000
 /*PARM_INT_AREA.MSG_VAR_VALUE_6  = 'VSDDC0';  */                       39340000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_VSDDC0;                           39340100
                                                      /* EOC RC01318 */ 39341000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C1';                                 39350000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39360000
 CNT_PIC9                       = CHKP_AREA.CNT.PROC_DC;                39370000
 PARM_INT_AREA.MSG_VAR_CODE_9   = 'C3';                                 39380000
 PARM_INT_AREA.MSG_VAR_VALUE_9  = CNT_PIC9;                             39390000
 CALL RCB0M1M(PTR_INT_AREA);                                            39400000
                                                                        39410000
 CALL RCB0M1M(PTR_INT_AREA);                                            39420000
                                                      /* SOC RC01323 */ 39430000
 IF WRK_RUNMODE = 'S2'THEN                                              39430100
 DO;                                                                    39430200
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     39430300
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0323';                   39430400
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       39430500
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'DB';                     39430600
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = WRK_VSDDI0;               39430700
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C5';                     39430800
 CNT_PIC9                            = TOTAL_COUNT_SKIP_NON_RSS_DI;     39430900
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = CNT_PIC9;                 39431000
 CALL RCB0M1M (PTR_INT_AREA);                                           39431100
                                                                        39431200
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       39431300
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'DB';                     39431400
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = WRK_VSDDO0;               39431500
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C5';                     39431600
 CNT_PIC9                            = TOTAL_COUNT_SKIP_NON_RSS_DO;     39431700
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = CNT_PIC9;                 39431800
 CALL RCB0M1M (PTR_INT_AREA);                                           39431900
 END;                                                                   39432000
                                                      /* EOC RC01323 */ 39432100
                       /**********************************************/ 39433000
                       /* WRITE RECORD TOTAL MESSAGES (MSG 004)      */ 39440000
                       /**********************************************/ 39450000
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 39460000
 PARM_INT_AREA.MESSAGE_NUMBER   = '0004';                               39470000
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   39480000
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'FL';                                 39490000
 PARM_INT_AREA.MSG_VAR_CODE_7   = 'C6';                                 39500000
                                                                        39510000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA0 || ' : HW PRODUCT';       39520000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA0;                39530000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39540000
 CALL RCB0M1M(PTR_INT_AREA);                                            39550000
                                                                        39560000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA1 || ' : MES ORDER';        39570000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA1;                39580000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39590000
 CALL RCB0M1M(PTR_INT_AREA);                                            39600000
                                                                        39610000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA2 || ' : HW STATUS';        39620000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA2;                39630000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39640000
 CALL RCB0M1M(PTR_INT_AREA);                                            39650000
                                                                        39660000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA3 || ' : OU/HW';            39670000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA3;                39680000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39690000
 CALL RCB0M1M(PTR_INT_AREA);                                            39700000
                                                                        39710000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA4 || ' : HW/CUSTOMER';      39720000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA4;                39730000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39740000
 CALL RCB0M1M(PTR_INT_AREA);                                            39750000
                                                                        39760000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA5 || ' : SUPPLY CONTRACT';  39770000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA5;                39780000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39790000
 CALL RCB0M1M(PTR_INT_AREA);                                            39800000
                                                                        39810000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA6 || ' : MES/HW';           39820000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA6;                39830000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39840000
 CALL RCB0M1M(PTR_INT_AREA);                                            39850000
                                                                        39860000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA7 || ' : HW PO/ORDER';      39870000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA7;                39880000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39890000
 CALL RCB0M1M(PTR_INT_AREA);                                            39900000
                                                                        39910000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA8 || ' : HW PO REAL.';      39920000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA8;                39930000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39940000
 CALL RCB0M1M(PTR_INT_AREA);                                            39950000
                                                                        39960000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCA9 || ' : FEATURES';         39970000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCA9;                39980000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             39990000
 CALL RCB0M1M(PTR_INT_AREA);                                            40000000
                                                                        40010000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCAA || ' :MES/HW PO IN ORD';  40020000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCAA;                40030000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             40040000
 CALL RCB0M1M(PTR_INT_AREA);                                            40050000
                                                                        40060000
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RCBBCAB || ' : HW MOD. INFO';     40070000
 CNT_PIC9                       = CHKP_AREA.CNT.RCBBCAB;                40080000
 PARM_INT_AREA.MSG_VAR_VALUE_7  = CNT_PIC9;                             40090000
 CALL RCB0M1M(PTR_INT_AREA);                                            40100000
                       /**********************************************/ 40110000
                       /* END THE PROGRAM                            */ 40120000
                       /**********************************************/ 40130000
 CALL ROLBCAM_R098_WRITE_TRAILERS;  /*WRITE TRAILERS AND CLOSE FILES */ 40140099
                                                                        40150000
                       /**********************************************/ 40160000
                       /* ISSUE END MESSAGE                          */ 40170000
                       /**********************************************/ 40180000
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES    = ' ';                         40190000
 PARM_INT_AREA.MSG_AREA.MESSAGE_TYPE     = 'IS';                        40200000
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER   = '9999';                      40210000
 CALL RCB0M1M (PTR_INT_AREA);                                           40220000
                       /**********************************************/ 40230000
                       /* CLOSE MESSAGE FILE                         */ 40240000
                       /**********************************************/ 40250000
 PARM_INT_AREA.MSG_REQUEST    = 'C';                                    40260000
 CALL RCB0M1M(PTR_INT_AREA);                                            40270000
                                                                        40280000
 END ROLBCAM_R099_TERM_PROGRAM;                                         40290099
1/********************************************************************/ 40300000
 /*                                                                  */ 40310000
 /* MODULE NAME      : CHECKPOINT                                    */ 40320000
 /*                                                                  */ 40330000
 /* DESCRIPTION      : TAKE A CHECKPOINT                             */ 40340000
 /*                                                                  */ 40350000
 /********************************************************************/ 40360000
0ROLBCAM_RX01_CHECKPOINT: PROC;                                         40370099
                                                                        40380000
 CHKP_AREA.CNT_NUM    = CHKP_AREA.CNT_NUM + 1;                          40390000
 CHKP_ID.NUMBER       = CHKP_AREA.CNT_NUM;                              40400000
                                                                        40410000
 CALL PLITDLI(SIX,CHKP,PTR_PCB_IO,PTR_CHKP_LEN_IO,PTR_CHKP_ID,          40420000
              PTR_CHKP_LEN_AREA,PTR_CHKP_AREA);                         40430000
                                                                        40440000
 SELECT (PCB_IO.ST_CODE);                                               40450000
 WHEN ('  ')                                                            40460000
   DO;                                                                  40470000
     CHKP_CNT_STEPS = 0;                                                40480000
   END;                                                                 40490000
 WHEN ('XD')                                                            40500000
   DO;                                                                  40510000
     PARM_INT_AREA.MSG_VAR_CODES   = '';                                40520000
     PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                              40530000
     PARM_INT_AREA.MESSAGE_NUMBER  = '9998';                            40540000
     CALL RCB0M1M (PTR_INT_AREA);                                       40550000
                                                                        40560000
     CALL ROLBCAM_ERROR(PTR_PCB_IO,'IMS-IO','#083');                    40570099
   END;                                                                 40580000
 OTHERWISE                                                              40590000
   CALL ROLBCAM_ERROR(PTR_PCB_IO,'IMS-IO','#084');                      40600099
 END;                                                                   40610000
                                                                        40620000
 END ROLBCAM_RX01_CHECKPOINT;                                           40630099
1/********************************************************************/ 40640000
 /*                                                                  */ 40650000
 /* MODULE NAME      : REPOSITION                                    */ 40660000
 /*                                                                  */ 40670000
 /* DESCRIPTION      : REPOSITION AFTER A CHECKPOINT                 */ 40680000
 /*                                                                  */ 40690000
 /********************************************************************/ 40700000
0ROLBCAM_RX02_REPOSITION: PROC;                                         40710099
                                                                        40720000
 IF CHKP_AREA.AASID = 'DI'                                              40730000
 THEN                                                                   40740000
   DO;                                                                  40750000
     SSA_RRDDI1_2.DI_KEY = ' ' || CHKP_AREA.COUNTRY || 'DI' ||          40760000
                         CHKP_AREA.MACHTYPE || CHKP_AREA.SERIAL;        40770000
     CALL PLITDLI(FOUR,'GU  ',PTR_RBDGDI0,DB_MACH_INV,SSA_RRDDI1_2);    40780000
     IF PCB_RBDGDI0.ST_CODE ¬= '  ' THEN                                40790000
         CALL ROLBCAM_ERROR(PTR_RBDGDI0,'IMS_IO','#085');               40800099
   END;                                                                 40810000
 ELSE                                                                   40820000
   DO;                                                                  40830000
     SSA_RRDDO1_2.DO_KEY  = ' '|| CHKP_AREA.COUNTRY || 'DO' ||          40840000
                          CHKP_AREA.ORDER_NUMBER;                       40850000
     CALL PLITDLI(FOUR,'GU  ',PTR_RBDGDO0,DB_MACH_ORD,SSA_RRDDO1_2);    40860000
     IF PCB_RBDGDO0.ST_CODE ¬= '  ' THEN                                40870000
         CALL ROLBCAM_ERROR(PTR_RBDGDO0,'IMS_IO','#086');               40880099
   END;                                                                 40890000
                                                                        40900000
 END ROLBCAM_RX02_REPOSITION;                                           40910099
1/********************************************************************/ 40920000
 /*                                                                  */ 40930000
 /* MODULE NAME      : CHECK_REQUESTED                               */ 40940000
 /*                                                                  */ 40950000
 /* DESCRIPTION      : CHECK WHETHER A PRODUCT TYPE IS CURRENTLY     */ 40960000
 /*                    REQUESTED BY CEDS. THIS IS THE CASE IF        */ 40970000
 /*                    HW_REQUEST_CEDS FROM TABLE RCBV0070 EQUALS '1'*/ 40980000
 /*                    IF NO RECORD CAN BE FOUND A DEFAULT OF '1'    */ 40990000
 /*                    WILL BE TAKEN.                                */ 41000000
 /*                                                                  */ 41010000
 /********************************************************************/ 41020000
0ROLBCAM_RX03_CHECK_REQUESTED : PROC (PARM_COUNTRY_NUMBER,              41030099
                                      PARM_PRODUCT_TYPE,                41040000
                                      PARM_EFFECTIVE_DATE);             41050000
                                                                        41060000
 DCL PARM_COUNTRY_NUMBER  CHAR(03);                                     41070000
 DCL PARM_PRODUCT_TYPE    CHAR(04);                                     41080000
 DCL PARM_EFFECTIVE_DATE  CHAR(10);                                     41090000
                                                   /* START RB01140 */  41100000
 TB_RCBV070   = '';                                                     41110000
 TB_RCBV070_I = '';                                                     41120000
                                                                        41130000
 TB_RCBV070.COUNTRY_NUMBER = PARM_COUNTRY_NUMBER;                       41140000
 TB_RCBV070.PRODUCT_TYPE   = PARM_PRODUCT_TYPE;                         41150000
 TB_RCBV070.MODEL_NUMBER   = '';                                        41160000
 TB_RCBV070.EFFECTIVE_DATE = PARM_EFFECTIVE_DATE;                       41170000
                                                                        41180000
 CALL RCBIAGM (PTR_RCBV070,                                             41190000
               PTR_RCBV070I,                                            41200000
               PTR_RETURN_AREA,                                         41210000
               PTR_INT_AREA);                                           41220000
                                                                        41230000
 SELECT (RETURN_AREA.RETURN_CODE);                                      41240000
 WHEN (0)                                                               41250000
   WRK_HW_REQUEST_CEDS  = TB_RCBV070.HW_REQUEST_CEDS;                   41260000
                                                   /* END   RB01140 */  41270000
 WHEN (4)                                                               41280000
   WRK_HW_REQUEST_CEDS = '1';                                           41290000
 OTHERWISE                                                              41300000
   CALL ROLBCAM_ERROR (ADDR (RETURN_AREA.RETURN_SQL),                   41310099
                      'DB2','#087');                                    41320000
 END;                                                                   41330000
 END ROLBCAM_RX03_CHECK_REQUESTED;                                      41340099
1/********************************************************************/ 41350000
 /*                                                                  */ 41360000
 /* MODULE NAME      : CHECK_DATE                                    */ 41370000
 /*                                                                  */ 41380000
 /* DESCRIPTION      : CHECK DATE USING RCB004M                      */ 41390000
 /*                                                                  */ 41400000
 /********************************************************************/ 41410000
0ROLBCAM_RX04_CHECK_DATE: PROC (DATE_IN                                 41420099
                               ,DATE_OUT                                41430000
                               ,ORIGIN                                  41440000
                               ,DATE_FIELD                              41450000
                               ,KEY_ORIGIN                              41460000
                               );                                       41470000
                                                                        41480000
 DCL DATE_IN          FIXED DEC(05);                                    41490000
 DCL DATE_OUT         CHAR (10);                                        41500000
 DCL ORIGIN           CHAR (07);                                        41510000
 DCL KEY_ORIGIN       CHAR (25);                                        41520000
 DCL DATE_FIELD       CHAR (05);                                        41530000
 DCL DATE_IN_P        PIC'99999';                                       41540000
                                                                        41550000
   DATE_AREA               ='';                                         41560000
   DATE_IN_P               = DATE_IN;                                   41570000
   DATE_AREA.WD_IN_FORMAT  = 'YYDDD';                                   41580000
   DATE_AREA.WD_OUT_FORMAT = 'ISO';                                     41590000
   DATE_AREA.WD_FUNCTION   = 'C';                                       41600000
   DATE_AREA.WD_IN_DATE    = DATE_IN_P;                                 41610000
                                                                        41620000
   CALL RCB004M (PTR_DATE_AREA);                                        41630000
   IF DATE_AREA.WD_STATUS = ' '                                         41640000
   THEN                                                                 41650000
     DATE_OUT = SUBSTR(DATE_AREA.WD_OUT_DATE,1,10);                     41660000
   ELSE                                                                 41670000
     CALL ROLBCAM_RX05_ISSUE_INV_DATE (DATE_FIELD,                      41680099
                                       DATE_IN,                         41690000
                                       ORIGIN,                          41700000
                                       KEY_ORIGIN);                     41710000
                                                                        41720000
 END ROLBCAM_RX04_CHECK_DATE;                                           41730099
1/********************************************************************/ 41740000
 /*                                                                  */ 41750000
 /* MODULE NAME      : ISSUE_INV_DATE                                */ 41760000
 /*                                                                  */ 41770000
 /* DESCRIPTION      : ISSUE MESSAGE INVALID DATE USING              */ 41780000
 /*                    RCB0M1M                                       */ 41790000
 /*                                                                  */ 41800000
 /********************************************************************/ 41810000
0ROLBCAM_RX05_ISSUE_INV_DATE: PROC   (DATE_FIELD                        41820099
                                     ,DATE_VALUE                        41830000
                                     ,DATE_ORIGIN                       41840000
                                     ,DATE_KEY                          41850000
                                     );                                 41860000
                                                                        41870000
 DCL DATE_FIELD      CHAR(05);                                          41880000
 DCL DATE_VALUE      FIXED DEC(05);                                     41890000
 DCL DATE_VALUE_PIC  PIC '99999';                                       41900000
 DCL DATE_ORIGIN     CHAR(07);                                          41910000
 DCL DATE_KEY        CHAR(25);                                          41920000
                                                                        41930000
 DATE_VALUE_PIC                = DATE_VALUE;                            41940000
                                                                        41950000
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    41960000
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  41970000
 PARM_INT_AREA.MESSAGE_NUMBER  = '0012';                                41980000
 PARM_INT_AREA.MSG_VAR_CODE_6  = 'DN';                                  41990000
 PARM_INT_AREA.MSG_VAR_VALUE_6 = DATE_FIELD;                            42000000
 PARM_INT_AREA.MSG_VAR_CODE_7  = 'DT';                                  42010000
 PARM_INT_AREA.MSG_VAR_VALUE_7 = DATE_VALUE_PIC;                        42020000
 PARM_INT_AREA.MSG_VAR_CODE_8  = 'DN';                                  42030000
 PARM_INT_AREA.MSG_VAR_VALUE_8 = DATE_ORIGIN;                           42040000
 PARM_INT_AREA.MSG_VAR_CODE_9  = 'K1';                                  42050000
 PARM_INT_AREA.MSG_VAR_VALUE_9 = DATE_KEY;                              42060000
 CALL RCB0M1M (PTR_INT_AREA);                                           42070000
                                                                        42080000
 END ROLBCAM_RX05_ISSUE_INV_DATE;                                       42090099
                                                      /* SOC RB01281 */ 42091000
1/********************************************************************/ 42092000
 /*                                                                  */ 42093000
 /* MODULE NAME      : RETRIEVE_FLEX_WARR                            */ 42094000
 /*                                                                  */ 42095000
 /* DESCRIPTION      : CHECK WHETHER THE MACHINE IS A FLEXIBLE       */ 42096000
 /*                    WARRANTY MACHINE.                             */ 42097000
 /*                                                                  */ 42098000
 /********************************************************************/ 42099000
0ROLBCAM_RX11_RETRIEVE_FLEX_WARR: PROC;                                 42099199
                                                                        42116900
 DCL WRK_FW_COUNTRY_NUMBER CHAR(03);                                    42117000
 DCL WRK_FW_TYPE           CHAR(04);                                    42117100
 DCL WRK_FW_MODEL          CHAR(03);                                    42117200
 WRK_FW_COUNTRY_NUMBER =  CHKP_AREA.COUNTRY;                            42117300
 WRK_FW_TYPE           =  DB_MACH_INV.CMAXA;                            42117400
 WRK_FW_MODEL          =  DB_MACH_INV.CMMXA;                            42117500
                                                 /* SOC CEDS00000352 */ 42117700
 /* EXEC SQL                                                            42117800
   SELECT T690.COUNTRY_NUMBER,                                          42117900
          T690.PRODUCT_TYPE,                                            42118000
          T690.MODEL_NUMBER,                                            42118100
          T690.BRAND_WARRANTY_MNT,                                      42118200
          T690.SERVICE_LVL_CODE,                                        42118300
          T690.EFFECTIVE_DATE,                                          42118400
          T690.END_DATE,                                                42118500
          T690.LAST_CHANGE_DATE                                         42118600
   INTO   :TB_RCBV690                                                   42118700
          :TB_RCBV690_I.INDNULL                                         42118800
   FROM   RCBV0400_PO_MOD1   T400,                                      42118900
          RCBV0690_FLEX_WARR T690                                       42119000
   WHERE  T400.COUNTRY_NUMBER   = :WRK_FW_COUNTRY_NUMBER                42119100
   AND    T400.PRODUCT_TYPE     = :WRK_FW_TYPE                          42119200
   AND    T400.MODEL_NUMBER     = :WRK_FW_MODEL                         42119300
   AND    T690.COUNTRY_NUMBER   = T400.COUNTRY_NUMBER                   42119400
   AND    T690.PRODUCT_TYPE     = T400.PRODUCT_TYPE                     42119500
   AND    T690.MODEL_NUMBER     = T400.MODEL_NUMBER                     42119600
   AND    (:WRK_ACT_INST_DATE BETWEEN                                   42119700
          T690.EFFECTIVE_DATE  AND T690.END_DATE)                       42119800
   AND    (:RUN_DATE_AREA.RUN_DATE BETWEEN                              42119900
          T400.EFFECTIVE_DATE  AND T400.END_DATE);                      42120000
                                                                        42120100
 SELECT (SQLCODE);                                                      42120200
   WHEN (0)                                                             42120300
         SWITCH_F_TOW = TRUE;                                           42120400
   WHEN (100)                                                           42120500
   DO;                                                                  42120600
 EXEC SQL                                                               42120700
   SELECT T690.COUNTRY_NUMBER,                                          42120800
          T690.PRODUCT_TYPE,                                            42120900
          T690.MODEL_NUMBER,                                            42121000
          T690.BRAND_WARRANTY_MNT,                                      42121100
          T690.SERVICE_LVL_CODE,                                        42121200
          T690.EFFECTIVE_DATE,                                          42121300
          T690.END_DATE,                                                42121400
          T690.LAST_CHANGE_DATE                                         42121500
   INTO   :TB_RCBV690                                                   42121600
          :TB_RCBV690_I.INDNULL                                         42121700
   FROM   RCBV0400_PO_MOD1   T400,                                      42121800
          RCBV0690_FLEX_WARR T690                                       42121900
   WHERE  T400.COUNTRY_NUMBER   = :WRK_FW_COUNTRY_NUMBER                42122000
   AND    T400.PRODUCT_TYPE     = :WRK_FW_TYPE                          42122100
   AND    T400.MODEL_NUMBER     = ''                                    42122200
   AND    T690.COUNTRY_NUMBER   = T400.COUNTRY_NUMBER                   42122300
   AND    T690.PRODUCT_TYPE     = T400.PRODUCT_TYPE                     42122400
   AND    T690.MODEL_NUMBER     = '***'                                 42122500
   AND    (:WRK_ACT_INST_DATE BETWEEN                                   42122600
          T690.EFFECTIVE_DATE  AND T690.END_DATE)                       42122700
   AND    (:RUN_DATE_AREA.RUN_DATE BETWEEN                              42122800
          T400.EFFECTIVE_DATE  AND T400.END_DATE);                      42122900
   END;                                                                 42123000
   OTHERWISE                                                            42123100
       DO;                                                              42123200
         CALL ROLBCAM_ERROR (ADDR (SQLCA),'DB2','#088');                42123399
       END;                                                             42123400
   END;                                                                 42123500
                                                                        42123600
 SELECT (SQLCODE);                                                      42123700
   WHEN (0)                                                             42123800
         SWITCH_F_TOW = TRUE;                                           42123900
   WHEN (100)                                                           42124000
   DO;                                                                  42124100
 EXEC SQL                                                               42124200
   SELECT T690.COUNTRY_NUMBER,                                          42124300
          T690.PRODUCT_TYPE,                                            42124400
          T690.MODEL_NUMBER,                                            42124500
          T690.BRAND_WARRANTY_MNT,                                      42124600
          T690.SERVICE_LVL_CODE,                                        42124700
          T690.EFFECTIVE_DATE,                                          42124800
          T690.END_DATE,                                                42124900
          T690.LAST_CHANGE_DATE                                         42125000
   INTO   :TB_RCBV690                                                   42125100
          :TB_RCBV690_I.INDNULL                                         42125200
   FROM   RCBV0400_PO_MOD1   T400,                                      42125300
          RCBV0690_FLEX_WARR T690                                       42125400
   WHERE  T400.COUNTRY_NUMBER   = :WRK_FW_COUNTRY_NUMBER                42125500
   AND    T400.PRODUCT_TYPE     = :WRK_FW_TYPE                          42125600
   AND    T400.MODEL_NUMBER     = :WRK_FW_MODEL                         42125700
   AND    T690.COUNTRY_NUMBER   = '***'                                 42125800
   AND    T690.PRODUCT_TYPE     = T400.PRODUCT_TYPE                     42125900
   AND    T690.MODEL_NUMBER     = T400.MODEL_NUMBER                     42126000
   AND    (:WRK_ACT_INST_DATE BETWEEN                                   42126100
          T690.EFFECTIVE_DATE  AND T690.END_DATE)                       42126200
   AND    (:RUN_DATE_AREA.RUN_DATE BETWEEN                              42126300
          T400.EFFECTIVE_DATE  AND T400.END_DATE);                      42126400
   END;                                                                 42126500
   OTHERWISE                                                            42126600
       DO;                                                              42126700
         CALL ROLBCAM_ERROR (ADDR (SQLCA),'DB2','#089');                42126899
       END;                                                             42126900
   END;                                                                 42127000
                                                                        42127100
 SELECT (SQLCODE);                                                      42127200
   WHEN (0)                                                             42127300
         SWITCH_F_TOW = TRUE;                                           42127400
   WHEN (100)                                                           42127500
   DO;                                                                  42127600
 EXEC SQL                                                               42127700
   SELECT T690.COUNTRY_NUMBER,                                          42127800
          T690.PRODUCT_TYPE,                                            42127900
          T690.MODEL_NUMBER,                                            42128000
          T690.BRAND_WARRANTY_MNT,                                      42128100
          T690.SERVICE_LVL_CODE,                                        42128200
          T690.EFFECTIVE_DATE,                                          42128300
          T690.END_DATE,                                                42128400
          T690.LAST_CHANGE_DATE                                         42128500
   INTO   :TB_RCBV690                                                   42128600
          :TB_RCBV690_I.INDNULL                                         42128700
   FROM   RCBV0400_PO_MOD1   T400,                                      42128800
          RCBV0690_FLEX_WARR T690                                       42128900
   WHERE  T400.COUNTRY_NUMBER   = :WRK_FW_COUNTRY_NUMBER                42129000
   AND    T400.PRODUCT_TYPE     = :WRK_FW_TYPE                          42129100
   AND    T400.MODEL_NUMBER     = ''                                    42129200
   AND    T690.COUNTRY_NUMBER   = '***'                                 42129300
   AND    T690.PRODUCT_TYPE     = T400.PRODUCT_TYPE                     42129400
   AND    T690.MODEL_NUMBER     = '***'                                 42129500
   AND    (:WRK_ACT_INST_DATE BETWEEN                                   42129600
          T690.EFFECTIVE_DATE  AND T690.END_DATE)                       42129700
   AND    (:RUN_DATE_AREA.RUN_DATE BETWEEN                              42129800
          T400.EFFECTIVE_DATE  AND T400.END_DATE);                      42129900
   END;                                                                 42130000
   OTHERWISE                                                            42130100
       DO;                                                              42130200
         CALL ROLBCAM_ERROR (ADDR (SQLCA),'DB2','#090');                42130399
       END;                                                             42130400
   END;                                                                 42130500
  SELECT (SQLCODE);                                                     42130600
    WHEN (0)                                                            42130700
          SWITCH_F_TOW = TRUE;                                          42130800
    WHEN (100)                                                          42130900
          SWITCH_F_TOW = FALSE;                                         42131000
    OTHERWISE                                                           42131100
         CALL ROLBCAM_ERROR(ADDR(SQLCA),'DB2','#091');                  42131299
  END; */                                                               42131300
                                                                        42131400
  DO J = 1 TO REC_COUNT BY 1;                                           42131500
      IF  T690_ARRAY.A_RULE(J)      =  'FW'                  &          42131600
                                                           /*RB01298 */ 42131700
                                                 /* SOC CEDS00000445 */ 42131800
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &       */ 42131900
          T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &          42132000
                                                 /* EOC CEDS00000445 */ 42132100
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          42132200
          T690_ARRAY.A_MODEL(J)     =  WRK_FW_MODEL          &          42132300
                                                 /* SOC CEDS00000445 */ 42132400
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE    <=       */ 42132500
  /*      T690_ARRAY.A_END_DATE(J)))                                 */ 42132600
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE     &          42132700
          WRK_ACT_INST_DATE        <=  T690_ARRAY.A_END_DATE(J)         42132800
                                                 /* EOC CEDS00000445 */ 42132900
      THEN DO;                                                          42133000
            SWITCH_F_TOW = TRUE;                                        42133100
            I = J;                                                      42133200
            J = REC_COUNT;                                              42133300
          END;                                                          42133400
      ELSE                                                              42133500
         SWITCH_F_TOW    = FALSE;                                       42133600
  END;                                                                  42133700
                                                                        42133800
  IF SWITCH_F_TOW = FALSE THEN                                          42133900
  DO J = 1 TO REC_COUNT BY 1;                                           42134000
      IF  T690_ARRAY.A_RULE(J)      =  'FW'                  &          42134100
                                                           /*RB01298 */ 42134200
                                                 /* SOC CEDS00000445 */ 42134300
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &       */ 42134400
          T690_ARRAY.A_COUNTRY(J)   =  WRK_FW_COUNTRY_NUMBER &          42134500
                                                 /* EOC CEDS00000445 */ 42134600
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          42134700
          T690_ARRAY.A_MODEL(J)     =  '***'                 &          42134800
                                                 /* SOC CEDS00000445 */ 42134900
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE    <=       */ 42135000
  /*      T690_ARRAY.A_END_DATE(J)))                                 */ 42135100
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE     &          42135200
          WRK_ACT_INST_DATE        <=  T690_ARRAY.A_END_DATE(J)         42135300
                                                 /* EOC CEDS00000445 */ 42135400
      THEN DO;                                                          42135500
            SWITCH_F_TOW = TRUE;                                        42135600
            I = J;                                                      42135700
            J = REC_COUNT;                                              42135800
          END;                                                          42135900
      ELSE                                                              42136000
         SWITCH_F_TOW    = FALSE;                                       42136100
  END;                                                                  42136200
                                                                        42136300
  IF SWITCH_F_TOW = FALSE THEN                                          42136400
  DO J = 1 TO REC_COUNT BY 1;                                           42136500
      IF  T690_ARRAY.A_RULE(J)      =  'FW'                  &          42136600
                                                           /*RB01298 */ 42136700
                                                 /* SOC CEDS00000445 */ 42136800
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  '***'                 &       */ 42136900
          T690_ARRAY.A_COUNTRY(J)   =  '***'                 &          42137000
                                                 /* EOC CEDS00000445 */ 42137100
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          42137200
          T690_ARRAY.A_MODEL(J)     =  WRK_FW_MODEL          &          42137300
                                                 /* SOC CEDS00000445 */ 42137400
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE    <=       */ 42137500
  /*      T690_ARRAY.A_END_DATE(J)))                                 */ 42137600
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE     &          42137700
          WRK_ACT_INST_DATE        <=  T690_ARRAY.A_END_DATE(J)         42137800
                                                 /* EOC CEDS00000445 */ 42137900
      THEN DO;                                                          42138000
            SWITCH_F_TOW = TRUE;                                        42138100
            I = J;                                                      42138200
            J = REC_COUNT;                                              42138300
          END;                                                          42138400
      ELSE                                                              42138500
         SWITCH_F_TOW    = FALSE;                                       42138600
  END;                                                                  42138700
                                                                        42138800
  IF SWITCH_F_TOW = FALSE THEN                                          42138900
  DO J = 1 TO REC_COUNT BY 1;                                           42139000
      IF  T690_ARRAY.A_RULE(J)      =  'FW'                  &          42139100
                                                           /*RB01298 */ 42139200
                                                 /* SOC CEDS00000445 */ 42139300
  /*  IF (T690_ARRAY.A_COUNTRY(J)   =  '***'                 &       */ 42139400
          T690_ARRAY.A_COUNTRY(J)   =  '***'                 &          42139500
                                                 /* EOC CEDS00000445 */ 42139600
          T690_ARRAY.A_TYPE(J)      =  WRK_FW_TYPE           &          42139700
          T690_ARRAY.A_MODEL(J)     =  '***'                 &          42139800
                                                 /* EOC CEDS00000445 */ 42139900
  /*     (T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE    <=       */ 42140000
  /*      T690_ARRAY.A_END_DATE(J)))                                 */ 42140100
          T690_ARRAY.A_EFF_DATE(J) <=  WRK_ACT_INST_DATE     &          42140200
          WRK_ACT_INST_DATE        <=  T690_ARRAY.A_END_DATE(J)         42140300
                                                 /* EOC CEDS00000445 */ 42140400
      THEN DO;                                                          42140500
            SWITCH_F_TOW = TRUE;                                        42140600
            I = J;                                                      42140700
            J = REC_COUNT;                                              42140800
          END;                                                          42140900
      ELSE                                                              42141000
         SWITCH_F_TOW    = FALSE;                                       42141100
  END;                                                                  42141200
                                                 /* EOC CEDS00000352 */ 42141300
                                                                        42141400
 END ROLBCAM_RX11_RETRIEVE_FLEX_WARR;                                   42141799
1/********************************************************************/ 42141800
 /*                                                                  */ 42141900
 /* MODULE NAME      : GET_F_TOW_RCB063             RB01281          */ 42142000
 /*                                                                  */ 42142100
 /* DESCRIPTION      : GET THE FLEXIBLE TYPE OF WARRANTY FROM RCB063 */ 42142200
 /*                    PARAMETER.                                    */ 42142300
 /*                                                                  */ 42142400
 /********************************************************************/ 42142500
0ROLBCAM_RX12_GET_F_TOW_RCB063: PROC;                                   42142699
                                                                        42142700
 TB_RCBV500            = '';                                            42142800
 TB_RCBV500_I          = '';                                            42142900
 PARM_FX_WARR.NUMBER   = 'RCB063';                                      42143000
                                                                        42143100
 CALL RCBI50M ('R',                                 /* PASS PARAMETER*/ 42143200
               PTR_RCBV500,                                             42143300
               PTR_RCBV500I,                                            42143400
               PTR_RETURN_AREA,                                         42143500
               PTR_INT_AREA);                                           42143600
                                                                        42143700
 SELECT(RETURN_AREA.RETURN_CODE);                                       42143800
                                                                        42143900
 WHEN(0)                                                                42144000
   DO;                                                 /* SOC RB01298*/ 42144100
   /*WRK_F_TOW = SUBSTR(PARM_FX_WARR.F_WARRANTY_MACHINE,1,1);*/         42144200
     WRK_63_F_TOW  = PARM_FX_WARR.F_WARRANTY_MACHINE;                   42144300
   END;                                                /* EOC RB01298*/ 42144500
 WHEN(4)                                                                42144600
   DO;                                                                  42144700
     PARM_INT_AREA.MESSAGE_TYPE          = 'IS';                        42144800
     PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = 'I050';                   42144900
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = ' ';                      42145000
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6  = 'PN';                     42145100
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6 =                           42145200
                                     TB_RCBV500.PARAMETER_NUMBER;       42145300
     PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7  = 'PK';                     42145400
     PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7 =                           42145500
                                     TB_RCBV500.PARAMETER_KEY;          42145600
     CALL RCB0M1M (PTR_INT_AREA);                                       42145700
     CALL ROLBCAM_ERROR (NULL, 'OTHER', '#088');                        42145899
   END;                                                                 42145900
                                                                        42146000
 OTHERWISE                                                              42146100
   CALL ROLBCAM_ERROR(ADDR(SQLCA),'DB2','#089');                        42146299
 END;                                                                   42146300
                                                                        42146400
 END ROLBCAM_RX12_GET_F_TOW_RCB063;                                     42146599
                                                 /* EOC CEDS00000352 */ 42146600
                                                      /*SOC  RB01298 */ 42146700
1/********************************************************************/ 42146800
 /*                                                                  */ 42146900
 /* MODULE NAME      : GET_F_TOW_RCB064             RB01298          */ 42147000
 /*                                                                  */ 42147100
 /* DESCRIPTION      : GET THE FLEXIBLE TYPE OF WARRANTY FROM RCB064 */ 42147200
 /*                    PARAMETER FOR COUNTRY SPECIFIC.               */ 42147300
 /*                                                                  */ 42147400
 /********************************************************************/ 42147500
0ROLBCAM_RX13_GET_F_TOW_RCB064: PROC;                                   42147699
                                                                        42147700
 TB_RCBV500            = '';                                            42147800
 TB_RCBV500_I          = '';                                            42147900
 PARM_FX_WARR_64P.NUMBER   = 'RCB064';                                  42148000
 PARM_FX_WARR_64P.CTRYNO   = CHKP_AREA.COUNTRY;                         42148100
                                                                        42148300
 CALL RCBI50M ('R',                                 /* PASS PARAMETER*/ 42148400
               PTR_RCBV500,                                             42148500
               PTR_RCBV500I,                                            42148600
               PTR_RETURN_AREA,                                         42148700
               PTR_INT_AREA);                                           42148800
                                                                        42148900
 SELECT(RETURN_AREA.RETURN_CODE);                                       42149000
                                                                        42149100
 WHEN(0)                                                                42149200
   WRK_F_TOW  = PARM_FX_WARR_64P.F_WARRANTY_MACHINE;                    42149300
 WHEN(4)                                                                42149400
   WRK_F_TOW  = WRK_63_F_TOW;                                           42149500
 OTHERWISE                                                              42149600
   CALL ROLBCAM_ERROR(ADDR(SQLCA),'DB2','#091');                        42149799
                                                                        42149800
 END;                                                                   42151400
                                                                        42151500
 END ROLBCAM_RX13_GET_F_TOW_RCB064;                                     42151699
                                                      /* EOC RB01298 */ 42151700
1/********************************************************************/ 42151800
 /*                                                                  */ 42151900
 /*                                                                  */ 42152000
 /* MODULE NAME      : GET_F_REC_RCBT690     CEDS00000352            */ 42152100
 /*                                                                  */ 42152200
 /* DESCRIPTION      : GET THE FLEXIBLE WARRANTY RECORDS FROM T690   */ 42152300
 /*                    INTO T690 ARRAY                               */ 42152400
 /********************************************************************/ 42152500
0ROLBCAM_RX13_GET_F_REC_RCBT690: PROC;                                  42152699
 /*   READ FILE TO GET RECORD COUNT FOR ARRAY SIZE */                   42152700
  OPEN   FILE (RCBBCAD);                                                42152800
  DO  WHILE (¬EOF_RCBBCAD);                                             42152900
      READ FILE (RCBBCAD) INTO (FILE_RCBBCAD);                          42153000
      REC_COUNT = REC_COUNT + 1;                                        42153100
  END;                                                                  42153200
                                                                        42153300
  CLOSE   FILE (RCBBCAD);                                               42153400
  EOF_RCBBCAD   = FALSE;                                                42153500
                                                                        42153600
  IF REC_COUNT > 0 THEN                                                 42153700
   DO;                                                                  42153800
     ALLOCATE T690_ARRAY;                                               42153900
     /* READ THE FILE TO LOAD THE DATA INTO ARRAY */                    42154000
     OPEN FILE (RCBBCAD);                   /* IN  - TABLE 690 TABLE */ 42154100
     DO K = 1 TO REC_COUNT BY 1;                                        42154200
       READ FILE (RCBBCAD) INTO (FILE_RCBBCAD);                         42154300
                                                                        42154400
       T690_ARRAY.A_COUNTRY(K)   = FILE_RCBBCAD.COUNTRY_NUMBER;         42154500
       T690_ARRAY.A_TYPE(K)      = FILE_RCBBCAD.PRODUCT_TYPE;           42154600
       T690_ARRAY.A_MODEL(K)     = FILE_RCBBCAD.MODEL_NUMBER;           42154700
       T690_ARRAY.A_B_W_MNTHS(K) = FILE_RCBBCAD.BRAND_WARRANTY_MNT;     42154800
       T690_ARRAY.A_SLC_NULLIND(K)                                      42154900
             =  FILE_RCBBCAD.NULL_SERVICE_LVL_CODE;  /* CEDS00000377 */ 42155000
       T690_ARRAY.A_SLC(K)         = FILE_RCBBCAD.SERVICE_LVL_CODE;     42155100
       T690_ARRAY.A_EFF_DATE(K)  = FILE_RCBBCAD.EFFECTIVE_DATE;         42155200
       T690_ARRAY.A_END_DATE(K)  = FILE_RCBBCAD.END_DATE;               42155300
       T690_ARRAY.A_SLC2_NULLIND(K) =                 /* SOC RB01298 */ 42155400
                               FILE_RCBBCAD.NULL_SERVICE_LVL_CODE2;     42155500
       T690_ARRAY.A_SLC2(K) = FILE_RCBBCAD.SERVICE_LVL_CODE_2;          42155600
       T690_ARRAY.A_RULE(K) = FILE_RCBBCAD.RULE;      /* EOC RB01298 */ 42155700
     END;                                                               42155800
   END;                                                                 42155900
  ELSE                                                                  42156000
    SWITCH_EMPTY_T690 = TRUE;                                           42156100
                                                                        42156200
 CLOSE FILE (RCBBCAD);                                                  42156300
                                                                        42156400
0END ROLBCAM_RX13_GET_F_REC_RCBT690;             /* EOC CEDS00000352 */ 42156599
1/********************************************************************/ 42156600
 /*                                                                  */ 42156700
 /* MODULE NAME      : CALC_DATE                    RB01281          */ 42156800
 /*                                                                  */ 42156900
 /* DESCRIPTION      : PROCESS DATE USING RCB004M                    */ 42157000
 /*                                                                  */ 42157100
 /********************************************************************/ 42157200
0ROLBCAM_CALC_DATE: PROC   (EFF_DATE,                                   42157399
                            CALC_TYPE,                                  42157400
                            CALC_VALUE) RETURNS(CHAR(10));              42157500
0DCL EFF_DATE     CHAR(10);                                             42157600
 DCL CALC_TYPE    CHAR(1);                                              42157700
 DCL CALC_VALUE   FIXED DEC(3,0);                                       42157800
                                                                        42157900
 DATE_AREA.WD_IN_FORMAT   = 'ISO';                                      42158000
 DATE_AREA.WD_OUT_FORMAT  = 'ISO';                                      42158100
 DATE_AREA.WD_FUNCTION    = 'C';                                        42158200
 DATE_AREA.WD_PERIOD_TYPE = CALC_TYPE;                                  42158300
 DATE_AREA.WD_PERIOD      = CALC_VALUE;                                 42158400
 DATE_AREA.WD_IN_DATE     = EFF_DATE;                                   42158500
 CALL RCB004M (ADDR (DATE_AREA));;                                      42158600
 IF DATE_AREA.WD_STATUS ¬= ' '                                          42158700
 THEN                                                                   42158800
   DO;                                                                  42158900
     CALL ROLBCAM_ERROR (NULL,'OTHER','#090');                          42159099
   END;                                                                 42159100
                                                                        42159200
 RETURN(DATE_AREA.WD_OUT_DATE);                                         42159300
                                                                        42159400
 END ROLBCAM_CALC_DATE;                                /* EOC RB01281*/ 42159599
1/********************************************************************/ 42159600
 /*                                                                  */ 42159700
 /* MODULE NAME      : ROLBCAM_ERROR                                 */ 42159899
 /*                                                                  */ 42159900
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 42160000
 /*                    THE INPUT VARIABLES                           */ 42160100
 /*                                                                  */ 42161000
 /********************************************************************/ 42170000
0ROLBCAM_ERROR: PROC     (PTR_ERROR,                                    42180099
                          ERR_TYPE,                                     42190000
                          CALL_ID);                                     42200000
0DCL PTR_ERROR    PTR;                                                  42210000
 DCL ERR_TYPE     CHAR(8);                                              42220000
 DCL CALL_ID      CHAR(4);                                              42230000
0PARM_INT_AREA.PTR_ERROR      = PTR_ERROR;                              42240000
 PARM_INT_AREA.ERR_TYPE       = ERR_TYPE;                               42250000
 PARM_INT_AREA.CALL_ID        = CALL_ID;                                42260000
0CALL RCB0E1M (PTR_INT_AREA);                                           42270000
0END ROLBCAM_ERROR;                                                     42280099
1/*******************************************************************/  42290000
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  42300000
 /*******************************************************************/  42310000
0%INCLUDE DAIFPLH ;                      /* COMPILE DATE/TIME STAMP */  42320000
 $DAIMOD (ROLBCAM);                      /* MODULE TO BE COMPILED   */  42330099
0/*******************************************************************/  42340000
 /* END OF ABR BLOCK                                                */  42350000
 /*******************************************************************/  42360000
0END ROLBCAM;                                                           42370099