1/********************************************************************/ 00019012
 /*                                                                  */ 00020002
 /* ROLDOBM - OEI NEW EXTRACT - DELTA EXTRACT                        */ 00030002
 /*                                                                  */ 00040002
 /********************************************************************/ 00050002
 /*                                                                  */ 00060002
 /* PROGRAM          : ROLDOBM                                       */ 00070002
 /*                                                                  */ 00080002
 /* LANGUAGE         : PLISQL                                        */ 00090002
 /*                                                                  */ 00100002
 /* TYPE             : BATCH                                         */ 00110002
 /*                                                                  */ 00120002
 /* DESCRIPTION      : THE EXTRACT OF HW RELATED                     */ 00130002
 /*                    INFORMATION FOR THE COUNTRIES GIVEN           */ 00140002
 /*                    AND FOR WHICH INFORMATION HAS CHANGED         */ 00150002
 /*                    SINCE THE LAST OEI HW EXTRACT                 */ 00160002
 /*                                                                  */ 00170002
 /* INPUT            : - DB2     RCBV0010_CUSTOMER                   */ 00180002
 /*                              RCBV0011_PI_CUST                    */ 00190002
 /*                              RCBV0030_CONTRACT                   */ 00200002
 /*                              RCBV0040_OU                         */ 00210002
 /*                              RCBV0051_PI_HW_PR                   */ 00220002
 /*                              RCBV0070_HW_PO                      */ 00230002
 /*                              RCBV0110_HW_STATUS                  */ 00240002
 /*                              RCBV0150_CUST_ADDR                  */ 00250002
 /*                              RCBV0170_OU_HW                      */ 00260002
 /*                              RCBV0190_HW_CUST                    */ 00270002
 /*                              RCBV0220_SUPPL_CTR                  */ 00280002
 /*                              RCBV0240_SERV_CTR                   */ 00290002
 /*                              RCBV0241_PI_CTR                     */ 00300002
 /*                              RCBV0280_ADDR_LINE                  */ 00310002
 /*                              RCBV0300_HW_REAL                    */ 00320002
 /*                              RCBV0350_CUST_MOD                   */ 00330002
 /*                              RCBV0380_HW_PR_MOD                  */ 00340002
 /*                              RCBV0400_PO_MOD1                    */ 00350002
 /*                              RCBV0470_SERV_COND                  */ 00360002
 /*                              RCBV0500_PARM                       */ 00370002
 /*                              ROLV0726_OEI_HW                     */ 00380002
 /*                                                                  */ 00390002
 /* OUTPUT           : - FILE  : ROLDOB1                             */ 00400002
 /*                              RCB0M10                             */ 00410002
 /*                                                                  */ 00420002
 /* EXTERNAL MODULES : RCB0E1M   COMMON ERROR ROUTINE                */ 00430002
 /*                    RCB0M1M   COMMON MESSAGE ROUTINE              */ 00440002
 /*                    RCB0T1M   RETRIEVE SYSTEM DATE                */ 00450002
 /*                    RCB004M   DATE CALCULATION                    */ 00460002
 /*                    RCB018M   UPDATE HASH TOTAL                   */ 00470002
 /*                    RCB019M   RETRIEVE COUNTRY NUMBERS            */ 00480002
 /*                    RCB020M   RETRIEVE RUN DATE                   */ 00490002
 /*                    RCBI50M   RETRIEVE PARAMETER                  */ 00500002
 /*                    RCBF50M   RETRIEVE PARAMETER                  */ 00510002
 /*                    RCBG50M   RETRIEVE PARAMETER                  */ 00520002
 /*                                                                  */ 00530002
 /* MESSAGES         :                                               */ 00540002
 /*                                                                  */ 00550002
 /* DEPENDENCIES     : NONE                                          */ 00560002
 /*                                                                  */ 00570002
 /* FREQUENCY        : WEEKLY                                        */ 00580002
 /*                                                                  */ 00590002
 /* MAINTENANCE LOG  :                                               */ 00600002
 /* ---------------                                                  */ 00610002
 /*                                                                  */ 00620002
 /*  DATE      | WORK-ITEMNO. | DESCRIPTION                          */ 00630002
 /* ---------------------------------------------------------------- */ 00640002
 /*            |              |                                      */ 00650002
 /* 2008-03-10 | MEI 785      | NEW VERSION INITIAL DEVELOPMENT      */ 00660002
 /* 2013-04-19 |TEMEA-T081298 | TABLE LOCK USING RCB024M             */ 00661016
 /*            |              |                                      */ 00670002
 /********************************************************************/ 00680002
1ROLDOBM: PROC                                                          00690002
          OPTIONS (MAIN)                                                00700002
          REORDER;                                                      00710002
 DEFAULT RANGE (*)        STATIC;                                       00720002
 DCL VERS     CHAR(40) INIT('CEDS 3.3    -ROLDOBM- VERS. 2008-03-10');  00730002
1/********************************************************************/ 00740002
 /*  PARAMETERS                                                      */ 00750002
 /********************************************************************/ 00760002
 DCL PTR_INT_AREA        PTR;          /* INTERFACE AREA             */ 00770002
 DCL PTR_RETURN_AREA_BB  PTR;          /* RETURN AREA FROM BB        */ 00780002
 DCL PTR_COUNTRY_AREA    PTR;          /* INTERFACE RCB019M          */ 00790002
 DCL PTR_RUN_DATE_AREA   PTR;          /* INTERFACE RCB020M          */ 00800002
                                                                        00810002
 DCL 1 PARM_INT_AREA,                         /* INTERFACE AREA      */ 00820002
       %INCLUDE (RCBZ01S);;                                             00830002
 DCL 1 RETURN_AREA_BB,                        /* RETURN AREA         */ 00840002
       %INCLUDE (RCBZ02S);;                                             00850002
 DCL 1 COUNTRY_AREA,                          /* COUNTRY AREA        */ 00860002
       %INCLUDE (RCBZ26S);;                                             00870002
 DCL 1 RUN_DATE_AREA,                         /* RUN DATE AREA       */ 00880002
       %INCLUDE (RCBZ28S);;                                             00890002
 DCL 1 PARM_RCBP63S,                           /* FLEXIBLE WARRANTY   */00900002
       %INCLUDE (RCBP63S);;                   /* GEO-LEVEL FWTOW+MA  */ 00910002
 DCL 1 PARM_RCBP64S,                           /* FLEXIBLE WARRANTY   */00920002
      %INCLUDE (RCBP64S);;                    /* COUNTRY LVL FWTOW+MA*/ 00930002
 DCL 1 PARM_RCBP67S,                          /* TPMNT TO MA_STATUS  */ 00940002
       %INCLUDE (RCBP67S);;                                             00950002
 DCL 1 PARM_RCBP68S,                          /* CUNO TO SERV_DIV    */ 00960002
       %INCLUDE (RCBP68S);;                                             00970002
 DCL 1 PARM_RCB024M,                          /* TEMEA-T081298       */ 00971017
       %INCLUDE (RCBZ33S);;                   /* TEMEA-T081298       */ 00972017
1/********************************************************************/ 00980002
 /* EXTERNAL ENTRIES                                                 */ 00990002
 /********************************************************************/ 01000002
 DCL RCB0E1M   ENTRY  EXTERNAL;          /* COMMON ERROR ROUTINE     */ 01010002
 DCL RCB0M1M   ENTRY  EXTERNAL;          /* COMMON MESSAGES ROUT     */ 01020002
 DCL RCB0T1M   ENTRY  EXTERNAL;          /* RETRIEVE SYSTEM DATE     */ 01030002
 DCL RCB004M   ENTRY  EXTERNAL;          /* DATE CALC  ROUTINE       */ 01040002
 DCL RCB018M   ENTRY  EXTERNAL;          /* UPDATE HASH TOTAL        */ 01050002
 DCL RCB019M   ENTRY  EXTERNAL;          /* RETRIEVE COUNTRY NUMBERS */ 01060002
 DCL RCB020M   ENTRY  EXTERNAL;          /* RETRIEVE RUN DATE        */ 01070002
 DCL RCBI50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01080002
 DCL RCBF50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01090002
 DCL RCBG50M   ENTRY  EXTERNAL;          /* RETRIEVE PARAMETER       */ 01100002
                                                    /* TEMEA-T081298 */ 01101015
 DCL RCB024M   ENTRY  EXTERNAL;          /* LOCK DB2 TABLE PARTITION */ 01102014
1/********************************************************************/ 01110002
 /*  FILE DECLARATIONS                                               */ 01120002
 /********************************************************************/ 01130002
 DCL ROLDOB1        FILE                           /* EXTRACT (CEDS) */ 01140002
                    RECORD                                              01150002
                    OUTPUT                                              01160002
                    SEQUENTIAL                                          01170002
                    ENV (FB RECSIZE(384));    /* 2008-03-10  RECSIZE */ 01180002
 DCL SYSPRINT       EXTERNAL FILE PRINT  ;                              01190002
1/********************************************************************/ 01200002
 /* DB2 TABLE STRUCTURES                                             */ 01210002
 /********************************************************************/ 01220002
                                  /* PRODUCT OFFERING INFORMATION    */ 01230002
 DCL 1 TB_RCBV070,                                                      01240002
      %INCLUDE (RCB070S);;                                              01250002
                                                                        01260002
 DCL 1 TB_RCBV400,                                                      01270002
      %INCLUDE (RCB400S);;                                              01280002
                                  /* HARDWARE PRODUCT INFORMATION    */ 01290002
 DCL 1 TB_RCBV110,                                                      01300002
      %INCLUDE (RCB110S);;                                              01310002
                                                                        01320002
 DCL 1 TB_RCBV300,                                                      01330002
      %INCLUDE (RCB300S);;                                              01340002
                                                                        01350002
 DCL 1 TB_RCBV380,                                                      01360002
      %INCLUDE (RCB380S);;                                              01370002
                                  /* CONTRACT INFORMATION            */ 01380002
 DCL 1 TB_RCBV030,                                                      01390002
      %INCLUDE (RCB030S);;                                              01400002
                                                                        01410002
 DCL 1 TB_RCBV240,                                                      01420002
      %INCLUDE (RCB240S);;                                              01430002
                                                                        01440002
 DCL 1 TB_RCBV241,                /* PRIME INPUT CONTRACT DATA       */ 01450002
      %INCLUDE (RCB241S);;                                              01460002
                                                                        01470002
 DCL 1 TB_RCBV470,                /* SERVICE CONDITIONS              */ 01480002
      %INCLUDE (RCB470S);;                                              01490002
                                  /* CUSTOMER REFERENCE              */ 01500002
 DCL 1 TB_RCBV010,                                                      01510002
      %INCLUDE (RCB010S);;                                              01520002
                                                                        01530002
 DCL 1 TB_RCBV19X,                /* CUSTOMER OWNER CODE             */ 01540002
      %INCLUDE (RCB190S);;                                              01550002
                                                                        01560002
 DCL 1 TB_RCBV280,                /* ZIP CODE IS IN ADDRESS LINE 4   */ 01570002
      %INCLUDE (RCB280S);;                                              01580002
                                                                        01590002
 DCL 1 TB_RCBV350,                /* CUSTOMER MODIFIABLE INFORMATION */ 01600002
      %INCLUDE (RCB350S);;                                              01610002
                                                                        01620002
 DCL 1 TB_RCBV011,                /* PRIME INPUT CUSTOMER DATA       */ 01630002
      %INCLUDE (RCB011S);;                                              01640002
                                                                        01650002
 DCL 1 TB_RCBV500,                                                      01660002
      %INCLUDE (RCB500S);;                                              01670002
 DCL 1 TB_RCBV500_I,                                                    01680002
      %INCLUDE (RCB500SI);;                                             01690002
 DCL 1 TB_RCBP24S            BASED (ADDR(TB_RCBV500)),                  01700002
      %INCLUDE (RCBP24S);;                                              01710002
 DCL 1 TB_RCBP63S            BASED (ADDR(TB_RCBV500)),  /* FLEX WARR */ 01720002
      %INCLUDE (RCBP63S);;                              /*           */ 01730002
 DCL 1 TB_RCBP64S            BASED (ADDR(TB_RCBV500)),  /* FLEX WARR */ 01740002
      %INCLUDE (RCBP64S);;                              /*           */ 01750002
 DCL 1 TB_RCBP67S            BASED (ADDR(TB_RCBV500)),                  01760002
      %INCLUDE (RCBP67S);;                                              01770002
 DCL 1 TB_RCBP68S            BASED (ADDR(TB_RCBV500)),                  01780002
      %INCLUDE (RCBP68S);;                                              01790002
                                                                        01800002
1/********************************************************************/ 01810002
 /* SELECT STRUCTURES                                                */ 01820002
 /********************************************************************/ 01830002
 DCL 1 CURSOR_HW_I_V040,                                                01840002
        %INCLUDE (RCB040S);;                                            01850002
 DCL 1 CURSOR_PI_I_V040,                                                01860002
        %INCLUDE (RCB040S);;                                            01870002
 DCL 1 CURSOR_PI_I_V051,                                                01880002
        %INCLUDE (RCB051S);;                                            01890002
 DCL 1 CURSOR_HW_I_V190,                                                01900002
        %INCLUDE (RCB190S);;                                            01910002
 DCL 1 CURSOR_HW_I_V220,                                                01920002
        %INCLUDE (RCB220S);;                                            01930002
                                                                        01940002
 /********************************************************************/ 01950002
 /*  RECORD STRUCTURES                                               */ 01960002
 /********************************************************************/ 01970002
 DCL 1 FILE_ROLDOB1,                                                    01980002
       %INCLUDE (ROLDOBS);;                                             01990002
                                                                        02000002
 DCL 1 FILE_ROLDOPI,                                                    02010002
       %INCLUDE (ROLDOBS);;                                             02020002
                                                                        02030002
 DCL 1 FILE_ROLDOB1_H BASED(ADDR(FILE_ROLDOB1)),                        02040002
       %INCLUDE (RCBD01S);;                                             02050002
                                                                        02060002
 /********************************************************************/ 02070002
 /*  AREA PER CALCOLO DATE                                           */ 02080002
 /********************************************************************/ 02090002
 DCL 1 PARM_DATE_CALC,                        /* DATE CALCULATION    */ 02100002
       %INCLUDE (RCBZ03S);;                                             02110002
                                                                        02120002
 /********************************************************************/ 02130002
 /*  BIT SWITCHES                                                    */ 02140002
 /********************************************************************/ 02150002
 DCL 1 SWITCHES,                                                        02160002
     3 TRUE                      BIT (1)             INIT ('1'B),       02170002
     3 FALSE                     BIT (1)             INIT ('0'B),       02180002
     3 SWITCH_EOC_CURSOR_HW_I    BIT (1)             INIT ('0'B),       02190002
     3 SWITCH_EOC_CURSOR_PI_I    BIT (1)             INIT ('0'B),       02200002
     3 DONE                      BIT (1)             INIT ('0'B),       02210002
     3 F_WARRANTY_MA_STATUS      BIT (1)             INIT ('0'B),       02220002
     3 F_WARRANTY_MA_STATUS_GEO  BIT (1)             INIT ('0'B),       02230002
     3 FLEXIBLE_WARRANTY_BAU     BIT (1)             INIT ('0'B),       02240002
     3 FLEXIBLE_WARRANTY_PI      BIT (1)             INIT ('0'B),       02250002
     3 SW_PI_DELETE              BIT (1)             INIT ('0'B),       02260002
     3 FILLER                    BIT (6)             INIT ((6)'0'B);    02270002
 /********************************************************************/ 02280002
 /*  ALL OTHER USED TEMPORARY FIELDS                                 */ 02290002
 /********************************************************************/ 02300002
 DCL 1 WORK_FIELDS,                                                     02310002
    3 WRK_MOD_NAME                      CHAR (08)  INIT ('ROLDOBM '),   02320002
    3 WRK_PRG_NAME                      CHAR (08)  INIT ('ROLDOBP '),   02330002
    3 WRK_FILE_NAME                     CHAR (08)  INIT ('ROLDOB1 '),   02340002
    3 WRK_SYSTEM_TYPE                   CHAR (01)  INIT ('B'),          02350002
    3 WRK_PROC_ID                       CHAR (04),                      02360002
    3 WRK_CTRYNO                        CHAR (03),                      02370002
    3 WRK_CTRYNO_NO                     FIXED BIN(15) INIT(1),          02380002
    3 WRK_PGR_TYPE                      CHAR (03),                      02390002
    3 WRK_RUN_DATE                      CHAR (10),                      02400002
    3 WRK_INDNULL                       FIXED BIN(15),                  02410002
    3 WRK_SERVICE_TYPE_IND              FIXED BIN(15),                  02420002
    3 WRK_HASH_TOTAL                    FIXED DEC(15) INIT(0),          02430002
    3 WRK_ORDER_NO                      CHAR(06),                       02440002
    3 WRK_TIME_STAMP                    CHAR(20),                       02450002
    3 WRK_CNT_COUNTRY                   FIXED BIN(31) INIT(0),          02460002
    3 WRK_CNT_ROLDOB1                   FIXED BIN(31) INIT(0),          02470002
    3 WRK_TPMNT_VAL,                                                    02480002
      %INCLUDE (RCBZ99S);,                                              02490002
    3 WRK_PIC_10                        PIC 'Z,ZZZ,ZZZ,ZZ9',            02500002
    3 WRK_PIC_15                        PIC '(15)9',                    02510002
    3 WRK_OPEN_DATE_CH6                 CHAR (06)  INIT ('999999'),     02520002
    3 WRK_OPEN_DATE_CH10                CHAR (10)  INIT ('9999-12-31'), 02530002
    3 WRK_FW_END_DATE                   CHAR (10)  INIT ('0001-01-01'); 02540002
                                                                        02550002
 DCL 1 SK_CURRENT,                                                      02560002
      5 PRODUCT_TYPE                    CHAR(04),                       02570002
      5 ORIGIN                          CHAR(02),                       02580002
      5 SEQUENCE_NUMBER                 CHAR(28),                       02590002
      5 MODEL_NUMBER                    CHAR(03),                       02600002
      5 CUSTOMER_NUMBER                 CHAR(08);                       02610002
                              /* COMODO PER T.O.S. BAU */               02620002
 DCL 1 SK_HW_I     LIKE SK_CURRENT;                                     02630002
 DCL 1 SK_HW_I_1   BASED(ADDR(SK_HW_I)) CHAR(34);                       02640002
                                                                        02650002
                              /* COMODO PER T.O.S. PI  */               02660002
 DCL 1 SK_PI_I     LIKE SK_CURRENT;                                     02670002
 DCL 1 SK_PI_I_1   BASED(ADDR(SK_PI_I)) CHAR(34);                       02680002
                                                                        02690002
                                          /* COMODI PER CALCOLO DATA */ 02700002
 DCL  WARREXP_PIU_UNO    CHAR (10)   INIT('');                          02710002
                                                                        02720002
1/********************************************************************/ 02730002
 /*  DICHIARATIVE VARIE                                              */ 02740002
 /********************************************************************/ 02750002
 DCL CTR_BAU       FIXED(9) INIT(0);                                    02760002
 DCL CTR_PI_ONLY   FIXED(9) INIT(0);                                    02770002
 DCL CTR_PI_SCART  FIXED(9) INIT(0);                                    02780002
 DCL CTR_BOTH      FIXED(9) INIT(0);                                    02790002
 DCL CTR_TOT       FIXED(9) INIT(0);                                    02800002
                                                                        02810002
 DCL COMODO_ORARI_LUNGO   CHAR(8) INIT('');                             02820002
 DCL 1 RIFEF1      BASED(ADDR(COMODO_ORARI_LUNGO)),                     02830002
     2 HH_PUNTO    CHAR(3),                                             02840002
     2 DECIMALE    CHAR(1),                                             02850002
     2 RESTO       CHAR(4);                                             02860002
 DCL 1 RIFEF2      BASED(ADDR(COMODO_ORARI_LUNGO)),                     02870002
     2 COMODO_ORARI_CORTO   PIC'ZZV.Z',                                 02880002
     2 RESTO       CHAR(4);                                             02890002
                                                                        02900002
 DCL COMODO_TPMNNEW             CHAR(1)  INIT('');         /* RIA 555 */02910002
 DCL COMODO_SLCNEW              CHAR(3)  INIT('');         /* MEI 785 */02920002
 DCL COMODO_DTPMNNEW            CHAR(10) INIT('');         /* RIA 555 */02930002
 DCL COMODO_NEXT_DAY            CHAR(10) INIT('');         /* RIA 614 */02940002
                                                                        02950002
1/********************************************************************/ 02960002
 /*  BUILTIN FUNCTIONS                                               */ 02970002
 /********************************************************************/ 02980002
 DCL (ADDR,                                                             02990002
     DATE,                                                              03000002
     DATETIME,                                                          03010002
     NULL,                                                              03020002
     STRING,                                                            03030002
     SUBSTR,                                                            03040002
     STG,                                                               03050002
     TRANSLATE,                                                         03060002
     TIME)                   BUILTIN;                                   03070002
1/********************************************************************/ 03080002
 /* ON ERROR CONDITIONS                                              */ 03090002
 /********************************************************************/ 03100002
 %INCLUDE (RCB0E0M);                                                    03110002
 END;                                                                   03120002
1/********************************************************************/ 03130002
 /* DB2/SQL SQLCA                                                    */ 03140002
 /********************************************************************/ 03150002
 EXEC SQL                                                               03160002
   INCLUDE SQLCA                                                        03170002
   ;                                                                    03180002
 /********************************************************************/ 03190002
 /* DB2/SQL CURSORS - B.A.U. HW                                      */ 03200002
 /********************************************************************/ 03210002
                            /*              CURSOR_HW_I              */ 03220002
                            /* RETRIEVE ALL CHANGED HW INSTALLED     */ 03230002
 EXEC SQL                                                               03240002
   DECLARE CURSOR_HW_I CURSOR FOR                                       03250002
   SELECT                                                               03260002
          B.COUNTRY_NUMBER                                              03270002
         ,B.PRODUCT_TYPE                                                03280002
         ,B.ORIGIN                                                      03290002
         ,B.SEQUENCE_NUMBER                                             03300002
         ,B.TYPE_OF_MAINT                                               03310002
         ,B.TYPE_OF_WARRANTY                                            03320002
         ,B.SERVICE_LVL_CODE                                            03330002
         ,B.WARRANTY_EXP_DATE                                           03340002
         ,B.END_DATE                                                    03350002
         ,B.F_TYPE_OF_WARRANTY                                          03360002
         ,B.F_SPLT_DATE                                                 03370002
         ,C.CUSTOMER_NUMBER                                             03380002
         ,C.MARKETING_INSTDAT                                           03390002
         ,E.OU_CODE                                                     03400002
         ,E.MABO                                                        03410002
   FROM ROLV0726_OEI_HW      A                                          03420002
       ,RCBV0220_SUPPL_CTR   B                                          03430002
       ,RCBV0190_HW_CUST     C                                          03440002
       ,RCBV0170_OU_HW       D                                          03450002
       ,RCBV0040_OU          E                                          03460002
   WHERE A.COUNTRY_NUMBER      = :WRK_CTRYNO                            03470002
                                                                        03480002
     AND B.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       03490002
     AND B.PRODUCT_TYPE        = A.PRODUCT_TYPE                         03500002
     AND B.ORIGIN              = A.ORIGIN                               03510002
     AND B.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                      03520002
     AND :WRK_RUN_DATE   BETWEEN B.EFFECTIVE_DATE                       03530002
                         AND     B.END_DATE                             03540002
                                                                        03550002
     AND C.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       03560002
     AND C.PRODUCT_TYPE        = A.PRODUCT_TYPE                         03570002
     AND C.ORIGIN              = A.ORIGIN                               03580002
     AND C.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                      03590002
     AND C.TYPE_OF_RELATION    = 'U'                                    03600002
     AND :WRK_RUN_DATE   BETWEEN C.EFFECTIVE_DATE                       03610002
                         AND     C.END_DATE                             03620002
                                                                        03630002
     AND D.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       03640002
     AND D.PRODUCT_TYPE        = A.PRODUCT_TYPE                         03650002
     AND D.ORIGIN              = A.ORIGIN                               03660002
     AND D.SEQUENCE_NUMBER     = A.SEQUENCE_NUMBER                      03670002
     AND :WRK_RUN_DATE   BETWEEN D.EFFECTIVE_DATE                       03680002
                         AND     D.END_DATE                             03690002
                                                                        03700002
     AND E.COUNTRY_NUMBER      = A.COUNTRY_NUMBER                       03710002
     AND E.OU_CODE             = D.OU_CODE                              03720002
     AND :WRK_RUN_DATE   BETWEEN E.EFFECTIVE_DATE                       03730002
                         AND     E.END_DATE                             03740002
                                                                        03750002
   ORDER BY B.PRODUCT_TYPE                                              03760002
           ,B.ORIGIN                                                    03770002
           ,B.SEQUENCE_NUMBER                                           03780002
   FOR FETCH ONLY                                                       03790002
           ;                                                            03800002
                                                                        03810002
 /********************************************************************/ 03820002
 /* DB2/SQL CURSORS - P.I.   HW                                      */ 03830002
 /********************************************************************/ 03840002
                            /*              CURSOR_HW_P              */ 03850002
                            /* RETRIEVE ALL CHANGED HW INSTALLED     */ 03860002
 EXEC SQL                                                               03870002
   DECLARE CURSOR_PI_I CURSOR FOR                                       03880002
   SELECT                                                               03890002
          B.COUNTRY_NUMBER                                              03900002
         ,B.PRODUCT_TYPE                                                03910002
         ,B.ORIGIN                                                      03920002
         ,B.SEQUENCE_NUMBER                                             03930002
         ,B.MODEL_NUMBER                                                03940002
         ,B.BUILT_TO_MODEL_NR                                           03950002
         ,B.INSTALL_DATE                                                03960002
         ,B.TYPE_OF_MAINT                                               03970002
         ,B.TYPE_OF_WARRANTY                                            03980002
         ,B.SERVICE_DELIV_FLAG                                          03990002
         ,B.SERVICE_LVL_CODE_1                                          04000002
         ,B.WARRANTY_SPLT_DATE                                          04010002
         ,B.SERVICE_LVL_CODE_2                                          04020002
         ,B.WARRANTY_EXP_DATE                                           04030002
         ,B.CUSTOMER_NUMBER                                             04040002
         ,B.DEALER_NUMBER                                               04050002
         ,B.SOURCE_INDICATOR                                            04060002
         ,B.OU_CODE                                                     04070002
         ,E.MABO                                                        04080002
   FROM ROLV0726_OEI_HW      A                                          04090002
       ,RCBV0051_PI_HW_PR    B                                          04100002
       ,RCBV0040_OU          E                                          04110002
   WHERE A.COUNTRY_NUMBER    = :WRK_CTRYNO                              04120002
                                                                        04130002
     AND B.COUNTRY_NUMBER    = A.COUNTRY_NUMBER                         04140002
     AND B.PRODUCT_TYPE      = A.PRODUCT_TYPE                           04150002
     AND B.ORIGIN            = A.ORIGIN                                 04160002
     AND B.SEQUENCE_NUMBER   = A.SEQUENCE_NUMBER                        04170002
                                                                        04180002
     AND E.COUNTRY_NUMBER    = A.COUNTRY_NUMBER                         04190002
     AND E.OU_CODE           = B.OU_CODE                                04200002
     AND :WRK_RUN_DATE BETWEEN E.EFFECTIVE_DATE                         04210002
                       AND     E.END_DATE                               04220002
                                                                        04230002
   ORDER BY B.PRODUCT_TYPE                                              04240002
           ,B.ORIGIN                                                    04250002
           ,B.SEQUENCE_NUMBER                                           04260002
   FOR FETCH ONLY                                                       04270002
           ;                                                            04280002
                                                                        04290002
1/********************************************************************/ 04300002
 /*                 S T A R T   P R O C E S S I N G                  */ 04310002
 /********************************************************************/ 04320002
                                                                        04330002
     PUT LIST(VERS)                 SKIP;                     /*CHECK*/ 04340002
                                                                        04350002
 CALL R900_INIT_PROGRAM;                                                04360002
                                                                        04370002
                               /**************************************/ 04380002
                               /* PROCESS ALL COUNTRIES ASKED FOR    */ 04390002
                               /**************************************/ 04400002
 DO WHILE (WRK_CTRYNO_NO <= COUNTRY_AREA.COUNT_CTRY);                   04410002
                                                                        04420002
                               /**************************************/ 04430002
   CALL R700_INIT_COUNTRY;     /* INIZIALIZZA COUNTRY ...E CURSORI...*/ 04440002
                               /**************************************/ 04450002
                                                                        04460002
                               /**************************************/ 04470002
                               /* PROCESS ALL CHANGED HW FOR COUNTRY */ 04480002
                               /**************************************/ 04490002
   DO WHILE ( ¬SWITCH_EOC_CURSOR_HW_I                                   04500002
            | ¬SWITCH_EOC_CURSOR_PI_I );                                04510002
                                                                        04520002
 /*  PUT LIST('')  SKIP;                                      /*TRACE*/ 04530002
 /*  PUT DATA(SK_HW_I)  SKIP;                                 /*TRACE*/ 04540002
 /*  PUT DATA(SK_PI_I)  SKIP;                                 /*TRACE*/ 04550002
                                         /* MEI785  2008-03-10 START */ 04560002
     SELECT ;                                                           04570002
       WHEN ( ¬SWITCH_EOC_CURSOR_HW_I                                   04580002
            & ¬SWITCH_EOC_CURSOR_PI_I )                                 04590002
         DO;                                                            04600002
           SELECT;                                                      04610002
                                         /****************************/ 04620002
                                         /* PROCESS HW - BAU -       */ 04630002
                                         /****************************/ 04640002
             WHEN (SK_HW_I_1 < SK_PI_I_1)                               04650002
               DO;                                                      04660002
                 CTR_BAU    = CTR_BAU + 1;                              04670002
                 CALL R50A_RETR_ADD_HW_INFO;                            04680002
                 SK_CURRENT = SK_HW_I;      /* DETERMINE CURRENT HW  */ 04690002
                 CALL R50B_PRODUCT_OFFERING;                            04700002
                 CALL R50C_RETR_CTR_INFO;                               04710002
                 CALL R50X_RETR_ADD_CUST_INFO;                          04720002
                 CALL R502_FILL_ROLDOB1_I;                              04730002
                 FILE_ROLDOB1.DATA_ORIGIN = '0';                        04740002
                 CALL R504_WRITE_ROLDOB1;                               04750002
                 CALL R509_FETCH_CURSOR_HW_I;                           04760002
               END;                                                     04770002
                                         /****************************/ 04780002
                                         /* PROCESS HW - BOTH -      */ 04790002
                                         /****************************/ 04800002
             WHEN ( SK_HW_I_1 = SK_PI_I_1 )                             04810002
               DO;                                                      04820002
                 CTR_BOTH   = CTR_BOTH + 1;                             04830002
                 CALL R50A_RETR_ADD_HW_INFO;                            04840002
                 SK_CURRENT = SK_HW_I;      /* DETERMINE CURRENT HW  */ 04850002
                 CALL R50B_PRODUCT_OFFERING;                            04860002
                 CALL R50C_RETR_CTR_INFO;                               04870002
                 CALL R50X_RETR_ADD_CUST_INFO;                          04880002
                 CALL R502_FILL_ROLDOB1_I;                              04890002
                 FILE_ROLDOB1.DATA_ORIGIN = '2';                        04900002
                 CALL R504_WRITE_ROLDOB1;                               04910002
                                                                        04920002
                 SK_CURRENT = SK_PI_I;      /* DETERMINE CURRENT HW  */ 04930002
                 CALL R50B_PRODUCT_OFFERING;                            04940002
                 CALL R80C_RETR_CTR_INFO;                               04950002
                 IF SUBSTR(SK_CURRENT.CUSTOMER_NUMBER,1,2) = '00' THEN  04960002
                   DO;                                                  04970002
                     CALL R50X_RETR_ADD_CUST_INFO;                      04980002
                   END;                                                 04990002
                 ELSE                                                   05000002
                   DO;                                                  05010002
                     CALL R80X_RETR_ADD_CUST_INFO;                      05020002
                   END;                                                 05030002
                 CALL R802_FILL_ROLDOPI_I;                              05040002
                 CALL R803_LOGICHE_PI_I;                                05050002
                 FILE_ROLDOPI.DATA_ORIGIN = '2';                        05060002
                 IF  ( ¬SW_PI_DELETE )  THEN               /* DELETE */ 05070002
                   DO;                                                  05080002
                     CALL R804_WRITE_ROLDOPI;                           05090002
                   END;                                                 05100002
                 CALL R509_FETCH_CURSOR_HW_I;                           05110002
                 CALL R809_FETCH_CURSOR_PI_I;                           05120002
               END;                                                     05130002
                                         /****************************/ 05140002
                                         /* PROCESS HW - P.I. ONLY - */ 05150002
                                         /****************************/ 05160002
             WHEN ( SK_HW_I_1  > SK_PI_I_1 )                            05170002
               DO;                                                      05180002
                 CTR_PI_ONLY = CTR_PI_ONLY + 1;                         05190002
                 SK_CURRENT  = SK_PI_I;     /* DETERMINE CURRENT HW  */ 05200002
                 CALL R50B_PRODUCT_OFFERING;                            05210002
                 CALL R80C_RETR_CTR_INFO;                               05220002
                 IF  SUBSTR(SK_CURRENT.CUSTOMER_NUMBER,1,2) = '00'  THEN05230002
                   DO;                                                  05240002
                     CALL R50X_RETR_ADD_CUST_INFO;                      05250002
                   END;                                                 05260002
                 ELSE                                                   05270002
                   DO;                                                  05280002
                     CALL R80X_RETR_ADD_CUST_INFO;                      05290002
                   END;                                                 05300002
                 CALL R802_FILL_ROLDOPI_I;                              05310002
                 CALL R803_LOGICHE_PI_I;                                05320002
                 FILE_ROLDOPI.DATA_ORIGIN = '1';                        05330002
                 IF  ( ¬SW_PI_DELETE )  THEN               /* DELETE */ 05340002
                   DO;                                                  05350002
                     CALL R804_WRITE_ROLDOPI;                           05360002
                   END;                                                 05370002
                 CALL R809_FETCH_CURSOR_PI_I;                           05380002
               END;                                                     05390002
             OTHERWISE ;                                                05400002
           END ;                                                        05410002
         END;                                                           05420002
                                                                        05430002
       WHEN ( ¬SWITCH_EOC_CURSOR_HW_I                                   05440002
            & SWITCH_EOC_CURSOR_PI_I )                                  05450002
         DO;                                                            05460002
                                         /****************************/ 05470002
                                         /* PROCESS HW - BAU -       */ 05480002
                                         /****************************/ 05490002
           CTR_BAU    = CTR_BAU + 1;                                    05500002
           CALL R50A_RETR_ADD_HW_INFO;                                  05510002
           SK_CURRENT = SK_HW_I;            /* DETERMINE CURRENT HW  */ 05520002
           CALL R50B_PRODUCT_OFFERING;                                  05530002
           CALL R50C_RETR_CTR_INFO;                                     05540002
           CALL R50X_RETR_ADD_CUST_INFO;                                05550002
           CALL R502_FILL_ROLDOB1_I;                                    05560002
           FILE_ROLDOB1.DATA_ORIGIN = '0';                              05570002
           CALL R504_WRITE_ROLDOB1;                                     05580002
           CALL R509_FETCH_CURSOR_HW_I;                                 05590002
         END;                                                           05600002
                                                                        05610002
       WHEN ( SWITCH_EOC_CURSOR_HW_I                                    05620002
            & ¬SWITCH_EOC_CURSOR_PI_I )                                 05630002
         DO;                                                            05640002
                                         /****************************/ 05650002
                                         /* PROCESS HW - P.I. ONLY - */ 05660002
                                         /****************************/ 05670002
           CTR_PI_ONLY = CTR_PI_ONLY + 1;                               05680002
           SK_CURRENT  = SK_PI_I;           /* DETERMINE CURRENT HW  */ 05690002
           CALL R50B_PRODUCT_OFFERING;                                  05700002
           CALL R80C_RETR_CTR_INFO;                                     05710002
           IF  SUBSTR(SK_CURRENT.CUSTOMER_NUMBER,1,2) = '00'  THEN      05720002
             DO;                                                        05730002
               CALL R50X_RETR_ADD_CUST_INFO;                            05740002
             END;                                                       05750002
           ELSE                                                         05760002
             DO;                                                        05770002
               CALL R80X_RETR_ADD_CUST_INFO;                            05780002
             END;                                                       05790002
           CALL R802_FILL_ROLDOPI_I;                                    05800002
           CALL R803_LOGICHE_PI_I;                                      05810002
           FILE_ROLDOPI.DATA_ORIGIN = '1';                              05820002
           IF  ( ¬SW_PI_DELETE )  THEN                     /* DELETE */ 05830002
             DO;                                                        05840002
               CALL R804_WRITE_ROLDOPI;                                 05850002
             END;                                                       05860002
           CALL R809_FETCH_CURSOR_PI_I;                                 05870002
         END;                                                           05880002
                                                                        05890002
       OTHERWISE ;                       /* NO ACTIVE CURSOR         */ 05900002
     END ;                               /* END SELECT               */ 05910002
                                         /* MEI785  2008-03-10 END   */ 05920002
   END;                                  /* END COUNTRY (DO WHILE)   */ 05930002
                                                                        05940002
   CALL R799_END_COUNTRY;                                               05950002
                                                                        05960002
 END;                                    /* END PROGRAM (DO WHILE)   */ 05970002
                                                                        05980002
 CALL R999_END_PROGRAM;                                                 05990002
                                                                        06000002
1/********************************************************************/ 06010002
 /*                                                                  */ 06020002
 /* MODULE NAME      : R001_LOCK_TABLES                              */ 06030002
 /*                                                                  */ 06040002
 /* DESCRIPTION      :                                               */ 06050002
 /*                                                                  */ 06060002
 /********************************************************************/ 06070002
 R001_LOCK_TABLES: PROC;                                                06080002
                                                                        06090002
 /*  PUT LIST('R001_LOCK_TABLES')  SKIP;                      /*TRACE*/ 06100002
                                                  /* SOC TEMEA-T081298  06110014
 EXEC SQL                                                               06120002
   LOCK TABLE  RCBT0010_CUSTOMER        IN SHARE MODE;                  06130002
                                                                        06140002
 IF SQLCODE ¬= 0                                                        06150002
   THEN DO;                                                             06160002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06170002
                              'DB2',                                    06180002
                              '#001');                                  06190002
        END;                                                            06200002
                                                                        06210002
 EXEC SQL                                                               06220002
   LOCK TABLE  RCBT0011_PI_CUST         IN SHARE MODE;                  06230002
                                                                        06240002
 IF SQLCODE ¬= 0                                                        06250002
   THEN DO;                                                             06260002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06270002
                              'DB2',                                    06280002
                              '#002');                                  06290002
        END;                                                            06300002
                                                                        06310002
 EXEC SQL                                                               06320002
   LOCK TABLE  RCBT0030_CONTRACT        IN SHARE MODE;                  06330002
                                                                        06340002
 IF SQLCODE ¬= 0                                                        06350002
   THEN DO;                                                             06360002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06370002
                              'DB2',                                    06380002
                              '#003');                                  06390002
        END;                                                            06400002
                                                                        06410002
 EXEC SQL                                                               06420002
   LOCK TABLE  RCBT0040_OU              IN SHARE MODE;                  06430002
                                                                        06440002
 IF SQLCODE ¬= 0                                                        06450002
   THEN DO;                                                             06460002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06470002
                              'DB2',                                    06480002
                              '#004');                                  06490002
        END;                                                            06500002
                                                                        06510002
 EXEC SQL                                                               06520002
   LOCK TABLE  RCBT0051_PI_HW_PR        IN SHARE MODE;                  06530002
                                                                        06540002
 IF SQLCODE ¬= 0                                                        06550002
   THEN DO;                                                             06560002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06570002
                              'DB2',                                    06580002
                              '#005');                                  06590002
        END;                                                            06600002
                                                                        06610002
 EXEC SQL                                                               06620002
   LOCK TABLE  RCBT0070_HW_PO           IN SHARE MODE;                  06630002
                                                                        06640002
 IF SQLCODE ¬= 0                                                        06650002
   THEN DO;                                                             06660002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06670002
                              'DB2',                                    06680002
                              '#006');                                  06690002
        END;                                                            06700002
                                                                        06710002
 EXEC SQL                                                               06720002
   LOCK TABLE  RCBT0110_HW_STATUS       IN SHARE MODE;                  06730002
                                                                        06740002
 IF SQLCODE ¬= 0                                                        06750002
   THEN DO;                                                             06760002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06770002
                              'DB2',                                    06780002
                              '#007');                                  06790002
        END;                                                            06800002
                                                                        06810002
 EXEC SQL                                                               06820002
   LOCK TABLE  RCBT0150_CUST_ADDR       IN SHARE MODE;                  06830002
                                                                        06840002
 IF SQLCODE ¬= 0                                                        06850002
   THEN DO;                                                             06860002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06870002
                              'DB2',                                    06880002
                              '#008');                                  06890002
        END;                                                            06900002
                                                                        06910002
 EXEC SQL                                                               06920002
   LOCK TABLE  RCBT0170_OU_HW           IN SHARE MODE;                  06930002
                                                                        06940002
 IF SQLCODE ¬= 0                                                        06950002
   THEN DO;                                                             06960002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             06970002
                              'DB2',                                    06980002
                              '#009');                                  06990002
        END;                                                            07000002
                                                                        07010002
 EXEC SQL                                                               07020002
   LOCK TABLE  RCBT0190_HW_CUST         IN SHARE MODE;                  07030002
                                                                        07040002
 IF SQLCODE ¬= 0                                                        07050002
   THEN DO;                                                             07060002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07070002
                              'DB2',                                    07080002
                              '#010');                                  07090002
        END;                                                            07100002
                                                                        07110002
 EXEC SQL                                                               07120002
   LOCK TABLE  RCBT0220_SUPPL_CTR       IN SHARE MODE;                  07130002
                                                                        07140002
 IF SQLCODE ¬= 0                                                        07150002
   THEN DO;                                                             07160002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07170002
                              'DB2',                                    07180002
                              '#011');                                  07190002
        END;                                                            07200002
                                                                        07210002
 EXEC SQL                                                               07220002
   LOCK TABLE  RCBT0240_SERV_CTR        IN SHARE MODE;                  07230002
                                                                        07240002
 IF SQLCODE ¬= 0                                                        07250002
   THEN DO;                                                             07260002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07270002
                              'DB2',                                    07280002
                              '#012');                                  07290002
        END;                                                            07300002
                                                                        07310002
 EXEC SQL                                                               07320002
   LOCK TABLE  RCBT0241_PI_CTR           IN SHARE MODE;                 07330002
                                                                        07340002
 IF SQLCODE ¬= 0                                                        07350002
   THEN DO;                                                             07360002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07370002
                              'DB2',                                    07380002
                              '#013');                                  07390002
        END;                                                            07400002
                                                                        07410002
 EXEC SQL                                                               07420002
   LOCK TABLE  RCBT0280_ADDR_LINE       IN SHARE MODE;                  07430002
                                                                        07440002
 IF SQLCODE ¬= 0                                                        07450002
   THEN DO;                                                             07460002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07470002
                              'DB2',                                    07480002
                              '#014');                                  07490002
        END;                                                            07500002
                                                                        07510002
 EXEC SQL                                                               07520002
   LOCK TABLE  RCBT0300_HW_REAL         IN SHARE MODE;                  07530002
                                                                        07540002
 IF SQLCODE ¬= 0                                                        07550002
   THEN DO;                                                             07560002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07570002
                              'DB2',                                    07580002
                              '#015');                                  07590002
        END;                                                            07600002
                                                                        07610002
 EXEC SQL                                                               07620002
   LOCK TABLE  RCBT0350_CUST_MOD        IN SHARE MODE;                  07630002
                                                                        07640002
 IF SQLCODE ¬= 0                                                        07650002
   THEN DO;                                                             07660002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07670002
                              'DB2',                                    07680002
                              '#016');                                  07690002
        END;                                                            07700002
                                                                        07710002
 EXEC SQL                                                               07720002
   LOCK TABLE  RCBT0380_HW_PR_MOD       IN SHARE MODE;                  07730002
                                                                        07740002
 IF SQLCODE ¬= 0                                                        07750002
   THEN DO;                                                             07760002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07770002
                              'DB2',                                    07780002
                              '#017');                                  07790002
        END;                                                            07800002
                                                                        07810002
 EXEC SQL                                                               07820002
   LOCK TABLE  RCBT0400_PO_MOD1         IN SHARE MODE;                  07830002
                                                                        07840002
 IF SQLCODE ¬= 0                                                        07850002
   THEN DO;                                                             07860002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07870002
                              'DB2',                                    07880002
                              '#018');                                  07890002
        END;                                                            07900002
                                                                        07910002
 EXEC SQL                                                               07920002
   LOCK TABLE  RCBT0470_SERV_COND       IN SHARE MODE;                  07930002
                                                                        07940002
 IF SQLCODE ¬= 0                                                        07950002
   THEN DO;                                                             07960002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             07970002
                              'DB2',                                    07980002
                              '#019');                                  07990002
        END;                                                            08000002
                                                                        08010002
 EXEC SQL                                                               08020002
   LOCK TABLE  ROLT0726_OEI_HW        IN SHARE MODE;                    08030002
                                                                        08040002
 IF SQLCODE ¬= 0                                                        08050002
   THEN DO;                                                             08060002
          CALL ROLDOBM_ERROR (ADDR (SQLCA),                             08070002
                              'DB2',                                    08080002
                              '#020');                                  08090002
        END;                                                         */ 08100014
                                                                        08110002
 PARM_RCB024M.COUNTRY_NUMBER = WRK_CTRYNO;                              08111014
 /********************************************************************/ 08112014
 PARM_RCB024M.VIEW_NAME      = 'RCBT0010_CUSTOMER';                     08113014
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08114014
                                                                        08115014
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08116014
               PTR_RETURN_AREA_BB,                                      08117014
               PTR_INT_AREA);                                           08118014
                                                                        08119014
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08119114
   WHEN (0);                                                            08119214
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08119314
     DO;                                                                08119414
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#041');                      08119514
     END;                                                               08119614
   OTHERWISE                                                            08119714
     DO;                                                                08119814
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08119914
                                 'DB2',                                 08120014
                                 '#001');                               08120114
     END;                                                               08120214
 END;                                                                   08120314
                                                                        08120414
 /********************************************************************/ 08120514
 PARM_RCB024M.VIEW_NAME      = 'RCBT0011_PI_CUST';                      08120614
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08120714
                                                                        08120814
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08120914
               PTR_RETURN_AREA_BB,                                      08121014
               PTR_INT_AREA);                                           08121114
                                                                        08121214
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08121314
   WHEN (0);                                                            08121414
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08121514
     DO;                                                                08121614
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#042');                      08121714
     END;                                                               08121814
   OTHERWISE                                                            08121914
     DO;                                                                08122014
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08122114
                                 'DB2',                                 08122214
                                 '#002');                               08122314
     END;                                                               08122414
 END;                                                                   08122514
                                                                        08122614
 /********************************************************************/ 08122714
 PARM_RCB024M.VIEW_NAME      = 'RCBT0030_CONTRACT';                     08122814
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08122914
                                                                        08123014
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08123114
               PTR_RETURN_AREA_BB,                                      08123214
               PTR_INT_AREA);                                           08123314
                                                                        08123414
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08123514
   WHEN (0);                                                            08123614
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08123714
     DO;                                                                08123814
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#043');                      08123914
     END;                                                               08124014
   OTHERWISE                                                            08124114
     DO;                                                                08124214
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08124314
                                 'DB2',                                 08124414
                                 '#003');                               08124514
     END;                                                               08124614
 END;                                                                   08124714
                                                                        08124814
 /********************************************************************/ 08124914
 PARM_RCB024M.VIEW_NAME      = 'RCBT0040_OU';                           08125014
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08125114
                                                                        08125214
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08125314
               PTR_RETURN_AREA_BB,                                      08125414
               PTR_INT_AREA);                                           08125514
                                                                        08125614
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08125714
   WHEN (0);                                                            08125814
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08125914
     DO;                                                                08126014
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#044');                      08126114
     END;                                                               08126214
   OTHERWISE                                                            08126314
     DO;                                                                08126414
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08126514
                                 'DB2',                                 08126614
                                 '#004');                               08126714
     END;                                                               08126814
 END;                                                                   08126914
                                                                        08127014
 /********************************************************************/ 08127114
 PARM_RCB024M.VIEW_NAME      = 'RCBT0051_PI_HW_PR';                     08127214
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08127314
                                                                        08127414
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08127514
               PTR_RETURN_AREA_BB,                                      08127614
               PTR_INT_AREA);                                           08127714
                                                                        08127814
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08127914
   WHEN (0);                                                            08128014
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08128114
     DO;                                                                08128214
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#045');                      08128314
     END;                                                               08128414
   OTHERWISE                                                            08128514
     DO;                                                                08128614
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08128714
                                 'DB2',                                 08128814
                                 '#005');                               08128914
     END;                                                               08129014
 END;                                                                   08129114
                                                                        08129214
 /********************************************************************/ 08129314
 PARM_RCB024M.VIEW_NAME      = 'RCBT0070_HW_PO';                        08129414
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08129514
                                                                        08129614
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08129714
               PTR_RETURN_AREA_BB,                                      08129814
               PTR_INT_AREA);                                           08129914
                                                                        08130014
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08130114
   WHEN (0);                                                            08130214
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08130314
     DO;                                                                08130414
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#046');                      08130514
     END;                                                               08130614
   OTHERWISE                                                            08130714
     DO;                                                                08130814
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08130914
                                 'DB2',                                 08131014
                                 '#006');                               08131114
     END;                                                               08131214
 END;                                                                   08131314
                                                                        08131414
 /********************************************************************/ 08131514
 PARM_RCB024M.VIEW_NAME      = 'RCBT0110_HW_STATUS';                    08131614
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08131714
                                                                        08131814
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08131914
               PTR_RETURN_AREA_BB,                                      08132014
               PTR_INT_AREA);                                           08132114
                                                                        08132214
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08132314
   WHEN (0);                                                            08132414
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08132514
     DO;                                                                08132614
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#047');                      08132714
     END;                                                               08132814
   OTHERWISE                                                            08132914
     DO;                                                                08133014
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08133114
                                 'DB2',                                 08133214
                                 '#007');                               08133314
     END;                                                               08133414
 END;                                                                   08133514
                                                                        08133614
 /********************************************************************/ 08133714
 PARM_RCB024M.VIEW_NAME      = 'RCBT0150_CUST_ADDR';                    08133814
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08133914
                                                                        08134014
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08134114
               PTR_RETURN_AREA_BB,                                      08134214
               PTR_INT_AREA);                                           08134314
                                                                        08134414
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08134514
   WHEN (0);                                                            08134614
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08134714
     DO;                                                                08134814
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#048');                      08134914
     END;                                                               08135014
   OTHERWISE                                                            08135114
     DO;                                                                08135214
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08135314
                                 'DB2',                                 08135414
                                 '#008');                               08135514
     END;                                                               08135614
 END;                                                                   08135714
                                                                        08135814
 /********************************************************************/ 08135914
 PARM_RCB024M.VIEW_NAME      = 'RCBT0170_OU_HW';                        08136014
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08136114
                                                                        08136214
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08136314
               PTR_RETURN_AREA_BB,                                      08136414
               PTR_INT_AREA);                                           08136514
                                                                        08136614
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08136714
   WHEN (0);                                                            08136814
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08136914
     DO;                                                                08137014
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#049');                      08137114
     END;                                                               08137214
   OTHERWISE                                                            08137314
     DO;                                                                08137414
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08137514
                                 'DB2',                                 08137614
                                 '#009');                               08137714
     END;                                                               08137814
 END;                                                                   08137914
                                                                        08138014
 /********************************************************************/ 08138114
 PARM_RCB024M.VIEW_NAME      = 'RCBT0190_HW_CUST';                      08138214
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08138314
                                                                        08138414
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08138514
               PTR_RETURN_AREA_BB,                                      08138614
               PTR_INT_AREA);                                           08138714
                                                                        08138814
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08138914
   WHEN (0);                                                            08139014
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08139114
     DO;                                                                08139214
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#050');                      08139314
     END;                                                               08139414
   OTHERWISE                                                            08139514
     DO;                                                                08139614
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08139714
                                 'DB2',                                 08139814
                                 '#010');                               08139914
     END;                                                               08140014
 END;                                                                   08140114
                                                                        08140214
 /********************************************************************/ 08140314
 PARM_RCB024M.VIEW_NAME      = 'RCBT0220_SUPPL_CTR';                    08140414
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08140514
                                                                        08140614
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08140714
               PTR_RETURN_AREA_BB,                                      08140814
               PTR_INT_AREA);                                           08140914
                                                                        08141014
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08141114
   WHEN (0);                                                            08141214
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08141314
     DO;                                                                08141414
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#051');                      08141514
     END;                                                               08141614
   OTHERWISE                                                            08141714
     DO;                                                                08141814
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08141914
                                 'DB2',                                 08142014
                                 '#011');                               08142114
     END;                                                               08142214
 END;                                                                   08142314
                                                                        08142414
 /********************************************************************/ 08142514
 PARM_RCB024M.VIEW_NAME      = 'RCBT0240_SERV_CTR';                     08142614
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08142714
                                                                        08142814
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08142914
               PTR_RETURN_AREA_BB,                                      08143014
               PTR_INT_AREA);                                           08143114
                                                                        08143214
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08143314
   WHEN (0);                                                            08143414
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08143514
     DO;                                                                08143614
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#052');                      08143714
     END;                                                               08143814
   OTHERWISE                                                            08143914
     DO;                                                                08144014
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08144114
                                 'DB2',                                 08144214
                                 '#012');                               08144314
     END;                                                               08144414
 END;                                                                   08144514
                                                                        08144614
 /********************************************************************/ 08144714
 PARM_RCB024M.VIEW_NAME      = 'RCBT0241_PI_CTR';                       08144814
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08144914
                                                                        08145014
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08145114
               PTR_RETURN_AREA_BB,                                      08145214
               PTR_INT_AREA);                                           08145314
                                                                        08145414
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08145514
   WHEN (0);                                                            08145614
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08145714
     DO;                                                                08145814
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#053');                      08145914
     END;                                                               08146014
   OTHERWISE                                                            08146114
     DO;                                                                08146214
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08146314
                                 'DB2',                                 08146414
                                 '#013');                               08146514
     END;                                                               08146614
 END;                                                                   08146714
                                                                        08146814
 /********************************************************************/ 08146914
 PARM_RCB024M.VIEW_NAME      = 'RCBT0280_ADDR_LINE';                    08147014
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08147114
                                                                        08147214
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08147314
               PTR_RETURN_AREA_BB,                                      08147414
               PTR_INT_AREA);                                           08147514
                                                                        08147614
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08147714
   WHEN (0);                                                            08147814
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08147914
     DO;                                                                08148014
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#054');                      08148114
     END;                                                               08148214
   OTHERWISE                                                            08148314
     DO;                                                                08148414
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08148514
                                 'DB2',                                 08148614
                                 '#014');                               08148714
     END;                                                               08148814
 END;                                                                   08148914
                                                                        08149014
 /********************************************************************/ 08149114
 PARM_RCB024M.VIEW_NAME      = 'RCBT0300_HW_REAL';                      08149214
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08149314
                                                                        08149414
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08149514
               PTR_RETURN_AREA_BB,                                      08149614
               PTR_INT_AREA);                                           08149714
                                                                        08149814
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08149914
   WHEN (0);                                                            08150014
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08150114
     DO;                                                                08150214
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#055');                      08150314
     END;                                                               08150414
   OTHERWISE                                                            08150514
     DO;                                                                08150614
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08150714
                                 'DB2',                                 08150814
                                 '#015');                               08150914
     END;                                                               08151014
 END;                                                                   08151114
                                                                        08151214
 /********************************************************************/ 08151314
 PARM_RCB024M.VIEW_NAME      = 'RCBT0350_CUST_MOD';                     08151414
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08151514
                                                                        08151614
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08151714
               PTR_RETURN_AREA_BB,                                      08151814
               PTR_INT_AREA);                                           08151914
                                                                        08152014
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08152114
   WHEN (0);                                                            08152214
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08152314
     DO;                                                                08152414
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#056');                      08152514
     END;                                                               08152614
   OTHERWISE                                                            08152714
     DO;                                                                08152814
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08152914
                                 'DB2',                                 08153014
                                 '#016');                               08153114
     END;                                                               08153214
 END;                                                                   08153314
                                                                        08153414
 /********************************************************************/ 08153514
 PARM_RCB024M.VIEW_NAME      = 'RCBT0380_HW_PR_MOD';                    08153614
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08153714
                                                                        08153814
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08153914
               PTR_RETURN_AREA_BB,                                      08154014
               PTR_INT_AREA);                                           08154114
                                                                        08154214
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08154314
   WHEN (0);                                                            08154414
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08154514
     DO;                                                                08154614
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#057');                      08154714
     END;                                                               08154814
   OTHERWISE                                                            08154914
     DO;                                                                08155014
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08155114
                                 'DB2',                                 08155214
                                 '#017');                               08155314
     END;                                                               08155414
 END;                                                                   08155514
                                                                        08155614
 /********************************************************************/ 08155714
 PARM_RCB024M.VIEW_NAME      = 'RCBT0400_PO_MOD1';                      08155814
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08155914
                                                                        08156014
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08156114
               PTR_RETURN_AREA_BB,                                      08156214
               PTR_INT_AREA);                                           08156314
                                                                        08156414
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08156514
   WHEN (0);                                                            08156614
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08156714
     DO;                                                                08156814
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#058');                      08156914
     END;                                                               08157014
   OTHERWISE                                                            08157114
     DO;                                                                08157214
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08157314
                                 'DB2',                                 08157414
                                 '#018');                               08157514
     END;                                                               08157614
 END;                                                                   08157714
                                                                        08157814
 /********************************************************************/ 08157914
 PARM_RCB024M.VIEW_NAME      = 'RCBT0470_SERV_COND';                    08158014
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08158114
                                                                        08158214
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08158314
               PTR_RETURN_AREA_BB,                                      08158414
               PTR_INT_AREA);                                           08158514
                                                                        08158614
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08158714
   WHEN (0);                                                            08158814
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08158914
     DO;                                                                08159014
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#059');                      08159114
     END;                                                               08159214
   OTHERWISE                                                            08159314
     DO;                                                                08159414
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08159514
                                 'DB2',                                 08159614
                                 '#019');                               08159714
     END;                                                               08159814
 END;                                                                   08159914
                                                                        08160014
 /********************************************************************/ 08160114
 PARM_RCB024M.VIEW_NAME      = 'ROLT0726_OEI_HW';                       08160214
 PARM_RCB024M.LOCK_MODE      = 'S';                    /* SHARE MODE */ 08160314
                                                                        08160414
 CALL RCB024M (ADDR(PARM_RCB024M),                                      08160514
               PTR_RETURN_AREA_BB,                                      08160614
               PTR_INT_AREA);                                           08160714
                                                                        08160814
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    08160914
   WHEN (0);                                                            08161014
   WHEN (4)                        /* INVALID OR AMBIGUOUS PARAMETER */ 08161114
     DO;                                                                08161214
       CALL ROLDOBM_ERROR (NULL, 'OTHER', '#060');                      08161314
     END;                                                               08161414
   OTHERWISE                                                            08161514
     DO;                                                                08161614
       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),            08161714
                                 'DB2',                                 08161814
                                 '#020');                               08161914
     END;                                                               08162014
 END;                                           /* EOC TEMEA-T081298 */ 08162116
                                                                        08162214
                                                                        08162314
 END R001_LOCK_TABLES;                                                  08162414
                                                                        08162514
1/********************************************************************/ 08162614
 /*                                                                  */ 08163014
 /* MODULE NAME      : R011_TRANS_TPMNT                              */ 08170002
 /*                                                                  */ 08180002
 /* DESCRIPTION      : TRANSLATE TYPE_OF_MAINT TO MACHINE STATUS     */ 08190002
 /*                                                                  */ 08200002
 /********************************************************************/ 08210002
 R011_TRANS_TPMNT : PROC (TYPE_OF_MAINT)                                08220002
                       RETURNS (CHAR(01));                              08230002
 DCL TYPE_OF_MAINT         CHAR(01);                                    08240002
 DCL MA_ST                 CHAR(01);                                    08250002
 DCL I                     FIXED BIN(31);                               08260002
                                                                        08270002
 MA_ST           = '';                                                  08280002
                                                                        08290002
 DO I = 1 TO PARM_RCBP67S.NUMBER_OF_TPMNT;                              08300002
   IF TYPE_OF_MAINT = PARM_RCBP67S.TPMNT_TABLE.TYPE_MNT(I)              08310002
   THEN                                                                 08320002
     DO;                                                                08330002
       MA_ST  = PARM_RCBP67S.TPMNT_TABLE.MA_ST(I);                      08340002
       I = 999;                                                         08350002
     END;                                                               08360002
 END;                                                                   08370002
                                                                        08380002
 /* WHEN MACHINE IS UNDER FLEXIBLE WARRANTY GET MA STATUS FROM */       08390002
 /* RCB064 PARAMETER, IF RCB064 MA STATUS IS BLANK THEN GET    */       08400002
 /* MA STATUS FROM RCB063 PARAMETER AT GEO LEVEL               */       08410002
                                                                        08420002
 /*IF (FLEXIBLE_WARRANTY_BAU | FLEXIBLE_WARRANTY_PI) THEN            */ 08430002
 /*DO;                                                               */ 08440002
 /* IF F_WARRANTY_MA_STATUS THEN                                     */ 08450002
 /*   DO;                                                            */ 08460002
 /*    IF TYPE_OF_MAINT = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,1,1)*/ 08470002
 /*    THEN                                                          */ 08480002
 /*      DO;                                                         */ 08490002
 /*       MA_ST = SUBSTR(PARM_RCBP64S.F_WARRANTY_MACHINE,2,1);       */ 08500002
 /*      END;                                                        */ 08510002
 /*    ELSE                                                          */ 08520002
 /*      DO;                                                         */ 08530002
 /*       IF TYPE_OF_MAINT =                                         */ 08540002
 /*                  SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,1,1)     */ 08550002
 /*       THEN                                                       */ 08560002
 /*         DO;                                                      */ 08570002
 /*          MA_ST = SUBSTR(PARM_RCBP63S.F_WARRANTY_MACHINE,2,1);    */ 08580002
 /*         END;                                                     */ 08590002
 /*      END;                                                        */ 08600002
 /*   END;                                                           */ 08610002
 /*END;                                                              */ 08620002
                                                                        08630002
 RETURN(MA_ST);                                                         08640002
                                                                        08650002
 END R011_TRANS_TPMNT;                                                  08660002
                                                                        08670002
1/*********************************************************************/08680002
 /*                                                       SOC RC01158 */08690002
 /* MODULE NAME      :  R014_DATE_CALC                                */08700002
 /*                                                                   */08710002
 /* DESCRIPTION      :                                                */08720002
 /*                                                                   */08730002
 /*********************************************************************/08740002
 R014_DATE_CALC: PROC (DB2_DATE_IN                                      08750002
                      ,WRK_AMOUNT)                                      08760002
                       RETURNS (CHAR(10));                              08770002
                                                                        08780002
 DCL DB2_DATE_IN         CHAR(10);                                      08790002
 DCL WRK_AMOUNT          FIXED BIN (31);                                08800002
                                                                        08810002
 PARM_DATE_CALC = '';                                                   08820002
 PARM_DATE_CALC.WD_IN_FORMAT   = 'ISO';                                 08830002
 PARM_DATE_CALC.WD_OUT_FORMAT  = 'ISO';                                 08840002
 PARM_DATE_CALC.WD_FUNCTION    = 'C';                                   08850002
 PARM_DATE_CALC.WD_PERIOD_TYPE = 'D';                                   08860002
 PARM_DATE_CALC.WD_PERIOD      = WRK_AMOUNT;                            08870002
 PARM_DATE_CALC.WD_IN_DATE     = DB2_DATE_IN;                           08880002
                                                                        08890002
 CALL RCB004M (ADDR(PARM_DATE_CALC));                                   08900002
                                                                        08910002
 IF PARM_DATE_CALC.WD_STATUS ¬= ''                                      08920002
 THEN                                                                   08930002
   DO;                                                                  08940002
     PUT LIST('ERRORE CALCOLO DATA + 1 GIORNO',DB2_DATE_IN) ;           08950002
     SIGNAL ERROR;                                                      08960002
   END;                                                                 08970002
                                                                        08980002
 RETURN(PARM_DATE_CALC.WD_OUT_DATE);                                    08990002
                                                                        09000002
 END R014_DATE_CALC;                                   /* EOC RC01158 */09010002
                                                                        09020002
1/********************************************************************/ 09030002
 /*                                                                  */ 09040002
 /* MODULE NAME      : R016_SERV_DIV                                 */ 09050002
 /*                                                                  */ 09060002
 /* DESCRIPTION      : CALCULATE BUSINESS UNIT DEVISION DEPENDING ON */ 09070002
 /*                    THE CUSTOMER NUMBER                           */ 09080002
 /*                                                                  */ 09090002
 /********************************************************************/ 09100002
 R016_SERV_DIV:     PROC (CUSTOMER_NUMBER)                              09110002
                          RETURNS (CHAR(01));                           09120002
                                                                        09130002
 DCL CUSTOMER_NUMBER       CHAR (08);                                   09140002
 DCL SERV_DIV              CHAR (01);                                   09150002
 DCL I                     FIXED BIN(31);                               09160002
                                                                        09170002
 IF SUBSTR(CUSTOMER_NUMBER,3,2) ¬= '99'                                 09180002
 THEN                                                                   09190002
   DO;                                                                  09200002
     SERV_DIV = '2';                                                    09210002
   END;                                                                 09220002
 ELSE                                                                   09230002
   DO;                                                                  09240002
     DO I = 1 TO PARM_RCBP68S.NUMBER_OF_OCC;                            09250002
       IF SUBSTR(CUSTOMER_NUMBER,5,1) =                                 09260002
                             PARM_RCBP68S.CUNO_TABLE.CUNO_POS_5(I)      09270002
       THEN                                                             09280002
         DO;                                                            09290002
           SERV_DIV = PARM_RCBP68S.CUNO_TABLE.SERV_DIV(I);              09300002
           I = 999;                                                     09310002
         END;                                                           09320002
     END;                                                               09330002
   END;                                                                 09340002
                                                                        09350002
 RETURN(SERV_DIV);                                                      09360002
                                                                        09370002
 END R016_SERV_DIV;                                                     09380002
                                                                        09390002
1/*********************************************************************/09400002
 /*                                                                   */09410002
 /* MODULE NAME      :  R50A_RETR_ADD_HW_INFO                         */09420002
 /*                                                                   */09430002
 /* DESCRIPTION      :                                                */09440002
 /*                                                                   */09450002
 /*********************************************************************/09460002
 R50A_RETR_ADD_HW_INFO: PROC;                                           09470002
                                                                        09480002
 /*  PUT LIST('R50A_RETR_ADD_HW_INFO')  SKIP;                 /*TRACE*/ 09490002
                                                                        09500002
 TB_RCBV110 = '';                                                       09510002
                                                                        09520002
 EXEC SQL                                                               09530002
   SELECT   STATUS                                                      09540002
          , SOURCE_INDICATOR                                            09550002
     INTO   :TB_RCBV110.STATUS                                          09560002
          , :TB_RCBV110.SOURCE_INDICATOR                                09570002
     FROM   RCBV0110_HW_STATUS                                          09580002
    WHERE   COUNTRY_NUMBER    = :WRK_CTRYNO                             09590002
      AND   PRODUCT_TYPE      = :CURSOR_HW_I_V220.PRODUCT_TYPE          09600002
      AND   ORIGIN            = :CURSOR_HW_I_V220.ORIGIN                09610002
      AND   SEQUENCE_NUMBER   = :CURSOR_HW_I_V220.SEQUENCE_NUMBER       09620002
      AND   :WRK_RUN_DATE     BETWEEN EFFECTIVE_DATE                    09630002
                              AND     END_DATE                          09640002
 ;                                                                      09650002
                                                                        09660002
 SELECT (SQLCODE);                                                      09670002
   WHEN (0);                                                            09680002
   WHEN (100)                                                           09690002
     DO;                                                                09700002
       TB_RCBV110 = '';                                                 09710002
     END;                                                               09720002
   OTHERWISE                                                            09730002
     DO;                                                                09740002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),                                09750002
                           'DB2',                                       09760002
                           '#0A1');                                     09770002
     END;                                                               09780002
 END;                                                                   09790002
                                                                        09800002
 TB_RCBV300 = '';                                                       09810002
                                                                        09820002
 EXEC SQL                                                               09830002
   SELECT  MODEL_NUMBER                                                 09840002
     INTO  :TB_RCBV300.MODEL_NUMBER                                     09850002
     FROM  RCBV0300_HW_REAL                                             09860002
    WHERE  COUNTRY_NUMBER    = :WRK_CTRYNO                              09870002
      AND  PRODUCT_TYPE      = :CURSOR_HW_I_V220.PRODUCT_TYPE           09880002
      AND  ORIGIN            = :CURSOR_HW_I_V220.ORIGIN                 09890002
      AND  SEQUENCE_NUMBER   = :CURSOR_HW_I_V220.SEQUENCE_NUMBER        09900002
      AND  :WRK_RUN_DATE     BETWEEN EFFECTIVE_DATE                     09910002
                             AND     END_DATE                           09920002
 ;                                                                      09930002
                                                                        09940002
 SELECT (SQLCODE);                                                      09950002
   WHEN (0)                                                             09960002
     DO;                                                                09970002
       SK_HW_I.MODEL_NUMBER = TB_RCBV300.MODEL_NUMBER ;                 09980002
     END;                                                               09990002
   WHEN (100)                                                           10000002
     DO;                                                                10010002
       TB_RCBV300 = '';                                                 10020002
     END;                                                               10030002
   OTHERWISE                                                            10040002
     DO;                                                                10050002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),                                10060002
                           'DB2',                                       10070002
                           '#0A2');                                     10080002
     END;                                                               10090002
 END;                                                                   10100002
                                                                        10110002
 TB_RCBV380 = '';                                                       10120002
                                                                        10130002
 EXEC SQL                                                               10140002
   SELECT   TYPE_OF_AGREEMENT                                           10150002
          , MARKET_RESP_CODE                                            10160002
          , DP_SYSTEM_NUMBER                                            10170002
          , INSTALLING_OU                                               10180002
          , CPU_TYPE                                                    10190002
     INTO   :TB_RCBV380.TYPE_OF_AGREEMENT  :WRK_INDNULL                 10200002
          , :TB_RCBV380.MARKET_RESP_CODE   :WRK_INDNULL                 10210002
          , :TB_RCBV380.DP_SYSTEM_NUMBER   :WRK_INDNULL                 10220002
          , :TB_RCBV380.INSTALLING_OU      :WRK_INDNULL                 10230002
          , :TB_RCBV380.CPU_TYPE           :WRK_INDNULL                 10240002
     FROM   RCBV0380_HW_PR_MOD                                          10250002
    WHERE   COUNTRY_NUMBER    = :WRK_CTRYNO                             10260002
      AND   PRODUCT_TYPE      = :CURSOR_HW_I_V220.PRODUCT_TYPE          10270002
      AND   ORIGIN            = :CURSOR_HW_I_V220.ORIGIN                10280002
      AND   SEQUENCE_NUMBER   = :CURSOR_HW_I_V220.SEQUENCE_NUMBER       10290002
      AND   :WRK_RUN_DATE     BETWEEN EFFECTIVE_DATE                    10300002
                              AND     END_DATE                          10310002
 ;                                                                      10320002
                                                                        10330002
 SELECT (SQLCODE);                                                      10340002
   WHEN (0);                                                            10350002
   WHEN (100)                                                           10360002
     DO;                                                                10370002
       TB_RCBV380 = '';                                                 10380002
     END;                                                               10390002
   OTHERWISE                                                            10400002
     DO;                                                                10410002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),                                10420002
                           'DB2',                                       10430002
                           '#0A3');                                     10440002
     END;                                                               10450002
 END;                                                                   10460002
                                                                        10470002
 TB_RCBV19X = '';          /***********  SEARCH FOR OWNER CUSTOMER  ***/10480002
                                                                        10490002
 EXEC SQL                                                               10500002
   SELECT   CUSTOMER_NUMBER                                             10510002
     INTO   :TB_RCBV19X.CUSTOMER_NUMBER   :WRK_INDNULL                  10520002
     FROM   RCBV0190_HW_CUST                                            10530002
    WHERE   COUNTRY_NUMBER    = :WRK_CTRYNO                             10540002
      AND   PRODUCT_TYPE      = :CURSOR_HW_I_V220.PRODUCT_TYPE          10550002
      AND   ORIGIN            = :CURSOR_HW_I_V220.ORIGIN                10560002
      AND   SEQUENCE_NUMBER   = :CURSOR_HW_I_V220.SEQUENCE_NUMBER       10570002
      AND   TYPE_OF_RELATION  = 'O'                                     10580002
      AND   :WRK_RUN_DATE     BETWEEN EFFECTIVE_DATE                    10590002
                              AND     END_DATE                          10600002
 ;                                                                      10610002
                                                                        10620002
 SELECT (SQLCODE);                                                      10630002
   WHEN (0);                                                            10640002
   WHEN (100)                                                           10650002
     DO;                                                                10660002
       TB_RCBV19X = '';                                                 10670002
     END;                                                               10680002
   OTHERWISE                                                            10690002
     DO;                                                                10700002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),                                10710002
                           'DB2',                                       10720002
                           '#0A4');                                     10730002
     END;                                                               10740002
 END;                                                                   10750002
                                                                        10760002
 END R50A_RETR_ADD_HW_INFO;                                             10770002
                                                                        10780002
1/*********************************************************************/10790002
 /*                                                                   */10800002
 /* MODULE NAME      :  R50B_PRODUCT_OFFERING                         */10810002
 /*                                                                   */10820002
 /* DESCRIPTION      :                                                */10830002
 /*                                                                   */10840002
 /*********************************************************************/10850002
 R50B_PRODUCT_OFFERING: PROC;                                           10860002
                                                                        10870002
 /*  PUT LIST('R50B_PRODUCT_OFFERING')  SKIP;                 /*TRACE*/ 10880002
                                                                        10890002
                                  /* RETRIEVE ADDITIONAL PO INFO     */ 10900002
 TB_RCBV400 = '';                                                       10910002
                                                                        10920002
 EXEC SQL                                                               10930002
   SELECT REPAIR_CENTER_MARK                                            10940002
         ,MACHINE_CATEGORY                                              10950002
         ,ACTIVITY_REP_OPT                                              10960002
         ,CUSTOMER_SETUP_IND                                            10970002
         ,WARRANTY_CATEGORY                                             10980002
         ,CE_PRODUCT_KEY                                                10990002
         ,PROD_REVENUE_DIV                                              11000002
         ,SEGMENT_ACRONYM                                               11010002
     INTO :TB_RCBV400.REPAIR_CENTER_MARK  :WRK_INDNULL                  11020002
         ,:TB_RCBV400.MACHINE_CATEGORY    :WRK_INDNULL                  11030002
         ,:TB_RCBV400.ACTIVITY_REP_OPT    :WRK_INDNULL                  11040002
         ,:TB_RCBV400.CUSTOMER_SETUP_IND  :WRK_INDNULL                  11050002
         ,:TB_RCBV400.WARRANTY_CATEGORY   :WRK_INDNULL                  11060002
         ,:TB_RCBV400.CE_PRODUCT_KEY      :WRK_INDNULL                  11070002
         ,:TB_RCBV400.PROD_REVENUE_DIV    :WRK_INDNULL                  11080002
         ,:TB_RCBV400.SEGMENT_ACRONYM     :WRK_INDNULL                  11090002
     FROM RCBV0400_PO_MOD1                                              11100002
    WHERE COUNTRY_NUMBER  = :WRK_CTRYNO                                 11110002
      AND PRODUCT_TYPE    = :SK_CURRENT.PRODUCT_TYPE                    11120002
      AND MODEL_NUMBER    = :SK_CURRENT.MODEL_NUMBER                    11130002
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        11140002
                          AND     END_DATE                              11150002
      ;                                                                 11160002
                                                                        11170002
 SELECT (SQLCODE);                                                      11180002
   WHEN (0);                                                            11190002
   WHEN (100)                                                           11200002
     DO;                                                                11210002
       TB_RCBV400 = '';                                                 11220002
     END;                                                               11230002
   OTHERWISE                                                            11240002
     DO;                                                                11250002
        CALL ROLDOBM_ERROR (ADDR (SQLCA),                               11260002
                    'DB2',                                              11270002
                    '#0B1');                                            11280002
     END;                                                               11290002
 END;                                                                   11300002
                                                                        11310002
                               /* RETRIEVE HARDWARE PRODUCT OFFERING */ 11320002
 TB_RCBV070 = '';                                                       11330002
                                                                        11340002
 EXEC SQL                                                               11350002
   SELECT PRODUCT_NAME                                                  11360002
         ,VENDOR_NAME                                                   11370002
         ,RETAIN_FLAG                                                   11380002
     INTO :TB_RCBV070.PRODUCT_NAME        :WRK_INDNULL                  11390002
         ,:TB_RCBV070.VENDOR_NAME         :WRK_INDNULL                  11400002
         ,:TB_RCBV070.RETAIN_FLAG         :WRK_INDNULL                  11410002
     FROM RCBV0070_HW_PO                                                11420002
    WHERE COUNTRY_NUMBER  = :WRK_CTRYNO                                 11430002
      AND PRODUCT_TYPE    = :SK_CURRENT.PRODUCT_TYPE                    11440002
      AND MODEL_NUMBER    = :SK_CURRENT.MODEL_NUMBER                    11450002
      AND :WRK_RUN_DATE   BETWEEN EFFECTIVE_DATE                        11460002
                          AND     END_DATE                              11470002
      ;                                                                 11480002
                                                                        11490002
 SELECT (SQLCODE);                                                      11500002
   WHEN (0);                                                            11510002
   WHEN (100)                                                           11520002
     DO;                                                                11530002
       TB_RCBV070 = '';                                                 11540002
     END;                                                               11550002
   OTHERWISE                                                            11560002
     DO;                                                                11570002
        CALL ROLDOBM_ERROR (ADDR (SQLCA),                               11580002
                    'DB2',                                              11590002
                    '#0B2');                                            11600002
     END;                                                               11610002
 END;                                                                   11620002
                                                                        11630002
 END R50B_PRODUCT_OFFERING;                                             11640002
                                                                        11650002
1/*********************************************************************/11660002
 /*                                                                  */ 11670002
 /* MODULE NAME      :  R50C_RETR_CTR_INFO                            */11680002
 /*                                                                  */ 11690002
 /* DESCRIPTION      :                                                */11700002
 /*                                                                  */ 11710002
 /*********************************************************************/11720002
 R50C_RETR_CTR_INFO: PROC;                                              11730002
                                                                        11740002
 /*  PUT LIST('R50C_RETR_CTR_INFO')  SKIP;                    /*TRACE*/ 11750002
                                                                        11760002
     TB_RCBV030 = '';                                                   11770002
     TB_RCBV240 = '';                                                   11780002
     TB_RCBV470 = '';                                                   11790002
                                                                        11800002
 /*********************************************************************/11810002
 /* RETRIEVE SERVICE CONTRACT INFORMATION IN CASE OF SERVICE          */11820002
 /*********************************************************************/11830002
 IF CURSOR_HW_I_V220.TYPE_OF_MAINT = WRK_TPMNT_VAL.TPMNT_ST2_DEF        11840002
 THEN                                                                   11850002
   DO;                                                                  11860002
     EXEC SQL                                                           11870002
       SELECT  A.HVP_QUANTITY                                           11880002
             , A.CONTRACT_NUMBER                                        11890002
             , B.TYPE_OF_CONTRACT                                       11900002
             , A.SERVICE_TYPE                                           11910002
             , A.SERVICE_LVL_CODE                                       11920002
             , A.SOURCE_INDICATOR                                       11930002
             , A.SERVICE_START_DATE                                     11940002
             , A.SERVICE_STOP_DATE                                      11950002
             , A.COVERAGE_START_1                                       11960002
             , A.COVERAGE_END_1                                         11970002
             , A.COVERAGE_START_6                                       11980002
             , A.COVERAGE_END_6                                         11990002
             , A.COVERAGE_START_7                                       12000002
             , A.COVERAGE_END_7                                         12010002
         INTO  :TB_RCBV240.HVP_QUANTITY        :WRK_INDNULL             12020002
             , :TB_RCBV240.CONTRACT_NUMBER     :WRK_INDNULL             12030002
             , :TB_RCBV030.TYPE_OF_CONTRACT    :WRK_INDNULL             12040002
             , :TB_RCBV240.SERVICE_TYPE        :WRK_INDNULL             12050002
             , :TB_RCBV240.SERVICE_LVL_CODE    :WRK_INDNULL             12060002
             , :TB_RCBV240.SOURCE_INDICATOR    :WRK_INDNULL             12070002
             , :TB_RCBV240.SERVICE_START_DATE  :WRK_INDNULL             12080002
             , :TB_RCBV240.SERVICE_STOP_DATE   :WRK_INDNULL             12090002
             , :TB_RCBV240.COVERAGE_START_1    :WRK_INDNULL             12100002
             , :TB_RCBV240.COVERAGE_END_1      :WRK_INDNULL             12110002
             , :TB_RCBV240.COVERAGE_START_6    :WRK_INDNULL             12120002
             , :TB_RCBV240.COVERAGE_END_6      :WRK_INDNULL             12130002
             , :TB_RCBV240.COVERAGE_START_7    :WRK_INDNULL             12140002
             , :TB_RCBV240.COVERAGE_END_7      :WRK_INDNULL             12150002
         FROM  RCBV0240_SERV_CTR   A                                    12160002
             , RCBV0030_CONTRACT   B                                    12170002
        WHERE  A.COUNTRY_NUMBER   = :WRK_CTRYNO                         12180002
                                                                        12190002
          AND  A.COUNTRY_NUMBER   = B.COUNTRY_NUMBER                    12200002
          AND  A.CONTRACT_NUMBER  = B.CONTRACT_NUMBER                   12210002
                                                                        12220002
          AND  A.PRODUCT_TYPE     = :CURSOR_HW_I_V220.PRODUCT_TYPE      12230002
          AND  A.ORIGIN           = :CURSOR_HW_I_V220.ORIGIN            12240002
          AND  A.SEQUENCE_NUMBER  = :CURSOR_HW_I_V220.SEQUENCE_NUMBER   12250002
          AND  :WRK_RUN_DATE      BETWEEN A.EFFECTIVE_DATE              12260002
                                  AND     A.END_DATE                    12270002
     ;                                                                  12280002
                                                                        12290002
     SELECT (SQLCODE);                                                  12300002
       WHEN (0);                                                        12310002
       WHEN (100)                                                       12320002
         DO;                                                            12330002
           TB_RCBV030 = '';                                             12340002
           TB_RCBV240 = '';                                             12350002
         END;                                                           12360002
       OTHERWISE                                                        12370002
         DO;                                                            12380002
           CALL ROLDOBM_ERROR (ADDR (SQLCA),                            12390002
                               'DB2',                                   12400002
                               '#0C1');                                 12410002
         END;                                                           12420002
     END;                                                               12430002
                                                                        12440002
     IF ( TB_RCBV240.SERVICE_LVL_CODE > '   ' ) THEN                    12450002
       DO;                                                              12460002
         EXEC SQL                                                       12470002
           SELECT  SERVICE_DLVR_METHD                                   12480002
             INTO  :TB_RCBV470.SERVICE_DLVR_METHD                       12490002
             FROM  RCBV0470_SERV_COND                                   12500002
            WHERE  SERVICE_LVL_CODE  = :TB_RCBV240.SERVICE_LVL_CODE     12510002
         ;                                                              12520002
                                                                        12530002
         SELECT (SQLCODE);                                              12540002
           WHEN (0);                                                    12550002
           WHEN (100)                                                   12560002
             DO;                                                        12570002
               TB_RCBV470 = '';                                         12580002
             END;                                                       12590002
           OTHERWISE                                                    12600002
             DO;                                                        12610002
               CALL ROLDOBM_ERROR (ADDR (SQLCA),                        12620002
                                   'DB2',                               12630002
                                   '#0C3');                             12640002
             END;                                                       12650002
         END;                                                           12660002
       END;                                                             12670002
                                                                        12680002
   END;                                                                 12690002
 /*********************************************************************/12700002
 /* DESCRIPTION : RICERCA SEGMENTO POSIZIONE FUTURA           RIA 555 */12710002
 /*********************************************************************/12720002
     COMODO_TPMNNEW           = '';                        /* RIA 555 */12730002
     COMODO_SLCNEW            = '';                        /* RIA 555 */12740002
     COMODO_DTPMNNEW          = '';                        /* RIA 555 */12750002
                                                           /* RIA 555 */12760002
 IF CURSOR_HW_I_V220.END_DATE <  '9999-12-31'              /* RIA 555 */12770002
 THEN                                                      /* RIA 555 */12780002
   DO;                                                     /* RIA 555 */12790002
                                                         /*** RIA 614 */12800002
     COMODO_NEXT_DAY = R014_DATE_CALC(CURSOR_HW_I_V220.END_DATE,+1);    12810002
                                                         /*** RIA 614 */12820002
     EXEC SQL                                              /* RIA 555 */12830002
       SELECT Z.TYPE_OF_MAINT                              /* RIA 555 */12840002
             ,Z.SERVICE_LVL_CODE                           /*         */12850002
             ,Z.EFFECTIVE_DATE                             /* RIA 555 */12860002
         INTO :COMODO_TPMNNEW                 :WRK_INDNULL /* RIA 555 */12870002
             ,:COMODO_SLCNEW                  :WRK_INDNULL /*         */12880002
             ,:COMODO_DTPMNNEW                :WRK_INDNULL /* RIA 555 */12890002
       FROM RCBV0220_SUPPL_CTR Z                           /* RIA 555 */12900002
       WHERE Z.PRODUCT_TYPE    = :CURSOR_HW_I_V220.PRODUCT_TYPE    /*5*/12910002
         AND Z.ORIGIN          = :CURSOR_HW_I_V220.ORIGIN          /*5*/12920002
         AND Z.SEQUENCE_NUMBER = :CURSOR_HW_I_V220.SEQUENCE_NUMBER /*5*/12930002
         AND COUNTRY_NUMBER    = :WRK_CTRYNO                            12940002
                                                         /*** RIA 614 */12950002
         AND Z.EFFECTIVE_DATE  = :COMODO_NEXT_DAY                       12960002
                                                         /*** RIA 614 */12970002
     ;                                                     /* RIA 555 */12980002
                                                           /* RIA 555 */12990002
     SELECT (SQLCODE);                                     /* RIA 555 */13000002
       WHEN (0);                                           /* RIA 555 */13010002
       WHEN (100)                                                       13020002
         DO;                                                            13030002
           COMODO_TPMNNEW     = '';                        /* RIA 555 */13040002
           COMODO_SLCNEW      = '';                        /* RIA 555 */13050002
           COMODO_DTPMNNEW    = '';                        /* RIA 555 */13060002
         END;                                                           13070002
       OTHERWISE                                           /* RIA 555 */13080002
         DO;                                               /* RIA 555 */13090002
           CALL ROLDOBM_ERROR (ADDR (SQLCA),               /* RIA 555 */13100002
                               'DB2',                      /* RIA 555 */13110002
                               '#0C2');                    /* RIA 555 */13120002
         END;                                              /* RIA 555 */13130002
     END;                                                  /* RIA 555 */13140002
   END;                                                    /* RIA 555 */13150002
                                                                        13160002
 END R50C_RETR_CTR_INFO;                                                13170002
                                                                        13180002
1/*********************************************************************/13190002
 /*                                                                   */13200002
 /* MODULE NAME      :  R50X_RETR_ADD_CUST_INFO                       */13210002
 /*                                                                   */13220002
 /* DESCRIPTION      :                                                */13230002
 /*                                                                   */13240002
 /*********************************************************************/13250002
 R50X_RETR_ADD_CUST_INFO: PROC;                                         13260002
                                                                        13270002
 /*  PUT LIST('R50X_RETR_ADD_CUST_INFO')  SKIP;               /*TRACE*/ 13280002
                                                                        13290002
 TB_RCBV010 = '';                                                       13300002
 TB_RCBV280 = '';                                                       13310002
 TB_RCBV350 = '';                                                       13320002
                                                                        13330002
 EXEC SQL                                                               13340002
   SELECT   T010.CUSTOMER_NAME                                          13350002
          , T010.CUSTOMER_LOCATION                                      13360002
          , T010.TYPE_OF_CUSTOMER                                       13370002
          , T280.TEXT                                                   13380002
          , T350.EMBARGO_CODE                                           13390002
          , T350.CASH_ON_DELIVERY                                       13400002
          , T350.CU_ENGINEERING_OU                                      13410002
          , T350.MKT_INSTALLING_OU                                      13420002
     INTO   :TB_RCBV010.CUSTOMER_NAME       :WRK_INDNULL                13430002
          , :TB_RCBV010.CUSTOMER_LOCATION   :WRK_INDNULL                13440002
          , :TB_RCBV010.TYPE_OF_CUSTOMER    :WRK_INDNULL                13450002
          , :TB_RCBV280.TEXT                :WRK_INDNULL                13460002
          , :TB_RCBV350.EMBARGO_CODE        :WRK_INDNULL                13470002
          , :TB_RCBV350.CASH_ON_DELIVERY    :WRK_INDNULL                13480002
          , :TB_RCBV350.CU_ENGINEERING_OU   :WRK_INDNULL                13490002
          , :TB_RCBV350.MKT_INSTALLING_OU   :WRK_INDNULL                13500002
                                                                        13510002
    FROM    RCBV0010_CUSTOMER   T010                                    13520002
          , RCBV0280_ADDR_LINE  T280                                    13530002
          , RCBV0350_CUST_MOD   T350                                    13540002
                                                                        13550002
    WHERE   T010.COUNTRY_NUMBER  = :WRK_CTRYNO                          13560002
      AND   T010.CUSTOMER_NUMBER = :SK_CURRENT.CUSTOMER_NUMBER          13570002
      AND   :WRK_RUN_DATE  BETWEEN T010.EFFECTIVE_DATE                  13580002
                               AND T010.END_DATE                        13590002
                                                                        13600002
      AND   T010.COUNTRY_NUMBER  = T350.COUNTRY_NUMBER                  13610002
      AND   T010.CUSTOMER_NUMBER = T350.CUSTOMER_NUMBER                 13620002
      AND   :WRK_RUN_DATE  BETWEEN T350.EFFECTIVE_DATE                  13630002
                               AND T350.END_DATE                        13640002
                                                                        13650002
      AND   T010.COUNTRY_NUMBER  = T280.COUNTRY_NUMBER                  13660002
      AND   T010.CUSTOMER_NUMBER = T280.CUSTOMER_NUMBER                 13670002
      AND   T280.LINE_NUMBER     = '05'                                 13680002
      AND   T280.ADDRESS_NUMBER                                         13690002
             = ( SELECT  MIN(T150.ADDRESS_NUMBER)                       13700002
                   FROM  CEDSR.RCBV0150_CUST_ADDR  T150                 13710002
                  WHERE  T150.COUNTRY_NUMBER   = T010.COUNTRY_NUMBER    13720002
                    AND  T150.CUSTOMER_NUMBER  = T010.CUSTOMER_NUMBER   13730002
                    AND  T150.ADDRESS_MASK  LIKE '__1%'                 13740002
                    AND  :WRK_RUN_DATE   BETWEEN T150.EFFECTIVE_DATE    13750002
                                             AND T150.END_DATE          13760002
                )                                                       13770002
 ;                                                                      13780002
                                                                        13790002
 SELECT (SQLCODE);                                                      13800002
   WHEN (0);                                                            13810002
   WHEN (100)                                                           13820002
     DO;                                                                13830002
        TB_RCBV010 = '';                                                13840002
        TB_RCBV280 = '';                                                13850002
        TB_RCBV350 = '';                                                13860002
     END;                                                               13870002
   OTHERWISE                                                            13880002
     DO;                                                                13890002
        CALL ROLDOBM_ERROR (ADDR (SQLCA),                               13900002
                            'DB2',                                      13910002
                            '#0X1');                                    13920002
     END;                                                               13930002
 END;                                                                   13940002
                                                                        13950002
 END R50X_RETR_ADD_CUST_INFO;                                           13960002
                                                                        13970002
1/*********************************************************************/13980002
 /*                                                                   */13990002
 /* MODULE NAME      :  R502_FILL_ROLDOB1_I                           */14000002
 /*                                                                   */14010002
 /* DESCRIPTION      :                                                */14020002
 /*                                                                   */14030002
 /*********************************************************************/14040002
 R502_FILL_ROLDOB1_I: PROC;                                             14050002
                                                                        14060002
 /*  PUT LIST('R502_FILL_ROLDOB1_I')  SKIP;                   /*TRACE*/ 14070002
                                                                        14080002
 FILE_ROLDOB1            = '';                                          14090002
 FILE_ROLDOB1.HVP_QTY    = 1 ;                             /* RIA 614 */14100002
                                                                        14110002
 FILE_ROLDOB1.CTRYNO          = WRK_CTRYNO;                             14120002
 FILE_ROLDOB1.TYPESER.TYPE    = CURSOR_HW_I_V220.PRODUCT_TYPE;          14130002
 FILE_ROLDOB1.TYPESER.ORIGIN  = CURSOR_HW_I_V220.ORIGIN;                14140002
 FILE_ROLDOB1.TYPESER.SERNO   = CURSOR_HW_I_V220.SEQUENCE_NUMBER;       14150002
                                                                        14160002
 FILE_ROLDOB1.BAUPRI     = 'BAU';                                       14170002
 FILE_ROLDOB1.MA_MODEL   = TB_RCBV300.MODEL_NUMBER;                     14180002
 FILE_ROLDOB1.BUILT_MOD  = '';                                          14190002
 FILE_ROLDOB1.MKINSDAT   = CURSOR_HW_I_V190.MARKETING_INSTDAT ;         14200002
 FILE_ROLDOB1.WARREXP    = CURSOR_HW_I_V220.WARRANTY_EXP_DATE;          14210002
 FILE_ROLDOB1.WARRSPLT   = CURSOR_HW_I_V220.F_SPLT_DATE;                14220002
 FILE_ROLDOB1.SLCGAR1    = CURSOR_HW_I_V220.SERVICE_LVL_CODE;           14230002
 FILE_ROLDOB1.SLCGAR2    = '';                                          14240002
 FILE_ROLDOB1.TYPE_MNT   = CURSOR_HW_I_V220.TYPE_OF_WARRANTY;           14250002
 FILE_ROLDOB1.FW_TYPE    = CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY;         14260002
 FILE_ROLDOB1.OU_CODE    = CURSOR_HW_I_V040.OU_CODE;                    14270002
 FILE_ROLDOB1.MABO       = CURSOR_HW_I_V040.MABO;                       14280002
 FILE_ROLDOB1.PRE_CLI    = SUBSTR(CURSOR_HW_I_V190.CUSTOMER_NUMBER,1,2);14290002
 FILE_ROLDOB1.CUST_NO    = SUBSTR(CURSOR_HW_I_V190.CUSTOMER_NUMBER,3,6);14300002
 IF TB_RCBV19X.CUSTOMER_NUMBER > '' THEN                                14310002
    DO;                                                                 14320002
       FILE_ROLDOB1.CUNOOWN = SUBSTR(TB_RCBV19X.CUSTOMER_NUMBER,3,6);   14330002
    END;                                                                14340002
 ELSE                                                                   14350002
    DO;                                                                 14360002
       FILE_ROLDOB1.CUNOOWN =                                           14370002
                       SUBSTR(CURSOR_HW_I_V190.CUSTOMER_NUMBER,3,6);    14380002
    END;                                                                14390002
 FILE_ROLDOB1.DEALER     = '';                                          14400002
 FILE_ROLDOB1.LAST_UPD   = WRK_RUN_DATE                  ;              14410002
 /*********/                                                            14420002
 FILE_ROLDOB1.DPIS       = TB_RCBV110.STATUS;                           14430002
 FILE_ROLDOB1.SOURCE_IND = TB_RCBV110.SOURCE_INDICATOR;                 14440002
 FILE_ROLDOB1.TPAGR      = TB_RCBV380.TYPE_OF_AGREEMENT  ;              14450002
 FILE_ROLDOB1.MKTGD      = TB_RCBV380.MARKET_RESP_CODE   ;              14460002
 FILE_ROLDOB1.SYSTEM_NO  = TB_RCBV380.DP_SYSTEM_NUMBER;                 14470002
 FILE_ROLDOB1.INSTALL_OU = TB_RCBV380.INSTALLING_OU      ;              14480002
 FILE_ROLDOB1.CPU_TYPE   = TB_RCBV380.CPU_TYPE           ;              14490002
 /*********/                                                            14500002
 FILE_ROLDOB1.RETAIN_FLG = TB_RCBV070.RETAIN_FLAG        ;              14510002
 FILE_ROLDOB1.REPAIR_CEN = TB_RCBV400.REPAIR_CENTER_MARK ;              14520002
 FILE_ROLDOB1.CSLMEMC    = TB_RCBV400.MACHINE_CATEGORY   ;              14530002
 FILE_ROLDOB1.ACTIV_REP  = TB_RCBV400.ACTIVITY_REP_OPT   ;              14540002
 FILE_ROLDOB1.CSUCI      = TB_RCBV400.CUSTOMER_SETUP_IND ;              14550002
 FILE_ROLDOB1.WC         = TB_RCBV400.WARRANTY_CATEGORY  ;              14560002
 FILE_ROLDOB1.CE_PR_KEY  = TB_RCBV400.CE_PRODUCT_KEY     ;              14570002
 FILE_ROLDOB1.PRODDIV    = TB_RCBV400.PROD_REVENUE_DIV   ;              14580002
 FILE_ROLDOB1.CJLBSAC    = TB_RCBV400.SEGMENT_ACRONYM    ;              14590002
 /*********/                                                            14600002
 SELECT;                                                                14610002
   WHEN (CURSOR_HW_I_V220.TYPE_OF_MAINT ¬= '')                          14620002
     DO;                                                                14630002
       FILE_ROLDOB1.TYPE_MNT = CURSOR_HW_I_V220.TYPE_OF_MAINT;          14640002
                                  /* IN CASE OF SERVICE CONTRACT     */ 14650002
       IF CURSOR_HW_I_V220.TYPE_OF_MAINT = WRK_TPMNT_VAL.TPMNT_ST2_DEF  14660002
       THEN                                                             14670002
         DO;                                                            14680002
           FILE_ROLDOB1.TYPE_MNT = CURSOR_HW_I_V220.TYPE_OF_MAINT;      14690002
         /*********/                                                    14700002
         FILE_ROLDOB1.HVP_QTY    = TB_RCBV240.HVP_QUANTITY ; /*RIA 614*/14710002
         FILE_ROLDOB1.CONTR_NUMB = TB_RCBV240.CONTRACT_NUMBER    ;      14720002
         FILE_ROLDOB1.TCNUM      = TB_RCBV030.TYPE_OF_CONTRACT   ;      14730002
         FILE_ROLDOB1.SERVTYPE   = TB_RCBV240.SERVICE_TYPE       ;      14740002
         FILE_ROLDOB1.SERVLCD    = TB_RCBV240.SERVICE_LVL_CODE   ;      14750002
         FILE_ROLDOB1.DELMETH    = TB_RCBV470.SERVICE_DLVR_METHD ;      14760002
         FILE_ROLDOB1.MACOVST    = TB_RCBV240.SERVICE_START_DATE ;      14770002
         FILE_ROLDOB1.MACOVEND   = TB_RCBV240.SERVICE_STOP_DATE  ;      14780002
         COMODO_ORARI_LUNGO      = TB_RCBV240.COVERAGE_START_1   ;      14790002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      14800002
         FILE_ROLDOB1.BUMFFROM   = COMODO_ORARI_CORTO            ;      14810002
         COMODO_ORARI_LUNGO      = TB_RCBV240.COVERAGE_END_1     ;      14820002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      14830002
         FILE_ROLDOB1.BUMFTO     = COMODO_ORARI_CORTO            ;      14840002
         COMODO_ORARI_LUNGO      = TB_RCBV240.COVERAGE_START_6   ;      14850002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      14860002
         FILE_ROLDOB1.BUSAFROM   = COMODO_ORARI_CORTO            ;      14870002
         COMODO_ORARI_LUNGO      = TB_RCBV240.COVERAGE_END_6     ;      14880002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      14890002
         FILE_ROLDOB1.BUSATO     = COMODO_ORARI_CORTO            ;      14900002
         COMODO_ORARI_LUNGO      = TB_RCBV240.COVERAGE_START_7   ;      14910002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      14920002
         FILE_ROLDOB1.BUSUFROM   = COMODO_ORARI_CORTO            ;      14930002
         COMODO_ORARI_LUNGO      = TB_RCBV240.COVERAGE_END_7     ;      14940002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      14950002
         FILE_ROLDOB1.BUSUTO     = COMODO_ORARI_CORTO            ;      14960002
         /*********/                                                    14970002
         END;                                                           14980002
     END;                                                               14990002
   WHEN (CURSOR_HW_I_V220.TYPE_OF_WARRANTY ¬= '')                       15000002
     DO;                                                                15010002
       FILE_ROLDOB1.TYPE_MNT = CURSOR_HW_I_V220.TYPE_OF_WARRANTY ;      15020002
       FILE_ROLDOB1.WARREXP  = CURSOR_HW_I_V220.WARRANTY_EXP_DATE;      15030002
     END;                                                               15040002
   OTHERWISE ;                                                          15050002
 END;                                                                   15060002
                                                                        15070002
 FILE_ROLDOB1.MA_STATUS  = R011_TRANS_TPMNT(FILE_ROLDOB1.TYPE_MNT);     15080002
 FILE_ROLDOB1.SERV_DIV   =                                              15090002
                       R016_SERV_DIV(CURSOR_HW_I_V190.CUSTOMER_NUMBER); 15100002
 /*********/                                                            15110002
 FILE_ROLDOB1.CUNAME     =   SUBSTR(TB_RCBV010.CUSTOMER_NAME,1,22)    ; 15120002
 FILE_ROLDOB1.CULOCNAM   =   SUBSTR(TB_RCBV010.CUSTOMER_LOCATION,1,12); 15130002
 FILE_ROLDOB1.RLCXB      =   SUBSTR(TB_RCBV280.TEXT,1,5)              ; 15140002
 FILE_ROLDOB1.TYPE_CUST  =   TB_RCBV010.TYPE_OF_CUSTOMER              ; 15150002
 FILE_ROLDOB1.EMBARGO    =   TB_RCBV350.EMBARGO_CODE                  ; 15160002
 FILE_ROLDOB1.CASH       =   TB_RCBV350.CASH_ON_DELIVERY              ; 15170002
 FILE_ROLDOB1.CUST_OU    =   TB_RCBV350.CU_ENGINEERING_OU             ; 15180002
 FILE_ROLDOB1.MKT_OU     =   TB_RCBV350.MKT_INSTALLING_OU             ; 15190002
 /*********/                                                            15200002
 FILE_ROLDOB1.TPMNNEW    = COMODO_TPMNNEW          ;                    15210002
 FILE_ROLDOB1.DTPMNNEW   = COMODO_DTPMNNEW         ;                    15220002
 FILE_ROLDOB1.MSNEW      = R011_TRANS_TPMNT(FILE_ROLDOB1.TPMNNEW);      15230002
 /*********/                                                            15240002
                                                                        15250002
 END R502_FILL_ROLDOB1_I;                                               15260002
                                                                        15270002
1/*********************************************************************/15280002
 /*                                                                   */15290002
 /* MODULE NAME      :  R802_FILL_ROLDOPI_I                           */15300002
 /*                                                                   */15310002
 /* DESCRIPTION      :                                                */15320002
 /*                                                                   */15330002
 /*********************************************************************/15340002
 R802_FILL_ROLDOPI_I: PROC;                                             15350002
                                                                        15360002
 /*  PUT LIST('R802_FILL_ROLDOPI_I')  SKIP;                   /*TRACE*/ 15370002
                                                                        15380002
 FILE_ROLDOPI            = '';                                          15390002
                                                                        15400002
 FILE_ROLDOPI.CTRYNO          = WRK_CTRYNO;                             15410002
 FILE_ROLDOPI.TYPESER.TYPE    = CURSOR_PI_I_V051.PRODUCT_TYPE;          15420002
 FILE_ROLDOPI.TYPESER.ORIGIN  = CURSOR_PI_I_V051.ORIGIN;                15430002
 FILE_ROLDOPI.TYPESER.SERNO   = CURSOR_PI_I_V051.SEQUENCE_NUMBER;       15440002
                                                                        15450002
 FILE_ROLDOPI.BAUPRI     = 'PRI';                                       15460002
 FILE_ROLDOPI.MA_MODEL   = CURSOR_PI_I_V051.MODEL_NUMBER;               15470002
 FILE_ROLDOPI.BUILT_MOD  = CURSOR_PI_I_V051.BUILT_TO_MODEL_NR;          15480002
 FILE_ROLDOPI.MKINSDAT   = CURSOR_PI_I_V051.INSTALL_DATE ;              15490002
 FILE_ROLDOPI.WARRSPLT   = CURSOR_PI_I_V051.WARRANTY_SPLT_DATE;         15500002
 FILE_ROLDOPI.WARREXP    = CURSOR_PI_I_V051.WARRANTY_EXP_DATE;          15510002
 FILE_ROLDOPI.SLCGAR1    = CURSOR_PI_I_V051.SERVICE_LVL_CODE_1;         15520002
 FILE_ROLDOPI.SLCGAR2    = CURSOR_PI_I_V051.SERVICE_LVL_CODE_2;         15530002
 FILE_ROLDOPI.FW_TYPE    = '';                                          15540002
 FILE_ROLDOPI.OU_CODE    = CURSOR_PI_I_V051.OU_CODE;                    15550002
 FILE_ROLDOPI.MABO       = CURSOR_PI_I_V040.MABO;                       15560002
 FILE_ROLDOPI.PRE_CLI    = SUBSTR(CURSOR_PI_I_V051.CUSTOMER_NUMBER,1,2);15570002
 FILE_ROLDOPI.CUST_NO    = SUBSTR(CURSOR_PI_I_V051.CUSTOMER_NUMBER,3,6);15580002
 FILE_ROLDOPI.CUNOOWN    = SUBSTR(CURSOR_PI_I_V051.CUSTOMER_NUMBER,3,6);15590002
 FILE_ROLDOPI.DEALER     = CURSOR_PI_I_V051.DEALER_NUMBER;              15600002
 FILE_ROLDOPI.LAST_UPD   = WRK_RUN_DATE                  ;              15610002
 /*********/                                                            15620002
 FILE_ROLDOPI.DPIS       = '3';                                         15630002
 FILE_ROLDOPI.SOURCE_IND = CURSOR_PI_I_V051.SOURCE_INDICATOR;           15640002
 /*********/                                                            15650002
 FILE_ROLDOPI.RETAIN_FLG = TB_RCBV070.RETAIN_FLAG        ;              15660002
 FILE_ROLDOPI.REPAIR_CEN = TB_RCBV400.REPAIR_CENTER_MARK ;              15670002
 FILE_ROLDOPI.CSLMEMC    = TB_RCBV400.MACHINE_CATEGORY   ;              15680002
 FILE_ROLDOPI.ACTIV_REP  = TB_RCBV400.ACTIVITY_REP_OPT   ;              15690002
 FILE_ROLDOPI.CSUCI      = TB_RCBV400.CUSTOMER_SETUP_IND ;              15700002
 FILE_ROLDOPI.WC         = TB_RCBV400.WARRANTY_CATEGORY  ;              15710002
 FILE_ROLDOPI.CE_PR_KEY  = TB_RCBV400.CE_PRODUCT_KEY     ;              15720002
 FILE_ROLDOPI.PRODDIV    = TB_RCBV400.PROD_REVENUE_DIV   ;              15730002
 FILE_ROLDOPI.CJLBSAC    = TB_RCBV400.SEGMENT_ACRONYM    ;              15740002
 /*********/                                                            15750002
 FILE_ROLDOPI.TYPE_MNT   = CURSOR_PI_I_V051.TYPE_OF_MAINT;              15760002
 /*********/                                                            15770002
 /* 3 MA_STATUS      CHAR(01)   /*090-CE MACHINE STATUS              */ 15780002
 /*********/                                                            15790002
         /*****************************************************/        15800002
         /* MUOVE DATI CONTRATTO (SE ATTIVO)                  */        15810002
         /*****************************************************/        15820002
                                                                        15830002
 IF TB_RCBV241.EFFECTIVE_DATE > ''           /* SE C'E' UN CONTRATTO */ 15840002
    THEN FILE_ROLDOPI.HVP_QTY  = TB_RCBV241.HVP_QUANTITY    ;           15850002
    ELSE FILE_ROLDOPI.HVP_QTY  = 1                          ;           15860002
                                                                        15870002
                                             /* SE CONTRATTO ATTIVO  */ 15880002
 IF ( WRK_RUN_DATE  >=  TB_RCBV241.EFFECTIVE_DATE )                     15890002
    THEN DO;                                                            15900002
         FILE_ROLDOPI.TYPE_MNT   = '2'                           ;      15910002
         FILE_ROLDOPI.CONTR_NUMB = TB_RCBV241.CONTRACT_NUMBER    ;      15920002
         FILE_ROLDOPI.TCNUM      = ''                            ;      15930002
         FILE_ROLDOPI.SERVTYPE   = TB_RCBV241.SERVICE_TYPE       ;      15940002
         FILE_ROLDOPI.SERVLCD    = TB_RCBV241.SERVICE_LVL_CODE   ;      15950002
         FILE_ROLDOPI.DELMETH    = TB_RCBV470.SERVICE_DLVR_METHD ;      15960002
         FILE_ROLDOPI.MACOVST    = TB_RCBV241.EFFECTIVE_DATE     ;      15970002
         FILE_ROLDOPI.MACOVEND   = TB_RCBV241.END_DATE           ;      15980002
         /*********/                                                    15990002
         COMODO_ORARI_LUNGO      = TB_RCBV241.COVERAGE_START_1   ;      16000002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      16010002
         FILE_ROLDOPI.BUMFFROM   = COMODO_ORARI_CORTO            ;      16020002
         COMODO_ORARI_LUNGO      = TB_RCBV241.COVERAGE_END_1     ;      16030002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      16040002
         FILE_ROLDOPI.BUMFTO     = COMODO_ORARI_CORTO            ;      16050002
         COMODO_ORARI_LUNGO      = TB_RCBV241.COVERAGE_START_6   ;      16060002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      16070002
         FILE_ROLDOPI.BUSAFROM   = COMODO_ORARI_CORTO            ;      16080002
         COMODO_ORARI_LUNGO      = TB_RCBV241.COVERAGE_END_6     ;      16090002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      16100002
         FILE_ROLDOPI.BUSATO     = COMODO_ORARI_CORTO            ;      16110002
         COMODO_ORARI_LUNGO      = TB_RCBV241.COVERAGE_START_7   ;      16120002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      16130002
         FILE_ROLDOPI.BUSUFROM   = COMODO_ORARI_CORTO            ;      16140002
         COMODO_ORARI_LUNGO      = TB_RCBV241.COVERAGE_END_7     ;      16150002
         IF DECIMALE = '3' THEN DECIMALE = '5'                   ;      16160002
         FILE_ROLDOPI.BUSUTO     = COMODO_ORARI_CORTO            ;      16170002
         /*********/                                                    16180002
         FILE_ROLDOPI.AUTHCD     = TB_RCBV241.AUTHORISATION_CODE ;      16190002
         IF  TB_RCBV241.SERVICE_MODULE_4 > '  '  THEN     /* MEI 785 */ 16200002
            DO;                                                         16210002
               FILE_ROLDOPI.SOURCE_IND =                                16220002
               SUBSTR(TB_RCBV241.SERVICE_MODULE_4,2,1)   ;/* MEI 785 */ 16230002
            END;                                                        16240002
                                                          /* RIA 614 */ 16250002
         IF ( TB_RCBV241.SERVICE_MODULE_4 = '1C'          /* MEI 785 */ 16260002
            & TB_RCBV241.SERVICE_MODULE_5 = '//' )        /* RIA 614 */ 16270002
            THEN  FILE_ROLDOPI.SOURCE_IND        = 'C';   /* RIA 614 */ 16280002
                                                          /* RIA 614 */ 16290002
                                                                        16300002
    END;                                                                16310002
 /*********/                                                            16320002
 IF  SUBSTR(SK_CURRENT.CUSTOMER_NUMBER,1,2) = '00'  THEN                16330002
    DO;                                                                 16340002
       FILE_ROLDOPI.CUNAME    = SUBSTR(TB_RCBV010.CUSTOMER_NAME,1,22)  ;16350002
       FILE_ROLDOPI.CULOCNAM  =                                         16360002
                         SUBSTR(TB_RCBV010.CUSTOMER_LOCATION,1,12)     ;16370002
       FILE_ROLDOPI.RLCXB     = SUBSTR(TB_RCBV280.TEXT,1,5)            ;16380002
       FILE_ROLDOPI.TYPE_CUST = TB_RCBV010.TYPE_OF_CUSTOMER            ;16390002
       FILE_ROLDOPI.EMBARGO   = TB_RCBV350.EMBARGO_CODE                ;16400002
       FILE_ROLDOPI.CASH      = TB_RCBV350.CASH_ON_DELIVERY            ;16410002
       FILE_ROLDOPI.CUST_OU   = TB_RCBV350.CU_ENGINEERING_OU           ;16420002
       FILE_ROLDOPI.MKT_OU    = TB_RCBV350.MKT_INSTALLING_OU           ;16430002
    END;                                                                16440002
 ELSE                                                                   16450002
    DO;                                                                 16460002
       FILE_ROLDOPI.CUNAME    = SUBSTR(TB_RCBV011.CUSTOMER_NAME,1,22)  ;16470002
       FILE_ROLDOPI.CULOCNAM  = SUBSTR(TB_RCBV011.ADDRESS_LINE_2,1,12) ;16480002
       FILE_ROLDOPI.RLCXB     = SUBSTR(TB_RCBV011.ZIP_CODE,1,5)        ;16490002
       FILE_ROLDOPI.TYPE_CUST = ''                                     ;16500002
       FILE_ROLDOPI.EMBARGO   = TB_RCBV011.EMBARGO_CODE                ;16510002
       FILE_ROLDOPI.CASH      = ''                                     ;16520002
       FILE_ROLDOPI.CUST_OU   = ''                                     ;16530002
       FILE_ROLDOPI.MKT_OU    = ''                                     ;16540002
    END;                                                                16550002
 /*********/                                                            16560002
                                                                        16570002
 END R802_FILL_ROLDOPI_I;                                               16580002
                                                                        16590002
1/*********************************************************************/16600002
 /*                                                                   */16610002
 /* MODULE NAME      :  R803_LOGICHE_PI_I                             */16620002
 /*                                                                   */16630002
 /* DESCRIPTION      :                                                */16640002
 /*                                                                   */16650002
 /*********************************************************************/16660002
 R803_LOGICHE_PI_I: PROC;                                               16670002
                                                                        16680002
 /*  PUT LIST('R803_LOGICHE_PI_I')  SKIP;                     /*TRACE*/ 16690002
                                                                        16700002
         /********************************************/                 16710002
         /* LOGICHE DI COSTRUZIONE CE_MACHINE_STATUS */                 16720002
         /********************************************/                 16730002
                                                                        16740002
         DONE = FALSE ;                                                 16750002
         SW_PI_DELETE = FALSE ;                                         16760002
                             /* NO GARANZIA E NO CONTRATTO - PERDERE */ 16770002
                                                                        16780002
         IF FILE_ROLDOPI.WARREXP        < WRK_RUN_DATE                  16790002
          & TB_RCBV241.END_DATE         < WRK_RUN_DATE THEN DO;         16800002
            SW_PI_DELETE = TRUE ;                                       16810002
            CTR_PI_SCART = CTR_PI_SCART + 1;                            16820002
            DONE = TRUE;                                                16830002
            END;                                                        16840002
                                                     /* IN CONTRATTO */ 16850002
                                                                        16860002
         IF FILE_ROLDOPI.MACOVST   <= WRK_RUN_DATE                      16870002
          & FILE_ROLDOPI.MACOVEND  >= WRK_RUN_DATE                      16880002
          & DONE ¬= '1'B THEN DO;                                       16890002
            FILE_ROLDOPI.MA_STATUS  = '2';                              16900002
            FILE_ROLDOPI.TYPE_MNT   = '2';                              16910002
            DONE = TRUE;                                                16920002
            END;                                                        16930002
                                                     /* IN GARANZIA  */ 16940002
                                                                        16950002
         IF FILE_ROLDOPI.WARREXP   >= WRK_RUN_DATE                      16960002
            THEN DO ;                                                   16970002
            FILE_ROLDOPI.MA_STATUS  = '9';                              16980002
            FILE_ROLDOPI.TYPE_MNT   =                                   16990002
                                    CURSOR_PI_I_V051.TYPE_OF_WARRANTY;  17000002
            DONE = TRUE;                                                17010002
            END;                                                        17020002
                                         /* ALTRIMENTI NON SERVITO  */  17030002
                                                                        17040002
         IF DONE ¬= '1'B                                                17050002
            THEN DO;                                                    17060002
            FILE_ROLDOPI.MA_STATUS  = '3';                              17070002
            END;                                                        17080002
                                               /* POSIZIONE FUTURA   */ 17090002
         DONE = FALSE;                                                  17100002
                                                                        17110002
                                               /* INIZIA METTENDO    */ 17120002
                                               /* SEMPRE 3 ...       */ 17130002
         FILE_ROLDOPI.TPMNNEW    = '3';                                 17140002
         FILE_ROLDOPI.MSNEW      = '3';                                 17150002
         FILE_ROLDOPI.DTPMNNEW   =                                      17160002
                              R014_DATE_CALC(FILE_ROLDOPI.WARREXP,+1);  17170002
                                                                        17180002
                                               /* POI, SE ATTUALE 2  */ 17190002
         IF FILE_ROLDOPI.MA_STATUS  = '2' THEN DO;                      17200002
            FILE_ROLDOPI.DTPMNNEW   =                                   17210002
                             R014_DATE_CALC(FILE_ROLDOPI.MACOVEND,+1);  17220002
            DONE = TRUE;                                                17230002
            END;                                                        17240002
                                                                        17250002
                                               /* ... SE ATTUALE 3   */ 17260002
         IF FILE_ROLDOPI.MA_STATUS  = '3'                               17270002
          & TB_RCBV241.EFFECTIVE_DATE > WRK_RUN_DATE THEN DO;           17280002
            FILE_ROLDOPI.TPMNNEW    = '2';                              17290002
            FILE_ROLDOPI.MSNEW      = '2';                              17300002
            FILE_ROLDOPI.DTPMNNEW   = TB_RCBV241.EFFECTIVE_DATE;        17310002
            DONE = TRUE;                                                17320002
            END;                                                        17330002
                                                                        17340002
                                               /* ... SE ATTUALE 9   */ 17350002
         IF FILE_ROLDOPI.MA_STATUS  = '9' THEN DO;                      17360002
                                                                        17370002
            WARREXP_PIU_UNO = R014_DATE_CALC(FILE_ROLDOPI.WARREXP,+1);  17380002
                                                                        17390002
            IF TB_RCBV241.EFFECTIVE_DATE <= WARREXP_PIU_UNO             17400002
             & TB_RCBV241.END_DATE       >= WARREXP_PIU_UNO             17410002
               THEN DO;                                                 17420002
               FILE_ROLDOPI.TPMNNEW    = '2';                           17430002
               FILE_ROLDOPI.MSNEW      = '2';                           17440002
               END;                                                     17450002
            DONE = TRUE;                                                17460002
            END;                                                        17470002
                                                                        17480002
                                               /* INFINE, SE OPEN END*/ 17490002
            IF FILE_ROLDOPI.DTPMNNEW   = '0000-01-01' THEN DO;          17500002
               FILE_ROLDOPI.TPMNNEW    = ' ';                           17510002
               FILE_ROLDOPI.MSNEW      = ' ';                           17520002
               FILE_ROLDOPI.DTPMNNEW   = ' ';                           17530002
            END;                                                        17540002
                                                                        17550002
                                               /* ------------------ */ 17560002
         IF ¬SW_PI_DELETE & ¬DONE                                       17570002
            THEN DO;                                                    17580002
            PUT LIST('POSIZIONE FUTURA NON DETERMINATA - MACCHINA ',    17590002
                      FILE_ROLDOPI.TYPE     ||                          17600002
                      FILE_ROLDOPI.ORIGIN   ||                          17610002
                      FILE_ROLDOPI.SERNO      ) SKIP;                   17620002
            END;                                                        17630002
                                                                        17640002
 END R803_LOGICHE_PI_I;                                                 17650002
                                                                        17660002
 /*********************************************************************/17670002
 /*                                                                   */17680002
 /* MODULE NAME : R80C_RETR_CTR_INFO                                  */17690002
 /*                                                                   */17700002
 /* DESCRIPTION : RETRIEVE SERVICE CONTRACT INFO IN CASE OF SERV CTR  */17710002
 /*                                                                   */17720002
 /*********************************************************************/17730002
 R80C_RETR_CTR_INFO: PROC;                                              17740002
                                                                        17750002
 /*  PUT LIST('R80C_RETR_CTR_INFO')  SKIP;                    /*TRACE*/ 17760002
                                                                        17770002
     TB_RCBV241 = '';                                                   17780002
     TB_RCBV470 = '';                                                   17790002
                                                                        17800002
     TB_RCBV241.HVP_QUANTITY =  1;                        /* RIA 614 */ 17810002
                                                                        17820002
     EXEC SQL                                                           17830002
       SELECT  HVP_QUANTITY                                             17840002
             , CONTRACT_NUMBER                                          17850002
             , SERVICE_TYPE                                             17860002
             , SERVICE_LVL_CODE                                         17870002
             , AUTHORISATION_CODE                                       17880002
             , SOURCE_INDICATOR                                         17890002
             , EFFECTIVE_DATE                                           17900002
             , END_DATE                                                 17910002
             , COVERAGE_START_1                                         17920002
             , COVERAGE_END_1                                           17930002
             , COVERAGE_START_6                                         17940002
             , COVERAGE_END_6                                           17950002
             , COVERAGE_START_7                                         17960002
             , COVERAGE_END_7                                           17970002
             , SERVICE_MODULE_4                                         17980002
             , SERVICE_MODULE_5                                         17990002
         INTO  :TB_RCBV241.HVP_QUANTITY        :WRK_INDNULL             18000002
             , :TB_RCBV241.CONTRACT_NUMBER     :WRK_INDNULL             18010002
             , :TB_RCBV241.SERVICE_TYPE        :WRK_INDNULL             18020002
             , :TB_RCBV241.SERVICE_LVL_CODE    :WRK_INDNULL             18030002
             , :TB_RCBV241.AUTHORISATION_CODE  :WRK_INDNULL             18040002
             , :TB_RCBV241.SOURCE_INDICATOR    :WRK_INDNULL             18050002
             , :TB_RCBV241.EFFECTIVE_DATE      :WRK_INDNULL             18060002
             , :TB_RCBV241.END_DATE            :WRK_INDNULL             18070002
             , :TB_RCBV241.COVERAGE_START_1    :WRK_INDNULL             18080002
             , :TB_RCBV241.COVERAGE_END_1      :WRK_INDNULL             18090002
             , :TB_RCBV241.COVERAGE_START_6    :WRK_INDNULL             18100002
             , :TB_RCBV241.COVERAGE_END_6      :WRK_INDNULL             18110002
             , :TB_RCBV241.COVERAGE_START_7    :WRK_INDNULL             18120002
             , :TB_RCBV241.COVERAGE_END_7      :WRK_INDNULL             18130002
             , :TB_RCBV241.SERVICE_MODULE_4    :WRK_INDNULL             18140002
             , :TB_RCBV241.SERVICE_MODULE_5    :WRK_INDNULL             18150002
         FROM  RCBV0241_PI_CTR                                          18160002
        WHERE  PRODUCT_TYPE         =  :CURSOR_PI_I_V051.PRODUCT_TYPE   18170002
          AND  ORIGIN               =  :CURSOR_PI_I_V051.ORIGIN         18180002
          AND  SEQUENCE_NUMBER      =  :CURSOR_PI_I_V051.SEQUENCE_NUMBER18190002
          AND  COUNTRY_NUMBER       =  :WRK_CTRYNO                      18200002
          AND  :WRK_RUN_DATE  BETWEEN  EFFECTIVE_DATE  AND  END_DATE    18210002
     ;                                                                  18220002
                                                                        18230002
     SELECT (SQLCODE);                                                  18240002
       WHEN (0);                                                        18250002
       WHEN (100)                                                       18260002
         DO;                                                            18270002
            TB_RCBV241 = '';                                            18280002
         END;                                                           18290002
       OTHERWISE                                                        18300002
         DO;                                                            18310002
           CALL ROLDOBM_ERROR (ADDR (SQLCA),                            18320002
                               'DB2',                                   18330002
                               '#021');                                 18340002
         END;                                                           18350002
     END;                                                               18360002
                                                                        18370002
     IF ( TB_RCBV241.SERVICE_LVL_CODE > '   ' ) THEN                    18380002
       DO;                                                              18390002
         EXEC SQL                                                       18400002
           SELECT  SERVICE_DLVR_METHD                                   18410002
             INTO  :TB_RCBV470.SERVICE_DLVR_METHD                       18420002
             FROM  RCBV0470_SERV_COND                                   18430002
            WHERE  SERVICE_LVL_CODE  = :TB_RCBV241.SERVICE_LVL_CODE     18440002
         ;                                                              18450002
                                                                        18460002
         SELECT (SQLCODE);                                              18470002
           WHEN (0);                                                    18480002
           WHEN (100)                                                   18490002
             DO;                                                        18500002
               TB_RCBV470 = '';                                         18510002
             END;                                                       18520002
           OTHERWISE                                                    18530002
             DO;                                                        18540002
               CALL ROLDOBM_ERROR (ADDR (SQLCA),                        18550002
                                   'DB2',                               18560002
                                   '#022');                             18570002
             END;                                                       18580002
         END;                                                           18590002
                                                                        18600002
       END;                                                             18610002
                                                                        18620002
 END R80C_RETR_CTR_INFO;                                                18630002
                                                                        18640002
1/*********************************************************************/18650002
 /*                                                                   */18660002
 /* MODULE NAME      :  R80X_RETR_ADD_CUST_INFO                       */18670002
 /*                                                                   */18680002
 /* DESCRIPTION      :                                                */18690002
 /*                                                                   */18700002
 /*********************************************************************/18710002
 R80X_RETR_ADD_CUST_INFO: PROC;                                         18720002
                                                                        18730002
 /*  PUT LIST('R80X_RETR_ADD_CUST_INFO')  SKIP;               /*TRACE*/ 18740002
                                                                        18750002
 TB_RCBV011 = '';                                                       18760002
                                                                        18770002
  EXEC SQL                                                              18780002
    SELECT   CUSTOMER_NAME                                              18790002
           , ADDRESS_LINE_2                                             18800002
           , ZIP_CODE                                                   18810002
           , EMBARGO_CODE                                               18820002
      INTO   :TB_RCBV011.CUSTOMER_NAME          :WRK_INDNULL            18830002
           , :TB_RCBV011.ADDRESS_LINE_2         :WRK_INDNULL            18840002
           , :TB_RCBV011.ZIP_CODE               :WRK_INDNULL            18850002
           , :TB_RCBV011.EMBARGO_CODE           :WRK_INDNULL            18860002
      FROM   RCBV0011_PI_CUST                                           18870002
     WHERE   COUNTRY_NUMBER    = :WRK_CTRYNO                            18880002
       AND   CUSTOMER_NUMBER   = :SK_CURRENT.CUSTOMER_NUMBER            18890002
  ;                                                                     18900002
                                                                        18910002
 SELECT (SQLCODE);                                                      18920002
   WHEN (0);                                                            18930002
   WHEN (100)                                                           18940002
     DO;                                                                18950002
        TB_RCBV011 = '';                                                18960002
     END;                                                               18970002
   OTHERWISE                                                            18980002
     DO;                                                                18990002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),                                19000002
                           'DB2',                                       19010002
                           '#023');                                     19020002
     END;                                                               19030002
 END;                                                                   19040002
                                                                        19050002
 END R80X_RETR_ADD_CUST_INFO;                                           19060002
                                                                        19070002
1/*********************************************************************/19080002
 /*                                                                   */19090002
 /* MODULE NAME      :  R504_WRITE_ROLDOB1                            */19100002
 /*                                                                   */19110002
 /* DESCRIPTION      :                                                */19120002
 /*                                                                   */19130002
 /*********************************************************************/19140002
 R504_WRITE_ROLDOB1: PROC;                                              19150002
                                                                        19160002
 /*  PUT LIST('R504_WRITE_ROLDOB1')  SKIP;                    /*TRACE*/ 19170002
                                              /* UPDATE HASH_TOTAL   */ 19180002
 IF FILE_ROLDOB1.DPIS      > '0' THEN DO;                /************/ 19190002
    CALL RCB018M (SUBSTR(FILE_ROLDOB1.SERNO,1,4),                       19200002
                  WRK_HASH_TOTAL,                                       19210002
                  PTR_INT_AREA);                                        19220002
    /******/                                                            19230002
    IF  FILE_ROLDOB1.CONTR_NUMB < ' ' THEN                              19240002
        FILE_ROLDOB1.CONTR_NUMB = ' ' ;                                 19250002
    IF  FILE_ROLDOB1.MACOVST    < ' ' THEN                              19260002
        FILE_ROLDOB1.MACOVST    = ' ' ;                                 19270002
    IF  FILE_ROLDOB1.MACOVEND   < ' ' THEN                              19280002
        FILE_ROLDOB1.MACOVEND   = ' ' ;                                 19290002
    /******/                                                            19300002
    IF  FILE_ROLDOB1.CUNOOWN    < ' ' THEN                              19310002
        FILE_ROLDOB1.CUNOOWN    = ' ' ;                                 19320002
    IF  FILE_ROLDOB1.CUNAME     < ' ' THEN                              19330002
        FILE_ROLDOB1.CUNAME     = ' ' ;                                 19340002
    IF  FILE_ROLDOB1.CULOCNAM   < ' ' THEN                              19350002
        FILE_ROLDOB1.CULOCNAM   = ' ' ;                                 19360002
    IF  FILE_ROLDOB1.RLCXB      < ' ' THEN                              19370002
        FILE_ROLDOB1.RLCXB      = ' ' ;                                 19380002
    IF  FILE_ROLDOB1.TYPE_CUST  < ' ' THEN                              19390002
        FILE_ROLDOB1.TYPE_CUST  = ' ' ;                                 19400002
    IF  FILE_ROLDOB1.EMBARGO    < ' ' THEN                              19410002
        FILE_ROLDOB1.EMBARGO    = ' ' ;                                 19420002
    /*********/                                                         19430002
    IF FILE_ROLDOB1.HVP_QTY = 99999 THEN                  /* 15/5/98 */ 19440002
       FILE_ROLDOB1.HVP_QTY = 0        ;                  /* 15/5/98 */ 19450002
    /*********/                                                         19460002
                                                                        19470002
    WRITE FILE(ROLDOB1) FROM (FILE_ROLDOB1);                            19480002
                                                                        19490002
    WRK_CNT_COUNTRY = WRK_CNT_COUNTRY + 1;                              19500002
    END;                                                                19510002
                                                                        19520002
 END R504_WRITE_ROLDOB1;                                                19530002
                                                                        19540002
1/*********************************************************************/19550002
 /*                                                                   */19560002
 /* MODULE NAME      :  R804_WRITE_ROLDOPI                            */19570002
 /*                                                                   */19580002
 /* DESCRIPTION      :                                                */19590002
 /*                                                                   */19600002
 /*********************************************************************/19610002
 R804_WRITE_ROLDOPI: PROC;                                              19620002
                                                                        19630002
 /*  PUT LIST('R804_WRITE_ROLDOPI')  SKIP;                    /*TRACE*/ 19640002
                                             /* UPDATE HASH_TOTAL    */ 19650002
 IF FILE_ROLDOPI.DPIS      > '0' THEN DO;                /************/ 19660002
    CALL RCB018M (SUBSTR(FILE_ROLDOPI.SERNO,1,4),                       19670002
                  WRK_HASH_TOTAL,                                       19680002
                  PTR_INT_AREA);                                        19690002
    /******/                                                            19700002
    IF  FILE_ROLDOPI.CONTR_NUMB < ' ' THEN                              19710002
        FILE_ROLDOPI.CONTR_NUMB = ' ' ;                                 19720002
    IF  FILE_ROLDOPI.MACOVST    < ' ' THEN                              19730002
        FILE_ROLDOPI.MACOVST    = ' ' ;                                 19740002
    IF  FILE_ROLDOPI.MACOVEND   < ' ' THEN                              19750002
        FILE_ROLDOPI.MACOVEND   = ' ' ;                                 19760002
    /******/                                                            19770002
    IF  FILE_ROLDOPI.CUNOOWN    < ' ' THEN                              19780002
        FILE_ROLDOPI.CUNOOWN    = ' ' ;                                 19790002
    IF  FILE_ROLDOPI.CUNAME     < ' ' THEN                              19800002
        FILE_ROLDOPI.CUNAME     = ' ' ;                                 19810002
    IF  FILE_ROLDOPI.CULOCNAM   < ' ' THEN                              19820002
        FILE_ROLDOPI.CULOCNAM   = ' ' ;                                 19830002
    IF  FILE_ROLDOPI.RLCXB      < ' ' THEN                              19840002
        FILE_ROLDOPI.RLCXB      = ' ' ;                                 19850002
    IF  FILE_ROLDOPI.TYPE_CUST  < ' ' THEN                              19860002
        FILE_ROLDOPI.TYPE_CUST  = ' ' ;                                 19870002
    IF  FILE_ROLDOPI.EMBARGO    < ' ' THEN                              19880002
        FILE_ROLDOPI.EMBARGO    = ' ' ;                                 19890002
    /******/                                                            19900002
    IF FILE_ROLDOPI.HVP_QTY = 99999 THEN                  /*  8/6/98 */ 19910002
       FILE_ROLDOPI.HVP_QTY = 0        ;                  /*  8/6/98 */ 19920002
    /******/                                                            19930002
                                                                        19940002
    WRITE FILE(ROLDOB1) FROM (FILE_ROLDOPI);                            19950002
                                                                        19960002
    WRK_CNT_COUNTRY = WRK_CNT_COUNTRY + 1;                              19970002
    END;                                                                19980002
                                                                        19990002
 END R804_WRITE_ROLDOPI;                                                20000002
                                                                        20010002
1/*********************************************************************/20020002
 /*                                                                   */20030002
 /* MODULE NAME      :  R509_FETCH_CURSOR_HW_I                        */20040002
 /*                                                                   */20050002
 /* DESCRIPTION      :                                                */20060002
 /*                                                                   */20070002
 /*********************************************************************/20080002
 R509_FETCH_CURSOR_HW_I: PROC;                                          20090002
                                                                        20100002
 /*  PUT LIST('R509_FETCH_CURSOR_HW_I')  SKIP;                /*TRACE*/ 20110002
                                                                        20120002
 CURSOR_HW_I_V040 = '';                                                 20130002
 CURSOR_HW_I_V190 = '';                                                 20140002
 CURSOR_HW_I_V220 = '';                                                 20150002
                                                                        20160002
 EXEC SQL                                                               20170002
   FETCH CURSOR_HW_I                                                    20180002
     INTO :CURSOR_HW_I_V220.COUNTRY_NUMBER        :WRK_INDNULL          20190002
         ,:CURSOR_HW_I_V220.PRODUCT_TYPE          :WRK_INDNULL          20200002
         ,:CURSOR_HW_I_V220.ORIGIN                :WRK_INDNULL          20210002
         ,:CURSOR_HW_I_V220.SEQUENCE_NUMBER       :WRK_INDNULL          20220002
         ,:CURSOR_HW_I_V220.TYPE_OF_MAINT         :WRK_INDNULL          20230002
         ,:CURSOR_HW_I_V220.TYPE_OF_WARRANTY      :WRK_INDNULL          20240002
         ,:CURSOR_HW_I_V220.SERVICE_LVL_CODE      :WRK_INDNULL          20250002
         ,:CURSOR_HW_I_V220.WARRANTY_EXP_DATE     :WRK_INDNULL          20260002
         ,:CURSOR_HW_I_V220.END_DATE              :WRK_INDNULL          20270002
         ,:CURSOR_HW_I_V220.F_TYPE_OF_WARRANTY    :WRK_INDNULL          20280002
         ,:CURSOR_HW_I_V220.F_SPLT_DATE           :WRK_INDNULL          20290002
         ,:CURSOR_HW_I_V190.CUSTOMER_NUMBER       :WRK_INDNULL          20300002
         ,:CURSOR_HW_I_V190.MARKETING_INSTDAT     :WRK_INDNULL          20310002
         ,:CURSOR_HW_I_V040.OU_CODE               :WRK_INDNULL          20320002
         ,:CURSOR_HW_I_V040.MABO                  :WRK_INDNULL          20330002
       ;                                                                20340002
                                                                        20350002
  SELECT (SQLCODE);                                                     20360002
   WHEN (0)                                                             20370002
     DO;                                                                20380002
       SWITCH_EOC_CURSOR_HW_I = FALSE;                                  20390002
                                                                        20400002
       SK_HW_I.PRODUCT_TYPE       = CURSOR_HW_I_V220.PRODUCT_TYPE;      20410002
       SK_HW_I.ORIGIN             = CURSOR_HW_I_V220.ORIGIN;            20420002
       SK_HW_I.SEQUENCE_NUMBER    = CURSOR_HW_I_V220.SEQUENCE_NUMBER;   20430002
       SK_HW_I.MODEL_NUMBER       = '' ;                                20440002
       SK_HW_I.CUSTOMER_NUMBER    = CURSOR_HW_I_V190.CUSTOMER_NUMBER;   20450002
                                                                        20460002
     END;                                                               20470002
   WHEN (100)                                                           20480002
     DO;                                                                20490002
       SWITCH_EOC_CURSOR_HW_I = TRUE;                                   20500002
     END;                                                               20510002
   OTHERWISE                                                            20520002
     DO;                                                                20530002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),'DB2','#024');                  20540002
     END;                                                               20550002
 END;                                                                   20560002
                                                                        20570002
 END R509_FETCH_CURSOR_HW_I;                                            20580002
                                                                        20590002
1/*********************************************************************/20600002
 /*                                                                   */20610002
 /* MODULE NAME      :  R809_FETCH_CURSOR_PI_I                        */20620002
 /*                                                                   */20630002
 /* DESCRIPTION      :                                                */20640002
 /*                                                                   */20650002
 /*********************************************************************/20660002
 R809_FETCH_CURSOR_PI_I: PROC;                                          20670002
                                                                        20680002
 /*  PUT LIST('R809_FETCH_CURSOR_PI_I')  SKIP;                /*TRACE*/ 20690002
                                                                        20700002
 CURSOR_PI_I_V040 = '';                                                 20710002
 CURSOR_PI_I_V051 = '';                                                 20720002
                                                                        20730002
 EXEC SQL                                                               20740002
   FETCH CURSOR_PI_I                                                    20750002
     INTO :CURSOR_PI_I_V051.COUNTRY_NUMBER        :WRK_INDNULL          20760002
         ,:CURSOR_PI_I_V051.PRODUCT_TYPE          :WRK_INDNULL          20770002
         ,:CURSOR_PI_I_V051.ORIGIN                :WRK_INDNULL          20780002
         ,:CURSOR_PI_I_V051.SEQUENCE_NUMBER       :WRK_INDNULL          20790002
         ,:CURSOR_PI_I_V051.MODEL_NUMBER          :WRK_INDNULL          20800002
         ,:CURSOR_PI_I_V051.BUILT_TO_MODEL_NR     :WRK_INDNULL          20810002
         ,:CURSOR_PI_I_V051.INSTALL_DATE          :WRK_INDNULL          20820002
         ,:CURSOR_PI_I_V051.TYPE_OF_MAINT         :WRK_INDNULL          20830002
         ,:CURSOR_PI_I_V051.TYPE_OF_WARRANTY      :WRK_INDNULL          20840002
         ,:CURSOR_PI_I_V051.SERVICE_DELIV_FLAG    :WRK_INDNULL          20850002
         ,:CURSOR_PI_I_V051.SERVICE_LVL_CODE_1    :WRK_INDNULL          20860002
         ,:CURSOR_PI_I_V051.WARRANTY_SPLT_DATE    :WRK_INDNULL          20870002
         ,:CURSOR_PI_I_V051.SERVICE_LVL_CODE_2    :WRK_INDNULL          20880002
         ,:CURSOR_PI_I_V051.WARRANTY_EXP_DATE     :WRK_INDNULL          20890002
         ,:CURSOR_PI_I_V051.CUSTOMER_NUMBER       :WRK_INDNULL          20900002
         ,:CURSOR_PI_I_V051.DEALER_NUMBER         :WRK_INDNULL          20910002
         ,:CURSOR_PI_I_V051.SOURCE_INDICATOR      :WRK_INDNULL          20920002
         ,:CURSOR_PI_I_V051.OU_CODE               :WRK_INDNULL          20930002
         ,:CURSOR_PI_I_V040.MABO                  :WRK_INDNULL          20940002
       ;                                                                20950002
                                                                        20960002
  SELECT (SQLCODE);                                                     20970002
   WHEN (0)                                                             20980002
     DO;                                                                20990002
       SWITCH_EOC_CURSOR_PI_I = FALSE;                                  21000002
                                                                        21010002
       SK_PI_I.PRODUCT_TYPE       = CURSOR_PI_I_V051.PRODUCT_TYPE;      21020002
       SK_PI_I.ORIGIN             = CURSOR_PI_I_V051.ORIGIN;            21030002
       SK_PI_I.SEQUENCE_NUMBER    = CURSOR_PI_I_V051.SEQUENCE_NUMBER;   21040002
       SK_PI_I.MODEL_NUMBER       = CURSOR_PI_I_V051.MODEL_NUMBER;      21050002
       SK_PI_I.CUSTOMER_NUMBER    = CURSOR_PI_I_V051.CUSTOMER_NUMBER;   21060002
                                                                        21070002
     END;                                                               21080002
   WHEN (100)                                                           21090002
     DO;                                                                21100002
       SWITCH_EOC_CURSOR_PI_I = TRUE;                                   21110002
     END;                                                               21120002
   OTHERWISE                                                            21130002
     DO;                                                                21140002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),'DB2','#025');                  21150002
     END;                                                               21160002
 END;                                                                   21170002
                                                                        21180002
 END R809_FETCH_CURSOR_PI_I;                                            21190002
                                                                        21200002
1/********************************************************************/ 21210002
 /*                                                                  */ 21220002
 /* MODULE NAME      : R700_INIT_COUNTRY (...E CURSORI...)           */ 21230002
 /*                                                                  */ 21240002
 /* DESCRIPTION      : OPEN AND INTITIAL FETCH CURSORS               */ 21250002
 /*                                                                  */ 21260002
 /********************************************************************/ 21270002
 R700_INIT_COUNTRY:    PROC;                                            21280002
                                                                        21290002
 /*  PUT LIST('R700_INIT_COUNTRY')  SKIP;                     /*TRACE*/ 21300002
                                                                        21310002
                                             /* FILL CURRENT COUNTRY */ 21320002
 WRK_PROC_ID     = COUNTRY_AREA.PROC_ID;                                21330002
 WRK_CTRYNO      = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).CTRYNO;       21340002
 WRK_PGR_TYPE    = COUNTRY_AREA.CTRY_ARRAY(WRK_CTRYNO_NO).PGR_TYPE;     21350002
 WRK_CNT_COUNTRY = 0;                                                   21360002
                                                                        21370002
     PUT DATA(WRK_CTRYNO)  SKIP;                              /*TRACE*/ 21380002
                                                                        21390002
 CALL R001_LOCK_TABLES;                         /* TEMEA-T081298 */     21391014
                                                                        21392014
                                             /* RETRIEVE RUN DATE    */ 21400002
 RUN_DATE_AREA.PROC_ID   =  COUNTRY_AREA.PROC_ID;                       21410002
 RUN_DATE_AREA.CTRYNO    =  WRK_CTRYNO;                                 21420002
 RUN_DATE_AREA.PGR_TYPE  =  WRK_PGR_TYPE;                               21430002
                                                                        21440002
 CALL RCB020M (PTR_RUN_DATE_AREA,                                       21450002
               PTR_INT_AREA);                                           21460002
                                                                        21470002
 IF RUN_DATE_AREA.RUN_DATE = ''          /* NO RUN DATE RCB001 FOUND */ 21480002
 THEN                                                                   21490002
   DO;                                                                  21500002
     WRK_RUN_DATE = PARM_INT_AREA.SYSTEM_DATE;                          21510002
   END;                                                                 21520002
 ELSE                                                                   21530002
   DO;                                                                  21540002
     WRK_RUN_DATE = RUN_DATE_AREA.RUN_DATE;                             21550002
   END;                                                                 21560002
                                                                        21570002
     PUT DATA(WRK_RUN_DATE) SKIP;                             /*TRACE*/ 21580002
                                                                        21590002
 PARM_INT_AREA.COUNTRY_NUMBER   = WRK_CTRYNO;                           21600002
 PARM_INT_AREA.MESSAGE_TYPE     = 'IS';                                 21610002
 PARM_INT_AREA.MESSAGE_NUMBER   = '0002';                               21620002
 PARM_INT_AREA.MSG_VAR_CODES    = '';                                   21630002
 PARM_INT_AREA.MSG_VAR_CODE_6   = 'DT';                                 21640002
 PARM_INT_AREA.MSG_VAR_VALUE_6  = WRK_RUN_DATE;                         21650002
 CALL RCB0M1M (PTR_INT_AREA);                                           21660002
                                                                        21670002
 /* GET MA_STATUS FROM RCB064 AT COUNTRY LEVEL THAT WILL BE  */         21680002
 /* APPLIED FOR FLEXIBLE WARRANTY MACHINES OF THAT COUNTRY   */         21690002
 /*                                                                   */21700002
 /*F_WARRANTY_MA_STATUS       = FALSE;                                */21710002
 /*TB_RCBV500                 = '';                                   */21720002
 /*TB_RCBV500_I               = '';                                   */21730002
 /*TB_RCBP64S.NUMBER          = 'RCB064';                             */21740002
 /*TB_RCBP64S.CTRYNO          = WRK_CTRYNO;                           */21750002
 /*TB_RCBP64S.PGR_TYPE        = WRK_PGR_TYPE;                         */21760002
 /*                                                                   */21770002
 /*CALL RCBI50M ('U',                                                 */21780002
 /*              ADDR (TB_RCBV500),                                   */21790002
 /*              ADDR (TB_RCBV500_I),                                 */21800002
 /*              PTR_RETURN_AREA_BB,                                  */21810002
 /*              PTR_INT_AREA);                                       */21820002
 /*SELECT (RETURN_AREA_BB.RETURN_CODE);                               */21830002
 /*  WHEN(0)                                                          */21840002
 /*    DO;                                                            */21850002
 /*     PARM_RCBP64S = TB_RCBP64S, BY NAME;                           */21860002
 /*     IF SUBSTR(TB_RCBV500.PARAMETER_VALUE,2,1) ¬= ' ' |            */21870002
 /*        F_WARRANTY_MA_STATUS_GEO THEN                              */21880002
 /*        F_WARRANTY_MA_STATUS                    = TRUE;            */21890002
 /*    END;                                                           */21900002
 /*  WHEN(4)                                                          */21910002
 /*    DO;                                                            */21920002
 /*     IF F_WARRANTY_MA_STATUS_GEO THEN                              */21930002
 /*        F_WARRANTY_MA_STATUS                    = TRUE;            */21940002
 /*    END;                                                           */21950002
 /*  OTHERWISE                                                        */21960002
 /*    DO;                                                            */21970002
 /*       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),       */21980002
 /*                              'DB2',                               */21990002
 /*                              '#026');                             */22000002
 /*    END;                                                           */22010002
 /*END;                                                               */22020002
                                                                        22030002
 EXEC SQL  OPEN CURSOR_HW_I;             /* INIT CURSOR CURSOR_HW_I  */ 22040002
                                                                        22050002
 SELECT (SQLCODE);                                                      22060002
   WHEN (0);                                                            22070002
   OTHERWISE                                                            22080002
     DO;                                                                22090002
        CALL ROLDOBM_ERROR (ADDR (SQLCA),'DB2','#027');                 22100002
     END;                                                               22110002
 END;                                                                   22120002
                                                                        22130002
                             /* FETCH FIRST OCCURENCE OF CURSOR_HW_I */ 22140002
 CALL R509_FETCH_CURSOR_HW_I;                                           22150002
                                                                        22160002
 EXEC SQL  OPEN CURSOR_PI_I;             /* INIT CURSOR CURSOR_PI_I  */ 22170002
                                                                        22180002
 SELECT (SQLCODE);                                                      22190002
   WHEN (0);                                                            22200002
   OTHERWISE                                                            22210002
     DO;                                                                22220002
        CALL ROLDOBM_ERROR (ADDR (SQLCA),'DB2','#028');                 22230002
     END;                                                               22240002
 END;                                                                   22250002
                             /* FETCH FIRST OCCURENCE OF CURSOR_PI_I */ 22260002
 CALL R809_FETCH_CURSOR_PI_I;                                           22270002
                                                                        22280002
 END R700_INIT_COUNTRY;                                                 22290002
                                                                        22300002
1/*********************************************************************/22310002
 /*                                                                   */22320002
 /* MODULE NAME      :  R799_END_COUNTRY                              */22330002
 /*                                                                   */22340002
 /* DESCRIPTION      :                                                */22350002
 /*                                                                   */22360002
 /*********************************************************************/22370002
 R799_END_COUNTRY: PROC;                                                22380002
                                                                        22390002
 /*  PUT LIST('R799_END_COUNTRY')  SKIP;                      /*TRACE*/ 22400002
                                         /* CLOSE CURSOR CURSOR_HW_I */ 22410002
 EXEC SQL  CLOSE CURSOR_HW_I;                                           22420002
                                                                        22430002
 SELECT (SQLCODE);                                                      22440002
   WHEN (0);                                                            22450002
   OTHERWISE                                                            22460002
     DO;                                                                22470002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),'DB2','#029');                  22480002
     END;                                                               22490002
 END;                                                                   22500002
                                         /* CLOSE CURSOR CURSOR_PI_I */ 22510002
 EXEC SQL  CLOSE CURSOR_PI_I;                                           22520002
                                                                        22530002
 SELECT (SQLCODE);                                                      22540002
   WHEN (0);                                                            22550002
   OTHERWISE                                                            22560002
     DO;                                                                22570002
       CALL ROLDOBM_ERROR (ADDR (SQLCA),'DB2','#030');                  22580002
     END;                                                               22590002
 END;                                                                   22600002
                                                                        22610002
 EXEC SQL COMMIT ;                                                      22620002
                                                                        22630002
                             /* WRITE COUNT MESSAGE FOR COUNTRY      */ 22640002
 PARM_INT_AREA.MESSAGE_TYPE         = 'IS';                             22650002
 PARM_INT_AREA.MESSAGE_NUMBER       = '0004';                           22660002
 PARM_INT_AREA.MSG_VAR_CODES        = ' ';                              22670002
 PARM_INT_AREA.MSG_VAR_CODE_6       = 'FL';                             22680002
 PARM_INT_AREA.MSG_VAR_VALUE_6      = WRK_FILE_NAME;                    22690002
 PARM_INT_AREA.MSG_VAR_CODE_7       = 'C6';                             22700002
 WRK_PIC_10 = WRK_CNT_COUNTRY;                                          22710002
 PARM_INT_AREA.MSG_VAR_VALUE_7      = WRK_PIC_10;                       22720002
 CALL RCB0M1M (PTR_INT_AREA);                                           22730002
                                                                        22740002
                                      /* ADD CNT_COUNTRY TO TOTAL    */ 22750002
 WRK_CNT_ROLDOB1 = WRK_CNT_ROLDOB1 + WRK_CNT_COUNTRY;                   22760002
                                                                        22770002
                                      /* INCREASE FOR NEXT CTRYNO    */ 22780002
 WRK_CTRYNO_NO = WRK_CTRYNO_NO + 1;                                     22790002
                                                                        22800002
 END R799_END_COUNTRY;                                                  22810002
                                                                        22820002
1/********************************************************************/ 22830002
 /*                                                                  */ 22840002
 /* MODULE NAME      : R900_INIT_PROGRAM                             */ 22850002
 /*                                                                  */ 22860002
 /* DESCRIPTION      : INIT PROGRAM                                  */ 22870002
 /*                                                                  */ 22880002
 /********************************************************************/ 22890002
 R900_INIT_PROGRAM:   PROC                  ;                           22900002
                                                                        22910002
 /*  PUT LIST('R900_INIT_PROGRAM')  SKIP;                     /*TRACE*/ 22920002
                                             /* INITIALISE POINTERS  */ 22930002
 PTR_INT_AREA       = ADDR (PARM_INT_AREA)  ;                           22940002
 PTR_RETURN_AREA_BB = ADDR (RETURN_AREA_BB) ;                           22950002
 PTR_COUNTRY_AREA   = ADDR (COUNTRY_AREA)   ;                           22960002
 PTR_RUN_DATE_AREA  = ADDR (RUN_DATE_AREA)  ;                           22970002
                                             /* INITIALISE VARIABLES */ 22980002
 PARM_INT_AREA.MSG_AREA       = ''          ;                           22990002
 PARM_INT_AREA.ERR_AREA       = ' '         ;                           23000002
 PARM_INT_AREA.MSG_REQUEST    = 'O'         ;                           23010002
 PARM_INT_AREA.MSG_TARGET     = 'F'         ;                           23020002
 PARM_INT_AREA.ID_SOURCE_APPL = 'RCB'       ;                           23030002
 PARM_INT_AREA.ID_SOURCE_PROG = WRK_PRG_NAME;                           23040002
 PARM_INT_AREA.ID_MOD_PATH(1) = WRK_MOD_NAME;                           23050002
 PARM_INT_AREA.ID_MOD_LEVEL   = 1           ;                           23060002
 PARM_INT_AREA.SYSTEM_TYPE    = WRK_SYSTEM_TYPE;                        23070002
 PARM_INT_AREA.TXN_CODE       = ''          ;                           23080002
 PARM_INT_AREA.VERSION        = ''          ;                           23090002
 PARM_INT_AREA.PTR_PCB_IO     = NULL        ;                           23100002
 PARM_INT_AREA.PTR_PCB_ALT    = NULL        ;                           23110002
                                              /* OPEN MESSAGE FILE   */ 23120002
 CALL RCB0M1M(PTR_INT_AREA)                 ;                           23130002
                                              /* RETR. SYSTEM DATE   */ 23140002
 CALL RCB0T1M(PTR_INT_AREA)                 ;                           23150002
                                              /* LOCK TABLES         */ 23160002
                                              /* TEMEA-T081298          23161014
 CALL R001_LOCK_TABLES                      ;                        */ 23170014
                                                                        23180002
                                              /* RETRIEVE COUNTRIES  */ 23190002
 CALL RCB019M (PTR_COUNTRY_AREA             ,                           23200002
               PTR_INT_AREA)                ;                           23210002
                                                                        23220002
                                              /* NO COUNTRIES FOUND  */ 23230002
 IF COUNTRY_AREA.COUNT_CTRY = 0                                         23240002
 THEN                                                                   23250002
   DO;                                                                  23260002
     PARM_INT_AREA.COUNTRY_NUMBER    = ''   ;                           23270002
     PARM_INT_AREA.MSG_VAR_CODES     = ''   ;                           23280002
     PARM_INT_AREA.MESSAGE_TYPE      = 'IS' ;                           23290002
     PARM_INT_AREA.MESSAGE_NUMBER    = '0005';                          23300002
     CALL RCB0M1M (PTR_INT_AREA)            ;                           23310002
     CALL ROLDOBM_ERROR (NULL, 'OTHER', '#031');                        23320002
   END;                                                                 23330002
                                                                        23340002
                           /* DETERMINE TIMESTAMP FOR HEADER + HASH  */ 23350002
 WRK_TIME_STAMP = PARM_INT_AREA.SYSTEM_DATE || '.' || TIME();           23360002
                                                                        23370002
                                      /* RETRIEVE PARAMETER RCB067   */ 23380002
                                      /* TRANS TABLE TPMNT --> MA_ST */ 23390002
 TB_RCBV500          = '';                                              23400002
 TB_RCBV500_I        = '';                                              23410002
 TB_RCBP67S.NUMBER   = 'RCB067';                                        23420002
                                                                        23430002
 CALL RCBI50M ('U',                                                     23440002
               ADDR (TB_RCBV500),                                       23450002
               ADDR (TB_RCBV500_I),                                     23460002
               PTR_RETURN_AREA_BB,                                      23470002
               PTR_INT_AREA);                                           23480002
                                                                        23490002
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    23500002
   WHEN (0)                                                             23510002
     DO;                                                                23520002
        PARM_RCBP67S = TB_RCBP67S;                                      23530002
     END;                                                               23540002
   WHEN (4)                                                             23550002
     DO;                                                                23560002
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                23570002
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              23580002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 23590002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                23600002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      23610002
                                       TB_RCBV500.PARAMETER_NUMBER;     23620002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                23630002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      23640002
                                       TB_RCBV500.PARAMETER_KEY;        23650002
        CALL RCB0M1M (PTR_INT_AREA);                                    23660002
        CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           23670002
                    'DB2','#032');                                      23680002
     END;                                                               23690002
   OTHERWISE                                                            23700002
     DO;                                                                23710002
        CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           23720002
                    'DB2','#033');                                      23730002
     END;                                                               23740002
 END;                                                                   23750002
                                                                        23760002
                                      /* RETRIEVE PARAMETER RCB068   */ 23770002
                                      /* TRANS TBLE CUNO -> SERV_DIV */ 23780002
 TB_RCBV500          = '';                                              23790002
 TB_RCBV500_I        = '';                                              23800002
 TB_RCBP68S.NUMBER   = 'RCB068';                                        23810002
                                                                        23820002
 CALL RCBI50M ('U',                                                     23830002
               ADDR (TB_RCBV500),                                       23840002
               ADDR (TB_RCBV500_I),                                     23850002
               PTR_RETURN_AREA_BB,                                      23860002
               PTR_INT_AREA);                                           23870002
                                                                        23880002
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    23890002
   WHEN (0)                                                             23900002
     DO;                                                                23910002
        PARM_RCBP68S = TB_RCBP68S;                                      23920002
     END;                                                               23930002
   WHEN (4)                                                             23940002
     DO;                                                                23950002
        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';                23960002
        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';              23970002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';                 23980002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';                23990002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                      24000002
                                       TB_RCBV500.PARAMETER_NUMBER;     24010002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';                24020002
        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                      24030002
                                       TB_RCBV500.PARAMETER_KEY;        24040002
        CALL RCB0M1M (PTR_INT_AREA);                                    24050002
        CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           24060002
                    'DB2','#034');                                      24070002
     END;                                                               24080002
   OTHERWISE                                                            24090002
     DO;                                                                24100002
        CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),           24110002
                    'DB2','#035');                                      24120002
     END;                                                               24130002
 END;                                                                   24140002
                                      /* RETRIEVE PARAMETER RCB063   */ 24150002
                                      /* FLEXIBLE WARRANTY GEO LEVEL */ 24160002
 /* F_WARRANTY_MA_STATUS_GEO = FALSE ;                               */ 24170002
 /* TB_RCBV500   = '';                                               */ 24180002
 /* TB_RCBV500_I = '';                                               */ 24190002
 /* TB_RCBP63S.NUMBER   = 'RCB063';                                  */ 24200002
 /*                                                                  */ 24210002
 /* CALL RCBI50M ('U',                                               */ 24220002
 /*               ADDR(TB_RCBV500),                                  */ 24230002
 /*               ADDR(TB_RCBV500_I),                                */ 24240002
 /*               PTR_RETURN_AREA_BB,                                */ 24250002
 /*               PTR_INT_AREA);                                     */ 24260002
 /*                                                                  */ 24270002
 /* SELECT(RETURN_AREA_BB.RETURN_CODE);                              */ 24280002
 /*  WHEN (0)                                                        */ 24290002
 /*    DO;                                                           */ 24300002
 /*      PARM_RCBP63S = TB_RCBP63S;                                  */ 24310002
 /*      F_WARRANTY_MA_STATUS_GEO                   = TRUE;          */ 24320002
 /*      IF TB_RCBV500.PARAMETER_VALUE              = ''             */ 24330002
 /*      THEN                                                        */ 24340002
 /*        DO;                                                       */ 24350002
 /*          PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES   = '';            */ 24360002
 /*          PARM_INT_AREA.MESSAGE_TYPE             = 'BU';          */ 24370002
 /*          PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER  = '0217';        */ 24380002
 /*          PARM_INT_AREA.MSG_VAR_CODE_6           = 'PN';          */ 24390002
 /*          PARM_INT_AREA.MSG_VAR_VALUE_6          =                */ 24400002
 /*                                      TB_RCBV500.PARAMETER_NUMBER;*/ 24410002
 /*          PARM_INT_AREA.MSG_VAR_CODE_8           = 'PV';          */ 24420002
 /*          PARM_INT_AREA.MSG_VAR_VALUE_8          =                */ 24430002
 /*                                      'RCB063 VALUE NOT FOUND  '; */ 24440002
 /*          CALL RCB0M1M (PTR_INT_AREA);                            */ 24450002
 /*          CALL ROLDOBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),     */ 24460002
 /*                           'DB2',                                 */ 24470002
 /*                           '#036');                               */ 24480002
 /*        END;                                                      */ 24490002
 /*    END;                                                          */ 24500002
 /*  WHEN (4)                            /* NO VALUE FOR RCB063 PARM */ 24510002
 /*     DO;                                                          */ 24520002
 /*        PARM_INT_AREA.MESSAGE_TYPE               = 'IS';          */ 24530002
 /*        PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER    = 'I050';        */ 24540002
 /*        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES     = ' ';           */ 24550002
 /*        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6    = 'PN';          */ 24560002
 /*        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6   =                */ 24570002
 /*                                      TB_RCBV500.PARAMETER_NUMBER;*/ 24580002
 /*        PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7    = 'PK';          */ 24590002
 /*        PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7   =                */ 24600002
 /*                                       TB_RCBV500.PARAMETER_KEY;  */ 24610002
 /*        CALL RCB0M1M (PTR_INT_AREA);                              */ 24620002
 /*        CALL ROLDOBM_ERROR(ADDR(RETURN_AREA_BB.RETURN_SQL),       */ 24630002
 /*                         'DB2',                                   */ 24640002
 /*                        '#037');                                  */ 24650002
 /*     END;                                                         */ 24660002
 /*  OTHERWISE                                                       */ 24670002
 /*     DO;                                                          */ 24680002
 /*       CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),      */ 24690002
 /*                                 'DB2',                           */ 24700002
 /*                                 '#038');                         */ 24710002
 /*     END;                                                         */ 24720002
 /* END;                                                             */ 24730002
                                        /* OPEN ROLDOB1              */ 24740002
 OPEN FILE(ROLDOB1);                                                    24750002
                                                                        24760002
                                        /* INIT AND FILL HEADER REC  */ 24770002
 FILE_ROLDOB1 = '';                                                     24780002
 FILE_ROLDOB1_H.KEY                     = '';                           24790002
 FILE_ROLDOB1_H.PROCESS_NAME            = 'OEI HW';                     24800002
 FILE_ROLDOB1_H.FILE_TYPE               = 'DELTA EXTR';                 24810002
 FILE_ROLDOB1_H.TIME_STAMP              = WRK_TIME_STAMP;               24820002
                                                                        24830002
                                        /* WRITE HEADER REC          */ 24840002
 WRITE FILE(ROLDOB1) FROM(FILE_ROLDOB1);                                24850002
                                                                        24860002
 END R900_INIT_PROGRAM;                                                 24870002
                                                                        24880002
1/********************************************************************/ 24890002
 /*                                                                  */ 24900002
 /* MODULE NAME      : R999_END_PROGRAM                              */ 24910002
 /*                                                                  */ 24920002
 /* DESCRIPTION      : WRITE COUNT MESSAGES                          */ 24930002
 /*                                                                  */ 24940002
 /********************************************************************/ 24950002
 R999_END_PROGRAM:  PROC;                                               24960002
                                                                        24970002
 /*  PUT LIST('R999_END_PROGRAM')  SKIP;                      /*TRACE*/ 24980002
                                        /* INIT AND FILL TRAILER REC */ 24990002
 FILE_ROLDOB1 = '';                                                     25000002
 FILE_ROLDOB1_H.KEY                     = (20)'9';                      25010002
 FILE_ROLDOB1_H.PROCESS_NAME            = 'OEI HW';                     25020002
 FILE_ROLDOB1_H.FILE_TYPE               = 'DELTA EXTR';                 25030002
 FILE_ROLDOB1_H.TIME_STAMP              = '';                           25040002
                                                                        25050002
                                            /* WRITE TRAILER REC     */ 25060002
 WRITE FILE(ROLDOB1) FROM(FILE_ROLDOB1);                                25070002
                                            /* CLOSE FILE ROLDOB1    */ 25080002
 CLOSE FILE(ROLDOB1);                                                   25090002
                              /* SAVE HASH TOTAL IN PARAMETER RCB024 */ 25100002
 TB_RCBV500 = '';                                                       25110002
 TB_RCBV500_I = '';                                                     25120002
 TB_RCBP24S.NUMBER     = 'RCB024';                                      25130002
 TB_RCBP24S.PROC_ID    = WRK_PROC_ID;                                   25140002
 TB_RCBP24S.CTRYNO     = ' ';                                           25150002
 TB_RCBP24S.FILE_NAME  = SUBSTR(WRK_FILE_NAME,1,7);                     25160002
 TB_RCBP24S.TIME_STAMP = WRK_TIME_STAMP;                                25170002
 TB_RCBP24S.HASH_TOTAL = WRK_HASH_TOTAL;                                25180002
 TB_RCBP24S.LENGTH_PARM = STG(TB_RCBP24S.TIME_STAMP) +                  25190002
                          STG(TB_RCBP24S.HASH_TOTAL);                   25200002
                                                                        25210002
 CALL RCBG50M (ADDR(TB_RCBV500),                                        25220002
               ADDR(TB_RCBV500_I),                                      25230002
               PTR_RETURN_AREA_BB,                                      25240002
               PTR_INT_AREA);                                           25250002
 SELECT(RETURN_AREA_BB.RETURN_CODE);                                    25260002
 WHEN (0);                                                              25270002
 WHEN (4)                          /* WHEN NOT FOUND THEN INSERT  */    25280002
   DO;                                                                  25290002
     CALL RCBF50M (ADDR(TB_RCBV500),                                    25300002
                   ADDR(TB_RCBV500_I),                                  25310002
                   PTR_RETURN_AREA_BB,                                  25320002
                   PTR_INT_AREA);                                       25330002
     SELECT(RETURN_AREA_BB.RETURN_CODE);                                25340002
     WHEN (0);                                                          25350002
     OTHERWISE                                                          25360002
       DO;                                                              25370002
         CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),          25380002
                             'DB2','#039');                             25390002
       END;                                                             25400002
     END;                                                               25410002
   END;                                                                 25420002
 OTHERWISE                                                              25430002
   DO;                                                                  25440002
     CALL ROLDOBM_ERROR (ADDR (RETURN_AREA_BB.RETURN_SQL),              25450002
                         'DB2','#040');                                 25460002
   END;                                                                 25470002
 END;                                                                   25480002
                                    /* WRITE COUNT MESSAGE           */ 25490002
                                   /* ROLDOB1 WRITTEN                */ 25500002
 PARM_INT_AREA.COUNTRY_NUMBER               = '';                       25510002
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     25520002
 PARM_INT_AREA.MESSAGE_TYPE                 = 'IS';                     25530002
 PARM_INT_AREA.MSG_AREA.MESSAGE_NUMBER      = '0004';                   25540002
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODES       = '';                       25550002
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_6      = 'FL';                     25560002
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_6     = WRK_FILE_NAME;            25570002
 PARM_INT_AREA.MSG_AREA.MSG_VAR_CODE_7      = 'C6';                     25580002
 WRK_PIC_10 = WRK_CNT_ROLDOB1;                                          25590002
 PARM_INT_AREA.MSG_AREA.MSG_VAR_VALUE_7     = WRK_PIC_10;               25600002
 CALL RCB0M1M (PTR_INT_AREA);                                           25610002
                                                                        25620002
                                    /* WRITE SUCCESFULLY ENDED MSG   */ 25630002
 PARM_INT_AREA.MESSAGE_TYPE    = 'IS';                                  25640002
 PARM_INT_AREA.MESSAGE_NUMBER  = '9999';                                25650002
 PARM_INT_AREA.MSG_VAR_CODES   = '';                                    25660002
 CALL RCB0M1M (PTR_INT_AREA);                                           25670002
                                                                        25680002
                                    /* CLOSE MESSAGE FILE            */ 25690002
 PARM_INT_AREA.MSG_REQUEST = 'C';                                       25700002
 CALL RCB0M1M (PTR_INT_AREA);                                           25710002
                                                                        25720002
 CTR_TOT = CTR_BAU + CTR_PI_ONLY - CTR_PI_SCART + CTR_BOTH ;            25730002
                                                                        25740002
 PUT LIST('A CTR_BAU     =',CTR_BAU)                              SKIP; 25750002
 PUT LIST('B CTR_PI_ONLY =',CTR_PI_ONLY, '(SCRITTI + SCARTATI)')  SKIP; 25760002
 PUT LIST('C CTR_PI_SCART=',CTR_PI_SCART,'(SCARTATI          )')  SKIP; 25770002
 PUT LIST('D CTR_BOTH    =',CTR_BOTH)                             SKIP; 25780002
 PUT LIST('T CTR_TOT     =',CTR_TOT     ,'(T = A + B - C + D )')  SKIP; 25790002
                                                                        25800002
 END R999_END_PROGRAM;                                                  25810002
                                                                        25820002
1/********************************************************************/ 25830002
 /*                                                                  */ 25840002
 /* MODULE NAME      : ROLDOBM_ERROR                                 */ 25850002
 /*                                                                  */ 25860002
 /* DESCRIPTION      : CALLS THE COMMON ERROR ROUTINE AFTER FILLING  */ 25870002
 /*                    THE INPUT VARIABLES                           */ 25880002
 /*                                                                  */ 25890002
 /********************************************************************/ 25900002
 ROLDOBM_ERROR: PROC (PTR_ERROR,                                        25910002
                      ERR_TYPE,                                         25920002
                      CALL_ID  );                                       25930002
   DCL PTR_ERROR     PTR;                                               25940002
   DCL ERR_TYPE      CHAR(8);                                           25950002
   DCL CALL_ID       CHAR(4);                                           25960002
   PARM_INT_AREA.PTR_ERROR          = PTR_ERROR;                        25970002
   PARM_INT_AREA.ERR_TYPE           = ERR_TYPE;                         25980002
   PARM_INT_AREA.CALL_ID            = CALL_ID;                          25990002
   CALL RCB0E1M (ADDR(PARM_INT_AREA));                                  26000002
 END ROLDOBM_ERROR;                                                     26010002
                                                                        26020002
1/*******************************************************************/  26030002
 /*DO NOT CHANGE THIS PART, IT IS MEANT FOR ABR                     */  26040002
 /*******************************************************************/  26050002
 %INCLUDE DAIFPLH ;                     /* COMPILE DATE/TIME STAMP */   26060002
 $DAIMOD (ROLDOBM);                      /* MODULE TO BE COMPILED   */  26070002
 /*******************************************************************/  26080002
 /* END OF ABR BLOCK                                                */  26090002
 /*******************************************************************/  26100002
 END ROLDOBM;                                                           26110002