 SCCA02M:PROC (EMPF_DATUM,CH_ANZTAGE) OPTIONS(REENTRANT)                00019212
         RETURNS (CHAR (8)) REORDER;                                    00020000
 /********************************************************************/ 00030000
 /*  09/11/98    Y2K  KEINE AENDERUNG NOTWENDIG         O.GOLOVACH   */ 00040000
 /********************************************************************/ 00050000
-/*********************************************************************/00060000
 /*                                                                   */00070000
 /* MODUL-NAME : SCCA02M                PROGRAMM-NAME : SCCA02M       */00080000
 /* MODUL-BEZEICHNUNG : DATUMS-ROUTINE, ADDIEREN + SUBTRAHIEREN       */00090000
 /* STAND : 10.11.88                                                  */00100000
 /*                                                                   */00110000
 /*********************************************************************/00120000
 /*                                                                   */00130000
 /* FUNKTION :                                                        */00140000
 /*                      ZU EINEM BELIEBIGEM DATUM WIRD EINE BEL.     */00150000
 /*                      ANZAHL VON TAGEN HINZUGEZAEHLT BZW. VON      */00160000
 /*                      DIESEM DATUM ABGEZOGEN.                      */00170000
 /*                                                                   */00180000
 /*******                                                       *******/00190000
 /*                                                                   */00200000
 /* INPUT-DATEN                                                       */00210000
 /*                                                                   */00220000
 /*     PARAMETER : EMPF_DATUM:                                       */00230000
 /*                      CHAR (8) - GROESSE, WELCHE DAS EINGABE-DATUM */00240000
 /*                      IN DER FORM JHJJMMTT ENTHAELT,               */00250000
 /*                                                                   */00260000
 /*                 CH_ANZTAGE:                                       */00270000
 /*                      CHAR (6) - GROESSE, WELCHE DIE ANZAHL TAGE   */00280000
 /*                      ENTHAELT.                                    */00290000
 /*                      DIESE MUSS RECHTSBUENDIG GESPEICHERT SEIN,   */00300000
 /*                      BLANKS ZWISCHEN VORZEICHEN UND ZIFFERN SIND  */00310000
 /*                      NICHT ERLAUBT, FEHLENDES VORZEICHEN WIRD     */00320000
 /*                      ALS '+' INTERPRETIERT.                       */00330000
 /*                                                                   */00340000
 /*******                                                       *******/00350000
 /*                                                                   */00360000
 /* OUTPUT-DATEN                                                      */00370000
 /*                                                                   */00380000
 /*     PARAMETER : RET_DATUM:                                        */00390000
 /*                      CHAR (8) - GROESSE, WELCHE DAS ERRECHNETE    */00400000
 /*                      DATUM IN DER FORM JHJJMMTT ENTHAELT.         */00410000
 /*                      WAREN DIE EINGABEDATEN FEHLERHAFT            */00420000
 /*                      SO WIRD IN DEN ERSTEN 3 STELLEN              */00430000
 /*                      DES FELDES EIN FEHLERCODE EINGE-             */00440000
 /*                      STELLT UND DER REST AUSGEBLANCT.             */00450000
 /*                      FEHLERCODES UND IHRE BEDEUTUNG SIEHE NACH-   */00460000
 /*                      FOLGENDE FEHLERCODE-TABELLE.                 */00470000
 /*                                                                   */00480000
 /*******                                                       *******/00490000
1/*******                                                       *******/00500000
 /*                                                                   */00510000
 /* BEISPIEL ZUM AUFRUF:                                              */00520000
 /*                      DCL ( DATUM, ERG_DATUM ) CHAR (8);           */00530000
 /*                      DCL TAGE      CHAR (6);                      */00540000
 /*                      DCL SCCA02M ENTRY EXT RETURNS (CHAR (8));    */00550000
 /*                      DATUM = '19800116';                          */00560000
 /*                      TAGE  = '   -27';                            */00570000
 /*                      ERG_DATUM = SCCA02M (DATUM,TAGE);            */00580000
 /*                                                                   */00590000
 /*******                                                       *******/00600000
 /*                                                                   */00610000
 /* FEHLERCODE-TABELLE :                                              */00620000
 /*                                                                   */00630000
 /*    FEHLER-CODE | ERLAEUTERUNG                                     */00640000
 /*    ------------|-----------------------------------------------   */00650000
 /*    F01         | UNGUELTIGE WERTE IM INPUT-DATUMS-FELD            */00660000
 /*    F02         | FALSCHE MONATS-ANGABE IM INPUT-DATUMS-FELD       */00670000
 /*    F03         | FALSCHE TAGES-ANGABE IM INPUT-DATUMS-FELD        */00680000
 /*    F04         | UNGUELTIGER WERT IM DIFFERENZ-FELD               */00690000
 /*                                                                   */00700000
 /*********************************************************************/00710000
1        PRET          =  ADDR (RET_DATUM);                             00720000
         PDAT          =  ADDR (EMPF_DATUM);                            00730000
         PANZ          =  ADDR (CH_ANZTAGE);                            00740000
         RET_DATUM     =  ' ';                                          00750000
         KENNZ         =  '0'B;                                         00760000
-/*********************************************************************/00770000
 /*                  F E H L E R P R U E F U N G E N                  */00780000
 /*********************************************************************/00790000
-        IF VERIFY (EMPF_DATUM,NUMERISCH) ¬= 0                          00800000
         THEN DO;                                                       00810000
            SUBSTR(RET_DATUM,1,3) = 'F01';                              00820000
            RETURN (RET_DATUM);                                         00830000
         END;                                                           00840000
0        ELSE DO;                                                       00850000
0           BJH = PJH;                                                  00860000
0           BJJ = PJJ;                                                  00870000
            BMM = PMM;                                                  00880000
            BTT = PTT;                                                  00890000
0           IF BMM < 1 | BMM > 12                                       00900000
            THEN DO;                                                    00910000
               SUBSTR(RET_DATUM,1,3) = 'F02';                           00920000
               RETURN (RET_DATUM);                                      00930000
            END;                                                        00940000
0           ELSE DO;                                                    00950000
0              IF (BJJ   =  0  &  MOD (BJH,4)  =  0)    |               00960000
                  (BJJ  ¬=  0  &  MOD (BJJ,4)  =  0)                    00970000
                  THEN LIMIT (2) = 29;                                  00980000
                  ELSE LIMIT (2) = 28;                                  00990000
0              IF BTT < 1 | BTT > LIMIT (BMM)                           01000000
               THEN DO;                                                 01010000
                  SUBSTR(RET_DATUM,1,3) = 'F03';                        01020000
                  RETURN (RET_DATUM);                                   01030000
               END;                                                     01040000
0              ELSE DO;                                                 01050000
0                 I = VERIFY (CH_ANZTAGE,' ');                          01060000
0                 IF I = 0                                              01070000
                  THEN DO;                                              01080000
                     SUBSTR(RET_DATUM,1,3) = 'F04';                     01090000
                     RETURN (RET_DATUM);                                01100000
                  END;                                                  01110000
1                 ELSE DO;                                              01120000
0                    IF CH_FELD (I) = '-'                               01130000
                     THEN DO;                                           01140000
0                       KENNZ = '1'B;                                   01150000
                        I = I + 1;                                      01160000
0                       IF I > 6                                        01170000
                        THEN DO;                                        01180000
                           SUBSTR(RET_DATUM,1,3) = 'F04';               01190000
                           RETURN (RET_DATUM);                          01200000
                        END;                                            01210000
                     END;                                               01220000
-                    ELSE DO;                                           01230000
0                       IF CH_FELD (I) = '+'                            01240000
                        THEN DO;                                        01250000
                           I = I + 1;                                   01260000
0                          IF I > 6                                     01270000
                           THEN DO;                                     01280000
                              SUBSTR(RET_DATUM,1,3) = 'F04';            01290000
                              RETURN (RET_DATUM);                       01300000
                           END;                                         01310000
                        END;                                            01320000
                     END;                                               01330000
-                    IF VERIFY ( SUBSTR (CH_ANZTAGE,I,7-I), NUMERISCH)  01340000
                               ¬= 0                                     01350000
                     THEN DO;                                           01360000
                        SUBSTR(RET_DATUM,1,3) = 'F04';                  01370000
                        RETURN (RET_DATUM);                             01380000
                     END;                                               01390000
1/*********************************************************************/01400000
 /*                 V E R A R B E I T U N G S T E I L                 */01410000
 /*********************************************************************/01420000
0                    ELSE DO;                                           01430000
                        B_ANZTAGE = SUBSTR (CH_ANZTAGE,I,7-I);          01440000
0                       IF B_ANZTAGE = 0                                01450000
                        THEN RETURN (EMPF_DATUM);                       01460000
0                       ELSE DO;                                        01470000
-                          IF KENNZ = '0'B                              01480000
  /* VERARBEITUNG '+' */   THEN DO;                                     01490000
0                             B_ANZTAGE = B_ANZTAGE + BTT;              01500000
-                             DO WHILE (B_ANZTAGE > 0);                 01510000
0                                IF B_ANZTAGE > LIMIT (BMM)             01520000
                                 THEN DO;                               01530000
0                                   IF BMM = 12                         01540000
                                    THEN DO;                            01550000
                                          BJJ = BJJ + 1;                01560000
                                          IF   BJJ   =  100             01570000
                                             THEN  BJH  =  BJH  +  1;   01580000
0                              IF (BJJ   = 100  &  MOD (BJH,4)  =  0) | 01590000
                                  (BJJ  ¬= 100  &  MOD (BJJ,4)  =  0)   01600000
                                    THEN LIMIT (2) = 29;                01610000
                                    ELSE LIMIT (2) = 28;                01620000
0                                   B_ANZTAGE = B_ANZTAGE               01630000
0                                               - LIMIT (BMM);          01640000
                                          BMM = 1;                      01650000
                                    END;                                01660000
0                                   ELSE DO;                            01670000
                                       B_ANZTAGE = B_ANZTAGE            01680000
                                                     - LIMIT (BMM);     01690000
                                       BMM = BMM + 1;                   01700000
                                    END;                                01710000
                                 END;                                   01720000
1                                ELSE DO;                               01730000
                                    RJH = BJH;                          01740000
                                    RJJ = BJJ;                          01750000
                                    RMM = BMM;                          01760000
                                    RTT = B_ANZTAGE;                    01770000
                                    RETURN ( RET_DATUM);                01780000
                                 END;                                   01790000
                              END;                                      01800000
                           END;                                         01810000
- /* VERARBEITUNG '-' */   ELSE DO;                                     01820000
-                             DO WHILE (B_ANZTAGE > 0);                 01830000
0                                IF BTT > B_ANZTAGE                     01840000
                                 THEN DO;                               01850000
                                    BTT = BTT - B_ANZTAGE;              01860000
                                    RJH = BJH;                          01870000
                                    RJJ = BJJ;                          01880000
                                    RMM = BMM;                          01890000
                                    RTT = BTT;                          01900000
                                    IF   BJJ   =  -1                    01910000
                                       THEN DO;                         01920000
                                         RJJ   =  99;                   01930000
                                         RJH   =  BJH  -  1;            01940000
                                       END;                             01950000
                                    RETURN (RET_DATUM);                 01960000
                                 END;                                   01970000
0                                ELSE DO;                               01980000
0                                   IF BMM = 1                          01990000
                                    THEN DO;                            02000000
                                          BJJ = BJJ - 1;                02010000
0                              IF (BJJ   =  0  &  MOD (BJH,4)  =  0) |  02020000
                                  (BJJ  ¬=  0  &  MOD (BJJ,4)  =  0)    02030000
                                          THEN LIMIT (2) = 29;          02040000
                                          ELSE LIMIT (2) = 28;          02050000
0                                         BMM = 12;                     02060000
                                          IF   BJJ   =  -1              02070000
                                             THEN DO;                   02080000
                                               BJJ   =  99;             02090000
                                               BJH   =  BJH  -  1;      02100000
                                             END;                       02110000
                                    END;                                02120000
0                                   ELSE BMM = BMM - 1;                 02130000
1                                   IF B_ANZTAGE > LIMIT (BMM)          02140000
                                    THEN B_ANZTAGE = B_ANZTAGE          02150000
                                                       - LIMIT (BMM);   02160000
0                                   ELSE DO;                            02170000
                                       BTT = BTT + LIMIT (BMM)          02180000
                                                 - B_ANZTAGE;           02190000
                                       RJH = BJH;                       02200000
                                       RJJ = BJJ;                       02210000
                                       RMM = BMM;                       02220000
                                       RTT = BTT;                       02230000
                                       IF   BJJ   =  -1                 02240000
                                          THEN DO;                      02250000
                                            RJJ   =  99;                02260000
                                            RJH   =  BJH  -  1;         02270000
                                          END;                          02280000
                                       RETURN (RET_DATUM);              02290000
                                    END;                                02300000
0                                END;                                   02310000
                              END;                                      02320000
                           END;                                         02330000
                        END;                                            02340000
                     END;                                               02350000
                  END;                                                  02360000
               END;                                                     02370000
            END;                                                        02380000
         END;                                                           02390000
1/*********************************************************************/02400000
 /*                    V E R E I N B A R U N G E N                    */02410000
 /*********************************************************************/02420000
-  DCL EMPF_DATUM CHAR (8);               /* EMPFANGSFELDER FUER     */ 02430000
   DCL CH_ANZTAGE CHAR (6);               /* DATUM UND ANZAHL TAGE   */ 02440000
0  DCL RET_DATUM CHAR (8) INIT ('');      /* DATUM-RUECKGABEFELD     */ 02450000
0  DCL CH_FELD (6) CHAR (1) BASED (PANZ);                               02460000
   DCL B_ANZTAGE BIN FIXED (31,0);        /* RECHENFELD F. ANZ. TAGE */ 02470000
0  DCL NUMERISCH CHAR (10) INIT ('0123456789') STATIC;                  02480000
0  DCL LIMIT (12) BIN FIXED (15,0) INIT   /* MONATSGRENZEN           */ 02490000
             (31,28,31,30,31,30,31,31,30,31,30,31);                     02500000
0  DCL (PANZ,PDAT,PRET) POINTER;                                        02510000
0  DCL I BIN FIXED (15,0);                                              02520000
0  DCL KENNZ BIT (1);                                                   02530000
-  DCL 1 P_DATSTRUCK BASED (PDAT),        /* UMWANDLG. CHAR -> PIC   */ 02540000
         2 PJH PIC'99',                   /* BEI DATUM-EMPFANGSFELD  */ 02550000
         2 PJJ PIC'99',                   /* BEI DATUM-EMPFANGSFELD  */ 02560000
         2 PMM PIC'99',                                                 02570000
         2 PTT PIC'99';                                                 02580000
-  DCL 1 B_DATSTRUCK,                     /* EIGENTL. RECHENFELDER   */ 02590000
         2 BJH BIN FIXED (15,0),          /* ZUR DATUMS-BESTIMMUNG   */ 02600000
         2 BJJ BIN FIXED (15,0),          /* ZUR DATUMS-BESTIMMUNG   */ 02610000
         2 BMM BIN FIXED (15,0),                                        02620000
         2 BTT BIN FIXED (15,0);                                        02630000
-  DCL 1 R_DATSTRUCK BASED (PRET),        /* UMWANDLG. PIC -> CHAR   */ 02640000
         2 RJH PIC'99',                   /* DJ65WND     11.88       */ 02650000
         2 RJJ PIC'99',                   /* BEI DATUM-RUECKGABEFELD */ 02660000
         2 RMM PIC'99',                                                 02670000
         2 RTT PIC'99';                                                 02680000
-END SCCA02M;                                                           02690000