     /*** SUG100M ERSTELLEN HW RECON INPUT FILES AUS CEOEI            */00010077
0SUG100M:PROC OPTIONS(MAIN);                                            00020077
0              @NDBV3J: ENTRY;     DCL @SCHFIRST BIT(1)                 00030077
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00040077
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00050077
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00060077
               EDIT    ('SUG100M  VERSION 2012.05.30' ,                 00070077
               ' 23H11.00      MIT DEM VERSIONS-ENTRY',                 00080077
               ' @NDBV3J',' ')     (SKIP,A,A,A,SKIP,A);                 00090077
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00100077
               END;     /* ENDE DER VERSIONS-GRUPPE  */                 00110077
 DCL KLASS CHAR (30) INIT ('IBM INTERNAL USE ONLY');                    00120077
 /*       I  B  M      I N T E R N A L   U S E   O N L Y              */00130077
 /*             COPYRIGHT  IBM  DEUTSCHLAND  GMBH   1985/1986         */00140077
     /***                                                             */00150077
     /***                                                             */00160077
     /*** CALLED BY:   NONE                                           */00170077
     /***                                                             */00180077
     /*** ARGUMENTS:   NONE                                           */00190077
     /***                                                             */00200077
     /*** CALLS:       SUG102M : FORMATIEREN/AUSGEBEN HW RECON FILES  */00210077
     /***              SUG420M : LADEN INTERNE TAB. AUS               */00220077
     /***                        TABLE LIKE FILE TAB. 0400            */00230077
     /***              RCBF50M : INSERT RCB024-PARAMETER (HASH TOT.)  */00240077
     /***              RCBG50M : UPDATE RCB024-PARAMETER              */00250077
     /***              RCBI50M : RETRIEVE PARAMETER                   */00260077
     /***              RCB0E1M : AUSGABE FEHLERNACHRICHT              */00270077
     /***              RCB018M : RECHNEN HASH TOTALS                  */00280077
     /***              RCB020M : RETRIEVE RUNDATE PARAMETER RCB001    */00290077
     /***              DP60343 : STANDARD-ABBRUCH                     */00300077
     /***                        (REMOVED 24/07/00 - HM)              */00310077
     /*** INPUT:       CEOEI   : AKTUELLE CEOEI                       */00320077
     /***              VSAMOEI : CEOEI FUER ZUGRIFF MIT KEY           */00330077
     /***              T110OLD : T110 EXTRAKT OLD (AUS CEDS)          */00340077
     /***              RCBBC21 : UPSTREAM RCBBCB0 (JCL PARMS)  *PCR228*/00350077
     /***                                                             */00360077
     /*** OUTPUT:      RCBBCA0 : HW PRODUCT FILE                      */00370077
     /***              RCBBCA2 : HW STATUS FILE                       */00380077
     /***              RCBBCA3 : OU / HW PRODUCT FILE                 */00390077
     /***              RCBBCA4 : HW / CUSTOMER FILE                   */00400077
     /***              RCBBCA5 : HW SUPPLY CONTRACT FILE              */00410077
     /***              RCBBCA7 : HW PRODUCT OFFERING IN ORDER FILE    */00420077
     /***              RCBBCA8 : REALIZATION OF HW PO FILE            */00430077
     /***              RCBBCAB : MODIFIABLE INFO HW PRODUCT FILE      */00440077
     /***              PICD0   : PICD0-FILE                           */00450077
     /***              RCB0M10 : MESSAGE FILE                         */00460077
     /***              PROTOK  : LAUFPROTOKOLL                        */00470077
     /***              RCB0OEM : OEM FILE                             */00480077
     /***                                                             */00490077
     /*** INCLUDES:    DIX0361 : CEOEI                                */00500077
     /***              SUG101I : PICD0-FILE                           */00510077
     /***              RCBBAASH: HEADER RECORD RECON FILES            */00520077
     /***              RCBBAAST: TRAILER RECORD RECON FILES           */00530077
     /***              RCBBAAS1: ALLGEMEINER DATENTEIL RECON FILES    */00540077
     /***              RCB110S : T110 EXTRAKT OLD                     */00550077
     /***              RCB500S : PARAMETER TABLE                      */00560077
     /***              RCB500SI: NULL INICATORS PARAMETER TABLE       */00570077
     /***              RCBP24S : PARAMETER RCB024 (HASH TOTALS)       */00580077
     /***              RCBZ01S : INTERF. AREA (PARAM. F. COMMON MOD.) */00590077
     /***              RCBZ02S : RETURN AREA FROM BUILDING BLOCK      */00600077
     /***              RCBZ28S : RUNDATE AREA F. RCB001 PARAMETER     */00610077
     /***                                                             */00620077
     /*** PROGRAMMER:  B. MUELLER                                     */00630077
     /*** DATE:        26.04.93                                       */00640077
     /***                                                             */00650077
     /*** AENDERUNG:   24.03.94                                       */00660077
     /*** DURCH:       B. MUELLER                                     */00670077
     /*** GRUND:       CEDS 2.0 FINAL CUTOVER                         */00680077
     /***              DATENBEREINIGUNG CEOEI, AUSBAU ABGLEICH MIT    */00690077
     /***              OEI ALT, AUSBAU LOGIK AUF STATUS 5, UMSTELLEN  */00700077
     /***              DATE AUF DATETIME FUNCTION.                    */00710077
     /***                                                             */00720077
     /*** AENDERUNG:   24.01.95                                       */00730077
     /*** DURCH:       B. MUELLER                                     */00740077
     /*** GRUND:       CEDS 2.1: ANPASSUNG LRECL OUTPUT FILES AN      */00750077
     /***              GEAENDERTE TABLE LAYOUTS T0220_SUPPL_CTR       */00760077
     /***              T0260_HW_IN_ORD UND T0380_HW_PR_MOD.           */00770077
     /***              ZUWEISUNG F. PGR_TYPE ANGEPASST.               */00780077
     /***                                                             */00790077
     /*** AENDERUNG:   16.10.95                                       */00800077
     /*** DURCH:       A. FISCHER                                     */00810077
     /*** GRUND:       CEDS 2.2:                                      */00820077
     /***              - ANPASSUNG Z_TAB VON 19 AUF 24 PLAETZE        */00830077
     /***              - RECOMPILE WEGEN INCLUDE-AENDERUNG RCBZ01S    */00840077
     /***                                                             */00850077
     /*** AENDERUNG:   02.09.96                                       */00860077
     /*** DURCH:       A. FISCHER                                     */00870077
     /*** GRUND:       AIM 391 CEDS 2.3:                              */00880077
     /***              - ANPASSUNG WEGEN INCLUDE-AENDERUNG            */00890077
     /***                RCB170S/SI: EFFECTIVE_DATE_OU ENTFAELLT      */00900077
     /***                OU_HW_REC     VON  99 AUF  87 (RCB170S)      */00910077
     /***                RCB260S/SI: EFFECTIVE_DATE_OU ENTFAELLT      */00920077
     /***                HW_IN_ORD_REC VON 205 AUF 193 (RCB260S)      */00930077
     /***                                                             */00940077
     /*** AENDERUNG:   12.08.98                                       */00950077
     /*** DURCH:       W. BECHTEL                                     */00960077
     /*** GRUND:       AIM 410 CEDS 3.0 INKL. QF A1 UND A2:           */00970077
     /***              - ANPASSUNG WEGEN INCLUDE-AENDERUNG            */00980077
     /***                RCB220S: SERVICE_LVL_CODE ZUSAETZLICH INST.  */00990077
     /***                RCB220SI: INDNULL(12) VON 11 AUF 12 PLAETZE  */01000077
     /***                HW_SUPPLY_REC  VON 99 AUF 104 (RCB220S/SI)   */01010077
     /***                                                             */01020077
     /*** AENDERUNG:   31.08.98                                       */01030077
     /*** DURCH:       W. BECHTEL                                     */01040077
     /*** GRUND:       AIM 410 CEDS 3.0 INKL. QF A1 UND A2:           */01050077
     /***              - AENDERUNGEN SIEHE VERMERK RQ.410             */01060077
     /***              - PROGRAMM = SUG420M UND PROGRAMM AUFRUF       */01070077
     /***                ZUSAETZLICH INSTALLIERT                      */01080077
     /***                * UEBERNAHME DES "SERVICE_LVL_CODE_2         */01090077
     /***                  TABELLE 400 (FILE) MITTELS TYPE/MODELL     */01100077
     /***              - DCL, OPEN UND CLOSE FUER FILE "RCBBMC0"      */01110077
     /***                INSTALLIERT                                  */01120077
     /***                                                             */01130077
     /*** AMENDED:     24.07.00                                       */01140077
     /*** BY:          H MEDHURST                                     */01150077
     /*** REASON:      COMMON ERROR ROUTINE NOW USED                  */01160077
     /***                                                             */01170077
     /*** AMENDED:     27.11.09                                       */01180077
     /*** BY:                                                         */01190077
     /*** REASON:      A10-A11 CHANGE 030A                            */01200077
     /***                                                             */01210077
     /*** AMENDED:     30.05.12                                       */01220077
     /*** BY:                                                         */01230077
     /*** REASON:      TRURO SUPPORT -- SECONDARY INVENTORY           */01240077
     /***                                                             */01250077
     /***                                                             */01260077
     /***   FUNKTIONSBESCHREIBUNG:                                    */01270077
     /***                                                             */01280077
     /***  > DAS PROGRAMM ERSTELLT AUS DER CEOEI HW RECONCILIATION    */01290077
     /***    INPUT FILES FUER CEDS.                                   */01300077
     /***                                                             */01310077
     /***    DIE CEOEI ENTHAELT NUR NOCH SAETZE MIT STATUS 0          */01320077
     /***    (AUFTRAG) UND STATUS 3/4 (INSTALLATION). ES WERDEN       */01330077
     /***    ALLE HARDWARE-SAETZE (PICD ¬= 4,5,6) VERARBEITET.        */01340077
     /***                                                             */01350077
     /***    BEI STATUS 3/4 WIRD GEPRUEFT, OB DIE TOS IM T110 EXTRAKT */01360077
     /***    AUS CEDS BEREITS VORHANDEN IST. DIESE INFO WIRD ZUR      */01370077
     /***    ZUWEISUNG DES EFFECTIVE_DATE IN RCBBCA3, RCBBCA8 UND     */01380077
     /***    RCBBCAB BENOETIGT.                                       */01390077
     /***                                                             */01400077
     /***  > ZUSAETZLICH WIRD DIE PICD0-FILE ERSTELLT. SIE ENTHAELT   */01410077
     /***    HW-INFORMATIONEN, DIE ZUR ERSTELLUNG DER SOFTWARE RECON  */01420077
     /***    INPUT FILES BENOETIGT WERDEN.                            */01430077
     /***    ERSTELLUNGSKRITERIEN:  PICD = '0' &                      */01440077
     /***                           (STATUS = '3','4' ODER            */01450077
     /***                           (STATUS = '0' & LSMANR GEFUELLT)) */01460077
     /***                                                             */01470077
     /***  > DER PARAMETER RCB024 WIRD MIT DEN VOM SUB-MODUL ER-      */01480077
     /***    MITTELTEN HASH TOTALS JE FILE UPGEDATED.                 */01490077
     /***                                                             */01500077
     /***  > DAS MODUL SUG102M FORMATIERT UND SCHREIBT DIE EINZELNEN  */01510077
     /***    HW RECON FILES. FOLGENDE ARGUMENTE WERDEN UEBERGEBEN:    */01520077
     /***    - OEIPTR:       ZEIGT AUF CEOEI                          */01530077
     /***    - DATAREC_PTR:  ZEIGT AUF ALLGEMEINEN DATENTEIL          */01540077
     /***    - HASH_PTR:     ZEIGT AUF KONTROLLSUMMENSTRUKTUR         */01550077
     /***    - PTR_INT_AREA: ZEIGT AUF INTERFACE AREA (ENTHAELT       */01560077
     /***                    PARAMETER F. COMMON SUB-MOD. UND RUNDATE */01570077
     /***                    AUS RCB001 U. SYSTEMDATUM F. SUG102M)    */01580077
     /***    - Z_TAB:        ZAEHLERTABELLE                           */01590077
     /***    - TOSGEFU:      TOS BEREITS IN CEDS VORHANDEN?           */01600077
     /***                                                             */01610077
     /***                                                             */01620077
     /***    ABBRUCH-FAELLE:                                          */01630077
     /***       - CEOEI ENTHAELT KEINE DATEN                          */01640077
     /***       - SORTBRUCH AUF CEOEI                                 */01650077
     /***       - CEOEI ENTHAELT ANDEREN STATUS ALS 0,3,4             */01660077
     /***       - T110 EXTRAKT ENTHAELT KEINE DATEN                   */01670077
     /***       - FALSCHE SATZART IN T110 EXTRAKT                     */01680077
     /***       - FALSCHE FILE-ID IN T110 EXTRAKT                     */01690077
     /***       - FALSCHER TIMESTAMP IN T110 EXTRAKT                  */01700077
     /***       - ANZAHL SAETZE IN T110 EXTRAKT STIMMT NICHT          */01710077
     /***       - HASH TOTALS IN T110 EXTRAKT STIMMEN NICHT           */01720077
     /***       - TRAILER IN T110 EXTRAKT IST NICHT LETZTER SATZ      */01730077
     /***       - RCB024 PARAMETER FUER FILE RCBBCB2 (T110 EXTRAKT)   */01740077
     /***         NICHT VORHANDEN                                     */01750077
     /***       - WEITERE SIEHE SUG102M                               */01760077
     /***                                                             */01770077
     /***                                                             */01780077
     /*** VERARBEITUNGSSCHRITTE:                                      */01790077
     /***                                                             */01800077
     /***    P R O G R A M M V O R S P A N N                          */01810077
     /***                                                             */01820077
     /***                                                             */01830077
     /***                                                             */01840077
     /***                                                             */01850077
     /***    H A U P T V E R A R B E I T U N G                        */01860077
     /***                                                             */01870077
     /***                                                             */01880077
     /***                                                             */01890077
     /***                                                             */01900077
     /***   S C H L U S S - V E R A R B E I T U N G                   */01910077
     /***                                                             */01920077
     /***                                                             */01930077
     /***                                                             */01940077
1/*-------------------------------------------------------------------*/01950077
 /* MAINTENANCE LOG  :                                                */01960077
 /* ---------------                                                   */01970077
 /*                                                                   */01980077
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                          */01990077
 /*  --------------------------------------------------------------   */02000077
 /*  2011-02-28 | TREC 80315   | INCRESED THE FILE REC LENGTH FROM 160*/02010077
 /*             |              | TO I59 . FILE NAME=> RCBBMC0         */02020077
 /********************************************************************/ 02030077
1/*-------------------------------------------------------------------*/02040077
0 DEFAULT RANGE (*) STATIC;                                             02050077
-/*-------------------------------------------------------------------*/02060077
 /*                                                                   */02070077
 /*         V E R E I N B A R U N G E N                               */02080077
 /*                                                                   */02090077
 /*-------------------------------------------------------------------*/02100077
-/*-------------------------------------------------------------------*/02110077
 /***   PLIXOPTION   -   N U R   FUER   M A I N   PROGRAMME         ***/02120077
 /*-------------------------------------------------------------------*/02130077
  DCL PLIXOPT CHAR(100) VARYING STATIC EXTERNAL                         02140077
      INIT ('HEAP(200K,100K,ANYWHERE,FREE),ISA(100K)');                 02150077
-/*-------------------------------------------------------------------*/02160077
 /***   BIT                                                         ***/02170077
 /*-------------------------------------------------------------------*/02180077
   DCL EOF_OEI        BIT(1)    INIT ('0'B);    /*EOF CEOEI           */02190077
   DCL SATZ_OK        BIT(1)    INIT ('0'B);    /*VERARBEITEN OEI-SATZ*/02200077
   DCL EOF_T110       BIT(1)    INIT ('0'B);    /*EOF T110 EXTRAKT OLD*/02210077
   DCL FIRST_T110     BIT(1)    INIT ('1'B);    /*1. LESEN T110 EXTR. */02220077
   DCL TRAILER_VERARB BIT(1)    INIT ('0'B);    /*TRAILER T110 VERARB?*/02230077
   DCL TOSGEFU        BIT(1)    INIT ('0'B);    /*TOS IN T110 GEFUNDEN*/02240077
 /*-------------------------------------------------------------------*/02250077
 /***   ENTRIES                                                     ***/02260077
 /*-------------------------------------------------------------------*/02270077
 /*DCL  DP60343        EXT ENTRY;               REMOVED 24/07/00 - HM */02280077
   DCL  SUG102M        EXT ENTRY;                                       02290077
   DCL  SUG420M        EXT ENTRY;                        /* RQ.410    */02300077
   DCL  RCBF50M        EXT ENTRY;                                       02310077
   DCL  RCBG50M        EXT ENTRY;                                       02320077
   DCL  RCBI50M        EXT ENTRY;                                       02330077
   DCL  RCB0E1M        EXT ENTRY;                                       02340077
   DCL  RCB018M        EXT ENTRY;                                       02350077
   DCL  RCB020M        EXT ENTRY;                                       02360077
1/*-------------------------------------------------------------------*/02370077
 /***   BUILTIN                                                     ***/02380077
 /*-------------------------------------------------------------------*/02390077
   DCL  ADDR           BUILTIN;                                         02400077
   DCL  STRING         BUILTIN;                                         02410077
   DCL  SUBSTR         BUILTIN;                                         02420077
   DCL  HIGH           BUILTIN;                                         02430077
   DCL  TIME           BUILTIN;                                         02440077
   DCL  CSTG           BUILTIN;                                         02450077
   DCL  NULL           BUILTIN;                                         02460077
   DCL  INDEX          BUILTIN;                                         02470077
0/*-------------------------------------------------------------------*/02480077
 /***   POINTER                                                     ***/02490077
 /*-------------------------------------------------------------------*/02500077
   DCL  OEIPTR           POINTER;   /* POINTER AUF CEOEI              */02510077
   DCL  DATAREC_PTR      POINTER;   /* POINTER AUF ALLG. DATENTEIL    */02520077
   DCL  HASH_PTR         POINTER;   /* PTR AUF KONTROLLSUMMENSTRUKTUR */02530077
   DCL  RCBV500_PTR      POINTER;   /* PTR AUF PARAMETER TABLE        */02540077
   DCL  RCBV500_I_PTR    POINTER;   /* PTR NULL-IND. PARAMETER TAB.   */02550077
   DCL  PTR_INT_AREA     POINTER;   /* POINTER AUF INTERFACE AREA     */02560077
   DCL  PTR_RETURN_AREA  POINTER;   /* POINTER AUF RETURN AREA        */02570077
   DCL  PTR_RUNDATE_AREA POINTER;   /* POINTER AUF RUNDATE AREA       */02580077
-/*-------------------------------------------------------------------*/02590077
 /***   FILES                                                       ***/02600077
 /*-------------------------------------------------------------------*/02610077
0/*-------INPUT-------------------------------------------------------*/02620077
 /*DCL  CEOEI          FILE RECORD INPUT SEQL; */                       02630077
   DCL  CEOEI      FILE RECORD INPUT SEQL ENV(VSAM);                    02640077
   DCL  VSAMOEI FILE RECORD KEYED INPUT ENV(VSAM,GENKEY); /*OEI, LESEN*/02650077
                                                          /*MIT KEY   */02660077
                                                                        02670077
   DCL  T110OLD        FILE RECORD INPUT SEQL;                          02680077
                                                                        02690077
   DCL  RCBBMC0    FILE                            /* UPSTREAM FILE  */ 02700077
                   RECORD                                               02710077
                   INPUT                                                02720077
                   SEQUENTIAL                                           02730077
                   ENV (FB RECSIZE(159));                               02740077
                                                        /* SOC PCR228*/ 02750077
   DCL RCBBC21        FILE             /* INPUT PARM FILE            */ 02760077
                      RECORD                                            02770077
                      INPUT                                             02780077
                      SEQUENTIAL                                        02790077
                      ENV (FB RECSIZE(20));             /* EOC PCR228*/ 02800077
0/*-------OUTPUT------------------------------------------------------*/02810077
   DCL  RCBBCA0        FILE RECORD OUTPUT SEQL;                         02820077
   DCL  RCBBCA2        FILE RECORD OUTPUT SEQL;                         02830077
   DCL  RCBBCA3        FILE RECORD OUTPUT SEQL;                         02840077
   DCL  RCBBCA4        FILE RECORD OUTPUT SEQL;                         02850077
   DCL  RCBBCA5        FILE RECORD OUTPUT SEQL;                         02860077
   DCL  RCBBCA7        FILE RECORD OUTPUT SEQL;                         02870077
   DCL  RCBBCA8        FILE RECORD OUTPUT SEQL;                         02880077
   DCL  RCBBCAB        FILE RECORD OUTPUT SEQL;                         02890077
   DCL  RCB0M10        FILE RECORD OUTPUT SEQL;                         02900077
   DCL  PICD0          FILE RECORD OUTPUT SEQL;                         02910077
   DCL  PROTOK         FILE RECORD OUTPUT SEQL;                         02920077
   DCL  RCB0OEM        FILE RECORD OUTPUT SEQL;                         02930077
   DCL  SYSPRINT       FILE EXTERNAL PRINT;                             02940077
1/*-------------------------------------------------------------------*/02950077
 /***   ARBEITS - VARIABLE                                          ***/02960077
 /*-------------------------------------------------------------------*/02970077
                                                        /* SOC PCR228*/ 02980077
   DCL  INVSRCE        CHAR(2);            /* INVENTORY SOURCE-CODE   */02990077
   DCL 1 TB_T400RSS(*) CTL                 /* TABLE FOR FILTERING     */03000077
       , 3 PRODMOD              CHAR(7);   /* RSS PRODUCTS            */03010077
   DCL 1  ITBRSS400MAX   BIN FIXED (31);                                03020077
   DCL 1  TRUE           BIT (1) INIT('1'B);                            03030077
   DCL 1  FALSE          BIT (1) INIT('0'B);                            03040077
                                                        /* EOC PCR228*/ 03050077
   DCL  ZPICD          CHAR(1);            /* ZWISCHENSPEICHERN PICD  */03060077
   DCL  I              BIN FIXED(15);      /* SCHLEIFENZAEHLER        */03070077
   DCL  JAHR           CHAR(2) INIT ('');  /* F. 4STELLIGE JAHRESZAHL */03080077
                                                                        03090077
   DCL  OEI_TOS             CHAR(13) INIT('');   /*AKTUELLE OEI-TOS   */03100077
   DCL  PREV_TOS            CHAR(13) INIT('');   /*PREVIOUS OEI-TOS   */03110077
   DCL  T110_TOS            CHAR(13) INIT('');   /*TOS AUS T110 OLD   */03120077
   DCL  ANZREC              PIC'(9)9';        /*ANZ. REC. T110 TRAILER*/03130077
                                                                        03140077
   DCL  Z_TAB_ANZ      FIXED BIN(15,0) EXTERNAL     /* ZAEHLER-TABELLE*/03150077
                       INIT (24);                   /* ANZ ZEILEN     */03160077
   DCL  1 Z_TAB(24),                                /* ZAEHLER-TABELLE*/03170077
          2 ANZ        FIXED DEC(9,0) INIT ((24)0),                     03180077
          2 TEXT       CHAR (45);                                       03190077
                                                                        03200077
   DCL  1 HASH_TOTAL,                       /* KONTROLLSUMMEN JE FILE */03210077
          3 RCBBCA0    FIXED DEC(15,0)  INIT(0),                        03220077
          3 RCBBCA2    FIXED DEC(15,0)  INIT(0),                        03230077
          3 RCBBCA3    FIXED DEC(15,0)  INIT(0),                        03240077
          3 RCBBCA4    FIXED DEC(15,0)  INIT(0),                        03250077
          3 RCBBCA5    FIXED DEC(15,0)  INIT(0),                        03260077
          3 RCBBCA7    FIXED DEC(15,0)  INIT(0),                        03270077
          3 RCBBCA8    FIXED DEC(15,0)  INIT(0),                        03280077
          3 RCBBCAB    FIXED DEC(15,0)  INIT(0);                        03290077
                                                                        03300077
   DCL  HASH_FIELD     CHAR(4);            /*INPUT F. RECHNEN HASH TOT*/03310077
   DCL  HASH_T110      FIXED DEC(15,0)  INIT(0); /*HASH TOTALS T110 EX*/03320077
   DCL  TIMESTAMP_T110      CHAR(20) INIT ('');                         03330077
1/*-------------------------------------------------------------------*/03340077
 /***   INCLUDES                                                    ***/03350077
 /*-------------------------------------------------------------------*/03360077
   DCL  1 OEISTRU   BASED(OEIPTR),                                      03370077
          % INCLUDE DIX0361;                                            03380077
                                                                        03390077
   DCL 1 TOS_STRU   CHAR(13);                                           03400077
   DCL 1 TOS_AREA   BASED(ADDR(TOS_STRU)),                              03410077
          % INCLUDE (RCBOEMS);                                          03420077
                                                                        03430077
                                                                        03440077
   DCL  T110_STRU     CHAR(105); /*CHGR34P*/        /*T110 EXTRAKT OLD*/03450077
   DCL  1 T110        BASED(ADDR(T110_STRU)),             /*T110 DATEN*/03460077
            % INCLUDE RCBBAAS1;,                                        03470077
          3 DATA,                                                       03480077
            % INCLUDE RCB110S;,                                         03490077
          3 NULLIND,                                                    03500077
            % INCLUDE RCB110SI;;                                        03510077
   DCL  1 T110_H      BASED(ADDR(T110_STRU)),            /*T110 HEADER*/03520077
          % INCLUDE RCBBAASH;;                                          03530077
   DCL  1 T110_T      BASED(ADDR(T110_STRU)),           /*T110 TRAILER*/03540077
          % INCLUDE RCBBAAST;;                                          03550077
                                                                        03560077
 /*--- STRUKTUREN OUTPUT FILES ---------------------------------------*/03570077
   DCL  HW_PRODUCT_REC     CHAR(75);   /* RCBBAAS1, RCB050S, RCB050SI */03580077
   DCL  HW_STATUS_REC      CHAR(105);  /* RCBBAAS1, RCB110S, RCB110SI */03590077
   DCL  OU_HW_REC          CHAR(108);  /* RCBBAAS1, RCB170S, RCB170SI */03600077
   DCL  HW_CUST_REC        CHAR(136);  /* RCBBAAS1, RCB190S, RCB190SI */03610077
 /*DCL  HW_SUPPLY_REC      CHAR(140);*//* RCBBAAS1, RCB220S, RCB220SI */03620077
                                                      /*A10-11 - 030A */03630077
   DCL  HW_SUPPLY_REC      CHAR(145);  /* RCBBAAS1, RCB220S, RCB220SI */03640077
                                                      /*A10-11 - 030A */03650077
   DCL  HW_IN_ORD_REC      CHAR(214);  /* RCBBAAS1, RCB260S, RCB260SI */03660077
   DCL  HW_REAL_REC        CHAR(104);  /* RCBBAAS1, RCB300S, RCB300SI */03670077
   DCL  HW_MOD_REC         CHAR(136);  /* RCBBAAS1, RCB380S, RCB380SI */03680077
                                                                        03690077
   DCL  1 HEADER,                                 /* HEADER ALLGEMEIN */03700077
          % INCLUDE RCBBAASH;;                                          03710077
   DCL  1 HEAD_HW_PRODUCT        BASED(ADDR(HW_PRODUCT_REC)),           03720077
          % INCLUDE RCBBAASH;;                                          03730077
   DCL  1 HEAD_HW_STATUS         BASED(ADDR(HW_STATUS_REC)),            03740077
          % INCLUDE RCBBAASH;;                                          03750077
   DCL  1 HEAD_OU_HW             BASED(ADDR(OU_HW_REC)),                03760077
          % INCLUDE RCBBAASH;;                                          03770077
   DCL  1 HEAD_HW_CUST           BASED(ADDR(HW_CUST_REC)),              03780077
          % INCLUDE RCBBAASH;;                                          03790077
   DCL  1 HEAD_HW_SUPPLY         BASED(ADDR(HW_SUPPLY_REC)),            03800077
          % INCLUDE RCBBAASH;;                                          03810077
   DCL  1 HEAD_HW_IN_ORD         BASED(ADDR(HW_IN_ORD_REC)),            03820077
          % INCLUDE RCBBAASH;;                                          03830077
   DCL  1 HEAD_HW_REAL           BASED(ADDR(HW_REAL_REC)),              03840077
          % INCLUDE RCBBAASH;;                                          03850077
   DCL  1 HEAD_HW_MOD            BASED(ADDR(HW_MOD_REC)),               03860077
          % INCLUDE RCBBAASH;;                                          03870077
                                                                        03880077
   DCL  1 TRAIL_HW_PRODUCT       BASED(ADDR(HW_PRODUCT_REC)),           03890077
          % INCLUDE RCBBAAST;;                                          03900077
   DCL  1 TRAIL_HW_STATUS        BASED(ADDR(HW_STATUS_REC)),            03910077
          % INCLUDE RCBBAAST;;                                          03920077
   DCL  1 TRAIL_OU_HW            BASED(ADDR(OU_HW_REC)),                03930077
          % INCLUDE RCBBAAST;;                                          03940077
   DCL  1 TRAIL_HW_CUST          BASED(ADDR(HW_CUST_REC)),              03950077
          % INCLUDE RCBBAAST;;                                          03960077
   DCL  1 TRAIL_HW_SUPPLY        BASED(ADDR(HW_SUPPLY_REC)),            03970077
          % INCLUDE RCBBAAST;;                                          03980077
   DCL  1 TRAIL_HW_IN_ORD        BASED(ADDR(HW_IN_ORD_REC)),            03990077
          % INCLUDE RCBBAAST;;                                          04000077
   DCL  1 TRAIL_HW_REAL          BASED(ADDR(HW_REAL_REC)),              04010077
          % INCLUDE RCBBAAST;;                                          04020077
   DCL  1 TRAIL_HW_MOD           BASED(ADDR(HW_MOD_REC)),               04030077
          % INCLUDE RCBBAAST;;                                          04040077
                                                                        04050077
   DCL  1 DATAREC,                               /* ALLGEM. DATENTEIL */04060077
          % INCLUDE RCBBAAS1;;                   /* OUTPUT FILES      */04070077
                                                                        04080077
   DCL  1 INT_AREA,                     /* INTERFACE AREA, ENTHAELT   */04090077
          % INCLUDE RCBZ01S;;           /* PARAM.F. COMMON SUB-MODULES*/04100077
   DCL  1 RETURN_AREA,                  /* RETURN AREA FROM BUILDING  */04110077
          % INCLUDE RCBZ02S;;           /* BLOCK                      */04120077
   DCL  1 RUNDATE_AREA,                 /* RUNDATE AREA F. RCB020M -  */04130077
          % INCLUDE RCBZ28S;;           /* RETRIEVE RCB001 PARAMETER  */04140077
                                                                        04150077
   DCL  1 PICD,                                         /* PICD0-FILE */04160077
          % INCLUDE SUG101I;                                            04170077
                                                                        04180077
                                                        /* SOC PCR228 */04190077
   DCL FILE_RCBBC21      CHAR(20);      /* PARM INPUT FILE            */04200077
                                                        /* SOC PCR228 */04210077
 /*---- DB2 TABLE STRUKTUREN -----------------------------------------*/04220077
   DCL  1 TB_RCBV500,                            /* PARAMETER TABLE   */04230077
          % INCLUDE RCB500S;;                                           04240077
   DCL  1 TB_RCBV500_I,                          /* NULL INDICATORS   */04250077
          % INCLUDE RCB500SI;;                   /* PARAMETER TABLE   */04260077
                                                                        04270077
 /*---- KONTROLL PARAMETER -------------------------------------------*/04280077
   DCL  1 RCB024_PARM  BASED(RCBV500_PTR),  /* PARAM. RCB024 F. KONTR.*/04290077
          % INCLUDE RCBP24S;;               /* HASH TOTALS / TIMESTAMP*/04300077
                                                                        04310077
   DCL  1 RCB024_T110,                      /*HASH TOTALS / TIMESTAMP */04320077
          % INCLUDE RCBP24S;;               /*T110 EXTRAKT OLD        */04330077
1/*-------------------------------------------------------------------*/04340077
 /***      U E B E R S C H R I F T E N                              ***/04350077
 /*-------------------------------------------------------------------*/04360077
1/*-------------------------------------------------------------------*/04370077
 /***      DRUCK-ZEILEN                                             ***/04380077
 /*-------------------------------------------------------------------*/04390077
   DCL  1 PROTO_Z,                                                      04400077
          2 ASA           CHAR(1)   INIT (' '),                         04410077
          2 TEXT          CHAR(45),                                     04420077
          2 ANZAHL        PIC'(9)Z9',                                   04430077
          2 REST          CHAR(77)  INIT (' ');                         04440077
1/*-------------------------------------------------------------------*/04450077
 /***      D A T U M                                                ***/04460077
 /*-------------------------------------------------------------------*/04470077
-DCL MASCHDAT     CHAR(17);       /* MASCHINENDATUM YYYYMMDDHHMMSSTTT */04480077
 DCL DATUMAUF     CHAR(10);              /* MASCHINENDATUM YYYY-MM-TT */04490077
 DCL DATETIME BUILTIN;                                                  04500077
 MASCHDAT = DATETIME;                                                   04510077
 DATUMAUF = SUBSTR(MASCHDAT,1,4) || '-' ||                              04520077
            SUBSTR(MASCHDAT,5,2) || '-' ||                              04530077
            SUBSTR(MASCHDAT,7,2);                                       04540077
1/********************************************************************/ 04550077
 /* EXTERNAL PARAMETER INTERFACES                                    */ 04560077
 /********************************************************************/ 04570077
 DCL 1 PARM_INT_AREA          BASED (PTR_INT_AREA),                     04580077
      %INCLUDE (RCBZ01S);;                                              04590077
1/*-------------------------------------------------------------------*/04600077
 /***    ON ERROR                                                   ***/04610077
 /*-------------------------------------------------------------------*/04620077
 %INCLUDE (RCB0E0M);                                                    04630077
  END;                                                                  04640077
 /********************************************************************/ 04650077
 /*                                                                  */ 04660077
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 04670077
 /* AND CALL THE ERROR ROUTINE:                                      */ 04680077
 /*                                                                  */ 04690077
 /*                                                                  */ 04700077
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 04710077
 /*                                                                  */ 04720077
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 04730077
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 04740077
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 04750077
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 04760077
 /*                                                                  */ 04770077
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 04780077
 /*                                                                  */ 04790077
 /********************************************************************/ 04800077
 /*      ON ERROR BEGIN;                        REMOVED 24/07/00 - HM */04810077
 /*         CLOSE FILE (SYSPRINT);                                    */04820077
 /*         CALL DP60343 ('0100');                                    */04830077
 /*      END;                                                         */04840077
-/*-------------------------------------------------------------------*/04850077
 /***    ON ENDFILE                                                 ***/04860077
 /*-------------------------------------------------------------------*/04870077
   ON ENDFILE (CEOEI) BEGIN;                                            04880077
      EOF_OEI = '1'B;                                                   04890077
      OEI_TOS = HIGH(13);                                               04900077
   END;                                                                 04910077
   ON ENDFILE (T110OLD) BEGIN;                                          04920077
      EOF_T110 = '1'B;                                                  04930077
      T110_TOS = HIGH(13);                                              04940077
   END;                                                                 04950077
                                                        /* SOC PCR228*/ 04960077
-/*-------------------------------------------------------------------*/04970077
 /***    RETRIEVE JCL PARAMETERS                                    ***/04980077
 /*-------------------------------------------------------------------*/04990077
 OPEN FILE (RCBBC21);                                                   05010077
                                /* ASSIGN PARM VALUES TO VARIABLES   */ 05030077
 READ FILE (RCBBC21) INTO (FILE_RCBBC21);                               05040077
                                                                        05060077
 INVSRCE     = SUBSTR(FILE_RCBBC21,1,2);                                05070077
 SELECT (INVSRCE);                                                      05080077
 WHEN ('CA');   /*  BRIDGE IS THE MAIN SOURCE                        */ 05090077
 WHEN ('S2') DO;/*  BRIDGE IS THE SECONDARY INVENTORY SOURCE         */ 05100077
    CALL SUG100_RSSTABLE_FILL;                                          05120077
    END;                                                                05130077
 OTHERWISE DO;                                                          05140077
    PUT SKIP EDIT                                                       05160077
     ('SUG100M -- INVENTORY SOURCE PARAMETER CONTAINS AN INCORRECT      05170077
       VALUE, "CA" OR "S2" EXPECTED -- FOUND --> ',INVSRCE)(A);         05180077
    SIGNAL ERROR;                                                       05190077
    END;                                                                05200077
 END;                                                                   05210077
 CLOSE FILE (RCBBC21);                                                  05230077
                                                        /* EOC PCR228*/ 05240077
-/*-------------------------------------------------------------------*/05250077
 /***    O P E N    FILES                                           ***/05260077
 /*-------------------------------------------------------------------*/05270077
   OPEN FILE (CEOEI);                                                   05290077
   OPEN FILE (VSAMOEI);                                                 05300077
   OPEN FILE (RCBBCA0);                                                 05310077
   OPEN FILE (RCBBCA2);                                                 05320077
   OPEN FILE (RCBBCA3);                                                 05330077
   OPEN FILE (RCBBCA4);                                                 05340077
   OPEN FILE (RCBBCA5);                                                 05350077
   OPEN FILE (RCBBCA7);                                                 05360077
   OPEN FILE (RCBBCA8);                                                 05370077
   OPEN FILE (RCBBCAB);                                                 05380077
   OPEN FILE (RCB0M10);                                                 05390077
   OPEN FILE (PICD0);                                                   05400077
   OPEN FILE (PROTOK);                                                  05410077
   OPEN FILE (RCB0OEM);                                                 05420077
   OPEN FILE (RCBBMC0);                                    /* RQ.410  */05430077
1/*-------------------------------------------------------------------*/05450077
 /*                                                                   */05460077
 /*      P R O G R A M M    -    S T A R T                            */05470077
 /*                                                                   */05480077
 /*-------------------------------------------------------------------*/05490077
                                                                        05500077
                                                                        05510077
   Z_TAB = '';                                  /* ZAEHLER INITIALIS. */05530077
   HASH_PTR         = ADDR(HASH_TOTAL);         /* POINTER ADRESSIEREN*/05540077
   PTR_INT_AREA     = ADDR(INT_AREA);                                   05550077
   PTR_RETURN_AREA  = ADDR(RETURN_AREA);                                05560077
   PTR_RUNDATE_AREA = ADDR(RUNDATE_AREA);                               05570077
   RCBV500_PTR      = ADDR(TB_RCBV500);                                 05580077
   RCBV500_I_PTR    = ADDR(TB_RCBV500_I);                               05590077
                                                                        05600077
   INT_AREA.ID_MOD_LEVEL    = 1;                 /*INIT INTERFACE AREA*/05610077
   INT_AREA.ID_MOD_PATH (1) = 'SUG100M ';                               05620077
   INT_AREA.MSG_AREA        = '';                                       05630077
   INT_AREA.ERR_AREA        = '';                                       05640077
   INT_AREA.MSG_REQUEST     = 'O';                                      05650077
   INT_AREA.MSG_TARGET      = 'F';                                      05660077
   INT_AREA.ID_SOURCE_APPL  = 'SUG';                                    05670077
   INT_AREA.ID_SOURCE_PROG  = 'SUG100P ';                               05680077
   INT_AREA.SYSTEM_TYPE     = 'B';                                      05690077
   INT_AREA.PTR_PCB_IO      = NULL;                                     05700077
   INT_AREA.PTR_PCB_ALT     = NULL;                                     05710077
                                                                        05720077
   INT_AREA.SYSTEM_DATE = DATUMAUF;         /*SPEICHERN MASCHINENDATUM*/05730077
                                                                        05740077
   /*-----------------------------------------------------------------*/05750077
   /* RQ.410                                                            05760077
   /* UEBERNEHMEN  TYPE/MOD/SERVICE_LVL_CODE_2  AUS TABLE LIKE FILE     05770077
   /* DER DB2 TABELLE 0400  IN INTERNE TABELLE.                         05780077
   /*-----------------------------------------------------------------*/05790077
                                                                        05800077
   CALL SUG420M;                                       /* RQ.410      */05820077
                                                                        05830077
                                                                        05840077
   /*-----------------------------------------------------------------*/05850077
   /***    LESEN RUNDATE PARAMETER RCB001 / SPEICHERN IN INT_AREA   ***/05860077
   /*-----------------------------------------------------------------*/05870077
   RUNDATE_AREA.PROC_ID     = 'SY  ';                                   05880077
   RUNDATE_AREA.CTRYNO      = '724';                                    05890077
   RUNDATE_AREA.PGR_TYPE    = 'A01';                                    05900077
                                                                        05910077
   CALL RCB020M (PTR_RUNDATE_AREA,                                      05930077
                 PTR_INT_AREA);                                         05940077
                                                                        05950077
   IF RUNDATE_AREA.RUN_DATE = ''              /*RCB001 NICHT VORHANDEN*/05960077
      THEN                                    /*-> RUNDATE=SYSTEMDATUM*/05970077
       DO;                                                              05980077
         PUT SKIP EDIT ('RUNDATE RCB001 NICHT GEFUNDEN')(A);            05990077
         INT_AREA.RUN_DATE = INT_AREA.SYSTEM_DATE;                      06000077
      END;                                                              06010077
      ELSE INT_AREA.RUN_DATE = RUNDATE_AREA.RUN_DATE;                   06020077
                                                                        06030077
   /*-----------------------------------------------------------------*/06040077
   /***    LESEN RCB024 PARAMETER (HASH TOTALS / TIMESTAMP)         ***/06050077
   /***    FUER T110 EXTRAKT FILE                                   ***/06060077
   /*-----------------------------------------------------------------*/06070077
   TB_RCBV500              = '';               /* INIT TABLESTRUCTURE */06090077
   TB_RCBV500_I            = '';                                        06100077
   RCB024_PARM.NUMBER      = 'RCB024';                                  06110077
   RCB024_PARM.PROC_ID     = 'US03';                                    06120077
   RCB024_PARM.CTRYNO      = '724';                                     06130077
   RCB024_PARM.FILE_NAME   = 'RCBBCB2';                                 06140077
   RCB024_PARM.SEQ_NUMBER  = '01';                                      06150077
                                                                        06160077
   CALL RCBI50M ('R',                                    /* RC01219 */  06180077
                 ADDR(TB_RCBV500),                   /*RETRIEVE RCB024*/06190077
                 ADDR(TB_RCBV500_I),                                    06200077
                 PTR_RETURN_AREA,                                       06210077
                 PTR_INT_AREA);                                         06220077
   SELECT(RETURN_AREA.RETURN_CODE);                                     06230077
      WHEN (0)                                                          06240077
         RCB024_T110 = RCB024_PARM, BY NAME;                            06250077
      WHEN (4)                                                          06260077
       DO;                                                              06270077
         PUT SKIP EDIT                                                  06290077
            ('RCB024 PARAMETER FUER FILE RCBBCB2 NICHT VORHANDEN')(A);  06300077
         SIGNAL ERROR;                                                  06310077
       END;                                                             06320077
      OTHER DO;                                                         06330077
         CALL RCB024_ERROR  (ADDR (RETURN_AREA.RETURN_SQL),             06340077
                             'DB2',                                     06350077
                             '#001');                                   06360077
      END;                                                              06370077
   END;                                                                 06380077
                                                                        06390077
1/*-------------------------------------------------------------------*/06400077
 /***    HAUPTVERARBEITUNG                                          ***/06410077
 /*-------------------------------------------------------------------*/06420077
   CALL READ_CEOEI;                                                     06440077
                                                                        06450077
   IF EOF_OEI                                                           06460077
      THEN DO;                                                          06470077
         PUT SKIP EDIT ('CEOEI ENTHAELT KEINE DATEN')(A);               06480077
         SIGNAL ERROR;                                                  06490077
      END;                                                              06500077
                                                                        06510077
   CALL FORMATIEREN;                        /*AUSGEBEN HEADER, FORMA- */06520077
                                            /*TIEREN ALLG. DATENTEIL  */06530077
                                                                        06540077
   DO WHILE (¬EOF_OEI);                                                 06550077
                                                                        06560077
   TOS_STRU = '';                                                       06570077
                                                                        06580077
                                                        /* SOC PCR228*/ 06590077
   IF (INVSRCE = 'CA'  |    /* NON-BLUEHARMONY -- BRIDGE MAIN  */       06630077
      SUG100M_RSSPRODUCT_WANTED(OEISTRU.TYPE ||OEISTRU.MOD))            06640077
   THEN DO;                                                             06650077
                                                        /* EOC PCR228*/ 06670077
      IF OEISTRU.AMCI = '4'                /* CHG0061-0602 OEM */       06680077
      THEN DO;                                                          06690077
         TOS_AREA.TYPE  = OEISTRU.TYPE;                                 06700077
         TOS_AREA.ORIG  = OEISTRU.OR;                                   06710077
         TOS_AREA.SERNO = '00'||OEISTRU.SERL;                           06730077
         WRITE FILE (RCB0OEM) FROM (TOS_STRU);                          06740077
         END;                                                           06750077
                                                                        06760077
      IF OEISTRU.ISTAT = '3' |                      /*INSTALLIERTE HW*/ 06770077
         OEISTRU.ISTAT = '4'                                            06780077
         THEN DO;                                                       06790077
                                                                        06800077
             /*-------------------------------------------------------*/06810077
             /***  PRUEFEN, OB TOS AUS OEI IN T110-EXTRAKT OLD      ***/06820077
             /***  BEREITS VORHANDEN IST.                           ***/06830077
             /*-------------------------------------------------------*/06840077
            DO WHILE (¬EOF_T110 & T110_TOS < OEI_TOS);                  06850077
               CALL READ_T110OLD;                                       06860077
            END;                                                        06870077
                                                                        06880077
            IF T110_TOS = OEI_TOS               /*TOS IN T110 GEFUNDEN*/06890077
               THEN DO;                                                 06900077
                  TOSGEFU = '1'B;                                       06910077
                  Z_TAB(8).ANZ = Z_TAB(8).ANZ + 1;                      06920077
               END;                                                     06930077
               ELSE DO;                                                 06940077
                  TOSGEFU = '0'B;                 /*TOS NICHT GEFUNDEN*/06950077
                  Z_TAB(9).ANZ = Z_TAB(9).ANZ + 1;                      06960077
               END;                                                     06970077
                                                                        06980077
         END;                                      /* END STATUS 3, 4 */06990077
                                                                        07000077
       /*-------------------------------------------------------------*/07010077
       /***  FORMATIEREN UND AUSGEBEN RECON FILES                   ***/07020077
       /*-------------------------------------------------------------*/07030077
      CALL SUG102M (OEIPTR,                                             07050077
                    DATAREC_PTR,                                        07060077
                    HASH_PTR,                                           07070077
                    PTR_INT_AREA,                                       07080077
                    Z_TAB,                                              07090077
                    TOSGEFU);                                           07100077
                                                        /* SOC PCR228*/ 07110077
      END;                                        /* END IF CA       */ 07120077
                                                        /* EOC PCR228*/ 07130077
                                                                        07150077
      CALL READ_CEOEI;                                 /*NACHLESEN OEI*/07160077
                                                                        07170077
   END;                                        /*END DO WHILE ¬EOF_OEI*/07180077
                                                                        07190077
                                                                        07200077
   DO WHILE (¬EOF_T110);                /*LESEN T110 OLD BIS EOF WEGEN*/07210077
      CALL READ_T110OLD;                /*PRUEFEN ANZAHL RECORDS UND  */07220077
   END;                                 /*PRUEFEN HASH TOTALS         */07230077
                                                                        07250077
   CALL FORMAT_TRAILER;       /* FORMATIEREN/AUSGEBEN TRAILER PRO FILE*/07260077
                                                                        07270077
   CALL SAVE_HASH_TOTALS;    /*SPEICHERN HASH TOTALS AUF PARAM. RCB024*/07290077
                                                                        07300077
1/*-------------------------------------------------------------------*/07320077
 /***    LAUFPROTOKOLL DRUCKEN                                      ***/07330077
 /*-------------------------------------------------------------------*/07340077
   Z_TAB(1).TEXT  = 'ANZAHL GELESENE SAETZE CEOEI               : ';    07350077
   Z_TAB(2).TEXT  = '  DAVON UEBERLESEN SOFTWARE                : ';    07360077
   Z_TAB(3).TEXT  = '  DAVON VERARBEITET HARDWARE               : ';    07370077
   Z_TAB(4).TEXT  = '        STATUS 3/4                         : ';    07380077
   Z_TAB(5).TEXT  = '        STATUS 0                           : ';    07390077
   Z_TAB(6).TEXT  = '          DAVON SERIALIZED                 : ';    07400077
   Z_TAB(7).TEXT  = 'ANZAHL SAETZE GELESEN T110 EXTRAKT OLD     : ';    07410077
   Z_TAB(8).TEXT  = 'ANZAHL TOS ST. 3/4 IN T110 EXTR. VORHANDEN : ';    07420077
   Z_TAB(9).TEXT  = 'ANZAHL TOS ST. 3/4 NICHT IN T110 EXTRAKT   : ';    07430077
   Z_TAB(10).TEXT = 'AUSGABE AUF HW PRODUCT FILE                : ';    07440077
   Z_TAB(11).TEXT = '        AUF HW STATUS FILE                 : ';    07450077
   Z_TAB(12).TEXT = '        AUF OU/HW PRODUCT FILE             : ';    07460077
   Z_TAB(13).TEXT = '        AUF HW/CUSTOMER FILE               : ';    07470077
   Z_TAB(14).TEXT = '        AUF HW SUPPLY CONTRACT FILE        : ';    07480077
   Z_TAB(15).TEXT = '        AUF HW PO IN ORDER FILE            : ';    07490077
   Z_TAB(16).TEXT = '        AUF REALIZATION OF HW PO FILE      : ';    07500077
   Z_TAB(17).TEXT = '        AUF MODIF. INFO HW PROD. FILE      : ';    07510077
   Z_TAB(18).TEXT = 'ANZAHL AUSGEGEBENE PICD0 SAETZE            : ';    07520077
   Z_TAB(19).TEXT = 'ANZ. MASCH.SAETZE ZU SERIAL. ORDERS AUF OEI: ';    07530077
   /* Z_TAB(20).TEXT = SIEHE SUG102M */                                 07540077
   /* Z_TAB(21).TEXT = SIEHE SUG102M */                                 07550077
   /* Z_TAB(22).TEXT = SIEHE SUG102M */                                 07560077
   /* Z_TAB(23).TEXT = SIEHE SUG102M */                                 07570077
   /* Z_TAB(24).TEXT = SIEHE SUG102M */                                 07580077
                                                                        07590077
                                                                        07600077
   DO I = 1 TO Z_TAB_ANZ;                                               07610077
      PROTO_Z.ANZAHL = Z_TAB(I).ANZ;                                    07620077
      PROTO_Z.TEXT   = Z_TAB(I).TEXT;                                   07630077
      WRITE FILE (PROTOK) FROM (PROTO_Z);                               07640077
   END;                                                                 07650077
                                                                        07660077
1/*-------------------------------------------------------------------*/07670077
 /***        I N T E R N E   P R O Z E D U R E N                    ***/07680077
 /*-------------------------------------------------------------------*/07690077
                                                                        07700077
-/*-------------------------------------------------------------------*/07710077
 /***    LESEN CEOEI, UEBERLESEN SOFTWARE SAETZE (PICD=4,5,6)       ***/07720077
 /*-------------------------------------------------------------------*/07730077
 READ_CEOEI: PROC;                                                      07740077
                                                                        07750077
   SATZ_OK = '0'B;                                                      07760077
   DO UNTIL(SATZ_OK | EOF_OEI);                                         07770077
                                                                        07780077
      READ FILE (CEOEI) SET (OEIPTR);                                   07790077
                                                                        07800077
      IF ¬EOF_OEI                                                       07810077
      THEN DO;                                                          07820077
                                                                        07830077
         OEI_TOS = OEISTRU.TYPE || OEISTRU.OR ||                        07840077
                           '00' || OEISTRU.SERL;                        07850077
                                                                        07860077
         IF OEI_TOS < PREV_TOS                     /*SORTIERUNG FALSCH*/07870077
         THEN DO;                                                       07880077
            PUT SKIP EDIT ('SORTFEHLER IN CEOEI')(A);                   07890077
            PUT SKIP EDIT ('PREVIOUS TOS = ',PREV_TOS)(A);              07900077
            PUT SKIP EDIT ('CURRENT TOS  = ',OEI_TOS)(A);               07910077
            SIGNAL ERROR;                                               07920077
         END;                                                           07930077
                                                                        07940077
         Z_TAB(1).ANZ = Z_TAB(1).ANZ + 1;          /* OEI REC. GELESEN*/07950077
                                                                        07960077
         ZPICD = SUBSTR(OEISTRU.PICD,2,1);                              07970077
         IF INDEX('4,5,6',ZPICD) > 0                    /* SOFTWARE   */07980077
           THEN Z_TAB(2).ANZ = Z_TAB(2).ANZ + 1;        /* UEBERLESEN */07990077
                                                                        08000077
           ELSE DO;                                                     08010077
              SATZ_OK = '1'B;                           /* HARDWARE   */08020077
              PREV_TOS = OEI_TOS;                       /* VERARBEITEN*/08030077
              Z_TAB(3).ANZ = Z_TAB(3).ANZ + 1;                          08040077
           END;                               /* END PICD¬=4,5,6 (HW) */08050077
      END;                                               /* END ¬ EOF */08060077
   END;                                   /*END DO UNTIL SATZ_OK | EOF*/08070077
 END READ_CEOEI;                                                        08080077
                                                                        08090077
1/*-------------------------------------------------------------------*/08100077
 /***    FORMATIEREN/AUSGEBEN HEADER FUER ALLE FILES                ***/08110077
 /***    FORMATIEREN ALLGEMEINEN DATENTEIL FUER ALLE FILES          ***/08120077
 /*-------------------------------------------------------------------*/08130077
 FORMATIEREN: PROC;                                                     08140077
                                                                        08150077
   HEADER = '';                                   /*FORMATIEREN HEADER*/08160077
   HEADER.REC_TYPE         = '01';                                      08170077
   HEADER.SOURCE_INDICATOR = 'S';                                       08180077
   HEADER.TIMESTAMP = INT_AREA.SYSTEM_DATE || '.' || TIME;              08190077
                                                                        08200077
   HW_PRODUCT_REC = '';                             /*SCHREIBEN HEADER*/08210077
   HEAD_HW_PRODUCT = HEADER, BY NAME;               /*FILES NEU       */08220077
                                                        /* SOC PCR228*/ 08230077
   HEAD_HW_PRODUCT.FILE_ID = 'RCBB'||INVSRCE||'0';                      08240077
   WRITE FILE (RCBBCA0) FROM (HW_PRODUCT_REC);                          08250077
                                                                        08260077
   HW_STATUS_REC = '';                                                  08270077
   HEAD_HW_STATUS = HEADER, BY NAME;                                    08280077
   HEAD_HW_STATUS.FILE_ID = 'RCBB'||INVSRCE||'2';                       08290077
   WRITE FILE (RCBBCA2) FROM (HW_STATUS_REC);                           08300077
                                                                        08310077
   OU_HW_REC = '';                                                      08320077
   HEAD_OU_HW = HEADER, BY NAME;                                        08330077
   HEAD_OU_HW.FILE_ID = 'RCBB'||INVSRCE||'3';                           08340077
   WRITE FILE (RCBBCA3) FROM (OU_HW_REC);                               08350077
                                                                        08360077
   HW_CUST_REC = '';                                                    08370077
   HEAD_HW_CUST = HEADER, BY NAME;                                      08380077
   HEAD_HW_CUST.FILE_ID = 'RCBB'||INVSRCE||'4';                         08390077
   WRITE FILE (RCBBCA4) FROM (HW_CUST_REC);                             08400077
                                                                        08410077
   HW_SUPPLY_REC = '';                                                  08420077
   HEAD_HW_SUPPLY = HEADER, BY NAME;                                    08430077
   HEAD_HW_SUPPLY.FILE_ID = 'RCBB'||INVSRCE||'5';                       08440077
   WRITE FILE (RCBBCA5) FROM (HW_SUPPLY_REC);                           08450077
                                                                        08460077
   HW_IN_ORD_REC = '';                                                  08470077
   HEAD_HW_IN_ORD = HEADER, BY NAME;                                    08480077
   HEAD_HW_IN_ORD.FILE_ID = 'RCBB'||INVSRCE||'7';                       08490077
   WRITE FILE (RCBBCA7) FROM (HW_IN_ORD_REC);                           08500077
                                                                        08510077
   HW_REAL_REC = '';                                                    08520077
   HEAD_HW_REAL = HEADER, BY NAME;                                      08530077
   HEAD_HW_REAL.FILE_ID = 'RCBB'||INVSRCE||'8';                         08540077
   WRITE FILE (RCBBCA8) FROM (HW_REAL_REC);                             08550077
                                                                        08560077
   HW_MOD_REC = '';                                                     08570077
   HEAD_HW_MOD = HEADER, BY NAME;                                       08580077
   HEAD_HW_MOD.FILE_ID = 'RCBB'||INVSRCE||'B';                          08590077
   WRITE FILE (RCBBCAB) FROM (HW_MOD_REC);                              08600077
                                                                        08610077
                                                        /* EOC PCR228*/ 08620077
                                                                        08630077
   DATAREC_PTR = ADDR(DATAREC);                                         08640077
   DATAREC.REC_TYPE = '02';            /* FORMATIEREN ALLG. DATENTEIL */08650077
   DATAREC.CTRYNO   = '724';                                            08660077
   DATAREC.PGR_TYPE = 'A01';                                            08670077
   DATAREC.RUN_DATE = INT_AREA.RUN_DATE;                                08680077
                                                                        08690077
 END FORMATIEREN;                                                       08700077
                                                                        08710077
 /*-------------------------------------------------------------------*/08720077
 /***    LESEN T110 EXTRAKT OLD                                     ***/08730077
 /*-------------------------------------------------------------------*/08740077
 READ_T110OLD: PROC;                                                    08750077
                                                                        08760077
   READ FILE (T110OLD) INTO (T110_STRU);                                08770077
                                                                        08780077
   IF FIRST_T110 = '1'B                     /*1. SATZ MUSS HEADER SEIN*/08790077
      THEN DO;                                                          08800077
         SELECT;                                                        08810077
                                                                        08820077
            WHEN (EOF_T110)                                      /*EOF*/08830077
             DO;                                                        08840077
               PUT SKIP EDIT                                            08850077
                  ('T110 EXTRAKT ENTHAELT KEINE DATEN')                 08860077
                  (A);                                                  08870077
               SIGNAL ERROR;                                            08880077
             END;                                                       08890077
                                                                        08900077
            WHEN (T110_H.REC_TYPE ¬= '01')           /*FALSCHE SATZART*/08910077
             DO;                                                        08920077
               PUT SKIP EDIT                                            08930077
                  ('T110 EXTRAKT - RECORD_TYPE ',                       08940077
                   'IN HEADER NICHT 01')(A);                            08950077
               SIGNAL ERROR;                                            08960077
             END;                                                       08970077
                                                                        08980077
            WHEN (T110_H.FILE_ID ¬= 'RCBBCB2')       /*FALSCHE FILE_ID*/08990077
             DO;                                                        09000077
               PUT SKIP EDIT                                            09010077
                  ('T110 EXTRAKT - FILE ID ',                           09020077
                   'NICHT RCBBCB2')(A);                                 09030077
               SIGNAL ERROR;                                            09040077
             END;                                                       09050077
                                                                        09060077
            WHEN (T110_H.TIMESTAMP ¬= RCB024_T110.TIME_STAMP)           09070077
             DO;                                                        09080077
               PUT SKIP EDIT                                            09090077
                  ('TIMESTAMP UNTERSCHIEDLICH')(A);                     09100077
               PUT SKIP EDIT                                            09110077
                  ('IN T110 EXTRAKT:     ',T110_H.TIMESTAMP)(A);        09120077
               PUT SKIP EDIT                                            09130077
                  ('IN RCB024 PARAMETER: ',RCB024_T110.TIME_STAMP)(A);  09140077
               SIGNAL ERROR;                                            09150077
             END;                                                       09160077
                                                                        09170077
            OTHER FIRST_T110 = '0'B;                       /*HEADER OK*/09180077
         END;                                             /*END SELECT*/09190077
      END;                                                /*END 1.SATZ*/09200077
                                                                        09210077
                         /*VERARBEITEN ALLER SAETZE, ABBRUCH, WENN    */09220077
                         /*SATZART FALSCH, WENN ANZAHL RECORDS NICHT  */09230077
      ELSE DO;           /*STIMMT ODER WENN TRAILER NICHT LETZTER SATZ*/09240077
         SELECT;                                                        09250077
                                                                        09260077
            WHEN (¬EOF_T110 & ¬TRAILER_VERARB)                          09270077
             DO;                                                        09280077
                                                                        09290077
               SELECT (T110.REC_TYPE);                                  09300077
                                                                        09310077
                  WHEN ('02')                              /*DATENSATZ*/09320077
                   DO;                                                  09330077
                     T110_TOS = T110.DATA.PRODUCT_TYPE    ||            09340077
                                T110.DATA.ORIGIN          ||            09350077
                                T110.DATA.SEQUENCE_NUMBER;              09360077
                     Z_TAB(7).ANZ = Z_TAB(7).ANZ + 1;                   09370077
                                                                        09380077
                     HASH_FIELD = SUBSTR(T110.DATA.SEQUENCE_NUMBER,3,4);09390077
                     CALL RCB018M (HASH_FIELD,                          09400077
                                   HASH_T110,              /*RECHNEN  */09410077
                                   PTR_INT_AREA);          /*HASH TOT.*/09420077
                   END;                                                 09430077
                                                                        09440077
                  WHEN ('99')                       /*TRAILER, PRUEFEN*/09450077
                   DO;                              /*ANZAHL RECORDS  */09460077
                                                    /*U. HASH TOTALS  */09470077
                     SELECT;                                            09480077
                                                                        09490077
                        WHEN (Z_TAB(7).ANZ ¬= T110_T.CNT_RECS)          09500077
                         DO;                                            09510077
                           PUT SKIP EDIT                                09520077
                              ('ANZAHL SAETZE UNTERSCHIEDLICH')(A);     09530077
                           PUT SKIP EDIT                                09540077
                              ('ANZAHL IN TRAILER T110 EXTRAKT:    ',   09550077
                                T110_T.CNT_RECS)(A,P'(8)Z9');           09560077
                           PUT SKIP EDIT                                09570077
                              ('TATSAECHL. ANZAHL IN T110 EXTRAKT: ',   09580077
                                Z_TAB(7).ANZ)(A,P'(8)Z9');              09590077
                           SIGNAL ERROR;                                09600077
                         END;                                           09610077
                                                                        09620077
                        WHEN (HASH_T110 ¬= RCB024_T110.HASH_TOTAL)      09630077
                         DO;                                            09640077
                           PUT SKIP EDIT                                09650077
                              ('HASH TOTALS FALSCH ')(A);               09660077
                           PUT SKIP EDIT                                09670077
                              ('IN RCB024 PARAMETER:       ',           09680077
                                RCB024_T110.HASH_TOTAL)                 09690077
                              (A,P'(14)Z9');                            09700077
                           PUT SKIP EDIT                                09710077
                              ('ERRECHNET F. T110 EXTRAKT: ',HASH_T110) 09720077
                              (A,P'(14)Z9');                            09730077
                           SIGNAL ERROR;                                09740077
                         END;                                           09750077
                                                                        09760077
                        OTHER TRAILER_VERARB = '1'B;                    09770077
                     END;                                 /*END SELECT*/09780077
                   END;                                   /*END '99'  */09790077
                                                                        09800077
                  OTHER DO;                                             09810077
                     PUT SKIP EDIT ('FALSCHE SATZART ',T110.REC_TYPE,   09820077
                                    ' IN T110 EXTRAKT')(A);             09830077
                     SIGNAL ERROR;                                      09840077
                  END;                                                  09850077
               END;                              /*END SELECT REC_TYPE*/09860077
             END;                     /*END TRAILER NOCH NICHT VERARB.*/09870077
                                                                        09880077
            WHEN (¬EOF_T110 & TRAILER_VERARB)                           09890077
             DO;                                                        09900077
               PUT SKIP EDIT                                            09910077
                  ('T110 EXTRAKT - TRAILER IST NICHT LETZTER SATZ')(A); 09920077
               SIGNAL ERROR;                                            09930077
             END;                                                       09940077
            OTHER;                                                      09950077
         END;                                             /*END SELECT*/09960077
      END;                                               /*END ¬1.SATZ*/09970077
 END READ_T110OLD;                                                      09980077
                                                                        09990077
-/*-------------------------------------------------------------------*/10000077
 /***    FORMATIEREN/AUSGEBEN TRAILER FUER ALLE FILES               ***/10010077
 /*-------------------------------------------------------------------*/10020077
 FORMAT_TRAILER: PROC;                                                  10030077
                                                                        10040077
   HW_PRODUCT_REC = '';                                                 10050077
   TRAIL_HW_PRODUCT.REC_TYPE = '99';                                    10060077
   TRAIL_HW_PRODUCT.CNT_RECS = Z_TAB(10).ANZ;                           10070077
   WRITE FILE (RCBBCA0) FROM (HW_PRODUCT_REC);                          10080077
                                                                        10090077
   HW_STATUS_REC = '';                                                  10100077
   TRAIL_HW_STATUS.REC_TYPE = '99';                                     10110077
   TRAIL_HW_STATUS.CNT_RECS = Z_TAB(11).ANZ;                            10120077
   WRITE FILE (RCBBCA2) FROM (HW_STATUS_REC);                           10130077
                                                                        10140077
   OU_HW_REC = '';                                                      10150077
   TRAIL_OU_HW.REC_TYPE = '99';                                         10160077
   TRAIL_OU_HW.CNT_RECS = Z_TAB(12).ANZ;                                10170077
   WRITE FILE (RCBBCA3) FROM (OU_HW_REC);                               10180077
                                                                        10190077
   HW_CUST_REC = '';                                                    10200077
   TRAIL_HW_CUST.REC_TYPE = '99';                                       10210077
   TRAIL_HW_CUST.CNT_RECS = Z_TAB(13).ANZ;                              10220077
   WRITE FILE (RCBBCA4) FROM (HW_CUST_REC);                             10230077
                                                                        10240077
   HW_SUPPLY_REC = '';                                                  10250077
   TRAIL_HW_SUPPLY.REC_TYPE = '99';                                     10260077
   TRAIL_HW_SUPPLY.CNT_RECS = Z_TAB(14).ANZ;                            10270077
   WRITE FILE (RCBBCA5) FROM (HW_SUPPLY_REC);                           10280077
                                                                        10290077
   HW_IN_ORD_REC = '';                                                  10300077
   TRAIL_HW_IN_ORD.REC_TYPE = '99';                                     10310077
   TRAIL_HW_IN_ORD.CNT_RECS = Z_TAB(15).ANZ;                            10320077
   WRITE FILE (RCBBCA7) FROM (HW_IN_ORD_REC);                           10330077
                                                                        10340077
   HW_REAL_REC = '';                                                    10350077
   TRAIL_HW_REAL.REC_TYPE = '99';                                       10360077
   TRAIL_HW_REAL.CNT_RECS = Z_TAB(16).ANZ;                              10370077
   WRITE FILE (RCBBCA8) FROM (HW_REAL_REC);                             10380077
                                                                        10390077
   HW_MOD_REC = '';                                                     10400077
   TRAIL_HW_MOD.REC_TYPE = '99';                                        10410077
   TRAIL_HW_MOD.CNT_RECS = Z_TAB(17).ANZ;                               10420077
   WRITE FILE (RCBBCAB) FROM (HW_MOD_REC);                              10430077
                                                                        10440077
 END FORMAT_TRAILER;                                                    10450077
                                                                        10460077
-/*-------------------------------------------------------------------*/10470077
 /***    SPEICHERN HASH TOTALS PARAM. RCB024 AUF PARAMETER TABLE    ***/10480077
 /*-------------------------------------------------------------------*/10490077
 SAVE_HASH_TOTALS : PROC;                                               10500077
                                                                        10510077
   TB_RCBV500              = '';               /* INIT TABLESTRUCTURE */10520077
   TB_RCBV500_I            = '';                                        10530077
   RCB024_PARM.NUMBER      = 'RCB024';                                  10540077
   RCB024_PARM.PROC_ID     = 'US03';                                    10550077
   RCB024_PARM.CTRYNO      = '724';                                     10560077
   RCB024_PARM.SEQ_NUMBER  = '01';                                      10570077
   RCB024_PARM.TIME_STAMP  = HEADER.TIMESTAMP;                          10580077
   RCB024_PARM.LENGTH_PARM = CSTG (RCB024_PARM.TIME_STAMP) +            10590077
                             CSTG (RCB024_PARM.HASH_TOTAL);             10600077
                                                                        10610077
                                                        /* SOC PCR228*/ 10620077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'0';                       10630077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCA0;                         10640077
   CALL UPD_RCB024;                                                     10650077
                                                                        10660077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'2';                       10670077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCA2;                         10680077
   CALL UPD_RCB024;                                                     10690077
                                                                        10700077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'3';                       10710077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCA3;                         10720077
   CALL UPD_RCB024;                                                     10730077
                                                                        10740077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'4';                       10750077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCA4;                         10760077
   CALL UPD_RCB024;                                                     10770077
                                                                        10780077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'5';                       10790077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCA5;                         10800077
   CALL UPD_RCB024;                                                     10810077
                                                                        10820077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'7';                       10830077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCA7;                         10840077
   CALL UPD_RCB024;                                                     10850077
                                                                        10860077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'8';                       10870077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCA8;                         10880077
   CALL UPD_RCB024;                                                     10890077
                                                                        10900077
   RCB024_PARM.FILE_NAME  = 'RCBB'||INVSRCE||'B';                       10910077
   RCB024_PARM.HASH_TOTAL = HASH_TOTAL.RCBBCAB;                         10920077
                                                        /* EOC PCR228*/ 10930077
   CALL UPD_RCB024;                                                     10940077
                                                                        10950077
 END SAVE_HASH_TOTALS;                                                  10960077
                                                                        10970077
-/*-------------------------------------------------------------------*/10980077
 /***    UPDATE PARAMETER RCB024 MIT HASH TOTALS                    ***/10990077
 /*-------------------------------------------------------------------*/11000077
 UPD_RCB024 : PROC;                                                     11010077
                                    /* UPDATE PARAMETER RCB024    */    11020077
   CALL RCBG50M (ADDR(TB_RCBV500),                                      11040077
                 ADDR(TB_RCBV500_I),                                    11050077
                 PTR_RETURN_AREA,                                       11060077
                 PTR_INT_AREA);                                         11070077
   SELECT(RETURN_AREA.RETURN_CODE);                                     11080077
   WHEN (0);                                                            11090077
   WHEN (4)                          /* WHEN NOT FOUND THEN INSERT  */  11100077
     DO;                                                                11110077
       CALL RCBF50M (ADDR(TB_RCBV500),                                  11130077
                     ADDR(TB_RCBV500_I),                                11140077
                     PTR_RETURN_AREA,                                   11150077
                     PTR_INT_AREA);                                     11160077
       SELECT(RETURN_AREA.RETURN_CODE);                                 11170077
       WHEN (0);                                                        11180077
       OTHERWISE                                                        11190077
         DO;                                                            11200077
           CALL RCB024_ERROR  (ADDR (RETURN_AREA.RETURN_SQL),           11210077
                               'DB2',                                   11220077
                               '#002');                                 11230077
         END;                                                           11240077
       END;                                                             11250077
     END;                                                               11260077
   OTHERWISE                                                            11270077
     DO;                                                                11280077
       CALL RCB024_ERROR  (ADDR (RETURN_AREA.RETURN_SQL),               11290077
                           'DB2',                                       11300077
                           '#003');                                     11310077
     END;                                                               11320077
   END;                                                                 11330077
 END UPD_RCB024;                                                        11340077
                                                                        11350077
-/*-------------------------------------------------------------------*/11360077
 /***    AUSGABE FEHLERNACHRICHT MIT COMMON ERROR ROUTINE           ***/11370077
 /*-------------------------------------------------------------------*/11380077
 RCB024_ERROR: PROC     (PTR_ERROR,                                     11390077
                         ERR_TYPE,                                      11400077
                         CALL_ID);                                      11410077
 DCL PTR_ERROR    PTR;                                                  11420077
 DCL ERR_TYPE     CHAR(8);                                              11430077
 DCL CALL_ID      CHAR(4);                                              11440077
0INT_AREA.PTR_ERROR      = PTR_ERROR;                                   11450077
 INT_AREA.ERR_TYPE       = ERR_TYPE;                                    11460077
 INT_AREA.CALL_ID        = CALL_ID;                                     11470077
0CALL RCB0E1M (PTR_INT_AREA);                                           11480077
0END RCB024_ERROR;                                                      11490077
                                                        /* SOC PCR228*/ 11500077
1SUG100M_RSSPRODUCT_WANTED: PROC (XTYPEMOD) RETURNS (BIT(1));           11510077
 /*******************************************************************/  11520077
 /* FIND OUT WHETHER THE PRODUCT IN THE RECORD IS A PRODUCT THAT    */  11530077
 /* MEETS THE RSS (TRURO) SELECTION CRITERIA                        */  11540077
 /*******************************************************************/  11550077
 DCL   XTYPEMOD       CHAR (7)                                          11570077
 DCL   (J1,K1)        FIXED BIN(31);                                    11580077
 DCL   FOUNDKEY       BIT  (1);                                         11590077
      ;                                                                 11600077
                           /* CODE BELOW REUSED FROM SUG400M         */ 11620077
  FOUNDKEY = '0'B;                                                      11630077
  J1 = TBRSS400MAX + 1B;                         /*SET MAXIMUM       */ 11640077
  K1 = 1B;                                       /*SET MINIMUM       */ 11650077
                                                                        11660077
  DO WHILE(¬FOUNDKEY);                                                  11670077
                                         /* DETERMINE HALFWARY       */ 11680077
     I0 = (J1 + K1) / 10B;               /* (MAX  + MIN    )     / 2 */ 11690077
     IF I0 = K1                                                         11700077
        THEN FOUNDKEY = '1'B;                                           11710077
        ELSE IF TB_T400RSS.PRODMOD(I0) > XTYPEMOD                       11720077
                THEN J1 = I0;                                           11730077
                ELSE IF TB_T400RSS.PRODMOD(I0) < XTYPEMOD               11740077
                        THEN K1 = I0;                                   11750077
                        ELSE FOUNDKEY = '1'B;                           11760077
  END;                                                                  11770077
 RETURN(TB_T400RSS.PRODMOD(I0)= XTYPEMOD);      /* IF FOUND IN TABLE*/  11790077
                                                 /* RETURN "YES"     */ 11800077
 END SUG100M_RSSPRODUCT_WANTED;                                         11820077
1/********************************************************************/ 11830077
 /*  CREATE A TABLE WITH ALL RSS PRODUCTS                            */ 11840077
 /*    1. DETERMINE THE NUMBER OF PRODUCTS                           */ 11850077
 /*    2. ALLOCATE AN INTERNAL TABLE                                 */ 11860077
 /*    3. FILL THE TABLE                                             */ 11870077
 /********************************************************************/ 11880077
0SUG100_RSSTABLE_FILL : PROC;                                           11890077
 DCL WRK_COUNT          FIXED BIN (31);                                 11910077
 DCL RSS_DIVISION       CHAR (2) INIT('71');                            11920077
 DCL SWITCH_END_OF_CURS_RCBV400 BIT(1);                                 11930077
 DCL TRUE                       BIT(1) INIT('1'B);                      11940077
 DCL FALSE                      BIT(1) INIT('0'B);                      11950077
 DCL WRK_TYPENULL       FIXED BIN (15);                                 11960077
 DCL WRK_MODELNULL      FIXED BIN (15);                                 11970077
 DCL TYPE_TAB           CHAR (4);                                       11980077
 DCL MODEL              CHAR (3);                                       11990077
 DCL COUNTRY724         CHAR (3) INIT('724');                           12000077
                                                                        12010077
0 EXEC SQL                                                              12030077
    INCLUDE SQLCA                                                       12040077
    ;                                                                   12050077
 EXEC SQL                                                               12060077
      SELECT COUNT(*)                                                   12070077
      INTO :WRK_COUNT                                                   12080077
      FROM RCBV0400_PO_MOD1                                             12090077
      WHERE COUNTRY_NUMBER  = :COUNTRY724                               12100077
        AND PROD_REVENUE_DIV    = :RSS_DIVISION                         12110077
        AND NOT (MODEL_NUMBER = '' OR MODEL_NUMBER IS NULL);            12120077
  SELECT (SQLCODE);                                                     12130077
  WHEN (0);                                                             12140077
  OTHERWISE                                                             12150077
    DO;                                                                 12160077
      CALL RCB024_ERROR (ADDR (SQLCA),                                  12190077
                          'DB2',                                        12200077
                          '#902');                                      12210077
    END;                                                                12220077
  END;                                                                  12230077
                                                                        12240077
 ALLOCATE TB_T400RSS(WRK_COUNT);                                        12260077
 TB_T400RSS(*)  = '';                                                   12270077
 ITBRSS400MAX =0;                                                       12280077
 EXEC SQL                                                               12300077
   DECLARE CURS_RCBV400 CURSOR FOR                                      12310077
     SELECT PRODUCT_TYPE,MODEL_NUMBER                                   12320077
     FROM   RCBV0400_PO_MOD1                                            12330077
     WHERE COUNTRY_NUMBER  = :COUNTRY724                                12340077
       AND PROD_REVENUE_DIV    = :RSS_DIVISION                          12350077
       AND NOT (MODEL_NUMBER = '' OR MODEL_NUMBER IS NULL)              12360077
     ORDER BY 1,2                                                       12370077
     FOR FETCH ONLY;                                                    12380077
                                                                        12390077
 EXEC SQL                                                               12400077
  OPEN  CURS_RCBV400;                                                   12410077
  SELECT (SQLCODE);                                                     12420077
  WHEN (0)                                                              12430077
    DO;                                                                 12440077
      SWITCH_END_OF_CURS_RCBV400 = FALSE;                               12460077
    END;                                                                12470077
  OTHERWISE                                                             12480077
    DO;                                                                 12490077
      CALL RCB024_ERROR (ADDR (SQLCA),                                  12510077
                          'DB2',                                        12520077
                          '#900');                                      12530077
    END;                                                                12540077
  END;                                                                  12550077
          PUT SKIP  LIST('SQLCODE',SQLCODE,'DEEP36');                   12560077
 CALL SUG100M_FETCH_RSS400;                                             12570077
 DO WHILE (SWITCH_END_OF_CURS_RCBV400 = FALSE);                         12590077
    ITBRSS400MAX = ITBRSS400MAX + 1;                                    12600077
    IF ITBRSS400MAX > WRK_COUNT                                         12610077
    THEN DO;                                                            12620077
       PUT SKIP EDIT                                                    12640077
         ('SUG100M -- LOGIC ERROR -- NUMBER OF RSS PRODUCTS             12650077
           FOUND, EXCEEDS ORIGINAL COUNT =',WRK_COUNT)(A);              12660077
       SIGNAL ERROR;                                                    12670077
       END;                                                             12680077
    TB_T400RSS.PRODMOD(ITBRSS400MAX) = TYPE_TAB||MODEL;                 12700077
    CALL SUG100M_FETCH_RSS400;                                          12710077
    END;                                                                12730077
                                                                        12740077
 EXEC SQL                                                               12750077
  CLOSE CURS_RCBV400;                                                   12760077
                                                                        12770077
  SELECT (SQLCODE);                                                     12780077
  WHEN (0);                                                             12790077
  OTHERWISE                                                             12800077
    DO;                                                                 12810077
      CALL RCB024_ERROR (ADDR (SQLCA),                                  12820077
                          'DB2',                                        12830077
                          '#902');                                      12840077
    END;                                                                12850077
  END;                                                                  12860077
                                                                        12870077
1SUG100M_FETCH_RSS400: PROC;                                            12880077
   EXEC SQL                                                             12900077
     FETCH CURS_RCBV400                                                 12910078
     INTO :TYPE_TAB :WRK_TYPENULL, :MODEL :WRK_MODELNULL                12920077
     ;                                                                  12930077
   SELECT (SQLCODE);                                                    12940077
   WHEN (0);                                                            12950077
   WHEN (+100)                                                          12960077
     DO;                                                                12970077
       SWITCH_END_OF_CURS_RCBV400 = TRUE;                               12990077
     END;                                                               13000077
   OTHERWISE                                                            13010077
     DO;                                                                13020077
       CALL RCB024_ERROR (ADDR (SQLCA),                                 13040077
                           'DB2',                                       13050077
                           '#901');                                     13060077
     END;                                                               13070077
   END;                                                                 13080077
 END SUG100M_FETCH_RSS400;                                              13100077
 END SUG100_RSSTABLE_FILL;                                              13110077
                                                        /* EOC PCR228*/ 13120077
1/*-------------------------------------------------------------------*/13130077
 /***    C L O S E   FILES                                          ***/13140077
 /*-------------------------------------------------------------------*/13150077
   CLOSE FILE (CEOEI);                                                  13160077
   CLOSE FILE (VSAMOEI);                                                13170077
   CLOSE FILE (RCBBCA0);                                                13180077
   CLOSE FILE (RCBBCA2);                                                13190077
   CLOSE FILE (RCBBCA3);                                                13200077
   CLOSE FILE (RCBBCA4);                                                13210077
   CLOSE FILE (RCBBCA5);                                                13220077
   CLOSE FILE (RCBBCA7);                                                13230077
   CLOSE FILE (RCBBCA8);                                                13240077
   CLOSE FILE (RCBBCAB);                                                13250077
   CLOSE FILE (RCB0M10);                                                13260077
   CLOSE FILE (PICD0);                                                  13270077
   CLOSE FILE (PROTOK);                                                 13280077
   CLOSE FILE (RCB0OEM);                                                13290077
   CLOSE FILE (RCBBMC0);                                   /* RQ.410  */13300077
-END SUG100M;                                                           13320077