     /*** SUG310M LOAD CREDIT LIMIT TABLE                             */00019112
 SUG310M:  PROC;                                                        00020000
0              @N5VW0Q: ENTRY;     DCL @SCHFIRST BIT(1)                 00030000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00040000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00050000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00060000
               EDIT    ('SUG310M  VERSION 1996.08.28' ,                 00070000
               ' 17H41.52      WITH VERSION ENTRY',                     00080012
               ' @N5VW0Q',' ')     (SKIP,A,A,A,SKIP,A);                 00090000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00100000
               END;     /* END OF VERSION GROUP      */                 00110012
 DCL KLASS CHAR (30) INIT ('                     ');                    00120000
 /*                                                                   */00130000
 /*             COPYRIGHT  IBM  DEUTSCHLAND  GMBH   1985/1986         */00140000
     /***                                                             */00150000
     /***                                                             */00160000
     /*** CALLED BY:   RCBDP3U   CPPS CUSTOMER EXTRACT USER EXIT      */00170000
     /***                                                             */00180000
     /*** ARGUMENTS:   NONE                                           */00190000
     /***                                                             */00200000
     /*** EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE         */00210000
     /***                                                             */00220000
     /*** CALLS:       NONE                                           */00230000
     /***                                                             */00240000
                                         /* SOC PCEDSP-0454          */ 00241015
     /*** INPUT:       KREDLIM : CREDIT LIMIT FILE FROM NIRO          */00250013
     /***                                                             */00260000
     /*** OUTPUT:      KREDTAB : INTERNAL CREDIT LIMIT TABLE          */00270013
     /***                                                             */00280000
     /*** INCLUDES:    SUG310I : CREDIT LIMIT TABLE                   */00290013
     /***                                                             */00300000
     /*** DEVELOPER:   ANDREAS FISCHER                                */00310013
     /*** DATE:        28.08.1996                                     */00320000
     /*** CHANGE:      28.08.1996                                     */00330013
     /*** DONE BY:     ANDREAS FISCHER                                */00340013
     /*** REASON:      AIM 391: CEDS 2.3                              */00350013
     /***              IMPLEMENTATION OF CREDIT LIMIT TABLE IN U-EXIT */00360013
     /***              RCBDP3U AND RE-CREATION OUT OF                 */00370013
     /***              XSUGCEDS.CPPS.LOKAL.SLIB(SUG311M)              */00380013
                                         /* EOC PCEDSP-0454          */ 00381015
     /***                                                             */00390000
     /*** AMENDED:     24.07.00                                       */00400000
     /*** BY:          H MEDHURST                                     */00410000
     /*** REASON:      COMMON ERROR ROUTINE NOW USED                  */00420000
     /***                                                             */00430000
                                         /* SOC PCEDSP-0454          */ 00431015
     /***   FUNCTIONAL DESCRITPION:                                   */00440013
     /***                                                             */00450000
     /***    READ AND LOAD OF CREDIT LIMIT FILE FROM NIRO             */00460013
     /***    INTO INTERNAL CREDIT LIMIT TABLE.                        */00470013
                                         /* EOC PCEDSP-0454          */ 00471015
     /***                                                             */00480000
     /***                                                             */00490000
 /*  MAINTENANCE LOG :                                               */ 00491014
 /*  ---------------                                                 */ 00492014
 /*  DATE       | WORK-ITEMNO. | DESCRIPTION                         */ 00493014
 /*  --------------------------------------------------------------  */ 00494014
 /*  2016-12-01 | PCEDSP-0454  | REPLACE NON-ENGLISH TEXT IN CEDS    */ 00495014
 /*             |              | CODE                                */ 00496014
 /********************************************************************/ 00497014
1/*-------------------------------------------------------------------*/00500000
0 DEFAULT RANGE (*) STATIC;                                             00510000
-/*-------------------------------------------------------------------*/00520000
 /*                                                                   */00530000
                                         /* SOC PCEDSP-0454          */ 00531015
 /*         D E C L A R A T I O N S                                   */00540013
 /*                                                                   */00550000
 /*-------------------------------------------------------------------*/00560000
-/*-------------------------------------------------------------------*/00570000
 /***   PLIXOPTION   -   O N L Y FOR    M A I N   PROGRAMS          ***/00580013
 /*-------------------------------------------------------------------*/00590000
                                         /* EOC PCEDSP-0454          */ 00591015
-/*-------------------------------------------------------------------*/00600000
 /***   BIT                                                         ***/00610000
 /*-------------------------------------------------------------------*/00620000
   DCL  EOF            BIT(1) INIT ('0'B);                              00630000
1/*-------------------------------------------------------------------*/00640000
 /***   ENTRIES                                                     ***/00650000
 /*-------------------------------------------------------------------*/00660000
 /*DCL  DP60343        EXT ENTRY;               REMOVED 24/07/00 - HM */00670000
1/*-------------------------------------------------------------------*/00680000
 /***   BUILTIN                                                     ***/00690000
 /*-------------------------------------------------------------------*/00700000
   DCL  SUBSTR         BUILTIN;                                         00710000
   DCL  NULL           BUILTIN;                                         00720000
0/*-------------------------------------------------------------------*/00730000
 /***   POINTER                                                     ***/00740000
 /*-------------------------------------------------------------------*/00750000
-/*-------------------------------------------------------------------*/00760000
 /***   FILES                                                       ***/00770000
 /*-------------------------------------------------------------------*/00780000
0/*-------INPUT-------------------------------------------------------*/00790000
   DCL  KREDLIM        FILE RECORD SEQL INPUT;                          00800000
0/*-------OUTPUT------------------------------------------------------*/00810000
   DCL  SYSPRINT       FILE EXTERNAL PRINT;                             00820000
1/*-------------------------------------------------------------------*/00830000
 /***   ARBEITS - VARIABLE                                          ***/00840000
 /*-------------------------------------------------------------------*/00850000
                                         /* SOC PCEDSP-0454          */ 00851015
   DCL  IND            BIN FIXED (31);             /*LOOP COUNTER     */00860013
   DCL  TABEND         BIN FIXED (31) EXTERNAL;    /*TABLE END        */00870013
   DCL  MAXIMUM        FIXED DEC (7);              /*NUMBER TAB POS.  */00880013
                                         /* EOC PCEDSP-0454          */ 00881015
   DCL  ANZ            PIC'(4)Z9';                                      00890000
1/*-------------------------------------------------------------------*/00900000
 /***   INCLUDES                                                    ***/00910000
 /*-------------------------------------------------------------------*/00920000
                                         /* SOC PCEDSP-0454          */ 00921015
   DCL  1 KRED_IN,                    /*ENTRY AREA CREDIT LIMIT TABLE.*/00930013
                                         /* EOC PCEDSP-0454          */ 00931015
          2 TABLENO    CHAR (4),                                        00940000
          2 KRED       CHAR (1),                                        00950000
          2 FILLER     CHAR(49),                                        00960000
          2 BETRAG     PIC'(14)Z9',                                     00970000
          2 REST       CHAR(31);                                        00980000
                                                                        00990000
                                         /* SOC PCEDSP-0454          */ 00991015
   DCL  1 KREDTAB (*) CTL EXTERNAL,                 /*CREDIT LIMIT    */01000013
          % INCLUDE SUG310I;;                                           01010000
                                         /* EOC PCEDSP-0454          */ 01011015
                                                                        01020000
                                         /* SOC PCEDSP-0454          */ 01021015
   DCL  1 SAVETAB (*) CTL,                   /*KREDIT LIM TABSAVE AREA*/01030013
          % INCLUDE SUG310I;;                                           01040000
                                         /* EOC PCEDSP-0454          */ 01041015
                                                                        01050000
1/*-------------------------------------------------------------------*/01060000
                                         /* SOC PCEDSP-0454          */ 01061015
 /***      H E A D E R L I N E S                                    ***/01070013
 /*-------------------------------------------------------------------*/01080000
1/*-------------------------------------------------------------------*/01090000
 /***      PRINT LINES                                              ***/01100013
 /*-------------------------------------------------------------------*/01110000
                                         /* EOC PCEDSP-0454          */ 01111015
1/********************************************************************/ 01120000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01130000
 /********************************************************************/ 01140000
 DCL 1 PARM_INT_AREA          BASED (PTR_INT_AREA),                     01150000
      %INCLUDE (RCBZ01S);;                                              01160000
1/********************************************************************/ 01170000
 /*  PARAMETERS                                                      */ 01180000
 /********************************************************************/ 01190000
 DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 01200000
1/********************************************************************/ 01210000
 /*  EXTERNAL ENTRIES                                                */ 01220000
 /********************************************************************/ 01230000
 DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 01240000
1/*-------------------------------------------------------------------*/01250000
 /***    ON ERROR                                                   ***/01260000
 /*-------------------------------------------------------------------*/01270000
 %INCLUDE (RCB0E0M);                                                    01280000
  END;                                                                  01290000
 /********************************************************************/ 01300000
 /*                                                                  */ 01310000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 01320000
 /* AND CALL THE ERROR ROUTINE:                                      */ 01330000
 /*                                                                  */ 01340000
 /*                                                                  */ 01350000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 01360000
 /*                                                                  */ 01370000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 01380000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 01390000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 01400000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 01410000
 /*                                                                  */ 01420000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 01430000
 /*                                                                  */ 01440000
 /********************************************************************/ 01450000
 /*      ON ERROR BEGIN;                        REMOVED 24/07/00 - HM */01460000
 /*         CLOSE FILE (SYSPRINT);                                    */01470000
 /*         CALL DP60343 ('0310');                                    */01480000
 /*      END;                                                         */01490000
-/*-------------------------------------------------------------------*/01500000
 /***    ON ENDFILE                                                 ***/01510000
 /*-------------------------------------------------------------------*/01520000
   ON ENDFILE (KREDLIM) EOF = '1'B;                                     01530000
-/*-------------------------------------------------------------------*/01540000
 /***    O P E N    FILES                                           ***/01550000
 /*-------------------------------------------------------------------*/01560000
   OPEN FILE (KREDLIM);                                                 01570000
1/*-------------------------------------------------------------------*/01580000
 /*                                                                   */01590000
                                         /* SOC PCEDSP-0454          */ 01591015
 /*      P R O G R A M      -    S T A R T                            */01600013
                                         /* EOC PCEDSP-0454          */ 01601015
 /*                                                                   */01610000
 /*-------------------------------------------------------------------*/01620000
   TABEND  = 0;                                                         01630000
   MAXIMUM = 20;                                                        01640000
   ALLOCATE KREDTAB(MAXIMUM);                                           01650000
                                                                        01660000
   READ FILE (KREDLIM) INTO (KRED_IN);                                  01670000
                                                                        01680000
   DO WHILE (¬EOF);                                                     01690000
                                                                        01700000
      IF KRED_IN.TABLENO = 'T020'                                       01710000
         THEN DO;                                                       01720000
                                                                        01730000
            TABEND = TABEND + 1;                                        01740000
            IF TABEND > MAXIMUM                                         01750000
                                         /* SOC PCEDSP-0454          */ 01751015
               THEN DO;                         /*INCREASE TABLE      */01760013
                                         /* EOC PCEDSP-0454          */ 01761015
                    ALLOCATE SAVETAB(MAXIMUM);                          01770000
                    SAVETAB = KREDTAB;                                  01780000
                    FREE KREDTAB;                                       01790000
                    MAXIMUM = MAXIMUM + 5;                              01800000
                    ALLOCATE KREDTAB(MAXIMUM);                          01810000
                    DO IND = 1 TO (MAXIMUM - 5);                        01820000
                       KREDTAB(IND) = SAVETAB(IND), BY NAME;            01830000
                    END;                                                01840000
                    FREE SAVETAB;                                       01850000
               END;                                                     01860000
                                                                        01870000
            KREDTAB(TABEND).KRED   = KRED_IN.KRED;                      01880000
            KREDTAB(TABEND).BETRAG = KRED_IN.BETRAG;                    01890000
            PUT SKIP EDIT                                               01900000
               ('SUG310M KRED = ',KREDTAB(TABEND).KRED,                 01910000
                ' BETRAG = ',KREDTAB(TABEND).BETRAG)                    01920000
               (A,A,A,P'(12)Z9V,99');                                   01930000
                                                                        01940000
         END;                                       /*END TABLENO=T020*/01950000
                                                                        01960000
      READ FILE (KREDLIM) INTO (KRED_IN);                               01970000
                                                                        01980000
   END;                                            /*END DO WHILE ¬EOF*/01990000
                                                                        02000000
   IF TABEND = 0                                                        02010000
      THEN DO;                                                          02020000
         PUT SKIP EDIT                                                  02030000
                                         /* SOC PCEDSP-0454          */ 02031015
            ('SUG310M CREDIT LIMIT TABLE IS EMPTY           ')(A);      02040013
                                         /* EOC PCEDSP-0454          */ 02041015
         SIGNAL ERROR;                                                  02050000
      END;                                                              02060000
                                                                        02070000
   ANZ = TABEND;                                                        02080000
                                         /* SOC PCEDSP-0454          */ 02081015
   PUT SKIP EDIT ('SUG310M NUMBER POSITIONS IN CREDIT LIMIT TAB: ',ANZ) 02090013
                                         /* EOC PCEDSP-0454          */ 02091015
                 (A,A);                                                 02100000
                                                                        02110000
1/*-------------------------------------------------------------------*/02120000
 /***    C L O S E   FILES                                            */02130000
 /*-------------------------------------------------------------------*/02140000
   CLOSE FILE (KREDLIM);                                                02150000
-END SUG310M;                                                           02160000