     /*** SUG410M - LOAD INTERNAL TABLES WITH DATA FROM DB2 TAB. 0350 */00019419
 SUG410M:  PROC;                                                        00020000
0              @7VMGV6: ENTRY;     DCL @SCHFIRST BIT(1)                 00030000
               STATIC INIT('1'B); IF @SCHFIRST THEN DO;                 00040000
               @SCHFIRST='0'B;        ON  UNDEFINEDFILE                 00050000
               (SYSPRINT) GOTO @END; PUT FILE(SYSPRINT)                 00060000
               EDIT    ('SUG410M  VERSION 1999.03.22' ,                 00070000
               ' 13H16.05      WITH VERSION-ENTRY    ',                 00080019
               ' @7VMGV6',' ')     (SKIP,A,A,A,SKIP,A);                 00090000
               @END: ON UNDEFINEDFILE(SYSPRINT) SYSTEM;                 00100000
               END;     /* END OF VERSION GROUP      */                 00110019
 DCL KLASS CHAR (30) INIT ('IBM INTERNAL USE ONLY');                    00120000
 /*       I  B  M      I N T E R N A L   U S E   O N L Y              */00130000
 /*             COPYRIGHT  IBM  DEUTSCHLAND  GMBH   1985/1986         */00140000
     /***                                                             */00150000
     /***                                                             */00160000
     /*** CALLED BY:   RCBDC1U                                        */00170000
     /***                                                             */00180000
     /*** ARGUMENTS:   NONE                                           */00190000
     /***                                                             */00200000
     /*** EXTERNAL MODULES : - RCB0E1M   COMMON ERROR ROUTINE         */00210000
     /***                                                             */00220000
     /*** CALLS:       NONE                                           */00230000
     /***                                                             */00240000
     /*** INPUT:       RCBBAA4 : FILE FROM DB2 TAB. 350               */00250019
     /***                                                             */00260000
     /*** OUTPUT:      TB_T350: INTERNE TAB. (CUSTOMER NO & OU-CODE)  */00270019
     /***                                                             */00280000
     /*** INCLUDES:            :                                      */00290000
     /***                                                             */00300000
     /*** DEVELOPER:   W. BECHTEL                                     */00310019
     /*** DATE:        10.08.98                                       */00320000
     /***                                                             */00330000
     /*** CHANGE:      22.03.1999                                     */00340019
     /*** BY:          W. BECHTEL                                     */00350019
     /*** REASON:      AIM 429: CEDS 3.0 QF A4 + ALL  PTFS            */00360019
     /***              - FIELD IOAREA_IN_1 LENGTH OF 107 TO 112       */00370019
     /***                INCREASED.                                   */00380019
     /***              - RECOMPILE BEC. OF CHANGED INCLUDES =         */00390019
     /***                RCB350S UND RCB350SI                         */00400000
     /***                                                             */00410000
     /*** AMENDED:     24.07.00                                       */00420000
     /*** BY:          H MEDHURST                                     */00430000
     /*** REASON:      COMMON ERROR ROUTINE NOW USED                  */00440000
     /***                                                             */00450000
     /***   FUNCTIONAL DESCRIPTION:                                   */00460019
     /***                                                             */00470000
     /***    READ FILE FROM DB2 TAB.0350 AND TAKE CUSTOMER NUMBER     */00480019
     /***    AND OU CODE FROM INTERNAL TABLE                          */00490019
     /***                                                             */00500000
     /***                                                             */00510000
1/*-------------------------------------------------------------------*/00520000
0 DEFAULT RANGE (*) STATIC;                                             00530000
-/*-------------------------------------------------------------------*/00540000
 /*                                                                   */00550000
 /*         D E C L A R A T I O N S                                   */00560019
 /*                                                                   */00570000
 /*-------------------------------------------------------------------*/00580000
-/*-------------------------------------------------------------------*/00590000
 /***   PLIXOPTION   -   O N L Y  FOR  M A I N   PROGRAM            ***/00600019
 /*-------------------------------------------------------------------*/00610000
-/*-------------------------------------------------------------------*/00620000
 /***   BIT                                                         ***/00630000
 /*-------------------------------------------------------------------*/00640000
   DCL  EOF_T350       BIT(1) INIT ('0'B);  /* EOF OF  TAB. 350 FILE  */00650019
-/*-------------------------------------------------------------------*/00660000
 /***   ENTRIES                                                     ***/00670000
 /*-------------------------------------------------------------------*/00680000
 /*DCL  DP60343        EXT ENTRY;               REMOVED 24/07/00 - HM */00690000
-/*-------------------------------------------------------------------*/00700000
 /***   BUILTIN                                                     ***/00710000
 /*-------------------------------------------------------------------*/00720000
   DCL  ADDR           BUILTIN;                                         00730000
   DCL  SUBSTR         BUILTIN;                                         00740000
   DCL  NULL           BUILTIN;                                         00750000
0/*-------------------------------------------------------------------*/00760000
 /***   POINTER                                                     ***/00770000
 /*-------------------------------------------------------------------*/00780000
-/*-------------------------------------------------------------------*/00790000
 /***   FILES                                                       ***/00800000
 /*-------------------------------------------------------------------*/00810000
0/*-------INPUT-------------------------------------------------------*/00820000
   DCL  RCBBAA4    FILE                            /* UPSTREAM FILE  */ 00830000
                   RECORD                                               00840000
                   INPUT                                                00850000
                   SEQUENTIAL                                           00860000
                   ENV (FB RECSIZE(112));                               00870000
                                                                        00880000
0/*-------OUTPUT------------------------------------------------------*/00890000
   DCL  SYSPRINT      FILE EXTERNAL PRINT;                              00900000
-/*-------------------------------------------------------------------*/00910000
 /***   ARBEITS - VARIABLE                                          ***/00920000
 /*-------------------------------------------------------------------*/00930000
   DCL  IND           BIN FIXED (31);              /*LOOP COUNTER     */00940019
   DCL  TBENDE        BIN FIXED (31) EXTERNAL;  /*INTERN TAB. COUNTER */00950019
   DCL  MAXIMUM       FIXED DEC (7);               /*POS IN TAB.      */00960019
1/*-------------------------------------------------------------------*/00970000
 /***   INCLUDES                                                    ***/00980019
 /*-------------------------------------------------------------------*/00990000
                                                                        01000000
                                     /*   IOAREA UPSTREAM FILE       */ 01010000
   DCL IOAREA_IN_1    CHAR(112);                                        01020000
                                                                        01030000
   DCL 1 RCBBAFS1_1   BASED(ADDR(IOAREA_IN_1)),                         01040000
          %INCLUDE RCBBAAS1;,                                           01050000
        3 RCB350S,                                                      01060000
          %INCLUDE RCB350S;,                                            01070000
        3 RCB350SI,                                                     01080000
          %INCLUDE RCB350SI;;                                           01090000
                                                                        01100000
1/*-------------------------------------------------------------------*/01110000
 /***   TABLES                                                      ***/01120019
 /*-------------------------------------------------------------------*/01130000
                                                                        01140000
   DCL 1 TB_T350(*) CTL EXTERNAL,        /* CUSTOMER NO & OU-CODE TAB.*/01150019
         2 KDNR   CHAR(08),                                             01160000
         2 OU_CD  CHAR(04);                                             01170000
                                                                        01180000
   DCL 1 TB1_T350(*) CTL LIKE TB_T350; /*CUST. NO. & OU-CODE          */01190019
                                                                        01200000
1/*-------------------------------------------------------------------*/01210000
 /***      H E A D E R L I N E S                                    ***/01220019
 /*-------------------------------------------------------------------*/01230000
1/*-------------------------------------------------------------------*/01240000
 /***      PRINT-LINES                                              ***/01250019
 /*-------------------------------------------------------------------*/01260000
1/********************************************************************/ 01270000
 /* EXTERNAL PARAMETER INTERFACES                                    */ 01280000
 /********************************************************************/ 01290000
 DCL 1 PARM_INT_AREA          BASED (PTR_INT_AREA),                     01300000
      %INCLUDE (RCBZ01S);;                                              01310000
1/********************************************************************/ 01320000
 /*  PARAMETERS                                                      */ 01330000
 /********************************************************************/ 01340000
 DCL PTR_INT_AREA            PTR;          /* INTERFACE AREA         */ 01350000
1/********************************************************************/ 01360000
 /*  EXTERNAL ENTRIES                                                */ 01370000
 /********************************************************************/ 01380000
 DCL RCB0E1M   ENTRY  EXTERNAL;            /* COMMON ERROR ROUTINE   */ 01390000
1/*-------------------------------------------------------------------*/01400000
 /***    ON ERROR                                                   ***/01410000
 /*-------------------------------------------------------------------*/01420000
 %INCLUDE (RCB0E0M);                                                    01430000
  END;                                                                  01440000
 /********************************************************************/ 01450000
 /*                                                                  */ 01460000
 /* IN CASE AN UNEXPECTED ERROR OCCURS FILL THE FOLLOWING VARIABLES  */ 01470000
 /* AND CALL THE ERROR ROUTINE:                                      */ 01480000
 /*                                                                  */ 01490000
 /*                                                                  */ 01500000
 /* FIELD              IN CASE OF: DB2 ERROR --  -- OTHER ERROR --   */ 01510000
 /*                                                                  */ 01520000
 /* PARM_INT_AREA.PTR_ERROR         ADDR (SQLCA)     NULL            */ 01530000
 /* PARM_INT_AREA.ERR_TYPE         'DB2'            'OTHER'          */ 01540000
 /* PARM_INT_AREA.CALL_ID          '#NNN'           '#NNN'           */ 01550000
 /* CALL RCB0E1M (PTR_INT_AREA)                                      */ 01560000
 /*                                                                  */ 01570000
 /* NOTE: NNN CAN BE A NUMBER FROM 001 TO 999                        */ 01580000
 /*                                                                  */ 01590000
 /********************************************************************/ 01600000
 /*      ON ERROR BEGIN;                        REMOVED 24/07/00 - HM */01610000
 /*         CLOSE FILE (SYSPRINT);                                    */01620000
 /*         CALL DP60343 ('0410');                                    */01630000
 /*      END;                                                         */01640000
-/*-------------------------------------------------------------------*/01650000
 /***    ON ENDFILE                                                 ***/01660000
 /*-------------------------------------------------------------------*/01670000
0  ON ENDFILE (RCBBAA4)  EOF_T350   = '1'B;                             01680000
-/*-------------------------------------------------------------------*/01690000
 /***    O P E N    FILES                                           ***/01700000
 /*-------------------------------------------------------------------*/01710000
   OPEN FILE (RCBBAA4);                                                 01720000
1/*-------------------------------------------------------------------*/01730000
 /*                                                                   */01740000
 /*      P R O G R A M      -    S T A R T                            */01750019
 /*                                                                   */01760000
 /*-------------------------------------------------------------------*/01770000
                                                                        01780000
   IND         = 0;                                                     01790000
   TBENDE      = 0;                                                     01800000
   MAXIMUM     = 600000;                                                01810017
   ALLOCATE TB_T350(MAXIMUM);                                           01820000
   TB_T350(*)  = '';                                                    01830000
                                                                        01840000
   READ FILE (RCBBAA4) INTO (IOAREA_IN_1); /* 1. READ TAB. 350 FILE  */ 01850019
                                                                        01860000
   DO WHILE (¬EOF_T350);                                                01870000
      TBENDE = TBENDE + 1;                                              01880000
      IF TBENDE > MAXIMUM                                               01890000
         THEN DO;                                                       01900000
          ALLOCATE TB1_T350(MAXIMUM);                                   01910000
          TB1_T350(*)  = '';                                            01920000
          TB1_T350 = TB_T350;                                           01930000
          FREE TB_T350;                                                 01940000
          MAXIMUM = MAXIMUM + 2000;                                     01950000
          ALLOCATE TB_T350(MAXIMUM);                                    01960000
          DO IND = 1 TO (MAXIMUM - 2000);                               01970000
            TB_T350(IND) = TB1_T350(IND);                               01980000
          END;                                                          01990000
          FREE TB1_T350;                                                02000000
         END;                                                           02010000
                                                                        02020000
   IF RCBBAFS1_1.REC_TYPE = '02'                                        02030000
      THEN                                                              02040000
        DO;                                                             02050000
                                                                        02060000
          TB_T350.KDNR(TBENDE)                                          02070000
          = RCBBAFS1_1.CUSTOMER_NUMBER;                                 02080000
                                                                        02090000
          TB_T350.OU_CD(TBENDE)                                         02100000
 /*       = SUBSTR(RCBBAFS1_1.CU_ENGINEERING_OU,4,4);     PCEDSP-0372*/ 02110015
          = SUBSTR(RCBBAFS1_1.CU_ENGINEERING_OU,1,4);  /* PCEDSP-0372*/ 02111015
                                                                        02120000
        END;                                                            02130000
                                                                        02140000
      READ FILE (RCBBAA4) INTO (IOAREA_IN_1);                           02150000
   END;                                                                 02160000
                                                                        02170000
   IF TBENDE = 0                                                        02180000
      THEN DO;                                                          02190000
      PUT SKIP EDIT('FILE FROM DB2 TAB. 0350 CONTAINS NO DATA    ')(A); 02200019
      SIGNAL ERROR;                                                     02210000
      END;                                                              02220000
1/*-------------------------------------------------------------------*/02230000
 /***    C L O S E   FILES                                            */02240000
 /*-------------------------------------------------------------------*/02250000
   CLOSE FILE (RCBBAA4);                                                02260000
-END SUG410M;                                                           02270000